{
    "LPT: If an entry level job lists \"Sales\" as one of the responsibilities you can safely ignore anything else listed, that will be your job.\nThere are a plague of \"companies\" (fronts) out there that prey on college grads (particularly grads that don't have an immediately applicable non STEM degree) desperate for a job or retail workers that desperately want out of the big box retail store scene. They will list these jobs as being \"Event Coordinators\" or \"Marketing Associates\". It's a lie, you can find these people at stores like Costco trying to sell some useless appliance that no one wants or going door to door trying to sell other appliances that no one wants.\n\nAnd the recruiters that craft these resumes are VERY good at just bending the truth enough that  what is on the job description isn't technically a lie, but any reasonable person's interpretation of the description is nothing like the reality of the position. That's why the title is what it is: if they list sales, that is what you will be doing and nothing else.\n\nAn easy way to avoid this is to google the name of the company you are applying to. Either nothing will come up or they will be associated with other companies that are accused of doing the same thing.\n\nTLDR: Be careful which companies you invest time into when you are applying and interviewing for a job.\n\nEdit: Something that I should have clarified is that I don't have a problem with sales jobs or people that work them. The point is that if the company feels the need to hide what the job is or lie about it on the description, something isn't right.\n\nEdit 2: Thank you for all the awards kind strangers. I think this is the first real post I've put up on Reddit and the fact that it blew up so much is really encouraging.\n\nEdit 3: I've been told that the majority of these types of jobs can be found under the umbrella of two companies named Cydcor and Smart Circle. ": [
        {
            "id": "gxqtg1p",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.53556705",
            "sentiment_compound": 0.9615
        },
        {
            "id": "gxqw18x",
            "score": 6,
            "text": "Sales is one of the most lucrative Career paths.",
            "title_similarity": "0.38263828",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrpgx4",
            "score": -3,
            "text": "Here’s the thing.  Almost everyone really wealthy is in sales.  \n\nYeah, there’s a few oddballs like Elon Musk or Zuckerberg that made it big on pure brainpower and timing, but that ain’t you.\n\nThe higher up you go in any real organization the more sales and networking is important.\n\nSo why not cut your teeth on it selling knives or Credit Cards or some other shitty product while you’re young and living at home.  You will learn WAY more about business, people and yourself than you will earning $8.50 / hr flipping burgers at Wendy’s.\n\nDon’t avoid sales.  Dive in head first and get ****ing good at it.",
            "title_similarity": "0.7714683",
            "sentiment_compound": 0.7566
        },
        {
            "id": "gxrejof",
            "score": 11,
            "text": "The real LPT here is that EVERY job is sales",
            "title_similarity": "0.43988785",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrekgz",
            "score": -2,
            "text": "Real LPT: everything is sales, some jobs are just closer to the revenue than others.",
            "title_similarity": "0.464318",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxr8hal",
            "score": 2,
            "text": "Yep, this is so true. \n\nAnd if the commission is impressive...That isn’t always a good sign either.",
            "title_similarity": "0.36000004",
            "sentiment_compound": 0.8279
        },
        {
            "id": "gxrepzs",
            "score": 3,
            "text": "When I was 18 I left school and like everyone else was looking for a job that would take me.\n\nI applied for 'sales and customer service' role and low and behold it was door to door sales.\n\nI obviously almost didn't do it, but then I thought why not? I had no tangible employable skills and nobody was really hiring. It was long hours and commission only but otherwise the company seemed OK as in they did actually seem to pay their staff. \n\nDid it for 4 months through winter. Am I glad I did it? Yes. Would I do it again? No.\n\nGave me loads of transferrable skills and life experience and set me up well for my next job. Trust me, as an 18 year old being able to say you worked on your feet for 10 hours a day, 6 days a week with rain, ice and snow certainly puts you above the pack. The money was OK but not worth it overall.\n\nSo I wouldn't dismiss it straight away for everyone. For some people it wouldn't work at all of course but as long as the company isn't a scam it might be worth a go for a short while.",
            "title_similarity": "0.70526016",
            "sentiment_compound": 0.9853
        },
        {
            "id": "gxrsoj8",
            "score": 4,
            "text": "Here's to making $400k last year in sales, cheers! :) but yeah be careful with these multilevel marketing scams people.",
            "title_similarity": "0.51026595",
            "sentiment_compound": 0.2124
        },
        {
            "id": "gxrfg9n",
            "score": 7,
            "text": "I ended up doing the costco thing. Had over 100k in sales commission that year and got to travel the country. Don’t knock sales too hard- it’s exhausting but it’s definitely possible to kill it.",
            "title_similarity": "0.5665725",
            "sentiment_compound": -0.714
        },
        {
            "id": "gxsb7m7",
            "score": 0,
            "text": "LPT do a modicum of research for the job you apply for.",
            "title_similarity": "0.37611815",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsxc22",
            "score": 0,
            "text": "If you’re not researching a company that you’re willing to work for, what the fuck are you doing?",
            "title_similarity": "0.5648792",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxv5zq7",
            "score": 0,
            "text": "As someone who makes hiring decision quite often, this really isn’t true.",
            "title_similarity": "0.5058199",
            "sentiment_compound": 0.4728
        },
        {
            "id": "gxrutt0",
            "score": -1,
            "text": "Happened to me with a “sports marketing firm” that “worked closely with (not telling you my city) teams”. \n\nTurns out they wanted me to sell coupons door to door for games and events. ALL of the those people should be executed in the town square",
            "title_similarity": "0.6922096",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt369q",
            "score": -1,
            "text": "ITT: people who had an experience once",
            "title_similarity": "0.106573105",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt66wc",
            "score": -1,
            "text": "Better LPT: there’s literally nothing wrong with working in sales, and you can make bank if you’re not a lazy bum.",
            "title_similarity": "0.5032635",
            "sentiment_compound": 0.7625
        },
        {
            "id": "gxqz50m",
            "score": 82,
            "text": "Just because you'll have a sales job does not mean you'll be doing the traditional cold calling phone sales that most people think of when they think of 'sales.'\n\nMy official title is 'inside sales' and I actually do very little traditional sales. I mainly support our team of outside salespeople by sending out quotes and orders. Very little if any phone time every day.",
            "title_similarity": "0.62201893",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxrebak",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.14069638"
        },
        {
            "id": "gxreus3",
            "score": 2,
            "text": "Someone else has probably said it too but \"marketing\" is another give away and is likely a MLM operation to boot.",
            "title_similarity": "0.5859342",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gxrgwwm",
            "score": -2,
            "text": "This just isn't true. Why is it getting up votes?",
            "title_similarity": "0.4079985",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gxrp54z",
            "score": -2,
            "text": "As long as the pay is good, what's wrong with sales?",
            "title_similarity": "0.40079913",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxs1w4t",
            "score": -2,
            "text": "Sales is a function of almost any job.",
            "title_similarity": "0.3208682",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrh3zc",
            "score": 80,
            "text": "I do sales and recruiting for a living. This is all true.\n\nThe only advice I would give is just that a job description is a wish list.\n\nI talk to hiring managers all day and they tell me they want all of these things and I tell them they are basically looking for a house with an ocean view in San Diego and their budget is $500k.\n\nWhat is important to you? The beach view? The house? The land?\n\nI'll let you land and the big house in Kentucky for your budget but you are going to have to give up your beach view.\n\nThe point I'm trying to get across is just apply for anything you want. It's an employee market right now. You could just stumble I to your dream job on accident because no one wants to leave a job during uncertain times and employers are struggling to fill positions.\n\nEDIT: For anyone looking to get into sales, I can tell you that it is insanley stressful, but I can make as much money as I want and work however much I want to to control my income.\n\nAlso... To the tune of this post, if I know what I am selling and what a customer needs, I can sell anything, talk a cat off a fish wagon, sell an eskimo ice, twice, and make it sound nice.\n\nSales requires a certain personality. When you smell blood in the water, you just get it done. It is potentially a very lucrative career path if you have the grit for it.",
            "title_similarity": "0.6075624",
            "sentiment_compound": -0.7691
        },
        {
            "id": "gxr4af3",
            "score": 23,
            "text": "Yeah man.  Same with business development titles.  It’s sales.  Quitting my sales job in 2 months once I finish my certifications to qualify me for IT jobs.  See ya sales, hello IT field!",
            "title_similarity": "0.58669555",
            "sentiment_compound": 0.3595
        },
        {
            "id": "gxrg8ti",
            "score": 3,
            "text": "This sort of thing really ought to be illegal as should listing job ads without a salary or salary range.",
            "title_similarity": "0.6106135",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxrrs6s",
            "score": 3,
            "text": "Easiest way to get unlimited vacation days, flexible hours and make a ton of money is uncapped commission only sales positions",
            "title_similarity": "0.45300567",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxrf6n3",
            "score": 4,
            "text": "I used to be against sales positions for my entire life till I tried it and actually took on the challenge. Never saw so much growth personally anywhere else I worked. Once you get over the rejection it's easy.\n\nHowever I agree with OP on job postings. I learned if you can look at a posting and still not know exactly what it is that's a problem. It's a viscous cycle for the companies that don't rep them selves transparently. That's why in my postings I straight up say \"it's sales yo\" (in the most professional manner) and even in interviews I ask what are their feelings toward sales cause some people really can't get passed that mental block. I don't have time to revisit it daily to sell them on their own job choice.\n\nTLDR: Transparent posting is king cause its not worth time if they take the position and aren't on board with the foundation of it.",
            "title_similarity": "0.73620766",
            "sentiment_compound": -0.0741
        },
        {
            "id": "gxrr5s7",
            "score": 4,
            "text": "Never ever do sales, you'll be happier and live longer.",
            "title_similarity": "0.38037854",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxrsh79",
            "score": 5,
            "text": "I'd rather daytrade crypto till I fucking die than to work even a single day in the \"sales\" department.",
            "title_similarity": "0.67458045",
            "sentiment_compound": -0.6361
        },
        {
            "id": "gxqzvt5",
            "score": 208,
            "text": "I worked at RadioShack during my first 2 years of college. It wasn't just your typical retail job as it was highly commission based. The training there gave me few things that hold to be true in every career, no matter where you go.\n\nAfter that, I worked with a marketing firm, where I was the in-store (Best Buy, Office Depot, Staples, Costco, Walmart) representation for the company. This also taught me some valuable lessons. \n\nThat being said, sales and marketing jobs are not for everyone. Some excel at it, some don't, like every other job. I graduated with an accounting degree and I hate it. I'm in a STEM position now and love it. An investment banker is also a sales person, just their product is different. \n\nIf you are certain you don't want a sales job, avoid it. If you are desperate in need of a job, take it and continue searching. You shouldn't skip a job and become homeless or in debt just because it's not something you see doing long term. \n\nYou owe 0 loyalty to any employer as they owe 0 loyalty to you.",
            "title_similarity": "0.70483184",
            "sentiment_compound": 0.9359
        },
        {
            "id": "gxrf8rg",
            "score": 7,
            "text": "I just left a job disguised as \"customer service debt collection\". What really happened was they scour the internet with apps like IDCore to look up your social security number then track down any recent info like Facebook to find up to date information. They bought debt from cash advance apps then called people to get them to pay THEM for the revenue, not the original loaner. It was a shitshow and I quit after 2 days. Completely unorganized. They didn't want people from \"chop shop debt collection agencies\" when they were one. I was promised a check for 2 days work and still haven't seen it in the mail yet. Good thing I didn't stay. Compattia Roccia was it's name and they're still up on Linked In and have Craigslist ads.",
            "title_similarity": "0.7396635",
            "sentiment_compound": 0.2302
        },
        {
            "id": "gxrfn9v",
            "score": 8,
            "text": "Even for higher end jobs in marketing you see that shit pop up more and more. Basically marketing director jobs now include some sales related tasks. Often, the title of the offer is \"Marketing director\" but in the description it says \"Marketing and sales director\".\n\nAnd don't get me started on marketing director job offers that contain tasks such as: managing the company's social medias, creating and implementing adword campaigns, writing newsletters etc.\n\nBasically these companies want to eliminate one or more entry level position and have the marketing director take care of everything. Which is a recipe for disaster since you cant do all this in a 40 hrs week. So you have no choice but to half ass the whole thing or work 60 hours a week.",
            "title_similarity": "0.85171765",
            "sentiment_compound": -0.8536
        },
        {
            "id": "gxrfsvb",
            "score": 28,
            "text": "[deleted]",
            "title_similarity": "0.14069638"
        },
        {
            "id": "gxr7113",
            "score": 80,
            "text": "“Sports minded” and “self motivated” sales are also both code for MLM sales “jobs.”",
            "title_similarity": "0.5335679",
            "sentiment_compound": -0.4824
        },
        {
            "id": "gxrava9",
            "score": 30,
            "text": "Same vein if it seems like they are hunting for...any college graduate pass on it.\n\n&#x200B;\n\nThere is not a job where art history, law, biology, business, and english all make sense....except for door to door sales and cold calling",
            "title_similarity": "0.691777",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxrchyb",
            "score": 33,
            "text": "*Me: Crusies Indeed to see what's available. Click on a job that sounds promising and has a decent salary listed. Sees \"Sales\" in the content. Closes out Indeed. *",
            "title_similarity": "0.60041815",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxrdgmb",
            "score": 18,
            "text": "Used to find tons of these on Monster. Because I was in publice relations, they lumped that category together with sales and marketing. Once you started to acclimate yourself to the buzzwords, it became easier to separate the forests from the trees.",
            "title_similarity": "0.5955014",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxrfua1",
            "score": 18,
            "text": "Also be wary of \"and other assigned duties\" listed under responsibility. It means they will take advantage of you in anyway they can outside of the scope of your job.",
            "title_similarity": "0.503882",
            "sentiment_compound": 0.25
        },
        {
            "id": "gxrdgfc",
            "score": 25,
            "text": "I once went to an interview for a similarly deceptively described job. Lots of talk at the interview about “owing your own business” and such. It was just selling cable or satellite at Costco etc. After the first interview, they gave me a sheet of paper with directions to the next place I needed to go, and told me the other people interviewing at the same time as me would be given the same instructions and whoever arrived last or wasn’t prepared would be cut. \n\nI did not go to the second place. 😂",
            "title_similarity": "0.75377935",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxrryqh",
            "score": 26,
            "text": "ComE jOin oUr tEaM oF roCkstArs!!!",
            "title_similarity": "0.29684407",
            "sentiment_compound": 0.4724
        },
        {
            "id": "gxrg79x",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "0.10425778"
        },
        {
            "id": "gxrpjdj",
            "score": 44,
            "text": "Another thing I realized. I’m in my thirties now. When you’re fresh out of school one thing you don’t realize is that not every job is good. That your time and skills have value and some would take advantage of that. These companies know this and target you. \n\nIf I could give any advice to college kids or high school kids it’s this: don’t be afraid to turn a job down. If they make it sound like the world on a string, but day two or something you can tell it’s not, do not stay. Walk out. Some bridges are okay to burn. Trust me. I learned it the hard way. Love my current job and life but it took a loooong time to get here\n\nIn the working world, The only one you should EVER be loyal to is yourself.",
            "title_similarity": "0.7826612",
            "sentiment_compound": 0.9709
        },
        {
            "id": "gxrc4n8",
            "score": 56,
            "text": "**This**\n\nFirst experience out of college with a Marketing degree and no automatic leads on a job, I got suckered in a \"sports Marketing\" company in the DC area.    \nIt was....\n\nDoor to door sales.  \n\nI lasted two days, during lunch on the second day I gave all of my \"sales\" to my team lead.  \nThere was another guy and we NOPED right out, lucky I had a car or would have been stuck for the rest on the day near Quantico VA.  (roughly an hour further south)",
            "title_similarity": "0.6083964",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gxreh2b",
            "score": 72,
            "text": "I actually had great success with one of these \"companies\" \n\nI went in for the interview. Hated the job. Turned it down. But the guy saw that I had done some graphic design courses. So he asked me if I would make him a logo design for his company, dude paid me $75. Then the other \"company\" in his group wanted one. Then another. By the end of the year I had made probably 25 different ones for the new \"companies\" that kept popping up. That was a great time.",
            "title_similarity": "0.6382853",
            "sentiment_compound": 0.8381
        },
        {
            "id": "gxr6ows",
            "score": 81,
            "text": "Same with \"may require reception coverage\".  I accepted a job as an Executive Assistant and they had me cover all breaks for the receptionist as well as her vacation and sick days.  (Also, anytime she had to step away from the desk for amore than a few minutes... which was a lot.)",
            "title_similarity": "0.5565632",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxr7jvj",
            "score": 244,
            "text": "Hehe. I got a “receptionist” job where I had to do sales calls in my off time, which was all the time because they only have one client I knew of. I had to call from a list of “prospects” left by the last guy. Obviously he just filled in the list with random companies.\nEither way, after being told to eff off by most of them, I continued to prepare a sample package to mail for each “interested” person I called. This took up some time so I did it a lot. \nAnother guy I worked with, instead of making sample packages, set up actual demonstrations. The boss would travel and come back angry because usually the people weren’t even expecting them. I’m still laughing about it.\nThe best part is I doodled a picture of him on a notebook and forgot it in my desk when I quit. I titled the picture “bosses name in a pink spandex body suit.” I’m not an artist or even normal doodler.. just bored one day.",
            "title_similarity": "0.72770894",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxrc8tu",
            "score": 259,
            "text": "Went to an interview for something like this right out of college. The address listed was a weird office in an industrial park, and the office was completely slapdash. There were tons of people there, like an interview slaughterhouse or something lmao. Turned out they were one of those stupid companeis that has little kiosks in costco selling satellite TV or some shit. The lady interviewing me said the starting wage (remember, they were targeting college grads) was $6.50/hr and I laughed and walked out without saying another word.",
            "title_similarity": "0.76871",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxraz0s",
            "score": 132,
            "text": "Yea I went to one of these \"interviews.\" Had me in a Home Depot asking people if they own their home and if they'd be interested in a free in-home remodeling consultation. Fuck that.",
            "title_similarity": "0.5525685",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxr3c74",
            "score": 1015,
            "text": "LPT: Google the companies where you're applying. Good for this scenario and others.",
            "title_similarity": "0.44243124",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxrdbz9",
            "score": 152,
            "text": "I fell for this straight outta college. Selling U-verse door to door at the same time AT&T had actual reps doing the same thing, but with better promos. 100% commission. Had to steal my roommate's food more times than I'd like to admit. \n\nMy advice: If a company advertises itself as a 'firm' that sells to Fortune 100 or 500 companies but doesn't tell you which ones, get out.\n\nIf a hiring manager guarantees you that you'll be promoted within 4 weeks, get out.\n\nIf you're told to arrive in business formal but also to bring a change of clothes, get out.",
            "title_similarity": "0.7675984",
            "sentiment_compound": 0.8505
        },
        {
            "id": "gxrelx5",
            "score": 1341,
            "text": "I learned this rather quickly in my job search.\n\nYou see a lot of this in the marketing field. They’ll usually say this like “looking for someone with an entrepreneurial spirit” or some other shit. The job description looks great, and I even knew I wanted to avoid exactly this.\n\nI applied for a job that was a “Marketing Coordinator” position, took a train 1 1/2 hours into the city, got to the building and waited for my interview.\n\nFirst part of the interview was standard, asking why you want the position, past jobs, asking about a time where there was a challenge in the workplace and how you overcame it, etc.\n\nThey told me to wait for another person to come in for the second part of the interview.\n\nAs soon as they came they told me to follow them and we were chatting casually, she’s was pretty much gauging my personality and how I speak. I immediately felt off that we were exiting the building and taking a train away from the building.\n\nTurns out she was guiding me to a best buy to a table to sign people up for xfinity. Handed me a board and told me to find things around best buy that were examples of marketing (I forgot the entire jist of what she asked as I stopped paying attention)\n\nAs soon as I knew what it was going to be, I handed back the clip board and said this job wasn’t for me and walked right out.\n\nFuck everything about these recruiters.",
            "title_similarity": "0.7316887",
            "sentiment_compound": 0.8928
        },
        {
            "id": "gxrbql6",
            "score": 687,
            "text": "Almost got roped into Cutco actually :/ I'm glad I looked up the parent company because otherwise I wouldn't have known",
            "title_similarity": "0.5056313",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxqwi0l",
            "score": 3816,
            "text": "Once I was very desperate for a job and ended up interviewing for and accepting a job that was advertised as a casual 9-5 customer service and sales position. No problem, I thought. I have worked a ton of retail.  \n\nMy first day I arrive at a makeshift office setup in a garage without any signs or indication that a business was operating within. The entire job was calling (preferably elderly) folks who had posted a car for sale on Kijiji or whatever. This \"company\" would offer the seller a financing option in order to help them sell their vehicle, with an initial payment of $500 of course.  \n\nI didn't come back for day 2.  \n\nEdit: I landed a job at Starbucks the next day",
            "title_similarity": "0.68965733",
            "sentiment_compound": 0.697
        },
        {
            "id": "gxr8upq",
            "score": 707,
            "text": "Yep. I went in for an interview for a management position. Partway through the interview, something was said about a kiosk. Then Comcast. I was not there to interview for a position in a Comcast kiosk. I abruptly left and thanked him for wasting my time.",
            "title_similarity": "0.69695926",
            "sentiment_compound": 0.34
        },
        {
            "id": "gxqu8o1",
            "score": 194,
            "text": "Cobra group was notorious for this.",
            "title_similarity": "0.37313104",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gxrczkj",
            "score": 205,
            "text": "Generally as well, if a company contacts you and says we see you have experience in **really vague transferable skill** youd be great for our sales team! \n\nStay the fuck away like the plague.",
            "title_similarity": "0.7186253",
            "sentiment_compound": 0.5857
        },
        {
            "id": "gxr7t1t",
            "score": 1519,
            "text": "I interviewed for a job exactly like this that was listed as a Marketing Associate for a company called New Acquisitions. The interview started in a decent office space in a nice building but about 10 minutes in they sent me down the road to a Costco where I found out what the actual job was - selling DIRECTV to people just trying to shop. Bait and switch through and through. Companies like this that prey on recent grads are the absolute worst.",
            "title_similarity": "0.7646593",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gxr6m5o",
            "score": 1,
            "text": "Yup. I got caught in that. I'm trying to get out.",
            "title_similarity": "0.3330587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrbyuy",
            "score": 49,
            "text": "[deleted]",
            "title_similarity": "0.14069638"
        },
        {
            "id": "gxrdczq",
            "score": 18,
            "text": "Can somewhat confirm for the IT field too. In my second job, it seemed as though I would need to work the front counter. However, I was a junior technician, so I was expecting my main duty to be repair while a dedicated person ran the counter and for me to help if we got busy or the counter person was unavailable. Nope. I was the go-to guy for customers, which included sales of our refurbished machines, which is the LAST thing I wanted to do.",
            "title_similarity": "0.75538397",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gxrdn18",
            "score": 2,
            "text": "Sales never sleep",
            "title_similarity": "0.36545056",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrdyhu",
            "score": 35,
            "text": "Used to work for a Satellite company as a tech, started out loving it installing, repairing, troubleshooting. Then at the 3 months performance review basically get told I’m now a salesman and that’s my only focus. Tried but didn’t do so hot at it and ended up leaving a little while later. \nStill miss the actual tech work...",
            "title_similarity": "0.6587334",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxreh6l",
            "score": 7,
            "text": "Straight out of college I applied for a marketing position through my school, they served me up to an outsourced sales company that was basically a cult trying to get me to have people sign up for AT&T door to door commission only.",
            "title_similarity": "0.7359868",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxrexou",
            "score": 4,
            "text": "Always research the companies you're applying to.",
            "title_similarity": "0.48977077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrfcnf",
            "score": 1,
            "text": "If someone lists it as sales I have a hesitance  especially the generalized pay out",
            "title_similarity": "0.5351527",
            "sentiment_compound": -0.3744
        },
        {
            "id": "gxrfety",
            "score": 1,
            "text": "Your describing multi level marketing",
            "title_similarity": "0.28052592",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrgkwg",
            "score": 1,
            "text": "I'm a sales and service technician and I dont sell shit",
            "title_similarity": "0.44006386",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gxrgrhp",
            "score": 1,
            "text": "Sales is a soul sucking horrible existence. Please for the love of god don’t go into retail sales or telemarketing. High end sales is okay but you need experience or an inside connection to get those jobs.",
            "title_similarity": "0.79994637",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxrgufn",
            "score": 2,
            "text": "Also if you go to a \"training\" and they don't pay you because you don't want to sell their stuff, file a wage claim.",
            "title_similarity": "0.6697664",
            "sentiment_compound": 0.0191
        },
        {
            "id": "gxrgziw",
            "score": 1,
            "text": "Had a poor girl come by that was selling educational books for the summer door to door. She went to Univ of Texas at Austin and it was the 'internship' her department had set her up with.\n\nfuck.",
            "title_similarity": "0.54851294",
            "sentiment_compound": -0.765
        },
        {
            "id": "gxrh7qd",
            "score": 3,
            "text": "Keep in mind - recruiters are salespeople, the job is the product, you are the customer",
            "title_similarity": "0.5495331",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrhb5e",
            "score": 1,
            "text": "am now 19 years old my last job I was an insurance sales person, job sounds nice but you don't get paid at all unless you make sales and I was forced to pay for hotels every week to stay when I was working so I could easily lose money by working. The company took absolutely no risk with the people they hired as they had nothing in it and the people who couldn't get good sales would soon leave as they can't afford the hotels anymore",
            "title_similarity": "0.6785543",
            "sentiment_compound": -0.6231
        },
        {
            "id": "gxrhdaj",
            "score": 1,
            "text": "This sounds similar to what my big sister went through after finishing college and being fed up with being a grocery store cashier.",
            "title_similarity": "0.6560413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrhdd1",
            "score": 21,
            "text": "And if an IT job 'may' include 'some' support responsibilities, you're gonna be called out at 3am on the weekends.",
            "title_similarity": "0.4257925",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxrhhvd",
            "score": 4,
            "text": "How am I supposed to get the stains out of my carpet if the Kirby guy stops coming???",
            "title_similarity": "0.5709354",
            "sentiment_compound": -0.2824
        },
        {
            "id": "gxrhm4q",
            "score": 9,
            "text": "I was desperately looking for a job last year, as a recent English graduate with a ton of customer service/retail/extracurricular experience and this job came up that was exactly what you described. I did the group interview online and realised pretty quickly it was an MLM. I got an ‘individual’ interview afterwards, and decided to see how far they’d take it. I ended up in an interview with a woman in her late 20s, another woman in her early 20s, seemed a similar situation to me. Anyway this interviewer goes through her spiel, I’m sat there, and at the end I just go ‘okay, so to clarify, you’re gonna have us walk around all day, potentially for 8 hours based on “commission”. So that we could work a full day and not even get minimum wage? Is that even legal in the UK?’ The interviewer then promptly kicked me out the zoom call.",
            "title_similarity": "0.60794747",
            "sentiment_compound": -0.3384
        },
        {
            "id": "gxrhwmo",
            "score": 7,
            "text": "When I was young I got snookered into one of these gigs. It was one of the most miserable times of my employment career. NEVER do one of these things based on commission, you'll starve. There are actually a few people who are good at gigs like this, but they are few and far between.",
            "title_similarity": "0.64990336",
            "sentiment_compound": -0.1272
        },
        {
            "id": "gxrhy4m",
            "score": 4,
            "text": "This is very similar to manager in training roles. You get roped into being a grunt for selling product at Costco or some telemarketing or customer service crap. The promise of being a manager doesn't really exist.\n\nI remember getting an interview from a guy who was dressed up to the max. Top end suit, classy and polished shoes, whole nine yards. I was late to the interview due to an ugly car accident causing delays and he didnt even care. He tried to sell me the job. Showed me paid vacation locations, photos with a couple of his female employees dressed in provocative clothing, sucess stories in the company, etc. Asked me maybe two questions.",
            "title_similarity": "0.823434",
            "sentiment_compound": -0.6836
        },
        {
            "id": "gxri799",
            "score": 1,
            "text": "This is an overgeneralization. There are lots of sales administration/finance/marketing positions that are not sales.",
            "title_similarity": "0.58919704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxriayw",
            "score": 1,
            "text": "They also disguise it as 'consultant' so ur thinking ur gonna be advising businesses. I ended up doing sales commission only even though they said I had a choice of being paid hourly before making me sign a contract without an option and being pushy with 'training days' (this was all door to door).\n\nAs much as the job sucked donkey balls with it literally destroying ur feet and literally not being paid for weeks cause it's impossible to get a sale untrained, it did give valuable experience with convincing people with the people skills I learned which can cross over to getting a relationship so do it for the experience with the intention on quitting after a couple of weeks/a month.",
            "title_similarity": "0.78968626",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gxridln",
            "score": 140,
            "text": "After being laid off, I was desperate for a new job. I got a call to interview for a position in Human Resources. Put the kid in daycare and drove across the city to interview. Turns out it wasn't an HR position but rather a position selling DirecTV in Sam's Club. When I realized this, I stopped the interview, stood up and walked out. Later, I rechecked the job description and saw \"sales\" buried deep in the JD.",
            "title_similarity": "0.7734307",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gxripks",
            "score": 1,
            "text": "Yep, I interviewed for a Marketing and Sales Director position for a metal machining company.  It was literally just a sales support job.  I see the same shit on like 30 percent of indeed job postings.",
            "title_similarity": "0.55704224",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxrivqq",
            "score": 1,
            "text": "Hoe zit dit in Nederland?",
            "title_similarity": "0.13601883",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrizxn",
            "score": 4,
            "text": "I wish this post existed in 2011. I was suckered into THREE jobs this way.\n\nOne was supposed to be a Desktop Publisher role, another a graphic designer and the last a copywriter.\n\nOn the upside, I'm pretty good at sales now.",
            "title_similarity": "0.6133282",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxrj1pm",
            "score": 1,
            "text": "Can 100% confirm this. Also anything with \"billing\" or \"customer care\" will most likely be a cover for sales. Not every time but... I work for a job as a billing agent and I lose points if I don't try to sell in every interaction.",
            "title_similarity": "0.7310128",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gxrjwpl",
            "score": 1,
            "text": "Hello Fresh does this. I applied for a sales position. I get there and it’s a door to door sales bullshit job.",
            "title_similarity": "0.7082948",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gxrjyg1",
            "score": 1,
            "text": "I'm trying to think of any point in my life when I was intrigued in what a salesperson had to say and wasn't just trying to get out of the conversation as soon as possible.  It's a garbage industry solely relying on weak people that have a hard time saying no.",
            "title_similarity": "0.79356736",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gxrjzo0",
            "score": 10,
            "text": "Yup. My first job out of college was one of these. DO NOT FALL FOR IT!",
            "title_similarity": "0.4902021",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrk1bh",
            "score": 1,
            "text": "Waaaaaay back when I applied for some position. They had me show up and wait outside while they have their morning group motivational meeting. The meeting ends and I get paired up with someone and we go out for the day.   \nThe job involved going to businesses and trying to peddle nuts/fruits/etc. Yeah - it sucked. They had me drive with someone so I could not leave. But I called a friend and had him pick me up, take me back to my car and I left. As I left the guy I was with said that was not allowed and I had to stay with him as part of the job. I told him if he got in my way the coroner wouldn't be able to ID his body. The look in his eyes was priceless.  \nLike the OP - a pure P.O.S. job",
            "title_similarity": "0.7276702",
            "sentiment_compound": 0.8033
        },
        {
            "id": "gxrkguj",
            "score": 1,
            "text": "I think this documentary is about this https://youtu.be/wyCRzBt7GuY",
            "title_similarity": "0.29316685",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrkk6a",
            "score": 1,
            "text": "True story, basically anything on zip recruiter",
            "title_similarity": "0.21821377",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxrko5b",
            "score": 4,
            "text": "Interviewed at 2 companies like this. They’re basically giant cults and MLM style companies that have an office. I regretted coming in the moment I sat down and the office was basically just a mess of people there for an interview. Basically no furniture to speak of. All young people there to interview and with little real work experience. I knew something was up when I was interviewing for an account manager position that had the same interview pool as people still in college. Oh and they gave us shared group interviews so they could get through all of us quickly. Absolutely shady as hell.",
            "title_similarity": "0.79524297",
            "sentiment_compound": -0.8859
        },
        {
            "id": "gxrktxw",
            "score": 3,
            "text": "I’ve been looking for my next career move and every time I see the word “sales” in the description I move on. After working in retail, and moving farther and farther away from it, I know that sales is *not* right for me. It’s hard because I want to move more away from my field, but I still don’t think every entry level position should require you to be selling something.",
            "title_similarity": "0.7334529",
            "sentiment_compound": -0.0129
        },
        {
            "id": "gxrktyo",
            "score": 4,
            "text": "These people are as bad as MLMs yet I don't see them get nearly as much hate. It's ridiculous how many good looking interviews I've prepared for just to get to some thrown together office and given this exact pitch. It's practically a scam except I assume they do pay you. They are getting way better at hiding themselves until the very end too.",
            "title_similarity": "0.76704973",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gxrkxv5",
            "score": 1,
            "text": "Once applied for and got a job working at a greenhouse. My main skills were managing greenhouses to take care and cycle in and out plants, maintenance and what have you…. Back end work. \n\nBoss said I would needed to do sales occasionally, turned out the jobs was 90% sales, 10% greenhouse duties. I lasted 4 months before I quit on the spot for an offer to join a start up cooperative. \n\nYou speak the truth and it’s fucking frustrating.",
            "title_similarity": "0.65277696",
            "sentiment_compound": 0.5434
        },
        {
            "id": "gxrl2xd",
            "score": 43,
            "text": "Also if the job lists something like 30-70k a year... Thats a commissions based job so be warned.",
            "title_similarity": "0.41066164",
            "sentiment_compound": 0.0314
        },
        {
            "id": "gxrl5oy",
            "score": 1,
            "text": "Had an interview for a b2b lead generation role with an airplane parts company in Chicago. Went in thinking I could build out their leadgen process and infrastructure because I had a good deal of experience with that.\n\nGet brought in to this auditorium room filled with people dialing for dollars. Got brought back to the interview office with the owners. I outline what I could do for their program efforts. They tell me they have a sales script down cold and are only interested in building their outbound team with people who can stick to a script and talk fast.\n\nInterrupted them part way through, thanked them for wasting my time with the misleading description and pre-screening call and peaced out.",
            "title_similarity": "0.6749233",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxrl9b8",
            "score": 2,
            "text": "I fell for one of these. Had an interview for a marketing executive job, I was very inexperienced with interviews but knew It didn’t go well. Next day I got an email saying I was through to the next round, which was a day working for them to show what I could do. Turns out it was selling to the public in the city centre. Luckily I realised beforehand.",
            "title_similarity": "0.7389588",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gxrlawb",
            "score": 1,
            "text": "Not true at all. When you’re a teenager and work retail- it might say “sales associate” but that means you help customers and operate a cash register.",
            "title_similarity": "0.6970459",
            "sentiment_compound": 0.4374
        },
        {
            "id": "gxrlg06",
            "score": 1,
            "text": "This was actually my first job out of high school. The job description said no experience which was what really drew me into it as well as the 3 consecutive interviews which kind of makes you want to keep going after the first few. Pay was by commission meaning you got paid depending on the size and quantity of your sales, and for the first few weeks I made nothing at all working up 12 hour days, 5 days a week. A lot of these companies in Australia would target international students and those on working holiday visas for hires at the bottom of the labour market just to “push” the sales pitches out there as cheaply as possible as part of their overall marring strategy. Eventually I saw the writing on the wall and left after a few weeks. A few years later I found out that one of my ex colleague was fired for faking sales with the financial information of customers who had decided not to go though with the sale whilst another one of the “fronts” under the same parent company was subject to a class action lawsuit as a result of their hazing process for new hires and the behaviour of management. All in all they really pressure you to use a a predatory style of sales to target unwitting customers and this type of culture overflowed into them exploiting their employees so i’m glad I got out of there.",
            "title_similarity": "0.6395912",
            "sentiment_compound": -0.7854
        },
        {
            "id": "gxrlh6j",
            "score": 2,
            "text": ">Something that I should have clarified is that I don't have a problem with sales jobs or people that work them. \n\nYou should have. Sales are a terrible job both for the customer and the seller. Same goes for 99% of callcenters in general. It's terrible, soulgrinding work, which only an extreme minority is suited for, and if we're being honest it's probably because they have deeper issues.",
            "title_similarity": "0.7669599",
            "sentiment_compound": -0.1635
        },
        {
            "id": "gxrlhu4",
            "score": 2,
            "text": "I like to go on the advanced search and exclude the word sales that helps remove some of these job postings",
            "title_similarity": "0.6270834",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxrlpg8",
            "score": 10,
            "text": "LPT: don't do sales",
            "title_similarity": "0.3381674",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrlz4m",
            "score": 3,
            "text": "Just had this happen to me. I applied to some job that sounded relevant to me. Got a call for an interview and it was 100% an MLM. They were trying to get me to say I wanted to run my own business. I already do. Even when I told them that, they continued to push before I finally had to just say I wasn't interested, kthxbye",
            "title_similarity": "0.7059393",
            "sentiment_compound": -0.6587
        },
        {
            "id": "gxrlzgx",
            "score": 2,
            "text": "A few weeks ago I applied for a job I found on an online job board. It was a courier job working for a delivery company, saying that I would be responsible for delivering small parcels to post offices and some residential deliveries. It sounded like an easy job with reasonable pay. I would use my personal vehicle, but be reimbursed for mileage and fuel. Had a phone interview and was asked to come in the next day to do my hiring paperwork.\n\nI show up to their office and the guy explains to me that the job I applied for - and was subsequently offered - had already been filled. He says the actual job I will be doing well be driving a large box truck, delivering home appliances (refrigerators, washing machines, dishwashers, etc.). Not only that, but I will also be responsible for INSTALLING this stuff in people's homes. He says the hours are also much longer - like 12 to 15 hour days, depending on where the deliveries are going.\n\nThis was not the job I applied for and it was not the job I was offered. It was a straight-up bait and switch.",
            "title_similarity": "0.6527441",
            "sentiment_compound": 0.9001
        },
        {
            "id": "gxrm2q6",
            "score": 3,
            "text": "Ah yes the,  “Cutting utensil marketing and research executive” position.",
            "title_similarity": "0.4387213",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxrm8af",
            "score": 2,
            "text": "These things are MLM scams. I was unfortunate enough to get stuck on one for a few months after college. If they paid a proper percent of the sale then it would actually be a decent job, but they never do.",
            "title_similarity": "0.6142344",
            "sentiment_compound": -0.7155
        },
        {
            "id": "gxrm8bj",
            "score": 1,
            "text": "I was in a position where I was desperate for a job and got multiple offers from these fronts. \n\nWhat I came to discover is that some of them were run by the same guy under a different alias. I realized this when the guy who interviewed me introduced himself as the head of the company, only to realize that the head of the last company I interviewed with had the same name. Then I looked at the company packet I received, and it had the picture of the last guy as the head. \n\nThat’s not to say that the jobs are illegitimate, but they’re absolutely preying on college grads and desperate kids. Do your research before taking any offers or moving to second interviews.",
            "title_similarity": "0.8095083",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxrmcih",
            "score": 1,
            "text": "Yup, did one of those and ended up going down a pretty fascinating door-to-door rabbit hole (energy / cable) for a year or so. Most corrupt industry I've ever seen, you could genuinely make six figures but 99% of the people making over 10-30k were committing massive fraud and tricking poor/old people to get there.\n\nOn the flip side, it was sometimes cool to go through a poor neighborhood and get paid to fix the terrible things other people had gone through and done. And it's probably the best sales training you can get, I doubt I'd have landed the offers I got right after without it.",
            "title_similarity": "0.697273",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxrmfbd",
            "score": 3,
            "text": "Until it comes time to list that job experience on your resume, of course...\n\n\"Coordinated regional sales to dozens of potential and current clients using state-of-the-art transactional software.\"\n\n\"...so you ran a checkout aisle?...\"\n\n\"...yes...\"",
            "title_similarity": "0.60687065",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxrmkw6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14069638"
        },
        {
            "id": "gxrmpnt",
            "score": 1,
            "text": "Also be wary of \"Financial Advisor\" positions. You will just be cold calling trying to sell insurance.",
            "title_similarity": "0.65318227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrmr7g",
            "score": 3,
            "text": "I had one of these interviews a couple weeks ago for a marketing job. They sent me to the wrong place, and it was inside a BJs. I ended up interviewing with some guy who just recently got hired 2 weeks before. Also, I wasn't selling, I would be \"marketing\" solar to random people shopping. I spent the whole time arguing with the guy that commission work is mostly sales related. The guy also didn't know a ton about the product of solar besides what was on his note card.",
            "title_similarity": "0.7490783",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gxrmxji",
            "score": 2,
            "text": "I thought it was weird that ny coworker hates doing sales but still accepted a sales role... until I learnt she was basically tricked into it. According to my boss \"nobody wants to apply if I'm completely honest with them\". He was still surpriser when she quit in 3 months.",
            "title_similarity": "0.70692825",
            "sentiment_compound": 0.7383
        },
        {
            "id": "gxrmy96",
            "score": 5,
            "text": "I was on part 3 of an interview that was very vague and I didn't even know what the product was (fresh out of college desperate for a job).  I find out it's selling cable packages in a Walmart rofl hard pass",
            "title_similarity": "0.73130494",
            "sentiment_compound": 0.3832
        },
        {
            "id": "gxrn1zu",
            "score": 5,
            "text": "Entry level sales usually means sales *development*. That's the bitch work of sales, where all you do is outreach and hand it over to the sales reps to close.",
            "title_similarity": "0.7877602",
            "sentiment_compound": 0.128
        },
        {
            "id": "gxrn3sp",
            "score": 2,
            "text": "They won't even say sales anymore.\n\nI've seen postings like \"account manager\" that detail a lot of stuff but none of it sounds like sales. And then I get a call back and they basically explain a sales position.",
            "title_similarity": "0.6966828",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gxrnitl",
            "score": 2,
            "text": "I'll share as well. Literally moved to Washington state to get a job in game testing, the recruiter said a job would be available for me there (I would have moved regardless for other reasons) but then after ~3 months of waiting, turns out it actually isn't available, but how about this other very similar job at the same company instead? I don't find out until when I'm literally sitting there on the first day, signing forms, that this is a product support line and I will be answering phones 8 hours a day. Whereas I was pitched something more similar to data entry. I have social anxiety. I lost the job a mere 2.5 days after training.",
            "title_similarity": "0.61760986",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gxrnl7q",
            "score": 1,
            "text": "So many of these in the 90’s, back when the only job source was the classifieds section of the newspaper and no google to research it.  I’ve wasted so much time in these idiots.",
            "title_similarity": "0.6446703",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gxro1yu",
            "score": 1,
            "text": "Also good advice for lots of these job listings and the interviews they lead to: Sales =/= marketing",
            "title_similarity": "0.47831747",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxro35j",
            "score": 3,
            "text": "Just like \"Hiring all shifts\" means you'll end up on graveyard.",
            "title_similarity": "0.477001",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gxro3uu",
            "score": 3,
            "text": "There’s actually a documentary on Amazon that talks about the practices of companies like this, I think it’s called The Slave Circle.",
            "title_similarity": "0.5641081",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxro6hh",
            "score": 2,
            "text": "Also, \"Customer Service\" is now \"Sales\".  Its definition changed.",
            "title_similarity": "0.39875886",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxro8bd",
            "score": 2,
            "text": "I call these jobs “Knives” jobs. After an experience I had when I was 16 and got a job selling kitchen knives. They tell you about all the money you’ll make, set your own hours, etc. basically the pre-MLM.  Now whenever I see friends or family going for similar jobs I do everything I can to help get them away from it. It sometimes works.",
            "title_similarity": "0.7069898",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxro9a0",
            "score": 1,
            "text": "I applied and interviewed for a “client intake specialist” position at a large law firm. \n\nIt was a call center position. I did not accept the offer.",
            "title_similarity": "0.650593",
            "sentiment_compound": -0.2924
        },
        {
            "id": "gxroitb",
            "score": 3,
            "text": "A few years back I was in a job search. I applied to a few positions like this, not knowing better at the time. Almost all of the contacted me same day to schedule an interview. I thought that was odd, but I went along. Every one of them was, though with a different person, at the same address and suite number. I ghosted them all.",
            "title_similarity": "0.60657185",
            "sentiment_compound": -0.0395
        },
        {
            "id": "gxrolx6",
            "score": 1,
            "text": "I -almost- fell for it. The position was called “Junior account executive” to make it sound fancy even though  it involved selling things. A look at the company’s website told me something was wrong and I’m glad I listened to my gut.",
            "title_similarity": "0.7007561",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxromtg",
            "score": 2,
            "text": "I got one the other day in an email. Nothing g about sales just their recruiter saying “You have the skills we are looking for after viewing your resume”. A quick google search and the company was an insurance company so I would have been selling insurance.\n\nI responded with “Sweet, since you read my resume and I have what you’re looking for, what’s the IT position you have open?” \n\nNever heard back from them.",
            "title_similarity": "0.612798",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxros4z",
            "score": 1,
            "text": "One time a recruiter reached out to me from some job site saying someone wanted to interview me for some job. Have me some amount of the pay and I was like yeah I’m into that, so I asked what’s the company called? they refused to answer and I was like nah I’m good. I’m not taking some fucking job interview where I don’t even know the name.",
            "title_similarity": "0.7131425",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gxroun9",
            "score": 1,
            "text": "Yep exactly.  My fiancee applied for a marketing coordinator job, title and description were perfect.  went through TWO ROUNDS! of interviews, before they asked her to come in for the final round where they will discuss her commission.  She was sooo mad because she wasted almost a week on a job that she thought was perfect for her, only to be told in the end that the position they posted was a level 3 job in the company, and she would have to start as a sales associate.  Don't fucking put that as the title then scumbags.",
            "title_similarity": "0.63049674",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gxrovi8",
            "score": 1,
            "text": "This happened to me right after I graduated -\n\nTook an interview with a \"firm\" that was offering a \"Marketing Associate\" via LinkedIn. I needed to find something to pay rent, and I had a marketing degree so I figured \"Let's see!\" During the interview I realized when they told me \"DirecTV is our largest client,\" this essentially means the company hires people to sell DirecTV subscriptions at Costco/Walmart and realized that's what the job was for. They offered me the position on the spot too, but I declined. \n\nThing is, the description never mentioned \"Sales.\" I had/still do not have any interest in sales and screw those employers for misleading other applicants.",
            "title_similarity": "0.78595465",
            "sentiment_compound": -0.8343
        },
        {
            "id": "gxroy9t",
            "score": 1,
            "text": "even legit companies do this. multinational software companies will create job titles for stuff implementation manager or solutions architect that make you actually believe for a second you won’t have just an even bigger sales quota than the frontline salespeople you’ll be selling with",
            "title_similarity": "0.7734052",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxrp3yi",
            "score": 1,
            "text": "I once took 3 busses to get to a community Coordinator job interview in the early morning that \"hired me right away\"\n\nLoaded me and the others into vans and ended up driving me pretty close to where I lived to basically go door to door and sell fake world vision children. \n\nI just walked home as soon as I got put of the van while my \"supervisor\" yelled obscenities at me from a distance. Things like im weak for not giving it a try and I had to \"by law\" go back with them to the office to release me.",
            "title_similarity": "0.7294764",
            "sentiment_compound": -0.0864
        },
        {
            "id": "gxrp77y",
            "score": 1,
            "text": "Also beware of any job that lists Business Development in the title or as a job duty. It's sales. It's always sales, just wrapped up in a shiny new name.",
            "title_similarity": "0.74302554",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrpebx",
            "score": 1,
            "text": "I had a recruiter approach me about an analytics role that talked a lot about painting… 🤨",
            "title_similarity": "0.38710424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrphmf",
            "score": 13,
            "text": "If it says “Management in 6 weeks.”\n\nIf it says “$10 to $30 per hour.”\n\nIf it say “Rock stars wanted!”\n\nIf it says “unlimited earning potential.“\n\nIt’s sales.",
            "title_similarity": "0.4526808",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrppb6",
            "score": 1,
            "text": "Unless there is something else listed that is worse. I could imagine a burger register person having to clean the bathrooms, for example.",
            "title_similarity": "0.6377749",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gxrpvlx",
            "score": 532,
            "text": "Back when I was home from college my dad found me an ad in the classifieds for a job:\n\n>Help wanted for assembly work\n>\n>-Not sales     \n>-Not door-to-door     \n>-Not vacuum cleaners.\n\nGuess what it was?\n\nHere was their reasoning:\n\nIt wasn't sales because all you have to do is put the product together (assembly) in front of the customer and they will immediately love it.\n\nIt's not door-to-door because a supervisor does that for you, and calls you to tell you who's interested to hear more.\n\nIt's not a vacuum cleaner because it's patented as an air cleaner and has the added \"benefit\" of cleaning the floor while cleaning the air.\n\nIt was the biggest stretch.  I didn't last a week before leaving, while the supervisor called me a Benedict Arnold on my way out.\n\nEdit: I don't remember what company it was.  It was a vacuum cleaner with a Hepa air filter.  It was a powerful vacuum cleaner that liked to use some like 5-lb. bullet shaped object (that they jokingly called a \"Texas bullet\") in the sales pitch.  They also sold essential oils for you to douse the filter in if you wanted to add a scent to the room you're cleaning.  This was probably around 2002 or so...shit, that was almost 20 years ago!  It probably cost around $1k-2k, if I remember.",
            "title_similarity": "0.74908376",
            "sentiment_compound": 0.9704
        },
        {
            "id": "gxrpvn3",
            "score": 1,
            "text": "Also careful even if it offers a decent intro bonus for staying a few years to make a decent salary.\n\nA lot of these types of jobs need the person to stay years or else lose that bonus, are worthless to most industries for resume building, and offer improbably low, little to no advancement chances internally or externally.\n\nPlus don't really build or practice any relevant skills. And might involve long hours and stress as well. Hard to build other skills, work a side gig, or get educated with some of those types of jobs. There are some flexible contractor jobs but most of those usually aren't good for long term resumes either. Might try to use the flexibility and saved energy to do something like education in a trade apprenticeship, trade school, or college however. Just make sure to research an industry before, though of course research takes energy as well",
            "title_similarity": "0.6717485",
            "sentiment_compound": 0.9471
        },
        {
            "id": "gxrq2m2",
            "score": 2,
            "text": "Once I applied to a marketing job right out of college. I'm 40 so this was awhile ago. They said the best way to interview is to see the job in action. They then proceeded to put me in a car and drive me to an unknown neighborhood where I was expected to sell coupon books door to door without being employed there or getting a paycheck. At the time, there was no Uber and I had no way to get out of there other than finish out a 7 hour day.",
            "title_similarity": "0.67580533",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gxrq8vo",
            "score": 1,
            "text": "Sounds like my Kirby vaccum gig",
            "title_similarity": "0.28359276",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxrqakg",
            "score": 1,
            "text": "As someone that works in marketing these jobs are easy to spot when they don't mention prior experience requirements. Sadly its really tough to get an entry level job in marketing without previous experience.",
            "title_similarity": "0.6102694",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gxrqb0n",
            "score": 1,
            "text": "I saw a classified ad for help wanted for office work. Got an interview.  It was for kirby vacuum selling. What an absolute joke.",
            "title_similarity": "0.7135962",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gxrqcir",
            "score": 4,
            "text": "Yeah Fuck Smart Circle",
            "title_similarity": "0.075189605",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gxrqh1h",
            "score": 1,
            "text": "I went to an interview for Marketing Coordinator. Turned out the job was selling DirecTV at Wal Mart. I'm glad I didn't get an offer.",
            "title_similarity": "0.67868996",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxrqh42",
            "score": 1,
            "text": "I spent a miserable summer at Renewal By Andersen trying to sell overpriced windows to people in Rural Kings. It was such a scam.",
            "title_similarity": "0.67679226",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gxrqmym",
            "score": 1,
            "text": "Last year when the pandemic hit I got laid off from my job and I just spam applied for a bunch of places and got an interviee with a place like this where you go sell like phones for ATT in Walmart. I had 3 years experience in Marketing with a BBA, they wanted me to come in for a second interview and I was just like nah this isn't right for me, I'm an actual marketer.",
            "title_similarity": "0.72548556",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gxrqn8r",
            "score": 1,
            "text": "I recently got a letter for a “sales representative” position. They didn’t require any experience and wanted inexperienced college students. The pay in the letter said $15.00 (no mention that this wasn’t 15/hour. But $15/hour in my area was extremely good considering minimum wage is still $7.25). I decided to set up an interview online and was surprised by how well informed and professional these people were. Half way into the interview, their true colors were showing and the whole thing felt like an MLM. I left a quickly as could from the interview and told the company that I wasn’t interested. How scummy do you have to be to prey on college kids trying to support themselves?",
            "title_similarity": "0.71357465",
            "sentiment_compound": 0.958
        },
        {
            "id": "gxrqprh",
            "score": 1,
            "text": "I had interviewed for one of these companies fresh out of college. I went to school in Michigan and my girlfriend at the time was still there but after school I moved back home in IL. So I made the 4.5 hour drive expecting an actual job/career in an office setting. Yeah... That was a fucking joke. I arrived and was told I'd be shadowing an employee to see if I liked the job. Had to drive my own car off course and we showed up at a Costco where he harassed people trying to sell them some cable package. Everyone ignored him and I was honestly embarased. At lunch, which I thought would be paid, I had to buy my own food. I left angry I had wasted all that time and too embarassed to tell my friends or family how the interview actually went.\n\nThe next year one of my friends called me and asked me if that interview I had done went a certain way. They had got him too 😂\n\nIt's sad, and more post grads need to realize this. Thanks for sharing OP",
            "title_similarity": "0.7440554",
            "sentiment_compound": 0.9505
        },
        {
            "id": "gxrqx95",
            "score": 1,
            "text": "When I was 18 and fresh out of high school, desperate for a job, I randomly got a phone call from a woman asking if I was interested in making $17 an hour. That sounded insane to me at the time so I said yes and she told me where to show up and to dress nice. I went to the address she gave me and it was some shitty run down office. It turned out to be a MLM scheme for selling knives and they basically just asked us to write down every name we could think of as possible customers, from friends to family to vague acquaintances. We also had to buy the starter knife set. \n\nI noped out of there fast, but it was tempting at first because of how manipulative they were. They took me and this dude aside and told us we seemed like we had a lot of potential, mainly because we were the only ones who actually dressed nicely. I just stopped showing up but I wish I had called them out because that place was straight up predatory. It was just commission, there was no $17 an hour pay.\n\nOh, and it turns out they got my number from a high school acquaintance who put me down as a recommendation, which they encourage you to do.",
            "title_similarity": "0.7201277",
            "sentiment_compound": 0.9121
        },
        {
            "id": "gxrr1yc",
            "score": 1,
            "text": "Am currently looking for jobs, but in the mid-senior range. Seeing plenty of \"Business Development\" jobs, where amongst the first tasks listed is \"cold prospect calling\". Yeah, no.",
            "title_similarity": "0.69657403",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gxrr5nf",
            "score": 1,
            "text": "This is every tech startup job in Arizona.",
            "title_similarity": "0.36201286",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrr635",
            "score": 1,
            "text": "Last time I was job hunting, I got an email saying my resume & experience was a \"close match\" for an insurance sales job. That's interesting, since all my experience is in scientific/technical roles with not a damn thing in any way related to insurance or sales. I think \"close match\" = breathing human with basic arithmetic skills. \n\n*Note*: No offense to anyone in insurance or sales. More power to anyone who's skilled in sales, I'm almost completely hopeless in that regard.",
            "title_similarity": "0.6511613",
            "sentiment_compound": 0.3986
        },
        {
            "id": "gxrr6og",
            "score": 1,
            "text": "OH DEAR GOD LISTEN TO THIS\n\nAnd, check how long that company has been in the same location, with the same name. Also, if you get hired the same day, quit that minute. Things that are easy to get into are hard to get out of. Any reputable company that has a decent opening should take months of vetting to start work. NEVER buy the hype.",
            "title_similarity": "0.72091436",
            "sentiment_compound": 0.8256
        },
        {
            "id": "gxrr9vl",
            "score": 1,
            "text": "As someone who got their first job in Business Development, this is 100% true. But before you run away, realize the best skill you can have in life is the ability to sell. I think everyone should sell for a year or 2 then go do whatever your heart desires.",
            "title_similarity": "0.53741497",
            "sentiment_compound": 0.9549
        },
        {
            "id": "gxrrble",
            "score": 2,
            "text": "The only time this might vary is if it's a call center.  Then \"sales\" can get overridden by \"retentions,\" which is SO much worse.",
            "title_similarity": "0.67467105",
            "sentiment_compound": -0.6218
        },
        {
            "id": "gxrrfqv",
            "score": 1,
            "text": ">google the name of the company you are applying to. \n\nWhat world are you living in where these scummy job listings actually tell you what company you're applying to? Even a lot of legit job postings don't tell you what company you'd be working at.",
            "title_similarity": "0.76461446",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrrhej",
            "score": 1,
            "text": "If you go to the company’s main website and there’s more information about working there, and not the services they offer…RUN.",
            "title_similarity": "0.5734331",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrrhkb",
            "score": 1,
            "text": "When I was first starting out in jobs, I was wanting a job in marketing and similar got caught out. I had an interview, which went well (of course) then they said \"to see how you do, we are going to pair you up with an experienced member of staff for a hour, then you'll come back here and have your final interview\".\n\nThe paring up was me seeing this person standing after the checkouts of the local supermarket harassing every person who just wanted to leave the store and try to sell them some crappy cleaning product.\n\nWhen I got back for my final interview they told me how I would be trained under them, then when I am ready I would train someone else etc (warning, pyramid scheme alert) , I respectfully declined, saying I didn't realise it was a sales job, as the position was for \"Marketing apprentice\" (or something similar). They were polite about it and that was that. \n\nFirst time I had ever turned down a job offer.",
            "title_similarity": "0.77681446",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxrri82",
            "score": 1,
            "text": "I had an interview with a recruiter yesterday and they wanted me to pay for my training materials and study for “a license”. I’m getting my masters so I don’t have time to study for an additional license that I have to pay for. I don’t even know what the company was or what the job would have been. Once I said I wasn’t willing to pay for training for a mystery license while trying to get my masters and having to work elsewhere until I started making money the guy ended the interview.",
            "title_similarity": "0.7007617",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxrriko",
            "score": 4,
            "text": "I interviewed for a “marketing manager” role at this small marketing company. It was all younger folks wearing suits and ties, they had pool tables and it just had a very “hey we’re young and loose, but we work hard” feel to it. It was a little odd, but thought nothing of it.\n\nInterviewer shows up, 20 mins late and calls out three names, including mine. Group interview? Ok, now this is getting weird, so I ask, “what does this job entail?” She says, “it’s one of those jobs where you control your destiny, you work hard you could pull in some serious bucks.” One of the other candidates asks something else, so the question gets avoided.\n\nOnto round 2 with the director/hiring manager. He’s definitely a little older than most I saw working there so far, but this guy... pinstripe suit, slicked back hair, the most wannabe Italian mobster type. He’s even got two younger bro dude employees on either side, asking me “you ready to make some serious dough?” At this point, I’m totally ready to just walk out, but I finally say, “look, what is this job exactly? The ad said marketing manager to manage day to day marketing communications for your largest client.” Of course, he gets up out of his chair, starts saying with a “fuggetabouit” accent, how at first, you have to do a little bit of door to door marketing for their largest client ATT and sign them up for fiber internet. We had to drive to the select towns that offered it, no gas, per diem, and “market” their fiber network. The thing that really annoyed me was 6 day work week, and suit’s were mandatory, even though you had to wear this ugly ass yellow ATT road guard vest. And of course, because you’re starting out the pay is shit, but hustle real hard and you’ll be sr manager in six months.\n\nImmediately after, he’s like, “I like you, you’re hired, you’ll accept, right?” I was a bit intimidated so I said yeah sure. Was suppose to come in that Monday but as soon as I drove a little bit away from that office, I pulled over, called them up and said, “sorry, but this role wasn’t at all how it was advertised, I’m looking Elsewhere, sorry for wasting your time.” The guy said, “yeah you really did.” And hung up. Yeah fuck that.",
            "title_similarity": "0.7018427",
            "sentiment_compound": -0.9656
        },
        {
            "id": "gxrriwm",
            "score": 1,
            "text": "My response to every single one of these advice threads telling you to avoid x companies/jobs for y reasons:\n\nMost of us don't have the luxury of being choosy with our job. You're lucky if you're in a situation that allows you to spend that extra time choosing a job that suites you and you're lucky if they'll even respond to you.",
            "title_similarity": "0.7066704",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxrrluo",
            "score": 1,
            "text": "I went into a couple of \"interviews\" with Insurance companies after I graduated and, in both cases, I very quickly got MLM-ish vibes from the interviewer, wound up walking out before they were done.",
            "title_similarity": "0.6237925",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrro2u",
            "score": 14,
            "text": "I fell for a marketing firm’s scam when I graduated college. They advertised as a marketing firm looking for bachelor degrees. I interviewed and the firm was very professional everyone had a suit on. They tell me I get the job and to make sure I wear a suit to work but bring comfortable sneakers and shorts. Easy enough I was excited to have a “real” job even though I wasn’t sure exactly I was doing. Maybe the shorts and sneakers is for something fun.  \n\nWell I get there and there’s about 30 other people my aged there all dressed up. I get assigned to someone to train me. They then gather everyone in a back room and start doing chants like we are on a sports team. At this point I’m just like “okay this is kinda fun but wtf is my job?” After the “team building chants” they then give us a bright neon green polo with Century Link on them and tell us we will be “marketing fiber” for them. At this point I’m just along for the ride trying to make the best of it. They then tell us under no circumstance are we to wear these polo at the office building itself. So all 30 of us drive to the neighborhood we are supposed to me “marketing fiber” and change all our professional business clothes at the nearest gas station into shorts and bright green polos. \n\nThat’s how I became a door to door salesman for 2 weeks in Phoenix Arizona in July. The retention rate was abysmal and too many kids got trapped into believing they would own their own firm someday if they succeeded (too many of them bought a car with their first sales check). You were paid 100% by commission.\n\nI’ll always remember one dude who was hired the same time I was and telling me he thinks “this is a cult” and he quit the next day. I waited another two weeks before calling it quits and then ended up working in Loan Collections after that for about a year before going back to get my masters. Now I have a career in the field I went to school for.",
            "title_similarity": "0.6572026",
            "sentiment_compound": 0.9893
        },
        {
            "id": "gxrrofg",
            "score": 22,
            "text": "This is something everyone is bound to learn the hard way if they don't heed your warning.\n\nBasically, if after reading the job description you still don't really have any idea what the job *actually* is, go to the website. If its all vague corporate jargon, close the tab immediately and don't give the \"company\" another thought. Its basically a pyramid scheme.\n\nThis is a great video essay on it. I'm in the US and had the exact same experience.\n\nhttps://youtu.be/gYLMT3EdkYs",
            "title_similarity": "0.78826463",
            "sentiment_compound": 0.6526
        },
        {
            "id": "gxrrq1t",
            "score": 3,
            "text": "LPT: the business world is a dirty place filled with lies. Look out for yourself as best you can & believe nothing.",
            "title_similarity": "0.6703032",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxrrrmy",
            "score": 1,
            "text": "ALWAYS look at glassdoor for any job before you interview.",
            "title_similarity": "0.4487353",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrrtpf",
            "score": 5,
            "text": "Fundraising (\"development\") as well.",
            "title_similarity": "0.13370045",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxrscbz",
            "score": 1,
            "text": "I got suckered into selling home entertainment systems from a white van. I was young and has no idea that anything was sketchy, until the 45 minute drive north where they hadn't been yet.",
            "title_similarity": "0.51344657",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxrscug",
            "score": 1,
            "text": "i’m gonna check every single box except “sales”",
            "title_similarity": "0.46897703",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrsi48",
            "score": 5,
            "text": "Had something like that happen to me right out of college. I'm sure it was a marketing associate or something like that but it turns out to be cold calling people to help them settle tax debt. \n\nIt was soul crushing. I remember buying some booze to celebrate getting a job and before even having a sip, the bottle broke. It was a sign from the universe. I was too chickenshit so I made some some excuse about why I had to quit other than \"fuck this place\" but I did pretty quickly.",
            "title_similarity": "0.7992151",
            "sentiment_compound": 0.3716
        },
        {
            "id": "gxrsmx1",
            "score": 7,
            "text": "I used to work in BestBuy. Felt bad for the poor saps trying sell solar panels or Xfinity or some shit to everyone that walked in.",
            "title_similarity": "0.7359681",
            "sentiment_compound": -0.8807
        },
        {
            "id": "gxrt5up",
            "score": 2,
            "text": "I feel I need to add a word of advice from personal experience. If at anytime during the interview the phrase “We work hard but play hard” is used, it’s a huge red flag and you should get out as fast as you can. No reputable company will ever say shit like that. \n\nAlso, if you get a job offer in less than 48hrs after the interview be extremely cautious about taking it. Normal and healthy processes take weeks, sometimes months and that’s ok. The hiring company should be seriously vetting potential employees just like you should be protecting yourself against shady\njobs and companies.",
            "title_similarity": "0.722126",
            "sentiment_compound": 0.6262
        },
        {
            "id": "gxrtc4p",
            "score": 1,
            "text": "my major is finance, and i cannot count the number of internships or entry level “financial advisor” jobs that ive applied to that, after just a little research, ive realized are just life insurance sales jobs. quite frustrating tbh.",
            "title_similarity": "0.71923304",
            "sentiment_compound": -0.5291
        },
        {
            "id": "gxrtdn4",
            "score": 1,
            "text": "Can confirm this exact tip. A little due diligence saved me from working with one of these exact companies, and I would hate that job with a passion. “Hey, could you try to bug people and make intrusive eye contact to sell them shit they probably don’t want?” Also, research literally every company before you take a job with them. Glassdoor, Indeed, wherever you can find info.",
            "title_similarity": "0.80028045",
            "sentiment_compound": -0.4144
        },
        {
            "id": "gxrteha",
            "score": 1,
            "text": "Yup. Graduated in 2020, spent all year trying to avoid these people.",
            "title_similarity": "0.53371376",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxrtf62",
            "score": 1,
            "text": "I had that pulled on me when I was 17. Fuck Vivint and their stupid home automation.",
            "title_similarity": "0.5444586",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gxrtgbk",
            "score": 1,
            "text": "I'd like to wage in with entry Java developer jobs. If a job mentions plsql as a must and is in a financial sector (banks, insurances etc.) you're probably going to work on some old systems in plsql with a Java front or smth like that. I was lured for such a job str8 out of university, they even gave me 2 weeks of java training with clean code etc to be dumped into pure PLSQL software. \n\nThis is in Poland, don't know bout other countries though.",
            "title_similarity": "0.67448354",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gxrtl43",
            "score": 1,
            "text": "Can confirm. That’s all I’ll have you do.",
            "title_similarity": "0.055353116",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrtwyf",
            "score": 2,
            "text": "I was interviewed and hired for in a position at a non-profit that works with a number of partnered of non-profits that are dedicated to supporting affordable housing within my home state. \n\nThe company itself was respectable, and devoted to a good cause. The premise is that once you’re hired, you are “placed” (depending upon your interests and background) within one of their partnered companies. To my knowledge, all my colleagues got decent positions working in various fields, all of which contributed to helping people retain or obtain affordable housing. \n\nMy interests are in law, and I will be attending law school in the Fall. When I applied and was accepted, I mentioned in my application that I was interested in legal-related work. I was placed in a pro bono boutique firm that specialized in protecting low income tenants against landlords. \n\nThe company didn’t tell me anything relating to my responsibilities because it depended on what the law firm had available to me to do; truthfully they didn’t know what my responsibilities were going to be. Their and my assumption was that it was going to relate to work similar to a paralegal, or what a law student would do during their summers.\n\nBottom line: it the biggest fucking shithole in the city, and hopefully will be the lowest work experience that life will throw at me. \n\nWhen I arrived, the office of three was shocked: they had no idea I was suppose to be there. In fact, the firm completely forgot that they signed up for the program. Suffice to say, it was a completely disorganized mess; There were numerous people who needed representation that were being ignored or forgotten about; clients who were losing their homes or were being unfairly penalized by their landlords. \n\nI would show up to the office and on most days and they would have nothing for me to do other then sit in the corner.The days that I did have work, I was given the job of leaving the office around around 11ish to do sales. Yep, at a pro bono firm. Sales. \n\nThey had a “fundraiser” coming up in July, and they needed “donations” for the fundraiser event from local businesses, which consisted of free food, discounts, and goods depending on the business. \n\nWasn’t able to do any work relating law, the whole summer I was either sitting in an office doing nothing or running around a 90 degree city in business attire trying to convince businesses to give me free items for a scam. \n\nHowever, this is not the worst part. The boss, will call her D for short, was mentally unstable. She ruled the office out of fear, and often used me as her personal punching bag. First day I arrive she refused to introduce herself to me, and hid in her office. \n\nFollowing the first week, she called me into her office randomly to yell in my face that “out of all the people she’s met, you’re the most disgusting and disappointing I’ve seen; you can’t even use a telephone! You have one chance to prove yourself to me otherwise I’m calling the company and having you fired.” \n\nAfter that, because I didn’t have anyone managing me, when I wasn’t wandering the city looking for businesses to ask for donations I would go around the office asking the three (including D) if there was any work to do, and most of the time they didn’t have anything or would just ignore me. \n\nWhen they did give me work, it was mostly menial tasks, like printing papers or managing the file cabinet. However, each time I worked, D always found a reason to scream at me. Once I was sitting next to the printer, printing out a 500 page document, and D saw me sitting; she humiliated me in front of the office by yelling that I should not be sitting because I’m a lazy loser, and that I should look as if I am working. Another time I abbreviated street as “St.” in an excel, and I was threatened with termination. \n\nThe other two joined in on it as well. They were probably afraid of D, wanted to look good in front of her, or a bit of both. Either case, I’ve had them sit over my chair watching me, calling me a gross, and general treated me the same way D did. \n\nYet, the worst was when the fundraising event was complete. Out of the 60ish place I visited, I was able to convince a little over 1/3 to donate some sort of good or discount. The fundraiser was a success, and although the goods/discounts went to one of the employees in the office, I felt proud I was able to learn how to convince people. \n\nThe next day after the event, I went into the office (sitting there with not going to do as usual), waiting for 5pm to arrive. Before the end of the day, D called me into her office to inform me that she notified the company that she is very displeased with my performance, and that “it’s done.”\n\nI wasn’t fired that day, but suffice to say I felt humiliated and defeated. I needed the job because of the money and the experience, but there’s some nights that I wish I could of just yelled in D’s face when she was yelling at me, or better yet, recorded her behavior to show the word the kind of monster she was. \n\nThe irony was that she was promoted, and began work as one chair boards on the city counsel for the city the firm was located in; she became head of housing and housing regulation. \n\nI hope that if there is a Hell, or Karma, or some supernatural force that dictates the flow of life, that she ends up receiving her dues. To this day, I don’t still don’t understand why she and the rest of the office began to initially treat me as such. \n\n What I am sure of is that now, deep inside me, I have a deep fear/anxiety of ending up in a shithole like that again, and whenever I’m studying and feel exhausted or overwhelmed, I remember that hell; I push myself to do my best to give myself past my exhaustion to hopefully give myself choice in life, and to not end up in that position again.",
            "title_similarity": "0.5234608",
            "sentiment_compound": 0.7337
        },
        {
            "id": "gxrty4g",
            "score": 3,
            "text": "I fell for the same thing but I actually took the job. You got $100 per direct TV install and I was decent at it getting about 7 or 8 a week. The business was extremely shady and the turnover was insane. Eventually I found out the \"owner\" would Clawback wages of people that wouldn't make commissions one week but did the next. For example you work 40 hours a week at 10/hr = $400 that week. If he had to pay you ANY of that hourly wage because you didn't make 4 sales, he would claw back money off your next check that had commission (if you sold 5, he'd take that 5th $100 commission back until he was square.).\n\n I also caught that scumbag lying about how many installs Id get so he'd pay me less commission. He'd say I only got 5 installs that week, so I called every customer and ask how it went and all 7 of them said great we are good to go! He'd thank me for finding his \"error\" and never pay me\n\nThis is as close to getting into a scam business or MLM as you can and I hated that I stayed 6 months in it. The parent company goes by another name that starts with an M, I can find it if anyone is interested",
            "title_similarity": "0.6888707",
            "sentiment_compound": -0.9671
        },
        {
            "id": "gxru484",
            "score": 1,
            "text": "I have noticed more and more job offerings that seem to be in the format of *[STEM Degree] Sales Manager* that I have suspected were scams, and now I have some confirmation.\n\nThey were all offering a salary of 30k per year plus commissions and I was starting to think \"oh so scientists just get shit pay to hock products now?\"",
            "title_similarity": "0.6111407",
            "sentiment_compound": -0.8658
        },
        {
            "id": "gxru8ke",
            "score": 1,
            "text": "My first job was \"sales and marketing officer\" and sales was very much not the majority of my job.",
            "title_similarity": "0.51035863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrudgi",
            "score": 1,
            "text": "I wound up unknowingly applying for one of these and got some “in the field experience”. Once I saw that they were trying to sell an energy plan or something to that extent, I mentally checked out. I was informed that they went with another prospect and didn’t feel bad at all. Only cost to me was a 20 minute drive and a 3-4 hours of a day. Got free dinner at Frisch’s at least 🤷🏾‍♂️",
            "title_similarity": "0.5603499",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gxruenv",
            "score": 1,
            "text": "Literally my experience out of college with a Sociology degree. Random shady company with a small office space with no signage. Show up and a half dozen other applicants all in a waiting room. They eventually have us all pile into a car and we drive over to Home Depot and advise us we're trying to sell kitchen remodeling inspections, not the remodel itself, just the inspection. I didn't come back for the 2nd interview. Fell for it again a few years later but it was for Aflac which I thought would be legit, but nope, literally a pyramid scheme.",
            "title_similarity": "0.7695769",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxrufdf",
            "score": 1,
            "text": "I work in recruitment for a tech sales/marketing firm. If you're looking for a sales role, always ask where you will get your leads from. If they state you need to purchase your own list, 9 times out of 10 it's an MLM trying to disguise their business as a corporation. Looking at you life insurance pyramid schemes.",
            "title_similarity": "0.7022209",
            "sentiment_compound": -0.6289
        },
        {
            "id": "gxrukta",
            "score": 1,
            "text": "I remember being 22, fresh out of college with an absolutely useless degree, having put my resume out there, and just getting call after call asking if I'd be interested in selling insurance. Don't think I'd ever been as stressed in my life, having no idea how to make money but knowing I sure as shit was not a salesperson.",
            "title_similarity": "0.65881",
            "sentiment_compound": -0.5854
        },
        {
            "id": "gxrv11p",
            "score": 1,
            "text": "Similar tip: If you don't want a job in sales, don't list \"sales\" anywhere in your resume. Even if it is a part of your work history, just find a different way to describe what you did. First, if you put a resume that mentions sales on any kind of employment website you'll be flooded with \"opportunities\" from companies like these. But perhaps more importantly, any company (including good businesses) that have any kind of sales department get way too excited when they see that experience. Sales brings in the money. It got really frustrating for me when I was applying for more technical positions that I was completely qualified for; the hiring manager would take one look at my resume and say \"oh man! We need to get you in touch with our SALES department\". Like they were doing me a huge favor. They would get kind of put off and lose interest in me when I said I didn't want to work in sales. When I finally realized that my sales experience was literally disqualifying me for other jobs, I removed it from my resume and immediately saw a difference in how I was considered for the positions I wanted.",
            "title_similarity": "0.8435677",
            "sentiment_compound": 0.9562
        },
        {
            "id": "gxrv56w",
            "score": 1,
            "text": "The older you get, the more you realize that every job is sales.",
            "title_similarity": "0.48181576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrv5ln",
            "score": 1,
            "text": "This just happened to me. Fired after 4 days for not getting on the board. Ruthless and I quit job for it. Now I'm hosed..",
            "title_similarity": "0.5861269",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxrvf6p",
            "score": 1,
            "text": "Sometimes it will not even use the word “sales” and be a sales job.\n\nFor anyone who majored in PR/Advertising/Communications, you will get people messaging you on Linkedin with an “opportunity you’re a great fit for”\n\nIt’s usually called “PR specialist” or “Communications assistant” and speaks vaguely about the position, saying you’ll be in charge of “communications plans” and “marketing events” for their clients.\n\nIt will be one of two things. You will either be a salesman doing demonstrations with crappy products in costcos and walmarts, or you will be flagging down people in the street asking for donations to non-profits.\n\nI attended an interview for a PR specialist position, and I spoke about my experience working with the news media and doing social content creation. They had the “CEO” interview me, who was way too enthusiastic. It seemed like they were desperate to hire people. But he told me he wanted me to shadow a “marketing event”. I pictured a trade show or something similar. \n\nBut no I got on the train with a depressed guy with a facial scar and we went downtown, set up a table in the street, and he started flagging people down asking for donations. It WAS legitimate. Their main client was the special olympics. But that is a SALES job for someone without a college degree. And they are super deceptive with their hiring practices to try to nab college grads with work ethic.\n\nI asked the guy how much if this was the job and he said “oh, this is my life” and I just walked away lol",
            "title_similarity": "0.83594596",
            "sentiment_compound": 0.8779
        },
        {
            "id": "gxrvjdx",
            "score": 1,
            "text": "I recently got a letter advertising $18.50 an hour and turns out it's just them trying to get you to go door to door selling knifes. What a scam job.",
            "title_similarity": "0.6602355",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gxrvl0m",
            "score": 1,
            "text": "Can confirm. Had a Tech Support job with HP with a sales aspect that was emphasized as \"Not critical to the role\"\n\n\\-Under sales metric? Fired\n\n\\-Not offering enough upsells on support? Fired\n\netc etc\n\nAbility to fix shit was the least of your concerns...",
            "title_similarity": "0.6589205",
            "sentiment_compound": -0.542
        },
        {
            "id": "gxrvobe",
            "score": 1,
            "text": "Same rule goes for turning the wheel of pain. If a job says there’s a wheel of pain, then turning it is all you’re gonna do.",
            "title_similarity": "0.4962058",
            "sentiment_compound": -0.765
        },
        {
            "id": "gxrvocg",
            "score": 1,
            "text": "I've worked a number of customer service jobs where that wasn't necessarily the case (although the sales portion was tracked and was a big part of the job). BMW Financial was big on trying to get us to push their credit cards on customers who called in about their auto loans, BUT that wasn't the actual job, it only came up a few times a month. Annoying because the benefits really didn't seem worth it for customers who actually looked at the numbers. The only sign-ups I got were from people who probably didn't need it and who didn't even bother listening to my spiel. They just reflexively said, \"Sure!\" when I asked.",
            "title_similarity": "0.72858745",
            "sentiment_compound": 0.6371
        },
        {
            "id": "gxrvpmf",
            "score": 1,
            "text": "Add to the list:\n\n\"Financial Advisor\"\n\"Financial Consultant\"\n\nIt's sales.",
            "title_similarity": "0.45298544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrvt4f",
            "score": 1,
            "text": "I just recently went through this.  There was a job listing for a marketing specialist for a small technology firm.  Me, fresh out of college, with a degree in BA Management, was excited to check out this opportunity.  During the interview process I quickly found out that this firm ,being a subsidiary of Verizon Fios, was just looking for telemarketers and door to door salesman for Verizon’s internet services.  I was upset and declined the opportunity to join them for a follow up interview.  Lesson learned I suppose.",
            "title_similarity": "0.7523812",
            "sentiment_compound": 0.8537
        },
        {
            "id": "gxrvwlu",
            "score": 1,
            "text": "I fell into this the year after college. I kept applying to jobs that were in \"marketing\" but they were all entry level positions as I had no skills. After months of applying, I got an email to come in for an interview. The building was nice, the setup was cool, except for one thing - there were 5 people who were dressed just like me waiting for an interview.\n\nI got called in to the room to interview, my background and interests were immediately glossed over, and I was asked if I would be comfortable selling insurance to elderly working class people. I said \"no\" and the interview was over.\n\nThere's tons of jobs out there like that. I think sales can be a great career to make your name and develop skills but you have to want to do it. I didn't want to do it, I wanted more on the marketing side. Now I have enough skills in my field that people come to me instead of the other way around.\n\nBut man, that first year was ROUGH.",
            "title_similarity": "0.7154319",
            "sentiment_compound": 0.9752
        },
        {
            "id": "gxrw4cs",
            "score": 1,
            "text": "This is completely true when I got out of college looking for a job.",
            "title_similarity": "0.40531534",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gxrwfrq",
            "score": 1,
            "text": "Also, if they list payment collections anywhere that's it, that's the job. This will trump sales.",
            "title_similarity": "0.5478855",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrwik4",
            "score": 1,
            "text": "Just ignore most sales jobs in general. Usually scummy to say the least.",
            "title_similarity": "0.59821796",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gxrwjcc",
            "score": 1,
            "text": "Yeah this was my college internship search junior year. Wasted my junior year spring break on these parasites. They tried so hard to hide that it was door to door verizon Fios sales. Thankfully saw through the bullshit and accepted a position at Enterprise. \n\nJob still sucked, but they didnt lie about what I was doing and working at a multinational company like Enterprise looked way better on my resume than some fucking borderline MLM shit",
            "title_similarity": "0.7571477",
            "sentiment_compound": -0.8008
        },
        {
            "id": "gxrwnwv",
            "score": 1,
            "text": "GF just got sucked into one of those, said it was a data entry position, yea sales data after you sell something to a customer.",
            "title_similarity": "0.6709779",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gxrwsiv",
            "score": 1,
            "text": "I saw a company that had management trainee, marketing, and public relations jobs that *all* turned out to be the same door-to-door sales job taking advantage of desperate young people looking to start their careers.",
            "title_similarity": "0.64659977",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gxrx210",
            "score": 1,
            "text": "My first job out of school was as a “Marketing Associate” where I was just doing cold-calls and emails to set up meetings for an actual salesperson. The whole sales organization called themselves Marketing, and the marketing team called themselves Strategic Marketing. Pretty ridiculous. \n\nBut that was selling expensive services and technology. Selling... appliances at a Costco, selling appliances door-to-door?? What is this the 50s???\n\nAnd for the record, I didn’t last long in that BDR job or with that company, but I’m much happier I got entry level experience in Sales versus entry-level marketing experience. Sales skills are some of the most absolutely valuable soft skills you can learn, and I got paid to learn it.",
            "title_similarity": "0.7619029",
            "sentiment_compound": 0.9172
        },
        {
            "id": "gxrx41f",
            "score": 1,
            "text": "I went for a 'grad' job as a 'marketing assistant' just after finishing uni. The office was backwater, near Manchester Piccadilly. A young chap interviewed (seemingly the boss), asking me why I wanted the job. I said the advert said there was training involved, and I'd just finished a history degree so real workplace training sounded great. There was no interview as such, it lasted minutes (classic bait and switch tactics), before he told me the next stage was a full day shift and at the end you'd be told whether you were right for the job or not. I wasn't falling for that, I thanked him and left and never showed up to work 8 hours for nothing. I later searched the company in Glassdoor (future generation marketing), turns out the job was door-to-door sales!! Remuneration was 250 pound a week or commission only, which is scandalous. The job interview was a lie, to deceive people to apply. Glassdoor reviews say most people leave halfway through the test day never to return. Glad I dodged that bullet",
            "title_similarity": "0.69062924",
            "sentiment_compound": -0.6335
        },
        {
            "id": "gxrx6fl",
            "score": 1,
            "text": "I almost fell into this trap. \"Wanted: young grads interested in moving into the marketing sphere and willing to take on management responsibilities at an early stage\" sort of thing. Went through two interviews before I smelled a rat and worked out what their game was, I would be selling crappy products and the end goal is that you bring other people in and get a cut of their wage like a pyramid scheme, that's what they meant by management. As soon as they said that I knew I was out. \n\nCalled my \"recruiter\" to say I didn't want the job and he flipped like that. Said how disappointed he was that I had no work ethic and how glad he was the company wouldn't waste any time on me. I hope the guys in the interview waiting room with me, all 21 like me, all fresh grads, figured it out too before it was too late.",
            "title_similarity": "0.79442245",
            "sentiment_compound": 0.7082
        },
        {
            "id": "gxrxbjw",
            "score": 1,
            "text": "Just saw an Appleby's \"Take Out Specialist\" job ad. \n\nEmployer: \"Can you describe some experiences you've had carrying food from a kitchen to a car? Its important we gauge your eligibility.\"",
            "title_similarity": "0.68933094",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gxrxhfy",
            "score": 1,
            "text": "I feel this hard, I only been applying to specific job and I still get calls for direct marketing.\n\nRecently got an email, call and text from a company I didn't apply for. I called back and ask what the position is for and they said \"marketing and direct sales\".\n\nWhen I ask when did I apply to this job, the dude became hostile and said yesterday. I haven't apply to any job for a week. Smfh.",
            "title_similarity": "0.7050506",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gxrxwte",
            "score": 1,
            "text": "Got caught by this scam (CutCo) my freshmen year of college. Booth said they were guaranteeing interviews for anyone at the college. Went and found out it was “sales and a lot more”. First day in of our training (which was just a sales pitch) me and another guy I had seen around campus went to “use the bathroom” and never went back.",
            "title_similarity": "0.7060927",
            "sentiment_compound": -0.657
        },
        {
            "id": "gxry33t",
            "score": 4,
            "text": "Yep. And if you can’t see yourself selling, you will be bad at this job and hate it.\n\nSource: Am Sales Director",
            "title_similarity": "0.7152043",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gxry6wk",
            "score": 2,
            "text": "> I don't have a problem with sales jobs\n\nIt sounds like you do.\n\nAnd that's ok.\n\nBecause sales jobs are crappy and often exploitative.",
            "title_similarity": "0.5892007",
            "sentiment_compound": 0.0408
        },
        {
            "id": "gxry842",
            "score": 1,
            "text": "I was lucky and avoided a job position like this by checking out their review on glassdoor. Three separate people complained about essentially being door-to-door salesman and being chased by dogs. Ever since then I automatically refuse any job that comes from a Marketing company.",
            "title_similarity": "0.723451",
            "sentiment_compound": -0.25
        },
        {
            "id": "gxry8wt",
            "score": 1,
            "text": "Not too long ago there was an interview I went to that paid slightly below my current pay but they boasted “free insurance isn’t that awesome ?” When they sent me over the hiring packet the “free awesome insurance” had an $8500 deductible and to cover the next tiered insurance that was $350 a month but they paid the FSA in the amount of the deductible which isn’t bad for a family but the fact they lied about the whole thing and the free insurance was basically the shitty insurance I didn’t want to proceed plus the job was trying to resume to the office, which I’m definitely not doing lol",
            "title_similarity": "0.6705566",
            "sentiment_compound": 0.6707
        },
        {
            "id": "gxrya2k",
            "score": 1,
            "text": "When I was 18, I searched for WFH customer service jobs because I didn't have a car to commute places and was recently fired from my restaurant job. So I came across this travel company that allowed you to WFM as a \"Virtual Agent\" on your own schedule and receive \"competitive compensation\". The job responsibilities appeared just like a customer service job such as providing account assistance, general questions, and \"soft sales\". \n\nWell, I apply and get an interview literally immediately. It was like one of those automated things where once you fill out the questionnaire and the system deems you to fit the general criteria, you can schedule an interview for the following week. It was a phone interview. It seemed like more of a sales pitch for the company than it was an interview. I was literally only asked two questions. One of those questions was \"Are you comfortable with cold calling?\" \n\nBefore I got this interview,  I knew exactly what cold calling was because I was aware that was absolutely something I did NOT want to do. After she asks that question, I follow up with \"Is the cold calling optional or is it something that I will be doing every day?\" to which her response was \"Well, telesales is a big part of this role. The majority of your job will be lead generation and customer retention.\" \n\nI continued through the rest of the interview and a few days later, I received an offer. I ended up declining because that was not something that I wanted to do and I was bummed that they basically misrepresented the job in the description.",
            "title_similarity": "0.7666188",
            "sentiment_compound": 0.9142
        },
        {
            "id": "gxryb72",
            "score": 1,
            "text": "I took an entry level job in finance after I graduated. I was told it was by no means a phone line position but that I would have a phone at my desk and taking calls would be a part of my responsibility.  Calls were set to go through our team in what was legitimately a fair flow of the person who has been off the phone longest got the next call. \n\nI wish I could say I was joking but I spent easily 7-7.5 hours a day on the phone. It was 100% a call center position for support for their reps but they just hide it as a legitimate position with opportunity for advancement.",
            "title_similarity": "0.6666966",
            "sentiment_compound": 0.9481
        },
        {
            "id": "gxryc8b",
            "score": 1,
            "text": "Technical recruiter here. Don’t ever be afraid to ask hard questions to the recruiter. If they can’t answer it then walk. Sometimes they might not have the information handy, just ask them to send you an email. Always check the companies website of the end client (company you’ll be working at) and the recruitment firm. Always Glassdoor a company both the end client and the recruitment firm, 4+ stars is typically a good indicator but the employee reviews are really what you want to read. You can find reviews for the specific job you’ll be applying for. Candidates have most leverage in an interview process so don’t feel like you need to agree with salaries or work responsibilities if it’s not something you’re okay with. \n\nP.S. feel free to message me if you have any questions or want some tips.",
            "title_similarity": "0.7235991",
            "sentiment_compound": 0.9245
        },
        {
            "id": "gxryg5e",
            "score": 2,
            "text": "You either generate revenue for your company or you will be supporting the people who generate the revenue for the company.",
            "title_similarity": "0.40893075",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxryhkw",
            "score": 1,
            "text": "I applied for a \"marketing associate\" position once. I knew through some glassdoor reviews what kind of company they were but I decided it might be fun to waste their time and I could use the interview practice at least. When I got there they did their whole pitch, typical MLM stuff. Make great money, move up the ladder in \"weeks\" build your own team etc etc. I knew what to expect, so I wasn't surprised but I questioned why none of this was mentioned in the job posting, especially the 100% commission pay. They finally caved and told me for confidentiality reasons they couldn't say in the posting that they were a 3rd party contracted out by a cable company to go door to door upselling packages.     \nI decided to play along, acting like I was super into it. They invited me back for a second interview later that afternoon, with the head of the company.     \n    \nI met with her later that day and she gave me the same pitch, FYI the company filing with the government, publicly available, listed the HQ as her apartment building, so another thing to look out for with these things. Nice apartment though. Anyway she gave me the whole pitch, I played along, claimed to be super into it. I got a call from them the next day telling me I got the job. But they wanted one last thing for me before they could officially give it to me, they wanted me to write an essay explaining why I deserved the job. I think maybe they realised I was wasting their time and this was a final test to see how serious I was, or maybe this was their way of making sure only the super desperate, that they could take advantage of, accepted.     \n    \nI never did write that essay, and they gave me all weekend to do it.",
            "title_similarity": "0.7481029",
            "sentiment_compound": 0.9897
        },
        {
            "id": "gxryinm",
            "score": 1,
            "text": "Once, as a desperate high school grad eager to see the world, I joined the Navy with the promise of foreign travel and exotic women. I saw a lot of sea, sat on many a stool, and swept.",
            "title_similarity": "0.5614621",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxryo2p",
            "score": 1,
            "text": "\"Premium\" phone sales inside of walmart in northeast is this exact scam shit, they harass you and hunt peoole down desperately trying to get a phone sale. Glad i left",
            "title_similarity": "0.80877644",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gxryrjw",
            "score": 1,
            "text": " Most jobs have a bullet point under duties that says “other duties as assigned.” Meaning it doesn’t matter what you interviewed for. They can make you do anything because you technically agreed to it.",
            "title_similarity": "0.49365675",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxryswt",
            "score": 1,
            "text": "Oh man I have been in the weeds sorting through A LOT of these lately.\n\nMost recently some company I had never heard of said they needed an office manager. Hey, I've done that. Pay is good, cool let's interview.\n\nIt was cutco. The knife selling pyramid scheme that just settled a huge lawsuit with former employees. Also, they wanted me to pay $200 for a knife set for myself so I could use them enough to sell them.\n\nI closed the zoom interview halfway through. I don't think they noticed because it was a group interview with about twenty other people. What a mess.",
            "title_similarity": "0.7326383",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gxryv9i",
            "score": 1,
            "text": "I started in sales and still work in sales. I got started by falling for an ad like this where I sold Kirby vacuums door to door. I made $300 in 3 weeks working 12 hour days 6 days a week. It was straight illegal working for pennies an hour.",
            "title_similarity": "0.5929257",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gxryxpz",
            "score": 1,
            "text": "At a college fair, I was told by the corporate recruiter of A&F that I was selected for marketing and advertising position. I went to their 'regional headquarters' in CT. They wanted me to work in the store to sell clothes. I walked right out.",
            "title_similarity": "0.6387878",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gxrz2t8",
            "score": 1,
            "text": "I had this happen recently, took an interview for what I believed to be a Marketing Associate role where I would be doing campaign work and improving my skills in communication and analytics.\n\nIt turned out to be a gig hawking AT&T plans in the electronics sections of various area Walmarts. Working hours 9-6, Monday-Saturday, for about half of what I'm getting at my current employer. But don't worry, with commissions I \"would be making 6 figures in no time!\"\n\nNeedless to say I did not continue with the interview process after the first round.",
            "title_similarity": "0.7252294",
            "sentiment_compound": 0.3614
        },
        {
            "id": "gxrz6wa",
            "score": 1,
            "text": "If it says \"maintenance\" it means cleaning crappers.",
            "title_similarity": "0.40858066",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxrz7mu",
            "score": 1,
            "text": "I was asked to come interview for an \"HR Benefits Manager\" position.  The job description read exactly like what that position sounds like.  When I got to the interview location, it was in a mostly-empty industrial complex, with what looked like one room rented from a vacant office.  \n  \nI was the first interviewee, with about a dozen or so others lined up at the door behind me.  \n  \nI went in, and (surprise surprise!) it was a job *selling* crappy term life insurance via cold-call telemarketing.  They even tried to hide it a little longer by telling me that life insurance was a \"benefit,\" and I was getting their lead list from the company HR department.  Sure, buddy.  Every HR department sends out lead lists.  Uh huh.  \n  \nI had nothing better to do, so I let them do their entire spiel.  I even made myself sound super hyped about it.  Then I asked to be excused to use the bathroom, exited the office, and told the other candidates what the scam was.  A couple of them stuck around, but the rest left with me.",
            "title_similarity": "0.7257408",
            "sentiment_compound": 0.653
        },
        {
            "id": "gxrzhmk",
            "score": 1,
            "text": "What really grinds my gears are the job listings that pretend they're for one thing when in fact surprise surprise it's just sales. This happens all the time with \"artist\" jobs. They want you to do all their in house graphics but also answer the phones and ring up customers and sell product. It's hard enough for people to take artists seriously as it is and then they waste your time with this kind of crap.",
            "title_similarity": "0.84679705",
            "sentiment_compound": -0.8458
        },
        {
            "id": "gxrzl5p",
            "score": 1,
            "text": "I answered an ad that simply said “General help wanted” with a phone number that was answered by a machine. I left a message and got a robocall later telling me when and where to show up for an interview. I went and found a bunch of guys all sitting around asking each other if anyone knew what the job was. Finally a guy came in and told us it was telemarketing. More than half of us got up and left on the spot.",
            "title_similarity": "0.6243479",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxrzmxf",
            "score": 1,
            "text": "Question. Is that not misrepresentation? Ibhave always thought this should be an illegal action as a lot of agency. Recruiters ans such almost lie to you to get their numbers in wasting your time but they still get paid. \nShould this be illegal? Yes\nIs it. Id love to know.....",
            "title_similarity": "0.741551",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxrzp93",
            "score": 1,
            "text": "Pre-covid, I was working as a GMIT (general manager in training) at 24 hour fitness. During my interview I was really impressed that they were moving away from intrusive sales tactics and had got rid of the sales positions all together. As the GM explained it was a major complaint from members, little did I know that the new business model was to just pivot the name of the sales force to...you guessed it the GMIT. I figured this out as I was immediately tasked to sell memberships. I quit within the week.",
            "title_similarity": "0.7014152",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxrzqlj",
            "score": 2,
            "text": "I accepted a job at a “marketing firm”. They let us know that the word marketing came from farmers who would go to market to sell their goods. The job was actually selling DirectTV inside Costco. I quit the first day bc it was 5 hours of constant rejection. We got one guy to sign up bc he was tired of paying two different cable bills (one was for a motor home). At the end of signing up, the rep that was training me tells him that he’ll still have two bills bc this was Costco DirectTV and not the standard DirectTV. Whole thing was a massive pyramid scheme to hide the fact that you’re actually working for AT&T without knowing it.",
            "title_similarity": "0.72248816",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gxrzzh4",
            "score": 1,
            "text": "Yup I experienced this early in my career, went to the interview and they were really only interested in how many calls I could make an hour - expectation was around 40, I didn't bother with any follow ups.",
            "title_similarity": "0.59572256",
            "sentiment_compound": 0.6142
        },
        {
            "id": "gxs02gc",
            "score": 2,
            "text": "This is great. I work sales for a big/global company in the tech world. Our college recruiters actively avoid college fairs and instead go to the schools business school events. This is so that our sales team isn’t bombarded with engineers looking for opportunities but instead people in the business world looking for sales careers. So we have an active presence in many universities. Especially in their sales clubs. \n\nGreat points!",
            "title_similarity": "0.7700596",
            "sentiment_compound": 0.9312
        },
        {
            "id": "gxs07at",
            "score": 2,
            "text": "Also some \"sales\" jobs are going door to door trying to sell homeowners windows and doors. My friend fell for that scam one time, quit on his first day",
            "title_similarity": "0.73648345",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxs07qn",
            "score": 1,
            "text": "Correction. That will be how you're paid.\n\nYou'll still be expected to handle all those other list items.",
            "title_similarity": "0.3693829",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs0i5b",
            "score": 1,
            "text": "This is patently false. You'll also probably be cleaning often when you could be making sales.",
            "title_similarity": "0.6887587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs0llf",
            "score": 1,
            "text": "Sales is kind of an ugly word, so im not surprised. If recruiters bend the truth, they get someone who isnt good at sales so whats the point lol?",
            "title_similarity": "0.7205459",
            "sentiment_compound": -0.3686
        },
        {
            "id": "gxs0lxx",
            "score": 1,
            "text": "This is a great LPT. I was hired to be a “senior account coordinator” at a company called Benchcraft in Raleigh, NC. Essentially it’s a job that you cold call people within a certain jurisdiction of miles, pretending to be the head of the local golf club, asking them to buy advertising space on a golf card.\n\nI have to give myself some credit, I was able to get 4 people signed up. I thought I was doing ok. The next day I got a call at the office, from corporate, telling me I had been let go. Oh yeah, this is right before Christmas, on my birthday, December 21st. \n\nI’ll never fall for these scam jobs again. Luckily I landed on my feet with a good company right after this, but seriously. Fuck benchcraft, and fuck everything it stands for",
            "title_similarity": "0.6334142",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gxs0ntg",
            "score": 1,
            "text": "Oh I have 2 jobs that fit this description as well.\n\nFirst one was for a company posting both customer service and sales jobs, I was clear both in my application and with the recruiter that I was only interested in the CS role.\n\nThen during the interview with the manager they asked I was interested in a sales position. When I told them I wasn't they said they were no longer hiring for CS but asked if I wanted to continue. Nope.\n\nSecond one was something with ads and marketing. I remember specifically in regards to social media.\n\nWith no experience I studied some SEO etc before the interview and that definitely came in handy, manager said he was impressed and wanted me to join the team for a day and see what the job was like. Sounds great!\n\nThe day I arrive expecting to be working in an office with marketing we are shoved into the company van, sent to village nearby and told to do door to door sales.\n\nI was asking the guy I was shadowing and apparently that's all the job was. There was also no salary but just commission. I couldn't even leave as they drove us there so I spent 8 hours walking around with this guy in a random village I have no idea where.\n\nThat was a hard no from me as well.",
            "title_similarity": "0.69339967",
            "sentiment_compound": 0.9514
        },
        {
            "id": "gxs0rlc",
            "score": 1,
            "text": "This couldn't be more true for military AFSC codes. Even worse is that it appears that any relevant information about the job tends to be scrubbed, and any one code can have you doing many completely different things. \n\nTurns out 'Missile and Space systems maintenance' can be anything between basically, ac guy, diesel generator repair, stacking ICBM components, site inspection/repair, personal inspection, replacing electrical cabinets/ batteries, instruments calibration, proofloading, security clearance management, equipment inspection/ accountability, and parts ordering. \n\nThe 2M0X(1,2,3) codes have descriptions that are NOTHING close. It is honestly comical.",
            "title_similarity": "0.6897353",
            "sentiment_compound": -0.0641
        },
        {
            "id": "gxs0v5x",
            "score": 1,
            "text": "I used to be in marketing, and at the same time had a buddy who said he’s gotten a job in marketing - his actual job was basically cold calling (telemarketing). Scary part was he thought we were doing the same type of stuff as a traditional marketer - they genuinely tricked him him to thinking that cold calling is the same as what I was doing such as market research, writing copy, doing ad campaigns, landing pages, setting up marketing collateral/content, white papers and websites. I have nothing wrong with either work, just need to call out that he was misled into straight sales/biz-dev and top-of-funnel lead-gen being branded as “marketing”.",
            "title_similarity": "0.7769836",
            "sentiment_compound": -0.089
        },
        {
            "id": "gxs10l0",
            "score": 1,
            "text": "Yeah I found this to be true for two jobs I applied for. Interviewed for both and left in the middle of the interview. They positioned the jobs as a customer service rep basically. I needed a 9-5 desk job and thought this would be fine. Went to one interview and it was door to door sales and I’m like yeah no not interested, asked if they had any actual customer service/secretarial jobs and he said no so I left. Second one, I honestly can’t even describe because it was some kind of bullshit. But definitely sales involved. Thankfully I was able to get the job I have today and they were pretty clear there is sales involved but it isn’t job/money dependent (I still get paid regardless of sales) and my starting pay was way higher than anywhere else.",
            "title_similarity": "0.71110857",
            "sentiment_compound": 0.954
        },
        {
            "id": "gxs14ev",
            "score": 1,
            "text": "Having worked for one of these companies for a few months, it's even worse than that. As expected their industry has one of the single worst turnover rates ever, so the way you move up in the company is to sign more and more people to your \"team\" and get a cut of their profits. Then your team signs on more people for their team and you get a cut of those peoples profits and on and on it goes. It's basically an MLM which you get paid for. The actual meat of the job is barely the job, it's getting schmucks like me to rope other schmucks into the business.",
            "title_similarity": "0.71216416",
            "sentiment_compound": -0.7378
        },
        {
            "id": "gxs1dac",
            "score": 1,
            "text": "My last job was at a car dealership. The sales people were known as \"Product Specialists\" (facepalm)",
            "title_similarity": "0.54379106",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs1lln",
            "score": 1,
            "text": "If you’re looking to get into Marketing and you see those Marketing Assistant roles. You best believe you will be an EA.",
            "title_similarity": "0.51691073",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxs1nln",
            "score": 1,
            "text": "At this point my summer job as a general helper at a furniture *cough coffin *cough factory did not seem so bad after all. Normal working hours, ok coffee and you basically get paid to work out! Lift a solid oak coffin 5 high? Ok...",
            "title_similarity": "0.5302901",
            "sentiment_compound": -0.1489
        },
        {
            "id": "gxs20ch",
            "score": 3,
            "text": "Thank you for your posting this. I’m looking for an entry level job right now so this is perfect timing.",
            "title_similarity": "0.33948824",
            "sentiment_compound": 0.7553
        },
        {
            "id": "gxs2557",
            "score": 1,
            "text": "Basically, you're trying to get out of a sales job and you apply for what is actually a hidden sales job because they know their applicants will all be people trying to leave retail",
            "title_similarity": "0.8039234",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gxs28l7",
            "score": 1,
            "text": "Wow ! Here’s a brand of toilets....",
            "title_similarity": "0.21650293",
            "sentiment_compound": 0.6239
        },
        {
            "id": "gxs2ig1",
            "score": 1,
            "text": "Some products just don't sell themselves... kinda like job applicants.",
            "title_similarity": "0.5397996",
            "sentiment_compound": 0.2975
        },
        {
            "id": "gxs2k4w",
            "score": 1,
            "text": "The nice thing about experiencing this is you usually only fall for it once. That feeling of second hand embarrassment for the guy interviewing you mingled with disbelief leaves an impression.",
            "title_similarity": "0.55250514",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gxs2thz",
            "score": 1,
            "text": "Yup, right out of uni, bit desperate, interviewed for a “marketing job” with just zero information. Flashy office, flashy dudes. Was told to come back the next day dressed smartly again for more interview. It was a whole day of accompanying 2 blokes on door to door sales, and a sales spiel from them as to why I should be working there. If I’d taken the job that day would also have been unpaid training. Also “untapped earnings” = commission only, no guarantee of work. I nearly took the job I was that desperate. My housemates convinced me not to.",
            "title_similarity": "0.81820476",
            "sentiment_compound": -0.0361
        },
        {
            "id": "gxs2vzm",
            "score": 2,
            "text": "I once applied for a job as a \"Customer Service Rep\". Everything about the ad made sense, sounded like a call center actually but I wasn't being picky at the time.\n\nAs soon as I got there it seemed weird. I talked to the guy and he kept evading my questions, even though they were totally normal ones like \"So, this office is pretty small. Where does everyone actually work?\". He asked me to stick around to meet someone, and I agreed.\n\nThen I'm ushered into a room full of other people waiting. This is the moment I knew I was wasting my time, but I was also curious to see what kind of bullshit they were about to pull.\n\nFinally some sketchy guy in a cheap ass suit comes in and starts talking about insurance sales. I let him go on for a bit then raise my hand. I say \"So really you tricked us all into coming in here for a fucking door to door insurance salesman job?\" and he's like \"If you want to leave you can\" and I say back \"Answer my question\". He confesses, I call him a fucking piece of shit and leave. \n\nThe biggest surprise of the day was that I was the only one who walked out haha",
            "title_similarity": "0.729709",
            "sentiment_compound": 0.6253
        },
        {
            "id": "gxs32bs",
            "score": 1,
            "text": "I wish so badly someone told me this after I graduated business school. They also have weird names like “TBO Enterprises” “RGT Industries” and if you look at them on Glassdoor there are amazing reviews where the only cons are “you can’t be afraid of hard work”. \n\nThen if you do apply they will email and call you nonstop until you block their number.",
            "title_similarity": "0.81111205",
            "sentiment_compound": 0.0795
        },
        {
            "id": "gxs337q",
            "score": 1,
            "text": "As a former Customer Service Rep who was told I would be dealing with warranty claims, technical issues including remote diagnostics/diagnoses of equipment. Nope, primary job sales. The salary was based on a percentage of gross profit.\n\nI ended up doing ok in the job but couldn’t handle making a career of it. I stayed 5 years too long though",
            "title_similarity": "0.6364331",
            "sentiment_compound": 0.128
        },
        {
            "id": "gxs34zk",
            "score": 1,
            "text": "This is just as bad as the “be your own boss and set your own schedule while inspiring others”.",
            "title_similarity": "0.71119046",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gxs3boo",
            "score": 1,
            "text": "But it said that there is an unlimited earning potential!",
            "title_similarity": "0.14233823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs3jjp",
            "score": 1,
            "text": "Had a similar experience for a position titled \"Event Marketing.\" In my limited experience (and unfounded optimism) I interpreted it as coordinating conventions or expos to connect vendors and clients.\n\nThe \"event\" was selling remote garage door systems and crap like that at Sam's Clubs and Costcos.\n\nI'm horrible about wearing my thoughts through my expressions, so my \"interviewer\" (she talked at me about the job for 40 minutes and asked me maybe 2 questions the whole time; the entire thing was a red flag) probably saw me lose interest and gain some kind of disdain for the situation a few minutes in.\n\n(Like others have said: the job's a job, so whatever. Just don't lie about it to rope people in.)",
            "title_similarity": "0.8337734",
            "sentiment_compound": 0.204
        },
        {
            "id": "gxs3xe1",
            "score": 1,
            "text": "So true. As someone with a marketing degree, trying to get a job in marketing, I have run into so many issues because of these bait & switch tactics. It’s so predatory and disgusting.",
            "title_similarity": "0.7658223",
            "sentiment_compound": -0.1458
        },
        {
            "id": "gxs4ei5",
            "score": 1,
            "text": "Anyone else excepting a GTA wing clip explosion 😂",
            "title_similarity": "0.36978152",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxs4jyw",
            "score": 1,
            "text": "An important note to add here: if you work in a \"right to work state\" then this LPT doesn't matter unless you have a signed contract. You can be fired for no reason at all in one of these states, meaning that they are not required to list a reason for termination.",
            "title_similarity": "0.53492874",
            "sentiment_compound": -0.6217
        },
        {
            "id": "gxs4lxq",
            "score": 1,
            "text": "Company 9–based in the cleveland/Toledo OH area \n\nApplied a few years ago for what sounded like a consulting position that based on reviews I’ve gathered turns out to be more door to door sales and call center stuff. Turned them down when they offered me the job cause I had no idea what they actually did big picture and cause the CEO (being interviewed by the CEO was another huge red flag) talked about sales a lot for an interview for a consulting role. \n\nHave followed them in media since, and still have no idea what they actually do, but watching them attempt to answer the question is hilarious. Pretty sure this narcissistic dude just wanted to make a business about himself, I have no idea where their revenue to stay afloat actually comes from",
            "title_similarity": "0.77934265",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gxs4yzn",
            "score": 1,
            "text": "Don’t be afraid of sales. It’s where you’re going to make the most money, and in a lot of cases, it’s as simple as following a plan or system.",
            "title_similarity": "0.4609709",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs4z3c",
            "score": 1,
            "text": "Really good doc about this called 'The Slave Circle'. Check it out.",
            "title_similarity": "0.29438913",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gxs52xw",
            "score": 1,
            "text": "Tech support for a huge mobile insurance company that literally only gives a shit about sales. My supervisor doesn’t even answer questions about anything not related to selling the package we push. When I started it was one sale a week to stay in the green. That was like 8 months ago and it’s since moved up to 2-3 a day. We just get threatened with corrective action and write ups if we don’t get 2 a day, which no one consistently gets and according to my coach, should be given to literally everyone on the team. It’s a shitty environment for sure because I just wanted tech support experience.",
            "title_similarity": "0.7024002",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gxs5755",
            "score": 2,
            "text": "They'll also straight up lie.",
            "title_similarity": "0.3301052",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxs5930",
            "score": 3,
            "text": "Another title that's code for sales, and this one is by a super wide margin the most common, is \"Account Manager\".",
            "title_similarity": "0.49401003",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gxs59q0",
            "score": 1,
            "text": "Also credit and collection, I had a good position in the accounting area, they offered me a position to coordinate a branch in another city, almost double the salary, I accepted immediately, within the functions it said \"collection\". I am calm and introverted, I am good at coordinating and managing, but I have no ability to claim and collect, I only lasted 3 months in the position and had to leave the company. </3",
            "title_similarity": "0.5773104",
            "sentiment_compound": -0.5176
        },
        {
            "id": "gxs5d0v",
            "score": 1,
            "text": "Yeah, a little too late for that I guess. Applied with the expectation of being mainly customer support but I'm just getting railed by sales targets right now.",
            "title_similarity": "0.6671928",
            "sentiment_compound": 0.3506
        },
        {
            "id": "gxs5fcu",
            "score": 1,
            "text": "Vivint Solar. Don’t waste your time. Training is unpaid and they make a point to mention you should be paying them.",
            "title_similarity": "0.566628",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gxs5jh5",
            "score": 1,
            "text": "To add to this beware of the title of the job being Customer Service Rep. I've noticed in the descriptions or interviews that it's just another name for Sales being rebranded",
            "title_similarity": "0.7254767",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs5lya",
            "score": 1,
            "text": "I did sales out of college and it wasn't for me. But I sure did make a lot of money those three years, it was pretty fun. But really hard. \n\nWait actually fuck sales.",
            "title_similarity": "0.5637992",
            "sentiment_compound": 0.7105
        },
        {
            "id": "gxs5smr",
            "score": 1,
            "text": "Yeah, I’ve worked a few d2d jobs myself. They’re complete shit, but they’re good as a summer job for college kids bc some of them pay extremely well.\n\nOn the last one I did, the company paid for the apartment for the summer, which was a new unit with WiFi, gas stove, washing machine, etc. It was all commission of course, but you got $200 for setting someone up with a consultation. They don’t end up buying? That’s ok, here’s $200.\n\nObviously this company was completely up front with what they expected, but I still fully agree with your post. If it’s hidden in any way, that company is complete shit 99% of the time.",
            "title_similarity": "0.61695147",
            "sentiment_compound": 0.5313
        },
        {
            "id": "gxs5vec",
            "score": 1,
            "text": "I came across a few of these when applying to jobs a couple years ago and went to a couple interviews. It was very odd as both were seemingly in offices that were thrown together/ only there as a front for the interview itself. Then the interview would be mostly the employer talking fast and not letting you get in a word, I left feeling like I had no idea what the job was still, but sure enough it was a sams club sales thing or something similar.",
            "title_similarity": "0.7477344",
            "sentiment_compound": 0.3723
        },
        {
            "id": "gxs6jhc",
            "score": 1,
            "text": "Glengarry Glen Ross\n\nThe Boiler Room\n\nThe Prime Gig\n\nThree films on the reality of sales.",
            "title_similarity": "0.49043748",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs6o1c",
            "score": 1,
            "text": "This isn't just for scams, this is normal business.  \n\nEvery manager wants a sales person that sells AND does other shit.  \n\nIf it's other shit OR sales, well you can't have any other shit without sales. \n\nIf you generate money for your company THAT is your #1 priority,  everything else is superfluous.  If your job is sales,  and your boss gives you a task outside of sales,  ignore him if it means you can sell more - 1000% that if the other stuff isn't in your job description.   That's common behavior for NON MONEY GENERATORS that will drag your#s and give them credit for your extra work. \n\nDon't be a sucka.",
            "title_similarity": "0.7912134",
            "sentiment_compound": -0.814
        },
        {
            "id": "gxs6rqk",
            "score": 1,
            "text": "One thing to note is that they’ve gotten pretty sophisticated and often have full-blown websites pretending to be marketing agencies. In my experience, sometimes they don’t even mention sales on the job description at all.\n\nYou just have to look for their clients on their website (as they either wont have any or they may list who they sell for, like AT&T).",
            "title_similarity": "0.786394",
            "sentiment_compound": 0.8658
        },
        {
            "id": "gxs6wj2",
            "score": 1,
            "text": "Here is another one - if a friend from college hits you up after a year or two of not hearing from them out of the blue and wants to \"go to lunch\" to catch up or something else non chalant sounding, check their LinkedIn.  I bet they work for Northwestern Mutual or a similar company hawking life insurance to everyone in their contact list.  \n\nYou about to get the sales pitch.  How awkward for both of you right?",
            "title_similarity": "0.6854018",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxs733f",
            "score": 1,
            "text": "LPT: Never go towards the light.",
            "title_similarity": "0.24935657",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs7478",
            "score": 1,
            "text": "If the company name isn't listed in the job ad then its a scam period. I've seen a lot of these. Some jobs drop you off in a neighborhood when you show up and its door to door sales. Make sure you have a phone on you and a way out if you get dropped off in some neighborhood, you will want it. If they make you leave your personal phone behind run fast. Others when you come in for the interview you find out its in some shady place and its an MLM. This has been going on for something like 20 years too, nothing unusual really.",
            "title_similarity": "0.68635845",
            "sentiment_compound": -0.6166
        },
        {
            "id": "gxs77ww",
            "score": 1,
            "text": "Not for me. I was hired as a chemical salesman in pulp and paper, and my day to day is like 20% testing/reporting, 10% accounting, 25% engineering, 40% menial labor/maintenance, and maybe 5% sales. Honestly it’s a pretty good gig.",
            "title_similarity": "0.5518201",
            "sentiment_compound": 0.891
        },
        {
            "id": "gxs7993",
            "score": 1,
            "text": "This is important information people need to be aware of. Gj",
            "title_similarity": "0.2251474",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxs7ihw",
            "score": 1,
            "text": "We are looking for a hard worker to be the next district manager of our { knife, Forex, Magic Car Cleaner, Insurance, etc.}.",
            "title_similarity": "0.6745987",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gxs7izz",
            "score": 1,
            "text": "Point of record: Recruiters don't craft resumes (other than their own), they write job descriptions.",
            "title_similarity": "0.56508857",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs7kj0",
            "score": 1,
            "text": "This doesn\\`t apply to big companies. This will be a long wall of text and the experience was funnyn\\`t.\n\nFour years ago i finished high school and was desperate for work, so i browsed job ads and i got myself involved with a tourist resort on the edge of my town in the woods, working as a chef help. You know, the fucker that peels potatoes and does the dishes all day. That was my job in the 1st day from 7am to 9-10am. Then i was sent to clean the furnace, then i mowed a backyard with a scythe of course, then i had to tow a boat to the lake across the street through 100m of woodland and sail to a spot in its middle and feed the fish. That would attract the fish and then i had to catch around 3kg of fish for the dinner that day, and when i got back with the fish, i had to sweep the interior and exterior parking lots and clean the entire yard (i\\`d say around 500 square meters worth of space in total) because the next day was garbage day and all the bins had to be filled with whatever wasn\\`t wanted on the property.\n\nThe next morning, again, 2 hours of dishes and then i went to another back yard where a lumber truck pulled in to deliver logs for the fire. Logs that i had to cut with a chainsaw and split with the axe, alone of course, and kinda racing time because the day after garbage day was the laundry day, and the rest of the staff was busy arranging the rooms and housekeeping. Which meant the other 3 girls employed to staff around 40 guest rooms across 3 buildings and the restaurant itself with a fucklot of traffic daily from biking tourists stopping for lunch, to fishermen from the lake shore coming to eat, it was basically nonstop operation, not just around the main course times. Oh, and remember about sweeping the parking lots with the broom? Well, that area was a pine forest and needles were everywhere, and that task had to be done daily before going to sleep, otherwise the needles would get soggy and hard to clean in the morning. And almost all the gutters had to be weekly cleaned of needles and pine cones because the area was huge and it was autumn.\n\nFirst i thought it was some crash course or endurance test, to have me prove myself and assure them i can work 20 hours worth of tasks in 14 hours worth of time, and eventually i\\`d be given a more manageable schedule after i\\`ve learned to do everything that had to be done. And of course i talked to the family that owned the spot and got trash talked about how the previous employee did everything i was tasked to do, then had time to rest during the dinner in the lobby area at 8pm. I usually finished my tasks at 11pm and went to bed at midnight to get enough sleep to work from 6am next day for basically the entire day without breaks. The only breaks were the main courses, when we\\`d eat for around half an hour in peace, other than that, i\\`d consider a break the time it took me to travel from doing one task to the next.\n\nI finally sticked my dick when the boss took me to another back yard i didn\\`t knew existed to help him build an access road for quad bikes. That meant digging the width of the road 10cm deep into the ground and filling it with crushed stone pebbles. Easy and fun, but the problem was i had to load and unload the pebble platform with a shovel, and the road was around 100m long, winding through the woods, and of course car access was impossible there so everything had to be done by first loading the truck platform with pebbles from the property, driving a few hundred meters away, then using a wheelbarrow to carry and spread pebbles where the car couldn\\`t reach. Of course alone But after the 3rd day i woke up one hour earlier, at 5am, and just left. Took the first bus and train home without getting my money for those 3 days because fuck that bullshit.\n\nBut. I\\`ve seen some nasty fucking bullshit in their restaurant and it just so happens i\\`m studying food safety in university, and i\\`m a few months away from graduation. What if i\\`d just so happen to get hired by an inspection company and just so happen to be designated over that part of the town, and just so happen to go pay them a visit and just so happen to find rules violated? We\\`ll fucking see.",
            "title_similarity": "0.6586814",
            "sentiment_compound": -0.9782
        },
        {
            "id": "gxs7pcg",
            "score": 1,
            "text": "Vector Marketing anyone?",
            "title_similarity": "0.28084725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs829n",
            "score": 2,
            "text": "Also, if your “interview” is a group interview, just bail.",
            "title_similarity": "0.35767645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs8b7m",
            "score": 1,
            "text": "Any success stories out there?",
            "title_similarity": "0.18664703",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxs8voc",
            "score": 1,
            "text": "Also if it mentions manager training or anything like that you will be asked to sell a shit product with little to no training.",
            "title_similarity": "0.74747574",
            "sentiment_compound": -0.4627
        },
        {
            "id": "gxs93h0",
            "score": 1,
            "text": "Yeah I went to an interview for something that definitely turned out to be this.  Drive 45 minutes and walk into the fucking casting couch office.  Like no receptionist, all looked like a set.\n\nSome young dude in a suit comes out later and calls me back, and he was the biggest douche I could imagine.  Asking what motivates me, then going on a spiel about how money is his motivator and he wants to retire when he’s 30 and being really pushy about the “you gotta take what you want” personality.\n\nHe started explaining the job of “managing a team” for him, and I picked up from it IMMEDIATELY that I’d be standing in Walmart trying to sell cable and internet.  Dude offered a second interview and I turned him down.\n\nMade the right choice, because the next interviews were in and they were all in just sweats and tshirts.  Looked into the dude’s company, and find one article referencing him and his company and how they’re a fast growing business, and then referenced another article about his accomplishments he’s done and how awesome he is.  Guess who wrote both articles?",
            "title_similarity": "0.7084664",
            "sentiment_compound": 0.8228
        },
        {
            "id": "gxs9fyd",
            "score": 1,
            "text": "Just to tack on to this, always google a company you are applying for anyway. Find their company page and read their mission statement. Find out what they do and read reviews about them. It definitely helps to know what you're getting into and its easy to look most of them up. If you can't find anything after a few Google searches, then you sould probably avoid them.",
            "title_similarity": "0.62737435",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gxs9i9q",
            "score": 1,
            "text": "I was so in need of a job after college I applied to an Executive Assistant job that listed sales. Instead of an interview I got a 'try out' and my coach flat out said This is a pyramid scheme and that she was trying to get out.  I still kept coming back. After three months of making less than 100 bucks for a 40+ hour week I gave up.",
            "title_similarity": "0.6694658",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs9lpd",
            "score": 3,
            "text": "Went to an interview for something very similar to this. Secretary was scantily clad and it was in a legit office. The guy I met with (the owner) had a painting of himself on the wall and the chair I sat in was comically small, especially in comparison to his giant office chair. \n\nBefore I left they made me do a rah rah chant with them all. I didn't return. Later found out they sell paper to other companies. Dude was literally a douchier Michael Scott.",
            "title_similarity": "0.63407195",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxs9mzf",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.14069638"
        },
        {
            "id": "gxs9rxn",
            "score": 1,
            "text": "On the other hand, I now know where to look for sales gigs.",
            "title_similarity": "0.38342124",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxs9ub1",
            "score": 1,
            "text": "Got burned by this. Fortunately, wised up at the interview.",
            "title_similarity": "0.43748116",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxsa2ol",
            "score": 1,
            "text": "I worked as a recruiter for one of these places for a month while I job hunted.\n\nThey'll tell you that if you work hard and perform you'll have an office of your own to run! \n\nIn reality they may open 2 or 3 offices but those offices never last long. Also, most of the top performers will be set up to fail once they start asking about getting an office. Then the moment their sales fall they will be \"benched\" aka not called in to work. They'll bench you until you quit then they don't have to pay unemployment.\n\nAdvice from a guy whose been around the sales world a long time, never take a sales job that doesn't have a base.",
            "title_similarity": "0.71395695",
            "sentiment_compound": -0.7936
        },
        {
            "id": "gxsafqj",
            "score": 1,
            "text": "I had a bad experience in job search when I graduated (10 years ago). I applied to 3rd party recruiter for help expanding my job search for entry level position in accounting and it was the biggest mistake of my life.\n\nI saw a entry level account payable position posted from 3rd party recruiter and asking for recent grads to apply because huge job demand in the summer. I applied and few hours I got a phone call. The recruiter was very thrilled about my resume (my resume was short and no work experience in accounting) and told me all of the entry level accounting job opportunities they had. He  setup meeting in his office and he wanted to know more about myself and my career goals. The location of the office was in downtown. The parking was very hard and had to park in a expensive garage (high $8 per hour).\n\nI waited over 1 hours in the lobby and it past my meeting (apparently the recruiter took a longer lunch with his coworkers). Finally, he met up with me and begin my interview. He asked me questions about myself and my goals in life. He looked at my resume and told me my resume wasn't expected to be and needed work experience. I told him I'm recently graduated and looking for an entry level work as we TALKED on the phone. He explained to me I needed at least 1-2 years of experience to land a job and laughed at my resume for a few times.\n\nHe gave me other job postings that guarantee I get the jobs and it's not related to the career I wanted to go. He told me this position higher pay and it was door to door or cold calls position. He was really pushing me to apply because of the contracts. I lost all interest and respect. All I wanted to end the conversation and leave. I told him my parking was running out and I will take a look on your posting. I never contact him or he contact me ever again. What a waste of my time.\n\n3rd party recruiters are jerks in my experience. They want your contacts and careless about you and your career. They also sold my personal information. I had  constant email and call spam.",
            "title_similarity": "0.7026707",
            "sentiment_compound": 0.8074
        },
        {
            "id": "gxsalpy",
            "score": 1,
            "text": "Sounds like Cydcor and it's affiliates are still going strong.",
            "title_similarity": "0.09506473",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxsaqti",
            "score": 1,
            "text": "I'm unemployed in Arizona. Literally the entire platform of ziprecruiter is solar sales jobs or other jobs that are door to door cold hard sales. That was a good week of my life wasted. They really do try to hide it.",
            "title_similarity": "0.6185235",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxsaw0p",
            "score": 2,
            "text": "Around here \"Fast Paced\" are the buzzwords for \" You'll be taking the place of three robots we're not willing to spend money on.\"",
            "title_similarity": "0.6959279",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsawi4",
            "score": 1,
            "text": "I ignore most everything about the job posting until I talk to someone doing the job. \n\nEven in the top end of IT Engineering, the job posting is still complete horse shit written by an HR intern.",
            "title_similarity": "0.63049245",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxsayit",
            "score": 1,
            "text": "I recently did a phone interview for a position that the job posting said would involve about 20% customer service. During the interview I asked what the average day to day would look like.....yeah it’s almost entirely customer service.\n\nNooooo thank you",
            "title_similarity": "0.45198888",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxsbka2",
            "score": 1,
            "text": "Entry level marketing job ≠ Commercial phone and internet salesperson",
            "title_similarity": "0.52177703",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsbkqi",
            "score": 2,
            "text": "Just want to chime in that these are almost always “performance based” jobs where if you do not meet their very unreasonable quotas you get canned. Amazon drivers know these quotas and these chip shop places use the exact same tactics to squeeze the life out of you and pay you the bare minimum.",
            "title_similarity": "0.7681619",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxsbp6y",
            "score": 2,
            "text": ">They will list these jobs as being \"Event Coordinators\" or \"Marketing Associates\".\n\nAs someone who was once searching high and low for *actual* Event Coordinator jobs, heed these words. In the Sea of Marketing and Events, there be more dragons than sailors.",
            "title_similarity": "0.63104504",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gxsbtb6",
            "score": 2,
            "text": "Another tip: if you have to spend more than 5 minutes trying to find out what they actually sell, they’re a scam.\n\nWent to a “marketing associate” interview that was 100% commission, it took about 6-7 questions just to get the answer to “what am I selling to make this commission” and she FINALLY (reluctantly) told me. They ask for donations for non profits. They never said that on the job app, or on their website. And she looked a little annoyed that I even asked.",
            "title_similarity": "0.6740104",
            "sentiment_compound": -0.5434
        },
        {
            "id": "gxsbv3l",
            "score": 1,
            "text": "I dont see how 10 more years on top of the decade*s* I've already worked would change much.  Your naive view on work that exists either tells me you've always worked the same job, are an edgy college student that assumes they know better, or simply doesn't understand what the concept \"Sales\" entails.",
            "title_similarity": "0.7224883",
            "sentiment_compound": 0.4336
        },
        {
            "id": "gxsc4vs",
            "score": 1,
            "text": "Check on Glassdoor, but read all the reviews. These type of companies will have their employees write fake positive reviews, but if you get through all of them you’ll get to the truth. If you can find out the name of the “President” or whatever they’re calling their “CEO” google that too. It can be telling.",
            "title_similarity": "0.71506155",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxsdkam",
            "score": 2,
            "text": "I'm so glad someone else has noticed this! A lot of these companies have such a pyramid scheme feel, too. It's especially hard for me because I'm currently looking for jobs that are actually Event Coordinator or Marketing Assistant so I see these companies all the time.",
            "title_similarity": "0.671659",
            "sentiment_compound": 0.4389
        },
        {
            "id": "gxsdnlm",
            "score": 1,
            "text": "Learn from them and apply those truth bending tactics to your resume. \n\nI once had a girlfriend who took money at a traveling teen dance club ask me how to put that on her resume. \n\nI responded with Admissions Attendant, and we wordsmithed the fuck out of the description and responsibilities. \n\nGot her, her “dream job” (in that moment) at Marshall Fields.",
            "title_similarity": "0.6114398",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxsdpjk",
            "score": 1,
            "text": "Avoid any company selling energy and event coordinator jobs. You’ll just be at a sams club generating leads. Be weary of brand ambassador jobs too. Oh yeah if they mention a classroom setting gtfo and don’t look back",
            "title_similarity": "0.72246826",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsducl",
            "score": 2,
            "text": "This is one of my biggest pet peeves about trying to find work nowadays most places don’t accept paper resumes or advertise their openings on-site, and then you try to find stuff online and for every 1 legitimate listing you have to work your way through 100 sales jobs or MLM schemes.\n\nIt’s so frustrating.",
            "title_similarity": "0.7746297",
            "sentiment_compound": -0.6137
        },
        {
            "id": "gxse1c7",
            "score": 1,
            "text": "Also if the job says \"seeking self starter, uncapped commission\" this is most likely a commission only job selling hard to sell products",
            "title_similarity": "0.7472841",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gxselo2",
            "score": 1,
            "text": "Kind of similar thing with financial advisor branch offices tied to large investment firms preying on business or other undergrads. They would list \"Management\" or \"Investment Banking Internship\" positions on campus recruiting sites, call back and follow-up on your resume submission, lie when you asked them point blank if it was a sales position, then after you wasted a day listening to a motivational speech in a room where maybe 2 or 3 out of 20 were in or had attended college, they'd offer you a commission-based position where you pay for your goddamn training. You also figured out quickly enough to never submit for any job posting on Monster.com (back before most legit companies had their own ATS job application sites), because you'd get daily email pitches from Primerica.",
            "title_similarity": "0.7966347",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gxsf2hf",
            "score": 1,
            "text": "\"What's the attrition rate for new sales reps, after a year or so in the position?\"\n\n\"Depends on the person.\"",
            "title_similarity": "0.46796966",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsfa34",
            "score": 3,
            "text": "make sure you enjoy and like your job cause yolo and your time on this planet is short and if there is no life after death thing then you going to regret not enjoying your life.",
            "title_similarity": "0.56046116",
            "sentiment_compound": -0.3769
        },
        {
            "id": "gxsfd17",
            "score": 1,
            "text": "I interviewed for a job which said I must be \"comfortable travelling in a small plane\". When I started work, I asked about it, and my boss said there was no chance of that, they just like to put it in because it sounds cool. I had another job offer which  I turned down; I sometimes wonder if my career would have been different if I picked the other job instead.",
            "title_similarity": "0.54513246",
            "sentiment_compound": 0.7476
        },
        {
            "id": "gxsfhf0",
            "score": 1,
            "text": "As an end user with 30+ years in industrial devices and automation, and the company you are applying to starts with \"Key\", and ends with \"ence\", two tips:  Run Away, and if you persist, and are hired by them, be looking for other jobs even before starting.\n\nI refuse to use anything by them, because of their insane, aggressive pursuit of another purchase.",
            "title_similarity": "0.7915783",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gxsgatp",
            "score": 1,
            "text": "Side note: Some companies will have you download apps during orientation and claim they are company apps needed for you to complete your assignment. \n\nIf this happens, get up and walk out of orientation. These apps are made to mine the contacts and data on your phones. By downloading the app and quickly accepting the ToS you are legally agreeing for them to steal the information.",
            "title_similarity": "0.7488349",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxsgi3r",
            "score": 1,
            "text": "I interviewed at a company that advertised they worked with big tech and communications companies to help with marketing. They did say somes sales required. \n\nI met with a few people there that day. They went over the structure of the company and every position was set to a certain timeframe before a promotion. \n\nOnce you got promoted, the people in your previous position were your subordinates.\n\nOnce you get promoted to the very top (after about 2 years), you can leave and make your own branch of this business.\n\nI asked, \"This seems just like a pyramid scheme?\" They assured me it wasn't.\n\nThe real kicker is they showed me a list of \"clients\" they have worked with. Like GE, Cisco, and a few others, but they \"had not worked with them in a long time.\"\n\nThe actual job was going to Walmart every day and trying to get shoppers to sign up for AT&T. 6 days a week.",
            "title_similarity": "0.7034386",
            "sentiment_compound": 0.8358
        },
        {
            "id": "gxsgj0f",
            "score": 1,
            "text": "I worked with Cydcor straight outta the Marine Corps\n\nI get why most people hate it... It was hard. Maybe harder than the military\n\nI learned a ton in the year that I worked there though and still use that training now. \n\nIf you can find a place that has a good manager I'd recommend it. You'll probably learn how to make more money than anyone else you know in your circle of friends",
            "title_similarity": "0.68733495",
            "sentiment_compound": 0.6151
        },
        {
            "id": "gxsgk58",
            "score": 1,
            "text": "It's basically the same logic as \"might work on weekends, rarely Sundays\" which means almost every weekend and definitely on Sundays.",
            "title_similarity": "0.30872488",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxsgwem",
            "score": 1,
            "text": "Hell even in STEM. Sales engineers don't do much engineering.",
            "title_similarity": "0.5131761",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxsgyle",
            "score": 1,
            "text": "Knives, vacuum cleaners. Sometimes they do door to door. But what they really want you to do is sell these overpriced items to family members, who want to “help you out.” They don’t stick around very long. Keep moving around then show up a couple years later to prey on a new round of college students.",
            "title_similarity": "0.81231344",
            "sentiment_compound": 0.3269
        },
        {
            "id": "gxsh2hl",
            "score": 1,
            "text": "..that and cleaning, organizing, staging and layout, bank deposits, customer service, localized marketing, janitorial, inventory transfer, inventory management, inventory auditing, special projects and special orders. Man, it goes on and on.",
            "title_similarity": "0.5078444",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gxsh3gk",
            "score": 1,
            "text": "It's sad because you would think they spend more time and money being deceitful because people will just quit.",
            "title_similarity": "0.68119365",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gxsh3su",
            "score": 1,
            "text": "If the interview is at a hotel meeting room, skip it.",
            "title_similarity": "0.4491674",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsh4cb",
            "score": 1,
            "text": "Honestly, in most US states people are really struggling to find good staff across tons of industries. Don't fall for crap like this, contact a few staffing agencies if you're having trouble finding something for yourself, and odds are good you'll have job within a month. A good agency might have multiple positions for you to choose between. It might not be exactly what you were looking for, but it'll get you over that hump of being  a new grad with a useless degree and no working experience - it's that last one that hurts most in a lot of non-technical entry-level fields.",
            "title_similarity": "0.7706294",
            "sentiment_compound": -0.7472
        },
        {
            "id": "gxsha3x",
            "score": 1,
            "text": "Can confirm. I’ve had a couple of “interior design” jobs over the years that turned out to be almost all about sales. The sales grift reaches many fields.",
            "title_similarity": "0.5725318",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gxshdc7",
            "score": 1,
            "text": "As a former \"Management Trainee\" with Enterprise Rent-A-Car, I have to agree. 95% of my job was getting people to rent more (and more expensive) cars and buy fake insurance.",
            "title_similarity": "0.6407216",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxshywy",
            "score": 1,
            "text": "This isn’t wrong, in my experience.",
            "title_similarity": "-0.04607217",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gxsi0dy",
            "score": 1,
            "text": "this is probably the truest thing ever posted.",
            "title_similarity": "0.08726108",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxsi7ui",
            "score": 1,
            "text": "Yes! I went on two interviews with companies like these and the second one I did not sugarcoat my questioning. \n\nAnother huge giveaway if the company does have a website, which the ones I applied for did, is that the website doesn’t actually tell you what the company does. It’s a bunch of run around fluff with no real answers.",
            "title_similarity": "0.7155553",
            "sentiment_compound": 0.7085
        },
        {
            "id": "gxsi84t",
            "score": 1,
            "text": "Ah, Costco sales people.\n\nhttps://thedevilcorp.wordpress.com/\n\nHave fun reading.",
            "title_similarity": "0.39912227",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxsiaww",
            "score": 1,
            "text": "Even if you have a stem degree this happens and if it's not a sales job it's technical support.",
            "title_similarity": "0.48841023",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxsiegq",
            "score": 1,
            "text": "Potential backpackers in Australia beware, there’s absolutely tons of these and they recycle through backpackers desperate for cash like no tomorrow!",
            "title_similarity": "0.6266303",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gxsipx5",
            "score": 3,
            "text": "can't upvote this enough. Fuck these parasitic opportunists people are listing in the comments",
            "title_similarity": "0.62445974",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gxsir77",
            "score": 1,
            "text": "Found job for “Management training”. During interview they said it was for “business to business sales”. In reality, it was going door to door at business parks trying to sell either satellite TV or discount baseball ticket multi-packs.",
            "title_similarity": "0.70438063",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsis9y",
            "score": 1,
            "text": "But how is it advantageous to the company to run a bait and switch? People will just say fuck this and go to the next thing. And it's not like people have a ton of time vested in this job before they figure this shit out.",
            "title_similarity": "0.7412634",
            "sentiment_compound": -0.879
        },
        {
            "id": "gxsisda",
            "score": 2,
            "text": "I got duped several times back in 2015 coming out of college. One “marketing” company interviewed me then asked me to come in for a shadow day. I arrived at 8 am and they proceeded to drive me to Pittsburgh to sell Pirates tickets to companies door to door! You didn’t even make hourly, only $10 per $50 sheet of tickets you sold.",
            "title_similarity": "0.63935983",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gxsj3yr",
            "score": 1,
            "text": "Most of these jobs are all for one company called Cydcor (spelling?) That is a pyramid scheme. They've been around for decades. There used to be a worries WordPress page about it called Devil Corp. I worked at one such place in Denver called Mariam marketing. Had the same description. I went door to door in no soliciting areas to sell printer paper. I made commission. In a month I made like $300 and spent 12 hour days selling and doing role play sales training. Years later I found myself in an interview for another such company and walked out when he said I'd be selling coupon books.",
            "title_similarity": "0.61452407",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gxsjadj",
            "score": 1,
            "text": "God marketing is the worst. They will sell you on a marketing role just to have you cold calling. Fuck that.",
            "title_similarity": "0.7209987",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gxsjh3t",
            "score": 1,
            "text": "I got tricked into one of these interviews once. Walked into some weird office, then was led into a room that had like 5 interviewees in it already. A few more joined. There were no chairs but it was clearly supposed to be a conference room. He did some like MLM “math” on the board with his spiel to show how much money we could make. I honestly don’t even remember what it was for. I remember just looking around at everyone else and we all looked confused. I gave the guy my clipboard and said that this wasn’t what I thought it was and walked out. I hope some of those other poor souls did as well.",
            "title_similarity": "0.71300274",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gxsjnhv",
            "score": 1,
            "text": "Stop talking about me graduate from college with a liberal arts degree.",
            "title_similarity": "0.48661324",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxsjnow",
            "score": 1,
            "text": "But people on reddit works in sales and make over 200k a year",
            "title_similarity": "0.34707317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsk0d7",
            "score": 1,
            "text": "I've got a friend who's a sales rep in UK, where there's a fire extinguisher company notorious for being a bad/underpaying employer.\n\nHe went to see a recruitment agency once, the guy he saw insisted he signed a contract to agree to go to an interview, but refused to let him know who that company was.\n\nAs soon as the form was signed, he revealed the fire extinguisher company and my friend said \"I'm not going to that\"\n\nThere was a \"you'll never get a job through us\" threat made which he ignored, and had to remind the recruiter of that promise when he called a few weeks later with an \"interesting opportunity' I think would be good for you\".",
            "title_similarity": "0.78558296",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gxsk37y",
            "score": 1,
            "text": "Aflac does this now too; I applied as an office assistant but then came to the interview to discover:\n\n- A group “interview,” where a person in the company spent 30 minutes trying to sell us on the job \n- that the job I applied for didn’t exist, and everyone was there for sales. \n\nI did not return for the solo interview, because the only other company I ever had an “interview” like that was Vector aka Cutco",
            "title_similarity": "0.6819062",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gxskj7e",
            "score": 1,
            "text": "The same thing goes for any company that says your job is \"marketing\" - your job will be sales. If it says \"call center\" there's a good chance it will be sales, and a guarantee that it will suck.",
            "title_similarity": "0.7419306",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxskn9k",
            "score": 1,
            "text": "Honestly don’t mean everyone else does",
            "title_similarity": "0.17283246",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxskstm",
            "score": 1,
            "text": "Great advice! Definitely applicable to me. Thank you!",
            "title_similarity": "0.08367705",
            "sentiment_compound": 0.8715
        },
        {
            "id": "gxskzrm",
            "score": 5,
            "text": "Also beware of \n\n\"self-motivated\" = Not going to train you",
            "title_similarity": "0.49684376",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxslblb",
            "score": 1,
            "text": "Even if it doesn't that could end up being your job. \n\nI once applied and accepted a job for a receptionist position. Turns out \"receptionist\" to them meant sales with a lot of cold calling angry people that got tricked into giving the company their phone numbers under the guise of being entered in a contest.\n\nI ended up walking out after a few weeks and from the reviews of them I later saw on the job board site it doesn't seem like I was the only one.",
            "title_similarity": "0.7346525",
            "sentiment_compound": -0.3632
        },
        {
            "id": "gxslizd",
            "score": 1,
            "text": "I sell phones and phones plans. It's been a great job for me and I'm living comfortably with health insurance and savings.\n\nWhen I interviewed they told me I'd be selling phones and phone plans. \n\nFuck sneaky companies.",
            "title_similarity": "0.49651575",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxslo9u",
            "score": 2,
            "text": "Same with \"being your own boss\"",
            "title_similarity": "0.32652646",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxslq4b",
            "score": 1,
            "text": "So true. I worked as a Cellphone repair tech for Asurion. \n\nThey started migrating towards trying to make us sell the protection packages. Guess what we started doing less of? Repairs. I quit shortly after that, making it absolutely clear that I didn't sign up to sell things.",
            "title_similarity": "0.64995015",
            "sentiment_compound": 0.7172
        },
        {
            "id": "gxsmjhn",
            "score": 1,
            "text": "Just so you guys know, job search sites use some of the same tricks as regular search engines. So I include -sales in all of my searches.",
            "title_similarity": "0.5305736",
            "sentiment_compound": -0.128
        },
        {
            "id": "gxsmncf",
            "score": 1,
            "text": "Unless it mentions cleaning… especially gross stuff. \n\nThey mean that too. \n\nBut you still have to meet your sales objectives",
            "title_similarity": "0.5709027",
            "sentiment_compound": -0.2952
        },
        {
            "id": "gxsmzsy",
            "score": 1,
            "text": "I worked at a Regions Bank call center for about a year as a \"relationship banker.\" You would think that our number one priority would be servicing, troubleshooting, and answering questions about customer's accounts.  We did those things of course, but it was obvious from day one that our primary function was sales.  It was a rude awakening since the job description or interviewers never mentioned anything about sales.\n\nAfter we had addressed the reason for a customer's call, We were expected to attempt to sell as many checking, savings, credit cards, loans, and other bank services as humanly possible.  If you missed your daily sales goal you would have an unpleasant meeting with a supervisor. If you didn't hit the monthly goal in two consecutive months, you were straight up fired.  \n\nIt wasn't terribly difficult to meet the goals because people would call in specifically to open accounts, or get information about loans and other products. Those calls still counted as sales referrals.  But I always thought it was pretty obnoxious that my supervisors were more concerned with selling our customers products than actually helping them with their accounts.",
            "title_similarity": "0.71754646",
            "sentiment_compound": -0.238
        },
        {
            "id": "gxsn3ze",
            "score": 1,
            "text": "First job interview was selling knives lol walked right out",
            "title_similarity": "0.5218445",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxsonj3",
            "score": 1,
            "text": "Most companies have a product or service, learning how to sell that, to customers, industry partners, analysts and even your competition is an incredible skill set and will put you on the short path to leadership and the C-suite.  It’s also great training if you ever plan to open your own business.  Most new businesses don’t fail because the product or service is bad, they fail because leadership can’t get the value proposition across.",
            "title_similarity": "0.77090305",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gxspfi0",
            "score": 2,
            "text": "Cydcor. They do this",
            "title_similarity": "0.029704593",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxspgya",
            "score": 2,
            "text": "Yup, had to learn this lesson the hard way leading up to graduating from undergrad. I went to a college in CT, and had my sights set on getting a job and moving to NYC after graduation. I worked really hard making new resumes, CVs and researching jobs. I applied to a bunch of jobs that I thought would be a good fit and, to my surprise, received a lot of interview invitations. I remember thinking like *’wow I thought I’d be hard to find a job right after college’* but was so excited I didn’t think too much into it. \n\nSince I was in CT and didn’t have a car at the time, I had to be very strategic with planning the interview appointments. Basically, I had to schedule all my interviews in days I didn’t have class and I ended up with 6 back-to-back interviews all over Manhattan starting at 8am. I was so hype and thought I was really doing something big, and that lasted till about...maybe the second interview? Once I realized all of these ‘marketing’ and ‘branding/sales specialists’ positions really just wanted me selling random stuff on the street corners or in the subway. Never have I had my dreams come crashing down so fast lol",
            "title_similarity": "0.69164455",
            "sentiment_compound": 0.9441
        },
        {
            "id": "gxspmnz",
            "score": 1,
            "text": "Same thing with any kind of group interview or “information session” where multiple candidates are present. It’s a pyramid scheme.",
            "title_similarity": "0.3645271",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsq5tv",
            "score": 1,
            "text": "Some of these posts make me sad and feel like they reflect poorly on the professional sales market. Between being borderline hustled into selling in a store by going to a second location or scamming elder people (yikes) these don’t reflect well on the sales industry in general.\n\nSales is actually a great career that doesn’t require a degree to make a livable wage. And depending on the product or company it’s not about “screwing” over your clients. In the professional world it’s more about solution providing and relationship building than trying to hustle someone into a product.\n\nPeople interested in B2B sales should look for positions that have “account rep” or “account management” in their title. Look at the company’s website and learn about what solutions they’re offering and if you’d buy it yourself. \n\nDuring the interview ask about the KPIs they’d have. Expect it to be a mixture of action and results orientated, but be wary of positions that are heavily weighted on results. An example of a KPI that’s results driven would be “5% growth year over year” and an action KPI “30 customer calls a day”.\n\nIf anyone has questions feel free to reach out to me \n\n- Source: Account Manager for a 50b company in the IT industry.",
            "title_similarity": "0.77997375",
            "sentiment_compound": 0.9299
        },
        {
            "id": "gxsqlf3",
            "score": 1,
            "text": "My job may be the exception.  For some reason, the managers call it sales, but we really don't sell anything.  We just fulfill orders.  We never try to sell anything.",
            "title_similarity": "0.5760432",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gxsqmwv",
            "score": 2,
            "text": "I’m tired of these Smart Circle jerks.",
            "title_similarity": "0.4799103",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gxsqvm7",
            "score": 2,
            "text": "I went to an \"interview\" for a \"B2B sales position\" that was just accompanying a salesperson for an entire day and watching them try to sell indoor skydiving tickets. We started with visiting a business that had bought some the day before but would only pay that day, and that was the only \"sale.\" Also, lunch was stopping by Burger King and buying my own lunch while the salesperson hid in the bathroom, and then they explained the company's org structure by drawing a pyramid.",
            "title_similarity": "0.6769099",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gxsrql5",
            "score": 1,
            "text": "Currently in the midst of my post-college job search and I am learning this all too well.",
            "title_similarity": "0.47085264",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxssec9",
            "score": 1,
            "text": "Smart Circle. Stay the fuck away.",
            "title_similarity": "0.1697503",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gxssj95",
            "score": 1,
            "text": "My first job out of college was as a Sales Engineer. 95% sales, 5% engineering. Worst part is that they targeted recent engineering grads so nobody had any sales experience. Very dumb",
            "title_similarity": "0.68631446",
            "sentiment_compound": -0.8268
        },
        {
            "id": "gxssl6l",
            "score": 1,
            "text": "One of the most annoying things in job postings is not listing salary.  They want to see how much leverage they can pay with a person w/ experience and with no experience.  Waste my f***en time when interviewers ask \"What is your expected salary?\" If your accounting department has not yet approve of higher than expected, sure as hell cannot hire a Super star employee asking for high salary..",
            "title_similarity": "0.7833792",
            "sentiment_compound": -0.8558
        },
        {
            "id": "gxstcdv",
            "score": 2,
            "text": "I got suckered in to Smart Circle, can confirm.",
            "title_similarity": "0.28117365",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gxstdgw",
            "score": 1,
            "text": "Sales associate. They can literally just ring people out at a register.",
            "title_similarity": "0.52472943",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxstjfq",
            "score": 1,
            "text": "Man I had this happen to me. I had an interview going really well. Talked about a good hourly rate and ended up asking me, “so are you familiar with Kirby vacuums?” I literally rolled my eyes and left.",
            "title_similarity": "0.6190148",
            "sentiment_compound": 0.6478
        },
        {
            "id": "gxstq2g",
            "score": 2,
            "text": "Yeah multi-level marketing companies are basically a new form of pyramid scheme that try to use cult-like tactics to reel people and keep them working long hours for what ends up being less than minimum wage, by using feelings of guilt and obligation to your coworkers along with promises of future wealth. They will basically sell you the job itself and then you are pushed to immediately start “progressing” towards building your own sales team by roping in more suckers and each of them is supposed to make their own teams with you getting a cut of their earnings and so on. To foster the feeling of obligation they will also constantly pressure you to attend multiple sales team social gatherings a week (which you are meant to pay for yourself) so that you become close the people on your team and will feel bad if you “let them down” by leaving the job.",
            "title_similarity": "0.8189281",
            "sentiment_compound": -0.659
        },
        {
            "id": "gxstscq",
            "score": 1,
            "text": "I get these messages CONSTANTLY on job sites.... except I'm a prior explosive detection K9 handler, teacher, with a digital forensics degree...who's also in his 30's.\n\nIt's kind of offensive at this point how many bullshit \"sales\" offers come through.\n\nLike, no...I don't want to join your *team*.",
            "title_similarity": "0.7686178",
            "sentiment_compound": -0.7719
        },
        {
            "id": "gxstt60",
            "score": 1,
            "text": "I hate to admit it, but you’re right. I’m on a temp contract working admin for a recruiting company and this is 120% what they do :(",
            "title_similarity": "0.52586573",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gxsug35",
            "score": 1,
            "text": "This is 100% true",
            "title_similarity": "-0.03410344",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxsvsom",
            "score": 1,
            "text": "Another little tip learned from several years as a commissioned sales person: A dollar amount mentioned as compensation will be the absolute highest imaginable figure that you will ever make.",
            "title_similarity": "0.41503114",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsw1fx",
            "score": 1,
            "text": "Ever read a job description that goes something like this: “Must have at least 5 years of expertise with Hubspot, Quark Express, CSS, Ruby on Rails, Protools, Exotranrr CRM and Quickbooks.” Who gets these jobs?",
            "title_similarity": "0.36821324",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxsw7xz",
            "score": 2,
            "text": "Oh I had that from just a small insurance company. I was there to do admin and \"referrals\". I did admin but within days it was all done. Then those \"referrals\" were basically like warm leads when the salesmen asked their clients for other peoples numbers usually the only advantage was that you knew the name of someone they knew, or worse with my guy they'd told them about their appointment... And then it was \"some cold calls\". A few days a day maybe. So I got sent to another cold calling company that the owner knew as training then bang, full fucking time cold fucking calling. I did admin maybe once a month at the end. Oh and then they hired an apprentice to do admin then fired me just after I raised the fact they'd been under paying us and also a month before I went up to the much higher minimum wage bracket.\n\nCold sales can eat a fucking dick and if anything even mentions telesales or worse \"new lead generation\" I feel like that's going to be the end goal of it and the metric you're actually assessed by.",
            "title_similarity": "0.6759933",
            "sentiment_compound": -0.867
        },
        {
            "id": "gxswt6a",
            "score": 2,
            "text": "It’s been really hard finding a job,\nEspecially considering my mental health conditions and my need for a Service Dog.\n\nSo I was applying left and right and saw this job listing for a benefits counselor. Seemed legit enough, the listing paid well and it seemed like a nice office job I can bring my SD.\n\nI applied and jot an offer for an interview. I was fucking stoked man! It was a zoom interview but I’ve had legit ones like that before so why not.\n\nI got dressed up, did my hair and sat 15 minutes early watching some nice info about the company. It wasn’t until I was 10 minutes in the “interview” I realized it was a live presentation for door to door sales.\n\nBecause of an incident as a caseworker (I was attacked by a client) I am terrified to go to peoples houses, let alone strangers, alone.\n\nI sat through a whole hour long presentation, where they never even so much as confirmed my name, or allowed my camera to be on.\nWho knows how many people were on that call, I couldn’t tell. I should’ve backed out of it and not wasted my time but I was so goddamn defeated after that fact\n\nOh I totally forgot to add that the pay was based on commission. So someone like me who has extreme anxiety and isn’t pushy, I would not get sales, well maybe pity sales",
            "title_similarity": "0.7109438",
            "sentiment_compound": -0.9568
        },
        {
            "id": "gxswxw0",
            "score": 1,
            "text": "Good advice. I own a business and when I'm hiring I get a ton of bogus applicants so it cuts both ways. When my ex was looking for a new job though, the bogus sales crap was off the charts. She started falling for some of them until I urged her to Google around. Those companies are horrible and I feel bad for the victims.",
            "title_similarity": "0.8038628",
            "sentiment_compound": -0.9017
        },
        {
            "id": "gxsx2sq",
            "score": 1,
            "text": "Nah, you could be in the backstore ;)",
            "title_similarity": "0.3756599",
            "sentiment_compound": 0.128
        },
        {
            "id": "gxsxcd0",
            "score": 1,
            "text": "I feel like influencers are rebranded sales people. In the grand scheme of things, they’re cheap as chips for a company. But are required to constantly pump out content to encourage sales. They’re the door-to-door salespeople of our time. They’re just knocking on digital doors now.",
            "title_similarity": "0.71773267",
            "sentiment_compound": 0.802
        },
        {
            "id": "gxsxh1i",
            "score": 1,
            "text": "I fell for this once in the late 90's. The 'interview ' was at a strip mall with four people wearing very cheap and ill fitting suits.  About 20 people showed up and we were pitched an 'opportunity of a lifetime'. All we had to do was buy a couple cases of degreaser from them and go sell them to businesses that were chomping at the bit to buy super awesome cleaning products. I walked out after the first 5 min. They asked why I was leaving and I just shook my head and continued on my way.\n\nSuper desperate for a job I answered an add for a 'sales' position. Turns out it was a door to door gig selling restaurant  coupons for $20 each. (Think Groupon before it was a thing) The person they paired me up with was telling me how she would sell $200 worth of coupons a day and clear over $150. That day we sold a total of 2 coupons.",
            "title_similarity": "0.73954034",
            "sentiment_compound": 0.9251
        },
        {
            "id": "gxsy3iu",
            "score": 1,
            "text": "Insight global does this , farm for recent grads",
            "title_similarity": "0.3209682",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsy9es",
            "score": 1,
            "text": "I wish recruiters were more honest in their quests for candidates.   \n\n\nThe whole TEAM PLAYER TEAM THAT, and all that non sense makes me feel really cringy. Let's be honest, the job probably sucks and you should probably be going to school but, if you have no other choice, go ahead and apply.",
            "title_similarity": "0.7307205",
            "sentiment_compound": 0.1893
        },
        {
            "id": "gxsyaol",
            "score": 1,
            "text": "Yep. Look for “financial advisor” jobs. There’s usually very little advising. All about selling folks stuff that isn’t good for them but great for “the house”.",
            "title_similarity": "0.7252004",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gxsyjp2",
            "score": 1,
            "text": "Got an offer for an entry level marketing position. It was door to door. No reference of canvassing or anything like that in the application lmao",
            "title_similarity": "0.548285",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxsyls3",
            "score": 2,
            "text": "Our top earners make over 100k a year! Well whats the average make? You shouldnt ever aim to be average! \n\nIf your conversation goes like the above then that might be a red flag.",
            "title_similarity": "0.50886285",
            "sentiment_compound": 0.717
        },
        {
            "id": "gxsyohl",
            "score": 1,
            "text": "Posts for “Management Trainees” are another dead giveaway that it’s direct sales.\n\nOr if they’re at all cagey in giving details about the job. (Like they want you to come in and meet with them before they’ll explain specific details about the job.)",
            "title_similarity": "0.76497877",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxsz6uf",
            "score": 1,
            "text": "And this is why people should be looking for stuff and manufacturing with their degrees. Even if it's not really applicable, you could probably go into a specific department of a manufacturing company where that skill is needed. I know personally that a lot of manufacturing companies, even the one that I currently work for are short staffed.",
            "title_similarity": "0.65208733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxsz7tc",
            "score": 1,
            "text": "Wow! I interviewed for a job like this right out of college. Event coordinator. I felt like an idiot after telling them I've managed many events, weddings, DJ occasionally, and would be a great fit. Well then they send me to a Sam's club and I'm like... \"Uhh...\" And they really swooned me. I was pumped to work at the...grocery store...right after getting my BA. I got home and thought something fishy was going on and had to go with my gut and tell them I won't be attending the third interview. Why the hell are there so many interviews? They'd have better luck just hiring people on the first go around. \"We start you at $8.25/hr but you'll be making at least $75k at the end of your first year.\"",
            "title_similarity": "0.7955062",
            "sentiment_compound": 0.8313
        },
        {
            "id": "gxszbyi",
            "score": 1,
            "text": "This also applies if they say anything about marketing. If the description is somethjng akin to customer interaction you can be assured it is anything but...",
            "title_similarity": "0.53894114",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gxszmf5",
            "score": 1,
            "text": "Fun fact: Chris Pratt was an owner of a Cydcor office",
            "title_similarity": "0.37302792",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxszouo",
            "score": 1,
            "text": "I applied for a company called Cross Town Solutions in New York, exactly like this. Never went to my first day",
            "title_similarity": "0.4858232",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxt01g5",
            "score": 1,
            "text": "Went to an interview for one of these. It was in a nice building, but the office was bare, and there were dozens of recent college grads there to be interviewed. got a call back for the second day, but knew that it would end up being one of these jobs and told them i wasn't interested. They tried to guilt me, saying \"nobody who made it tot the second round has rejected us before\" \n\nIf you want to get into marketing, look at big agencies! they hire entry level roles all the time.",
            "title_similarity": "0.79666615",
            "sentiment_compound": -0.8372
        },
        {
            "id": "gxt076x",
            "score": 1,
            "text": "I actually made [a YouTube video](https://www.youtube.com/watch?v=WyViTUd1UOM) about my application process (video taping the entire interview and pointing out the plot holes) with a couple of these scam companies. They are absolute scum of the Earth and I was so lucky to find a salaried position shortly after so many terrible experiences. They even go so far as to make names that sound similar to other companies so when you Glassdoor them you think you're applying to a reputably company.",
            "title_similarity": "0.7215227",
            "sentiment_compound": -0.5365
        },
        {
            "id": "gxt0cp4",
            "score": 1,
            "text": "My job was \"customer service\" where I would assist customers with questions or help with things they could not ot didn't want to do on the website. \n\nIt lasted 3 years. In year 4 it started to transition to sales.\nIm still there,  it's a great union job with benefits. \n\nNow they want us to generate 2 dollars over cost per minute.   Mind you,  the cost is your wage,  so I have to earn about 2.50 a minute.  It's stressful and you can't make a sale every call.  Some calls are \"what it's the weather in Dallas tomorrow? \"",
            "title_similarity": "0.6660678",
            "sentiment_compound": 0.7625
        },
        {
            "id": "gxt0s8g",
            "score": 2,
            "text": "Yeah instead of selling knives and vacuums you're selling alarm systems and 3rd party At&T business",
            "title_similarity": "0.63503397",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxt0z6z",
            "score": 2,
            "text": "I can also add my Vector marketing / Cutco experience to the list of comments. I was looking for a summer job while in college and applied. At the time I hadn't heard anything about them or their reputation. I already had some sales experience so I knew I was good at it, and they seemed interested when I talked on the phone. \n\nI pull up the \"office\" location that seemed so weird and out of place. Go in to my interview and there's three other college dudes also there to interview. I immediately thought this was weird, like what company interviews more than one person at a time? The interview was just a guy basically giving a sales demo on the knives. I got up about 10 minutes in and said yeah this definitely is not for me and walked out.",
            "title_similarity": "0.72359353",
            "sentiment_compound": 0.8975
        },
        {
            "id": "gxt0z7f",
            "score": 1,
            "text": "If the job is for a company called Vector Marketing, you’re going to be selling knives",
            "title_similarity": "0.55140007",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt14ft",
            "score": 1,
            "text": "Found a job like this turned out it was a call centre. You ring people and they had an alias business name they could use 'Your Printer Cartridge Company'. So you would call up and say \"hi it's Your Printer Cartridge Company just wanting to talk to the person who orders them for you\". I hated it, got fired for not meeting KPI's then got told I looked happy I was sacked to which I said I was cause the place was corrupt and I couldn't get paid unemployment if I quit. Found a new job the next day anyway.",
            "title_similarity": "0.8098937",
            "sentiment_compound": -0.05
        },
        {
            "id": "gxt165s",
            "score": 1,
            "text": "My first job out of college was titled “Financial Advisor.” It was really Life insurance sales",
            "title_similarity": "0.46228087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt1786",
            "score": 1,
            "text": "My sister is a recent college graduate and can test to this exactly. Thank you for sharing. It pisses me off how they try to scam kids like this.",
            "title_similarity": "0.6186558",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gxt1iqn",
            "score": 1,
            "text": "Additional: If the end of the listed job duties says \"All other duties as assigned.\" Then the company intends to extract extra labor from you without extra pay. \n\nThis could just be an additional custodial duty on every shift, or it could be as bad as management mass firing most of the staff and then requiring whomever is left to make up the difference. Avoid it.",
            "title_similarity": "0.763571",
            "sentiment_compound": -0.7785
        },
        {
            "id": "gxt1kzm",
            "score": 1,
            "text": "Wow. \n\nMy wife (leaving the retail management industry) just got on a call with a recruiter today and was set to be on a video interview tomorrow with a hiring manager at an Ascension Management Inc. The job title was for a Project Coordinator but the description (in bold) had a note stating that the role includes in-person sales (commission-based) and customer service. She was the lone applicant and now the role (according to LinkedIn) is no longer accepting applications.\n\nShe canceled her application and interview. Thank you for this LPT.",
            "title_similarity": "0.6444824",
            "sentiment_compound": 0.2081
        },
        {
            "id": "gxt1op0",
            "score": 1,
            "text": "I worked as an IT manager for a MLM masquerading as a door-to-door marketing company -- basically, the guys that sell cable and try to sign you up. Turnover was high, and the leads given were decent but forced about 5-10 miles a day in walking around residential neighborhoods.\n\nRecruiting was shady with job board postings that included some variation of \"Marketing Manager Trainee\" with the dream that if you sold enough then you would be given your own territory with office(s) and a sweet, sweet payout.\n\nCan't tell you how many times I've seen people leave the office screaming, \"You've wasted my time! I have an masters degree!\"",
            "title_similarity": "0.7597116",
            "sentiment_compound": -0.631
        },
        {
            "id": "gxt20de",
            "score": 1,
            "text": "What I cant figure out is why. Why do these companies do this? As dead end as it seems, it must actually work well enough to be profitable in the long term for these companies, right?",
            "title_similarity": "0.6036087",
            "sentiment_compound": -0.168
        },
        {
            "id": "gxt2eru",
            "score": 2,
            "text": "I almost fell for this too. I was applying for jobs during the pandemic, and had experience being a courier so I put that in my resume. I applied en masse to a bunch of courier and delivery positions, in addition to everything else I applied for, and carefully curated a cover letter for each company. One of them struck me as weird while I was googling them.\n\nThe job posting said “product delivery” and it was for a generic company called Pacific Delivery, or something like that. I couldnt find what they actually did, besides apparently delivering things, because their website seemed more like an advertisement to prospective new hires than a website a customer would use. \n\nThey were one of the only places I heard back from, and through a *phone-call* no less, instead of email. The guy said he saw my *extensive* history in the industry and was excited to offer me an interview *later today*. Like holy shit, for real? Okay! I’ll be there! Nice!\n\nGoogled them again while preparing and looked specifically for job reviews. Found out it’s some sort of seafood MLM where you have to buy the product and *rent a van from them* and just drive around town trying to sell *fucking fish* door-to-door. Like what the hell? Who would buy fish from a van? I didn’t even go to the interview after that.",
            "title_similarity": "0.7319175",
            "sentiment_compound": -0.4186
        },
        {
            "id": "gxt2h6a",
            "score": 1,
            "text": "In 2006 with few job prospects after graduating from college I interviewed for a “marketing” position. At the interview they said I was a “great fit” and they wanted me to go on a “field interview”. Based on the initial interview I was under the impression I’d be marketing for some event or something, so I got dressed in heels and a pantsuit thinking it was the real deal. The very next day they had me “out in the field” - by this they meant going door to door in some neighborhood in Palatka, Florida (in the middle of June so fucking hot) with another employee selling movie theater tickets. Needless to say I didn’t go back, nor did I get paid.  Looking back I was so naive. Fuck these bullshit positions and these bullshit companies who prey on young people.",
            "title_similarity": "0.5740484",
            "sentiment_compound": -0.9005
        },
        {
            "id": "gxt355r",
            "score": 1,
            "text": "As a recruiter for a sales company, this couldn't be more accurate. You can either sell or be sold ;)",
            "title_similarity": "0.63652575",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxt37bb",
            "score": 1,
            "text": "In my first marketing position I received I did a whole lot of marketing by showing people the product and trying to get them to buy it.",
            "title_similarity": "0.50698656",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt3dkn",
            "score": 1,
            "text": "Sales will teach you at least one thing; Preachers are allowed to lie; it says so right in the GODDAMNED BIBLE. Somewhere.",
            "title_similarity": "0.5175228",
            "sentiment_compound": -0.5473
        },
        {
            "id": "gxt3kd7",
            "score": 1,
            "text": "I got tricked once by one of these thinking it was a real job. Had an interview, got the job and reported for my training shift. Wore a suit and expected some kind of office situation, no we had some weird group hype up session and then were set loose in a certain area of the city to go door to door to businesses and try and pressure them into some bogus free trial to place water coolers in their offices. I was so embarrassed to be out with this sleaze bag salesman that I just ghosted them and never came back. That's the moment I decided I absolutely hate sales.",
            "title_similarity": "0.80967057",
            "sentiment_compound": -0.87
        },
        {
            "id": "gxt3uf1",
            "score": 1,
            "text": "All of these people who say \"don't do sales\".  You may be right.  And sure, retail has its cons.  But you'd be shocked how great the benefits are and how much people make working for a corporate T-Mobile etc. store.",
            "title_similarity": "0.82964593",
            "sentiment_compound": 0.8294
        },
        {
            "id": "gxt3zyi",
            "score": 1,
            "text": "This happened to me in college. They had an office downtown for a marketing interview that ended up being a cable salesperson at Costco",
            "title_similarity": "0.52700067",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt56ba",
            "score": 1,
            "text": "Got a job “selling” windows in a neighborhood that honestly did not need to be spending money on windows. Quit 3 days later but learned what I did not want to do moving forward. It was actually a great experience in hindsight.",
            "title_similarity": "0.58855975",
            "sentiment_compound": 0.8083
        },
        {
            "id": "gxt5jtb",
            "score": 1,
            "text": "I applied for an it position. Turns out it was a falsely worded job description and they needed a customer service representative. Fuck recruiters that do this",
            "title_similarity": "0.7544263",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxt60vs",
            "score": 1,
            "text": "My friend got a job working front desk at a gym. Was definitely a sales job. She made 7.25/hr plus commission and started spending a lot of her free time advertising for them in order to boost sign ups to try and make a decent wage.",
            "title_similarity": "0.5756123",
            "sentiment_compound": 0.8979
        },
        {
            "id": "gxt6c1d",
            "score": 1,
            "text": "Nothing wrong with sales but it takes a certain personality to be successful at it.  It’s really an art and I think you either have a knack for it or you don’t.  I have steered far away from sales my whole life because I know I’d be terrible at it.",
            "title_similarity": "0.6529977",
            "sentiment_compound": 0.668
        },
        {
            "id": "gxt758x",
            "score": 3,
            "text": "This is absolutely true. During the 2008–2009 recession, these job postings were everywhere. I remember one of the jobs being a marketing events manager for a tech company. I was so happy to have been invited to interview. \n\nWhen I showed up, there were about 16 ( no joke) people in the waiting room. All ages, backgrounds and experience. They asked all of us to move into the next room, where we sat  in a U type of formation, with the hiring manager in the middle. He asked us to pull out our resumes and then said the job description and responsibilities. \nIt would be an outside sales role, reselling direct tv to small and medium size businesses. \n\nI looked at the lady to my right. She clearly had way more experience than me, had numerous degrees and we kinda laughed, like is this a joke? The hiring manager then said. “ anyone that wants this job can stay”\n\nAll of us left.",
            "title_similarity": "0.66972333",
            "sentiment_compound": 0.9182
        },
        {
            "id": "gxt75y9",
            "score": 1,
            "text": "This extends even to “sales engineer” at actual tech companies.",
            "title_similarity": "0.46840933",
            "sentiment_compound": 0.128
        },
        {
            "id": "gxt7sgw",
            "score": 3,
            "text": "If your job title contains Advocate in it and it's not a law firm, you're Sales.\n\nIf your job title contains Training or Coach and it's not an accredited educational institution, you're Sales.\n\nIf your job title contains Consultant, you're Sales.\n\nIf your job title is like Solutions Engineer and doesn't require engineering degree, you're likely not an Engineer, you're Sales.",
            "title_similarity": "0.66134727",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxt8f8a",
            "score": 1,
            "text": "On this note, if the company is an offshoot of Ascenta RUN THE FUCK AWAY. \n\nIf you really like sales and it's something you're good at by all means try it out,\n\nbut they don't pay you horse shit and they're going to give the\n\n\"We're a family!\" \"You can do it if you just believe in yourself !\" garbage.\n\nI made good friends, but that was a dark time of self loathing in my life.",
            "title_similarity": "0.73218346",
            "sentiment_compound": -0.4329
        },
        {
            "id": "gxt8p8d",
            "score": 1,
            "text": "💯💯💯. I got tricked into a sales job years ago that used the words “business development.”\n\nI was a terrible salesperson, but thankfully I was on salary and I was selling overpriced manufacturing services so it didn’t matter",
            "title_similarity": "0.76689386",
            "sentiment_compound": 0.4396
        },
        {
            "id": "gxt8qbr",
            "score": 1,
            "text": "This is an every day find for many people currently, (myself included). Never mind sifting through and figuring out the jobs that are flat out *obviously* scams, there is SO much of the crap that you just listed. Thanks for posting. This shit was driving me nuts so it’s nice to see someone else draw attention to it.",
            "title_similarity": "0.6457876",
            "sentiment_compound": -0.7889
        },
        {
            "id": "gxt8rke",
            "score": 1,
            "text": "This was definitely something that happened to me. Went to a company that advertised it as consultants, interviewed and went well, thought it'd be pretty good office job. \n\nThen it turns out we're only in the office for an hour in the morning (and this was in the midst of the pandemic, and there was NO SOCIAL DISTANCING).\n\nThen it was door to door sales selling AT&T internet service. And it was commission based. And it was longer hours and no salary than advertised. Plus door to door sales in the summer. In Texas. \n\nI lasted 2 weeks and bounced. Got an actual tech support job, but am definitely looking out for things like this.",
            "title_similarity": "0.5658339",
            "sentiment_compound": 0.8894
        },
        {
            "id": "gxt8uof",
            "score": 1,
            "text": "Be careful of \"Promotions Manager\" positions too. I drove 40 miles for an interview with the \"owner\" of this company. He looked like he was about 20 years old, swimming in a suit that clearly wasn't his and talking about sales kiosks in malls and grocery stores. But the final straw was when they asked me to show up for a second interview...at a gas station...in a suit and tie. I had to stand there like a fish out of water and watch people get harassed into spending $100 for shitty car wax. Never again.",
            "title_similarity": "0.6773351",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gxt9d8u",
            "score": 1,
            "text": "I’m not sure if it was an interview for exactly this but it was a weird set up that didn’t feel right. There were tons of us in a waiting area right when you walked in. The “interview” lasted maybe 10 min with the guy just talking about sales and promoting companies and drug rehabilitation programs. Not once did the guy ask me a question. \n\nAnd mysteriously all the workers had “left for the day” to do their programs. So it was just the guy and the secretary. \n\nDid I forget to mention the guy said you’d start off making $400 a week and working 6 days a week? What? I make more money from my stereotypical retail job! \n\nThen he mentioned how I would somehow open my own office within a few months! \n\nWhen they called me again saying “HEY YOU GOT THE JOB!” I pretty much just went “uh huh yeah no thanks.”\n\nI still can’t decide if it was a front for a sales positions mentioned here or a front for something similar but a “program.” None of it made sense period.",
            "title_similarity": "0.687819",
            "sentiment_compound": 0.71
        },
        {
            "id": "gxt9hxm",
            "score": 1,
            "text": "Got hired for one of the jobs before. As the guy came back with paperwork to sign I got a horrible feeling in my stomach and got up and left. Thank myself a lot I didn’t waste more time.. a lot of the time these positions are for very pyramid schemes esq. companies",
            "title_similarity": "0.74853814",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gxt9lm6",
            "score": 1,
            "text": "ADT security did the same thing, labelling the job as \"labourer position\". It was door-to-fucking-door.",
            "title_similarity": "0.49047625",
            "sentiment_compound": 0.34
        },
        {
            "id": "gxt9mo1",
            "score": 1,
            "text": "I interviewed for a company JUST like this 2 months ago. As an immigrant with next to no experience in my current country of residence, I desperately applied to many jobs after graduating just to enter the labour market. This company mentioned **Leadership roles in marketing for graduates**. Sounded just like the kind of role I wanted and set up an interview. \nWhile researching the company, I read reviews on Glassdoor about every single role being commission based and related to selling credit cards or some stupid stuff at Costco. I still thought about attending the interview and asked them to explain the role and within 2 minutes decided to nope out of the interview.",
            "title_similarity": "0.77233773",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxtac36",
            "score": 1,
            "text": "I went in for an interview for a sports marketing job Massachusetts. Sat down and watched a video of the boston celtics, fans, players, advertisements.  It was fantastic.  I was ready.  First day I job shadowed someone at Costco doing this.  Oh - the Costco was in Rhode Island.    \n\nThe next day I was told we would hit up small businesses and to wear a suit.  Perfect!  Something solid.  We drove to New Hampshire and was dropped off on a busy route.  We visited two coffee shops, an arcade and a car wash, trying to sell the exact things from the Costco stand.\n\nThere was not a day 3.  Also no calls or texts from them asking where I was.  Still wild none of the trainings were in the same state of business.",
            "title_similarity": "0.6571481",
            "sentiment_compound": 0.8588
        },
        {
            "id": "gxtaf82",
            "score": 1,
            "text": "Yes, this is a great tip! I'm in the midst of a post-grad job search and I've run into a few companies now that hide the fact that the only salary is your sales commission.",
            "title_similarity": "0.69132096",
            "sentiment_compound": 0.75
        },
        {
            "id": "gxtaru2",
            "score": 1,
            "text": "Having my degree in advertising and working in marketing all of my career, I see these jobs alot always \"sales and marketing\" positions. I am sorry but sales and marketing are two totally different things. Run from anything that has that type of wording unless you want to do sales.",
            "title_similarity": "0.7392285",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gxtawx9",
            "score": 1,
            "text": "This may not be the case in very small organisations. They just need someone who can wear a bunch of hats.",
            "title_similarity": "0.33381942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtaycn",
            "score": 1,
            "text": "Cutco does this under the name Vector Marketing and they make it sound great until you’re pressuring your friends and family into buying $1,500 knives.",
            "title_similarity": "0.64512503",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gxtb2f7",
            "score": 1,
            "text": "Valuable skills to learn, nonetheless.",
            "title_similarity": "0.159006",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gxtb92i",
            "score": 1,
            "text": "And if they claim it's a customer service position you can assume they aren't paying much commission on your sales and dispite their instance to focus on a customer's concern they mean \"what is picking you from making the sale!\"",
            "title_similarity": "0.720523",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtbd5h",
            "score": 1,
            "text": "This is actually a solid LPT. May be a.  Bit exaggerated but generally true. I have no interest in sales so I stay away from jobs which mention them",
            "title_similarity": "0.51175314",
            "sentiment_compound": 0.1481
        },
        {
            "id": "gxtc7ew",
            "score": 1,
            "text": "Oh God I worked for one of these \"companies\" that hired me, a stay at home mom, with no good experience on my resume (literally worked at a McDonald's, then a Dollar General, before being unemployed for three years, worked at my apartment complex's office just doing paperwork, then unemployed for another year). I had one year of college under my belt. That was it. They found my profile on indeed and *called me* to set up an interview. \n\nI was under the impression that this was a good way to gain experience. They were willing to teach me certain things that could help me in the long run. They said I'd be working normal office hours. What happened after was not the case. First day, business attire, expecting to be introduced to the team, get a cubicle, and start processing. The office was literally three small makeshift rooms, no bigger than maybe a master bathroom. The two front rooms were much bigger and fitted out to look like a legit office waiting room and CEO office. \n\nI was given a pamphlet of \"marketing strategies and the marketing pyramid\". It literally sounded like a played up Mary Kay presentation. Then I was told the office meeting hour just recently changed from 9am to 7am. During my interview they asked hour my schedule was. I lived across the city, and I had to take my daughter to school. I wouldn't be able to actually make a 7am meeting. They *lied* so I could be trapped. Then they told me my first day would be that weekend. Another lie. I wasn't told I had to work weekends. Then I had to learn this presentation for selling fucking pillows in Costco. \n\nI persevered because my husband was upset I was going to straight up quit a job I just started. Three weeks later and I was a wreck. I wasn't being paid for the office meeting. They tried to tell me I was going against a labor law because I was putting that two hours on my time card. Then they constantly talked down to me when I didn't go to certain events after hours. Like, meeting with the team to \"get to know each other\" at a Starbucks close to the office (remember I lived across the city). Or going to the boss's house for a group dinner (I have a family!).\n\n They even shamed me when I didn't make it to early morning meetings because I had to drop my daughter off at school and drive in rush hour traffic. My team leader said \"How old is she? (7 at the time) What about a bus? (We lived to close to the school) Well why can't she walk? (This is a big city, with a problem with child sex trafficking and people who have actually run over children *on our block*) Why can't your husband take her? (He is in the military. You don't tell your first sgt \"hey I can't come to 5am roll call. I'll be in by 8am.\") Well hire a babysitter. (Why tf do you think I was a stay at home mom for so long and why do you think I now need a job??? We need the money I can barely cover her after school care!)\" \n\nMy first paycheck came in and I was expecting it to be reasonable. I was *supposed* to be getting paid $12 an hour. Nope. I was being paid $7.25/hr, which was under the minimum wage in the state. I spoke to my team manager. She said that it was like that because I started in the middle of a pay period. Okay....um...but I was told I'd be paid $12/hr? \"I don't know who told you that but you technically are paid $9/hr, but since we're having trouble with your lack of motivation and your inability to make it to work on time, and you don't go to any of our team meets after work, we dock you.\"\n\nI was distraught. I screamed in my car in the parking lot. I had a panic attack the next day. I got sick the following week. I came in and said \"I really can't do this today.\" With my nose all stuffy, my eyes watering and you know what I was told \"You can't go home, you need to be at Costco for the new line up. If you go home, you won't get paid.\" I fucking lost it. I told them they weren't paying me anyway. I wasn't coming back. How this all seemed like a scam. They begged me to stop. The escorted me out. \n\nWhen I didn't come back they called me saying I needed to write a letter of resignation. I refused. They refused to pay me. I got a lawyer, she came with me to the office, they made me wait an hour for my last check. The lawyer wanted to speak with my boss. He refused to see us. \n\nThis company is completely off the map now. I had a woman from the dept of labor call and ask questions about the company for an investigation. I don't know what happened....but I'm assuming the worst. Which I don't give a shit. They were terrible people who preyed on people who needed work.",
            "title_similarity": "0.678015",
            "sentiment_compound": -0.9946
        },
        {
            "id": "gxtco1l",
            "score": 1,
            "text": "Also Life Insurance companies hiring Financial Planners.",
            "title_similarity": "0.42284498",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtcpy3",
            "score": 1,
            "text": "If the are 'selling' you a job at the interview, walk away.",
            "title_similarity": "0.64094484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtd03g",
            "score": 1,
            "text": "For the record: sales in and of itself isn’t a bad thing as long as you’re working for legitimate company selling legitimate stuff. A lot of people just can’t handle it. But, if you can, and you’re good, you’ll make a ton of money",
            "title_similarity": "0.6380607",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gxtdexi",
            "score": 1,
            "text": "*sigh* I learned this the hard way. Fresh out of college with a marketing degree (which I now 100% regret) and was desperate for a job. Applied to a ‘marketing solutions’ company and the pitch sounded too good to be true (surprise! It was). I was desperate and accepted. First day in, I learn it’s door-to-door sales for buying houses which I would’ve never agreed to if I knew (they made it sound like I was going to be doing actual marketing for trying to buy houses). The job also involved driving 50 minutes to and from not the best area in town (not ghetto but definitely lower income). The first day in the field, I walked around for 5 hours in the 90 degree Texas sun in jeans and a dress shirt. I nope-d the fuck out when I saw a used heroine needle on the sidewalk. Emailed my resignation the next day that I didn’t feel safe walking around in that area, especially because they wanted me to do it alone in the future as a female Asian (the area is predominately white and rural [think country almost])",
            "title_similarity": "0.7654512",
            "sentiment_compound": -0.6927
        },
        {
            "id": "gxtds9q",
            "score": 1,
            "text": "Pretty accurate, GoDaddy advertised the job as customer support. We were expected to sell minimum $350 a day average.",
            "title_similarity": "0.4941823",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gxtepd7",
            "score": 1,
            "text": "I'm desperately trying to get out of retail/food service now, and this is basically it. There's so many of these predatory assholes out there that it's tually hard to find real jobs -even in retail-. \n\nI just want to not fucking hate myself because if my job every day. And make, y'know, livable wages.",
            "title_similarity": "0.85145205",
            "sentiment_compound": -0.5082
        },
        {
            "id": "gxtf7k3",
            "score": 1,
            "text": "FWIW - I worked for a Smart Circle subsidiary for ~6 months when I was 19. I sold DirecTV at a circuit of big box stores. The job listing was definitely sort of misleading, but I was decent at it and ended up clearing some good cash compared to other gigs I had worked in my young life. More importantly, I actually took some real sales lessons from that job that I still use today (after several real marketing jobs and an eventual return to sales - albeit now selling ~$2 million in marketing contracts per quarter instead of a few tv subscriptions).\n\nThe job listings may be misleading, but if you don’t mind sales and you can pick between Smart Circle and Starbucks, choose Smart Circle.",
            "title_similarity": "0.6501097",
            "sentiment_compound": 0.9125
        },
        {
            "id": "gxtffox",
            "score": 2,
            "text": "Also “fast paced environment” = this is a job for 10 people, but we’re only going to staff 6.",
            "title_similarity": "0.5251511",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtfjnx",
            "score": 2,
            "text": "Can confirm. I interviewed for a marketing assistant position a couple of months ago. In the in-person interview they straight up said I'd be walking around [insert very popular member-only super store] with a clipboard trying to sell people cell phone plans or cable packages. \n\nI declined the second interview.",
            "title_similarity": "0.6887973",
            "sentiment_compound": 0.8464
        },
        {
            "id": "gxtfy72",
            "score": 1,
            "text": "These go right in there with alot of insurance or healthcare ads.  A little better than the scams before where you had to send them money to get a job to pay you money.  I work sales and the company I work at has some people who are quite clever with the job titles.....the competition is similar. Drives me nuts.",
            "title_similarity": "0.6920147",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxtgaf2",
            "score": 1,
            "text": "I graduated a year ago this month with the intention of getting into marketing or event services. Had to pivot to something IT based because I couldn't find anything other than the bullshit offered by the companies this post describes... Its truly infuriating to get your hopes up because you landed an interview only to learn that what they call an \"event coordinator\" is really just haggling people outside a grocery store for donations.",
            "title_similarity": "0.8065228",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gxtgo4w",
            "score": 1,
            "text": "To be fair, I made $14 an hour 12 years ago selling bbq sauce at Costco. Good hours, good pay, and good sauce.",
            "title_similarity": "0.47040445",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gxtgrub",
            "score": 1,
            "text": "From experience, there’s a company that handles the insurance for all major cell phone companies in the US that is extremely guilty of this. When I began working there, I was told “we don’t deal with anything billing related, and you’ll never sell”. That changed about 2 years in, and for the last 3 years, it shifted to completely sales, with no regard for quality customer service or tech support that they offer. You will not talk to these people without them offering their “warranty that never expires” along with 3+ rebuttals. The employees are under extreme stress to meet the goal, which increases monthly regardless of tenure. You better jump in and sell as good as someone that’s been doing it for years right away, and if you don’t meet it, it’s always your fault and you should do better at applying “feedback” before you’re promoted to customer.",
            "title_similarity": "0.6656642",
            "sentiment_compound": 0.4311
        },
        {
            "id": "gxtgsj2",
            "score": 1,
            "text": "I’m a fully licensed financial advisor and investment advisor - it’s not much different for the first 5 years, thousands of cold calls.",
            "title_similarity": "0.3453018",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxthtxb",
            "score": 1,
            "text": "Yep accepted an event coordinator job and ended up having to make 100 cold calls a day.",
            "title_similarity": "0.44040215",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxti6zi",
            "score": 2,
            "text": "This is called The Devil Corp. Google it",
            "title_similarity": "0.41554898",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gxtk5da",
            "score": 2,
            "text": "And not just sales .....likely cold call and you are competing against the rest of your own company that has already called all the leads 500 times.",
            "title_similarity": "0.58676183",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtkssx",
            "score": 1,
            "text": "I was about to go into a job interview tomorrow with this very same job description. They somewhat bent the job description to include public relations which is my career path. But at the top is says promotional sales and marketing has hmmmm 🤔",
            "title_similarity": "0.57766706",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxtku54",
            "score": 1,
            "text": "Not to mention their website was very sus",
            "title_similarity": "0.35036322",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxtn6hm",
            "score": 1,
            "text": "So you didn’t do any research on the company you applied for? Did you just think you are that desirable for that marketing position you have no experience for?",
            "title_similarity": "0.6596932",
            "sentiment_compound": 0.1179
        },
        {
            "id": "gxto55x",
            "score": 2,
            "text": "This is 100% true, I fell for this a few years ago coming out of college",
            "title_similarity": "0.3380313",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxto8h8",
            "score": 1,
            "text": "This is why I got burned out of sales. I made a small living out of contracting for small companies and doing their sales and when I tried finding a good sales job like my dad once had and that I had heard so much about...I didn't find any. It was the same scummy tactics of using meaningless titles, making their sales people \"independent contractors\" so they didn't have to pay any benefits nor an hourly wage, and jobs that were either door to door or sales in supermarkets. \n\n\nA tip for everyone here, if a company is upfront about the work conditions and the position then they're a good bet. In Canada, a good example is Canadian Property Stars. Companies that can be that upfront usually don't have anything to hide and are fantastic places to learn how to sell and get customer service experience.",
            "title_similarity": "0.82077324",
            "sentiment_compound": 0.9201
        },
        {
            "id": "gxtp20c",
            "score": 1,
            "text": "I was that desperate recent grad. They talk it up and didn't even tell you the job, just that whatever you say sounds like a good fit. It was a marketing team opportunity or whatever.\n\nIt was a door to door sales job for comcast. I had to ask them 3 times at the final interview what I was interviewing for. \n\n3 interviews I stupidly went back for when it dawned on me what it was. Lobby was full of other college grads looking for that first job to get experience. Talked to the receptionist what exactly the company did and she had only been there for 2 weeks.\n\nTried writing a review on glass door and it got rejected.",
            "title_similarity": "0.6923314",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxtpe91",
            "score": 1,
            "text": "Went to interview for what I KNEW was a sales job but it turned out it wasn’t. What they didn’t mention was that it was a group interview with like 15 people and the “sales” was going door to door trying to set up appointments for solar for the real sales team. They spent the entire time trying to sucker us in with how much money we’d make lol. Also worth mentioning is I live in Bakersfield California and I’m absolutely not knocking on most of the doors in this city",
            "title_similarity": "0.7002689",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxtpvgs",
            "score": 1,
            "text": "I sat on a virtual networking hour for marketing jobs “of all kinds” for a very well known hotel chain with many properties in my area.\n\nConclusion: they were time share sales jobs.",
            "title_similarity": "0.59759396",
            "sentiment_compound": 0.5563
        },
        {
            "id": "gxtqf8l",
            "score": 1,
            "text": "I was hired to be a fucking writer and did sales 95%. Assholes.",
            "title_similarity": "0.4746719",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gxtrhp9",
            "score": 1,
            "text": "I thought that, at my second job ever, and found myself spending most of my time performing minor repairs on cheap furniture. Worked well for me as I'm not suited for customer-facing work.",
            "title_similarity": "0.54132175",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxtst8p",
            "score": 1,
            "text": "LPT: Fuck entry level sales",
            "title_similarity": "0.44772226",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxtu44q",
            "score": 1,
            "text": "Job situation changed due to covid and I’m desperate for a job. But I refuse to to sales again. I just go on indeed and search “-sales”, set to new, and still have to sift through sales jobs",
            "title_similarity": "0.7656277",
            "sentiment_compound": -0.5346
        },
        {
            "id": "gxtz6zg",
            "score": 1,
            "text": "Are people not already researching the companies and roles they're applying to?",
            "title_similarity": "0.521081",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxu1b46",
            "score": 1,
            "text": "Even if it doesn't say sales, if it's for a company that sells a product, it will probably be sales.",
            "title_similarity": "0.46046805",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxu7cft",
            "score": 1,
            "text": "Third Coast Productions here in Houston. I fell victim to the same exact thing right out of college. It was more of telling me what I was going to be doing instead of an actual interview. \n\nThen he said I could come back next time and meet him at the Costco - that was my cue to leave.",
            "title_similarity": "0.6322036",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gxucorf",
            "score": 1,
            "text": "In addition to that. If you have your resume on careerbuilder/monster/indeed removing the word sales from the resume will reduce the sales related phone calls you get. “We have sales positions and management positions.” 😒",
            "title_similarity": "0.74911565",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxudrwf",
            "score": 1,
            "text": "LPT: if a dev job mentions “some ops”, ignore everything else listed, that will be your job\n\nNow of course that won’t stop them from complaining about your lack of progress on dev projects",
            "title_similarity": "0.659468",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gxufja9",
            "score": 1,
            "text": "what the hell, wasn't this posted a few days ago?",
            "title_similarity": "0.23833027",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxuily4",
            "score": 1,
            "text": "Can confirm.  Also a big tip off is zoom call where the host is late and once you connect you see 5 other people on the zoom call.  Each time I saw that I was like “fuck this, bye bye.”",
            "title_similarity": "0.5408447",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxukymg",
            "score": 1,
            "text": "I didnt get conned into an actual JOB but I did get conned into tagging along on a \"sales trip\" for a major communications company a number of years ago. I had recently been laid off and was looking for a job and I found a posting talking about sales and marketing and customer retention for a communications retailer. Did an actual interview and got called to go in on a saturday for a face to face. I got there and was assigned to one of the supervisors and we went out in the field so I could observe their job. It was a fucking Door-to-Door \"sign up for our phone plan\" job. I got lucky because they went to one house and I just kind of hung back while they went to the door. Owner of the house sat there and had this long drawn out convo and I just bolted. Walked about a half mile to a gas station, called my wife to come pick me up and left.",
            "title_similarity": "0.6880329",
            "sentiment_compound": 0.631
        },
        {
            "id": "gxulweu",
            "score": 1,
            "text": "I work in the general field of scientific instrumentation/technology/biotechnology.\n\nSimilarly if a place (typically a smaller outfit or startup) advertises a position in their research and development team but also mentioned that the position will be doing on-market and field support (\"10% travel\" as claimed on the job description), it's an almost absolute certainty that you will be traveling 80-100% of the time to every customer site that bought their shitty beta-version product launch and have to figure out  everything that is wrong with their product, and also have to ensure to their \"valuable\" customers that the company cares about them.\n\nIt's the worst.",
            "title_similarity": "0.70505524",
            "sentiment_compound": 0.1236
        },
        {
            "id": "gxumlej",
            "score": 1,
            "text": "When I was between jobs I applied for one of these marketing jobs.\n\nI called in to follow up on my resume submission and to ask a few questions about the company.\n\nTheir website was very \"corporate-ese\". *We have a dynamic team that leverages a collective 75 years of industry knowledge to...* Blah blah blah.\n\nI ask them on the phone, \"Hey, I have a pretty strong sales background and I'm used to having face to face prolonged relationship building with a book of business. Looking at your website I was wondering, is this a job selling DirecTV at a Costco? If so please tell me upfront - I don't want to waste your time and I don't want to waste mine so I'd appreciate the honesty.\"\n\nThe \"executive assistant\" on the phone gave me a non answer.\n\nSo I go in for the interview and it's in a shabby office space that looks like they just set up a week ago.\n\nSo I ask the guy interviewing me, \"Hey is this a job selling DirecTV at Costco?\"\n\n\"Uh yeah, how did you know?\" \n\nBottom line, these people do not care about you or their own integrity. Their only focus is hitting their numbers and they'll churn and burn people to get their bonus checks.\n\nYou're more valuable than that.",
            "title_similarity": "0.6604595",
            "sentiment_compound": 0.984
        },
        {
            "id": "gxuof33",
            "score": 1,
            "text": "I have fallen victim to this.\n\nI applied for a job as something equal to a Marketing Coordinator. I interviewed and this manager had me meet at a Sam's Club (for those that don't know, equivalent to Costco or BJ's large wholesale warehouse). \n\nIt turns out it was to stand around and sell DirecTV. \n\nWhile he was showing me what was happening this manager got so caught up in two walk-up customers questioning pricing that I stood around and he focused solely on getting their sale. He even told me to go to a different area around the corner to ensure I wasn't \"creeping over their shoulder\" during the paperwork.\n\nAfter it's all done we go to the food court and he immediately sits me down and offers me the job. I straight up questioned: \"So this is sales, right?\" and he has multiple answers he just lists off like he was trained to do and finally says the selling is a large part of the position.\n\nHe offered me $10/hr (2015, so working most anywhere else would pay more) and I declined *very very swiftly* and left without paying for my $1.25 hot dog.\n\nThe funny thing is my friend ended up sending me a similar job a couple years later and I had to stop her to tell her 'Wait, that looks really familiar...' and turns out same shell company, different lingo'. She went anyways as she was desperate for a job and it was the exact same thing out of a different store. She pulled up to this store, called me, let me say 'I told you so', and didn't even enter the building. \n\nGood post OP.",
            "title_similarity": "0.821939",
            "sentiment_compound": 0.8771
        },
        {
            "id": "gxuohap",
            "score": 1,
            "text": "Reminds how some dude pressured me into Amway when I was 20. Everything seemed so hush hush untill I sat down with the guy. It was after being suckered into that for $100.00 and about 30 conversations with strangers of embarrassment that I gained the wisdom that if people with \"business opportunities\" aren't being direct then to avoid them like the plaque.",
            "title_similarity": "0.63119024",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxuojrv",
            "score": 2,
            "text": "I work at a small business, our 'booking agent' role is that, 95% booking their clients on podcasts. However, the other 5% is generating referrals and sales from their clients (referrals are a huge part of small business), so sales is indeed a 'small part' of the job, but 37-38 hours of the week is just them doing their booking work.",
            "title_similarity": "0.5811143",
            "sentiment_compound": 0.1655
        },
        {
            "id": "gxuq26j",
            "score": 1,
            "text": "I worked as a \"marketing consultant\" for 3 years at a very large corporation. What I didn't know when I applied to the job was that I needed to make 90 minutes of cold calls every day. \n\nIt ended up working out for me in the end, as I ended up in a non-sales position for another company in the same field. But yeah, cold calling sucks and I wish the company was more up front about it!",
            "title_similarity": "0.61820316",
            "sentiment_compound": 0.5255
        },
        {
            "id": "gxuqvse",
            "score": 1,
            "text": "Yeah I applied for a position called something like \"Operations Coordinator\" -- realized it was a full on sales position once I got to the interview.",
            "title_similarity": "0.61623466",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxuqxc4",
            "score": 2,
            "text": "This isn't entirely true. I interned as a \"Marketing & Events Associate\" for a non-profit organization. While I was indeed selling T-shirts/headbands/mugs/etc at our community fundraisers once a month or so, for the other 29 days I was managing  social media accounts, designing promotional materials, editing videos, writing newsletters, among other fun and engaging projects. I would take that internship again in a heartbeat.\n\nSketchy companies are the problem, not enticing job titles. A quick bit of research before applying to a job will save you a lot of headaches in the long run.",
            "title_similarity": "0.6757667",
            "sentiment_compound": 0.5649
        },
        {
            "id": "gxus4fn",
            "score": 1,
            "text": "Reminds me of the Web Dev Internship Interview I went to where the Director whipped out a fucking Bank Card Machine and charged me $2000 for the privilege of building him a website that he'd sell to restaurants.",
            "title_similarity": "0.6332158",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gxusbnb",
            "score": 1,
            "text": "At the same time, sales comes very unnaturally to most, even those who might actually be good at it and aren't horrible schemers (talking about myself here lol)\n\nThe transaction part is really something that *never* comes up in day to day social interactions. It's not particularly natural and is quite awkward.\n\nI had a couple of these jobs when I was younger. I think it's important to treat them not as a potential pathway to riches (which is how the 1% who make it sell it to you). Rather, you should see them as a legitimate opportunity to interact with people in a very unusual way to develop those skills under the umbrella of a legitimate organization.\n\nThose selling stuff to people at Costco jobs or doing door to door is such a foreign experience - but it teaches you skills that are absolutely vital to entrepreneurship. It really got me out of my shell.\n\nDid I make money?\n\nNope.\n\nDo I now have an excellent career in technical sales that I acquired through the skills I picked up in these jobs?\n\nYes.\n\nPro tip: You don't have to slog at them for years. A few months will generally do!",
            "title_similarity": "0.7847444",
            "sentiment_compound": 0.9662
        },
        {
            "id": "gxutwij",
            "score": 1,
            "text": "I hate how jobs still list 20 things that it supposedly has but if it has anything about \"sales\" or \"revenue\" then it's going to be 100% a sales focused job.  I immediately hit back soon as I see anything with those words.",
            "title_similarity": "0.62777495",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gxuu043",
            "score": 1,
            "text": "I fell into one of these traps! I applied for a job as an “Event Coordinator” and when I showed up they wanted me to sell hair dryers in Sam’s Club. This was back in 2016. The company I worked for is called “Vibe Marketing” here in Louisville, KY. I took the job because I have medications and doctors to pay for and I was desperate. \n\nThey had a quota on how many you had to sell but the problem was as soon as you approached a person to pitch to them, they would literally (and I mean literally) run in the opposite direction of you.  Some people would go down different aisles to avoid you. Some would call me terrible names. It was just awful. (It didn’t help that that Sam’s Club I was stationed at was running on a “Skeleton Staff” so tensions were already high in the store.)\n\nWe also had to have “training classes” every morning but they still insisted we weren’t sales people. They also made us listen to these bullshit podcasts about people who came from wealthy backgrounds became wealthier and that was suppose to “inspire” me. It didn’t. \n\nOne day I didn’t show up because it was suppose to be my day off. I got pulled into the office and told I was being lazy (because I didn’t take notes during the lame podcasts) and that I had no drive (because I wasn’t selling due to customer actively avoiding me). They also told me they were pulling me out of the field until I got my act together. \n\nI quit on the spot. I told them that I just escaped an abusive relationship where my ex attempted to kill me by strangulation and if that doesn’t take “drive” then I don’t know what does. The boss looked shocked and I walked out of there that day and never looked back. \n\nI hated the job. Every minute of it.",
            "title_similarity": "0.76258844",
            "sentiment_compound": -0.9941
        },
        {
            "id": "gxuu9t9",
            "score": 1,
            "text": "Used to work for a big name company that stated I would be a “tech” in the end I just answered calls and tried to push crappy internet and phone services for people who already had issues with the services in the first place, they’ll then berate you and try to figure out why you can’t make sells",
            "title_similarity": "0.79460186",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gxuvmgj",
            "score": 1,
            "text": "Not sure if this is consistent outside my country but if an entry level job is advertised as \"Management Trainee\" they're talking about being an Insurance Agent so still in that sales boat.",
            "title_similarity": "0.6257347",
            "sentiment_compound": -0.1232
        },
        {
            "id": "gxv2boz",
            "score": 1,
            "text": "Fell prey to this last year. Lost my job (pandemic) and took away over a decade of digital marketing experience. Couldn't find another job for months, finally got one offer that was listed as \"Marketing Specialist\" \n\nA week in, it became crystal clear that literally the only job metric they were looking at is daily cold outreach numbers in Salesforce.",
            "title_similarity": "0.62202585",
            "sentiment_compound": 0.34
        },
        {
            "id": "gxv9t08",
            "score": 1,
            "text": "i have NEVER seen an appliance at costco i don’t need.",
            "title_similarity": "0.34476575",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxvndw3",
            "score": 1,
            "text": "to add to this if they have a wage that is oddly large, its a sales position. for example \"Financial professional\" with $100,000 to $500,000. I just turned down 2 interview offers because of misleading job postings.",
            "title_similarity": "0.6846563",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy050ex",
            "score": 2,
            "text": "This happened to me. I remember being so happy that I was getting an event coordinator job only to show up to a work interview where I stood next to a girl at Sam’s club trying to get someone to buy a hand softing kit. We sold one in the 4 hour work interview I attended which ended with us talking about all the money I will make while sitting in the food court. I remember being frious and declining the job. I then got an email from the “CEO” who worked her way up from my job asking why I declined. I basically lit into her about not being truthful of the job. \n\nIt’s gross and a horrible feeling when you get in your car realizing that job you were nervous about ended up being a snake oil salesman job :/",
            "title_similarity": "0.71441865",
            "sentiment_compound": -0.4834
        },
        {
            "id": "gyg6a56",
            "score": 1,
            "text": "How tf can a circle be smart yo",
            "title_similarity": "0.26572695",
            "sentiment_compound": 0.4019
        }
    ]
}