{
    "LPT: Overwatering kills more houseplants than underwatering, and its symptoms are very similar. When in doubt, don't water. Other beginner tips in the post.\nMany people enthusiastically bring home a pretty houseplant for the first time, and proceed to water it every day to keep it happy. While understandable, you're setting yourself for heartbreak and frustration.  It is natural to assume that the one thing we know we have to do to plants should be done often, and the more often the better, but root rot is usually not fixable and will slowly kill your lovely plant. Underwatering, on the other hand, can be fixed very easily. As a rule of a thumb, once a week is perfect for most plants. \n\n\nMissing the outdoors and ending up with about 60 houseplants through a year of lockdown, I have learned that majority of them prefer to be left to their own devices. Here is a rather conclusive guide working for vast majority of widely available plants:\n\n\n\n\n- give them a sunny spot. Seems obvious, but we might be tempted to place them for aesthetics out of sun. There are plants that don't mind (ferns are the best example), but most do. Give them sun or grow light. Remember that more sun makes them dry up more often (so on a sunny window sill, water once every 5 days, in a shadowy corner, once every week)\n\n\n\n- once every 2 weeks, take a soft cloth, slightly wet, and clean the leaves. Dust sets on them as well, and it makes it harder for them to undertake photosynthesis properly. It is also a rather soothing activity. Everyone wins. \n\n\n\n\n- get a plant food. They are usually cheap and you can also make your own, and they can make your plant grow like crazy. Don't overfertilise tho - about once every 3 months enough. Too much fertiliser is a thing, and it can burn them. Don't fertilise in the winter. \n\n\n\n- ⚠️ on the topic of eating, many houseplants are toxic to pets if ingested. If you have pets, particularly playful ones, make sure to research ahead to avoid trouble! \n\n\n\n- Don't rush to repot. I know you want to put them in these cute pots you got, but keep them in nursery pots for at least a month. Many plants experience environmental change shock between you taking them from the store and bringing them home, so don't make it harder for them, they will thank you with many happy years in those sweet pots of yours. \n\n\n\n- speaking of pots, always have drainage. Try not to put plants straight into a decorative pot without drainage - get a bigger planter and put it in with nursery pot and tray.\n\n\n\n\n- chop of leaves that go yellow - they won't go green again, and the plant is wasting resources on it. \n\n\n\n\n- if cactuses or succulents, you still have to water them, albeit rarely. Many people recommend cactuses as the most beginner houseplants, but you can absolutely kill both cactuses and succulents, and not only as a beginner (I'll be the first one to admit I've killed a few). But even if they do not die on you, they will not look as lush as when bought in few months unless quite a lot of care is given. If you really want an unkillable plant, get a pothos or peace lily. They both droop when thirsty (so they give you a clear indication as to when to water them), have a lovely chunky foliage, are quite cheap and very sturdy. Another great ones are snake plants. Most cactuses and succulents would go on 4th and 5th place on the \"hardest to kill\" list. \n\n\n\n\n\n- your plant may experience a bit of a shock after about half a year since you bought it, as the fertiliser given in store usually runs out around that time. Don't panic, it is not dying, just give it a little love and plant food and it will be happy again. \n\n\n\nFollow these and you should be just fine for the majority of plants.\n\n\n\nHouseplanrs are awesome decorations that can light up any place, and more than you think are extremely low maintenance. It is a nice hobby for the soul, and don't stress if you kill one, happens to everyone every now and then. Some species are drama queens, and some specimen of no-fuss plants are ungrateful bastards. That being said, most will comply, because they want to be alive just as much as you want them alive. [Here](https://youtu.be/l6huWZZaZek) is a little guide on what to expect from common low maintenance species. Good luck! 💚": [
        {
            "id": "gzc6843",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.5765342",
            "sentiment_compound": 0.9615
        },
        {
            "id": "gzag0c9",
            "score": 0,
            "text": ">but we might be tempted to place them for aesthetics out of sun.\n\nSolution: get two plants and rotate them between optimal and not-so-optimal locations. A week in the sun, a week in the shade ...",
            "title_similarity": "0.4763957",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gza5mrv",
            "score": -11,
            "text": "RP is so cringe at this point",
            "title_similarity": "0.25074947",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzau75q",
            "score": 1,
            "text": "When watering houseplants, stick your index finger into the soil about 2-3” deep. If you sense any moisture at all on your finger, hold off watering until the soil is dry. Old school, but terra cotta pots leach out moisture better than any other plant containers.",
            "title_similarity": "0.67968225",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gzb4jdy",
            "score": 1,
            "text": "This applies to more than just Basil 😉",
            "title_similarity": "0.22180726",
            "sentiment_compound": 0.0
        },
        {
            "id": "gza47qn",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.020349404"
        },
        {
            "id": "gza4o10",
            "score": 8,
            "text": "TL;DR replicate their natural habitat. It can stop raining for days at a time and they are just fine with it",
            "title_similarity": "0.43751907",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzaammt",
            "score": 2,
            "text": "If you have a number of potted plants on a table, consider replacing the pot bases with a small dog kennel liner. Those bases hold very little water and it gets all over the table. A dog kennel liner holds a surprising amount of water.",
            "title_similarity": "0.57134783",
            "sentiment_compound": 0.34
        },
        {
            "id": "gz9slj4",
            "score": 5,
            "text": "This is great. I inherited an old man cactus from the woman who sold me out home. How often should I water him?",
            "title_similarity": "0.5985735",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gza65pj",
            "score": 6,
            "text": "This was a lifechanger for me:\n\nGet a pot with water reservoir and level indicator. No withering, no drowning and with a full reservoir 1-2 weeks of holiday are no problem either. Those pots are quite a bit more expensive, but turn your black thumb into a green one :)",
            "title_similarity": "0.69106865",
            "sentiment_compound": 0.7448
        },
        {
            "id": "gza2911",
            "score": 316,
            "text": "Huge post and you didn't mention a key tip....when dealing with potted plants, don't water from the top, place a reasonable amount into the bottom of the secondary pot and sit the plant in the water.",
            "title_similarity": "0.5620607",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gz9s99m",
            "score": 42,
            "text": "You say that but good luck getting Mimosas to fucking grow in scandinavia... Hate that lovely flower, been trying for 4 years.",
            "title_similarity": "0.6087204",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gz9yxcx",
            "score": 78,
            "text": "Agreed, sunny spot will save many plants. \n\nPlants eat light. Water and nutrients just help with digestion. They have different light needs, too.",
            "title_similarity": "0.50726426",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gza0qhl",
            "score": 68,
            "text": "Please man r/plantfacts, we need to bring it to life",
            "title_similarity": "0.32161105",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gza751d",
            "score": 35,
            "text": ">chop of leaves that go yellow - they won't go green again, and the plant is wasting resources on it.\n\nno no. the plant takes back all the useful nutrients from the leaf as it dies off, as well as transporting waste products into it to discard. let the leaf dying process happen naturally. leave the leaf on the plant until it is fully browned and wrinkled. ideally allow it to drop from the plant of its own accord",
            "title_similarity": "0.6947068",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzae98j",
            "score": 44,
            "text": "Look at my name, I know. oh god, I know.",
            "title_similarity": "0.071187325",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gza8rju",
            "score": 108,
            "text": "I have 100 houseplants and these are my tips:\n\n- Know what kind of plant you have and what their needs are. Some like to dry out, some don't. What is their natural environment, do they grow up high in trees or in the understory? Does it depend on water or light for survival? What does the physical form of the plant tell you, does it have thick leaves for water storage? Are the leaves fuzzy to protect against the sun?\n- Know what kind of light you have in your house. What direction is the window facing? (Most to least bright: South, West, East, North when you are in the Northern hemisphere) Do you have a tree or something diffusing the light? \n- Never water on a schedule, just take the time every few days to really look at your plants. Do the leaves feel limp? Is the soil dry? Plants tell you what they need.\n- Shower your plants every once in a while, it cleans them and helps get rid of pests. You could also put them outside during rain if it is warm out.\n- Good soil is key. Different plants require different soil. I like to make my own mix of Coco Coir with stuff like perlite, leca, orchid bark etc.\n- Don't be afraid of using your shears.\n\nGood channels for info are Planterina, Kaylee Ellen, Summer Rayne Oakes, Nick Alexander, Harli G and many more.",
            "title_similarity": "0.59382904",
            "sentiment_compound": 0.9599
        },
        {
            "id": "gza6dfw",
            "score": 46,
            "text": "I nearly killed a plumeria that we brought back from Maui. It was growing well but suddenly started drooping and turned yellow.\n\nI repotted it. It had one tiny root. I guess we drowned it and the roots rotted. It is now coming back but I thought it was a gonner for a while there",
            "title_similarity": "0.7347924",
            "sentiment_compound": -0.802
        },
        {
            "id": "gza2eqy",
            "score": 454,
            "text": "Growing up, one of my chores was to water the plants outside.  We had a lot of plants.  Makes sense that I have to water the plants regularly right?  It's florida and it's hot\n\nExcept it got to a point where even if it rained *heavily* that day, I would still be required to water the plants.  I was watering plants that were already soaked, because I had to.  The plants were always wilting and dying and I still had to soak them every single day.\n\nI wonder if she's still watering those plants and wondering why her whole garden looks like shit",
            "title_similarity": "0.74273336",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gza5c1r",
            "score": 483,
            "text": "If for any reason the leaf is getting brown, wait a few days before cutting that leaf. The plant is moving part of the nutrients like iron, zinc and manganese from the brown leaf to the other leafs. if you cut the ugly leaf too fast you will lose part of those micronutrients.\n\nAlso, plants need nitrogen to grow big and green, phosphorus for the photosypnthesis and potassium to make fruits big. This nutrients or macronutrients are called NPK. Find a good NPK fertiliser. The main micronutrients are Iron, Manganese, Zinc (the three for photosynthesis, auxine production, overall leaf green etc), Calcium (stability and fruit firmness), Molybdenum (flowering) and Magnesium (photosynthesis). If you can find a fertilizer with a proper combination of all, you are set and your plant won't be hungry :)\n\nIf you are curious about plant nutrition, try to find divulgative information about cannabis. They are expert in plant nutrition, but their info is presented in an easy way to understand for all!",
            "title_similarity": "0.70056295",
            "sentiment_compound": 0.4501
        },
        {
            "id": "gz9w75n",
            "score": 2736,
            "text": "Speaking as a person that has 30-40 potted plants, the easiest way I've found to know when to water most plants is to check when the soil is dry at least an inch or so down from the surface of the soil, then soak it.  Wait till the top inch or so is  dry again to water.    \n\n\nThis prevents under and over watering.  The worst way to water is to do it on a schedule.  Depending on the type of plant and pot, they will dry out at different rates.  One plant might be fine being watered every 4 days, but the one right next to it might have root rot from being constantly drowning in water.",
            "title_similarity": "0.7329626",
            "sentiment_compound": 0.0868
        },
        {
            "id": "gza18k8",
            "score": 279,
            "text": "I don't know if I agree about repotting. Yes it's stressful, but the counterpoint is that some plants are very rootbound in their original contains. It's a judgement call in my mind.",
            "title_similarity": "0.57911813",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzajduj",
            "score": 2632,
            "text": "I have been gardening for the last 3 years and I always am amused when something is wrong with my plants and I try to google it. \n\n\"That could be from over watering, under watering, not enough nutrients, too many nutrients, not enough sunlight or too much sunlight.\" \n\nGreat.",
            "title_similarity": "0.7271739",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gz9zezz",
            "score": 67,
            "text": "Awesome! Do you have any tips for growing herbs? I was hoping to start my own herb garden (rosemary, thyme, basil) indoors on a windowsill but wasn’t sure about pruning and regular care. Would the watering advice in your post and in the comments be the same?",
            "title_similarity": "0.5270331",
            "sentiment_compound": 0.9136
        },
        {
            "id": "gza2unl",
            "score": 34,
            "text": "When in doubt touch the soil.",
            "title_similarity": "0.025375994",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gza4cbu",
            "score": 6,
            "text": "I somehow managed to kill two lovely Clusia plants and I have no idea how. Didn’t overwater them, but they kind of went limp and you could see their cell structure on leaves? \n\nAlso - have managed so far to kill a few succulents, because no matter how sunny spot I choose for them, they seem to deem it too dark. Now I’m just happy with my ZZ plant - that one seems very foolproof for people like me.",
            "title_similarity": "0.78534675",
            "sentiment_compound": 0.7739
        },
        {
            "id": "gza59or",
            "score": 1,
            "text": "How can I keep my store bought basil from turning yellow?",
            "title_similarity": "0.4995732",
            "sentiment_compound": 0.0
        },
        {
            "id": "gza6dxt",
            "score": 2,
            "text": "I have plants, when the leaves start going low instead of upwards of flat i add water",
            "title_similarity": "0.36286974",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gza6iho",
            "score": 14,
            "text": "Omg I LOVE Planterina, she is just a beautiful human being.",
            "title_similarity": "0.37713873",
            "sentiment_compound": 0.87
        },
        {
            "id": "gza7nvn",
            "score": 3,
            "text": "Honest question: Why don't plants that grow in the wild experience root rot?",
            "title_similarity": "0.47868526",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gza7zwg",
            "score": 14,
            "text": "I second the aesthetic issue: while that orchid may look lovely in the living room corner, it likes the bathroom so much better, for the sun amount and humidity. \n\nYes on the finger test for soil water content. My grandmother was right.",
            "title_similarity": "0.6480397",
            "sentiment_compound": 0.9096
        },
        {
            "id": "gza8in7",
            "score": 5,
            "text": "Good stuff.\n\nI gently poke my finger into the soil to see if the soil feels moist or not.\n\nSeems to work for me.",
            "title_similarity": "0.3141632",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gza8jr4",
            "score": 1,
            "text": "The only plants i could not kill were two $10 lowes cactus and bamboo plants, and one $10 bonsai from home depot. Everything else would die",
            "title_similarity": "0.6155369",
            "sentiment_compound": -0.0418
        },
        {
            "id": "gza8ko2",
            "score": 1,
            "text": "What about orchids and lilies? Anybody got any specific guidance?",
            "title_similarity": "0.16202791",
            "sentiment_compound": 0.0
        },
        {
            "id": "gza8pg8",
            "score": 1,
            "text": "I’m usually death to green things but I keep trying. I’m now in an apartment with a balcony facing direct north... and facing the parking lot. It’s on 2nd floor, and enclosed on both sides as well as the top. Will ANYTHING grow there? Oh... I’m in TX hill country, so summers are normally over 100F... and the polar vortex this Feb was deadly! \n    Any advice— I’m thinking of getting a generic grow light and putting it on the balcony- but does it have to be right over the plants, or can I hang it (or them ?) from the ceiling by the balcony light? The light would be about 6 feet from the plants....\n   Maybe I can just go fake....",
            "title_similarity": "0.6440475",
            "sentiment_compound": 0.5317
        },
        {
            "id": "gza8rgt",
            "score": 9,
            "text": "Fertilizer tip from my green thumbed grandma: mix a tiny bit of fertilizer/plant food into your watering can every time you water and then you will never have to think about it. Totally works, just make sure to only use a little each time.",
            "title_similarity": "0.6697797",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gza8uti",
            "score": 4,
            "text": "What about a place that will go above 40°C in a few days and have most of their potted plants outdoors? Most of the time the soil get's flaky and is dry as hell. Should I still water it regularly or just few days a week??",
            "title_similarity": "0.5950949",
            "sentiment_compound": -0.7303
        },
        {
            "id": "gza9czh",
            "score": 3,
            "text": "I’m always in doubt, so it looks like the murder spree will continue.",
            "title_similarity": "0.6247506",
            "sentiment_compound": -0.6637
        },
        {
            "id": "gza9f7l",
            "score": 12,
            "text": "As a notorious plant murderer, thank you for bringing my numerous transgressions against the world of flora into sharp focus.",
            "title_similarity": "0.6139852",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gza9in6",
            "score": 34,
            "text": "Like so many problems in life, the answer is to just stick your finger in it. \n\nPut your finger in it. Feel moist soil? Don't water. It's dry? Add some water.",
            "title_similarity": "0.5446569",
            "sentiment_compound": -0.2116
        },
        {
            "id": "gza9suh",
            "score": 1,
            "text": "The part about Cacti makes me proud of my now ~4 feet tall one I got at Lowe’s many a year ago",
            "title_similarity": "0.43377775",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzaa697",
            "score": 7,
            "text": "Something related that first time home owners should know - This is applicable for watering the lawn too. \n\nHome owners tend to get into this rhythm of soaking the lawn for hours on end, daily, to give it the water it 'needs'. \n\nThey get home from work, see a neighbor watering their lawn and think they should too. The next day, another neighbor is water his lawn... and they throw the sprinklers out again. This is a bad practice. \n\nYes, when first planting seed it's good to water (very briefly) 1-2x a day for the first few days to keep the soil moist. But after that, once things have taken to the soil, stop. \n\nYour yard only needs to be watered once or twice a week at most. Twice in the hottest parts of summer if you don't get any rain. 10-15 minutes of coverage is more than enough. Outside of this, it doesn't have to be done. More importantly, it shouldn't be done more than this. \n\nOver watering causes compaction of the soil. A major issue which will destroy your lawn. Not to mention, it washes away nutrients and makes the grass reliant on the watering. It can also lead to root rot of trees, funguses, weed growth, insect attraction, and more. \n\nIf you water your lawn, and your grass is dying/yellowing, don't resort to watering more. It's more than likely not an issue of underwatering. It could be from overwatering. \n\nIf you can't remember whether you watered your lawn during the week? Don't. Wait a few more days and then do it. The grass won't die if it goes 3 more days without a water.",
            "title_similarity": "0.7318572",
            "sentiment_compound": 0.8676
        },
        {
            "id": "gzaaeir",
            "score": 1,
            "text": "I still underwatering it, i set myself a reminder to water them every week, otherwise i will forget them 100 %.\n\nAll my plants I had till now, which were not doing good, had way to less water. I put some succulents outside and BAAMM they look amazing.\n\nStill no idea of what i am doing.",
            "title_similarity": "0.8090137",
            "sentiment_compound": -0.1793
        },
        {
            "id": "gzaaou0",
            "score": 1,
            "text": "It also seems like windy days make my potted plants dry out quicker.",
            "title_similarity": "0.6602851",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzaap7r",
            "score": 3,
            "text": "Definitely guilty of over watering my plants. Brought home an Asparagus fern a few months ago and kept watering it daily. Starting from the second week I started to see some browning of the leaves and thought that I might have have given it enough water. And so I did what any other beginner would do, I watered it some more. Big big mistake.\n\nI was lucky to read online on the plant's watering needs and forced myself to dial back on the water for a few weeks and my plant is healthy as ever now.",
            "title_similarity": "0.79199696",
            "sentiment_compound": -0.0679
        },
        {
            "id": "gzab8uy",
            "score": 1,
            "text": "Sadly I feel I overwatered by succulent  when I first bought it back in Oct (along with a few other plants). The rest are doing fine now but it died/whittled down 3 months later.\n\nOne of my plants has droopy leaves when it needs water so I know it helps me realise when it needs a drink.\n\nAloe Vera plants are tough to check if they need water, as their 'leaves(?)' spread outwards, thus covering the whole plant pot, so you cant find a space to put your finger in to feel the soil.",
            "title_similarity": "0.7896043",
            "sentiment_compound": -0.0129
        },
        {
            "id": "gzabvkp",
            "score": 1,
            "text": "My ficus tree won’t stop dropping perfectly good leaves despite all my best efforts.",
            "title_similarity": "0.55959845",
            "sentiment_compound": 0.3678
        },
        {
            "id": "gzacg0c",
            "score": 2,
            "text": "Will simply watering less get rid of the white fungus that grows on the soil?",
            "title_similarity": "0.49842852",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzacwdw",
            "score": 1,
            "text": "Under watering hasn't killed my avocado plant, instead it decoded to shoot off way more branches.",
            "title_similarity": "0.61903167",
            "sentiment_compound": 0.2937
        },
        {
            "id": "gzad3ep",
            "score": 2,
            "text": "I'm a plant newbie so this was a very needed post, thank you!",
            "title_similarity": "0.41809738",
            "sentiment_compound": 0.4688
        },
        {
            "id": "gzademx",
            "score": 1,
            "text": "When watching someone’s house don’t water the plants let the wilt a little then the day before they come back give them a good watering they get really full and vibrant. This is what I do.",
            "title_similarity": "0.75210416",
            "sentiment_compound": 0.7624
        },
        {
            "id": "gzadi3d",
            "score": 1,
            "text": "Overwatering plant murderer here. Can confirm. Bought a moisture meter for the sake of my plants.",
            "title_similarity": "0.6442555",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzadk3c",
            "score": 1,
            "text": "My plants always die from bugs of some kind- spider mites, aphids, etc. How do I prevent that?",
            "title_similarity": "0.6542542",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzadt58",
            "score": 5,
            "text": "I had this beautiful succulent my gf bought me and then it started going mushy and dying. I took some photos and sent it to her and she thought I hadn't been watering it, so I watered it more.  I did some googling for symptoms when it wasn't getting better\n\nYea...I had completely drowned the thing.  I tried pouring out the water from the pot and a ton came out, but it was too late the main stem had already decayed.  She still makes fun of me for killing a 30$ plant that are basically impossible to kill",
            "title_similarity": "0.8483143",
            "sentiment_compound": -0.9336
        },
        {
            "id": "gzae1w5",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.020349404"
        },
        {
            "id": "gzae7rv",
            "score": 1,
            "text": "Ok so Jimmy Neutron lied to me when he talked about Cindy Vortex’s giant flowers?",
            "title_similarity": "0.5576832",
            "sentiment_compound": -0.1689
        },
        {
            "id": "gzae8xe",
            "score": 1,
            "text": "I have a snake plant and one of the leaves has a brown spot on it. Should I wait and hope that it turns green or do I need to prune it? Also, how do I prune it? I am new to plants and don't know what I am doing.",
            "title_similarity": "0.4972766",
            "sentiment_compound": 0.504
        },
        {
            "id": "gzaeax6",
            "score": 1,
            "text": "Amen. Spread the word!\n\nAll my office plants started mysteriously dying while I was working from home. I went into the office to water them every other week. I finally “caught” one of my coworkers trying to be helpful by watering them for me. All that extra water was literally killing them. We cleared up the confusion and lo and behold, when they went back to their fortnightly waterings, they all recovered.",
            "title_similarity": "0.7868954",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gzaehet",
            "score": 3,
            "text": "Over fertilizing is deadly, too. Your plant will get burned leaf tips, and make you think it needs something, so you give it more, until it dies. Fertilizer isn't food for plants, it's more like vitamins. Plants can only use fertilizer to the extent that they have available light, CO2, and water. More fertilizer than that becomes toxic.",
            "title_similarity": "0.7794702",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gzaehoj",
            "score": 23,
            "text": "I would add for succulents though they kind of have their own rules.\n\n You may want to dust them with a light brush (I use an old large blush brush), but they produce their own sunscreen and it makes them appear \"dusty\". If you wipe that off with a damp towel they'll burn. \n\nAlso, when their leaves turn pink/crispy DONT cut them off! They're reabsorbing that leaf to get some of the energy back. Yellow soggy leaves are more of a sign of over watering though.",
            "title_similarity": "0.6971366",
            "sentiment_compound": 0.65
        },
        {
            "id": "gzaelwf",
            "score": 1,
            "text": "Instructions unclear...\n\nDidn’t water plant.  It died.",
            "title_similarity": "0.30179486",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzaexlh",
            "score": 2,
            "text": "I have a ton of plants, some pretty exotic, some totally common. My approach is to give everybody some water every Tuesday. Like clockwork. And this is actually a bit of an endeavor because I was told long, long ago to water them in stages, like, give 'em some water and let it soak in. I'll wait for half an hour or so, and give 'em some more water, then wait some more. You don't wanna saturate them. I'll keep an eye on them and add a little more water throughout the day until I see some water seeping into the tray, then I know they're cool.   \nFor fertilizing, I use fish emulsion. It's a habit I got into thanks to a very good friend of mine who was helping me with my overly-ambitious garden, but it works wonders. But boy is it stinky! So for the houseplants, I have a schedule of feeding them fertilizer eight times a year: the solstices, the equinoxes, and the cross-quarter days. Regardless if it's Tuesday or not, they gettin' some food!   \n\nMy biggest issue anymore is the coffee tree and the cereus.  Anybody who's grown a cereus already knows the conundrum. It's a tropical vine fer cryin out loud! And I've just decided that the coffee tree is now part of the place, so whoever moves in next gets to keep it. She's gotta be at least 25 yrs. old. She's been repotted several times, but she's gotta be totally root-bound at this point, and I really don't wanna put her in a bigger pot cuz she's just gonna get bigger, but there's no more room for her to grow, she's already struggling to get through our really high ceiling as it is!   \nBut she'll never make it out the door, so here she shall remain.",
            "title_similarity": "0.7513691",
            "sentiment_compound": 0.3723
        },
        {
            "id": "gzafbv0",
            "score": 5,
            "text": "I work at a garden center and THIS ADVICE! 👍🏻⭐️👏🏼",
            "title_similarity": "0.17746887",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzafdja",
            "score": 1,
            "text": "Any tips on how to water plants when going on vacation and no one has time to take care of them?",
            "title_similarity": "0.5207241",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzag4pb",
            "score": 1,
            "text": "I can keep dianthus (annual variety) alive over several winters outdoors but I've killed my son's succulents indoors on multiple occasions. I needed this advice of leave them alone. That seems to keep the dianthus (and other annuals) alive for several years.",
            "title_similarity": "0.7046032",
            "sentiment_compound": -0.705
        },
        {
            "id": "gzag6nc",
            "score": 3,
            "text": "Definitely not the case for me - I used to underwater everything. I just use “underbowls” or whatever the name is, so the plant can suck up what it wants on its own.",
            "title_similarity": "0.61523926",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzag9zi",
            "score": 1,
            "text": "How does it survive rain and shit outside",
            "title_similarity": "0.22557971",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzagfvj",
            "score": 1,
            "text": "Okay, so I have plants that I somehow manage to not kill. My issue is that they keep growing!! They get too big for the pot, so I give them a new pot, and they outgrow that one. Is there a way to keep indoor plants to a reasonable size?\n\nExample: someone gave me one of those lucky bamboo things you see at the mall. It's now almost as tall as me, just a big leafy thing. It's a monster! I don't need or want a plant that big, but I feel bad killing it.",
            "title_similarity": "0.7966376",
            "sentiment_compound": -0.8679
        },
        {
            "id": "gzagks4",
            "score": 2,
            "text": "I never thought I was a plant person until the quarantine started. I bought a random potted tangerine sprout on a whim and then suddenly realized I have a huge balcony looking southward which is PERFECT for plants. Im now trying to grow every single possible thing and this new hobby is sooooo good for my mental health seriously.\n\n I love my plants they are my children, but I'm also a total noob at taking care of them and the tips of all the people in this tread are so helpful :D",
            "title_similarity": "0.77017343",
            "sentiment_compound": 0.972
        },
        {
            "id": "gzagn2p",
            "score": 1,
            "text": "Fake plants it is then.",
            "title_similarity": "0.21396358",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzah23o",
            "score": 1,
            "text": "I have basil in my kitchen right at the window and I can’t seem to get it to thrive. I have tried relaxing on the watering and I have tried watering every day and it always looks “meh”",
            "title_similarity": "0.6993278",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzah6a0",
            "score": 1,
            "text": "Thank you for this, impeccable timing as I bought my first house plant this weekend",
            "title_similarity": "0.46123442",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzahbsf",
            "score": 1,
            "text": "Is this true?  My whole life I've been doing the opposite",
            "title_similarity": "0.22011542",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzahebd",
            "score": 3,
            "text": "To clarify overwatering means watering too frequently not too much water per watering session",
            "title_similarity": "0.58845496",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzahiy9",
            "score": 1,
            "text": "Simply put. Underwatering is much safer then overwatering as once the soil is sodden, your chances of drying it out to let the roots breath are low as compared to under where all you do is water some to fix.",
            "title_similarity": "0.6014799",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzahkp8",
            "score": 1,
            "text": "https://imgur.com/gallery/3WHlekp\n\nHere’s two of mine. The one on the left has some yellowing at the top of the leaves and the one on the right has some dark brown crunchy spots on the leaves. \n\nShould I cut off all those leaves?",
            "title_similarity": "0.45549506",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzahpvz",
            "score": 1,
            "text": "Im having this issue RIGHT now with my plant, Philip. Thanks!",
            "title_similarity": "0.40900844",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gzaikqs",
            "score": 1,
            "text": "My Aloe Vera is 15 years old now. I've almost over watered it to death twice, but just leaving it alone allowed it to come back.",
            "title_similarity": "0.62162226",
            "sentiment_compound": -0.6059
        },
        {
            "id": "gzaio8u",
            "score": 1,
            "text": "I started watering my plants only when they start looking sad and wilty, never had a plant die on me since that! They come back to life a few hours after watering them as if nothing happend.",
            "title_similarity": "0.7193127",
            "sentiment_compound": -0.807
        },
        {
            "id": "gzaiu2n",
            "score": 1,
            "text": "Any tips on a peace lilly?",
            "title_similarity": "0.20873544",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzaizz7",
            "score": 1,
            "text": "I can’t doubt it cuz I def don’t water them",
            "title_similarity": "0.28283772",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzaj7i1",
            "score": 1,
            "text": "Learn how much your pot weighs dry and wet. Then just lift the pot every now and then. \n\nIt’s a lot smarter to buy drought resistant plants and abuse them. A lot thrive on abuse.\n\nJust like me.",
            "title_similarity": "0.772377",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzajhlv",
            "score": 1,
            "text": "Fuck now this is a pro life tip. Finally! Tired of “brush your teeth” or “use turn signals” or “write things down so you don’t forget” on this sub.",
            "title_similarity": "0.6682693",
            "sentiment_compound": -0.7712
        },
        {
            "id": "gzajkcw",
            "score": 1,
            "text": "I learned the hard way that this can also happen outside with some plants. As a new gardener I just lost 3 hops plants in raised beds to drowned roots. It was hard to tell when to water with such deep rooted plants because the top couple inches of dirt would be super dry out in the sun, but deep down it was probably still wet all the time.",
            "title_similarity": "0.7910156",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gzajphl",
            "score": 1,
            "text": "*clicks save*\n\nAs a new homeowner, I think you so much for this!  I definitely over watered some of my plants and it was very frustrating.  Hopefully I can salvage some of my plants.",
            "title_similarity": "0.7958902",
            "sentiment_compound": 0.7164
        },
        {
            "id": "gzajrm5",
            "score": 1,
            "text": "I'm the perfect case study for this! \n\nMy aunt gave me a snake plant(mother-in-laws tongue), it's pretty much the only plant I've ever had as a single 35 yr old male. \n\nI've definitely been a tad neglectful of it at times and the thing keeps on trucking. \n\nIronically, these plants only blossom when they are mildly neglected and stressed and apparently is an EXTREMELY rare occurrence. \n\nMy aunt was rather annoyed and jealous when I told her that mine had actually blossomed lol.",
            "title_similarity": "0.76630175",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gzajsq2",
            "score": 1,
            "text": "I’ve had the same house plant for over 20 years, I consider myself a pro but I’ll give you some beginner advice\n\nBuy a fake house plant",
            "title_similarity": "0.5848613",
            "sentiment_compound": -0.631
        },
        {
            "id": "gzajyap",
            "score": 1,
            "text": "This is so dumb, there are many common plants that you are NOT supposed to put in sunlight, you are doing more harm than good here.",
            "title_similarity": "0.68226594",
            "sentiment_compound": -0.7069
        },
        {
            "id": "gzak02a",
            "score": 1,
            "text": "My aloe was not doing very well. Limp leaves, turning brown/reddish... Looking up the cause the symptoms are basically the same between overwatering and underwatering. I thought I must have overwatered it so I unpotted it to check the roots. Little did I know I'd only been watering the first two inches of soil. The pot I chose was very attractive but had no holes in the bottom so I had been watering extremely sparingly. Drilled a hole, watered until it started coming out the bottom and voila. Aloe came back to life",
            "title_similarity": "0.7791058",
            "sentiment_compound": -0.3002
        },
        {
            "id": "gzak1xq",
            "score": 1,
            "text": "Any tips for gnats? My plants were doing so well and then the gnats were so bad I had to get rid of them. I tried the neem oil but it didn’t help. Since I’m starting over, any tips for preventing them in the first place?",
            "title_similarity": "0.7949842",
            "sentiment_compound": 0.4376
        },
        {
            "id": "gzak24c",
            "score": 1,
            "text": "Maybe somone can answer, I have strelitzia.And was repotting it after the cold months ended. and noticed it has very big and thick roots. like they filled whole pot. should i be worried or just let it be, since it seems to be doing fine?",
            "title_similarity": "0.6029632",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzak5xv",
            "score": 1,
            "text": "What about when germinating seeds? I am trying to start cayenne peppers from seeds.",
            "title_similarity": "0.3656497",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzak769",
            "score": 1,
            "text": "“Humans kill plants in mass drownings”",
            "title_similarity": "0.46996707",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzak7y3",
            "score": 1,
            "text": "I recently got a brand new, very healthy looking rosemary bush, about 18” in height and perfectly green. Since I’ve got it, a patch of dry, brown leaves has appeared, o thought I was under-watering it, but your post has me thinking it’s over watering (rosemary is native to dry, arid climates). What is it?",
            "title_similarity": "0.5734556",
            "sentiment_compound": 0.5569
        },
        {
            "id": "gzakb15",
            "score": 1,
            "text": "I inadvertently murder herbs on the reg. All I want is a windowsill herb garden damn it!",
            "title_similarity": "0.6419406",
            "sentiment_compound": -0.8122
        },
        {
            "id": "gzakcmr",
            "score": 1,
            "text": "Question for anyone who can answer. \n\nI bought some small cactus plants from a store near me, no idea of the names sorry.\nIt has a round red \" flower \" on top and eventually that main part died, but it grew arms is the best way I can describe it. \n\nIt had two offshoots on the sides one has grown left along the planter and the other has grown straight up and is now over a foot tall. \n\n\nIs there anything specific I should be doing or just let it do its thing?",
            "title_similarity": "0.6160229",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gzakh0z",
            "score": 1,
            "text": "I've never managed to keep a succulent alive more than a month or so, on spite of them supposedly being difficult to kill.  I don't understand where they get that reputation from.  I've followed the watering directions precisely, measuring out the 20 ml or whatever it recommends, setting reminders on my phone to do it every 2 weeks, but still, they always die so quickly.  It just makes me frustrated and not want to try to care for any plants.",
            "title_similarity": "0.7800189",
            "sentiment_compound": -0.8893
        },
        {
            "id": "gzakjml",
            "score": 1,
            "text": "remember ralph, if your nose starts bleeding you're picking your nose too much......or not enough.",
            "title_similarity": "0.58836675",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzakkps",
            "score": 1,
            "text": "Overeating kills more people than undereating.",
            "title_similarity": "0.5531604",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzakmzb",
            "score": 1,
            "text": "I'd add check succulents for mealy bugs BEFORE you bring them home. I made that mistake and the fuckers not only survived being sprayed with alcohol (nearly killed the plant itself but yet they survived) and they moved onto other plants. They make stuff that looks like cotton so if you see little white pieces of \"cotton\" on a plant just leave it at the store.",
            "title_similarity": "0.7856753",
            "sentiment_compound": 0.1653
        },
        {
            "id": "gzalnrp",
            "score": 1,
            "text": "I don't know if it has been mentioned here yet, but when you bring a plant home from a big box store, it's a really good idea to not give it any water for a few days. I know Lowe's and Home Depots are notorious for overwatering their plants to keep them looking lush and beautiful - but they need a break when they get to your home otherwise you are effectively water boarding your plants lol. I always take mental note of how heavy the plant feels and watch it for a few days for any signs of drooping. If the plant is lighter, than it's ready for some more. I have had much better success with new plants I take home not dying within a few days after a few people here on reddit mentioned how some stores will overwater to sell more.",
            "title_similarity": "0.81674784",
            "sentiment_compound": 0.9808
        },
        {
            "id": "gzalp7a",
            "score": 1,
            "text": "My pothos is a rescue, i found it stuffed into a box, behind a seniors appt. When a resident dies the place chucks all the leftover stuff the family doesnt take. Anyways this poor plant was very close to dying, i ended up having to cut it back to almost nothing, as most of the vines had been damaged. Two years later, the plant is now thriving and has started a total of five new vines",
            "title_similarity": "0.72865087",
            "sentiment_compound": -0.6514
        },
        {
            "id": "gzals5t",
            "score": 1,
            "text": "Y-yeah... this is totally why I forget to water the plants every day for my mum when she goes on vacation.",
            "title_similarity": "0.6726152",
            "sentiment_compound": -0.2878
        },
        {
            "id": "gzalswb",
            "score": 1,
            "text": "Don't chop off yellow leaves. The plant is still withdrawing resources from them. You can pluck them off when they're brown and dry. As a corollary: all plants lose leaves. Don't freak out with the first yellow leaf you see. Leaves don't last forever. \n\nSometimes when you buy a plant the pot it's in is WAY TOO SMALL for it. Greenhouses have nefarious methods of keeping plants alive that the average houseplant owner isn't able to fathom. If the plant is root bound, pot it into a larger pot with better soil immediately.",
            "title_similarity": "0.82697225",
            "sentiment_compound": 0.6377
        },
        {
            "id": "gzam6nk",
            "score": 1,
            "text": "As a pro, 100% approve 👍🏻",
            "title_similarity": "0.28721553",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzam6o4",
            "score": 1,
            "text": "*Life is Strange* taught me this.",
            "title_similarity": "0.2808311",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzam6vy",
            "score": 1,
            "text": "I recently got a young tree as a gift. It’s about 4ft high. How much do I water that? I started off doing WAY too much",
            "title_similarity": "0.47094965",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzam7dt",
            "score": 1,
            "text": ">chop of leaves that go yellow - they won't go green again, and the plant is wasting resources on it.\n\nThis isn't always good advice. It's normal for older leaves to yellow before they die and the reason that happens is because the plant is literally harvesting nutrients from it to use in the younger leaves. The only resource they're using is water, otherwise they're acting as a source for reusing resources before dying. Once they've completely yellowed and started to decay, THEN it's time to chop them.\n\nIf the leaves that are yellowing are not old leaves, you have a nutrient problem or a watering problem that needs to be corrected. Chopping those leaves when yellow won't hurt anything, but you need to fix whatever caused the yellowing too.",
            "title_similarity": "0.7889769",
            "sentiment_compound": -0.7694
        },
        {
            "id": "gzamelt",
            "score": 1,
            "text": "Could you just get any fertilizer for all the plants.  Thats the one oart I am stuck on.  \n\nI have a few pothos, a fig fiddle leaf, cactuses, a few succulents, bostern ferns, a large snake plant, a few types of tropical ones i cant remember on hand.",
            "title_similarity": "0.4459622",
            "sentiment_compound": -0.5615
        },
        {
            "id": "gzamgoo",
            "score": 1,
            "text": "I think my mum might have seen this post years ago thats why all the plants are bone dry",
            "title_similarity": "0.58916473",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzamhdm",
            "score": 1,
            "text": ">If you really want an unkillable plant, get a pothos or peace lilly. \n\nA money tree, also known as the Guiana Chestnut, is good too.  Plus you can grow a few of them together and braid them as they grow!\n\nYou would think that a tree from a tropical wetland would need constant care and lots of watering, but that is not the case.  I water mine once every 2 weeks or so, and it is thriving.  They do need a fairly sunny spot though, as it didn't do as well when I had it in a corner that only got direct sunlight for a couple of hours per day.  As soon as I put it in front of a east-facing window that gets sunlight until the afternoon it started growing like crazy.",
            "title_similarity": "0.72073275",
            "sentiment_compound": 0.8614
        },
        {
            "id": "gzamkt1",
            "score": 3,
            "text": "What about a bonsai tree? The little book they gave me said to pretty much keep it watered every other day in the summer. Is this too much for them?",
            "title_similarity": "0.53790426",
            "sentiment_compound": 0.5514
        },
        {
            "id": "gzammnq",
            "score": 1,
            "text": "I just drop an ice cube in it every once in a while",
            "title_similarity": "0.33627167",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzamsdj",
            "score": 1,
            "text": "My fiddle leaf fig has now lost all of its leaves. I’ve watered very infrequently and placed it in a nice sunny spot. Any tips?",
            "title_similarity": "0.62667274",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzamse1",
            "score": 1,
            "text": "This is the best thread ever. I will be coming back to this and reading all the tips. Much love to everyone ❤🧡💛",
            "title_similarity": "0.45712507",
            "sentiment_compound": 0.9719
        },
        {
            "id": "gzamsvc",
            "score": 1,
            "text": " Wow thanks so much for this!!",
            "title_similarity": "0.1308958",
            "sentiment_compound": 0.8065
        },
        {
            "id": "gzamz5x",
            "score": 1,
            "text": "Another thing to be careful of when you’re checking the pots for water (especially when overwatering) is mold in the soil. You can get skin fungus",
            "title_similarity": "0.5125413",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzan3m2",
            "score": 1,
            "text": "I’ve read just the first 2-3 inches of the soil should be damp. Was certainly over watering mine at the start. Rip first gen.",
            "title_similarity": "0.5657924",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzan7mz",
            "score": 1,
            "text": "This person loves plants, and I love that. Great post.",
            "title_similarity": "0.27558377",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gzanfhw",
            "score": 1,
            "text": "One plant I see always get over watered are snake plants. I think a lot of people just don't realize how low maintainance they are. \n\nI water my snake plant once a month in the spring/summer and MAYBE once every 2 months during the colder months if I remember. She is one of my happiest plants, making so many lil snake bbs. Don't water you're snake plant unless that soil is bone dry!",
            "title_similarity": "0.8088755",
            "sentiment_compound": 0.7435
        },
        {
            "id": "gzanhsy",
            "score": 1,
            "text": "Hey, do you mean specifically inside decorative plants? Because from what I know, my fruit-bearing plants (veggies, mostly cucumber, cherry tomatoes, peas and chilis) do require daily watering, unless the earth is clearly charged with water on the day. I'd hate to be wrong on this! :P",
            "title_similarity": "0.72891295",
            "sentiment_compound": -0.536
        },
        {
            "id": "gzanqlu",
            "score": 1,
            "text": "Excess of everything is bad 😫",
            "title_similarity": "0.34832588",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzanse5",
            "score": 1,
            "text": "My grandma always waited til the plant started to wilt. She told me that was a good indicator that it was time to water. You can see on YouTube some houseplants in full wilt come back to life via time lapse after being watered.",
            "title_similarity": "0.72073",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzantti",
            "score": 1,
            "text": "Why is it that the same plants when outside this time of year in UK where I live are getting rained on non stop but dont die.  But then if I water too much indoors they die?  Is it because they are in pots? or to do with drainage?",
            "title_similarity": "0.7525763",
            "sentiment_compound": -0.5058
        },
        {
            "id": "gzanvjo",
            "score": 1,
            "text": "Yes, \nI wish I would have told this to my husband before I left for surgery a few months ago... He drowned all my plants except for the aloe cause he thought it was a cactus lol.",
            "title_similarity": "0.70141834",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzanyh2",
            "score": 1,
            "text": "Just took care of my plants seeing this, thanks!",
            "title_similarity": "0.2976382",
            "sentiment_compound": 0.7825
        },
        {
            "id": "gzao230",
            "score": 1,
            "text": "Can someone give a bit more detail on the pot size, drainage, etc? Ours keeps leaking onto the floor and we can’t find trays that match the pot... any advice? Thanks stranger!",
            "title_similarity": "0.6086892",
            "sentiment_compound": 0.5502
        },
        {
            "id": "gzao3bi",
            "score": 1,
            "text": "I love this! I definitely kill my plants with love but this year has been completely different. During lockdown I adopted an orchid and the instructions said to give it 3 ice cubes once a week. I thought to myself...no way that's enough water but sure enough, this orchid is a beast and still going months later. (Note: I don't put ice cubes directly on the plant despite what the instructions said to do, instead I melt the ice in a glass and let it get to room temperature first or simply give it 3 ice cubes worth of water which for me is about a 1.5 oz or so)\n\nI'd love to hear more tips on how to get my boston ferns and catnip looking better. The catnip is more like a saggy vine than a plant and the ferns are droopy and brown. I water these no sooner than once a week but sometimes I let it go a few days until the pot is light or the plant droops. I don't think I'm over doing it with the water but then again who knows? If I can figure out how to post a picture I will. Thanks in advance for any replies.",
            "title_similarity": "0.77877927",
            "sentiment_compound": 0.9719
        },
        {
            "id": "gzao4k1",
            "score": 1,
            "text": "Something to keep in mind if you've let them dry out too much is that the water can and will run off the top layer of soil, around the sides of the pot, and out the bottom.  Especially in hanging baskets. You make think they've been watered only to find out barely any of it got into the soil.\n\nYou may need to make sure you saturate them or break up the very top layer of soil a little. Just take something and poke a few holes into the top. They don't have to be big or even super deep. You just want to make sure the water is actually soaking in.",
            "title_similarity": "0.6618478",
            "sentiment_compound": 0.9099
        },
        {
            "id": "gzao83n",
            "score": 1,
            "text": "\"Kill 'em with kindness\"",
            "title_similarity": "0.38188618",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzao94w",
            "score": 1,
            "text": "r/plantclinic is another good resource. Very helpful tips.",
            "title_similarity": "0.3517311",
            "sentiment_compound": 0.7178
        },
        {
            "id": "gzaodgg",
            "score": 1,
            "text": "So... I've been wanting to get a few plants, but I live with roommates and I only really have my room to put them in. Normally I wouldn't care, but my window is north facing, and I don't think my ceiling fan's lights would be enough for the plants..\n\nAny recommendations for grow lights?",
            "title_similarity": "0.57158923",
            "sentiment_compound": -0.5334
        },
        {
            "id": "gzaohlv",
            "score": 1,
            "text": "Re: what you said about succulents, that goes for orchids too! To water them you only need to place an ice cube on them and let it melt into the soil once a week",
            "title_similarity": "0.55635834",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzaoi0t",
            "score": 1,
            "text": "What about bottom watering? Doesn't that prevent over watering? Or can you still over water that way?",
            "title_similarity": "0.46106464",
            "sentiment_compound": -0.1566
        },
        {
            "id": "gzaoj4t",
            "score": 1,
            "text": "I've found one of the best ways to ensure I'm watering my succulents modestly is to only use ice cubes. Start small and adjust the size/number of ice cubes for the size of the plant. I've been giving my small cacti maybe a dice size cube every 1-2 weeks for years and they're growing great.",
            "title_similarity": "0.6188029",
            "sentiment_compound": 0.9325
        },
        {
            "id": "gzaokny",
            "score": 1,
            "text": "We can barely get our outdoor plants to stay alive, let alone our house plants! We've been celebrating a successful re-potting of a couple of supermarket mint plants for the last few weeks, after _many_ failed attempts despite mint apparently being one of the easiest plants to grow.\n\nMaybe with these tips we'll stand a better chance in future. Thank you for probably the most well-written and comprehensive LPTs I've seen on this sub!",
            "title_similarity": "0.73700225",
            "sentiment_compound": 0.9505
        },
        {
            "id": "gzaouew",
            "score": 1,
            "text": "I definitely disagree with the once a week thing. A lot of plants will need water less often then that especially succulents which are quite popular. Best tip is to ignore care tags and just google the care (google lens is great fir identification!)\n\nAlso when you water you want to thouroughly soak the plants so that water comes out the drainage holes and that might be every three days or maybe every three months since it really depends.",
            "title_similarity": "0.8252814",
            "sentiment_compound": 0.9536
        },
        {
            "id": "gzaowz0",
            "score": 1,
            "text": "I haven’t watered my plant in red in ten years lol",
            "title_similarity": "0.36558783",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzaoy6j",
            "score": 1,
            "text": "When in doubt, don't water? Wtf OP just tell them to stick their finger in the dirt like any actual Gardner knows to do 🤦",
            "title_similarity": "0.44180885",
            "sentiment_compound": 0.171
        },
        {
            "id": "gzaozmq",
            "score": 1,
            "text": "This was a really well written post that was informative and as a newbie to houseplants, thank you :)",
            "title_similarity": "0.3598102",
            "sentiment_compound": 0.7841
        },
        {
            "id": "gzap15w",
            "score": 1,
            "text": "That’s why I use Blumats to irrigate houseplants, garden, everything plant wise.",
            "title_similarity": "0.4043309",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzap4rn",
            "score": 1,
            "text": "Do you recommend a good fertilizer?",
            "title_similarity": "0.25436005",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzap6ry",
            "score": 1,
            "text": "Quarantine all new plants for 2 weeks or so to make sure the new babies don't have any bugs before putting them next to your established plants. I've had to battle gnats with a few and just ended up in an endless death circle trying to keep those ugly mofos out of my established dudes.",
            "title_similarity": "0.7806798",
            "sentiment_compound": -0.804
        },
        {
            "id": "gzap7fl",
            "score": 1,
            "text": "I have a peace lily. Do I have to pull out yellow/brown leaves or snip them with a scissor? Does it matter how far down I snip?",
            "title_similarity": "0.36774302",
            "sentiment_compound": 0.6072
        },
        {
            "id": "gzapb72",
            "score": 1,
            "text": "My favourite low-maintenance houseplant type is the Schefflera family, or “Umbrella Plant”. I water mine maybe twice in a month, and they’re both perfectly happy. They like sunlight, but they also flourish in shady parts of the house. When it comes to pruning, they self-amputate dead leaves and you only need to pick them up. They’re pet friendly (my cats don’t even try to eat them), and as an added bonus, they’re great at absorbing odors and pollutants, acting as natural air cleaners. Oh, and if you ever want another one, just take a healthy cutting from an existing one and plant it by itself. They grow like weeds.\n\n[Plant 1.](https://i.imgur.com/einw9y1.jpg)\n\n[Plant 2.](https://i.imgur.com/iCIcJrp.jpg)\n\n[Plant 3](https://i.imgur.com/cnWsoBR.jpg) (at my mom’s house; the original that mine both came from). DVD for scale.",
            "title_similarity": "0.72952783",
            "sentiment_compound": 0.9802
        },
        {
            "id": "gzapc1p",
            "score": 1,
            "text": "Do you have experience with using watering globes?",
            "title_similarity": "0.16140747",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzapckx",
            "score": 1,
            "text": "Looking at you—fiddle leaf fig & string of pearls....\n\n...may you Rest In Peace since I loved you (watered you) too much.",
            "title_similarity": "0.49906048",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzapcn5",
            "score": 1,
            "text": "I love cactuses, I water them when I remember they exist. I have a giant aloe plant that's 5 years old now.\n\nI bought some strawberry plants yesterday... Hopefully I remember they exist more often.",
            "title_similarity": "0.5941889",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzapcoz",
            "score": 1,
            "text": "You cannot overwater the pothos plant, the most common houseplant.\n\nSource: I have one sticking out of my fish tank.",
            "title_similarity": "0.5696956",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzapmqq",
            "score": 1,
            "text": "Snake plants are the plant you get when you have a habit of forgetting you own a plant.",
            "title_similarity": "0.56818414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzapoes",
            "score": 1,
            "text": "That’s the best and most useful for me LPT I’ve read",
            "title_similarity": "0.2982722",
            "sentiment_compound": 0.8122
        },
        {
            "id": "gzapp3i",
            "score": 1,
            "text": "The only plant Ive not been able to take care (and also seen others with the same problem) are those corn plants. Seems like they are easily overwatered to the point where once a month might be too much.",
            "title_similarity": "0.68451226",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzapuw9",
            "score": 1,
            "text": "I’ve recently come into possession of a small orange tree (her name is Aurelia). I gave a YELP when I saw this title. Thank you so much",
            "title_similarity": "0.4521095",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzapz4z",
            "score": 1,
            "text": "I worked as a prestigious gardener for someone in high power in the gardening community and she would constantly tell me to over water and move plants around because they weren't happy. Most of those plants never were successful they just continued struggling never being able to properly adapt to their constantly changing conditions. I was lower in power so my word wasn't taken seriously.",
            "title_similarity": "0.75709486",
            "sentiment_compound": -0.8608
        },
        {
            "id": "gzapzz7",
            "score": 1,
            "text": "Pests seem to be my nemesis. In particular Spider mites and fungus gnats.",
            "title_similarity": "0.5272086",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzaq3qe",
            "score": 1,
            "text": "Just planted a red maple in my yard and my dad has been coming and watering it daily. I appreciate the gesture but I finally had to tell him to stop lol",
            "title_similarity": "0.63511395",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gzaq4ha",
            "score": 1,
            "text": "It's all about the aggregate. The right soil composition can prevent root rot. A wick can help lower the PWT.",
            "title_similarity": "0.47780347",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzaqgaj",
            "score": 1,
            "text": "I love this! Thank you for sharing some things that even experienced plant parents often forget. One of my most important plant tips is to quarantine the newbies away from the rest of your plants until you know they are pest and disease free! Proactively treating for pests has been of the biggest ways to save my plants (about 85 currently)",
            "title_similarity": "0.8007163",
            "sentiment_compound": 0.9528
        },
        {
            "id": "gzaqrbv",
            "score": 1,
            "text": "Any advice for a plant that has like this white “fur” growing on the leaves? In general, it’s not growing very well. Not sure if I’m over watering too...",
            "title_similarity": "0.48862112",
            "sentiment_compound": -0.1467
        },
        {
            "id": "gzar4g9",
            "score": 1,
            "text": "Guilty of this...my roommate is still mad.",
            "title_similarity": "0.4435361",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzar5wg",
            "score": 1,
            "text": "Please don't show my mother this post. She underwaters everything imo. Tbf its mostly outside plants lmao.",
            "title_similarity": "0.57498443",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzarccl",
            "score": 1,
            "text": "My neighbor has over watered and killed fresh sod.  Finally replanted his entire yard with another neighbor after the freeze in Texas required significant landscaping and he almost did it a second time...\n\nApparently he was of the understanding that if you could still see where the squares of grass were, it needed more water.",
            "title_similarity": "0.7202531",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzarkqr",
            "score": 1,
            "text": "Over the last year, my wife and I developed quite the plant collection, and have now started a small plant business, and I just want to say your post is spot on, even for more difficult plants. It’s always best to start simple and work your way up. The biggest issue we see is overwatering. So many people drown their plants without even realizing it. After that, humidity and light issues are the next most common causes of problems that people have. Tropical plants need humidity. If you’re not in a fairly humid area, get yourself a humidifier and a humidistat and you’ll be good to go. \n\nI personally have developed a love for carnivorous plants over the last year, so I have a recommendation to add to the list of starter plants. Sundews. You can get a Drosera Capensis (cape sundew) very cheaply, and they are the easiest plant ever. They just need a soil with no nutrients, like plain peat moss, maybe with a little perlite (DO NOT USE MIRACLE GRO PERLITE), and you sit that pot into a tray of distilled or at minimum very filtered water. That’s it. As long as they have a good amount of water in the tray,  and get sun, they’ll be happy. Keep one in your kitchen by a sunny window and they’ll take care of fruit flies for you, along with any other bugs. Keep them outside and they’ll flourish. And if you like them, you’ll soon end up with tons of them if you harvest their seeds. \n\nAnother plant I’d recommend that’s a little harder but still very easy are phalenopsis orchids. People seem to think they’re really hard to care for, but that’s completely not true. If you have them in a decent mix, and a clear pot, preferably with slits as their roots like some air, they will visually tell you when they need water. Their roots will be green when they’re happy and start to turn silvery when they’re thirsty. All you need to do is water them when that happens,  mist them daily, and give them some orchid food now and again. That’s it. They don’t bloom forever though, so don’t get discouraged when they start to lose their flowers and kill the spike they’re on. That’s totally normal. As long as the leaves are happy, the plant is happy. I definitely wouldn’t recommend them as a first plant, but they’re still much, MUCH easier to care for than most people think.",
            "title_similarity": "0.8685502",
            "sentiment_compound": 0.987
        },
        {
            "id": "gzarn1u",
            "score": 1,
            "text": "Smart pots are the best pots IMO. They prevent root bind and have the best drainage.",
            "title_similarity": "0.49948257",
            "sentiment_compound": 0.9042
        },
        {
            "id": "gzart8q",
            "score": 1,
            "text": "Only water succulents and cacti when they look thirsty, ie: leaves are wrinkled.",
            "title_similarity": "0.48293245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzartrc",
            "score": 1,
            "text": "Yup - been there done that.  I learned the hard way!",
            "title_similarity": "0.34408307",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gzas4pj",
            "score": 1,
            "text": "Wish I knew about this when I played life is strange",
            "title_similarity": "0.37970558",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzasor7",
            "score": 1,
            "text": "What do you do then when you get several days in a row with lots of rain coming down? Wouldn’t that overwater the plants? If so how do you combat that?",
            "title_similarity": "0.569353",
            "sentiment_compound": -0.4479
        },
        {
            "id": "gzasrs7",
            "score": 1,
            "text": "What about misting? Is it similar to watering? So hold it be done at the same time or separately. What types of plants like to be misted?",
            "title_similarity": "0.37154186",
            "sentiment_compound": 0.466
        },
        {
            "id": "gzassxp",
            "score": 1,
            "text": "I just bought a pink princess philodendron leaf off eBay. It has a single healthy root. I’ve always wanted one and I’m so excited! Probably going to kill it. Could you give me some suggestions?",
            "title_similarity": "0.6221601",
            "sentiment_compound": 0.1048
        },
        {
            "id": "gzat0ko",
            "score": 1,
            "text": "always keep in mind where a plant originates from\n\na tropical plant will be used to shade high temperature and lots of water, humid air, a desert plant will use very little water a plant growing in temperate forests will likely not cope with a lot of sun, and Mediterranean, tropical plants can't endure cold\n\nand so on",
            "title_similarity": "0.57713234",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzat65t",
            "score": 1,
            "text": "I found the book The New Plant Parent a few months ago while I was looking at a houseplants thread. It really does a good job of helping you understand the light and moisture needs of your plants. It was especially helpful as a beginner. I have 4 succulents and a leafy green type that I don’t know the name of off hand. They’re all still alive though! My cactus is even regrowing the spines that were removed so they can glue that horrible fake flower on it at the store. My aloe plant has another growth going on that’s been explosive. I could probably make a second plant at this point. I’m so proud of them!",
            "title_similarity": "0.7178223",
            "sentiment_compound": 0.9304
        },
        {
            "id": "gzat6ur",
            "score": 1,
            "text": "When I started growing Cannabis, I picked coco coir as a medium because I knew as a new grower i'd over water the shit out of plants.  I still struggle with house plants water schedule.. Good tips here.",
            "title_similarity": "0.6110432",
            "sentiment_compound": 0.743
        },
        {
            "id": "gzat8f0",
            "score": 1,
            "text": "Root tot has taken my peace lily nearly a year and a half to fix plus a long dry spell thst didn't help. I didn't realise the roots weren't pulling the water out of the pot as well as I thought. I was o ly watering once a week but it was still enough",
            "title_similarity": "0.69670177",
            "sentiment_compound": 0.5379
        },
        {
            "id": "gzat92a",
            "score": 1,
            "text": "This is important",
            "title_similarity": "-0.012304008",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzat9bq",
            "score": 1,
            "text": "Have an abundance of house plants. Some from fruits my kids wanted to plant, some store bought, and some bought for us. All do well and have no issues with. But when I've bought succulents for my kids or wife, the plant dies within the week. Lol for somereason we just can't keep succulents alive.",
            "title_similarity": "0.79158425",
            "sentiment_compound": 0.2201
        },
        {
            "id": "gzatd2i",
            "score": 1,
            "text": "Don't water on a schedule, only when needed.",
            "title_similarity": "0.3112973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzatequ",
            "score": 1,
            "text": ">chop of leaves that go yellow - they won't go green again, and the plant is wasting resources on it.\n\nI've always been told to leave yellowing leaves alone, since the plant itself is moving nutrients from the dying leaf to the rest of the plant. When it's dried out, take it off, or let it fall off on its own.\n\n&#x200B;\n\n>if cactuses or succulents, you still have to water them, albeit rarely. Many people recommend cactuses as the most beginner houseplants, but you can absolutely kill both cactuses and succulents\n\nI've killed every cactus I've ever owned effectively by drowning them. They just rot . I  find them the hardest plant to take care of, basically because you're more or less supposed to not take care of them, lol.",
            "title_similarity": "0.828482",
            "sentiment_compound": -0.8701
        },
        {
            "id": "gzatkrw",
            "score": 1,
            "text": "Smh imaging growing weed in a non heated garage in the winter concrete floor smdh roots cold af slow growth they take in minimal water smh",
            "title_similarity": "0.41040322",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzatmug",
            "score": 1,
            "text": "Take note that op is specifically talking about houseplants. It's a different story with outdoor plants just in the ground. Depending on how dry of an area you live in you may have to water the hell out of things, especially if newly planted.",
            "title_similarity": "0.5988089",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzatn3t",
            "score": 1,
            "text": "My peace lilly has yellow and brown tips, help",
            "title_similarity": "0.25357258",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzatx2n",
            "score": 1,
            "text": "I killed my cactus when I was 12 from overwatering \n\nThat bitch stabbed me so it needed to look like an accident",
            "title_similarity": "0.70141333",
            "sentiment_compound": -0.9153
        },
        {
            "id": "gzau3ah",
            "score": 1,
            "text": "I thought it said Overwatch kills more plants. I was very confused, and intrigued.",
            "title_similarity": "0.6697304",
            "sentiment_compound": -0.7264
        },
        {
            "id": "gzaukh2",
            "score": 1,
            "text": "I work as a gardener apprentice and I still get that wrong sometimes. But yes it is very true. Over watering kills more plants than letting them dry out for some time. Plants enjoy being dry more than being wet. Very good Tip for all the plant lovers out there! :)",
            "title_similarity": "0.8484816",
            "sentiment_compound": 0.9656
        },
        {
            "id": "gzaulv2",
            "score": 1,
            "text": "Do you have any recommendations on plant food?",
            "title_similarity": "0.18714318",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzauzyh",
            "score": 1,
            "text": "Planta is an awesome app for struggling plant keepers like myself. You input what plants you have and the app will tell you if it’s too bright or not enough as well as send you alerts for when to water everything.",
            "title_similarity": "0.6804798",
            "sentiment_compound": 0.7083
        },
        {
            "id": "gzav52m",
            "score": 1,
            "text": "Thank you for this. My daughter is learning about growing plants and we’ve been growing a sunflower together. I just learned I might be watering too much. She’ll be happy to learn something to new.",
            "title_similarity": "0.55001235",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gzav8ms",
            "score": 1,
            "text": "You seem pretty knowledgeable. I have a rather large green Congo philodendron that was left with me and I'm not quite sure what to do with it. The stalks on most of the leaves have drooped to the point of almost snapping off. It's still pretty green and alive, with little browning on the edges otherwise. Would it be best to put in a stake and tie up the stalks? Or will they perk back up after being properly cared for?",
            "title_similarity": "0.49442098",
            "sentiment_compound": 0.9347
        },
        {
            "id": "gzav9tk",
            "score": 1,
            "text": "This is extremely helpful. Thank you!!! This time around, I'm getting it right.",
            "title_similarity": "0.20820363",
            "sentiment_compound": 0.7749
        },
        {
            "id": "gzavc6q",
            "score": 1,
            "text": "Plants do not put energy into leaves that go yellow. On the contrary actually, they are recycling the chlorophyll in that leaf for nutrients, hence they go yellow.",
            "title_similarity": "0.52274716",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gzavc6w",
            "score": 1,
            "text": "My husband recently discovered this crazy simple yet effective tool.\n\nBest $10 you’ll ever spend if you love house plants. \n\n[Soil Moisture Gauge plus lots of other things!](https://www.amazon.com/dp/B01E3G5ONE/ref=cm_sw_r_cp_api_glt_fabc_S7DXEYS18A402YNJ8D0W?_encoding=UTF8&psc=1)",
            "title_similarity": "0.64562774",
            "sentiment_compound": 0.8762
        },
        {
            "id": "gzavd42",
            "score": 1,
            "text": "Water from the bottom wherever possible, this helps roots grow deeper and stronger",
            "title_similarity": "0.38086516",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzavel2",
            "score": 1,
            "text": "On the topic of sun, read up on the particular plant. Direct sunlight will burn a lot of plants.",
            "title_similarity": "0.45481253",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzavv9e",
            "score": 1,
            "text": "Don't worry I'm good at not watering my plants.",
            "title_similarity": "0.43245745",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzavzll",
            "score": 1,
            "text": "There are some insane people in these comments",
            "title_similarity": "0.20127943",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzaw8gl",
            "score": 1,
            "text": "Very great list, I just wanna add some things..\n\nIn most countries they had a small amount of chlorination into the drinking water to kill germs. So when you fill your watering can let it sit there for a couple of hours so that stuff can vaporize. It also allows the water to get room temperature\n\nPlant food, always try to get an organic fertilizer instead of a ~~mineral~~synthetic based one. Organic fertilizer is basically indirect feeding as it's food for the microorganisms in the soil and they make it available for the plant. So over feeding the plant isn't that big of a problem.\n\nLast but not the least, Pests. At a certain point you will have to deal with them and they can ruin a lot of plants. After I had a fungus bat infestation in my first year owning plants, I water all my plants with a neemoil solution every 3 weeks. It only kills pests but harm beneficial insects as ladybugs.",
            "title_similarity": "0.764722",
            "sentiment_compound": -0.8502
        },
        {
            "id": "gzawg0x",
            "score": 1,
            "text": "Brett: “When we get back to walking?",
            "title_similarity": "0.05264064",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzawgl9",
            "score": 1,
            "text": "My problem is overwatering once it’s been so underwatered it doesn’t know what to do with itself",
            "title_similarity": "0.58962095",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzawm1z",
            "score": 1,
            "text": "Strongly disagree on the pothos and peace Lilly being unkillable.   Those things die the second I look at them wrong.  \n\nAloes, cactus and succulent though - those are great!  Snake grass is pretty easy too.  And ice plants are my favorite, easy outdoor flower.  \n\nBefore buying a pothos or peace Lilly you might strongly consider just lighting your money on fire.",
            "title_similarity": "0.75841606",
            "sentiment_compound": 0.9392
        },
        {
            "id": "gzawvmt",
            "score": 1,
            "text": "Made the mistake of overwatering my snake plant, the one half ended up dying. The last time I watered it was a month ago and it seems to be doin fine",
            "title_similarity": "0.6962315",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzaxfax",
            "score": 1,
            "text": "There are kids in Africa....",
            "title_similarity": "-0.032976534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzaxi61",
            "score": 1,
            "text": "What's the best way to give a plant food if it is too big to pour water in the pot cleanly?\n\nI have a zebra cactus that has really gotten chonky the last year (I transplanted it last year) and I can't pour water in the top without it flowing over, so I've been only putting a bit of water in the tray to water it. It's blooming, so it isn't under or over watered, but I'm wondering how I'm going to put the cactus food mix in without making a mess",
            "title_similarity": "0.75038177",
            "sentiment_compound": 0.6873
        },
        {
            "id": "gzaxjh7",
            "score": 1,
            "text": "When in doubt, do not get a houseplant.",
            "title_similarity": "0.20356774",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzaxkid",
            "score": 1,
            "text": "Same thing applies to children in a metaphorical manner anyway...",
            "title_similarity": "0.16596477",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzaxqcs",
            "score": 1,
            "text": "I've grown a lot of plants. Cannabis in particular. I will share my experience...\n\nThis is all assuming the condition of the soil does not make the problem obvious. Say, you are looking at a plant on the Internet and someone is asking what the problem with their plant might to be. \n\nWhile overwatering and underwatering do look strikingly similar, there is one huge indicator if you know what to look for. If you look at the base of the leaf at the top of the petiole on an underwatered plant it will drop straight down. If you look at an overwatered plant the base will kind of arc up, then the leaf droops.\n\nYou can google underwatered vs overwatered cannabis plants if you want to see some good examples of what I'm talking about.\n\nAnd, to be clear, cannabis is just a plant, there is nothing special about it from a botanical perspective. I just happen to be more familiar with that plant than any other and I have many years of experience growing it on a relatively large scale.",
            "title_similarity": "0.5934374",
            "sentiment_compound": 0.836
        },
        {
            "id": "gzaxzo5",
            "score": 1,
            "text": "Well its the same with humans and nutrition.",
            "title_similarity": "0.09348187",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzaxzty",
            "score": 1,
            "text": "Hot Asian countries already do this. Such helpful tips I’m just watching I’m I’m not thinking about them anymore.",
            "title_similarity": "0.5643995",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzaz2ux",
            "score": 1,
            "text": "How do you know when to repot? Particularly an ivy plant?",
            "title_similarity": "0.18582082",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzazglm",
            "score": 1,
            "text": "ZZ Plants should be in any \"easy plants\" list IMO\n\nYou can only kill them with too much water or light",
            "title_similarity": "0.64648926",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzaztex",
            "score": 1,
            "text": "I would like you to narrate me bed time stories pls",
            "title_similarity": "0.2696882",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzazuac",
            "score": 1,
            "text": "I HAVE BEEN DOING THIS AND JUST REALIZED WHY MY PLANTS WERE DYING! I always erred on the side of watering, but I'm going to put the phrase, \"when in doubt, don't water\" into my brain and into practice. \n\nThanks for the validation and for the tip!",
            "title_similarity": "0.77661836",
            "sentiment_compound": 0.2924
        },
        {
            "id": "gzazwv6",
            "score": 1,
            "text": "I'm actually struggling with a tiny avocado sprout (I like to grow them after I eat an avocado and see how long they last). It's grown about 10inches and the leaves look great!... looked great. It's been indoors this whole time but looks like something is eating the leaves! I can see any signs of any bug and I even tried rinsing the leaves with water... the leaves continue to lose more as if an invisible caterpillar is eating it!",
            "title_similarity": "0.7621056",
            "sentiment_compound": 0.6732
        },
        {
            "id": "gzazxas",
            "score": 1,
            "text": "The \"bachelor plant\" is the lushest, greenest one I've seen yet it can be watered once a mo. and left in shade. They're great!",
            "title_similarity": "0.4494351",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gzazzry",
            "score": 1,
            "text": "I read over watering as overwatch and assumed.\n\nGamers were neglecting their plants and watching them die",
            "title_similarity": "0.60368156",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzb01wp",
            "score": 1,
            "text": "Okay, COUNTERPOINT, may not be true if you live in a very dry climate.",
            "title_similarity": "0.31509095",
            "sentiment_compound": -0.1109
        },
        {
            "id": "gzb03ad",
            "score": 1,
            "text": "Palms can get brown tips but you can trim them off and it's fine.",
            "title_similarity": "0.3807751",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzb08e1",
            "score": 1,
            "text": "I had to spend a lot of time away from home last year and invested in a lot of self-watering pots of different types. I make some simple systems for my peppers/cucumbers/tomatoes+++ so I’ll be able to reduce watering to every two weeks or so.",
            "title_similarity": "0.69202304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzb0c5m",
            "score": 1,
            "text": "LISTEN! The people at the hardware store said water until you see water come out the bottom...\n\nI put two tomato plants in a half barrel. It took 3 gallons of water to make the water come out the bottom.\n\nI did that daily. I was following directions. I did NOT get tomatoes to eat. I am an idiot.",
            "title_similarity": "0.7055565",
            "sentiment_compound": -0.5562
        },
        {
            "id": "gzb0cts",
            "score": 1,
            "text": "I’m allergic to water”",
            "title_similarity": "0.34760776",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzb0ire",
            "score": 1,
            "text": "Here is my advice: \n\n1. Natural light > artificial light if the place you want the plant gets NO natural light at all you need to get some form of plant bulb.  Not all plants use the same part of the light spectrum, a little research might find you the best wavelength (or color) to give and you can avoid blasting it with a really bright multi-purpose plant light. \n  \n2. Avoid placing your plants near a north facing window as it's only source of light.\n\n3. The more direct sunlight the plant gets, the quicker the soil will dry out.\n\n4. If you need to be careful over watering the type of plant. Use a small cup or shot glass to give it a small amount of water at a time. The idea is to just get the soil moist for the roots but a few times a year give it a good \"soaking\". If the planter has a hole at the bottom to drain into a saucer, come back after an hour after watering and empty the saucer of excess standing water.\n\n5. When you repot a plant, when you pull the plant out of the old pot, any soil that doesn't come out with the root ball can be discarded. The useful mineral content and organic matter will have been played out depleted It also will likely have a build up of non-useful minerals and salts from your tap water which might be harmful to the plant.\n\n6. Turning a plant as it moves from the light source makes it's leaves less efficient till it can bend them back towards it.  Slow growing plants might end up starved if you are constantly keeping the leaves from being pointed from it's light source.",
            "title_similarity": "0.63347095",
            "sentiment_compound": 0.8332
        },
        {
            "id": "gzb0r0i",
            "score": 1,
            "text": "Succulents and cacti also want super well draining soil. 50/50 perlite and dirt is ideal for most of them. Dont trust the pre-made succulent soils you need to add more perlite to them.",
            "title_similarity": "0.6388187",
            "sentiment_compound": 0.6806
        },
        {
            "id": "gzb0ra7",
            "score": 1,
            "text": "Omg this dust tip is genius. It hadn't occurred to me that the dust collecting would make it harder for them to photosynthesize. Thank you!",
            "title_similarity": "0.52221984",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gzb1h40",
            "score": 1,
            "text": "I have one plant, of which I don't know the name, but that one sure does loves the water. I need to give it plenty. I can tell it's too dry when there are no leaves growing form the center.\n\nRegarding the sunny spot: I have another plant that was placed on the sill of a north facing window. It barely grew, and I noticed the leaves would start to shrivel and turn brown as soon as they sprouted. So I placed it with my ferns, which are away from any windows and almost never get sun, and now I have nice green leaves. If you see a plant that has brown leaves, it might get too much light.",
            "title_similarity": "0.68415046",
            "sentiment_compound": 0.9157
        },
        {
            "id": "gzb1pv0",
            "score": 1,
            "text": "I have one plant I forget about for a usually a month and then I drown it in water and it’s over a year old now so it works",
            "title_similarity": "0.64624834",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzb1rgv",
            "score": 1,
            "text": "I got eager and overwatered my yard this year. Went lime green. This is a great pro tip!",
            "title_similarity": "0.5364113",
            "sentiment_compound": 0.784
        },
        {
            "id": "gzb1wxc",
            "score": 1,
            "text": "That's my secret, I'm always in doubt",
            "title_similarity": "0.32797134",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzb217i",
            "score": 1,
            "text": "I like plants but just absolutely cannot be bothered. So I get a pot with good drainage & auto watering system.",
            "title_similarity": "0.54680306",
            "sentiment_compound": 0.8146
        },
        {
            "id": "gzb2jui",
            "score": 1,
            "text": "Big brain solution for my chronic overwatering: keep all aquatic plants!\n\nThey’re more picky on their lighting due to algae but fertilizer and watering is a non issue for most hardier species. r/plantedtank if you wanna check out the world of live aquarium plants!",
            "title_similarity": "0.82586324",
            "sentiment_compound": -0.3124
        },
        {
            "id": "gzb2kdt",
            "score": 1,
            "text": "Thank you this is great! I just bought a succulent and now have to figure out when I should water so good timing.",
            "title_similarity": "0.5975031",
            "sentiment_compound": 0.8918
        },
        {
            "id": "gzb2q1b",
            "score": 1,
            "text": "Same with asking someone to feed fish when you’re out of town. Over feeding is much more likely",
            "title_similarity": "0.6241529",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzb2rww",
            "score": 1,
            "text": "Definitely took this advice a bit too far with my jade props earlier this year. By the end they were withering in literal rocks and dust. Turns out some water is still needed!",
            "title_similarity": "0.69471633",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gzb34pd",
            "score": 1,
            "text": "Great post!! Especially with the houseplant trend exploding lately",
            "title_similarity": "0.42741013",
            "sentiment_compound": 0.6892
        },
        {
            "id": "gzb3jwz",
            "score": 1,
            "text": "I have a forty year old ficus. It was purchased shortly after we got married. The original pot was the size of a coffee mug. It is now over six feet tall and at least four feet wide.we have it in a pot around 20 inches wide and 14 inches high. I repot it about every five years. I test the soil every day and water once or twice a week. Once spring time comes the tree come alive with new growth. I love watching it grow.",
            "title_similarity": "0.53936964",
            "sentiment_compound": 0.8934
        },
        {
            "id": "gzb3qth",
            "score": 1,
            "text": "Does this work for citrus trees?  I had an orange/pomelo tree that kind of ... well it died, while the other trees were thriving.  That tree grew some gigantic sour oranges and then a few weeks later *poof*",
            "title_similarity": "0.59065676",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzb3tpe",
            "score": 1,
            "text": "I'm really liking this trend of actual LPTs being posted on this sub",
            "title_similarity": "0.3454904",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gzb3vqu",
            "score": 1,
            "text": "What are the symptoms of overwatering though?\n\nI have outdoor potted plants that I have been watering every day since we haven't had any rain in 2 weeks and it's getting hotter.  Does this advice only apply to indoor plants?\n\nSeems like my outdoor potted plants can never get enough water. When the impatiens or black eyed susans start to wilt in the sun, a little water will perk them up in 10 minutes.",
            "title_similarity": "0.7234973",
            "sentiment_compound": 0.3939
        },
        {
            "id": "gzb3zdk",
            "score": 1,
            "text": "Thanks great tips :), just got reminded of a story of a women that had a succulent and watered and cleaned and cared for it regularly for months, was so proud how great it looked, then one day decided to replant it in a bigger planter only to discover it was made of plastic :)",
            "title_similarity": "0.6834285",
            "sentiment_compound": 0.9689
        },
        {
            "id": "gzb41kn",
            "score": 1,
            "text": "I have a venus fly trap that was doing so well, started to flower twice (I cut them off coz apparently it takes so much energy to grow the flowers) but now it's just so sad and droopy and I haven't changed anything! Any tips?",
            "title_similarity": "0.7703695",
            "sentiment_compound": -0.8408
        },
        {
            "id": "gzb41wl",
            "score": 1,
            "text": "I grew up in the water, nice",
            "title_similarity": "0.15596081",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzb444n",
            "score": 1,
            "text": "A fun tip I have is if you have super cute pots with no drain holes, you could put your plant in a nursery pot that is slightly smaller so that you can put that inside your cute pot and it would be a water catcher",
            "title_similarity": "0.6108142",
            "sentiment_compound": 0.9001
        },
        {
            "id": "gzb4el4",
            "score": 1,
            "text": "Here's a list of toxic and non-toxic plants for dogs, cats, and horses.\n\nhttps://www.aspca.org/pet-care/animal-poison-control/toxic-and-non-toxic-plants",
            "title_similarity": "0.43142444",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzb4lse",
            "score": 1,
            "text": "Sucks it's been raining a week straight where I'm at. Everything is water logged right now.",
            "title_similarity": "0.46230233",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzb4lxk",
            "score": 1,
            "text": "I killed my Madagascar Jewel and can't find another one anywhere TT_TT \nBut, I bought an asparagus fern, a yellow snake plant, a fittonia and a ZZ plant yesterday!",
            "title_similarity": "0.66327536",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gzb4o1o",
            "score": 1,
            "text": "Every time I water my plants I am struck by this totally irrational fear that someone has snuck into my house and watered my plants in the night.",
            "title_similarity": "0.6470929",
            "sentiment_compound": -0.8004
        },
        {
            "id": "gzb4x9n",
            "score": 1,
            "text": "I bought a bonsai tree once and it died a few months later, any tips for this specific plant?",
            "title_similarity": "0.50535023",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzb5a9z",
            "score": 1,
            "text": "Commenting to save for later!",
            "title_similarity": "0.17567769",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gzb5h7b",
            "score": 1,
            "text": "When I was a kid, I used to basically drown plants with water. It usually works for the first two weeks and they grow exponentially, but then they die instantly after that insane growth.",
            "title_similarity": "0.76177645",
            "sentiment_compound": -0.8338
        },
        {
            "id": "gzb5k2b",
            "score": 1,
            "text": "There are dozens of species of plants that will fry on a sunny windowsill. Make sure to do homework on each species you have to see what its particular light requirements are. Many tropical plants are found under thick rainforest canopies in nature and get only dappled sun exposure throughout the day.",
            "title_similarity": "0.5785574",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzb5obp",
            "score": 1,
            "text": "What kind of plant food do you recommend?",
            "title_similarity": "0.14056659",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzb5qbe",
            "score": 1,
            "text": "This is why all of my plants are in aquariums or planted on their filtration systems. I can’t ever get it right so fuck it all the water they could ever want plus fertilizer from the fish.",
            "title_similarity": "0.65571254",
            "sentiment_compound": -0.6359
        },
        {
            "id": "gzb62js",
            "score": 1,
            "text": "Most pots don't have drainage holes, how are people dealing with it? I've had some success with only watering a bit but I think it only worked since I have easy plants",
            "title_similarity": "0.5973896",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzb6is1",
            "score": 1,
            "text": "*if you reside in phoenix, do the opposite*",
            "title_similarity": "0.18984419",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzb6nid",
            "score": 1,
            "text": "Something I learned on tik tok, but don't listen to me because I kill plants....overwatering means watering too often, not too much.  So go ahead and soak the damn thing, just don't do it nearly as often as you think you should.",
            "title_similarity": "0.837315",
            "sentiment_compound": -0.9022
        },
        {
            "id": "gzb7dui",
            "score": 1,
            "text": "I just watered my work plant, that was forced upon me by HR when they lost their fancy building since the new tenants probably didn't want to pay for a watering service and HR just plopped these things randomly throughout the offices.\n\nWe have 3 to take of and know jack shit about watering plants, they're alive and appear healthy despite our poor watering schedule. We couldn't just watch and let them die so we take of them the 2 of us.",
            "title_similarity": "0.8146111",
            "sentiment_compound": -0.707
        },
        {
            "id": "gzb7liv",
            "score": 1,
            "text": "I have a batch of red clay pumpkins trying to grow right now and I'm stuck between \"I'm watering my pumpkins too much\" and \"this clay holds nothing and these guys are going to thirst to death.\" I'm very new and very bad at gardening still, if you couldn't tell by the fact that I'm growing clay pumpkins.",
            "title_similarity": "0.74476784",
            "sentiment_compound": -0.8399
        },
        {
            "id": "gzb7qn1",
            "score": 1,
            "text": "Interesting. How is it that plants and vegetables growing via hydroponics don’t die from being overwatered?",
            "title_similarity": "0.5396714",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzb7u33",
            "score": 1,
            "text": "MJ plants have basically the same rules right? Asking for a friend 👀",
            "title_similarity": "0.34133726",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzb8d30",
            "score": 1,
            "text": "Best way to keep succulents happy if you need to repot them to give them more space?? I repotted mine and half of them are suddenly dying! 😭",
            "title_similarity": "0.77021205",
            "sentiment_compound": 0.7545
        },
        {
            "id": "gzb8drw",
            "score": 1,
            "text": "Thank you for this, I was planning to plant some flowers and herbs on my balcony soon but I have basically no idea what I'm doing in terms of gardening. This will help me so much.",
            "title_similarity": "0.56563526",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzb8hy7",
            "score": 1,
            "text": "Haworthias are the best beginner plant change my mind ^(you can’t)",
            "title_similarity": "0.5564358",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzb8n0s",
            "score": 1,
            "text": "Also, make site you use POTTING soil for potted plants.  Regular garden soil is too dense.  I’ve made that mistake.",
            "title_similarity": "0.5698612",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzb8onr",
            "score": 1,
            "text": "How often should I water an avocado? I've grown it from a seed and I'm afraid I'll kill it one day :(",
            "title_similarity": "0.69454265",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gzb8r7u",
            "score": 1,
            "text": "I'm a complete beginner and so the guide in the post is great for me but I have another question.\nWhy do all of my houseplants end up completely covered in miniscule black flies? Is it a result of over watering? Is there anything I can do to prevent this from happening?",
            "title_similarity": "0.75229716",
            "sentiment_compound": 0.5007
        },
        {
            "id": "gzb92y0",
            "score": 1,
            "text": "Also for our friends in the United States, feel free to contact us at your local Extension Office for horticulture advice if you feel like you're lost! We're glad to help! The easiest way to find us is to Google: \"(Your County/City) Cooperative Extension\"",
            "title_similarity": "0.5294186",
            "sentiment_compound": 0.9551
        },
        {
            "id": "gzb9bb1",
            "score": 1,
            "text": "I bought a plant for my mother birtday and you are making me nervous.",
            "title_similarity": "0.6597051",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzb9l01",
            "score": 1,
            "text": "DISCLAIMER: If you live in California, Arizona, or any other hot and dry place, this advice does not apply to you. It is almost impossible to overwater potted plants in our climate and much of the advice online is geared towards humid climates where overwatering is more of an issue. When I first moved from the East coast to the West, I thought my plants were dying from overwatering, but it turns out many of them were severely underwatered. On the East coast, I only ever had problems with overwatering.\n\nKnow your climate, because no advice applies to every garden.",
            "title_similarity": "0.74241465",
            "sentiment_compound": -0.8847
        },
        {
            "id": "gzb9ssv",
            "score": 1,
            "text": "I took a gardening class as an elective in college and the teacher told us to water heavily infrequently.",
            "title_similarity": "0.6294048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzb9z4p",
            "score": 1,
            "text": "My wife says I love too much and it translates to our plants..",
            "title_similarity": "0.5266349",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzb9zw2",
            "score": 1,
            "text": "This brown thumb thanks you! Guilty of overwatering here...",
            "title_similarity": "0.48646915",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gzba4kp",
            "score": 1,
            "text": "Any tips on how to do proper drainage?",
            "title_similarity": "0.18214487",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbahj7",
            "score": 1,
            "text": "If I wanted a houseplant that needs a lot of watering, what should I get? I have a toddler that lives to use a watering can...",
            "title_similarity": "0.53367245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbapnt",
            "score": 1,
            "text": "Your fingertips are very sensitive to humidity. To avoid arbitrary watering cycles that may not reflect the changes in the seasons, touch the top of the soil to see if you feel cool or damp. It takes a second, and its a way to relate with the plants. No guessing, if it feels dry, and is not a succulent, water. For succulents when it feels dry, count a few days after then water.",
            "title_similarity": "0.6247921",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzbass1",
            "score": 1,
            "text": "One thing that I found very useful is to put gravel on the bottom of the pot, at least 1/4 of the pot. It gives additional nutrients and provides great drainage for extra water. Have pots with holes on the bottom of course.",
            "title_similarity": "0.491964",
            "sentiment_compound": 0.7778
        },
        {
            "id": "gzbb0sk",
            "score": 1,
            "text": "Me trying to save my plants, and the water doesn't help (just gets more and more droopy, and not any dryer till the plant finally died. Sad days :( for that plant). I guess there's always the second time around.",
            "title_similarity": "0.78044677",
            "sentiment_compound": -0.8754
        },
        {
            "id": "gzbba5m",
            "score": 1,
            "text": "Tell this to my Peace Lily. That thirsty bitch",
            "title_similarity": "0.4540614",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzbbto3",
            "score": 1,
            "text": "I made one of my succulents explode by over watering once, it retained so much water it literally swole up and popped like a balloon. I was watering once a day because the soil kept going dry. Little did I know it only needed water once a week if that",
            "title_similarity": "0.76594436",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzbc7iy",
            "score": 1,
            "text": "when u accidentally post nuclear launch codes",
            "title_similarity": "0.31701958",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzbc9b0",
            "score": 1,
            "text": "Peace lillies???\n\nUnkillable?\n\nHa!",
            "title_similarity": "0.35256553",
            "sentiment_compound": 0.6958
        },
        {
            "id": "gzbcgwz",
            "score": 1,
            "text": "Con someone confirm the following statement I recently saw on another post?: \n\nIt’s better to wait for the leaf to be completely dry not just yellow before chopping it. Some plants reabsorb some useful stuff from the senescing/dying leaf.",
            "title_similarity": "0.56956124",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzbcqc6",
            "score": 1,
            "text": "How much water to use is the other question I have. Do I just a cupful, a pint, a litre? Obviously it’ll depend on plant size but I have a few Kentia and Monstera and have no idea how much water they need.",
            "title_similarity": "0.56271523",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzbd0ey",
            "score": 1,
            "text": "This applies to more than just Basil 😉",
            "title_similarity": "0.22180726",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbd3sq",
            "score": 1,
            "text": "yep definitely killed my first cactus like this...",
            "title_similarity": "0.54142797",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzbdgkm",
            "score": 1,
            "text": "Can you give a quick example of plant food / fertilizer for house plants?  I have fertilizer for my garden boxes. Would that work, or you think something more specific?   Thanks!",
            "title_similarity": "0.41478136",
            "sentiment_compound": 0.59
        },
        {
            "id": "gzbdhln",
            "score": 1,
            "text": "Does the yellow leaf rule apply to vegetable plants as well? Also what might cause the yellowing to begin with?",
            "title_similarity": "0.31953758",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gzbeish",
            "score": 1,
            "text": "Stuff like this is exactly why I can’t keep plants alive 😂",
            "title_similarity": "0.4776262",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gzbeupz",
            "score": 1,
            "text": "Thank you for this! I just got some house plants and was wondering this",
            "title_similarity": "0.37375444",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gzbf8be",
            "score": 1,
            "text": "i have this username for a reason. thank you for this!",
            "title_similarity": "0.16990608",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gzbfbb8",
            "score": 1,
            "text": "i recommend unglazed pots too for most plants. just the basic bitch ceramic pots are like 1 dollar a piece and help plants so much by pulling water out the sides and also letting air in the sides. my success rate went thru the roof when i switched.",
            "title_similarity": "0.7241696",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzbffao",
            "score": 1,
            "text": "Nobody ever talks about self watering pots. They are the true key to not make a million mistakes until you get some plants that survive you. Its even fun to see how some plants drinks the whole reserve in 2 days and some other drink it over 2 weeks. Its auto drained. Its just the best thing ever.",
            "title_similarity": "0.7662806",
            "sentiment_compound": 0.743
        },
        {
            "id": "gzbfmo2",
            "score": 1,
            "text": "Plants make very boring pets. Feed and water them as such.",
            "title_similarity": "0.48934618",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gzbfraa",
            "score": 1,
            "text": "Somehow this is incredibly relevant to our house. We love our pathos and snake plant. I'm a terrible plant parent Nd have no idea what needs water or sun etc.",
            "title_similarity": "0.7286439",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzbfspf",
            "score": 1,
            "text": ">give them a sunny spot.\n\nI completely disagree. Check the needs of your plant. A Calathea wil 100% die in a sunny spot.\n\n I own 100+ plants for a few years now and there are only a few that actually like a sunny spot. Indirect light is key. You could download an app to check light intensity",
            "title_similarity": "0.63464713",
            "sentiment_compound": 0.4779
        },
        {
            "id": "gzbfucq",
            "score": 1,
            "text": "Corollary to this: don’t pot pants too deep. Overwatering causes smothering, yes, but that can also be caused by burying a plant too deep in the dirt. \n\nI was surprised to learn that most plants need to access air through their roots, so there need to be some roots near the surface; not fully exposed, just near the top where air can reach. Speaking generally, you’d be surprised how most plants’ roots seek to be wider and less deep than you might expect. So you should resist the urge to re-pot “nice and deep to make sure they are covered.”",
            "title_similarity": "0.68838507",
            "sentiment_compound": 0.7723
        },
        {
            "id": "gzbg1z9",
            "score": 1,
            "text": "https://youtube.com/c/Planterina",
            "title_similarity": "0.12453881",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbgq5a",
            "score": 1,
            "text": "See, this is why I don't water my plants\n\nFor obvious reasons this is a joke",
            "title_similarity": "0.4481977",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzbgvwk",
            "score": 1,
            "text": "Peace lily\n\nGot It.",
            "title_similarity": "0.07918487",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzbh335",
            "score": 1,
            "text": "So you’re telling me the plant I’ve forgotten to water in 2 months and is dying might be overwatered.  Sweet, I’ll continue forgetting about it!",
            "title_similarity": "0.6736561",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gzbh99d",
            "score": 1,
            "text": "Which plant food and how much?",
            "title_similarity": "0.12289348",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbhfu5",
            "score": 1,
            "text": "The two plants I’ve never been able to keep alive: peace lilies and snake plants.",
            "title_similarity": "0.49448603",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzbhg0k",
            "score": 1,
            "text": ">chop of leaves that go yellow - they won't go green again, and the plant is wasting resources on it.\n\nI heard that you shouldn't do this with palm/desert style plants as they will actually pull the resources up from the leaf and use it somewhere else.",
            "title_similarity": "0.6935166",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzbhrpe",
            "score": 1,
            "text": "When we had that freeze in TX all of my house plants froze. I brought back about half, but the other half bit the dust.",
            "title_similarity": "0.6667588",
            "sentiment_compound": 0.2997
        },
        {
            "id": "gzbiadf",
            "score": 1,
            "text": "Saving this post",
            "title_similarity": "0.08116147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbil17",
            "score": 1,
            "text": "What also kills is all the \"help\". Like \" just water when it feels dry\" - define dry (soil type, plant type season, air humidity etc).",
            "title_similarity": "0.5804999",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzbiosm",
            "score": 1,
            "text": "I inherited 3 of those blown glass watering things to allow plants to take what they need. I have 3 much happier plants now.",
            "title_similarity": "0.5642609",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzbiscy",
            "score": 1,
            "text": "Anyone wanting to start getting plants my recommendation is to find someone with some spider plants with good size babies on them and start there. Once they are established it is EXTREMELY HARD to kill them. \"crap I forgot to water it for 3 weeks\" is completely survivable as well as is \"crap maybe I shouldn't water this 3 times a day.\". They are very resistant plants. \n\nAnd once you have them in a good size pot keep them there, they love tight roots and will produce more babies. I like a good 10\" hanging basket. \n\n&nbsp;\n\nFor anyone that knows, what is the best way to encourage root growth? or rather even 'force' root growth?",
            "title_similarity": "0.8192023",
            "sentiment_compound": 0.9442
        },
        {
            "id": "gzbjew1",
            "score": 1,
            "text": "Thank you for those tips! I'm so bad at taking care of plants...",
            "title_similarity": "0.61747074",
            "sentiment_compound": 0.1282
        },
        {
            "id": "gzbjudj",
            "score": 1,
            "text": "I have killed four peace lillies. :(",
            "title_similarity": "0.47734362",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzbjwnp",
            "score": 1,
            "text": "A lot of this makes sense for outdoor container gardening as well.",
            "title_similarity": "0.16503984",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzbjzlq",
            "score": 1,
            "text": "OP, once you get tired of answering questions about individual plants, send them over to /r/plantclinic and we'll help them out there.",
            "title_similarity": "0.5426023",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzbkf4n",
            "score": 1,
            "text": "I’m struggling with an orchid that I think died. the stems turned to like wood at the top? is there any saving it?",
            "title_similarity": "0.50918245",
            "sentiment_compound": -0.5362
        },
        {
            "id": "gzbkt35",
            "score": 1,
            "text": "What do you think of tomatoplants as houseplants?\n\nA friend of mine worked in a greenhouse for tomatoes for a while and at some point got he idea to grow one himself. He got some tomatoes took out some seeds and planted them. After a while he had a huge (at least 3 meters tall) tomato plant. Him being the creative and spontaneous person he is, wanted to replicate this experiment but didn't want to have to go through it all again, so offered all his friends a small tomatoplant who just sprouted above the ground. Two of those plants are mine now.\n\nThere was one immediate problem however, he planted them in fall/autumn, which meant it would be way to cold for the plants to go outside anytime soon and thus they became houseplants. As of now a lot of the bottom leaves of my plants have become purple. I have no clue why or how this happened. \n\nA few things you should probably know: I have not cut off the top to stop them from growing. I have mostly gotten rid of the thingies that grow above the branches (not native English speaker, so have no clue what they're called), but let some grow just to see what happens. They have been sitting in the same pot for quite a long time now.\n\nTL:DR\nI have tomatoplants as houseplants. Bottom leaves became purple. I don't know why, do you?",
            "title_similarity": "0.63934183",
            "sentiment_compound": 0.2454
        },
        {
            "id": "gzbktii",
            "score": 1,
            "text": "How do I get rid of the little gnats spawning near my plants?",
            "title_similarity": "0.51962197",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbl89e",
            "score": 1,
            "text": "I will never understand houseplants. Yet another thing to take care of and be responsible for, and it dies if you fail. Just another reminder of life's fragility, and our own shortcomings.",
            "title_similarity": "0.6229187",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzblkbp",
            "score": 1,
            "text": "A lot of this advice is hilariously bad. \n\n>\tchop of leaves that go yellow - they won’t go green again, and the plant is wasting resources on it.\n\nYou have absolutely no idea what you’re talking about.",
            "title_similarity": "0.6736157",
            "sentiment_compound": -0.8268
        },
        {
            "id": "gzblmo9",
            "score": 1,
            "text": "Are regular lights okay if sun doesn’t directly hit that spot? I want to get wall mounted planters and do pothos",
            "title_similarity": "0.4625904",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzbm4rd",
            "score": 1,
            "text": "This was the post I needed! I acquired a few indoor plants over the past year. A couple different cacti, some succulents, an Aloe and a Hypoestes. The last being the most difficult I've dealt with so far. All the other plants require little water, so I haven't paid them as much attention and they are THRIVING. The Hypoestes care tho has been challenging. \n\nAfter reading this, I'm pretty sure I transplanted her too early, in a beautiful (yet impractical) hanging planter. It is a large, round ceramic pot with a good size drain hole in the bottom. I placed her in the middle, and had to pack a lot of soil around her to keep her in place. Pretty sure I packed her into the soil too tightly and her roots have suffocated because the soil doesn't drain very well.\n\nI've also read that Hypoestes need different care depending on what you expect from it. Like less sunlight will help it grow out and be more \"leggy\", but also to not let the plant dry out at all. I just can't imagine watering her in the dark lol",
            "title_similarity": "0.76713455",
            "sentiment_compound": 0.9473
        },
        {
            "id": "gzbm6lr",
            "score": 1,
            "text": "If you have pets don’t get a peace lily they are very toxic",
            "title_similarity": "0.6456628",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzbm8fz",
            "score": 1,
            "text": "-If you have spider plants and also have cats, be prepared for many nibbled leaves",
            "title_similarity": "0.38898468",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzbmeaf",
            "score": 1,
            "text": "Applies to cannabis too. Most overwater with good intentions not realizing how detrimental it is to the plant.",
            "title_similarity": "0.54062366",
            "sentiment_compound": 0.4877
        },
        {
            "id": "gzbn806",
            "score": 1,
            "text": "I will never understand how my father was able to grow so many plants in waterlogged mush but he was.  Algae grew too but the plants didn't seem to care.",
            "title_similarity": "0.6543859",
            "sentiment_compound": -0.5334
        },
        {
            "id": "gzbnff1",
            "score": 1,
            "text": "I have succullents that I completely neglect for years and they seem to just keep growing. Mind you it doesn't look great, but it's far from dead.  \n\n\nMy bird of paradise, ficus and snake plant get water maybe monthly, if they are lucky or they tell me they are sad.",
            "title_similarity": "0.75041276",
            "sentiment_compound": -0.5489
        },
        {
            "id": "gzbno0p",
            "score": 1,
            "text": "Fantastic guide. Thanks for sharing!\n\nI learned most of the lessons during the last year myself. Especially plant stress surprised me so much. I repotted plants in October (future me: duh!) and was like, yeah bitches now grow and be merry. But instead some of them went yellow and were visibly not doing well. I was very confused.",
            "title_similarity": "0.7778505",
            "sentiment_compound": 0.2062
        },
        {
            "id": "gzbns7m",
            "score": 1,
            "text": "Hello you say not to over fertalize, as it can kill the plant. But you also say right after that not to fertalize in the winder. Is this winter or a redneck window?",
            "title_similarity": "0.5883046",
            "sentiment_compound": -0.431
        },
        {
            "id": "gzbo6i4",
            "score": 1,
            "text": "As someone living in dry ass Arizona this is not necessarily true for us since soil dries out so much faster than anywhere else.",
            "title_similarity": "0.6104481",
            "sentiment_compound": -0.7033
        },
        {
            "id": "gzbou9u",
            "score": 1,
            "text": "I have mad overwatering syndrome",
            "title_similarity": "0.35883784",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzbpjg9",
            "score": 1,
            "text": "How do you get rid of those little fungus flies living in the topsoil?",
            "title_similarity": "0.50428784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbprk9",
            "score": 1,
            "text": "This is hands down the best, most concise overview of the basic needs of a plant...thank you! 👏🏼",
            "title_similarity": "0.3782792",
            "sentiment_compound": 0.6696
        },
        {
            "id": "gzbqv9i",
            "score": 1,
            "text": "When in doubt don’t water? But it’s been 3 weeks but ok",
            "title_similarity": "0.32606012",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gzbr3wd",
            "score": 1,
            "text": "Mine are all indoor.\nJust moved them to where they seem happy and give em' water when they look thirsty\n\nRip all my plants that died when I was in NZ for Two weeks and we had 40C days at home",
            "title_similarity": "0.72094035",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzbrkuh",
            "score": 1,
            "text": "I did all of this and still killed 2 of the 4 plants my best friend gave me! And I killed my sister in laws pothos! They were so pretty to 🙁",
            "title_similarity": "0.7092712",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gzbs1ya",
            "score": 1,
            "text": "I have plants that have no drainage (don’t ask, I was new to plants) that are flourishing better than any of my plants with good drainage. I’m starting to believe “plant experts” don’t know what they’re talking about",
            "title_similarity": "0.6187713",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzbsrs6",
            "score": 1,
            "text": "Damp to the touch, and hopefully aerated enough that it has some \"give\" when you test it.\n\nPlants becoming rootbound are extremely likely. Plants purchased anywhere need to be repotted, which will cause shock in almost any kind of plant. Pots need to be at least twice the diameter of the root system to ensure adequate drainage and room for growth.",
            "title_similarity": "0.74684554",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzbt26y",
            "score": 1,
            "text": "When in doubt, buy a friggin moisture meter!  \nThey are so cheap and you never have to play guessing games again!",
            "title_similarity": "0.54799294",
            "sentiment_compound": -0.6273
        },
        {
            "id": "gzbt2pa",
            "score": 1,
            "text": "What about outside plants?",
            "title_similarity": "-0.13829425",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbtk6d",
            "score": 1,
            "text": "My pothos is indeed one of the toughest plants I've ever had. Once forgot to water for a month, didn't even wilt. Took it like a champ",
            "title_similarity": "0.7023904",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzbtr5g",
            "score": 1,
            "text": "Once a week is not good enough for most plants. If their saucer is bone dry, you should probably water them, but if you're watering once a week, it's too few and far between. This even applies for succulents. Just because they can handle drought doesn't mean that they want to. If you want your plants to grow, you need to water them. If you want them to stay the same size forever, do it once per week.",
            "title_similarity": "0.7779709",
            "sentiment_compound": 0.1648
        },
        {
            "id": "gzbtt9n",
            "score": 1,
            "text": "Hey I bought some plants to put outside my patio. I live in a place where I can’t have a traditional garden. \n\nI researched online and it says to water once or twice a week   \n\nMy plants are dying.  \n\nAm I not watering enough?",
            "title_similarity": "0.67280054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbujxb",
            "score": 1,
            "text": "Bamboo, look nice and hard to kill\n\nMy mom has like 40 aloe vera plants because she likes to garden on Easy Mode",
            "title_similarity": "0.62435937",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzbuq3v",
            "score": 1,
            "text": "These are great tips! Although, with the exception of my monstera, I usually leave yellow leaves on the plant until I can pluck them off without scissors - that way the plant can make use of the chlorophyll before I discard the leaf!",
            "title_similarity": "0.65564907",
            "sentiment_compound": 0.5399
        },
        {
            "id": "gzbuqpx",
            "score": 1,
            "text": "Thank you! You did a great write up, and I will put it to use!",
            "title_similarity": "0.29058206",
            "sentiment_compound": 0.8011
        },
        {
            "id": "gzbuv36",
            "score": 1,
            "text": "I assume forgetting to water at all for long periods of time and then watering too much for a short period because it’s on my mind is ideal?",
            "title_similarity": "0.72225976",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzbuv3c",
            "score": 1,
            "text": "Omg thank you for this I’ve been wanting to start having a set up of indoor plants at my house 🥺",
            "title_similarity": "0.3645385",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzbv54o",
            "score": 1,
            "text": "Idk this is far more common",
            "title_similarity": "0.23548265",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzbv9n1",
            "score": 1,
            "text": "So I've had my aloe plant for over a year, I should repot it and put new dirt stuff in it? I got it as a gift and I've never taken care of a plant before. I water it whenever I remember which is once in a while, stick it under the faucet for like half a second and let it go for at least two weeks.\n\nWhat kind of dirt do I get?",
            "title_similarity": "0.5797323",
            "sentiment_compound": -0.3981
        },
        {
            "id": "gzbvb5f",
            "score": 1,
            "text": "Thank you for this.",
            "title_similarity": "0.014074823",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzbw4ks",
            "score": 1,
            "text": "Can attest to the “there’s no way you can kill a pothos”. We had one in the office lab which doesn’t have any windows. People would forget it was even there and only water it very infrequently. That thing lived and grew like crazy for like 3 years before we switched labs and someone brought it home.",
            "title_similarity": "0.6498637",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzbwxpz",
            "score": 1,
            "text": "My baby died after 5 years. I got so worried it was drying out but it likely was because I kept watering it. 🥺 rip Lil Tree.",
            "title_similarity": "0.64489657",
            "sentiment_compound": -0.4995
        },
        {
            "id": "gzbx33l",
            "score": 1,
            "text": "It says here that one of the unkillable plants are peace Lilly but when I bought a peace Lilly, it died in two weeks. When it droop, I watered them and it magically stood up again after a day like magic. The second time it did, it didn’t stand up again and continued to droop. I had to just get rid of it. I’m not sure what I did wrong. \n\nMy snake plant on the other hand is standing tall for almost a year now. Same with my rubber plants which I can see have little brand new leafs growing which makes me happy.",
            "title_similarity": "0.76425827",
            "sentiment_compound": 0.8795
        },
        {
            "id": "gzbx4no",
            "score": 1,
            "text": "All of this! I laugh when people say to get a succulent because they're so easy. I love my succulents the most, but they are much more challenging than my house plants! Which I can water basically whenever and pot in regular potting soil and just generally not have to think about.",
            "title_similarity": "0.72071254",
            "sentiment_compound": 0.8529
        },
        {
            "id": "gzbx81q",
            "score": 1,
            "text": "This reminded me to put a cap worths of water j to my succulent th at sits on my desk. I just have water bottle that I use to water my succulent every time I remember too, normally around once every 4 days",
            "title_similarity": "0.499307",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbxjb1",
            "score": 1,
            "text": "I repotted a jalapeño plant a week ago and after a day or two it started sprouting over double the leaf count it had prior. No real point to this comment, I just thought it was magical.",
            "title_similarity": "0.64735186",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzbxq96",
            "score": 1,
            "text": "This could metaphorically tied to relationships too.",
            "title_similarity": "0.10174215",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbxv94",
            "score": 1,
            "text": "Gardening is a fucking coinflip. It's either too much or too little and you never know which one it is.",
            "title_similarity": "0.46768534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzbxvgc",
            "score": 1,
            "text": "One time I killed a fucking cactus. A cactus.",
            "title_similarity": "0.4097625",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzby8gr",
            "score": 1,
            "text": "What's the best plant to bring to my office that doesn't need sunlight?",
            "title_similarity": "0.3906318",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzbyet1",
            "score": 1,
            "text": "My tomato seedlings always die from overwatering.  It's actually more of an annual ritual, really.  It marks the beginning of \"time to buy ponypacks of tomatos\" season.",
            "title_similarity": "0.78734165",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzbyh2z",
            "score": 1,
            "text": "I have a peace Lilly and snake plant.\n\nPretty sure I killed the snake plant from over watering... tried repotting it in fresh soil, but every day another leaf gets mushy, or just falls off :(\n\nPeace Lilly is going strong though.",
            "title_similarity": "0.83394915",
            "sentiment_compound": 0.85
        },
        {
            "id": "gzbylzy",
            "score": 1,
            "text": "Not for everyone I know, but synthetic plants have gotten really quite good. I've switched to mostly synthetic and care for only a few live plants.  For example, I see no reason to buy live succulents unless you are doing so for philosophical reasons only - a good synthetic succulent is nearly indistinguishable from a live one.",
            "title_similarity": "0.6188505",
            "sentiment_compound": 0.9013
        },
        {
            "id": "gzbymxu",
            "score": 1,
            "text": "On Android there is an app called PictureThis that identifies and shows some care tips for the plant. It have a pay mode, but free os good enough.",
            "title_similarity": "0.4651919",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gzbzcva",
            "score": 1,
            "text": "Wife and I accidentally watered an already struggling fern back to back. Went from recovering to dead in less than a day.",
            "title_similarity": "0.61336565",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gzc05id",
            "score": 1,
            "text": "Thank you! I have so much trouble with plants and this was very helpful.",
            "title_similarity": "0.5182198",
            "sentiment_compound": 0.4417
        },
        {
            "id": "gzc09b7",
            "score": 1,
            "text": "I use those water things with a reservoir of water that my plants suck from when they want. Seems to work. Don't know if they are considered good practice?",
            "title_similarity": "0.54014564",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzc0bb5",
            "score": 1,
            "text": " Always choose containers with drainage holes. Most plants roots will rot if they sit in water all the time.",
            "title_similarity": "0.729792",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzc0emi",
            "score": 1,
            "text": "I can only keep aquatic plants alive because I overwater.",
            "title_similarity": "0.6063181",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzc0kix",
            "score": 1,
            "text": "I'm sad I don't have better natural light in my place or I'd make good use of all this info.",
            "title_similarity": "0.62228465",
            "sentiment_compound": -0.5742
        },
        {
            "id": "gzc0kqr",
            "score": 1,
            "text": "Check the soil.  You can tell if there's too much water or not enough very easily by touching the soil and if it's dry you water the plant, if it's sopping wet don't water it.  The soil should be damp, but don't check the topsoil, stick your finger in there.",
            "title_similarity": "0.5333144",
            "sentiment_compound": -0.1597
        },
        {
            "id": "gzc15tl",
            "score": 1,
            "text": "When it comes to plants, care is completely subjective and numbers mean nothing i.e. water every 5 days.\n\nBecause it all depends on your environment. \nA sunny spot in england is very different to a sunny spot in arizona. \n\nThe environement can vary in temperature, humidity, air flow and light. All these things will effect how fast your plant absorbs water. \n\nAlso things like plant size, type of plant (most important) and the pot you use also determine how fast water is sipped up. \n\nThe best advice is not an objective one, but plant oweners need to be intuitive when watering their plants. And only water when your plant needs water which is when the soil just dries out usually. \n\nSome plants of mine, I only water once every 2 months because they have a water-holding soil. Other plants I water every 4 or 5 days because they're in a terracotta pot which absorbs water quickly. \n\nIts all about experimentation, patience and research on the individual plant. \n\nBooks dont really help, apps dont help and the internet doesnt really help, because it always depends on your individual house climate.\n\nMy method of success: \n\n1. Use terracotta pots. They absorb water and dry out the plant faster, protecting it from root rot, although it means you have to water more often. But i go around once or twice a week to check on my plants and that seems to be enough. Before terracotts pots, I lost many plants to root rot, even just from one water!\n\n2. Experiment with light positions throughout the year until your plant thrives. Some plants ive had to move couple of times before they found their happy spot. Other plants i have to constantly reposition so they catch the most sun throughout the year. Other plants ive had to move to darker spots. This information I usually get from books, but I have a o\nPretty low light apartment,  so all of my plant except two low light ones are by the window seal. I have a lot of tress and buildings around me, so I dont get much direct sun anyway. Most of plants need diffused light, so by my window is perfect for them. My cacti dont thrive, but they survive. And some plants ive moved outdoors, because they wernt producing new growth even in the brightest spot in my home. \n\n4. Water only when soil is dry. Do this by checking the soil with either your fingers or a moisture meter.  Some plants your should jeep dry for while such as cacti, some plants should always be wet like a maiden fern, but most leafy house plants have the same method of care.\n\n5. If your plant is producing new growth. Its happy! Keep it where it is and continue the level of care you're giving. \n\n6. Dilute your fertiliser. Twice as much as reccomended on package.",
            "title_similarity": "0.74296105",
            "sentiment_compound": 0.9932
        },
        {
            "id": "gzc2515",
            "score": 1,
            "text": "Guilty of this. Lock me up and throw away the key.",
            "title_similarity": "0.40900475",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzc2bo5",
            "score": 1,
            "text": "“Yeah, this felt more sad to me lol",
            "title_similarity": "0.32707536",
            "sentiment_compound": -0.1513
        },
        {
            "id": "gzc2ssn",
            "score": 1,
            "text": "How do you know when something is rootbound, and how do you remedy it?",
            "title_similarity": "0.19173148",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzc2wmq",
            "score": 1,
            "text": "But what about outside plants? I got two bell peppers and one tomato plant and I have no idea if I am over watering them",
            "title_similarity": "0.4869366",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzc2z7z",
            "score": 1,
            "text": "I over-water my plants and under-season my food.",
            "title_similarity": "0.6565559",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzc3nbs",
            "score": 1,
            "text": "What about food plants like vegetables and fruit",
            "title_similarity": "0.18259045",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzc4g9i",
            "score": 1,
            "text": "because there is no air circulation indoors the water just sits on the roots it will rot the roots, via fungus. \nSucculents, orchids indoors should never be watered too much, it will temporarily kill the plant. \n\nSucculents and orchids that have been growing outside have adjusted to being outside, so watering regularly, or irregurlary is fine. but not the same plants that have been inside and suddenly moved outside.",
            "title_similarity": "0.77659345",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzc4rhb",
            "score": 1,
            "text": "A really good idea for an indoor gardener is to have what I call an “indicator plant”  Thats a plant that droops when it’s thirsty.  I might kill it and need to replace it more often that the indestructible philodendron or pothos, but when I see it droop I feel sorry for it and it reminds me to give all my plants a little needed attention.",
            "title_similarity": "0.8376448",
            "sentiment_compound": -0.2272
        },
        {
            "id": "gzc55yf",
            "score": 1,
            "text": "Learned this by killing my first spider plant :(",
            "title_similarity": "0.56227475",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gzc5edq",
            "score": 1,
            "text": "Plan can survive on its own in nature so i think it makes more sense for underwater your plant",
            "title_similarity": "0.465253",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzc676p",
            "score": 1,
            "text": "I think overwatering is why my houseplant is almost dead. Thanks for the tips!",
            "title_similarity": "0.72806937",
            "sentiment_compound": -0.3974
        },
        {
            "id": "gzc6mhy",
            "score": 1,
            "text": "I have a peace lily that starts to wilt when it needs water  That's when I water it and my other plants. All have been doing well for years.",
            "title_similarity": "0.6006547",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzc6wtb",
            "score": 1,
            "text": "Watering bulbs are a great, very cheap way of keeping your plants alive. They also make pots that water using a reservoir and string. Great ways to keep everything alive without too much effort.",
            "title_similarity": "0.54694456",
            "sentiment_compound": 0.9246
        },
        {
            "id": "gzc8ukx",
            "score": 1,
            "text": "My cousin sent me a lily plant when my mom passed. I had killed any plant I had before due to over watering or transplanting. But this plant, I would let start to whittle, and then water. When I transplanted it, I found the same moss it was already in, and just used that. But I know the main thing, is the underwatering. I've had it for almost 3 years now, longest living plant I've ever had, and am so blessed it was THIS plant that lived.",
            "title_similarity": "0.7716483",
            "sentiment_compound": 0.7381
        },
        {
            "id": "gzc9oqm",
            "score": 1,
            "text": "I've been trying to help my fiancee with her calatheas. She is doing everything right according to all the videos and research I've done...they still brown and get generally pissy. Have mister, damp soil, not wet, in bowl with water, good water - not tap....nothing. \n\nI hate calatheas - my snake plant rocks tho.",
            "title_similarity": "0.7907702",
            "sentiment_compound": 0.8224
        },
        {
            "id": "gzca0r0",
            "score": 1,
            "text": "One tip that always helped me: putting almost everything in well draining succulent mix. I have about a tad over 100 plants. Have for years well before the pandemic plant craze. Half of which are inside plants and all vary. I have zero schedule on watering. Usually if they look droopy for anything other than succulents, it’s watering time. I’ve never had an underwatering problem. I don’t do the finger test because some months my apartment is really dry so some plants just feel dry superficially but are fine deeper. For anyone prone to OVERwatering or for beginners, I’ve always just put 90% of my plants in well draining succulent soil (something like miracle grow succulent mix that’s not super rocky or sandy but a great well draining mix) with a well draining pot. Always a win. Only my monstera and my stromanthe are in anything different.\n\nThis is a pretty solid list of tips",
            "title_similarity": "0.71966577",
            "sentiment_compound": 0.9847
        },
        {
            "id": "gzcas14",
            "score": 1,
            "text": "It’s been a while since I saw a LPT that good.",
            "title_similarity": "0.15947828",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzcbvt0",
            "score": 1,
            "text": "Does the same apply for lawn grass?",
            "title_similarity": "-0.080582626",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcbx4j",
            "score": 1,
            "text": "I liked all the tips except for dusting the leaves every two days. Most plants really don't like to be fussed with that often and there's a risk of actually pulling some of the leaves off the plant.",
            "title_similarity": "0.7653706",
            "sentiment_compound": -0.175
        },
        {
            "id": "gzcccc6",
            "score": 1,
            "text": "i water with a spray bottle so i can water everyday.",
            "title_similarity": "0.40731645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzccxvv",
            "score": 1,
            "text": "Got a ficus recently and ONLY the fresh baby leaves are falling off. Any ideas?",
            "title_similarity": "0.57593834",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzcd107",
            "score": 1,
            "text": "Me to my plants: I shower you with love and yet you die on me :’(",
            "title_similarity": "0.6346309",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzcdoyo",
            "score": 1,
            "text": "This is true with outdoor potted plants as well. I just bought my mother some moisture-control potting mix because there’s always soggy and sad-looking plants halfway through the summer.\n\nIt isn’t an excuse to not water as often of course, but it helps for those with a tendency to overwater.",
            "title_similarity": "0.78814197",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzcdset",
            "score": 1,
            "text": "I just realized why all my houseplants die. Was I overwatering them? Yes. Was I underwatering them? Yes.",
            "title_similarity": "0.69729054",
            "sentiment_compound": 0.2168
        },
        {
            "id": "gzcfbz6",
            "score": 1,
            "text": "There’s no good rule of thumb for how often to water plants. The best thing to do it to research whether each plant wants to dry out completely, dry out on top, or always stay moist. How fast they will use up the moisture in their soil depends upon a lot of factors. Once you know for each plant, check them daily or every other day and water accordingly.",
            "title_similarity": "0.69740134",
            "sentiment_compound": 0.5565
        },
        {
            "id": "gzcge95",
            "score": 1,
            "text": "I would like to add some tips for Venus fly traps since they are so different. They require pure water. So distilled or rain water. Nothing with minerals like tap or bottled water. It will burn the roots. Unlike other plant they grow in wet media but not water logged. So you keep in a tray of water about a centimeter of water. Never use regular potting soil. It will kill it. These plants evolved in nutrient poor soil. These plants also go into a winter dormancy. If you don’t give it the conditions to go dormant. It can get weak and die eventually",
            "title_similarity": "0.7514648",
            "sentiment_compound": -0.9709
        },
        {
            "id": "gzcgtow",
            "score": 1,
            "text": "Any tips for orchids? No matter what I do I can't get them to re grow flowers, only air roots. I water/soak only once a week and fertilize every couple months.",
            "title_similarity": "0.5793582",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gzchty6",
            "score": 1,
            "text": "Thank you for this. My plants have been really sad lately and it’s been discouraging. This gave me the push I needed to finally put them in the window, wipe them down, & chop some leaves.",
            "title_similarity": "0.7526559",
            "sentiment_compound": -0.5849
        },
        {
            "id": "gzcidrt",
            "score": 1,
            "text": "once a week will kill all but certain houseplants, only the recommended care for the species you have counts, not some random post on the internet",
            "title_similarity": "0.7292757",
            "sentiment_compound": 0.743
        },
        {
            "id": "gzcisne",
            "score": 1,
            "text": "This is a real life pro tip that isn't just an opinion. Great post 10/10",
            "title_similarity": "0.3377885",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzcize3",
            "score": 1,
            "text": "Great post, thank you so much!🌷",
            "title_similarity": "0.21037489",
            "sentiment_compound": 0.784
        },
        {
            "id": "gzcjy7o",
            "score": 1,
            "text": "for plants that are planted in the garden, can days long rainstorms similarly kill them due to overwatering?",
            "title_similarity": "0.64512223",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzck6k2",
            "score": 1,
            "text": "Read the tags lol. They pretty much all day water 1 cup every two weeks. Or some will say water when soil one inch deep is dry.",
            "title_similarity": "0.44386104",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzckdii",
            "score": 1,
            "text": "This is what I tell my aunt but she believes all the plants need to be constantly drowning in water and every few days.  Things are getting moldy and they're just not doing good. But she gets very very defensive about it. Lol",
            "title_similarity": "0.7967235",
            "sentiment_compound": 0.3814
        },
        {
            "id": "gzckjhq",
            "score": 1,
            "text": "A good tip for drainage is to put a layer of a couple inches of rocks at the bottom of your pot/plant. Excess water will drain into the rocks and bonus of watering from the bottom as the soil dries and the water evaporates. Pretty neat trick that has saved a few plants from over watering",
            "title_similarity": "0.5856668",
            "sentiment_compound": 0.9349
        },
        {
            "id": "gzckyu1",
            "score": 1,
            "text": "You forgot: if you're a beginner, just get a spider plant.  They're damn near un-killable.",
            "title_similarity": "0.6345765",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzcl4pi",
            "score": 1,
            "text": "To add to your excellent advice, here's a watering tip that turned me from a houseplant murderer to a green thumb: if you use municipal tap water, age it 24+ hours before you give it to your plants, just like you would if you were using it for fish tank. I keep water in a couple of empty plastic jugs. When I water my plants, I refill the jug and by the time the plants are thirsty again, the water in the jug has aged and the dissolved gasses like chlorine (toxic) and CO2 (reduces pH) evaporate out. It has made a huge difference for my plants.",
            "title_similarity": "0.7691539",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzcl62p",
            "score": 1,
            "text": "Touch the soil!!! Please!!",
            "title_similarity": "-0.014425922",
            "sentiment_compound": 0.5374
        },
        {
            "id": "gzclsxj",
            "score": 1,
            "text": "[$14 on Amazon](https://smile.amazon.com/dp/B01J1HO6XY/ref=cm_sw_em_r_mt_dp_14BDM3T9TYNJN2RV72Z4?_encoding=UTF8&psc=1). Super easy to use.  Helped me out a lot.",
            "title_similarity": "0.45177805",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gzcm19y",
            "score": 1,
            "text": "Learned this lesson last month",
            "title_similarity": "0.2569522",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcmaas",
            "score": 1,
            "text": "I bought this big spiky plant labeled in the store as a \"T Rex Aloe\" and I love it.  I barely think about it and I've had it for years.  Just finally repotted it for the first time the other day.",
            "title_similarity": "0.621116",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzcmfz7",
            "score": 1,
            "text": "Wow, you straight up wrote a life pro GUIDE. Kinda thinking of getting a plant now.",
            "title_similarity": "0.44990662",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzcn2dh",
            "score": 1,
            "text": "Can’t over-water if youre growing hydroponically 🤔",
            "title_similarity": "0.38169244",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzcn851",
            "score": 1,
            "text": "I somehow acquired over 85 houseplants in the last few months. Finally settling into a routine but it’s so hard not to overwater! I want to give them all the love. But really, some of my most thriving plants are going strong with a watering every other week.",
            "title_similarity": "0.62393737",
            "sentiment_compound": 0.8932
        },
        {
            "id": "gzco5l2",
            "score": 1,
            "text": "Inspect plants for harmful mites before introducing them to your home. Particularly clearance plants. They are rewarding to save but harmful infestations are such a headache!",
            "title_similarity": "0.74830806",
            "sentiment_compound": 0.5562
        },
        {
            "id": "gzcprgr",
            "score": 1,
            "text": "DO NOT TRIM YELLOW LEAVES. These leaves are still providing sugars and nutrients to the steam, and tearing them off while the leaf steam is supple can harm the main stem. Instead, wait until they start to brown or 'crisp' on the edges. Freshly yellow, let them mellow :) Getting crisp, give them a snip!",
            "title_similarity": "0.6748401",
            "sentiment_compound": -0.2003
        },
        {
            "id": "gzcqsms",
            "score": 1,
            "text": "I have a little succulent about the size of a quarter. How often would you recommended fertilizer?",
            "title_similarity": "0.37373772",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzcqxl4",
            "score": 1,
            "text": "Thank you so much <3",
            "title_similarity": "0.0986414",
            "sentiment_compound": 0.6887
        },
        {
            "id": "gzcr1sr",
            "score": 1,
            "text": "On the topic of houseplants, how do i keep a plant small without it getting root bound?",
            "title_similarity": "0.37166932",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcr98l",
            "score": 1,
            "text": "Get a moisture meter. Life changing for you and your plants.",
            "title_similarity": "0.3521546",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcrboa",
            "score": 1,
            "text": "how did this get so many upvotes and awards lmao (not in a bad way, just asking out of curiosity)",
            "title_similarity": "0.39156884",
            "sentiment_compound": 0.8674
        },
        {
            "id": "gzcsi4d",
            "score": 1,
            "text": "Hello! Any tips on when to repot plants, and how big pots should be relative to plants? I have a couple I think I may be neglecting with pots they’ve grown out of.",
            "title_similarity": "0.5656886",
            "sentiment_compound": -0.4574
        },
        {
            "id": "gzcsymu",
            "score": 1,
            "text": "Ngl, pics kinda I'm a stalker coming to getcha from behind the plant.\n\nSpaghet.",
            "title_similarity": "0.4167704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzct0jk",
            "score": 1,
            "text": "Had a bonsai at work I had been taking care of. Little did I know that one of the office gals had been going around watering everyone’s plants without asking anyone weekly. \n\nI probably don’t have to say what happened next. I’ve never been more upset, especially since my wife spent good money on it and it made me look like I didn’t care for it enough.",
            "title_similarity": "0.75024796",
            "sentiment_compound": 0.9217
        },
        {
            "id": "gzctq0g",
            "score": 1,
            "text": "My basil would disagree",
            "title_similarity": "0.3167376",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzcu3y8",
            "score": 1,
            "text": "This is why my thumbs aren’t green. Lol still learning this",
            "title_similarity": "0.34397838",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzcua9m",
            "score": 1,
            "text": "This why my hyacinths keep dying? I love them so much but they keep dying, probably from over-watering. Anyone got any tips?",
            "title_similarity": "0.7867342",
            "sentiment_compound": 0.4515
        },
        {
            "id": "gzcuoj7",
            "score": 1,
            "text": "I'll be honest, I've killed a lot of good houseplants, only one of them was from overwatering and that was a bonsai. \n\nI would love to see the citation of overwatering killing More plants than underwatering.",
            "title_similarity": "0.7960099",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzcuuly",
            "score": 1,
            "text": "When I bring home a plant and it's dying, I literally talk to it like it can understand me. \"I'm going to put you outside. You can die or you can live. Up to you.\"  And usually putting it outside has done the trick for me. \n\nI also have a toddler who likes to drown them so over watering was definitely not the issue.",
            "title_similarity": "0.75114214",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzcuumn",
            "score": 1,
            "text": "The whole leaf is yellow you're underwatering \nJust the tips are yellow you're overwatering\nSimple rule of thumb",
            "title_similarity": "0.45119625",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzcuuw6",
            "score": 1,
            "text": "Seriously! Props to this post.\n\nThey'll bounce back with one watering so quick.",
            "title_similarity": "0.48308316",
            "sentiment_compound": -0.2481
        },
        {
            "id": "gzcuw28",
            "score": 1,
            "text": "How do you bring back a plant that you’ve overwatered? I have a ZZ plant, and he was doing so well for so long! But I think between a combination of overwatering, and a move overwhelmed it, and now he’s all droopy and just won’t grow. We put him in new soil a couple weeks ago, and drilled drainage holes in his pot, and removed all the old roots and the root ball. It’s been almost two weeks now, and I haven’t seen much of an improvement…\nThe little fella is still green, he just looks…sad",
            "title_similarity": "0.73584825",
            "sentiment_compound": -0.0827
        },
        {
            "id": "gzcvjda",
            "score": 1,
            "text": "If you want a lot of the plants mentioned here but are on a budget, Google if you live near a Trader Joe's grocery store. All of their plants cost a third of what you'd pay if you bought them from Home Depot or similar stores.\n\nWhile they don't have all options at all times, over the past two months I've picked up ferns, snake plants, zz plants, and dracaena for $10 and under each.",
            "title_similarity": "0.62380135",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gzcvo7x",
            "score": 1,
            "text": "Overwatering and my annoying rabbit",
            "title_similarity": "0.53953636",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzcvq0b",
            "score": 1,
            "text": "Everytime I've tried to keep houseplants, I end up with those little flies in the soil and end up having to throw away the whole plant. Any tips on how to avoid this?",
            "title_similarity": "0.72642386",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzcwjy6",
            "score": 1,
            "text": "If I had to add one thing to what OP said, that I find many people do, is to not move your plants constantly. Plants do not have feet. They are not meant to move. They are the best at aclimating in a given space and flourishing then and there. If you move them they get in shock and have to acclimate again. You lose growth time cause your plants get stunt. Moving should be done for only 2 reasons. 1)the current position is wrong and a new better one has been found (don't trial and error), and 2) bringing them inside to protect from cold (during winter they are sleeping they won't notice the moving).\n\nThere are plants that are more prone to ailments because of moving and plants that are not. For example gardenias might die in a week just because they got moved from their favorite place.\n\n\n\nAnd one explanation that might help people understand why they need to buy food for their plants.\n\n>Soil is not the food. Soil is the plate that holds the food (and also provides anchoring for the tree). There are better plates (dark soil with lots of organic matter), and worse plates (pale, sandy, with no organic matter at all). The food is the fertilizer that you get. In nature food is available from leaves and other stuff that decompose on the ground and with rain the move their nutrients back into the soil. In a pot on your balcony or patio this isn't achievable. So you have to provide the food. Also in nature plants can and will extend their roots towards water and nutrients. In a pot they can't. So it is on us as their care takers to provide them with food.",
            "title_similarity": "0.7456837",
            "sentiment_compound": 0.8187
        },
        {
            "id": "gzcx1m4",
            "score": 1,
            "text": "Thank you for the tips. Hopefully those who overthink everything will re-read their replies and see how frustrated they sound because of their responses. Gardening requires little sense of urgency when it comes to plants. There is no quick fix, rather a need to raise your own vibration to meet the vibration of plants around you.\n\nI’ve seen many people communicate with their plants and in a time lapse video there is a visible difference.\n\nI’ve also seen people who don’t even believe in that technique become frustrated because they rely on actual people to verbally tell them what is going on with their own plants.\n\nLook and feel your plants energy. There is no real cheat sheet to overcoming yourself and your plants (like your children) will be the pubic victory over your private battles.",
            "title_similarity": "0.7657944",
            "sentiment_compound": -0.3653
        },
        {
            "id": "gzcxsm6",
            "score": 1,
            "text": "Thanks for this. Got my little dragonfruit cactus chilling. We’re figuring it out together",
            "title_similarity": "0.50762564",
            "sentiment_compound": 0.4703
        },
        {
            "id": "gzcyie5",
            "score": 1,
            "text": "Is watering every 2 days ideal year round and watering every alternate days in summer ?",
            "title_similarity": "0.41739225",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzd1ao2",
            "score": 1,
            "text": "I've had the same peace lily since 2006, bought it with 3 leaves. Have killed at least 8 succulents in the past 3 years. :)",
            "title_similarity": "0.5366857",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzd1rk7",
            "score": 1,
            "text": "This is good, thanks. I was a professional gardeners for years and still struggle with houseplants sometimes, a different beast when you're controlling their whole environment in a pot. I always tell people to under rather than overwater. But you find a good window with nice lighting, keep the water low, and you'll have success\n\nIf anyone can pitch in more succulent tips....please. I'm embarrassed how bad I am at their care",
            "title_similarity": "0.826668",
            "sentiment_compound": 0.8591
        },
        {
            "id": "gzd29rs",
            "score": 1,
            "text": "Paging r/spacebuckets , r/growingmarijuana , r/cannabiscultivation for people who spend every minute trying to give the perfect ratio of water, food, light, medium, air, heat, etc",
            "title_similarity": "0.57054096",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzd36cr",
            "score": 1,
            "text": "I haven't been able to read through all the comments, so if I'm repeating something, I apologize. I just wanted to point out, since you mention toxicity in your post, that all 3 of the easy-care plants you listed, are toxic to pets. I just really started to get into house plants a couple of years ago, and I was initially disappointed, because some of the most common and easy to care for plants are toxic to pets, and I have 2 cats that can manage to get just about anywhere and love to nibble on greenery. After doing some research, I found plants in the genus Peperomia are awesome. They come in an incredibly huge variety of colors, shapes, and sizes, and they tend to be very easy to care for. They are non-toxic, and several are actually rather common and easy to find. Just don't confuse a Baby Rubber Plant with a Rubber Tree! (The latter is highly toxic.)",
            "title_similarity": "0.76632476",
            "sentiment_compound": 0.9778
        },
        {
            "id": "gzd8jue",
            "score": 1,
            "text": "Fwiw I have killed at least two pothos due to over watering. Even they can be finicky! But once I realized I was over watering my plants in general, I’ve had much more success. Didn’t stop my beautiful, long, full marble queen pothos from getting root rot recently though :( it was the pickiest pothos I’ve ever met.",
            "title_similarity": "0.8750894",
            "sentiment_compound": 0.5165
        },
        {
            "id": "gzdj882",
            "score": 1,
            "text": "If you have an overwatered plant and an underwatered plant, can you stick a length of hose into the soil and suck on it to siphon the excess water from one pot to the other?",
            "title_similarity": "0.37505496",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzdvvjn",
            "score": 1,
            "text": "This is a good post OP! I consider myself a plant mom and I would like to share my experience, because I can't stop talking about my green babies 😁\n\nWith watering, my tactic is to Google which environment the plant is normally found in. Chlorophytum? More tropical environment, needs moist soil. Nolina? Desert plant, needs dry soil. Figure out where your plant is from. Then start experimenting. How many days does it take for the soil to dry out? You can test this by sticking your finger in the soil, as mentioned a lot in this comment section. After I have figured this out, I put all the data in my plant care reminder app. The one I use allows me to differentiate between the plant's rest period (often oct-march) and the blooming period. Every day I get a notification of which plant needs care. I also fill in if a plant needs spraying, rotating or fertilizing. \n\nAir humidity is also important. I don't dust my plants, because you can kill two birds with one stone and spray the leaves with water, this will also remove the dust. Especially during the rest period, in winter, when you have the heater on, it is important to spray your plants a lot, especially the tropical plants. \n\nI have two types of fertiliser, one for green houseplants and one for cacti/succulents. You also have fertilisers specifically for blooming houseplants but in my experience you can use the green plants one for this as well. \n\nYou mentioned that plants need a sunny spot, which is true. But you should always check whether your plant can withstand direct sunlight. I've found only a few plants that like to be fried, most plants only want to be warmed up and need indirect sunlight. It also depends on which direction your window is facing. If you have a shadow plant, put it a few meters away from the window. \n\nLastly, look at how your plant is multiplying. Sometimes you get get baby plants that you can take out of the pot and put in another one, or gift to a friend. My bromelia is currently growing babies and I'm so proud of her! 😁😁\n\nSorry for the long post, plants just really make me happy in these troubling times.",
            "title_similarity": "0.6275365",
            "sentiment_compound": 0.9934
        },
        {
            "id": "gzdxnlq",
            "score": 1,
            "text": "Gotta send this to my sister as she have poor watering habits and she always place her plants in the wrong location. Her plants don’t get enough sunlight. Ugh.",
            "title_similarity": "0.71781635",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gze27lw",
            "score": 1,
            "text": "Thanks for all the advice! Unrelated, but when I was a kid, I had a cactus and watered it once a week. That was way too often and it died by rotting from the inside.",
            "title_similarity": "0.74935746",
            "sentiment_compound": -0.6419
        },
        {
            "id": "gze8uv2",
            "score": 1,
            "text": "What do you recommend for those little flies that come out of the pot. After I water the pot, tiny little flies or gnats come out and are really annoying. I dont know how to get rid of them. I read putting in a mix of hydrogen peroxide and water will get rid of them, but it didn't.\nAny info would be helpful, thanks :)",
            "title_similarity": "0.75430566",
            "sentiment_compound": 0.9063
        },
        {
            "id": "gzfb1hi",
            "score": 1,
            "text": "Is there a perfect water saturation percentage?",
            "title_similarity": "0.18645708",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzgsq80",
            "score": 1,
            "text": "Just get a soil moisture, ph and light test probe. After your results you're left to guess how much fertilizer to add in what frequency.  Less than 20 bucks anywhere that sells them. Takes most of the guess work out of the equation.",
            "title_similarity": "0.55061865",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzjpq10",
            "score": 1,
            "text": "I learned this the hard way trying to grow salad cress!",
            "title_similarity": "0.55958474",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gzkzm14",
            "score": 1,
            "text": "Lmao I see now y'all are handing out the valuable garden knowledge. I really wanted a Peace Lilly I think its called? as a house plant from that one study they were doing about using plants to filter toxic materials in space, but practically all the houseplants are toxic to cats (and my cat tears apart boxes, plants, anything great) The wind was blowing over a new begonia I got, and it looks already a little over fertilized\n\nso a couple things it was getting burned, too much light, not enough light, I know about the environmental shock from aquariums but your repotting advice still helps me here because I didn't think about that specific part of the shock... I was just going to repot because the wind was hitting it and knocking it over but I have it in a better spot now\n\nI still have two hanging orchids and I talked to the nursery about the ones with roots in the air, they said water twice a day so I just spray the roots? they bloomed more for awhile but they stop blooming naturally and hibernate right , those seem healthy and green\n\nthe dragon wing begonia im struggling with though, getting hit by pests, probably watering it too little, there's allot of fertilizer the nursery put in and it was getting burned... ill figure it out still seems healthy and all\n\nlast but not least, the most valuable thing I can ask here, ive got plants and trees with diseases potentially, I live on a nursery now, some of them can be taken care of but some may need to be treated\n\nim trying to bring back this one tree and the dragonflies and others seem to love but it looks like it has white mold under the leaves? maybe some aphid or insect? is there some natrual way to protect outdoor plants because ive lost entire gardens to pests and plagues before\n\nanyway if you see this those are all my follow up questions, or if anyone else does thanks, if not ill ask my friend who grows, my friends have my reddit handle now as do other people so im in the danger zone there hahaha",
            "title_similarity": "0.7800574",
            "sentiment_compound": 0.993
        },
        {
            "id": "gznnl5e",
            "score": 2,
            "text": "I just wanted to drop in and share another watering guide with tips and tools for the best watering methods. It obviously varies per plant and it can make allll the difference. https://www.plantz.com/blog/plantz-guide-watering-for-success/?utm=reddit",
            "title_similarity": "0.6337575",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1oome4",
            "score": 1,
            "text": "Yep. This is me. I just want to give them a drink!",
            "title_similarity": "0.2240142",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h2qs5d0",
            "score": 1,
            "text": "Jokes on me, I was underwatering my moms plants due to all of these tips.  After her vacation she said I needed ot water more ha.",
            "title_similarity": "0.75983167",
            "sentiment_compound": 0.25
        }
    ]
}