{
    "LPT: Don't answer those social media posts like, \"Your first car, first street you lived on and first dog is your rock star name\" Countless people are sharing these and answering them without realizing it is security questions 101 for all of your online banking and many other security measures.\n": [
        {
            "id": "gzn6osh",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.37923998",
            "sentiment_compound": 0.9615
        },
        {
            "id": "gznlhrb",
            "score": 0,
            "text": "I do extend the question with an usual answer.\n\nSo for exemple, in french they usually write \"what is your favorite instrument\" (in english they probably write \"musical instruments\" which make this idea not work in that case).\n\n\"Instrument\" is also a synonym of tools. So... Good luck trying a musical instruments as my answer.",
            "title_similarity": "0.42091525",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gzniwus",
            "score": 0,
            "text": "I just write \"yes\"",
            "title_similarity": "0.018688515",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gznga36",
            "score": 10,
            "text": "You know you’re not actually supposed to put in the actual answers for those security questions, right? All that information is easy to obtain. The question is supposed to be a prompt for you to remember whatever nonsense answer you put in.",
            "title_similarity": "0.48012018",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gznjp9f",
            "score": 0,
            "text": "Jokes on you.  My first girlfriend is my hand",
            "title_similarity": "0.3883031",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzoeoy1",
            "score": 0,
            "text": "Ah yes, I remember my dog 34xxpgPTu2ST%t who lives at pH8pYSB!qt3%TT street. Recovery questions are such a clunky and outdated way to handle security, nobody even remembers this stuff. When I do have to use them, I just generate random passwords like from the example above, then store them in my password manager along with the corresponding question.",
            "title_similarity": "0.7884085",
            "sentiment_compound": 0.784
        },
        {
            "id": "gzoibte",
            "score": 0,
            "text": "Ford, Glenrock Drive, Ralph",
            "title_similarity": "0.19398853",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqmzod",
            "score": 0,
            "text": "oh shit my kindergarten teacher is gonna break into my bank account",
            "title_similarity": "0.6215737",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gznbhwx",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.017717285"
        },
        {
            "id": "gzos6pp",
            "score": -1,
            "text": "Someone already knows your security questions. they are an absolute joke and if you are already on social media, you are already fucked anyways. Just get mobile notifications for your banks for when someone inevitably breaks into your account so you are quick enough to contact the company. In this world you gotta be really reactive and you will be pretty good off.",
            "title_similarity": "0.7313349",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gznjo4a",
            "score": 13,
            "text": "do this all you want, the problem is not in the answers to the security questions. DON'T USE REAL ANSWERS TO THESE QUESTIONS - GET A PASSWORD MANAGER AND GENERATE RANDOM PHRASES FOR THEM. These security questions have deeper holes than just the quiz you answered.",
            "title_similarity": "0.6062959",
            "sentiment_compound": 0.34
        },
        {
            "id": "gznl8w1",
            "score": 2,
            "text": "Someone should make an astrological one like:\n\nYour credit card number, the expiration date, and the three numbers on the back are the latitude and longitude of where you'll meet your soulmate!",
            "title_similarity": "0.42598313",
            "sentiment_compound": 0.8622
        },
        {
            "id": "gzot6bk",
            "score": -2,
            "text": "Doesn't work on me... not only do I not answer those silly things, but my answers look like this:\n\nWhat's your first pet? I4GX0K7IQbh&X4mj@Gp\n\nWhat's your mother's maiden name? kNWEh33XV9y1k\\*01Aih\n\nWhat's the model of your first car? $n!6@9e&On9BpNrjp4&\n\nIt's like having extra passwords!\n\nCompanies/websites really need to stop doing this and use proper security measures... security questions are dumb and an actual security risk.",
            "title_similarity": "0.80260813",
            "sentiment_compound": 0.7644
        },
        {
            "id": "gzott5y",
            "score": -2,
            "text": "oh shit\n\nthat's a fire lpt\n\nthank you very much!!",
            "title_similarity": "0.10792835",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gznhcjh",
            "score": 38,
            "text": "Man I dont know what I would do if this \"life protip\" wasnt on this sub every single day. I'd probably wind up with all sorts of cool rapper and porn star names.",
            "title_similarity": "0.5701909",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznmfuz",
            "score": 3,
            "text": "I tell people this constantly. They reply with:\n\n\"But it's fun!\"",
            "title_similarity": "0.12946388",
            "sentiment_compound": 0.6948
        },
        {
            "id": "gzngzcr",
            "score": 14,
            "text": "Nice to see one post a day about this so we don't fall for it...",
            "title_similarity": "0.26915652",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzng5ix",
            "score": 6,
            "text": "my god...I wish i could get people to understand this.",
            "title_similarity": "0.18930422",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gznkb2x",
            "score": 5,
            "text": "Cannot stress this tip enough! My nephews are so addicted to these online personality quizzes and it makes me cringe just thinking about it! I tried to explain to them why it’s not a good idea and their mom (my sister) went off on me on how they’re not my kids so I should shut up. 🙄🙄🙄",
            "title_similarity": "0.65958977",
            "sentiment_compound": -0.1675
        },
        {
            "id": "gznekw2",
            "score": 6,
            "text": "Is this real? I've never seen one of these posts.",
            "title_similarity": "0.32010838",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznjqc6",
            "score": 7,
            "text": "I had a friend of mine tell me a long time ago, use the same answer for all security questions you ever have to answer. Make sure its obscure and completely unrelated to you or anything about you. Then it won't matter what the question is, you'll always know the answer.\n\nAn example would be using \"pomegranate matchstick\" as your answer.\n\nMother's maiden name? \"pomegranate matchstick\"\n\nThen, even if someone does successfully Phish these details from you with social media posts or whatever. As long as you never use \"pomegranate matchstick\" for anything else, you'll be just fine.",
            "title_similarity": "0.7057501",
            "sentiment_compound": 0.8963
        },
        {
            "id": "gznao0e",
            "score": 339,
            "text": "LPT: Don't use Facebook",
            "title_similarity": "0.36664695",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznjbrx",
            "score": 9,
            "text": "How bout just stop sharing your life and pretending",
            "title_similarity": "0.29076692",
            "sentiment_compound": 0.25
        },
        {
            "id": "gznay70",
            "score": 32,
            "text": "According to my bank, my first car was a rare imported sports car. IRL: Used Ford Escort.",
            "title_similarity": "0.5330374",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzneabl",
            "score": 40,
            "text": "You shouldn’t answer them anyways because nobody but you cares.",
            "title_similarity": "0.39050168",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzneqmh",
            "score": 16,
            "text": "that's why you always set completely random and unrelated answers for those \"security questions\" and store everything in a password manager.",
            "title_similarity": "0.7028237",
            "sentiment_compound": 0.34
        },
        {
            "id": "gznl6m4",
            "score": 36,
            "text": "i stg i see this exact post on here like twice a week",
            "title_similarity": "0.22292441",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzno0r2",
            "score": 35,
            "text": "Oh boy do I have a story for you. \n\nWhen I was a kid (maybe 13? 14?) I was in the boy scouts, and my dad, who worked in finance, was our troops “banker”. When we went to summer camp, parents would give their kids money, but the money was kept with the banker - so kids would pace themselves and not blow all their cash on candy day 1.  My dad also put an educational spin on this by not just remembering kids names/faces, but making them have a password in order to access their $. \n\nNow boy scouts is kinda weird because there is a wide age group, and I really thought some of the 16 year old guys were super cool, so I tried to hang with them a lot. Anyway, one day we are sitting around and they say, “hey OldDogWater, wanna play the question game?” \n\nI of course say yes, and they proceed to ask me various questions, stuff like “what’s your favorite color” or “what’s your mother’s maiden name”. Etc. I thought the game was boring but whatevs I’m just chillin.\n\nThe next day, I go find my dad, the banker, and ask to take out $20. Banker opens up the security box and says “oh, you don’t actually have any funds? You withdrew all your funds yesterday!” \n\nEventually I piece together what happened. I probably told dad how dumb it was for me to need to answer his security questions when he knows who I am earlier on in the trip. He decides to setup this trick with the other guys. They got my info, took my cash, and my dad must have thought it was the funniest shit ever. And no, they did not give me back my money at the end, so lesson well learned. \n\nNeedless to say I take security pretty seriously these days lol",
            "title_similarity": "0.6792037",
            "sentiment_compound": 0.9876
        },
        {
            "id": "gznauuf",
            "score": 404,
            "text": "that data is also ran against unknown data points to find matches so even if you are anon here, vpn there, and whatnot they can align the matches over time. \n\nthey all buy and sell your data and anything you say anywhere can be matched somewhere else revealing ALL the accounts you thought were anon. \n\nthere are less than 8 billion people and a computer can sort out exactly who is who, and even one day may be able to apply attribution retroactively. \n\nlots of data is kept in backend places.\n\ndon't answer questions about your personal life on the internet.",
            "title_similarity": "0.68183494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzncpwq",
            "score": 48,
            "text": "Jokes on them. I can't even get those answers right.",
            "title_similarity": "0.25420672",
            "sentiment_compound": 0.25
        },
        {
            "id": "gznekad",
            "score": 410,
            "text": "Security questions are a fucking disaster; they need to die yesterday. We've known it for years and they still won't go away. They are one of so many bad security practices that have become enduring norms because they get carried from one site to another by cargo cult. Quit this shit already!\n\nIf you are forced to fill in security questions, a good way to make them less shitty is to use random strings or passphrases and save them in your password manager.\n\nreferences:\n\n[Wired - Time to Kill Security Questions](https://www.wired.com/2016/09/time-kill-security-questions-answer-lies/)\n\n[security.stackexchange.com - Do security questions make sense?](https://security.stackexchange.com/questions/186297/do-security-questions-make-sense)\n\n[Better Programming - Security Questions are a Terrible, Horrible, Bad Idea](https://betterprogramming.pub/security-questions-are-a-terrible-horrible-bad-idea-da108e303240)",
            "title_similarity": "0.71187556",
            "sentiment_compound": -0.9587
        },
        {
            "id": "gzn8tog",
            "score": 1866,
            "text": "Yup so always have the answer be \"ANSWER\"",
            "title_similarity": "0.14293836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznc9mu",
            "score": 2144,
            "text": "I have a series of totally fake but meaningful to me answers for all of those standard questions. The bank wants to know what my mom's maiden name is? Well, I'm not giving them that information, so I have a fully fake made-up answer that I use instead. I also do that for pets, streets I've lived on, etc.\n\nThe answers to those questions don't have to be correct, they just have to be answers that YOU will remember when asked.",
            "title_similarity": "0.74284613",
            "sentiment_compound": -0.5178
        },
        {
            "id": "gznet0u",
            "score": 145,
            "text": "Your Star Wars droid name is the your mother's maiden name + the last 4 digits of your social security number.",
            "title_similarity": "0.6000526",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gznbglb",
            "score": 5608,
            "text": "\"Your Rock Star name is your mother's maiden name, the first five numbers of your SIN, your full address, the last four numbers of your SIN, the full name on your credit card, the first 8 digits of your credit card number, the three numbers on the back of your credit card, then the last 8 digits of your credit card number.\"\n\nHmm... seems legit.",
            "title_similarity": "0.5647454",
            "sentiment_compound": 0.0859
        },
        {
            "id": "gznbr12",
            "score": 1,
            "text": "I dunno.  Gremlin Maple Scruffy doesn't seem like a very good rock star name.",
            "title_similarity": "0.45997903",
            "sentiment_compound": 0.2693
        },
        {
            "id": "gzne8sj",
            "score": 1,
            "text": "Your last 3 addresses and your mothers maiden name is the name of your spaceship! Go!",
            "title_similarity": "0.4897644",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzngw6o",
            "score": 1,
            "text": "An even bigger tip is to just not use social media sites like Facebook.",
            "title_similarity": "0.5672793",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gznh0fb",
            "score": 1,
            "text": "I wish I hadn’t joined in with that “what your three digit security number on the back of your card says about you” game now!",
            "title_similarity": "0.5578972",
            "sentiment_compound": 0.69
        },
        {
            "id": "gznh76m",
            "score": 9,
            "text": "This advice makes no sense.\n\n\"626 6th Fido\" is a terrible rock star name.",
            "title_similarity": "0.45441192",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gznhaq7",
            "score": 1,
            "text": "My dad has a cousin who answers these all the time. My favorite is one that popped up on my feed that said \"Your vagina is named after the last TV show/movie you watched, what is it?\"\n\nHer response: \"movie\"",
            "title_similarity": "0.5645496",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gznhro5",
            "score": 3,
            "text": "It's hard to believe people are this dumb",
            "title_similarity": "0.16561005",
            "sentiment_compound": -0.6457
        },
        {
            "id": "gznhyy2",
            "score": 1,
            "text": "Joke's on them, I can't remember anything!",
            "title_similarity": "0.26372212",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznii0j",
            "score": 1,
            "text": "But I don't use any of these as my passwords, they will just be fooled by themselves!",
            "title_similarity": "0.556807",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gznivra",
            "score": 1,
            "text": "Damm never really thought about this. I also never did these anyways. Got to share this tho for all those poor souls so have done this tho",
            "title_similarity": "0.59489185",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gznj4pp",
            "score": 2,
            "text": "And people get surprised about their info getting hacked it the \"government\" tracking them",
            "title_similarity": "0.52772045",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gznj9li",
            "score": 1,
            "text": "Honestly it's way more secure to answer something random for your security question anyway.",
            "title_similarity": "0.2251622",
            "sentiment_compound": 0.796
        },
        {
            "id": "gznjuv0",
            "score": 1,
            "text": "The real trick is you never answer security questions accurately. If someone wants to dig, they can probably find the answers. If you just have one really odd answer you use for everything then you always have your security question answer and there’s no chance of someone sleuthing it.\n\nWhat was your first car? Potato. What’s your mother’s maiden name? Potato. What street did you grow up on? Potato.",
            "title_similarity": "0.75688374",
            "sentiment_compound": -0.5732
        },
        {
            "id": "gznjy3d",
            "score": 1,
            "text": "I personally answer secret question with very long none sense sentences. That I remember, but that no one would ever guess. \n\nSo that way, even people that knows my car, school or what ever life story cannot answer my secret questions. \n\nI think that’s the safest way to go.",
            "title_similarity": "0.68133473",
            "sentiment_compound": 0.1719
        },
        {
            "id": "gznjyrf",
            "score": 1,
            "text": "My mom answers these on FB all the time and I cannot get her to take this seriously.",
            "title_similarity": "0.5975498",
            "sentiment_compound": -0.2204
        },
        {
            "id": "gznkgi7",
            "score": 1,
            "text": "Tip: always answer security questions with either an inside joke or better yet some gibberish generated by a password manager",
            "title_similarity": "0.60453385",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gznl9ph",
            "score": 1,
            "text": "All of my security questions are randomly generated strings and numbers like any other password.",
            "title_similarity": "0.5740331",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gznlgok",
            "score": 8,
            "text": "Great advice and it makes perfect sense. But I am curious to find an example of this actually being employed as I see plenty of articles with this warning but no specific cases.",
            "title_similarity": "0.46293655",
            "sentiment_compound": 0.1091
        },
        {
            "id": "gznlivd",
            "score": 1,
            "text": "Yeah thats great advice for ten years ago",
            "title_similarity": "0.12186404",
            "sentiment_compound": 0.743
        },
        {
            "id": "gznllw9",
            "score": 1,
            "text": "I’m friends with my company head of fraud and she fell hook line and sinker for one of these. Literally could have logged into her bank with the info she provided. I messaged her and she took it down, with a red face of course.",
            "title_similarity": "0.58537555",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gznln8a",
            "score": 1,
            "text": "I think most people are wise to it. I mean, it’s so obvious. That’s why I lie like a bear rug on those.",
            "title_similarity": "0.27727598",
            "sentiment_compound": 0.7063
        },
        {
            "id": "gznlvox",
            "score": 6,
            "text": "Joke's on them; my first crush, my school, and my first pet all have the same name 😎",
            "title_similarity": "0.5222539",
            "sentiment_compound": 0.34
        },
        {
            "id": "gznm0vw",
            "score": 18,
            "text": "I swear I saw the same post yesterday. Karma-whoring seems like a profession nowadays.",
            "title_similarity": "0.3950806",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznm5jg",
            "score": 1,
            "text": "Damn this is actually dangerous",
            "title_similarity": "0.068651155",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gznm5m8",
            "score": 1,
            "text": "That’s so funny. People are like, I wanna share my personal info because attention on the internet",
            "title_similarity": "0.42243963",
            "sentiment_compound": 0.7841
        },
        {
            "id": "gznmq56",
            "score": 3,
            "text": "This is an interesting topic. Does anyone have any evidence that answering these questions has led to account break ins, or is this more of better safe than sorry situation?",
            "title_similarity": "0.39802355",
            "sentiment_compound": 0.829
        },
        {
            "id": "gznmurx",
            "score": 1,
            "text": "Askreddit checks out",
            "title_similarity": "0.10008312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznmus6",
            "score": 2,
            "text": "They were huge about 15 years ago. I haven't seen one since I deleted my Facebook account years ago.",
            "title_similarity": "0.61034566",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznn1eo",
            "score": 1,
            "text": "I lie, all the time, on those.   \nMothers Maiden Name: RackofRibs  \nStreet I lived On: ISawAGoat  \nFirst Dog: CatIsNotDog  \n\n\nEtc. It's an answer, just a gibberish answer. Who cares?  \n\n\nAlso, I just don't participate in those posts, or if I do it's verbally and I just tell my wife \"Hey! Your fantasy name is Big Moon Head! HA HA HA!\"",
            "title_similarity": "0.7459266",
            "sentiment_compound": 0.8791
        },
        {
            "id": "gznn5ah",
            "score": 1,
            "text": "Answering with the wrong answer is so much fun though.\n\nPontiac Aztec.\nGay way.\nDisgruntled distributor.",
            "title_similarity": "0.47225183",
            "sentiment_compound": 0.1226
        },
        {
            "id": "gznn8sv",
            "score": 1,
            "text": "I don’t remember the real answers.. how could I possibly remember fake ones?",
            "title_similarity": "0.26244855",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gznnew1",
            "score": 1,
            "text": "LPT: don't use the actual answer for these security questions. When you are given something like \"what is your mother's maiden name?\" Don't use her actual maiden name as the answer, generate a random password for it and store the password somewhere. I generate a random password and store each one in the notes section of that profile on LastPass.",
            "title_similarity": "0.69896823",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gznngdu",
            "score": 1,
            "text": "Don't even post your full name online",
            "title_similarity": "0.4422823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznngqw",
            "score": 1,
            "text": "If you’re on the intellectual level to be sharing those details you probably won’t get this tip anyway.",
            "title_similarity": "0.22208019",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gznnisf",
            "score": 3,
            "text": "For all security questions I use something similar.  So when they ask my first car I put the color of my first car.  When they ask my first pet I put my favorite animal.  Any question related to a family member is a common phrase I associate with my family.",
            "title_similarity": "0.62154996",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gznnwdh",
            "score": 1,
            "text": "Moms maiden name? 42",
            "title_similarity": "0.2615181",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzno2xf",
            "score": 1,
            "text": "I dunno, Cavalier Jolly Acres Brandy sounds like they rip.",
            "title_similarity": "0.25151646",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gznobun",
            "score": 1,
            "text": "Same ones on LinkedIn for God's sake!",
            "title_similarity": "0.16104718",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznofx1",
            "score": 1,
            "text": "Like I always say, people are fucking stupid.",
            "title_similarity": "0.28878355",
            "sentiment_compound": -0.2944
        },
        {
            "id": "gznoyzd",
            "score": 1,
            "text": "Jokes on them, I treat those questions like a backup password and the answers do not match at all.",
            "title_similarity": "0.58459514",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gznp0td",
            "score": 1,
            "text": "Nope! Not mine! Mine are Delta 88, Kent St, and Shadow--uh... oops.",
            "title_similarity": "0.24710105",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznpc4s",
            "score": 1,
            "text": "Is there evidence that this has actually been used as an attack vector, or is this just hand wringing?",
            "title_similarity": "0.24292156",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gznpdi0",
            "score": 1,
            "text": "LPT: Don't do anything else on social media other than liking family and friend pics and posts.",
            "title_similarity": "0.57950336",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gznpdpu",
            "score": 1,
            "text": "Agreed. Btw comment your Mothers maiden name along with your first pets name to see your  rapper moniker!",
            "title_similarity": "0.562294",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gznpkq9",
            "score": 1,
            "text": "Fuck i used to do that stupid shit back in high school. Glad I’m not addicted to social media anymore.",
            "title_similarity": "0.5707506",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gznpktr",
            "score": 1,
            "text": "I never answer any that I use as those kinds of security questions. Idk why but whenbi see \"moms maiden name\" I like bro do you know how many people know that information? Why would I choose that? \n\nThat's why it baffles me that you aren't allowed to make your own questions.",
            "title_similarity": "0.7101285",
            "sentiment_compound": 0.6261
        },
        {
            "id": "gznpoc6",
            "score": 1,
            "text": "some people are watching too much Mr. Robot...",
            "title_similarity": "0.32753077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznpr0f",
            "score": 1,
            "text": "Yeah, aren’t these just fronts for hyper specific data collection and triangulation on other data sets collected on you? Like those damn Facebook quizzes.\n\nFolks can predict with stunning accuracy your political leanings literally from as small a data set as your toothpaste preferences and what movies you’ve seen recently. That’s paraphrased from a statistics article I read years ago but holds up against the statistical data I’ve encountered so far.",
            "title_similarity": "0.70287836",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznq3lp",
            "score": 1,
            "text": "At least Reddit does something to fight thieves, like censoring my password whenever I write it, for example *******",
            "title_similarity": "0.59292394",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gznq735",
            "score": 1,
            "text": "It’s amazing to me how absolutely stupid people are being in answering these questions. It’s honestly shocking. Unless of course you enjoy having your identity stolen. Or your accounts hacked.",
            "title_similarity": "0.4800008",
            "sentiment_compound": -0.3167
        },
        {
            "id": "gznq9lf",
            "score": 1,
            "text": "Pretty sure this is how those Celebs got their accounts hacked only it was all the interviews they’ve done.",
            "title_similarity": "0.6094216",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gznqeh9",
            "score": 1,
            "text": "I swear i saw this exact post like 2 days ago",
            "title_similarity": "0.25542715",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznqrap",
            "score": 1,
            "text": "Well then. I’m screwed",
            "title_similarity": "-0.03709288",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gznqsnm",
            "score": 1,
            "text": "Yugo, Sesame, Boston Dynamics Spot",
            "title_similarity": "0.22862692",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gznqtng",
            "score": 1,
            "text": "The best advice I ever got for security questions is make the first part normal then the rest of the sentence super outlandish like “Mr Johnson licked a dog’s prolapsed anus”",
            "title_similarity": "0.54653156",
            "sentiment_compound": 0.9231
        },
        {
            "id": "gznqul9",
            "score": 1,
            "text": "I answer my security questions incorrectly so that nobody who knows me can figure them out (including myself unfortunately)",
            "title_similarity": "0.5657552",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznqwva",
            "score": 1,
            "text": "I like Reddit's password protection, if you type your reddit password in the comments it comes out as ***s\n\nHere's mine:\n\n`*****************`\n\nSee?",
            "title_similarity": "0.4195783",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gznqy6e",
            "score": 1,
            "text": "Joke on them I have another \"password\" I use for those questions instead of the answer they ask for.",
            "title_similarity": "0.49051347",
            "sentiment_compound": 0.296
        },
        {
            "id": "gznr1gs",
            "score": 1,
            "text": "My first dogs name was lickmy22dogsbutthole69 and it seems to work well.",
            "title_similarity": "0.37281138",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gznrf4p",
            "score": 1,
            "text": "It’s a good thing I always lie",
            "title_similarity": "0.27764112",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gznrfx6",
            "score": 1,
            "text": "Just blatantly tell them that your password is password.",
            "title_similarity": "0.34782043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznrg0l",
            "score": 1,
            "text": "How else am I supposed to find out which Hogwarts house my credit card number would be in?",
            "title_similarity": "0.47991776",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gznrgcf",
            "score": 1,
            "text": "My password is the same as my luggage.",
            "title_similarity": "0.22045039",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznribj",
            "score": 1,
            "text": "AskReddit is probably the biggest of these in the English speaking internet. It's a social engineers playroom over there.",
            "title_similarity": "0.4435451",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznrl90",
            "score": 1,
            "text": "It also helps to not be an 11 year old who would be the only reasonable ones answering this question in the first place.",
            "title_similarity": "0.38714567",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gznrn8z",
            "score": 1,
            "text": "The trick is to not use your real life details for any of those backup questions. It’s way too easy to get those details through any number of other means, especially if the person knows you. Use fictional ones and commit them to memory.",
            "title_similarity": "0.47240984",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gznrtrk",
            "score": 1,
            "text": "Mini Dick Fister",
            "title_similarity": "0.15772963",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gznry2s",
            "score": 1,
            "text": "But how else will I know my stripper name?",
            "title_similarity": "0.37420696",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzns0of",
            "score": 1,
            "text": "… And data collection to harvest and create another psychological profile of you",
            "title_similarity": "0.15385313",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzns4fz",
            "score": 1,
            "text": "LPT: Purposely answer them wrong.",
            "title_similarity": "0.2167706",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzns6m3",
            "score": 1,
            "text": "I’ve been answering them with ridiculous sarcastic responses",
            "title_similarity": "0.2853585",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gznsi69",
            "score": 1,
            "text": "Yea I picked up on that when they were doing the birthday/sign thing and then that.....ummm no",
            "title_similarity": "0.34550902",
            "sentiment_compound": -0.296
        },
        {
            "id": "gznslf8",
            "score": 1,
            "text": "I haven't seen those \"security questions\" recently. It seems to have become common knowledge that this is not safe info.",
            "title_similarity": "0.4530364",
            "sentiment_compound": -0.5334
        },
        {
            "id": "gznsq5q",
            "score": 1,
            "text": "I treat those polls (and always have) like I treat new people in bars. They get the fantasy stories. Friends are welcome to know me. It takes a while for me to trust.",
            "title_similarity": "0.43173325",
            "sentiment_compound": 0.946
        },
        {
            "id": "gznsrgt",
            "score": 1,
            "text": "Unpopular opinion: If your bank account is secured by knowing the name of your dog, you deserve every attack you get.",
            "title_similarity": "0.62160933",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gznsrul",
            "score": 1,
            "text": "I answer in my head and move along",
            "title_similarity": "0.011980806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznss9q",
            "score": 1,
            "text": "Beetle Beech Betty!",
            "title_similarity": "0.20009422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznssim",
            "score": 1,
            "text": "My mother's maiden name is not the name I tell credit card companies. So when I have to call, I say the fake name, problem is I have two fake names I give them. They're both ridiculous, one is Lemonjello, the other even more ridiculous.\n\nSo I just say \"well, her real last name is Smith, but I told you something ridiculous, so it's X or Y.\" and they alwaya say it's whatever ridiculous name I provided them. And they always have a laugh.",
            "title_similarity": "0.69044113",
            "sentiment_compound": -0.7047
        },
        {
            "id": "gznst0z",
            "score": 1,
            "text": "And we'll add this LPT to the list of \"things posted here that get upvoted a lot, but will not be seen by anyone who actually needs to see it.\"",
            "title_similarity": "0.50689346",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznsu8d",
            "score": 1,
            "text": "So I shouldn't tell people my favorite food is dick?",
            "title_similarity": "0.45779917",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gznsy8y",
            "score": 1,
            "text": "For everyone saying we shouldn’t put an actual answer, how do I switch over? I can’t change the answers I’ve already put in right?",
            "title_similarity": "0.43502617",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznt9cv",
            "score": 1,
            "text": "Your social security number, mother’s maiden name, and your bank’s routing and account numbers is your new 80’s techno band name. Please post results below!\n\n*sent from Nigeria*",
            "title_similarity": "0.5335027",
            "sentiment_compound": 0.6476
        },
        {
            "id": "gzntaq8",
            "score": 1,
            "text": "Your porn star name is the first name of the main character in the last book you read followed by your entire SSN. Post yours below!",
            "title_similarity": "0.64737594",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzntje8",
            "score": 1,
            "text": "I use the same word for all of my security questions.  It's just a random word that has nothing to do with any of the answers.  Someone could data mine me for eternity and never find the answers.",
            "title_similarity": "0.64132035",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzntmjf",
            "score": 1,
            "text": "Pretty sure everyone under the age of 60 knows this",
            "title_similarity": "0.100148164",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gznttzd",
            "score": 1,
            "text": "One of my friends from prettying much elementary school. She's is full on suburban mom doing a bunch of corny suburban mom stuff on Facebook and she constantly does those.",
            "title_similarity": "0.61815023",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzntxw4",
            "score": 1,
            "text": "LPT: Don’t use social media",
            "title_similarity": "0.35653958",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznu45m",
            "score": 1,
            "text": "Jokes on you, I lie on all my security questions.",
            "title_similarity": "0.5759392",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gznu5a9",
            "score": 1,
            "text": "So my rockstar name isn’t Honda Honde Hondu?",
            "title_similarity": "0.4352399",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznu6ls",
            "score": 7,
            "text": "Don't use actual real answers for security question.  Grandma's name? Moses.  First car? Starship Enterprise.  Make the answers up.",
            "title_similarity": "0.6726617",
            "sentiment_compound": 0.4137
        },
        {
            "id": "gznu74g",
            "score": 1,
            "text": "You have no clue how many texts I have sent to aunties BEGGING them to stop doing this then calling me to fix the fact that their info got stolen, AGAIN.",
            "title_similarity": "0.6939317",
            "sentiment_compound": -0.765
        },
        {
            "id": "gznuf0w",
            "score": 1,
            "text": "This just reminds me of the train level with the crows in A Hat in Time",
            "title_similarity": "0.25125068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznught",
            "score": 1,
            "text": "Man, if you fall for these things, then honestly you deserve what comes your way.",
            "title_similarity": "0.09528403",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gznugqi",
            "score": 1,
            "text": "That's why my answer for every one of those questions is butthole",
            "title_similarity": "0.37008733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznuifm",
            "score": 1,
            "text": "First car: a nice one\n\nFirst street I lived on: no history of homelessness\n\nFirst dog: adorable but overweight",
            "title_similarity": "0.5879599",
            "sentiment_compound": -0.2144
        },
        {
            "id": "gznuo7o",
            "score": 6,
            "text": "Do answer, but always lie",
            "title_similarity": "0.2927268",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznuxlp",
            "score": 1,
            "text": "Better security is to have an encrypted database and write bogus answers for your security questions.",
            "title_similarity": "0.42024124",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gznuz8y",
            "score": 1,
            "text": "Can confirm, I've kidnapped 100's of people using these techniques",
            "title_similarity": "0.48175287",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznv0ke",
            "score": 1,
            "text": "I just use fake answers. It's much easier to secure.\n\nAnyway, I can never remember the real answers to half those questions anyway. Favorite food?? Seriously?",
            "title_similarity": "0.4603148",
            "sentiment_compound": 0.6046
        },
        {
            "id": "gznv1il",
            "score": 1,
            "text": "Natural selection",
            "title_similarity": "-0.053623527",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gznv4z0",
            "score": 2,
            "text": "LPT: Don't put actual answers in any of those fields.\n\nI use random strings generated by Lastpass and store it in the notes section of Lastpass for that site. \n\nAlso... Why are adults doing this? It's like something I would do when I was 12 on Myspace. Are they going to start asking A/S/L too?",
            "title_similarity": "0.7308237",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gznv65l",
            "score": 1,
            "text": "What application still uses these queations?",
            "title_similarity": "0.036801457",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznv8wy",
            "score": 1,
            "text": "People act like they give a shit about privacy but then will enter every personal detail to find out what kind of flatbread they are",
            "title_similarity": "0.6008869",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gznvdt5",
            "score": 1,
            "text": "And captcha’s are just being used to train self driving automobiles of all types.",
            "title_similarity": "0.5017616",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznved6",
            "score": 1,
            "text": "If you aren't on 2FA, I assume you're a bad service with bad cybersrcurity values",
            "title_similarity": "0.34686473",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gznvhgx",
            "score": 1,
            "text": "That's why I always give stupid answers",
            "title_similarity": "0.3666596",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gznvhoo",
            "score": 1,
            "text": "Back before I cut Facebook out of my life... I would see that chain-mail list of 25 things people didn't know about you.  I would warn people every time, and see people reply like \"Oh shit, I didn't realize that... that's crazy and so true.\"  And then the next month the SAME people would be sharing it again.",
            "title_similarity": "0.7408221",
            "sentiment_compound": -0.0276
        },
        {
            "id": "gznvp52",
            "score": 1,
            "text": "Let's make out porn star names. It's the first half of your credit card number. The three digits on the back. And the the last half of your credit card numbers. \n\nPost it below lol!",
            "title_similarity": "0.5776097",
            "sentiment_compound": 0.8221
        },
        {
            "id": "gznvqss",
            "score": 1,
            "text": "Social engineering at its finest.",
            "title_similarity": "-0.0041641807",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznvrmi",
            "score": 1,
            "text": "People on here be recommending random answers and shit where you NEED to answer those questions. How about not \"playing\" those games on Facebook?",
            "title_similarity": "0.6190481",
            "sentiment_compound": -0.636
        },
        {
            "id": "gznvw29",
            "score": 1,
            "text": "My husband and I were both in the military and the sites we need to have accounts on are rife with these types of questions.\n\nHe will always pick the top three suggestions and just answer with a combination of curse words lol",
            "title_similarity": "0.59692633",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gznw7qr",
            "score": 1,
            "text": "Your AMONG US name:\n\nYour mom's credit card number\n\nHer billing zip code\n\nThe 3 numbers on the back",
            "title_similarity": "0.5262606",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gznwb1d",
            "score": 1,
            "text": "Most places let you choose your security questions. I do, then answer them like my spouse would.",
            "title_similarity": "0.46752957",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gznwlhn",
            "score": 1,
            "text": "Don't answer quizzes in general.",
            "title_similarity": "0.27836543",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznwstw",
            "score": 1,
            "text": "If your password is something that you can answer in those posts you need to rethink your password game.",
            "title_similarity": "0.46408308",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznwwgr",
            "score": 1,
            "text": "Your cool robot name is your mother's maiden name and last 4 digits of your social",
            "title_similarity": "0.5424724",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznwxc0",
            "score": 1,
            "text": "If you're that stupid ... you almost deserve it",
            "title_similarity": "0.051060345",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gznx1lz",
            "score": 1,
            "text": "Well this is it folks. Reddit is now boomerfied.  It was a good 10 years though.",
            "title_similarity": "0.24525672",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gznx1yj",
            "score": 1,
            "text": "i can't believe people still fall for this shit.",
            "title_similarity": "0.2920525",
            "sentiment_compound": -0.6428
        },
        {
            "id": "gznx2qg",
            "score": 1,
            "text": "I lie on my real security questions.",
            "title_similarity": "0.3889406",
            "sentiment_compound": 0.34
        },
        {
            "id": "gznx6wn",
            "score": 1,
            "text": "You gotta be the most gullible person to fall for that.",
            "title_similarity": "0.23649827",
            "sentiment_compound": -0.4201
        },
        {
            "id": "gznx7hg",
            "score": 1,
            "text": "It's just social media tricking you into helping them data mine you.",
            "title_similarity": "0.49655566",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznx7qc",
            "score": 1,
            "text": "If it's stupid republicans then let them do it. Freedumbs!",
            "title_similarity": "0.28982586",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gznx9m6",
            "score": 1,
            "text": "One of my favorite security questions is \"Who is your favorite superhero?\"\n\nBut instead of the hero name, I put the secret identity.",
            "title_similarity": "0.54189646",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gznxam7",
            "score": 1,
            "text": "I fucking hate security questions. If I want extra security I want proper two factor authentication, not some generic questions that anyone who knows me can figure out. Why is this abomination still around?",
            "title_similarity": "0.5983434",
            "sentiment_compound": 0.1742
        },
        {
            "id": "gznxd5n",
            "score": 1,
            "text": "Computer teacher here- I posted a quiz like this for my 4th and 5th graders, knowing full well that all of their passwords were the exact same \"favorite animal favorite color favorite number\" template.  \n\nBy the end of class, I had about 86% of the classes' passwords, and their minds were blown.  I hope they remember and carry that into adulthood.",
            "title_similarity": "0.68893766",
            "sentiment_compound": 0.9413
        },
        {
            "id": "gznxddu",
            "score": 1,
            "text": "Real LPT: Don't answer security questions honestly. Use a non-sequitur pass phrase that you will remember instead & pick something no one would care about or something that is outdated (\"Winter is Coming\"). \n\nFor my passphrase, unless you knew me when I was 14, you're not going to get it.",
            "title_similarity": "0.6312853",
            "sentiment_compound": 0.4523
        },
        {
            "id": "gznxfu4",
            "score": 1,
            "text": "LPT: Don't provide actual answers to security questions. Disregard question and put something random that you will remember and memorize.",
            "title_similarity": "0.520674",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gznxgp8",
            "score": 1,
            "text": "I feel the same way about ones that give you answers to pick from “This Month/Day/First Letter of name gives you your fantasy name!”, it feels like it’s fishing for info.",
            "title_similarity": "0.4539433",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gznxl1p",
            "score": 1,
            "text": "Jokes on them, my password is hunter2.",
            "title_similarity": "0.4297002",
            "sentiment_compound": 0.25
        },
        {
            "id": "gznxqul",
            "score": 1,
            "text": "LPT: If you want a bunch of upvotes and awards on your reddit post, just go to r/LifeProTips and just repeat what the other seven hundred posts about not answering social media posts asking about your first pet",
            "title_similarity": "0.7618995",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gznxsfh",
            "score": 1,
            "text": "Car go vroom vroom, The fuck would I know?, Doggo the 1st (may he RIP)",
            "title_similarity": "0.5650785",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gznxtjb",
            "score": 1,
            "text": "This is some thing a Boomer would fall for",
            "title_similarity": "0.1305953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznxww9",
            "score": 1,
            "text": "Jokes on them since I have a database of the bullshit responses I give to the questions for banking and I use 2FA pretty much everywhere these days.",
            "title_similarity": "0.611084",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gznxyxr",
            "score": 1,
            "text": "Don't answer those security questions with that kind of information. Just generate 10 digit passwords for each one and use a good password manager to keep track of them.",
            "title_similarity": "0.62201846",
            "sentiment_compound": 0.2177
        },
        {
            "id": "gzny6uh",
            "score": 1,
            "text": "I have been telling people on FB not to answer those stupid quizzes, yet they still answer 77 Volkswagen or their mothers maiden name plus the first car they drove is their porn name.",
            "title_similarity": "0.828907",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzny7n9",
            "score": 1,
            "text": "My first car and the house I grew up in were not in my name (1972 Ford ranch wagon, Bissonet ) - not to mention that that house has been sold a number of times after us.  My first dog's name was Floppy, who died a very long time ago.   Now tell me who I am and what bank I use.  Some answers just do not give away who you are, you just have to use common sense about which questions to answer correctly.",
            "title_similarity": "0.74301076",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gznycr5",
            "score": 1,
            "text": "tesladynamitedaisy entering the club",
            "title_similarity": "0.3609377",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznygwk",
            "score": 1,
            "text": "Holy shit... just realized this",
            "title_similarity": "-0.03793347",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gznyhsl",
            "score": 1,
            "text": "#what's your epic GNOME name???\n\n\n\nFirst name: your credit card number\n\n\nMiddle name: the expiration date\n\n\nLast name: the 3 digits on the back",
            "title_similarity": "0.5127028",
            "sentiment_compound": 0.533
        },
        {
            "id": "gznyizw",
            "score": 1,
            "text": "Look- im not going to stop people from giving their money away.  If people really are that fucking stupid- maybe they dont deserve their money.",
            "title_similarity": "0.36598197",
            "sentiment_compound": -0.104
        },
        {
            "id": "gznyled",
            "score": 1,
            "text": "LPT: Lie on the security questions, so no one can dig up the answers. Just make sure that they're lies you can remember.",
            "title_similarity": "0.5416039",
            "sentiment_compound": -0.1513
        },
        {
            "id": "gznyp80",
            "score": 1,
            "text": "I mean.. if they're that dim, it's hard to tell bad for them",
            "title_similarity": "0.063467965",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gznywsd",
            "score": 1,
            "text": "LPT: don't answer these security questions accurately. \n\n\"What was the first street name you lived in?\" hotdog193484\n\n\"Who was your first crush?\" 22timapple420\n\nThen save them to your password manager or notes.",
            "title_similarity": "0.7592105",
            "sentiment_compound": 0.2321
        },
        {
            "id": "gznyyv3",
            "score": 1,
            "text": "Should probably share this on everyones Facebook. Funny how Facebook doesn't mind the obvious phishing scam that's been going on for 10 years.",
            "title_similarity": "0.6790364",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gznz7ax",
            "score": 1,
            "text": "I’m surprised people don’t know this. There’s one on Facebook going around saying rep your elementary school.",
            "title_similarity": "0.5976139",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gznz9wk",
            "score": 1,
            "text": "Why do people have to comment that though? They can just keep them in their heads",
            "title_similarity": "0.23518872",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznzair",
            "score": 1,
            "text": "Security Questions are stupid.\n\nThey're just like passwords, but really shitty.",
            "title_similarity": "0.42965648",
            "sentiment_compound": -0.7261
        },
        {
            "id": "gznzcvb",
            "score": 1,
            "text": "Could it be the name of the him you ___?\nI’m just saying - I do that to myself all the time, and I never learn, and my clues are always three steps of mental gymnastics away",
            "title_similarity": "0.63302064",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznzd6e",
            "score": 1,
            "text": "Jokes on them, I literally don't even know the answer to those questions.",
            "title_similarity": "0.34663942",
            "sentiment_compound": 0.25
        },
        {
            "id": "gznzhfx",
            "score": 1,
            "text": "I worked at capital one 360 for a few years back in the day. That was when 360 was separate from capital one, where 360 was only an online direct bank. The questions that we would ask are exactly these. We would have to disclose that the questions were in fact public record. While they are public record, they aren’t easily obtained by others. I once had a fraudster pass with flying colors through the questions, but the fraudster didn’t fit the age demographic of who he claimed to be. He sounded way too young. Once he passed, I could have done anything he wanted me too regarding the actual customers accounts. I still transferred the call to the customer security team since I was suspicious. Two weeks later I got an award for preventing the fraudster from stealing over $30,000 from our customer. Unfortunately, that fraudster stole over $50,000 from that same customer at JP Morgan Chase.",
            "title_similarity": "0.693821",
            "sentiment_compound": -0.9319
        },
        {
            "id": "gznzkbz",
            "score": 1,
            "text": "Thankfully most systems have gone beyond security questions.",
            "title_similarity": "0.26770508",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gznzkoc",
            "score": 1,
            "text": "\"Secret questions\" themselves are insecure.  I don't know what fart noodle thought that was a good idea.",
            "title_similarity": "0.4114651",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gznzngy",
            "score": 1,
            "text": "Who the hell answers their password questions truthfully??\n\nName of fave uncle: Lady Gaga\n\n1st pet: Pizza pockets\n\nStreet you grew up on: Yes",
            "title_similarity": "0.6789015",
            "sentiment_compound": 0.504
        },
        {
            "id": "gznzqki",
            "score": 1,
            "text": "Just do what I do and answer those quizzes wrong on purpose! I literally just try to make the funniest answer when given options\n\n\"Yup my rockstar name really is Lamborgini 69 St Coolio, why do you ask?\"",
            "title_similarity": "0.58695394",
            "sentiment_compound": 0.2003
        },
        {
            "id": "gznzrs6",
            "score": 1,
            "text": "Never stopped and thought about that and now I'm a little embarrassed for not making what now seems like an obvious connection",
            "title_similarity": "0.33066374",
            "sentiment_compound": 0.2404
        },
        {
            "id": "gznzus5",
            "score": 1,
            "text": "Plus who gives a shit",
            "title_similarity": "0.022678837",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gznzy0s",
            "score": 1,
            "text": "Your teen name is your least favorite soda then your favorite soda.",
            "title_similarity": "0.4313689",
            "sentiment_compound": 0.1331
        },
        {
            "id": "gzo06r6",
            "score": 1,
            "text": "Annnnnd this is why my security questions always have random-ass answers, recorded in a password vault that’s protected with 2FA.",
            "title_similarity": "0.63508",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzo06sl",
            "score": 1,
            "text": "Jokes on them, i answer all my security questions like this\n\n7_8\"(€91646766ajjfkrjeinhaoa\n\nand save them in my Passwordmanager\n\nSecurity questions are a dumb concept and should not exist.\nPassword reset -> Email or sms\nIf you lose access to your mail or sms -> selfie holding govment id required\n\neverything else is bad security.",
            "title_similarity": "0.7566755",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzo08sy",
            "score": 1,
            "text": "Better LPT don't have easily guessable security questions - treat them the same way you do your actual password (hopefully a bit more random...)",
            "title_similarity": "0.4010903",
            "sentiment_compound": 0.8255
        },
        {
            "id": "gzo09xm",
            "score": 1,
            "text": "Same with your birthday and so many websites will actually ask you for your birthday and share it like Facebook.\n\nThe birthday I register on websites and my real birthday may or may not be the same 🤷‍♂️",
            "title_similarity": "0.59188056",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzo0em8",
            "score": 6,
            "text": "Does ANY bank actually use security questions? Hardly any online services seem to even have them anymore. Almost useless for password recovery, huge security hole.",
            "title_similarity": "0.65613997",
            "sentiment_compound": 0.5563
        },
        {
            "id": "gzo0hil",
            "score": 1,
            "text": "Damn. Good looking out. [+]",
            "title_similarity": "-0.10800646",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzo0hio",
            "score": 1,
            "text": "Modern day Darwinism. If you're putting that info on a post willingly, you're just asking to get your identity stolen?",
            "title_similarity": "0.5038791",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzo0tqb",
            "score": 1,
            "text": "i believe in openness and transparency which is why all my friends know my social #",
            "title_similarity": "0.28956848",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzo0w3x",
            "score": 1,
            "text": "Who actually answers mothers maiden name, first pet, first school etc with the actual answers? The idea is that you pick a memorable answer but it only relates to the question. Like mother maiden name, use your grandmother or aunts, first school use the street name etc",
            "title_similarity": "0.5582745",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gzo0x5o",
            "score": 1,
            "text": "I always give different answers to those security questions. The truth would be easy to find out but no one's going to get me to say the weird answers I give them",
            "title_similarity": "0.56844896",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gzo0ysb",
            "score": 1,
            "text": "Cross post from r/LifeAmateurTips",
            "title_similarity": "0.13656916",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo0yz9",
            "score": 1,
            "text": "It’s amazing how much folks bitch and complain about privacy and how social media giants ‘have people’s info’…they have the info because you’re feeding it to them 😂",
            "title_similarity": "0.6454773",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzo15p7",
            "score": 1,
            "text": "Oh my god, that’s a real thing? That’s like every security question when setting up any account, how could you not put that together? Good post though!",
            "title_similarity": "0.49701542",
            "sentiment_compound": 0.8608
        },
        {
            "id": "gzo15w4",
            "score": 1,
            "text": "I haven't seen these security questions for at least 10 years.",
            "title_similarity": "0.36582845",
            "sentiment_compound": -0.2584
        },
        {
            "id": "gzo1b3b",
            "score": 1,
            "text": "The first this we learn in a cyber security course is social engineering, which is how to find this information.\n\nI prefer to pick random question and use very specific pass phrases.",
            "title_similarity": "0.5297582",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzo1cva",
            "score": 1,
            "text": "This is why you never give real answers to those when you're using them as security.\n\nFake first car, fake first street, fake first dog/cat, fake mother's maiden name, etc. Because otherwise anyone who knows you well enough can answer your bank security questions.",
            "title_similarity": "0.7494201",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzo1gwl",
            "score": 1,
            "text": "I usually see: first pet, birth location, first school and similar as security questions.",
            "title_similarity": "0.43146384",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzo1li3",
            "score": 1,
            "text": "Which is why I don't ever fill any of those out, and I lie on all the security questions",
            "title_similarity": "0.593952",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzo1mcx",
            "score": 1,
            "text": "Personally, I use normal words/phrases and run them through an English to Al Bhed translator, then write the translation down. If I forget, just plug it into the reverse and it gives me the English equivalent.",
            "title_similarity": "0.40482822",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzo1n37",
            "score": 1,
            "text": "Use 2fa for anything involving money. Good lord.",
            "title_similarity": "0.29417568",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzo20ve",
            "score": 1,
            "text": "So what about those \"colour of your shirt + the last thing you ate\"?",
            "title_similarity": "0.3314107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo21wv",
            "score": 1,
            "text": "Wells Fargo doesn't ask any of those.  They ask questions like where did you meet your SO, where did you get married, what is your SO's middle name, in what city did your spouse attend college, what is the first name of your maid of honor, when is your anniversary, or where did your SO go to college.  If you're not married, none of those questions work!  They're idiots that obviously didn't think their security questions through.",
            "title_similarity": "0.67737323",
            "sentiment_compound": 0.7146
        },
        {
            "id": "gzo22u8",
            "score": 1,
            "text": "For the most part you shouldn't use real answers to those questions anyways.  Use a single fake answer to act as your key that is not something related to any of these common questions.  It's easy for someone to look up your mother's maiden name.  It's not easy for them to know that you used \"Taco Bell\" as the answer to that question(and impossible without a keylogger or database hack if you never write it down)",
            "title_similarity": "0.67583686",
            "sentiment_compound": -0.383
        },
        {
            "id": "gzo2a32",
            "score": 1,
            "text": "Hondacivicbakerstreet32mrchildrenslayer what a silly Rockstar name.",
            "title_similarity": "0.44548228",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzo2c8v",
            "score": 1,
            "text": "the people who answer these questions on facebook honestly deserve to have their accounts hacked",
            "title_similarity": "0.5620811",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzo2kbv",
            "score": 1,
            "text": "The people who take those tests for their rock star name are also the ones who post on Facebook about being gone on vacation so everyone knows their house is empty. Because pictures of palm trees and parasailing can’t wait til they get home.",
            "title_similarity": "0.7679591",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzo2mop",
            "score": 1,
            "text": "“Name of the First pet that made you cry” saw that one the other day and checked the comments most everyone was 55+, white, and mostly female 🤦‍♂️",
            "title_similarity": "0.61729276",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo2mvz",
            "score": 1,
            "text": "How can people not know this? I use answers to my security questions that are completely made up, you can never be too safe.",
            "title_similarity": "0.63330036",
            "sentiment_compound": -0.0015
        },
        {
            "id": "gzo2p7b",
            "score": 1,
            "text": "1987 Toyota Camry Belmont St Mr.Muffins, shit my rockstar name sucks.",
            "title_similarity": "0.58224154",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzo2qw1",
            "score": 1,
            "text": "Better advice: answer your security questions wrong but in a memorable way you'll never forget\n\nFor instance: you're born in New York, but when you were 11 you had a wonderful trip to Germany, your security answer for \"where were you born?\" Can be Germany.",
            "title_similarity": "0.5705559",
            "sentiment_compound": 0.8945
        },
        {
            "id": "gzo2twj",
            "score": 1,
            "text": "Another reason I dropped Facefart and that robot thief Mark Suckerburg",
            "title_similarity": "0.5807663",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzo2tzm",
            "score": 1,
            "text": "Type out the smileys that correspond to your social security number, that is your personality type!!",
            "title_similarity": "0.43714464",
            "sentiment_compound": 0.6988
        },
        {
            "id": "gzo2yxl",
            "score": 1,
            "text": "I use a false set of answers for my security questions. So if I want to talk about where I grew up or whatever with friends I can without any security worry. You just have to remember what the false security answers were, which is a little trickier, but more secure.",
            "title_similarity": "0.563784",
            "sentiment_compound": 0.8049
        },
        {
            "id": "gzo2z71",
            "score": 1,
            "text": "I hear this a lot, but can't figure out the logistics of how this would work.\n\nFirst,they'd need to know your bank.\n\nThen they'd need to know your email address.\n\nThen they'd need to hope that one of the questions is one that you've answered, and that one of the answers actually matches.\n\nWhat is the success rate of capturing this data?",
            "title_similarity": "0.5369748",
            "sentiment_compound": 0.872
        },
        {
            "id": "gzo2zob",
            "score": 1,
            "text": "Social engineering is a hell of a thing",
            "title_similarity": "0.1488407",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzo33wp",
            "score": 1,
            "text": "If you had the same amount of money as your social security number, how much money would you have?",
            "title_similarity": "0.2572024",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzo3542",
            "score": 1,
            "text": "If you have to tell them, they're not gonna listen anyway. I've tried warning people when I see it, they never think it's a serious possibility.",
            "title_similarity": "0.4881451",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzo3exp",
            "score": 1,
            "text": "And don't respond to the stupid reddit threads asking about stuff you have done in your life. Don't respond If it is anything illegal",
            "title_similarity": "0.6036285",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gzo3i8j",
            "score": 1,
            "text": "Nova Pepper. Though it sounds better flipped...Pepper Nova is definitely a stripper name!",
            "title_similarity": "0.2624361",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzo3k97",
            "score": 1,
            "text": "I've tried countless times to convince friends to stop sharing this sort of information, but they don't care.",
            "title_similarity": "0.5980395",
            "sentiment_compound": -0.1511
        },
        {
            "id": "gzo3lmu",
            "score": 1,
            "text": "I offer horoscopes based on social security numbers,if you want one.",
            "title_similarity": "0.34260648",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzo3m83",
            "score": 1,
            "text": "Or just answer them *completely* wrong, and wait for the \"incorrect login\" emails to come in from your bank.",
            "title_similarity": "0.62851596",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gzo3qpx",
            "score": 1,
            "text": "Take the current year, and subtract your age. Thats the year you were born!!! OMG",
            "title_similarity": "0.25105283",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo3skd",
            "score": 1,
            "text": "Pretty clever if you think about it.",
            "title_similarity": "-0.11472478",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzo3wfb",
            "score": 1,
            "text": "If they try to rob me, they may inherit all my debt. Let me know where to sign up",
            "title_similarity": "0.45104468",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzo40zo",
            "score": 1,
            "text": "If people want to be that dumb, let them. All social media quizzes are data mining",
            "title_similarity": "0.64419234",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzo42gi",
            "score": 1,
            "text": "The real LPT is do not provide real answers to those questions when you set up your security.\n\nsecurity question1: \"what was the name of your first dog?\" \n\nanswer: firstdog_myextrathing345\n\nsecurity question2: \"what was the first street you lived on?\" \n\nanswer: livedon_myextrathing345\n\nAll you need to remember for any answer is \"myextrathing345\"",
            "title_similarity": "0.7140032",
            "sentiment_compound": 0.7622
        },
        {
            "id": "gzo43ub",
            "score": 1,
            "text": "My SSN is 694 20 6969",
            "title_similarity": "0.06044295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo49v1",
            "score": 1,
            "text": "I'm a firm believer in taking these and sharing the results privately with a few friends, but that's it.",
            "title_similarity": "0.33339918",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gzo4b28",
            "score": 1,
            "text": "Lol jokes on you my first street is $64$gdiiJfg68^%$",
            "title_similarity": "0.46413606",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzo4bnf",
            "score": 1,
            "text": "Fuckin jokes on them I forget the answers to my own security questions. Checkmate.",
            "title_similarity": "0.54818",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gzo4fp1",
            "score": 1,
            "text": "106  dei zeppi is an awful rockstar name",
            "title_similarity": "0.3607126",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzo4h9x",
            "score": 1,
            "text": "Okay but Sheba LeSabre is a fucking *sick* rockstar name tho.\n\nWhy would I deprive the world of that?\n\n^^^notanswerstoanyofmysecquestions",
            "title_similarity": "0.4988128",
            "sentiment_compound": -0.8621
        },
        {
            "id": "gzo4j5z",
            "score": 1,
            "text": "Normally I only follow this sub to get \"yeah no shit\" life tips but with this one, because I'm dumb, I actually didn't think of.. thank you!",
            "title_similarity": "0.5637386",
            "sentiment_compound": -0.7045
        },
        {
            "id": "gzo4kg2",
            "score": 1,
            "text": "Is there any evidence that people have had successful hacks on them because of this way of gaining information?",
            "title_similarity": "0.34588486",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzo4l57",
            "score": 1,
            "text": "Jokes on them! I answer pizza to every question.  SHIT! Don’t read that.",
            "title_similarity": "0.5700419",
            "sentiment_compound": -0.6016
        },
        {
            "id": "gzo4mav",
            "score": 1,
            "text": "the people stupid enough to fall for such a specific line of questioning deserve to lose fucking everything",
            "title_similarity": "0.4208809",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzo4nw8",
            "score": 1,
            "text": "Better life pro tip don't use shitty passwords.",
            "title_similarity": "0.3056497",
            "sentiment_compound": 0.7026
        },
        {
            "id": "gzo4o52",
            "score": 1,
            "text": "But seriously guys \nWhat was the name of your first pet and what is the name of the first school you went to?\nGenuinely interested for a friend",
            "title_similarity": "0.48669687",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gzo4ru6",
            "score": 1,
            "text": "But how else am I gonna know what type of fruit I would be?!",
            "title_similarity": "0.22242132",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo4xpm",
            "score": 1,
            "text": "If you used a site or service, any site or service, that uses questions as a backdoor to an account great then as garbage - do not connect any shared login/password and didn't use any of yours main mail for those. This kind of security is no security at all.",
            "title_similarity": "0.6403393",
            "sentiment_compound": 0.4828
        },
        {
            "id": "gzo4xxh",
            "score": 1,
            "text": "None Orphanage None to the rescue",
            "title_similarity": "0.35600144",
            "sentiment_compound": -0.4023
        },
        {
            "id": "gzo50au",
            "score": 1,
            "text": "You're probably right but my rockstar name is hella cool and I'm very tempted to share it",
            "title_similarity": "0.28624928",
            "sentiment_compound": 0.7639
        },
        {
            "id": "gzo53mv",
            "score": 1,
            "text": "Find out your rap name: Street you grew up on, and last four digits of your SSN!",
            "title_similarity": "0.46240133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo578a",
            "score": 1,
            "text": "Who the fuck would give this information? If you're that dumb then you deserve it, jfc.",
            "title_similarity": "0.31709296",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gzo57rx",
            "score": 1,
            "text": "I don’t think the demographic that needs to hear this is on Reddit unfortunately",
            "title_similarity": "0.45151544",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzo5dnf",
            "score": 1,
            "text": "that’s why i lie on those security questions. 1st grade teacher? i’ll do another grade. favorite sports team? pick their rival.",
            "title_similarity": "0.60902274",
            "sentiment_compound": 0.6966
        },
        {
            "id": "gzo5dwh",
            "score": 1,
            "text": "My first car is my first dog and my mom’s middle name is my middle school. Now you guys know.",
            "title_similarity": "0.59428966",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo5jdp",
            "score": 1,
            "text": "Measuring information on targeted",
            "title_similarity": "-0.116734184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo5kid",
            "score": 1,
            "text": "Just saw one the other day that said “Your middle name and name of your first car is your pornstar name”\n\nLike come on guys, I don’t see anyone named Patrick Corolla fucking four people at once anywhere.",
            "title_similarity": "0.797731",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzo5pov",
            "score": 1,
            "text": "Use some flavor of KeePass, and then random-generate the longest alphanumeric string the field will accept... then save the answers in the \"notes\" section for that login.\n\nTreat them like a second password, basically.",
            "title_similarity": "0.51551956",
            "sentiment_compound": 0.875
        },
        {
            "id": "gzo5rlv",
            "score": 1,
            "text": "The better life pro tip is to not answer your security questions with truths but treat them more as an additional password that has a logic only you can understand to answer some of the worst security questions possible.",
            "title_similarity": "0.5639683",
            "sentiment_compound": 0.3252
        },
        {
            "id": "gzo5tfq",
            "score": 1,
            "text": "LPT: answer your security questions in code. Even a simple code. Hackers aren’t going to expect your first pet’s name was “F1uffÿ”",
            "title_similarity": "0.6549052",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzo5vul",
            "score": 1,
            "text": "Hah! Joke's on them, I either put false information in my real bank info or I'm so indecisive that I can't settle on a single one! Also, if I make a password, I make it literally such a niche reference that only the right people would be able to figure it out, and the right people wouldn't be wasting their time trying to scam people. When I get scam calls I answer in another language, and in the unlikely event that they are able to switch over to that language, I just switch to another language as well. It's my hobby to waste scammers' time.",
            "title_similarity": "0.624495",
            "sentiment_compound": -0.8762
        },
        {
            "id": "gzo5w4j",
            "score": 1,
            "text": "OR... Answer them but lie.",
            "title_similarity": "0.1594399",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo5xfz",
            "score": 1,
            "text": "I swear some of these \"pro tips\" should be called \"common sense 101\"",
            "title_similarity": "0.23280136",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzo5xp1",
            "score": 1,
            "text": "I spend 10 hours a day on Social Media and im not seeing this anywhere???   \n\n\nHow am i the only person who misses shit like this consistently?",
            "title_similarity": "0.6150313",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gzo5ylm",
            "score": 1,
            "text": "Type something funny and memorable. It makes it difficult to guess your first car when you answer it with something that has nothing to do with cars.",
            "title_similarity": "0.5904097",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzo60z9",
            "score": 1,
            "text": "Or do answer them with every answer being orange",
            "title_similarity": "0.11040847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo61d8",
            "score": 1,
            "text": "I actually almost replied to one of those with a joke comment:  “your sci-fi robot name is your mother’s maiden name plus the last 4 of your social”. But I was afraid someone would actually do it and I’d get arrested.",
            "title_similarity": "0.7073735",
            "sentiment_compound": -0.5499
        },
        {
            "id": "gzo61iq",
            "score": 1,
            "text": "I just don’t use factual information for my security questions. Made up street, incorrect mother’s maiden name, favourites are definitely not favourite.",
            "title_similarity": "0.55214083",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzo6cp6",
            "score": 1,
            "text": "i very rarely forget my password, even more rarely do i use the security question. so i just make the answer to the questions the actual password they are protecting. \n\ni think i can count on a single hand where this has backfired.",
            "title_similarity": "0.5616594",
            "sentiment_compound": 0.7611
        },
        {
            "id": "gzo6eeg",
            "score": 1,
            "text": "Bold of you to assume I have a bank account",
            "title_similarity": "0.27958137",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzo6lal",
            "score": 1,
            "text": "But if I give them the last 4 of my social. I'll find out which ninja turtle I am most like. #worthit",
            "title_similarity": "0.51288724",
            "sentiment_compound": 0.5704
        },
        {
            "id": "gzo6lst",
            "score": 1,
            "text": "Better LPT: Use answers to your security questions that aren't truthful, but are consistent. For example, answer them as if you're Lisa Simpson or your high school best friend.",
            "title_similarity": "0.526471",
            "sentiment_compound": 0.9187
        },
        {
            "id": "gzo6mxy",
            "score": 1,
            "text": "Who takes these quizzes/questions seriously? I can't remember the last time I answered any of them honestly.",
            "title_similarity": "0.4204885",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzo6nj1",
            "score": 1,
            "text": "You should never answer these security questions with facts - remember you just need to know the answer so your first school could be :457&$@face",
            "title_similarity": "0.67892516",
            "sentiment_compound": -0.2584
        },
        {
            "id": "gzo6tf2",
            "score": 1,
            "text": "People still do this? Ok 2002",
            "title_similarity": "0.03576345",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzo6ucb",
            "score": 1,
            "text": "Never owned one, can't remember, can't remember",
            "title_similarity": "0.30532292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo6umq",
            "score": 1,
            "text": "Or just make shit up when you answer the real security questions. My mother’s maiden name may as well be Beeblebrox.",
            "title_similarity": "0.5024973",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzo72c9",
            "score": 1,
            "text": "And gladly none of these are in any security questions I've put in place.",
            "title_similarity": "0.38908038",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzo72dt",
            "score": 1,
            "text": "Last time I warned people on reddit about this I ended up getting threats from troglodytes that thought I was controlling their lives?",
            "title_similarity": "0.62468654",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzo748e",
            "score": 1,
            "text": "Favorite actor is an at&t password reset question if u call in\n\n\nJohn Wayne is the answer for at least 36.8% of people",
            "title_similarity": "0.6026614",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzo75aw",
            "score": 1,
            "text": "The answer to all my security questions are just different passwords, so",
            "title_similarity": "0.6022192",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzo75sz",
            "score": 1,
            "text": "Alternatively:\n\nMy first car was a functional piece of rust.\n\nThe first street I lived on was fake suburbia.\n\nMy first dog was imaginary.\n\nTherefore my rock star name is Rusty Suburban Illusion.",
            "title_similarity": "0.6935315",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzo76x1",
            "score": 1,
            "text": "Never put accurate information online, but also never put *real* information in those password recovery fields. You never want something that is known to other people, something that could be in a yearbook or a public record. \n\nMake up a list of things to put in those fields, and use *that* made-up stuff, and never the real thing.",
            "title_similarity": "0.6429255",
            "sentiment_compound": -0.0857
        },
        {
            "id": "gzo7fbd",
            "score": 1,
            "text": "how come facebook doesn't filter these like they do political posts?\n\ncan't they just be deplatformed?\n\nwhy does facebook allow scammers to use their site? what is facebooks liability?",
            "title_similarity": "0.6254678",
            "sentiment_compound": -0.4534
        },
        {
            "id": "gzo7nw1",
            "score": 2,
            "text": "LPT: generate new passwords for all your security answers and have fun on social media",
            "title_similarity": "0.5713624",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzo7qm1",
            "score": 1,
            "text": "The 3 digit code on the back of your Credit Card is your street name.\n\n1 .Spanks\n2. Hard\n3. Fat\n4. Meatball\n5. Sucks\n6. Shaft\n7. Baldy\n8. Slick\n9. Puncher\n0. Toughs",
            "title_similarity": "0.525101",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzo7r3w",
            "score": 1,
            "text": "Pro tip: pick one word, like pumpernickel or magnesium, and use it as the answer to every security question.",
            "title_similarity": "0.55171573",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzo7vgo",
            "score": 1,
            "text": "Thank god for my horrible memory. Whenever they ask for my previous addresses I have to always look them up. I moved constantly growing up so that helps too.",
            "title_similarity": "0.5660487",
            "sentiment_compound": 0.5688
        },
        {
            "id": "gzo7xi7",
            "score": 1,
            "text": "I work in bank fraud, it do be like that. Also don't put your favorite food down as \"rice\" for a security question",
            "title_similarity": "0.61685175",
            "sentiment_compound": -0.3356
        },
        {
            "id": "gzo8cdb",
            "score": 1,
            "text": "I mean to be fair if they logged into your account with your password. The chance is sort of high they can figure out your secret questions",
            "title_similarity": "0.50768995",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzo8esc",
            "score": 1,
            "text": "Or just make those answers another password rather than actual answers to those questions that people could find out anyways.",
            "title_similarity": "0.39459068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo8gli",
            "score": 1,
            "text": "The real reason not to answer is that they’re just awful white noise generators and no one cares that your lawyer name is Andrew Notebook or if you were a Star Wars character you’d be Ekim Htims.",
            "title_similarity": "0.6263273",
            "sentiment_compound": -0.8828
        },
        {
            "id": "gzo8j3z",
            "score": 1,
            "text": "That's why I don't give my actual information for those security questions",
            "title_similarity": "0.4038987",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzo8lv6",
            "score": 1,
            "text": "Your credit card number, banking info, and Social Security is how many times your evil twin rapper’s alter ego will go platinum! \n\nShare now!",
            "title_similarity": "0.6214911",
            "sentiment_compound": 0.3987
        },
        {
            "id": "gzo8mbx",
            "score": 1,
            "text": "Feel free to answer it in your head. Just don’t share it. I find it a bit fun, sometimes.",
            "title_similarity": "0.28166527",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gzo8mf4",
            "score": 1,
            "text": "I always use fictional characters and places. Never real ones.",
            "title_similarity": "0.531101",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo8ns5",
            "score": 1,
            "text": "This is such bullshit its like a couple years ago when Facebook moms were trying to make people watch out for the plastic thingy that goes on your back windshield wiper cause \"it's a mark for child traffickers to know which cars have sexy kids\" fkn kill me.",
            "title_similarity": "0.7658094",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzo8pho",
            "score": 1,
            "text": "LPT: Don't use findable things as security questions! You're allowed to write anything in the answer box. \n\nInstead, pick a question. Then, using your password manager (which you should also _absolutely_ use), generate a pass phrase- a series of pronounceable words (and save the generated phrase). xkcd has [talked about this before](https://xkcd.com/936/).\n\nThen, when a phone support person asks about your mother's maiden name, you tell them it was `correct horse battery staple`, which is both un-guessable and random. It ends up being a pretty decent security layer.",
            "title_similarity": "0.69640356",
            "sentiment_compound": 0.9215
        },
        {
            "id": "gzo8qb2",
            "score": 1,
            "text": "Or just don’t have a password like that...",
            "title_similarity": "0.2643538",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzo8wk9",
            "score": 1,
            "text": "Answering any social media anything looks desperate.",
            "title_similarity": "0.4827276",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzo90fl",
            "score": 1,
            "text": "It's like fishing in r/askreddit . \"Without saying the answer, what's the answer to this commonly used security question?\"",
            "title_similarity": "0.46802682",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzo91rg",
            "score": 1,
            "text": "I've given up telling FB friends to not answer these.",
            "title_similarity": "0.3851851",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzo91x6",
            "score": 1,
            "text": "Literal data mining. Hope you have secure passwords",
            "title_similarity": "0.32800874",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzo95hm",
            "score": 1,
            "text": "Back when I was in middle school I spaced out these questions to a school bully since he kept bragging about being the best at RuneScape, so eventually I get all  the questions and recovered his account this guy was a total noob and a huge waste of my time.",
            "title_similarity": "0.6754478",
            "sentiment_compound": 0.0018
        },
        {
            "id": "gzo98zu",
            "score": 1,
            "text": "I make up answers that I have to keep written down.\n\nName of your first school? Purple blackhole\n\nWhat model was your first car? Six eggnog\n\n... etc ...",
            "title_similarity": "0.5652656",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo9abx",
            "score": 1,
            "text": "It just seems odd to answer these random sets of questions and then to share the answers with strangers.",
            "title_similarity": "0.37423357",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzo9bj6",
            "score": 1,
            "text": "jokes on them, I don't even remember some of that.",
            "title_similarity": "0.24876076",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzo9gxx",
            "score": 1,
            "text": "First car 2080 Mazda Silverado \n123 Sesame Street\nMothers maiden name...she’s always been mommy and 29 all her life as far as I know.",
            "title_similarity": "0.5764777",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo9j3b",
            "score": 1,
            "text": "No 'pro tip' can help if you are that stupid.",
            "title_similarity": "0.30200696",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzo9lnm",
            "score": 1,
            "text": "The better LPT. Is just to tell people not to use actual answers for those questions and instead use another password.",
            "title_similarity": "0.48921478",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzo9m4z",
            "score": 1,
            "text": "my favorite is the \"what is your stormtrooper ID?\" one that uses your CC numbers lmao",
            "title_similarity": "0.41710365",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzo9vi9",
            "score": 1,
            "text": "True LPT: Knowledge Based Authentication (KBAs) are deprecated by NIST and a few other best practices authorities. If you encounter a site asking for KBAs in 2021, know that they are years behind the times and their other security measures are likely also fucked. Generate additional passwords and store them in your password manager. \n\nNot using a password manager in 2021? You too are years behind the times. I personally use Bitwarden. It is literally easier than trying to manage tour passwords manually. It is also more secure unless you have quite a fascinating brain that can remember dozens of unique, secure passwords.\n\nSource: https://auth0.com/blog/what-the-new-nist-guidelines-mean-for-authentication/ + NIST Special Publication 800-63-3",
            "title_similarity": "0.6360775",
            "sentiment_compound": 0.9543
        },
        {
            "id": "gzo9vuc",
            "score": 1,
            "text": "My suspicion is that there are now 'recruiters' on LinkedIn who reach out to you for your resume and then disappear. No, this is not your regular recruiter ghosting on you but it maybe a phishing scam. I have had a few appear, contact me, try to get my resume and a few weeks later their post/profile/pics are gone. Many of these are companies based in India-some might be legitimate but be extra careful now.",
            "title_similarity": "0.6281038",
            "sentiment_compound": -0.7469
        },
        {
            "id": "gzo9wh2",
            "score": 1,
            "text": "Wasn’t this same thing posted yesterday?",
            "title_similarity": "0.18693927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo9xq5",
            "score": 1,
            "text": "But I wanna know what kind of doughnut I am",
            "title_similarity": "0.27655056",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo9z0o",
            "score": 1,
            "text": "Jokes on them... I answer those with random and unrelated answers! Good luck and stay safe!",
            "title_similarity": "0.31215227",
            "sentiment_compound": 0.8856
        },
        {
            "id": "gzoa1nj",
            "score": 1,
            "text": "All my secret answers are nonsense with no connection to the actual question, ez",
            "title_similarity": "0.46713567",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzoa2sd",
            "score": 1,
            "text": "Another LPT, don't use something special to you as a security measure check on any platform. Always keep them vague. How to remember them is an issue, but it's better to remember some cryptic string rather than giving away your information in that off case data leak/hacking happen.",
            "title_similarity": "0.5482886",
            "sentiment_compound": 0.7796
        },
        {
            "id": "gzoa3wn",
            "score": 1,
            "text": " This is reason #2 why I just made up answers to all of my security questions.  Reason #1 is I can't remember the name of the first pet I had when I was 6 years old, like come on.",
            "title_similarity": "0.7076186",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzoa4rk",
            "score": 1,
            "text": "My first car is “Blue.”  My favorite color is “Toyota Corolla.” My first dogs name was “Smith.” My mother’s maiden name is “Spot.” \n\nWhen setting up secret questions you don’t have to answer with the actual question that’s being asked.  Just make sure you keep track of what your answers are in a password manager app or write them down somewhere where you can find them.",
            "title_similarity": "0.65233374",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzoadlv",
            "score": 1,
            "text": "Alternatively, just make the answers to security questions different passwords instead of the actual answer to the question.",
            "title_similarity": "0.3817125",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoaec5",
            "score": 1,
            "text": "LPT if designing an account system, don't use security questions for account recovery.\n\nIf you don't know that you probably shouldn't be designing an accounts system.\n\nThings like parents names, school names, pets, etc are easily obtainable if not public information. \n\nIt blows my mind when I see these questions protecting an important account. Often the questions have answers that would change too! \n\n\"What is your favorite X\" is not only known to many people, but CHANGES. Delta had some terrible questions. \"What is your favorite place you've travelled?\" Anybody that has access to my insta has a chance to guess that and when I finally get to the Maldives that answer will easily change!",
            "title_similarity": "0.66268736",
            "sentiment_compound": 0.8109
        },
        {
            "id": "gzoaex2",
            "score": 1,
            "text": "Nobody is using 2 Live Crew songs anymore? And… I’m old again.",
            "title_similarity": "0.41912758",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoagvy",
            "score": 1,
            "text": "It's sometimes hard to imagine, but a lot of people really are that dumb.",
            "title_similarity": "0.2922206",
            "sentiment_compound": -0.7223
        },
        {
            "id": "gzoaj6y",
            "score": 1,
            "text": "What about the fact that you use your phone number to verify pretty much every account you make, yet you give your phone number to everyone.",
            "title_similarity": "0.59439725",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzoakc7",
            "score": 1,
            "text": "This is why i use qwerty",
            "title_similarity": "0.20984171",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoakin",
            "score": 1,
            "text": "You can answer those questions but what people fail to realize is you don't have to provide proper answers. You can put ANY answer there.",
            "title_similarity": "0.4265671",
            "sentiment_compound": -0.6956
        },
        {
            "id": "gzoat18",
            "score": 1,
            "text": "I've never seen one that asked for something other than your initials and maybe your month of birth.",
            "title_similarity": "0.47280413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoax9j",
            "score": 1,
            "text": "My bank actually had me use a random phrase for the security question that wasn’t related to it at all",
            "title_similarity": "0.6128096",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoayuv",
            "score": 1,
            "text": "I'm still a bit.....\nSurprised, I suppose would be the proper word, about the scams people fall for.\n\nI was in the military and some Nigerian dude was trying to get me to ship him a couch. He \"paid\" via pay-pal, but it was a scam. I called pay-pal to verify, and of course, no payment.\nWhen I let the dude know I was onto him, I started receiving emails from the \"FBI\" about a criminal investigation against me about the couch. The letter head was a literal meme of federal officers doing raids and stock photos.\n\nGoddamn, the FBI is going to raid me for my $200 couch......\n\nPeople, remember how the government operates: it needs to be official. Memes and gift cards aren't official. No bill collector is going to collect payment via gift cards. I literally cannot believe people fall for that.",
            "title_similarity": "0.6780282",
            "sentiment_compound": -0.8597
        },
        {
            "id": "gzoaywh",
            "score": 1,
            "text": "Another LPT: Don't answer those security questions with real answers. Anyone that knows you or does a little bit of research on you will know those things.\n\nFor example, answer the \"name of first pet\" with a movie character. Mother's maiden name with another movie character etc.\n\nI absolutely HATE those r3t4rd3d UNSECURITY questions.",
            "title_similarity": "0.69280314",
            "sentiment_compound": -0.7758
        },
        {
            "id": "gzob43j",
            "score": 1,
            "text": "So all those MySpace questionnaire are off the table then?",
            "title_similarity": "0.47248858",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzob8a2",
            "score": 1,
            "text": "Also for any security question like \"what school did you attend?\" just make the answer like spaghetti bolognese.",
            "title_similarity": "0.49773473",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gzobbif",
            "score": 1,
            "text": "Good thing I don't remember them correctly so neither them nor I can guess the security questions.",
            "title_similarity": "0.4271466",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzobdc2",
            "score": 1,
            "text": "Seriously, I keep telling people this. Any thing that says \"put in x,y,z\" is data collection. It's not a \"fun thing to do on the internet\" \nAnything that asks you to put in info or \"use predictive text\" is collection.",
            "title_similarity": "0.61496025",
            "sentiment_compound": -0.5271
        },
        {
            "id": "gzobe0d",
            "score": 1,
            "text": "LPT: Come up with fake answers for those security questions. Use two factor. AND don't answer the social media survey posts.",
            "title_similarity": "0.6502305",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzobi4i",
            "score": 1,
            "text": "I learned about this a few months ago and was absolutely shocked but then it had been a while and I saw a different version and the fact I was so close to commenting is really scary",
            "title_similarity": "0.48035562",
            "sentiment_compound": -0.7605
        },
        {
            "id": "gzobmm8",
            "score": 1,
            "text": "The 16 digits on the front of your mom’s credit card, followed by the expiration date, followed by the 3 digits on the back is your silly fortnite name!",
            "title_similarity": "0.60568446",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gzobnfk",
            "score": 1,
            "text": "Your first name + your last name is your stripper name",
            "title_similarity": "0.3562668",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzobqpf",
            "score": 1,
            "text": "Anytime I see those posts I'll come up with the answer in my head but never actually reply to then because nobody cares lol, so it's good to know I've been unintentionally avoiding these!",
            "title_similarity": "0.5969871",
            "sentiment_compound": 0.8796
        },
        {
            "id": "gzobqzc",
            "score": 1,
            "text": "Absolutely spot on, idk why the hell people still do those \"quizzes.\" Straight up data/PII grabs. \n\nMy boomer dad posted my mom's ENTIRE passport on Facebook because they both thought the picture was so bad that it was funny. My brother intervened immediately, thank goodness. People do the dumbest shit on the internet.",
            "title_similarity": "0.75886774",
            "sentiment_compound": -0.8539
        },
        {
            "id": "gzoc6ee",
            "score": 1,
            "text": "I don't use the real answers to those questions.",
            "title_similarity": "0.18215273",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoc7uy",
            "score": 1,
            "text": "Tell me all your deepest darkest secrets!",
            "title_similarity": "0.33594295",
            "sentiment_compound": -0.5411
        },
        {
            "id": "gzoc84l",
            "score": 1,
            "text": "Sites still use security questions?",
            "title_similarity": "0.24362923",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoc897",
            "score": 1,
            "text": "Life Pro tip? If you got scammed like that you had it coming and getting scammed would be the actual life lesson here... right?",
            "title_similarity": "0.432873",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gzocc19",
            "score": 1,
            "text": "LPT: Don't answer those security questions honestly.",
            "title_similarity": "0.30135852",
            "sentiment_compound": 0.2415
        },
        {
            "id": "gzocdix",
            "score": 1,
            "text": "Does anyone remember The Brunching Shuttlecocks? They had a Mr. T name generator that asked for personal information like this. The name was, of course, always “Fool!”\n\nhttp://brunching.com/mrtname.html",
            "title_similarity": "0.6738228",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gzochav",
            "score": 1,
            "text": "Always just use random words",
            "title_similarity": "0.29951343",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoci5g",
            "score": 1,
            "text": "But how can they link it back your account tho? This is something I never understood even though I heard that this might be a way how hackers get your info.\n\nLike how can they know this JOHN DOE person that answer X and Y is linked to this account? Or do they have a lot of account information and are hoping that one specific person answers it? How does it work?",
            "title_similarity": "0.63471",
            "sentiment_compound": 0.8364
        },
        {
            "id": "gzocit1",
            "score": 1,
            "text": "“What’s your favorite social security number”\n\nOoh ooh, I know that one!",
            "title_similarity": "0.3410682",
            "sentiment_compound": 0.69
        },
        {
            "id": "gzoco3e",
            "score": 1,
            "text": "I would never give my mother's maiden name.\nI always give my father's maiden name instead.",
            "title_similarity": "0.5514424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzococ2",
            "score": 1,
            "text": "My rockstar name is 323 Stark Lucky",
            "title_similarity": "0.25165862",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzocxv9",
            "score": 1,
            "text": "Hilarious. I never realized this.",
            "title_similarity": "0.17687914",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzod0xh",
            "score": 1,
            "text": "What the hell man",
            "title_similarity": "0.030930458",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzod6tl",
            "score": 1,
            "text": "I have a set of false answers to those security questions, so if they somehow know the real answer, it doesn't matter. fake example:   \n What was your mother's maiden name? \"Blue\"    \nWhat street did you live on?  \"xhamster\"    \nWhat was your dog's name? \"BR549\"",
            "title_similarity": "0.6571017",
            "sentiment_compound": 0.6619
        },
        {
            "id": "gzod9cp",
            "score": 1,
            "text": "I always give false information on those.",
            "title_similarity": "0.35277203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzodbld",
            "score": 1,
            "text": "I have a feeling anyone reading this already knows this and anyone who already posted their answers won't be coming around here anytime soon",
            "title_similarity": "0.46693027",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzodd0s",
            "score": 1,
            "text": "protip for any security questions use another password, somthing easier to remember. then you dont need to worry about not answering these questions.",
            "title_similarity": "0.39944762",
            "sentiment_compound": 0.7654
        },
        {
            "id": "gzodddy",
            "score": 1,
            "text": "Enter your social security number to find out which Spice Gurl you are!",
            "title_similarity": "0.5139272",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gzodevs",
            "score": 1,
            "text": "I find these comments funny because in my country everyone knows everyone's ID/SS number (you can easily Google it, it's by no means secret), and everyone can know a woman's maiden name because women don't take their husbands' last names :P",
            "title_similarity": "0.67745566",
            "sentiment_compound": 0.7297
        },
        {
            "id": "gzodmdc",
            "score": 1,
            "text": "Also, cuz who gives a shit",
            "title_similarity": "0.025570262",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzodmtl",
            "score": 1,
            "text": "I've always liked: \"Your ho name is your first name, middle initial, and last name.  Cause you're a ho.\"",
            "title_similarity": "0.3125602",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzodsne",
            "score": 1,
            "text": "The correct method is to use false answers for your security questions. Too many people know, or could easily find out, my first car, dogs name, etc.",
            "title_similarity": "0.63688356",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzodw6b",
            "score": 1,
            "text": "Jokes on them. I just answer all those type of questions with donut1, donut2, donut3 and so on. Makes it a lot easier for me to remember also.",
            "title_similarity": "0.327142",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzoe2w1",
            "score": 1,
            "text": "your latest security number with 16 digits 😍",
            "title_similarity": "0.29543018",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzoe8w4",
            "score": 1,
            "text": "Honestly whoever is stupid enough to partake in these deserve to have their identities stolen",
            "title_similarity": "0.34190053",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzoebgv",
            "score": 1,
            "text": "you shouldn't be answering any questions at all, unless you are fine giving away details of your life to random yobos , all those quizzes / etc are scams",
            "title_similarity": "0.6734037",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzoeli8",
            "score": 1,
            "text": "Never ever use your real life info to answer security questions. It’s easy to figure out. \n\nAlways use some made up ones you can remember. \n\nFor example you went to Hogwarts? Instead write something unrelated. I once answered the questions on behalf of someone when they lost their password and couldn’t reset it. \n\nTheir security questions:\n- What’s your mom first name? Easy I knew it\n- What’s the first school you attended? We went to the same school.\n- what’s your first car? Easy because I helped him fill up the application for it. \n\nAnd worst part is when people use 0000, 1234, 123456 or your date of birth as their password. So many old people would use 1234.",
            "title_similarity": "0.8096843",
            "sentiment_compound": 0.7941
        },
        {
            "id": "gzoeo2y",
            "score": 1,
            "text": "Even better pro tip. Answer then incorrectly.",
            "title_similarity": "0.15683116",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzoetpg",
            "score": 1,
            "text": "So all of /r/AskReddit ?",
            "title_similarity": "0.14365095",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoeuf0",
            "score": 1,
            "text": "No shit. And tons more is free info for targeted marketing.",
            "title_similarity": "0.25500375",
            "sentiment_compound": 0.7581
        },
        {
            "id": "gzoevbm",
            "score": 1,
            "text": "I always answer the security questions with like... technically true answers. The only problem is when I have to use them later, I have to try to guess what flavor of shithead I was being when I set the answers in the first place.\n\nOldest sibling's nickname? \n\nDid I answer it with my actual oldest brother's actual nickname, or the one I call him in my head, or did I use my honorary older brother's nickname instead?\n\nThe world (and I) will never know.",
            "title_similarity": "0.64291924",
            "sentiment_compound": 0.3939
        },
        {
            "id": "gzof298",
            "score": 1,
            "text": "Another one I’ve noticed lately is getting private messages on Facebook from a known friend that says something clickbaitey like “wow, is this you?? Looks just like you in this video!”\n\nThen it gives you a link and you have to “sign in” to Facebook again. Clearly just a scam to get your login credentials. If it happens to you, message your friend back to say you got a suspicious message so they can check their account (they’ll have no recollection of sending you a message), then delete it. \n\nIf you’re already logged in to Facebook, there’s no reason that you would need to enter your login information again just to view a video.",
            "title_similarity": "0.7059779",
            "sentiment_compound": 0.6312
        },
        {
            "id": "gzofj6j",
            "score": 1,
            "text": "Better tip, give wrong answers to the security questions and remember what you wrote. What city were you born in? Wakanda. What was your first car? Megazord. What was your first girlfriend's name? YourMom.",
            "title_similarity": "0.6951325",
            "sentiment_compound": 0.4098
        },
        {
            "id": "gzofrce",
            "score": 1,
            "text": "Joke's on them I always answer those questions \"no way I'll let someone steal this'..oh wait..",
            "title_similarity": "0.5215919",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzofwhk",
            "score": 1,
            "text": "Not to mention how lame those questionnaires are lol",
            "title_similarity": "0.23974876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzofzrq",
            "score": 1,
            "text": "No fucking shit! Yet people are still talking for the gift for gift mlm scams",
            "title_similarity": "0.5628042",
            "sentiment_compound": 0.2285
        },
        {
            "id": "gzoga0z",
            "score": 1,
            "text": "When onboarding with my last job, I was taught to always lie on those questions. I always push it further now so the answers don't even make sense in the context of the question. This makes it harder to remember but you can use a password manager app to store them safely.\n\nFor example: \"What was your first car?\" Missouri",
            "title_similarity": "0.7909028",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzoga1g",
            "score": 1,
            "text": "For the security questions use random words as the answer and store them in a password manager. Then this isn't a problem.",
            "title_similarity": "0.40412104",
            "sentiment_compound": 0.5659
        },
        {
            "id": "gzogd53",
            "score": 1,
            "text": "Damn, I'd go to a concert by Nissan 7th st Buttmuncher.\n\nI was too lazy to read the second half of the title, is there a tldr?",
            "title_similarity": "0.6441",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gzogic0",
            "score": 1,
            "text": "Welcome to LPTs from 2007.  How does this STILL get posted to top page like every couple months ?",
            "title_similarity": "0.3884202",
            "sentiment_compound": 0.743
        },
        {
            "id": "gzogprr",
            "score": 1,
            "text": "As long as the internet exists there will still be people stupid enough to do this apparently. It feels like this turns up every 5 years or so",
            "title_similarity": "0.5782643",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzogqbo",
            "score": 1,
            "text": "My fave is \" your sad alcoholic name is your first and last name\"",
            "title_similarity": "0.4307034",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzogw6i",
            "score": 1,
            "text": "Hey guys, your Tik Tok name is your Social Security number plus the security code on the back of your credit card!",
            "title_similarity": "0.54633516",
            "sentiment_compound": 0.7901
        },
        {
            "id": "gzogwj5",
            "score": 1,
            "text": "Better one, don’t answer any of those stupid questions on on social media. They’re all bait for engagement",
            "title_similarity": "0.57052743",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzogxvx",
            "score": 1,
            "text": "1. Use a proven password manager (eg Bitwarden, Lastpass, etc) and protect your vault with a very long and strong password, and multifactor authentication. \n2. Go through the password manager's settings to configure a short timeout so it logs out automatically when it hasn't been used for a while. Some allow you to lock it down with fancier options such as geo-restrictions (login requests from your unapproved countries will be rejected) \n3. Use the password manager to generate passwords for all sites\n4. Use a random word generator website to come up with answers to security questions so attackers can't social engineer their way into guessing your answers. \n5. Save these random answers in the notes field in your password manager",
            "title_similarity": "0.645213",
            "sentiment_compound": 0.4535
        },
        {
            "id": "gzogyyr",
            "score": 1,
            "text": "SLPT: just use your password on security questions",
            "title_similarity": "0.42685673",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoh0tv",
            "score": 1,
            "text": "I thought she was trying to get to know me 😢",
            "title_similarity": "0.1727092",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzoh2ve",
            "score": 1,
            "text": "THIS SHIT RIGHT HERE. I’ve been saying for a while now that those “pick five one gotta go” are just thinly veiled (successful) attempts to have you volunteer your personal data so they can “build your personality profile” and sell your marketing data. \n\nDON’T DO THOSE LAME ASS THINGS! You can have all the little debbies, none “gotta go” lol rant over.",
            "title_similarity": "0.7059534",
            "sentiment_compound": -0.9235
        },
        {
            "id": "gzoha00",
            "score": 1,
            "text": "That's a stupid take. How about you don't use those answers on flawed security questions which have been proven to be insecure to begin with. You are only preventing hackers and bots by not putting those answers, which I agree is dumb to do anyways. Close friends and family know those answers. Just lie on them. It's far safer.",
            "title_similarity": "0.57345104",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzohcik",
            "score": 1,
            "text": "It's amazing that people are doing these willingly and honestly. It's PERSEC 101. I hope in the back of my mind that they're lying, because it'd be insane to be honest.",
            "title_similarity": "0.4098915",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzohimn",
            "score": 1,
            "text": "And combine that with the \"share this post in the next 10 minutes and you will get great luck/100 million/god will bless you\".\n\nWhen you do that, you show scammers you are a pretty good target because you will believe anything, including that your credit card will be cancelled unless you confirm the digits right now.\n\nStop posting your test results, drivers license, etc. Just stop posting tbh.",
            "title_similarity": "0.64523244",
            "sentiment_compound": 0.9081
        },
        {
            "id": "gzohlyl",
            "score": 1,
            "text": "Don't tell me what to do!",
            "title_similarity": "0.1471236",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzohw45",
            "score": 1,
            "text": "Let em go nuts i say,  it's natural selection 2021 style.\n\nSame as when business call YOU and ask you to pass security by 'confirming' some personal data, before they will tell you the purpose of the call.",
            "title_similarity": "0.57753783",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzohwrl",
            "score": 1,
            "text": "Why are you still using social media?",
            "title_similarity": "0.3337949",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzohxcu",
            "score": 1,
            "text": "Jokes on them my security questions are either trick questions or random",
            "title_similarity": "0.36056244",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzohzy3",
            "score": 1,
            "text": "Those things are still going around?",
            "title_similarity": "-0.08343748",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoi456",
            "score": 1,
            "text": "I’ve done that because my vital passwords are absolutely nuts, like <#wsa1$!>. Good luck guessing that shit (and that isn’t an actual password of mine)",
            "title_similarity": "0.5223266",
            "sentiment_compound": 0.6095
        },
        {
            "id": "gzoi6hg",
            "score": 1,
            "text": "My friend once told me don’t tag your location when posting online because it’s basically telling everyone (if your profile is public) that the house is empty",
            "title_similarity": "0.71257126",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoi6qk",
            "score": 1,
            "text": "Good luck to anyone trying this out on me. My Reddit is totally anonymous. \n\nAlso,this only works if you answer those questions truthfully in security setups. \nMy first pet? answer was my 5th pet.  \nFirst street I grew up? is my 3rd street, etc.",
            "title_similarity": "0.70050234",
            "sentiment_compound": 0.89
        },
        {
            "id": "gzoi6za",
            "score": 1,
            "text": "LPT: on banking websites that ask these questions, put your dream car , or your your dream school - not actual first car or first school",
            "title_similarity": "0.66545564",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzoial2",
            "score": 1,
            "text": "Jokes on them. I always choose funny responses as recovery answers, which I promptly forget.",
            "title_similarity": "0.479965",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzoifgn",
            "score": 1,
            "text": "Whenever a site gives me the option to make my own security question, i always take it and make it something completely useless to a hacker. What the hell are they gonna do with my personal high score on windows xp space cadet pinball?",
            "title_similarity": "0.7201852",
            "sentiment_compound": -0.5709
        },
        {
            "id": "gzoitka",
            "score": 1,
            "text": "I have told countless people, countless times this very thing.  Thanks for posting",
            "title_similarity": "0.34185377",
            "sentiment_compound": 0.4902
        },
        {
            "id": "gzoixwq",
            "score": 1,
            "text": "I always lie on these questions then forget what I answered 😭",
            "title_similarity": "0.5008444",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzoj0ey",
            "score": 1,
            "text": "I just make up fake answers.",
            "title_similarity": "0.28791273",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzoj1v9",
            "score": 1,
            "text": "Seriously... my Facebook is all my Boomer relatives just constantly commenting on this crap. It's also for targeted advertising I think, all these new ones are \"who was at woodstock?\" \"do you remember...\" etc. Gauging your age and other demographics to target advertising I'm guessing.",
            "title_similarity": "0.75028765",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzoj5va",
            "score": 1,
            "text": "Just something of note, during windows 10 account setup, it’ll ask you to create security questions for the account. These answers are viewable in plane text in the registry so don’t use anything it would on other sites….",
            "title_similarity": "0.6052767",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzoj6wz",
            "score": 1,
            "text": "John wick needs your help in fortnite!",
            "title_similarity": "0.31308383",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gzojka0",
            "score": 1,
            "text": "Toyota Maple Barky",
            "title_similarity": "0.26533493",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzojljq",
            "score": 1,
            "text": "+ provide random codes as answers for these questions for your real life accounts",
            "title_similarity": "0.5442814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzojme6",
            "score": 1,
            "text": "Well I guess if you're online name is your real name and your stupid enough to do that then yeah",
            "title_similarity": "0.5138825",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzojow6",
            "score": 1,
            "text": "Imagine using simple and honest answers. Mother's maiden name: Qwertyuiop. First Car: Little Tikes. First dogs name: Gibberish (I was a baby). None of these are the security questions I choose either. The more unpredictable, the better.",
            "title_similarity": "0.7055387",
            "sentiment_compound": 0.8344
        },
        {
            "id": "gzojtg5",
            "score": 1,
            "text": "That shit won’t work on my. I universally use bullshit responses to security questions; e.g. “Q1: What was the name of your first pet?” “A: I hate pets, especially ones with human names.”\n\nOr something like that.\n\nThe key is, never actually answer the question, riff on it.\n\nEdit: And, importantly, write down your response somewhere.\n\nEdit the second: Obviously secure your password book, and preferably keep it physical, not on your computer.",
            "title_similarity": "0.7493167",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzojuhc",
            "score": 1,
            "text": "My security questions are made up.  Hell, anyone can figure out where I was born.  Try guessing the city I picked, there's only a few hundred thousand out there.",
            "title_similarity": "0.625118",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzojvb0",
            "score": 1,
            "text": "I remember in the early days of internet there was a chain-mail template that you would fwd between friends and you could find out from the reply all who had a crush on you,  and a lot of info that could be used to Crack passwords. Also a file that was passed around on ICQ that have remote access to the user's computer",
            "title_similarity": "0.6273668",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzojzpa",
            "score": 1,
            "text": "How do people not realize this?",
            "title_similarity": "0.08552197",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzok0bf",
            "score": 1,
            "text": "I feel like this is sorta like Darwinism in a way.\n\nIf a person is dumb enough to fall for that, they deserve what happens to them.",
            "title_similarity": "0.26090842",
            "sentiment_compound": 0.1045
        },
        {
            "id": "gzok2a9",
            "score": 1,
            "text": "But how will I ever learn my porno name?",
            "title_similarity": "0.4216635",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzok99q",
            "score": 1,
            "text": "In those types of “quizzes” I’ll answer something like “1982 Security Question Hatchback “ for my first car.",
            "title_similarity": "0.5970684",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzokawd",
            "score": 1,
            "text": "Yuh see, the trick is to not use anything like those questions, or at least, the sought out answers, as your security question answers.\n\n&#x200B;\n\nWhat was the name of the street you grew up on? Battleship Iowa!\n\nWhat was the name of your first dog? James Gunn\n\nYour mothers maiden name? Fuck yoooooou!\n\nJust uh, make sure you actually remember what the answers are.",
            "title_similarity": "0.7431088",
            "sentiment_compound": -0.5162
        },
        {
            "id": "gzokb7z",
            "score": 1,
            "text": "1) Penis\n2) Penis\n3) Penis",
            "title_similarity": "0.10973117",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoklgl",
            "score": 1,
            "text": "Better yet, use fake information. I like flooding these things with dumb information like \"your mom,\" \"February 30th,\" \"Atlantis\" etc.",
            "title_similarity": "0.5246483",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzokmaq",
            "score": 1,
            "text": "Ty for the free crypto rock star 💎🙏",
            "title_similarity": "0.406438",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gzokqn5",
            "score": 1,
            "text": "Yep and lots of bots use these posts to collect this information so they can recover your passwords and gain access to your accounts. Plus, no one cares...",
            "title_similarity": "0.69178057",
            "sentiment_compound": 0.2311
        },
        {
            "id": "gzokucv",
            "score": 1,
            "text": "Same with “horoscope calculators” asks for birth state and town, and when you were born down to the minute... all the info to try and generate social security numbers",
            "title_similarity": "0.55859804",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzol3wq",
            "score": 1,
            "text": "I use questions not related to me and use crap answer not even answering the actual question. And no, I do not forget them because i have great memory and... Specialise in remembering stupid things hahaha",
            "title_similarity": "0.45315737",
            "sentiment_compound": 0.5213
        },
        {
            "id": "gzolc8o",
            "score": 1,
            "text": "My first car was a Gullible 750 SX, I lived on Identity Theft Lane, and my first dog was named Victim.  Thats a strange rock star name isnt it!",
            "title_similarity": "0.7516787",
            "sentiment_compound": -0.69
        },
        {
            "id": "gzolffv",
            "score": 1,
            "text": "Your porn phone number is first 3 digits of social + last 4 of social, extension is digits 4 & 5. Area code is 420.",
            "title_similarity": "0.5342735",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzolhl9",
            "score": 1,
            "text": "r/GrapheneHandsToken",
            "title_similarity": "0.074316196",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzolic5",
            "score": 1,
            "text": "Alright, this is probably weird, but also burried in the comments. I have a physical map which I've had for +20 years. I still write my passwords in it, because all my passwords, recovery answers etc are gibberish.",
            "title_similarity": "0.65485525",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gzoll6j",
            "score": 1,
            "text": "Slick.. real slick",
            "title_similarity": "-0.12897292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzolm8t",
            "score": 1,
            "text": "LPT: don’t use actual true information for a security question. The site isn’t going to know that, “I have sex with the Scooby Gang” isn’t your mother’s maiden name. As long as it’s something you’ll remember feel free to use it.",
            "title_similarity": "0.64733434",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzolpdy",
            "score": 1,
            "text": "I thought people only had passwords like that in video games “aha it’s the name of his first pet”. My own passwords are numbers and letters in utter gibberish. It’s not hard to memorize a sequence once you’ve used it some time and it feels a lot safer tbh.",
            "title_similarity": "0.6381988",
            "sentiment_compound": 0.6804
        },
        {
            "id": "gzolpui",
            "score": 1,
            "text": "And on a side note, think of who else would know the name of the first street you lived on or your first pet. I realize plenty of people think their parents would never ever screw them over and steal from them, but some do. And if you grew up in an emotionally abusive household, you may not even realize you need to protect yourself.   \n\nGot a sibling, significant other or any other family member with an addiction problem, money issues, control issues or just simply is an asshole? Protect yourself from EVERYONE. Not just strangers online. People you actually know can do a lot more damage.    \n\nProvide fake info for every security question. No one is researching to see if the answer for your mother's maiden name is actually your own mother's maiden name. I've been using fake names for years.",
            "title_similarity": "0.74056876",
            "sentiment_compound": -0.9548
        },
        {
            "id": "gzolqs9",
            "score": 1,
            "text": "Random characters are better answers anyway.  For instance, my first street was $hFBY&5H. \n\nOops.",
            "title_similarity": "0.43472153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzolsmi",
            "score": 1,
            "text": "I've answered posts like that, but not with real information.",
            "title_similarity": "0.351955",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gzolt1z",
            "score": 1,
            "text": "I fucking hate how some services force me to fill in security questions, I don't want them!!",
            "title_similarity": "0.49251005",
            "sentiment_compound": -0.5266
        },
        {
            "id": "gzoltfu",
            "score": 1,
            "text": "Not countless. Just a few complete fucking idiots.",
            "title_similarity": "0.21377462",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzom1lu",
            "score": 1,
            "text": "Why is this subreddit life common sense tip",
            "title_similarity": "0.12031969",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzom1mv",
            "score": 1,
            "text": "If you give a shit about your rock star name maybe you deserve to have your identity stolen.",
            "title_similarity": "0.4800269",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gzom7ue",
            "score": 1,
            "text": "People put real answers for those security questions?",
            "title_similarity": "0.28606597",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzom8se",
            "score": 1,
            "text": "All of my security questions are based on a fictional character in a movie.   \nA movie that I hate.",
            "title_similarity": "0.5987948",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzombi5",
            "score": 1,
            "text": "The real lpt is using a question like your childhood pet, your elementary school best friend and always making the answer something penislover69.",
            "title_similarity": "0.5776868",
            "sentiment_compound": 0.872
        },
        {
            "id": "gzombka",
            "score": 1,
            "text": "Jokes on them. My answers are not at all what the question asks for.",
            "title_similarity": "0.3082075",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzomiln",
            "score": 1,
            "text": "I answer all of them with completely wrong answers.",
            "title_similarity": "0.36748883",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gzomkyy",
            "score": 1,
            "text": "I always make up answers for those questions so that only i know the right answers. For example,  dream job is underwater firefighter.",
            "title_similarity": "0.51873416",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzomss3",
            "score": 1,
            "text": "On a related note, don't give the \"right\" answer for anything that's public record (e.g. mother's maiden name, father's middle name), easily found online (e.g. city where you met your significant other), or common knowledge among your friends (e.g. first car). The site doesn't *know* my pet's name/first car/mother's maiden name. If I tell them my mother's maiden name is Leibniz, it's all good as long as I remember I told them Leibniz. There's no ready association between a German mathematician and me, so anyone trying to break my security questions is stuck with random guesses.",
            "title_similarity": "0.7529502",
            "sentiment_compound": 0.8171
        },
        {
            "id": "gzomsut",
            "score": 2,
            "text": "My answers have nothing to do with the questions.\n\nWhere did you go to school? -BaconWaffles",
            "title_similarity": "0.5844927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzomvgh",
            "score": 1,
            "text": "For my security questions I pick a close friend that I could answer the questions about. This way my personal info can't be used against me.",
            "title_similarity": "0.42822444",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzomxi3",
            "score": 1,
            "text": "So Kia birdwood snowy is not my rockstar name?",
            "title_similarity": "0.45226043",
            "sentiment_compound": -0.6697
        },
        {
            "id": "gzon098",
            "score": 1,
            "text": "Do you actually use your real info for your security questions? I just pick random crap and write it down.\n\nFor a while there, my mothers maiden name was fhqwhgads",
            "title_similarity": "0.5992254",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzon2r9",
            "score": 1,
            "text": "Okay but I fail to understand how last food I ate, color of my underwear, and object currently to my left can be used to steal my identity.",
            "title_similarity": "0.5580827",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gzon5an",
            "score": 1,
            "text": "OMFG this. It's like, what can they do? Like script 1000 quizzes and cross reference them with old a-- tech, that's what.",
            "title_similarity": "0.44071668",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzon85y",
            "score": 2,
            "text": "Chevy Tahoe, Main Street, Dooky.",
            "title_similarity": "0.37796682",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzon91i",
            "score": 2,
            "text": "The scum that do this target kids also.  They make apps and sites that kids \"play\" that ask the kids their parent's info and the kids happily post it.  I had to have a talk with my kids about this about 10 years ago when my daughter starts asking me and my wife our favorite color, favorite dog, last 4 of SS, etc.\n\nI've even received calls from my in-law telling me that microsoft called him to tell him that his pc is infected and can I talk with the guy.  Told him to power off his laptops immediately as it's a scam.",
            "title_similarity": "0.75750136",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzonbsi",
            "score": 3,
            "text": "Also, just don't answer them in general because even the ones that aren't data mining (what was the last thing you ate) are fucking stupid and no one gives a fuck.",
            "title_similarity": "0.5311707",
            "sentiment_compound": -0.8643
        },
        {
            "id": "gzonf3e",
            "score": 2,
            "text": "99% of these are actual jokes and would never show up as a security question and the last 1% are posts like this warning of the ones that don't exist.",
            "title_similarity": "0.66929567",
            "sentiment_compound": 0.4854
        },
        {
            "id": "gzonn6x",
            "score": 1,
            "text": "For that matter, stop answering all these 'random so cool /r/AskReddit &c' questions.  All of them are just psych profiling you.  I've written these questions.  It's to tag you with certain marketing attributes.  Really. Stop.",
            "title_similarity": "0.60455835",
            "sentiment_compound": 0.1276
        },
        {
            "id": "gzonnky",
            "score": 1,
            "text": "Answer them with only lies",
            "title_similarity": "0.24979785",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzonouo",
            "score": 1,
            "text": "This is basically a repost",
            "title_similarity": "0.040522903",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzonrlo",
            "score": 1,
            "text": "To piggyback on your lpt, it’s even better if you make up answers for your banking security questions",
            "title_similarity": "0.42468303",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzoo2lj",
            "score": 1,
            "text": "Honda 69th and golden retriever",
            "title_similarity": "0.2262775",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzooc2e",
            "score": 1,
            "text": "Does anyone actually answer the questions truthfully? I always make them up lol",
            "title_similarity": "0.37159967",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzoos81",
            "score": 1,
            "text": "So what’s your social security number",
            "title_similarity": "0.21041322",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzop0y2",
            "score": 1,
            "text": "Just like those \"I bet you can respond to this post with a two letter word, no one can!\" And a bunch of people are like \"to\" ... \"At\" ... \"oh\" ...I mean obviously your profile information is being collected...",
            "title_similarity": "0.6259644",
            "sentiment_compound": 0.4753
        },
        {
            "id": "gzopcxo",
            "score": 1,
            "text": "So basically a plot device of Now You See Me?",
            "title_similarity": "0.011554584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzopf86",
            "score": 1,
            "text": "People, your security answers don't have to be truthful, only consistent.  Your first pet?  Make some shit up that you'll remember.  Your first car?  Put in what your first dream car was.  Your first job?  Put whatever it was you wanted to be when you were a kid.",
            "title_similarity": "0.67916226",
            "sentiment_compound": 0.5171
        },
        {
            "id": "gzopfsy",
            "score": 1,
            "text": "I've been kindly saying this to Facebook \"friends\" for years, and was figuratively thrown rocks several times for it. Too many people desperately want to tell the world the name of their first pet.\n\nSo I stopped doing it. When they get charged for a new car they didn't buy, I'll be the one laughing.",
            "title_similarity": "0.8079779",
            "sentiment_compound": 0.6395
        },
        {
            "id": "gzopqm7",
            "score": 1,
            "text": "OR, give 100% wrong answers every time.",
            "title_similarity": "0.38687733",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzopyt1",
            "score": 1,
            "text": "Jokes on them all my passwords are passwords",
            "title_similarity": "0.47531384",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzoq3b6",
            "score": 1,
            "text": "I've seen these warnings 100× more than I've seen people on my feed post anything like what it's warning about.",
            "title_similarity": "0.5035298",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzoq8ev",
            "score": 1,
            "text": "Yeh cause the banks security questions are totally what was your first car? 🤣🤣",
            "title_similarity": "0.7196595",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gzoqa1s",
            "score": 1,
            "text": "The answer to every security question is just my special security question password. \"Who was your mother's maiden golf cart?\" QUESTIONpassword12345. ezpz lemon weazy.",
            "title_similarity": "0.6956981",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gzoqf5x",
            "score": 1,
            "text": "Bonus tip:  Thanks to Facebook, you may not even need to reply to these posts to give away your security questions.  Most of them are already freely available on your profile.  I never answer security questions honestly.  My bank doesn't need to know what the actual name of my childhood pet was.",
            "title_similarity": "0.7618036",
            "sentiment_compound": 0.9129
        },
        {
            "id": "gzoqsqf",
            "score": 1,
            "text": "This is why I have set security question answers, which have nothing to do with actual facts about myself.",
            "title_similarity": "0.4869538",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoqvbe",
            "score": 1,
            "text": "I was applying for a job that asked for my credit card number. I could have sworn it was a scam so I googled it... It wasn't.  \n\nNeedles to say I didn't apply, but it's insane what people ask for anymore",
            "title_similarity": "0.7128991",
            "sentiment_compound": -0.6059
        },
        {
            "id": "gzoqxg8",
            "score": 1,
            "text": "Model T ford, Main Street, a Talbot.",
            "title_similarity": "0.29954213",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzor47l",
            "score": 1,
            "text": "LoL if they only knew that my first car's model isn't even made yet 😂",
            "title_similarity": "0.56757385",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzorag7",
            "score": 1,
            "text": "Wait, people use social media?",
            "title_similarity": "0.21470588",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzorerf",
            "score": 1,
            "text": "Bimmer Maple Odie seems like a good rockstar name",
            "title_similarity": "0.18422022",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzorgy8",
            "score": 1,
            "text": "I was looking through Tom Scott's old videos yesterday and stumbled on this [fairly relevant video](https://www.youtube.com/watch?v=cYVBshcN7wU) from 10 years ago where he basically breaks down flaws of social media. At one point he goes through a guys facebook and finds his DoB, mothers maiden name, his phone number and some other identifying stuff. Now this was 10 years ago, but I imagine its still not too far off from how it is.",
            "title_similarity": "0.666502",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gzorldd",
            "score": 1,
            "text": "I don't care.  Geo \"BumBum\" Harding was, is, and forever shall be, my porn name.",
            "title_similarity": "0.49918288",
            "sentiment_compound": -0.3875
        },
        {
            "id": "gzorqid",
            "score": 1,
            "text": "Your robot name is your credit card number the expiration date and the 3 digits on the back! whats your robot name?",
            "title_similarity": "0.5566205",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gzorzih",
            "score": 1,
            "text": "Give wrong answers to really mess with them. \n\nStreet you grew up on: Sesame Street\n\nNumber: 8675309 \n\nMake it funny",
            "title_similarity": "0.47676486",
            "sentiment_compound": -0.4005
        },
        {
            "id": "gzos4h3",
            "score": 1,
            "text": "Just use a childhood friend's answers",
            "title_similarity": "0.2604444",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzosjio",
            "score": 1,
            "text": "Who still uses security questions though",
            "title_similarity": "0.21348023",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzot0wz",
            "score": 1,
            "text": "Joke's on them, all my security question answers are \"123\".",
            "title_similarity": "0.5554088",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzot23f",
            "score": 1,
            "text": "Jokes on them when I don’t even remember my online answers",
            "title_similarity": "0.4693671",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzota4z",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.017717285"
        },
        {
            "id": "gzotj6k",
            "score": 1,
            "text": "It's so wild that we still have to teach people to recognize phishing scams like this. People who were born after the internet was widely public.",
            "title_similarity": "0.66915226",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzots3b",
            "score": 1,
            "text": "Lmfao.. isn't it obvious?",
            "title_similarity": "-0.11726445",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzotzmm",
            "score": 1,
            "text": "2006 Nissan Pulsar, Rainbow Close, Henry..... haha!!! Share around 🤣",
            "title_similarity": "0.36315632",
            "sentiment_compound": 0.851
        },
        {
            "id": "gzou3wz",
            "score": 1,
            "text": "Or, if you recognise them as questions fishing for personal details, fill them in creatively. Put intentionally wrong data into those malicious databases.",
            "title_similarity": "0.46980217",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzou3yf",
            "score": 1,
            "text": "Wait a minute, so your telling me that I shouldn’t have typed out my social security number, full name and birth date to determine my rapper name? There’s no way that that could be a scam",
            "title_similarity": "0.6592759",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzou8n6",
            "score": 1,
            "text": "People are so goddamn gullible these days",
            "title_similarity": "0.17353943",
            "sentiment_compound": -0.7763
        },
        {
            "id": "gzouab3",
            "score": 1,
            "text": "My friends keep posting this shit. The ONLY ones that I do are ones where the answers won't ever have anything to do with anything. Like \"Last food you ate\" style ones. The others, fuck that. I know better.",
            "title_similarity": "0.64097583",
            "sentiment_compound": -0.0644
        },
        {
            "id": "gzoufvf",
            "score": 1,
            "text": "Password managers FTW.\n\nPut gibberish for the answers, save it in the password vault.",
            "title_similarity": "0.479613",
            "sentiment_compound": 0.7865
        },
        {
            "id": "gzoug8s",
            "score": 1,
            "text": "Its so obvious I prefer to let Nature do its thing.",
            "title_similarity": "0.05685384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoujjz",
            "score": 1,
            "text": "The real pro tip: You're not *actually* supposed to answer those security questions with the real answers. They're passwords just like your regular password. When they ask what your first dog's name is, you're supposed to type in F9zA90ynEciz, not Fluffy.",
            "title_similarity": "0.7023467",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzoukb8",
            "score": 1,
            "text": "Your social security is now the total money in your bank account..... how rich are you?",
            "title_similarity": "0.33136633",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzouko1",
            "score": 1,
            "text": "I always fill in with the most unexpected answer. Like the model of your first car: diesel\nFirst pet: my brother",
            "title_similarity": "0.6441388",
            "sentiment_compound": 0.4144
        },
        {
            "id": "gzoumie",
            "score": 1,
            "text": "The best thing you can do for Internet security is use a password manager. Use it to create truly complex passwords, different passwords for each account, and to keep track of all the lies you tell for the security questions (and different lies for the same question on different accounts).  Edit: Oh, and turn on 2 factor authentication wherever possible.",
            "title_similarity": "0.58018684",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzouny3",
            "score": 1,
            "text": "If anyone is dumb enough to answer those questions  they deserve everything they get",
            "title_similarity": "0.32521933",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzov6an",
            "score": 1,
            "text": "I think anyone dumb  and vain enough to fall for that stuff deserves to be hacked.",
            "title_similarity": "0.45400274",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gzov9f2",
            "score": 1,
            "text": "You should never answer any of the \"security questions\" with real information in the first place. Answer them with nonsense or randomly generated words. Consider them to be just like passwords. And keep them in a secure password-saving program.\n\nNot only is the above a decent reason to not use real info, another reason is that, if you do use actual information about yourself and it gets compromised, you can't change it. Your mother's maiden name is your mother's maiden name forever.\n\nAnd, real info can be researched outside of you providing it. The city you were born in is a fact that can be looked up with a little work.",
            "title_similarity": "0.6691667",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzovb1x",
            "score": 1,
            "text": "Unless you are smarter about those security questions. Don't answer them with real information. I use a password manager and generate a distinct 20+ character string for each answer. No one will ever guess them, I don't even know the answers to my fucking security questions.",
            "title_similarity": "0.7427943",
            "sentiment_compound": 0.7089
        },
        {
            "id": "gzovxem",
            "score": 1,
            "text": "Nobody is using these memes for that purpose, stop spreading rubbish.",
            "title_similarity": "0.4753527",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzovzop",
            "score": 1,
            "text": "That's why I read and answer in my head, chuckle if it's cool or funny sounding, then keep scrolling",
            "title_similarity": "0.30589718",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzowa1a",
            "score": 1,
            "text": "Most of the people who reply to these kinds of posts don't have a banking account.",
            "title_similarity": "0.45063084",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoweip",
            "score": 1,
            "text": "I use my password generator to generate an answer and then save it in the text are of my password manager.  First dog? 7LIEI9jwlme77!!",
            "title_similarity": "0.58846664",
            "sentiment_compound": 0.5837
        },
        {
            "id": "gzowgrq",
            "score": 1,
            "text": "Any “10 year challenge” is free content for facial recognition software.",
            "title_similarity": "0.4180544",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzowiwn",
            "score": 1,
            "text": "Joke’s on you. I lie in my security questions.",
            "title_similarity": "0.3979678",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzowojv",
            "score": 1,
            "text": "I say it in my mind, lol, and move on.",
            "title_similarity": "0.096082225",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzowqah",
            "score": 1,
            "text": "People actually answers those correctly? Wow TIL",
            "title_similarity": "0.04035358",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzowrci",
            "score": 1,
            "text": "Oh noes, I never realized!!!",
            "title_similarity": "0.202908",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoxnq2",
            "score": 1,
            "text": "Great tip thanks for sharing",
            "title_similarity": "-0.0010274071",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gzoxofh",
            "score": 1,
            "text": "Play stupid games win stupid prizes",
            "title_similarity": "0.2797014",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoxp9x",
            "score": 1,
            "text": "I think only morons do these though",
            "title_similarity": "0.30889565",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzoxxoy",
            "score": 1,
            "text": "“Times like these countless individuals seemed to be in a competition to show just how smart most people aren’t.”",
            "title_similarity": "0.5038923",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzoy18b",
            "score": 1,
            "text": "Sounds like someone doesnt know what kind of bread they are, loser",
            "title_similarity": "0.38074797",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzoydwt",
            "score": 1,
            "text": "What if you use fake answers? Like I answered that I honemooned on Mars???",
            "title_similarity": "0.3346305",
            "sentiment_compound": -0.3736
        },
        {
            "id": "gzoyidz",
            "score": 1,
            "text": "Omg...this is the first life pro tip that I gasped at and thought “I’m an idiot.  I had no idea.”  Goddamn it. Good job OP.  You might have saved a bunch of people potentially getting scammed.  OMG I can’t get over this. I feel like a dum dum it never occurred to me. 😫",
            "title_similarity": "0.6128057",
            "sentiment_compound": 0.33
        },
        {
            "id": "gzoykqa",
            "score": 1,
            "text": "Good thing all my answers are random letters LMAOO",
            "title_similarity": "0.4347674",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzoymj4",
            "score": 1,
            "text": "Unless you’re like me and lie on those security questions. “What’s your mother’s maiden name?” Answer: Fortytwo. \n\nOops, gave that one away! (Or did I?)",
            "title_similarity": "0.5490155",
            "sentiment_compound": 0.6759
        },
        {
            "id": "gzoyoi9",
            "score": 1,
            "text": "THANK YOU!! I have been saying this for MONTHS now",
            "title_similarity": "0.21577603",
            "sentiment_compound": 0.5882
        },
        {
            "id": "gzoyqa6",
            "score": 1,
            "text": "Lol how many of us did the “Find your porn star name” MySpace posts.",
            "title_similarity": "0.5858061",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzoyr81",
            "score": 1,
            "text": "Thank you for posting this.  It's something I never thought about, and I consider myself pretty sharp.  I'm sure you have helped far more people today than just me.  Thanks again.",
            "title_similarity": "0.42849064",
            "sentiment_compound": 0.872
        },
        {
            "id": "gzoyxqv",
            "score": 1,
            "text": "Wow. Good thought.",
            "title_similarity": "-0.19714403",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gzoyxtu",
            "score": 1,
            "text": "Volvo birchcricket\n\n oh wait, what are we doing?",
            "title_similarity": "0.3340581",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoz1ei",
            "score": 1,
            "text": "Ah, yes, my rock star name is cute car random numbers nonexistant.... Nice",
            "title_similarity": "0.44760704",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzoz1lz",
            "score": 1,
            "text": "Man this whole time I was just avoiding them because they're fucking stupid",
            "title_similarity": "0.4339267",
            "sentiment_compound": -0.7264
        },
        {
            "id": "gzoz8vf",
            "score": 1,
            "text": "\"So what was YOUR mother's maiden name growing up?\"",
            "title_similarity": "0.23284274",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzozhjn",
            "score": 1,
            "text": "honestly, if you have a password manager (you should totally get one), you can treat those questions basically like additional passwords.",
            "title_similarity": "0.36524695",
            "sentiment_compound": 0.802
        },
        {
            "id": "gzozk42",
            "score": 1,
            "text": "“First name is your least favorite soda, last name is your favorite soda.”",
            "title_similarity": "0.38875288",
            "sentiment_compound": 0.1331
        },
        {
            "id": "gzozrs9",
            "score": 1,
            "text": "These secret questions are the absolute worst attempts at security out there. Whoever thinks that they should implement them on their website needs to find a new career.",
            "title_similarity": "0.6430031",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzozsip",
            "score": 1,
            "text": "Put in your credit card and the 3 magical numbers in the back and I'll yell your fortune",
            "title_similarity": "0.53780794",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzp0tnr",
            "score": 1,
            "text": "Many of these things are known through other methods: street info often comes up in background search websites as does enough information to determine mother's maiden name. I have answers to security questions that are known just to me (and I keep a copy of them in my in case of emergency file). My answers are fake, but that also means someone can't stick my name into Google and find out the information.",
            "title_similarity": "0.67334676",
            "sentiment_compound": -0.2846
        },
        {
            "id": "gzp0v8x",
            "score": 1,
            "text": "I use the same response regardless of the question. Which I guess is a security risk mhm",
            "title_similarity": "0.15745373",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzp0vl8",
            "score": 1,
            "text": "So what's your rock star name?",
            "title_similarity": "0.24516855",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp0yd6",
            "score": 1,
            "text": "[Relevant bit about this from my friend Kyle](https://youtu.be/9K5z_kYd6Sg?t=187)",
            "title_similarity": "0.30861697",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzp119x",
            "score": 1,
            "text": "Lol they be like “half your dads name, half your name and then half your moms name is your Anime character name”",
            "title_similarity": "0.4656243",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzp15zn",
            "score": 1,
            "text": "Answer them wrong. Problem solved",
            "title_similarity": "0.091874436",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzp17oo",
            "score": 1,
            "text": "Answer those questions if you want, the real life pro tip is to lie to the bank. Anyone can figure out your mom’s maiden name or any of this other info.",
            "title_similarity": "0.63002276",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzp1e50",
            "score": 1,
            "text": "My Reddit account? 2 factor authentication.\n\nMy bank account? Personal trivia quiz.",
            "title_similarity": "0.57514274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp1ebn",
            "score": 1,
            "text": "My three security questions are just three equally long and random passwords that are stored in my password manager.",
            "title_similarity": "0.56251764",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzp1f3t",
            "score": 1,
            "text": "Honda Stanhope Snoopy is my rock star name",
            "title_similarity": "0.4044336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp1i8l",
            "score": 1,
            "text": "I have patented a derogatory catch-all term for these people. I call them “link clickers”",
            "title_similarity": "0.419576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp1jk5",
            "score": 1,
            "text": "Thanks captain obvious. If people respond to these types of social media posts they deserve to have their identities and money stolen. It’s like how the lottery is a tax on stupid people.",
            "title_similarity": "0.56715184",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzp1kul",
            "score": 1,
            "text": "Beetle East 23rd Shithead is a stupid rock star name.",
            "title_similarity": "0.48081982",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gzp1sr6",
            "score": 1,
            "text": "LPT: don’t answer those social media surveys because nobody fucking needs to hear your answer.",
            "title_similarity": "0.6016322",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp1y0z",
            "score": 1,
            "text": "Lol Digital Darwinism.",
            "title_similarity": "0.18160096",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzp273s",
            "score": 1,
            "text": "“RuneScape doesn’t let you say your password see: *******! Wow!”",
            "title_similarity": "0.5112454",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp2e48",
            "score": 1,
            "text": "Narrow your birthday down to as little as a week by telling us the #1 song on the day you were born.",
            "title_similarity": "0.48399302",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp2ix4",
            "score": 1,
            "text": "The more sensible thing to do is to never answer those questions with the right answer when you first have to complete them on whatever online services ask them.\n\nMothers maiden name? Noddy\nPlace of birth? Hell\nFirst car? Brad Pitt\n\nThat way, when someone asks you the same thing on Facebook, you can answer without even having to worry that you're about to get scammed.",
            "title_similarity": "0.7498579",
            "sentiment_compound": -0.8418
        },
        {
            "id": "gzp2u0l",
            "score": 1,
            "text": "I thought we all learned not to do that during the MySpace days 😅",
            "title_similarity": "0.51898086",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzp2vqy",
            "score": 1,
            "text": "Is there still any site that uses security questions? Other than Minecraft",
            "title_similarity": "0.34362772",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzp33s1",
            "score": 1,
            "text": "Unless you get smart and lie about it on the posts.",
            "title_similarity": "0.290319",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzp3cfb",
            "score": 1,
            "text": "Jokes on them, I use my password as answers for all of those questions.",
            "title_similarity": "0.50201637",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzp3jh6",
            "score": 1,
            "text": "If you need this tip then you should also know that runscape doesn't actually censor your password in public chat.",
            "title_similarity": "0.43715715",
            "sentiment_compound": 0.357
        },
        {
            "id": "gzp3lns",
            "score": 1,
            "text": "I’ve started responding with “Robert'); DROP TABLE Users;--\" \n\n[Credit to XKCD](https://xkcd.com/327/)",
            "title_similarity": "0.42016453",
            "sentiment_compound": -0.0601
        },
        {
            "id": "gzp3q0d",
            "score": 1,
            "text": "Good thing I can’t drive, am homeless and don’t have a dog.",
            "title_similarity": "0.5183157",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzp3zdn",
            "score": 1,
            "text": "LPT: Don’t put any personal information on the internet at all.",
            "title_similarity": "0.4676636",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp3zgg",
            "score": 1,
            "text": "Your first Mom’s credit card number, expiration date, and three digit number on the back. But you gotta hurry!",
            "title_similarity": "0.51220423",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gzp4858",
            "score": 1,
            "text": "Don't post your birthday either.",
            "title_similarity": "0.36987406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp4cek",
            "score": 1,
            "text": "on behalf of the hackers legion SE #362...we are issuing this cease and desist notice to stop informing our prey on how we manipulate them. your making our easy jobs slightly less easy and if we liked to work hard do you think we would be stealing data for a living.\n\ndo we come to your work and tell your boss how you took 3 shit breaks and 9 smoke breaks. no ken, we dont, so lets have some reciprocity.",
            "title_similarity": "0.6489545",
            "sentiment_compound": -0.6214
        },
        {
            "id": "gzp4eny",
            "score": 1,
            "text": "This is natural selection, but on the internet.",
            "title_similarity": "0.363188",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gzp4prs",
            "score": 1,
            "text": "I answer all my security questions with totally irrelevant answers.",
            "title_similarity": "0.60377914",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzp4qyn",
            "score": 1,
            "text": "Jokes on them, the answers to my security questions answer those questions in vague ways, an example I don't use anymore is \"what high school did you attend?\" with the answer \"The Dumb One\". Or like \"What street does your best friend live on\" with the answer \"Across From Taco Bell You Cant Miss It\"\n\nChoose a grammar pattern to stick to it across all your security answers as well, like in those examples: first letter always capitalized, no punctuation. Another one could be all caps, always punctuate with an exclamation. Or always use underscores instead of spaces, last letter always capitalized.",
            "title_similarity": "0.7513126",
            "sentiment_compound": 0.9306
        },
        {
            "id": "gzp4voe",
            "score": 1,
            "text": "The real LPT here is whenever you get a \"security question\" (read: easy avenue of attack) always fill the answer with random shit and keep it in a password manager like Bitwarden or Keepass.",
            "title_similarity": "0.58145",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzp4wcg",
            "score": 1,
            "text": "And this is why you don't use an answer remotely related to the question. If it's a question like \"Name of your first pet\" then use something like \"Uncle's Toe\" and not the actual name.",
            "title_similarity": "0.53585136",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzp4wgh",
            "score": 1,
            "text": "I never remember these stupid safety questions so I always know whatever it is the answer is \"idontknow\"",
            "title_similarity": "0.5784489",
            "sentiment_compound": 0.6784
        },
        {
            "id": "gzp53ri",
            "score": 1,
            "text": "Jokes on them. I use my third dogs name on those questions.",
            "title_similarity": "0.39345914",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzp5ary",
            "score": 1,
            "text": "Hacker rule number #1\n\nWanna crack a password...just try asking for it first",
            "title_similarity": "0.5544604",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzp5h4p",
            "score": 1,
            "text": "I disagree, the real life pro tip is to never answer those questions correctly when they ask you for secret questions.  Most of this type of questions are either guessable or easy to figure out using social engineering.  \n\nUse a password manager store your username and your password I want to ask you for special questions make up gobbledygook answers and store that in your password manager too.",
            "title_similarity": "0.75159895",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzp5in5",
            "score": 1,
            "text": "Mine is Pacer Curtis Snoopy",
            "title_similarity": "0.24660441",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp5m8p",
            "score": 1,
            "text": "Similarly don't use #daughterappreciation, #childappreciation #proudmommy, ect. with public settings. Most importantly when sharing pictures, full names, personal info of your child. \n\nA friend of mine post these hashtags on public all the time with pictures of her toddler daughters naked, birthdays, full names, ect. \n\nLike there are bad people out there. Why would you want the whole world to see that information. You are litrally putting your child in danger. And these are the same people who go on about child abductions, sex trafficking, and so on. Like social media is a goddamn curse man. This is how thing like abductions happen. Boils my blood.",
            "title_similarity": "0.76112306",
            "sentiment_compound": -0.5522
        },
        {
            "id": "gzp5r9b",
            "score": 1,
            "text": "But you gotta admit FordEscortDonnorAvenueMrBarksalot would be a pretty killer stage name.",
            "title_similarity": "0.23511441",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gzp66dp",
            "score": 1,
            "text": "Use fake answers for that shit.",
            "title_similarity": "0.21290705",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gzp6cgz",
            "score": 1,
            "text": "I've always kinda wondered about those and quit commenting on them.",
            "title_similarity": "0.45519334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp78f6",
            "score": 1,
            "text": "So basically, stay away from r/askreddit",
            "title_similarity": "0.24546216",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp7icx",
            "score": 1,
            "text": "LPT for complete idiots and children.",
            "title_similarity": "0.29066417",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp863h",
            "score": 1,
            "text": "Ford Rural route seven sandy ,\nNot very “rock star”",
            "title_similarity": "0.3139127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp8v82",
            "score": 1,
            "text": "My rockstar name is Jenny's phone number.\n\n&#x200B;\n\nYou're welcome.",
            "title_similarity": "0.38704517",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzp92w4",
            "score": 1,
            "text": "just let them, dumb fucks",
            "title_similarity": "0.1723221",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzp94de",
            "score": 1,
            "text": "My pornstar name is Duke LaCrosse.",
            "title_similarity": "0.36833268",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp9pkv",
            "score": 1,
            "text": "Well none of my passwords are linked to any of those questions so I’m good actually.",
            "title_similarity": "0.45845276",
            "sentiment_compound": 0.6461
        },
        {
            "id": "gzp9tk3",
            "score": 1,
            "text": "On the contrary, answer those questions but give wrong information.",
            "title_similarity": "0.20486921",
            "sentiment_compound": -0.631
        },
        {
            "id": "gzp9w5y",
            "score": 1,
            "text": "[Relevant](https://youtu.be/RgzkYLxVa3w)",
            "title_similarity": "0.040476702",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpa6cv",
            "score": 1,
            "text": "Someone I used to be friends with posted one the other day. It was something like \"in honor of the 2021 graduates post your high school, it's mascot, and your graduation year!\" It's like the scammers don't even try lol. Thankfully the person took it down when I told them.",
            "title_similarity": "0.63035405",
            "sentiment_compound": 0.9013
        },
        {
            "id": "gzpa8p9",
            "score": 1,
            "text": "Gotta play their game to win. Now when I answer those security questions my mother’s maiden name is demon midnight.",
            "title_similarity": "0.5117267",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gzpacgc",
            "score": 1,
            "text": "Doesn’t this mostly happen on Facebook and isn’t that really ok?",
            "title_similarity": "0.41179097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpapbt",
            "score": 1,
            "text": "I know right, I laugh every time I see people answering these things",
            "title_similarity": "0.16041449",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzpasi7",
            "score": 1,
            "text": "People are stupid.\n\nI had to tell that exactly to wall street friends. Needless to say, I'm glad they dont handle my retirement",
            "title_similarity": "0.54873765",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzpaxj7",
            "score": 1,
            "text": "People are so fucking dumb it’s incredible.",
            "title_similarity": "0.24741933",
            "sentiment_compound": -0.5956
        },
        {
            "id": "gzpay64",
            "score": 1,
            "text": "I’d answer them privately… in my head. Just because it’s something really funny. To me at least it was funny. \n\nVery rarely do I use such things for my passwords anyway. Most of my passwords now are something stupid like the shoes I’m currently wearing, the color tee shirt I’m currently wearing & what time it is right now.  No hacker is gonna figure that shit out… it’s also very unlikely that I’m going remember or figure it out either.",
            "title_similarity": "0.6304709",
            "sentiment_compound": -0.1548
        },
        {
            "id": "gzpbosy",
            "score": 1,
            "text": "Yeah and let's not train facial recognition software by posting pic challenges like me  15 years ago and me now type shit.",
            "title_similarity": "0.65203375",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzpbp74",
            "score": 1,
            "text": "Dodge twenty first rose",
            "title_similarity": "0.13780852",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpbsbe",
            "score": 1,
            "text": "Also, make the answers to your security questions into a phrase or an answer that isn’t actually true",
            "title_similarity": "0.27295655",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzpbx0y",
            "score": 1,
            "text": "WHAT? My rockstar name ISN’T Camry Second Spot?\n\n/s",
            "title_similarity": "0.46468604",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpceiq",
            "score": 1,
            "text": "Better yet, use random passwords for all your security questions and keep them in a password manager.",
            "title_similarity": "0.5772058",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzpcido",
            "score": 1,
            "text": "I answer them, but incorrectly.",
            "title_similarity": "0.18400967",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpcxvo",
            "score": 1,
            "text": "Who answers those question right?",
            "title_similarity": "-0.047910944",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpd0vw",
            "score": 1,
            "text": "I just want to throw this out there, I never answer those security questions accurately. I have joke answers for each one, for example, my first teacher is always the name of an old game console. My first friend as well. My first pet is always an old favorite cartoon character.  \n\nThe information asked in those security questions can be obtained in various ways. Instead I treat those security questions like setting backup passwords, the answer is not going to be what's asked and only slightly related to the subject in the question.",
            "title_similarity": "0.75679004",
            "sentiment_compound": 0.9498
        },
        {
            "id": "gzpd2wy",
            "score": 1,
            "text": "Lpt, don’t be an idiot",
            "title_similarity": "-0.029179564",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzpd9ha",
            "score": 1,
            "text": "Can't believe people are actually answering craps like this. Forget about boring, people nowadays really have nothing better to do.",
            "title_similarity": "0.46140462",
            "sentiment_compound": -0.5566
        },
        {
            "id": "gzpdi4b",
            "score": 1,
            "text": "Just remember not to answer anything would be any of your passwords!  Better yet, never answer any of those types of questions!",
            "title_similarity": "0.4998956",
            "sentiment_compound": 0.5399
        },
        {
            "id": "gzpdobu",
            "score": 1,
            "text": "LPT:  Don't use publicly available data for security questions.\n\n\"What was your first car\"  a 3059 Australia",
            "title_similarity": "0.64743525",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzpe0vj",
            "score": 1,
            "text": "But those are not the actual answers I put in for my security questions. Example what is your first child’s name: satan.",
            "title_similarity": "0.60470283",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzpee1c",
            "score": 1,
            "text": "Ok, I'm quite disappointed that this has somehow become a top rated LPT post.\nHow exactly? This isn't in any way new information, this isn't some unknown, hidden secret of the internet, this falls in a category that is WAY below common sense.\nIf there's anyone that reads this and thinks; wow, why didn't I think of that? They are already beyond hope, and it's far too late for them, they exposed themselves a long time ago.",
            "title_similarity": "0.6233034",
            "sentiment_compound": 0.633
        },
        {
            "id": "gzpekp9",
            "score": 1,
            "text": "Don't interact with pop culture posts on the internet, there's zero point at all.  Read a book!",
            "title_similarity": "0.52559227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpes5e",
            "score": 1,
            "text": "I saw one of these posts that was, “Lil+ the last thing you purchased” and I was like, wow just add Lil n you have a rap name now? And just thought it was super lame/sad to post.\n\nBut after reading this, I realized the last thing you purchased is often a verification question/option on your bank or credit card. Sneaky sneaky.",
            "title_similarity": "0.7137494",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzpfhi6",
            "score": 1,
            "text": "Just today saw them for the street you live on and your first job.",
            "title_similarity": "0.35962868",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpfw2m",
            "score": 1,
            "text": "What’s your favorite 3 digit number? Hint: it’s on the back of your credit card.",
            "title_similarity": "0.43306953",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gzpg8p1",
            "score": 1,
            "text": " This would’ve been useful advice to 2004 MySpace me",
            "title_similarity": "0.22085339",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzpgfqk",
            "score": 1,
            "text": "Since I randomly generate answers to such questions, and store them in my password manager, it doesn’t matter. \nWhat was the first car you owned? LKGHycadjgwBBWPs\n:-)",
            "title_similarity": "0.6439799",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzpgsha",
            "score": 1,
            "text": "Lol. Let people have fun. The real trick is to set your security questions as also passwords, not actual answers. You could even even use the same ones across accounts if you're bold, I don't think I've seen a data breach leak security answers or care to (but its possible)\n\n'Oh what street I grew up on? Why as6_Hsk@hwk69plx avenue of course'",
            "title_similarity": "0.63921154",
            "sentiment_compound": 0.7615
        },
        {
            "id": "gzpgsy2",
            "score": 1,
            "text": "Mother's maiden name security question. Answer is public knowledge via census data, so I just supply a bogus name, like fatdog. (Haven't used that)",
            "title_similarity": "0.6780586",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzpgy0u",
            "score": 1,
            "text": "Yeah yeah but tell about your favorite way to get fleeced?",
            "title_similarity": "0.12950563",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzph2pu",
            "score": 1,
            "text": "I can’t remember my own answers half the time, good luck getting any reliable answersp",
            "title_similarity": "0.42375067",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gzph7iz",
            "score": 1,
            "text": "Find out your porn name! Your first name is your credit card number, middle name is the expiration date, and last name is the security code on the back! Lol, let's see some crazy porn names!",
            "title_similarity": "0.6173196",
            "sentiment_compound": 0.7633
        },
        {
            "id": "gzphpl5",
            "score": 1,
            "text": "I literally just got downvoted to hell for saying nearly the same shit on a local reddit post.- Dumb ass people following a link posted on reddit to see if they are entered into the covid19 vaccine lottery. Apparently the chance at prize is enough reason to ignore all common sense and give out your personal information on an unverified link.",
            "title_similarity": "0.71815485",
            "sentiment_compound": -0.9217
        },
        {
            "id": "gzpi8dx",
            "score": 1,
            "text": "This is true and needs to become outdated fast. I'm seeing some progression but it's no where near enough. 2FA through text or calls also need to be phased out.",
            "title_similarity": "0.42095238",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzpichs",
            "score": 1,
            "text": "I've literally never encountered a single social media post like that.",
            "title_similarity": "0.44032252",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzpick5",
            "score": 1,
            "text": "LPT:  Lie on your security questions and keep your answers in a password keeper.  \nI'm happy to divulge my streetname in these because I can guarantee that I have never answered a security question with this.  \nAll the answers I know (I have standard answers for each question.  Just none are honest).  \nRemember.  They're security questions.  Not honesty questions.  Making the answer to a security question hard to guess is just as important as having a hard to guess password.",
            "title_similarity": "0.6596645",
            "sentiment_compound": 0.674
        },
        {
            "id": "gzpipkd",
            "score": 1,
            "text": "No way this is the case, [Here](https://m.youtube.com/watch?v=dQw4w9WgXcQ) is my rock star name",
            "title_similarity": "0.53812075",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzpiugo",
            "score": 1,
            "text": "Not to mention they’re the most banal threads in existence...",
            "title_similarity": "0.21920091",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpj9jv",
            "score": 1,
            "text": "This is why I never give the real answer for security questions. I can tell you my mother’s maiden name because for security questions it’s Johnson. Edit: oh shit.",
            "title_similarity": "0.67810154",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzpjvg7",
            "score": 1,
            "text": "Wow.. its 2021 and people still don't know this.. Holy shit..",
            "title_similarity": "0.26571834",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzpk67h",
            "score": 1,
            "text": "I dont protect complete idiots.",
            "title_similarity": "0.24145977",
            "sentiment_compound": -0.2924
        },
        {
            "id": "gzplhqm",
            "score": 1,
            "text": "My sister does at least one a week 🙄",
            "title_similarity": "0.16428557",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpljtb",
            "score": 1,
            "text": "Don’t listen to OP’s, he’s just trying to keep the good usernames for himself.  Try this one: your mothers maiden last name followed by the last 4 of your social followed by your first pet. GO",
            "title_similarity": "0.6989587",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzpm4pp",
            "score": 1,
            "text": "Jokes on them I use random words from a made-up language for my passwords",
            "title_similarity": "0.50954473",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzpmlx7",
            "score": 1,
            "text": "It’s more annoying than anything. Whenever your scroll, it’s a constant onslaught of aunts and uncles, dads and moms answering these fucking questions",
            "title_similarity": "0.5501925",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gzpmmug",
            "score": 1,
            "text": "NEVER answer security questions with correct answers. The system doesn't know if your answers are truthful or not, it only knows the answers you provide.  \nQ: What's the name of your first pet? A: Green Rocks  \nQ: What's your mother's maiden name? A: Quacking Duck ...  \nand keep an air gapped file with the correct answers.",
            "title_similarity": "0.6972009",
            "sentiment_compound": 0.3235
        },
        {
            "id": "gzpmr6c",
            "score": 1,
            "text": "I usually answer in my head just for fun, even though I know how ridiculous and meaningless it is. But never ever would I comment that information",
            "title_similarity": "0.5646777",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gzpms6e",
            "score": 1,
            "text": "Today I saw where you were married and also have seen first pet, first Street, cartoon characters,  last book and I just face palm.",
            "title_similarity": "0.47552395",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpn09r",
            "score": 1,
            "text": "Took one of those the other day, apparently my stripper name is \"492427393 Skittles Huntington Ave\". I thought I had a bad stripper name.",
            "title_similarity": "0.527848",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzpn9ie",
            "score": 1,
            "text": "jokes on them, i can't get into my own account because i made up fake answers for my security questions\n\n&#x200B;\n\n..wait",
            "title_similarity": "0.6535638",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzpnhi9",
            "score": 1,
            "text": "Doesn't everyone use the suggested password? Xsilbg37$#-)BCG/63**,",
            "title_similarity": "0.4630657",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpnuc2",
            "score": 1,
            "text": "LPT: Answer them all. ^(The answer is always penis.)",
            "title_similarity": "0.41535652",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpnzb2",
            "score": 1,
            "text": "This is how Guccifer hacked so many famous people’s email accounts; the answers to their security questions were basically available on Wikipedia or with some easy googling.",
            "title_similarity": "0.6697403",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzpodd7",
            "score": 1,
            "text": "LPT: Don’t use the real answer as your security answer.",
            "title_similarity": "0.32401243",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzpp6yo",
            "score": 1,
            "text": "I see OP is a man of culture and has also seen Now You See Me.",
            "title_similarity": "0.08934234",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpp9qg",
            "score": 1,
            "text": "I always answer security password.",
            "title_similarity": "0.40743172",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzppi0q",
            "score": 1,
            "text": "morons answer those security questions truthfully. my first pets name was kwQb)2mT-j when i need to have security questions. yes, i’ve had to read out those answers on the phone to a live person.",
            "title_similarity": "0.67690486",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gzppkr0",
            "score": 1,
            "text": "Ohhhhh, but they're so FUN!!!",
            "title_similarity": "-0.08282277",
            "sentiment_compound": 0.8782
        },
        {
            "id": "gzppmms",
            "score": 1,
            "text": "What's your favorite social security number?",
            "title_similarity": "0.29209167",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzppu1l",
            "score": 1,
            "text": "I’ve always used 1password/lastpass to save random answers as separate fields within the entry itself. \n\nI consider access to 1password or lastpass an acceptable requirement for me to be able to access any account I have; even for “security questions”.",
            "title_similarity": "0.5540146",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzppue0",
            "score": 1,
            "text": "Ram Meeyenmye Butthole. Take that hackers.",
            "title_similarity": "0.39801675",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzppxgz",
            "score": 1,
            "text": "I have fake answers for all of my security answers. Here’s hoping I never get Alzheimer’s or general memory loss, because I’ll never regain access.",
            "title_similarity": "0.65502167",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzpqkcj",
            "score": 1,
            "text": "What I do is use a password generator for those questions. If I ever need to use the recovery questions it's all saved for me and it's just a bunch of random nonsense.\n\nNow the real pain is if you need to call someone to recite them, thats a doozy but worth the hassle.",
            "title_similarity": "0.61185336",
            "sentiment_compound": -0.1655
        },
        {
            "id": "gzpqp73",
            "score": 1,
            "text": "People are so fucking stupid",
            "title_similarity": "0.14988786",
            "sentiment_compound": -0.6087
        },
        {
            "id": "gzprmx7",
            "score": 1,
            "text": "You should also be careful about what information you share about your kid in these, it could lead to identity theft or kidnapping: https://www.reddit.com/r/LifeProTips/comments/n8sngc/lpt_dont_participate_in_facebook_copy_chain_posts/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.6016724",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzprwab",
            "score": 1,
            "text": "But...I wanna see if I’m sourdough bread.",
            "title_similarity": "0.29635313",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpryqt",
            "score": 1,
            "text": "Better LPT: use a password store (like BitWarden or LastPass, KeePass if you don't trust cloud services; there are many others), and set the forgot password answers to a random password (preferably pronounceable if you ever need to repeat it to someone over the phone) because that's what it is: a bad password typically with a poor 2-factor using your email.",
            "title_similarity": "0.6564307",
            "sentiment_compound": -0.5996
        },
        {
            "id": "gzpsgby",
            "score": 1,
            "text": "My tip for security questions nobody knows: Create an imaginary universe and use that to create answers.",
            "title_similarity": "0.52852196",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzpsrhz",
            "score": 1,
            "text": "Uh, pretty sure you’re posting this in the wrong place. \n\nFind your local mothers group on Facebook and post it there.",
            "title_similarity": "0.6393168",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzpsrzg",
            "score": 1,
            "text": "I never understood why people felt the urge to share something like that; like, who the fuck cares what car you had first. Now I know, assholes who take advantage of idiots.",
            "title_similarity": "0.6560419",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzpsxe5",
            "score": 1,
            "text": "That's why all my security questions are in-jokes, references and me-specific factoids that refer to hyperspecific events in my life that I would never tell anyone.",
            "title_similarity": "0.6972448",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzptpgs",
            "score": 1,
            "text": "The same goes for like half of AskReddit questions.",
            "title_similarity": "0.27132997",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzpts0a",
            "score": 1,
            "text": "I always just say that as a response in there but people are like, \"Hurr durr, you're just no fun.\"\n\nPart of me kind of thinks if you're that dumb and inconsiderate of someone trying to help, you kinda deserve it.  I know that isn't correct though.",
            "title_similarity": "0.43377686",
            "sentiment_compound": -0.723
        },
        {
            "id": "gzpuqlg",
            "score": 1,
            "text": "Jokes on them, I always use the same answer for every question and it's:",
            "title_similarity": "0.36645257",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzpv6d6",
            "score": 1,
            "text": "My wife is so careful, doesn't surf Facebook or too many sites. Her social security number & identity got hacked. It took us two years too fix. Turns out the hackers got her info from her employer. They denied it until the very end.",
            "title_similarity": "0.72877383",
            "sentiment_compound": -0.1983
        },
        {
            "id": "gzpv9c1",
            "score": 1,
            "text": "I usually put the stupidest answers on security questions. Write it down on a note card and tuck it away- same goes to passwords.",
            "title_similarity": "0.5962907",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzpvhmx",
            "score": 1,
            "text": "I set up a lot of computers that aren’t in their final form. So account name is Temp but all 3 security questions are ‘blank’. I want someone who can draw cartoons to draw a kid with a dog standing on the corner of blank street. The dog collar says blank and there’s a bully kid yelling from afar, ‘....nice shirt *blank*, you fat f***!’",
            "title_similarity": "0.71653533",
            "sentiment_compound": -0.2598
        },
        {
            "id": "gzpvjb4",
            "score": 1,
            "text": "Unless any of the security measures ask what’s the last thing I ate and the color of my shirt... I think we’re good lol",
            "title_similarity": "0.44363716",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gzpvo7x",
            "score": 1,
            "text": "I remember as far back as the late 90s a girl I knew asked everyone to do their \"rockstar names\" at a party. Perhaps she innocently though it would be fun. But she was a sketchy person who I would put nothing past. I fabricated an answer for both the purpose of not revealing my mother's maiden name, and making my \"rockstar name\" sound a lot cooler than it was. My mom didn't have a cool sounding last name, compared to the one my friends think it was. Pretty sure to this day they all think she had a gangsta sounding last name, which I just made up.",
            "title_similarity": "0.71680903",
            "sentiment_compound": 0.9281
        },
        {
            "id": "gzpvq2u",
            "score": 1,
            "text": "This is why I never answer those security questions with the actual obvious answer, but something I will still remember. Like I had a dog, 2 cats, a fish, and a pet mantis before I had my first pet rat. I answer the \"what is your first pet's name?\" with the name of that first pet rat. There's only 2 people other than me that MIGHT know his name. My younger brother and mother. But they've probably forgotten by now.",
            "title_similarity": "0.7120384",
            "sentiment_compound": 0.0982
        },
        {
            "id": "gzpwdrv",
            "score": 1,
            "text": "Just remember,  I have no problems giving away your personal information for free tater tots",
            "title_similarity": "0.34792247",
            "sentiment_compound": 0.5457
        },
        {
            "id": "gzpwpqh",
            "score": 1,
            "text": "Also your Grandparents last name on both sides. That one always got me how they would put their family info.",
            "title_similarity": "0.47903726",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpxgat",
            "score": 1,
            "text": "Easy I just dont use my real name on social media. No one is going to know who I am if posting anonymously.",
            "title_similarity": "0.5815013",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzpxsly",
            "score": 1,
            "text": "Oh I love those because I will answer them with something totally nonsensical. What is your mother's madien name Worthieger. Why? It sounds legit. It's fun to see the reactions of people cautioning me not to share personal information online like I didn't teach them that. What's your soc 123-49-8765. Like these things can't be generated in fractions of a second. What's your address 435 Latin dr. \nBwhaha honestly it's way more fun to mess with the people who run the scam.",
            "title_similarity": "0.6782962",
            "sentiment_compound": 0.8943
        },
        {
            "id": "gzpy2rn",
            "score": 1,
            "text": "Oof that this needs to be told...",
            "title_similarity": "0.015583519",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpy8b4",
            "score": 1,
            "text": "Anyone who replies to that shit on Facebook only has themselves to blame if they get theirs shit stolen. \nThese are the same morons that like and share the posts such a as “jerry from Picton has won a Range Rover, but we can’t get a hold of him, so like and share for your chance to win this car!!!!!” And the page that has this competition is something like “Range Rover nsw” \nHave a fucking Bunnings gift card while you’re at it",
            "title_similarity": "0.77988863",
            "sentiment_compound": 0.9705
        },
        {
            "id": "gzpyozr",
            "score": 1,
            "text": "How often is this LPT going to be reposted?",
            "title_similarity": "0.25606632",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpyxoz",
            "score": 1,
            "text": "I use a password manager and use randomly generated passwords for security questions and well as passwords. Impossible to social engineer.\n\nIf I'm ever locked out of my password manager I'm fucked... Except for if I don't log into it for a month it sends an access key to my partner so they can have emergency access to my logins.",
            "title_similarity": "0.78376544",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzpzef1",
            "score": 1,
            "text": "Except I use no real facts in any of my security question. I basically create something like a hash based on the question, my unique code, and the site it is for as an answer, so every site has a different answer even if it is the same.",
            "title_similarity": "0.70093274",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzpzln9",
            "score": 1,
            "text": "Honestly I don't like those security questions being there at all, why ARE they there? most of that is public knowledge already, and I am already using multiple rotating security methods, so that doesn't help, and my answers never work if I ever actually need it anyways because they say my answers are wrong lol  \n\n\nwhich is probably because I give secret answers that I then later forget or change haha   \n\n\nwait why am I responding to this social media post with secrets , damn, guess it's time to change them all again and forget what I changed them to",
            "title_similarity": "0.7064614",
            "sentiment_compound": -0.471
        },
        {
            "id": "gzq0byi",
            "score": 1,
            "text": "Did a long stint in online fraud and criminal money laundering. The one key takeaway I had from the experience?\n\nYou can tell them this until you're blue in the face and they'll still do it.\n\n**no one is safe**",
            "title_similarity": "0.6528301",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzq0eex",
            "score": 1,
            "text": "Your rock star name is the first three letters and the second three letters of the code in that MFA text sent to your phone!",
            "title_similarity": "0.5086044",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq0gkb",
            "score": 1,
            "text": "So what ruining your life is other peoples prerogative 90 % of the time anyway I say let them . \n\nWatch em get shocked when they have and you just don't care .",
            "title_similarity": "0.5675299",
            "sentiment_compound": -0.7357
        },
        {
            "id": "gzq0x9n",
            "score": 1,
            "text": "There was an MMORPG called Neocron that had 100+ accounts hacked over the course of a few days. \n\nWhat happened was a PK (player killer) guild slaughtered some guy. In revenge he created a new character and joined the guild. \n\nHe then posted on their private boards one of these quizzes. He was able to use the answers to get into people’s hotmail accounts, do a reset password on Neocron to loot and delete accounts. \n\nHe only got caught because he bragged about it.",
            "title_similarity": "0.7217577",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gzq1chx",
            "score": 1,
            "text": "Related pro tip: for security questions like this that are repetitive or easy to guess, just fucking lie and make something up. Make sure you write it down in a password journal if you think you'll forget it though.",
            "title_similarity": "0.5843776",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzq1qw5",
            "score": 1,
            "text": "Which is why I always answer my security questions with things that don’t correlate",
            "title_similarity": "0.45739114",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzq1rz7",
            "score": 1,
            "text": "Facebook is just a data cluster fuck.\n\nYou post a picture of your husband's birthday. Later that year, your own. Oh and so exciting! You've got photos of the day your beautiful baby boy came into the world \n\nYou're friends with your parents and siblings and you just shared an old photo of the house you all grew up in with Buster, the family corgi.\n\nMaiden name\n\nDate of birth\n\nHusband and son's date of birth\n\nStreet you grew up in\n\nSiblings names\n\nFirst pet\n\nEtc etc",
            "title_similarity": "0.63742125",
            "sentiment_compound": 0.8836
        },
        {
            "id": "gzq1t9p",
            "score": 1,
            "text": "Lie, as in my first car was the Oscar Meyer Weiner Mobile.",
            "title_similarity": "0.55082893",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq20nt",
            "score": 1,
            "text": "Good advice but never answered those truthfully",
            "title_similarity": "0.321085",
            "sentiment_compound": -0.2867
        },
        {
            "id": "gzq22ag",
            "score": 1,
            "text": "I thought your first street and dog was your pornstar name\n\nEd Petrovitsky at your service :)",
            "title_similarity": "0.6308406",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzq2qrw",
            "score": 1,
            "text": "It’s only a problem if you actually provide real answers to the questions. Which you shouldn’t...",
            "title_similarity": "0.26624262",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzq3xhw",
            "score": 1,
            "text": "And tell your significant other not to answer those posts either. I cringed when one of my relatives posted that her husband's favorite hobby was collecting guns, because he is a felon.",
            "title_similarity": "0.67031467",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzq42dj",
            "score": 1,
            "text": "Dodge Walker Spark! \n\nThat’s actually a damn good rock star name.",
            "title_similarity": "0.29565406",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gzq44m2",
            "score": 1,
            "text": "I’ve always been wary about questions that are too revealing like that. Either ignoring them or answering with joke answers. \n\nFirst car? Yoda’s 2001 Honda Civic. Childhood street? Butts Drive. First pet’s name? Danny Devito.",
            "title_similarity": "0.73294604",
            "sentiment_compound": 0.3695
        },
        {
            "id": "gzq6m4s",
            "score": 1,
            "text": "I hate this.  \"Make a secure password with 120 characters must include capitalized letters, symbols and numbers!  No one will be able to hack you.  Oh and also let me ask you basic unsecure questions anyone can quickly use to reset your password.\"",
            "title_similarity": "0.685899",
            "sentiment_compound": -0.5848
        },
        {
            "id": "gzq6q3b",
            "score": 1,
            "text": "Nofakestreet Null",
            "title_similarity": "0.134399",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq6yed",
            "score": 1,
            "text": "Better yet. Never truthfully answer a security question. Make the answer consistent and memorable and never spoken or written to anyone. \n\nAnd if you can handle the physical memory (brain) make it different for each site. \nAnd",
            "title_similarity": "0.61393636",
            "sentiment_compound": 0.4393
        },
        {
            "id": "gzq7onk",
            "score": 1,
            "text": "Alternatively, have 2 sets of answers. Fake ones that couldn't be real for important stuff and reap ones for bullshit quizes. What school did you go to? Sky High",
            "title_similarity": "0.5137549",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzq89ko",
            "score": 1,
            "text": "Thats why I set answers that don't even match the question",
            "title_similarity": "0.2983271",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq8cm7",
            "score": 1,
            "text": ">Social media\n\nWhat is this you speak of?",
            "title_similarity": "0.22907072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq8fft",
            "score": 1,
            "text": "A \"debt collecting agency\" left a message to call regarding the collection of a debt. When I called, the person said \"to protect your privacy\" can you confirm your middle name. I gave them my middle initial AS my middle name. Then he asked me to confirm my address and last four. Then I told him that that was TOO MUCH infomation. He said \"then, we can't help you\" and I said \"well...then I can't help you.\"  It was definitely  a phishing attempt.",
            "title_similarity": "0.65561223",
            "sentiment_compound": -0.4966
        },
        {
            "id": "gzq9uid",
            "score": 1,
            "text": "I think answering honestly on those questions is a bad idea. Even as a teenager (late 30’s now)  I just put a second unique password as the answer or a lie I can reliably remember for those because I don’t completely trust family and friends either, not just strangers.",
            "title_similarity": "0.6992936",
            "sentiment_compound": 0.7346
        },
        {
            "id": "gzqacxo",
            "score": 1,
            "text": "Name of a new born child is a musst for shitty passwords",
            "title_similarity": "0.5067605",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzqas98",
            "score": 1,
            "text": "do what linus tech tips does. answer nonsensical answers so no one can guess them. like what was you mother’s maiden name? Ferto58gju",
            "title_similarity": "0.59413743",
            "sentiment_compound": -0.0941
        },
        {
            "id": "gzqbsfp",
            "score": 1,
            "text": "I intentionally answer it wrongly. Modern fraudsters require modern solutions",
            "title_similarity": "0.4324213",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzqccwy",
            "score": 1,
            "text": "I always lie through my teeth on the results.\n\nRather make them lock down my account than give them a chance.",
            "title_similarity": "0.59349406",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzqcj1u",
            "score": 1,
            "text": "It’s ok. We all answer them falsely to look cooler than we actually are, right? I mean, no one wants to get Chiaotzu on a “Which DBZ character are you?” Quiz, right?! 🤐",
            "title_similarity": "0.5916639",
            "sentiment_compound": -0.4646
        },
        {
            "id": "gzqcpdy",
            "score": 1,
            "text": "Haha I use different cars and such because well yea I’m not actually gonna use my real shit like anywhere really",
            "title_similarity": "0.5160394",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzqegjy",
            "score": 1,
            "text": "[Reminds me of this frome kimmel](https://youtu.be/opRMrEfAIiI)",
            "title_similarity": "0.1650486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqf1lk",
            "score": 1,
            "text": "My name, my age, my favorite color. date born, pets name, and social number.",
            "title_similarity": "0.33177212",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzqf36l",
            "score": 1,
            "text": "Why would your bank rely on such idiotic questions in the first place? Facebook or whatever sure, but something as vital as a bank?",
            "title_similarity": "0.57463574",
            "sentiment_compound": 0.3632
        },
        {
            "id": "gzqfdb8",
            "score": 1,
            "text": "Except I don’t ever use any of those questions. I’m the kind of guy who uses sentences instead of just names as the answer to my security questions.",
            "title_similarity": "0.56833136",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzqfpnf",
            "score": 1,
            "text": "Jokes on them. My pws are always a bunch of gibberish.",
            "title_similarity": "0.3915938",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzqg4sn",
            "score": 1,
            "text": "I always answer those wrong anyways lol",
            "title_similarity": "0.32304716",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzqgbzc",
            "score": 1,
            "text": "Then tip to answer security questions is to answer something that doesn’t make any sense to the question and only you know. \nEx: what’s your first car model?\nAnswer: Reddit",
            "title_similarity": "0.65599227",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzqgdgz",
            "score": 1,
            "text": "Guess my anxiety of sharing anything personal pays off sometimes.",
            "title_similarity": "0.16083011",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzqh2xo",
            "score": 1,
            "text": "Joke would be on them, want to be secure on \"security\" questions, just have a set of fake answers as your go-to. That way anyone, even those who know all your life details wouldn't know the answers.",
            "title_similarity": "0.5432799",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzqhqvi",
            "score": 1,
            "text": "If any of those grants access to your online banking change it. NOW. If you answer these questions with actual info about you might as well change your password to \"123456\". That would at least save you a lot of time",
            "title_similarity": "0.49449858",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzqkx8s",
            "score": 1,
            "text": "This needs to be said?",
            "title_similarity": "-0.018847827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzql8bq",
            "score": 1,
            "text": "I always make stuff up.",
            "title_similarity": "0.17775844",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqm2sq",
            "score": 1,
            "text": "The trick is to have safe words to answer all those questions that are not real answers. What is yours? ;)",
            "title_similarity": "0.29833716",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzqm6po",
            "score": 1,
            "text": "Yeah, you say that but my Porn Name is Heidi Salami and it's tough to stay quiet",
            "title_similarity": "0.48787785",
            "sentiment_compound": -0.0387
        },
        {
            "id": "gzqmkpc",
            "score": 1,
            "text": "Better ProLifeTip:\n\n\nSocial media is a cancer that is only using your data for profit and cauing unrest. Leave social media platforms and see how much stress is removed from your life",
            "title_similarity": "0.59294397",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzqmtw6",
            "score": 1,
            "text": "If your social security number were the amount of money you had, how rich would you be?",
            "title_similarity": "0.24037547",
            "sentiment_compound": 0.743
        },
        {
            "id": "gzqp9kx",
            "score": 1,
            "text": "If you're dumb enough to answer those questionnaires on social media, you probably deserve to have your identity infiltrated, and you probably already have shit credit anyway.",
            "title_similarity": "0.5611726",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzqplqy",
            "score": 1,
            "text": "shame on them .I custom set my questions ..Let the hackers guess What is my Favourite Pokémon",
            "title_similarity": "0.5710179",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzqq0oe",
            "score": 1,
            "text": "It's 2021. If people haven't learned by now not to provide real answers to security questions, no amount of protection is going to help them, OP.\n\nThis LPT is flawed. The better solution is to tell people to use fictional names or favorite obscure subjects most people won't think about.\n\n\"What's your grandmother's middle name?\" should be answered with anything but your actual grandmother's middle name. What's your favorite fast food item? French fries? Put that as the answer.\n\n\"What was the name of your first pet?\" This is a trigger one for me because too many names can be used here of actual pets, allowing people to easily guess it. Never use the name of any pet you've ever had. Use something stupid, like \"Liquid Aluminum\".\n\n\"What was the mascot of your high school?\" Another trigger question given so many high schools have the exact same mascot. Hell, just using any of the top 20 mascot names is guaranteed to grant entry. Instead, put your favorite teacher here.\n\n\"What was the first model car you owned?\" A bit more flexible, but again, simple information to gain online. My recommendation: use a license plate number. Already difficult to guess, but rarely spoken about.\n\n&#x200B;\n\nThese are but a few examples of how to address online security questions. If you have used real answers, your next step should be updating them, not moving to another subreddit.",
            "title_similarity": "0.64853925",
            "sentiment_compound": 0.9636
        },
        {
            "id": "gzqq7kw",
            "score": 1,
            "text": "This is one of the oldest tricks in the book",
            "title_similarity": "0.21783045",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzqqlut",
            "score": 1,
            "text": "What is that person going to do? Prevent me from going somewhere",
            "title_similarity": "0.17571358",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzqqujd",
            "score": 1,
            "text": "Jokes on you, when I set up online banking my banker told me to just use my favorite food for all the answers to all the security questions",
            "title_similarity": "0.709689",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gzqr5nu",
            "score": 1,
            "text": "Best LPT to gather people's security questions.",
            "title_similarity": "0.25781152",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzqs3q7",
            "score": 1,
            "text": "Gave up telling family this",
            "title_similarity": "0.24074292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqs4wk",
            "score": 1,
            "text": "Hey I'm called Lamborghi Santa Monica Fido, now go steal my informations if you like",
            "title_similarity": "0.47140485",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzqskdf",
            "score": 1,
            "text": "EVEN IF THESE ARE NOT YOUR SECURITY QUESTIONS. One other major point is if you fill this out your online persona is probably going to be targeted...",
            "title_similarity": "0.39132887",
            "sentiment_compound": -0.3774
        },
        {
            "id": "gzqsnb5",
            "score": 1,
            "text": "LPT: never give real answers for those questions on your accounts either.",
            "title_similarity": "0.57004654",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqv797",
            "score": 1,
            "text": "69.6k upvotes, damn",
            "title_similarity": "0.117294565",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzqvyu4",
            "score": 1,
            "text": "Sure give me a minute yo boot up",
            "title_similarity": "0.1174192",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzqyxqw",
            "score": 1,
            "text": "What about your first mother's maiden name?",
            "title_similarity": "0.27283743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr6lf6",
            "score": 1,
            "text": "\\>irony of posting anything  \n\n\nStop using Social Media whatsoever. Seriously. It's not even good. Stop it.",
            "title_similarity": "0.49021286",
            "sentiment_compound": -0.56
        },
        {
            "id": "gzr8hdi",
            "score": 1,
            "text": "My security answers are totally BS anyway. Pick a BS answer and stick to it, it'll keep you safe.",
            "title_similarity": "0.38979286",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzr8sf6",
            "score": 1,
            "text": "T-Model 5th Avenue K9.",
            "title_similarity": "0.13351414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrie3y",
            "score": 1,
            "text": "Is what you call a security expert... for the first dog question I actually used my 3rd or 4th dog for I’ve had. I’m legit a genius. \n\nThen three months later when I forget my password and answer the security question i put my first dog and get locked out.",
            "title_similarity": "0.68375665",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzrwwcf",
            "score": 1,
            "text": "LPT: don’t give “correct” answers to those security questions. Pick anything random.\n\nFirst car? Jet airplane\n\nFirst pet? Patio grill\n\nChildhood nickname? Go fuckyourself",
            "title_similarity": "0.7408396",
            "sentiment_compound": 0.4479
        },
        {
            "id": "gztkmse",
            "score": 1,
            "text": "Nobody alive today knows what my first car or street was. Some of us are totally secure with such questions.",
            "title_similarity": "0.6617874",
            "sentiment_compound": 0.6478
        },
        {
            "id": "gzu4957",
            "score": 1,
            "text": "Yeah. You are right.",
            "title_similarity": "-0.24867499",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzub3e3",
            "score": 1,
            "text": "If someone is so dumb to do that, he is not fit to live in the 21st century.",
            "title_similarity": "0.35952884",
            "sentiment_compound": -0.747
        },
        {
            "id": "gzuiium",
            "score": 1,
            "text": "Jesus how did I not think of that.  Thank goodness I stay away from Facebook and pop in on occasion .. good tip",
            "title_similarity": "0.55075526",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gzx1xrk",
            "score": 1,
            "text": "You're doing it wrong.   \nWhat was my first car IRL? A Mercury Marquis station wagon.  \nWhat was my first car as an answer? FerrariTestaRosa (my dream car - how I remember)\n\nThis way I can tell folks about myself, but it has nothing to do with my security questions, and NOBODY will ever guess the answer. Mother's name? My grandmother's. Father's name? First priest from church. Name of first street I lived on? 123rd street. None of the answers are true, but I can remember them.",
            "title_similarity": "0.7737116",
            "sentiment_compound": 0.8025
        },
        {
            "id": "h018si2",
            "score": 1,
            "text": "This is why i answer those types of security questions with completely random answers when filling out security measures",
            "title_similarity": "0.5779326",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h02lxgp",
            "score": 1,
            "text": "Also, use false answers for the security questions.\n\n\"What was the first film you saw in the cinema?\"\n\n\"Robocop 9\"\n\n\"Where were you born?\"\n\n\"Asgard\"\n\n\"What was your first pet's name?\"\n\n\"Toni Braxton\" \n\nPeople close to you know the answers to your security questions, if one of them decided to fuck up your life for whatever reason, they could. Plus, websites aren't going to give you into trouble for lying. So lie.",
            "title_similarity": "0.702704",
            "sentiment_compound": -0.7461
        },
        {
            "id": "h02wxfz",
            "score": 1,
            "text": "Not even my wife knows my first pets name.",
            "title_similarity": "0.5741429",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02xk5r",
            "score": 1,
            "text": "I use the same 4 words for all my answers. It’s along the lines of “Lord of the Rings” where the first question is always answered with Lord, the second question Of, third question The and last one Rings. If there are only 3 questions you answer the last question with The Rings.",
            "title_similarity": "0.4877236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05w275",
            "score": 1,
            "text": "Somebody is gonna be pissed at me then, I  always just make shit up.",
            "title_similarity": "0.36420432",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h0c44hb",
            "score": 1,
            "text": "Homeless ppl are safe",
            "title_similarity": "0.11689335",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ec6p0",
            "score": 1,
            "text": "i always answer multiple versions of the same question in multiple languages and then save the answers to BitWarden",
            "title_similarity": "0.41093507",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0g4ov4",
            "score": 1,
            "text": "You'd have to an idiot to answer those questions truthfully. Example: who was your favorite teacher?  Answer: my car got a flat",
            "title_similarity": "0.5968174",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0irfv5",
            "score": 1,
            "text": "Sad part? So many (smart,dumb,old,young,educated,uneducated,rich,poor,computer savvy, not computer savvy, well you get the idea) can’t resist playing even it they’ve been told DON’T do it.",
            "title_similarity": "0.5861911",
            "sentiment_compound": -0.4791
        },
        {
            "id": "h26g89x",
            "score": 1,
            "text": "Don't warn them.   Let them figure it out for themselves.",
            "title_similarity": "0.26177043",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h2dptss",
            "score": 1,
            "text": "Counter offer when purchasing;  knock another grand off the price and I will leave your decal on the vehicle.  If not, I will toss it in your garbage before I leave.",
            "title_similarity": "0.56371945",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hl6udz5",
            "score": 1,
            "text": "Good thing I have never told anyone the name of my first pet! And even I can’t remember my kindergarten or 1st grade teacher’s name! Also the first pet It was actually a tank of Multiple fish. And they died when I was very young so I have many possible answers for that!",
            "title_similarity": "0.72681344",
            "sentiment_compound": -0.3769
        }
    ]
}