{
    "LPT: Stop overthinking your tasks. It leads to analysis paralysis and you end up just thinking about work instead of actually doing it. Have a VERY basic plan, and just start working. You'll figure things out along the way.\n": [
        {
            "id": "h1ievxu",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.7175827",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h1isj0c",
            "score": -1,
            "text": "You heard the man! Buy GME!",
            "title_similarity": "0.32955512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ih21j",
            "score": 6,
            "text": "This is very good advice thankyou. I've been swamped with work for days and I spent awhile just trying to organize how i was going to get it done, became overwhelmed and took a break. Decided to take bite size pieces and go with it. It is what it is.",
            "title_similarity": "0.5854726",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h1j2yzw",
            "score": 12,
            "text": "OP: “Life pro tip: have you tried just not having anxiety?”\n\nIdiot.",
            "title_similarity": "0.6007306",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h1iz8cg",
            "score": 8,
            "text": "This is a very good LPT. I have a cognitive impairment where I can become overwhelmed with large, vague tasks. For example, I work as a lawyer and for my first jury trial I was completely freaked out because it's this massive task which I'd never before done. But, I employed the technique my mother taught me, which I internalized starting in elementary school, make a list.\n\nTaking a big, scary task and breaking it down into its composite steps is extremely helpful, even when the list is long. It also helps you to visualize the work needed to be done and more accurately estimate the amount of time it will take. So, in my jury trial example, it looked like this:\n\n1. Write opening statement\n2. Meet with witness one and prepare folder for witness one direct examination.\n3. Meet with Witness two and prepare folder for witness one direct examination.\n4. Research motion to strike issues\n5. Prepare cross-examination points for the defendant. \n\nEtc, etc\n\nNow, even though I'd never before prepared for a jury, I had done all of those composite steps many, many times. Now, my big, vague, scary task is manageable because it's a list of things that I feel confident I have the required skills to accomplish. \n\nAs far as I can tell, this technique is applicable in essentially any field, with pretty much any task. Additionally, by making the list, as you work you cross out what you have accomplished. Crossing out the items allows you to see yours progress, visualize the end of the task, and stay motivated since you know when the task will be complete.",
            "title_similarity": "0.55846524",
            "sentiment_compound": 0.9748
        },
        {
            "id": "h1ijbay",
            "score": 3,
            "text": "I'm really struggling with this.. Thanks op",
            "title_similarity": "0.46418452",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h1ipm3l",
            "score": 17,
            "text": "I hope to god no aerospace engineer, architect, or similar ever takes your advice",
            "title_similarity": "0.46707854",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1jl4te",
            "score": 0,
            "text": "This is the same advice just worded a little different, break your large task into multiple small tasks. Focus on one small task at a time and acknowledge your accomplishment whenever you complete a small task before moving on to the next one.\n\nThis is a big problem with people just learning how to code. They look at the whole problem and are overwhelmed because they don't know where to start, they dont know what to research, they dont know what steps they need to take. As OP said, stop thinking about it and just start doing something. You will make mistakes and you might be a few hours into a project and realize that you have to erase everything you've done and start from scratch. \n\nDon't think, \"oh I just wasted all of that time because I'm stupid.\" \n\nReframe your thoughts to, \"I have learned how not to do this and think that I see a different way of going about it. Now I won't make this mistake in the future. Now let's figure this out.\"\n\nIt's all a learning process. Use your failures as a way to improve and not an anchor that holds you back.",
            "title_similarity": "0.8355857",
            "sentiment_compound": -0.9542
        },
        {
            "id": "h1kls49",
            "score": 0,
            "text": "Analysis Paralysis is a fucking great band name.",
            "title_similarity": "0.3619917",
            "sentiment_compound": 0.659
        },
        {
            "id": "h1l2r2x",
            "score": 0,
            "text": "Analysis Paralysis is a good rap line.",
            "title_similarity": "0.37345204",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1ix9m0",
            "score": 1,
            "text": "I needed this I’ve been paralyzed with fear and being overwhelmed the last couple days \n\nThis is a trap I get myself into often I will remember this thank you kind stranger",
            "title_similarity": "0.5797742",
            "sentiment_compound": 0.2441
        },
        {
            "id": "h1iz51y",
            "score": 1,
            "text": "Yep just get to work. Most tasks take far less time than you think if you focus. I like to tackle the hardest task of the day first. Then it’s done and the rest is cake.",
            "title_similarity": "0.7201437",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1j132v",
            "score": 1,
            "text": "Applies to hobbies or things you want to do (workout etc) too. Just do it. Even if you only do it for 5 minutes out of the day, or even 1 minute / super small amount, do it.\n\nThen gradually ramp up the time.",
            "title_similarity": "0.4807483",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1j1vgt",
            "score": 1,
            "text": "This is what holdes me back.\n\nI want to redu my apartment, but I am to afraid to start.\n\nAs in change floor, redo/change kitchen, new walls, etc. But i am to afraid to start, because \"what do i do if this happends, do i have to change the roof if i change floors, what if i something i havnt seen before. What are the right tools.\n\nOverthinking is my future passion, because i want to learn to fix/redu houses to increase future sales.",
            "title_similarity": "0.6850152",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h1j2dsw",
            "score": 1,
            "text": "Me everyday. I overthink my tasks then when I do them, I'm surprised they are easier and took less time than I thought.\n\nThanks for the reminder.",
            "title_similarity": "0.67724097",
            "sentiment_compound": 0.765
        },
        {
            "id": "h1iwdbp",
            "score": 42,
            "text": "For me this translates to \"Just don't have anxiety\"\n\nDamn, why didn't I think of that before",
            "title_similarity": "0.5390123",
            "sentiment_compound": 0.4168
        },
        {
            "id": "h1ivy6s",
            "score": 7,
            "text": "I hope my surgeon doesn't read this.",
            "title_similarity": "0.6906147",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1j0p91",
            "score": 8,
            "text": "oh i didn't know i can just stop thinking about thinking im cured",
            "title_similarity": "0.6062601",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1j2f18",
            "score": 9,
            "text": "That's the kind of person whose work I end up having to redo. If you can't put a plan together, maybe you need to find a different job, Lewis.",
            "title_similarity": "0.740386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j04kc",
            "score": 2,
            "text": "If I had a nickel for every time I thought to myself \"Don't overthink it, just get started\", I could pay someone to do the tasks I don't wanna do. It seems so simple and so complicated all at the same time, but there is something to the old adage. Nothing to it but to do it!",
            "title_similarity": "0.67553854",
            "sentiment_compound": -0.126
        },
        {
            "id": "h1izttd",
            "score": 75,
            "text": "Lol this has \"Just stop being sad and be happy instead\" energy",
            "title_similarity": "0.5397775",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1j6cfd",
            "score": 28,
            "text": "“Just do it guys!” Life pro tips. \n\n\nHere’s a piece of gold for the sad and depressed people: just be happy and focus on the good stuff now! \n\n\n\nBonus advice for fat people: just stop eating! \n\n\n\nWowowowowowowow!!!",
            "title_similarity": "0.6295625",
            "sentiment_compound": 0.5673
        },
        {
            "id": "h1iypa4",
            "score": 3,
            "text": "Terrible LPT. Pet insurance doesn’t cover shit",
            "title_similarity": "0.39928678",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h1j30jb",
            "score": 4,
            "text": "Thanks! Now I'm ready for the heart surgery!",
            "title_similarity": "0.3911091",
            "sentiment_compound": 0.8802
        },
        {
            "id": "h1j41ya",
            "score": 3,
            "text": "Oh yeah \"just stop\". Super easy. Especially if you have ADHD. I'm cured!",
            "title_similarity": "0.48533988",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h1izs95",
            "score": 27,
            "text": "That's... Really terrible advice. \n\n\nIf that's your hang up, you need to work on strategizing, not avoiding it. As many comments will point out, it's a fast way to doing something frustrating multiple times which will make you look like an idiot to everyone involved. Not a good outcome for being professional.",
            "title_similarity": "0.766045",
            "sentiment_compound": -0.8158
        },
        {
            "id": "h1j0jko",
            "score": 35,
            "text": "Stop overthinking? Wow, thanks, I'm fucking cured.",
            "title_similarity": "0.4719749",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1j2jwo",
            "score": 7,
            "text": "What a terrible fucking advice.",
            "title_similarity": "0.41448087",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1if19h",
            "score": 22,
            "text": "My fav phrase from today: Analysis paralysis",
            "title_similarity": "0.5316126",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1iv7so",
            "score": 7,
            "text": "I started baking in the last month or so, and I think this is why I love it so much. There’s very little to think about and dissuade me from committing to starting a bake. All I do is check to make sure I have all my ingredients and get started.\n\nI’ve always been a terrible procrastinator but for some reason baking just isn’t affected by it. When I want to try a recipe or make something, as long as I have the ingredients, I find it very easy to launch right into it without apprehension.",
            "title_similarity": "0.6441429",
            "sentiment_compound": 0.8598
        },
        {
            "id": "h1jidmn",
            "score": 9,
            "text": "\"Stop overthinking.\"\n\n\"Just focus.\"\n\n\"Did you try to remember?\"\n\n \"Don't be sad.\"\n\n \"Calm down.\"\n\n This one goes in the 'So reductionist that it's infuriating.' category.",
            "title_similarity": "0.7365829",
            "sentiment_compound": -0.6134
        },
        {
            "id": "h1im58p",
            "score": 86,
            "text": "Yeeaahhh... As a programmer, this is the perfect way to have to re-write your entire codebase over and over and over again. I agree with the LPT on most things, but it doesn't work for everything haha.",
            "title_similarity": "0.75975096",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1j34sa",
            "score": 18,
            "text": "Oh wow thanks I'm cured",
            "title_similarity": "0.20382121",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1ivvur",
            "score": 22,
            "text": "you can't just \"start working\" without a plan\n\nthe thing is, try to break the task into stages - that's a start on organizing the task, which is the basis of a plan.  \n \nlike if you're going to move the stages are boxing stuff; loading boxes in a truck; cleaning the place you're leaving; unpacking.\n\nthen figure out what the very first things you going to have to do in any plan.  \n\nlike if you're moving, the first thing you gotta do is get some boxes.  maybe you  don't know how many boxes or what size, so just get enough to get started, you can get more later\n\nthen decide what to box first, and, more importantly, what to box last because you're gonna need it.  maybe start with the stuff in the back of bedroom closet, and since you're in the bedroom you might as well pack everything you aren't going to need in the next few days.  and once the bedroom is done then go to another room and finish that",
            "title_similarity": "0.6849887",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h1iyl1e",
            "score": 138,
            "text": "My ADHD makes this very difficult :(",
            "title_similarity": "0.45853788",
            "sentiment_compound": -0.7159
        },
        {
            "id": "h1ijvld",
            "score": 151,
            "text": "My scrum master would like to have a word with you...They say you have not been tracking your work items according to agile best practices.",
            "title_similarity": "0.72593284",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1if8k4",
            "score": 285,
            "text": "Totally agree...one can easily find themselves stranded in procrastination station without a ticket w/a clearly printed destination",
            "title_similarity": "0.56136477",
            "sentiment_compound": 0.6557
        },
        {
            "id": "h1imakm",
            "score": 594,
            "text": "I worked in science reseach before I retired.  I used to tell the young, fresh out of schoolers to let their hands do much of the thinking.  You can always stop, regroup and re-analyze along the way, but “doing” gives you much more information on how to solve a problem than “thinking” of how to solve it.  And never, never fear making mistakes. Mistakes are often the basis of the big breakthroughs. Never let spending too much time on the perfect plan stand in the way of getting things done!",
            "title_similarity": "0.73945165",
            "sentiment_compound": 0.431
        },
        {
            "id": "h1ivo3t",
            "score": 45,
            "text": "The perfectionist in me: *spends three hours on one sentence*",
            "title_similarity": "0.28085154",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1iwfsz",
            "score": 54,
            "text": "I do this all the time. My wife changed my life with these three words, “Just Get Started” \n\nI say it to myself all the time now! It’s helped me get things done more than almost anything else",
            "title_similarity": "0.49404657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1izgni",
            "score": 64,
            "text": "This will go over real well with my fellow adhd people lol. \"just stop overthinking! Why didn't I think of that!\"",
            "title_similarity": "0.6767582",
            "sentiment_compound": 0.508
        },
        {
            "id": "h1ijb68",
            "score": 503,
            "text": "This is good advice but a little planning can drastically improve quality  and decrease time taken as well. \n\nBut it's very important not to get stuck in analysis paralysis",
            "title_similarity": "0.748443",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h1inl8i",
            "score": 1046,
            "text": "Overthinking has literally been the bane of my existence!! It can get so bad that I spend 2 hours coming up with the \"optimal\" plan for things that could have been done within that time! \n\nMy friends called me indecisive but now I came to realise that it was just a symptom of my overthinking brain. Overthinking and fear of action is a deadly, deadlock inducing monster that is ripping my life to shreds!",
            "title_similarity": "0.65781844",
            "sentiment_compound": -0.8754
        },
        {
            "id": "h1ikez9",
            "score": 2942,
            "text": "I’ve always had some issues with analysis paralysis. Not like severe can’t get anything done, but stressed to pull the trigger on certain things. \n\nThen I found woodworking, and I’m glad I’ve had it all along. Careful planning without overlooking anything is key to great furniture.",
            "title_similarity": "0.68321216",
            "sentiment_compound": 0.9029
        },
        {
            "id": "h1ig32j",
            "score": 3,
            "text": "Thanks for the reminder!",
            "title_similarity": "0.3573286",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1io7wo",
            "score": 180,
            "text": "TIL what I experience at work has a name. Its a bunch of small tasks that add up to a finished product. I am always racking my brain to find the easiest method of completing steps A-Z, and in the process I end up looking at the thing more than I am actually working on it sometimes. (I install custom designed closets)",
            "title_similarity": "0.6884297",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1is3fz",
            "score": 68,
            "text": "Alright now where's the lifehack giving me a way to remember this as I begin overanalyzing my task?\n\nEdit: I don't have any more fingers to tie strings to",
            "title_similarity": "0.6923027",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1it3vp",
            "score": 1,
            "text": "Having this problem intensely currently trying to write a song for the first time in years.",
            "title_similarity": "0.45024645",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1iu7pt",
            "score": 1,
            "text": "yea but what if I don't",
            "title_similarity": "0.3264979",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iuak0",
            "score": 2,
            "text": "I think too, even a great plan will be changed along the way depending on the project/task. Be open to changes and adjust accordingly.",
            "title_similarity": "0.5905737",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1iuqcy",
            "score": 1,
            "text": "Ya isnt this kind of where Kaizen got started? Just start that ish & CIP it along the way.....",
            "title_similarity": "0.47062793",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iutri",
            "score": 6,
            "text": "This probably works for many things, but would be foolish and likely negligent in any kind of mechanical/construction tasks.\n\na problem or job should be thought through to its solution/completion. just because it may require a lot of thought, planning and preparation doesn’t mean you should just ‘start working’. That’s how errors are made, materials wasted and people hurt.",
            "title_similarity": "0.7601591",
            "sentiment_compound": -0.9595
        },
        {
            "id": "h1ivcmm",
            "score": 7,
            "text": "FWIW, NEVER do this in the nuke plant. ALWAYS have a plan otherwise you get Chernobyl",
            "title_similarity": "0.5040515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ivp86",
            "score": 1,
            "text": "Fucking this^ I've known this and I still struggle with it",
            "title_similarity": "0.4316667",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1ivpk7",
            "score": 25,
            "text": "Damn! how didn't i think of that!!",
            "title_similarity": "0.31494483",
            "sentiment_compound": -0.5538
        },
        {
            "id": "h1ivrdb",
            "score": 2,
            "text": "I can't look at the word \"tasks\" the same way ever again.",
            "title_similarity": "0.40669563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ivrnw",
            "score": 1,
            "text": "I needed to hear this. I start a new position Monday and I'm like how am I going to get all this stuff done?!",
            "title_similarity": "0.52497715",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h1iw27v",
            "score": 4,
            "text": "Jokes on you, I have clinically diagnosed OCD.",
            "title_similarity": "0.49469548",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1iwgb5",
            "score": 1,
            "text": "Does this work for other stuff in life?",
            "title_similarity": "0.37856025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iwp6s",
            "score": 9,
            "text": "The question for me is always, “how do you eat a whale?”\n\nThe answer?\n\nOne bite at a time.",
            "title_similarity": "0.39272118",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iwt7z",
            "score": 1,
            "text": "I agree. My spouse has a real hard time with this and I think many people with over-analysis anxiety can't \"just start\" doing something. A lot of issues come from the worry that they don't have enough \"spoons\" to start over if the way they are approaching the task turns out to not work. This leads them to go through all scenarios in their head so as to not risk getting the task done. Of course, not doing anything is a way for the task to not get get done, too!",
            "title_similarity": "0.72568285",
            "sentiment_compound": -0.2448
        },
        {
            "id": "h1ix80m",
            "score": 2,
            "text": "I’ve been thinking about posting this for weeks but I couldn’t think of how to go about it. I mean I had an idea of what I wanted to say but despite charting it out and making up some PowerPoint slides to try to plan it out I just kept giving up. Looks like you beat me to it.",
            "title_similarity": "0.6544819",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h1ixov1",
            "score": 1,
            "text": "Ahh yes how most of my essays in school came along",
            "title_similarity": "0.32994872",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1iy4vp",
            "score": 2,
            "text": "While this is great advise i would like to add that the proper way for planning and thinking is actually a little more than \"just do it\"\n\nA way to describe what you should really do is \" the closer you get to doing something, the more thought you should put into it\"\n\nso if something is far in the future you should only have a rough eastimate of what you should do\n\nwhen you want to do a task like tomorrow you should have planned way more, but still not everything!",
            "title_similarity": "0.71032333",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h1iy6n8",
            "score": 1,
            "text": "This could work for some people but I find that with some people on the spectrum it is best for them to thoroughly think through each of their actions and words before executing them. I still understand how this is a pro tip though for people who are not on the spectrum",
            "title_similarity": "0.71335435",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1iya8e",
            "score": 2,
            "text": "I seize up if someone asks me to explain how I’m going to do something. I don’t know at that point. I’ll tell you afterwards how I did it.",
            "title_similarity": "0.5821446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iyf8j",
            "score": 20,
            "text": "Ok, I've just made the first incision, now what?",
            "title_similarity": "0.42950273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iyixp",
            "score": 3,
            "text": "The key for me is to factor in that time to be slow, if you set the expected time for a task at 10 minutes, you'll be frustrated after only 15. If you set the expected time at 1 hour and have a podcast playing in the background, you'll be glad you finished in 30. That's half an hour early!",
            "title_similarity": "0.5473985",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h1iym76",
            "score": 2,
            "text": "I design headlights for a living and this is very true. Sometimes when my task is to design a bracket for this bezel etc. It can be very intimidating. If I don't just start designing something basic and work from there I'll never start. If I try to plan attachments or tooling draws before designing I'll never even start.",
            "title_similarity": "0.6828904",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1iyq40",
            "score": 1,
            "text": "Good advice, but my brain doesn't understand this.",
            "title_similarity": "0.5533073",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h1iyriq",
            "score": 1,
            "text": "Tell that to my company, 90% of the project time is spent in planning meetings discussing every possible scenario without anyone actually peoducing anything.",
            "title_similarity": "0.41568768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iyuu3",
            "score": 1,
            "text": "I do that when I want to go camping, I overthink everything. Then when I start looking for a place to go camping at it tells me I have to reserve a spot so back to overthinking again.",
            "title_similarity": "0.681268",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1iyuz9",
            "score": 1,
            "text": "I've suffered from this a lot of times",
            "title_similarity": "0.21279702",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1iyyam",
            "score": 1,
            "text": "Is this meant to represent sleep paralysis",
            "title_similarity": "0.41071108",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iyzd6",
            "score": 6,
            "text": "My supervisor as an electrician apprentice: \"Yeah, no\"",
            "title_similarity": "0.50997853",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1iz1ob",
            "score": 1,
            "text": "Agreed. That's just like the Agile philosophy.\nBreak down into small tasks and do it by iterations, instead of working on a perfect plan that covers all the bases",
            "title_similarity": "0.7027508",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h1izbgi",
            "score": 16,
            "text": "Disclaimer: this will not work in software engineering! It might seem like you are more produktiv, but the technical debts will come for you, trust me.",
            "title_similarity": "0.7679527",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h1izhd6",
            "score": 9,
            "text": "Unless you're the civil engineer working on the bridge repair in my town. In that case, please take your time and analyze your ass off.",
            "title_similarity": "0.5902991",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1izsq9",
            "score": 2,
            "text": "“Perfection is the enemy of progress.” -Winston Churchill.",
            "title_similarity": "0.4851946",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1j04eu",
            "score": 1,
            "text": "If you’re struggling with you’re basic plan (I often do this if I’m problem solving an issue and there are countless potential causes) just figure out step one. Steps two, three etc. will eventually reveal themselves.",
            "title_similarity": "0.70092475",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1j065w",
            "score": 1,
            "text": "My co-workers told me that I overthink the work I have to do more than actually working. So I‘m trying to change that. Needed to hear this again, thanks!",
            "title_similarity": "0.76268715",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1j06ui",
            "score": 6,
            "text": "\"Anyway, thanks for flying with us, I'll do my best to get you to our destination in one piece haha!\"",
            "title_similarity": "0.4607497",
            "sentiment_compound": 0.8858
        },
        {
            "id": "h1j09di",
            "score": 1,
            "text": "Absolutely agree with this! I work in a very memo-centric environment and often the memo I write can influence things in ways that stress me the fuck out. After years I still start every memo/proposal with a series of 5-10 simple bullet points and a few equally basic headers. I then expand on each point a touch… this gives me the chance to break it up into easily digestible and focused topics which seem faaaar less daunting than the project as a whole initially felt.",
            "title_similarity": "0.62279314",
            "sentiment_compound": 0.623
        },
        {
            "id": "h1j0py3",
            "score": 17,
            "text": "If you're feeling stuck, begin by setting a time-oriented goal instead out an outcome-oriented goal. For example, \"I will clean my room for 10 minutes\" vs \"I will clean my room.\" Outcome-oriented goals can leave you feeling trapped or overwhelmed. Time-oriented goals can get over resistance in starting a task since you have a clearly identified goal and timeframe.",
            "title_similarity": "0.64683175",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1j0uwg",
            "score": 5,
            "text": "If you’re running into analysis paralysis when it comes to planning and having a productive day or you think that because one thing didn’t get done the whole days ruined, this might help. I got this advice from a dyslexia tutor.\nSchedule your day into blocks not a to-do list, so if you’re a student with 4 modules, don’t say, I’m gonna write 3 argumentative paragraphs for my essay, just block out however long works for you like 2-3 hours for that module.Then just do any work on that module (don’t forget breaks!) \n\nThis lowers the bar and gives you more, less pressure options, you’re not feeling up to writing? Cool, maybe sort your citations, do some reading or formatting. Cant bring yourself to sit at a sewing machine? Press your fabric, mark your pattern. It doesn’t matter how big the task is just do your best to do something and start. This is also really helpful for when things just overrun or go quicker than anticipated",
            "title_similarity": "0.7255504",
            "sentiment_compound": 0.2936
        },
        {
            "id": "h1j12o4",
            "score": 1,
            "text": "God I wish more people did this.\n\nI especially hate when I ask a coworker a simple freaking yes/no question and they insist on ignoring it thinking they know where my end goal is and then telling me what they want to.\n\nAnswer the fonking question. Then if I need more info I’ll ask.\n\nDoing otherwise 95% of the time wastes more time of both people and usally derails the person actually tasked with the job.",
            "title_similarity": "0.7182553",
            "sentiment_compound": -0.7713
        },
        {
            "id": "h1j12st",
            "score": 1,
            "text": "This is usually the case. I am a pipefitter that works with very expensive materials. If you screw up things go south quickly. Sometimes a prefab can cost millions to replace. Particularly ASME section III. This is good advice when mowing grass but not so much in the skilled crafts.",
            "title_similarity": "0.5841461",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h1j17mc",
            "score": 2,
            "text": "LPT: You can download my new mixtape \"Analysis Paralysis\" from DatPiff",
            "title_similarity": "0.34938306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j18c4",
            "score": 1,
            "text": "i have this cronic issue, i'm just lucky it doesnt happen at work.",
            "title_similarity": "0.68775314",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1j1989",
            "score": 2,
            "text": "Almost a pro-tip: Don't give up before you've started. You can always give up later.",
            "title_similarity": "0.6986984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j1ddu",
            "score": 9,
            "text": "Engineer here. You don't want us taking this advice, trust me.",
            "title_similarity": "0.6272782",
            "sentiment_compound": 0.4728
        },
        {
            "id": "h1j1oh9",
            "score": 2,
            "text": "Yep. Sometimes it’s also ok to just manually do things and then automate the task later when you have more time.",
            "title_similarity": "0.68217486",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1j1p8b",
            "score": 1,
            "text": "Dude, do you watch the Huberman Labs also?? He mentions that our brains waste energy when he go back and forth in our minds to do something or not. Energy that could have been used for the activity.\n\nhttps://youtu.be/VQLU7gpk_X8",
            "title_similarity": "0.65458167",
            "sentiment_compound": -0.4356
        },
        {
            "id": "h1j1q96",
            "score": 1,
            "text": "I was watching this baking show the other day. There was a pair of women trying to bake a cake. They both claimed to be military and they identified that this can happen. They got so wrapped up in talking about the army and how they were just going to bake a cake. They totally screwed the cake up and got kicked off the show. So yes I can confirm this happens.",
            "title_similarity": "0.46108615",
            "sentiment_compound": -0.0005
        },
        {
            "id": "h1j1qcn",
            "score": 3,
            "text": "I don't like this approach to tasks. It's what my father does and everything he does turns out poorly.\n\nI'm more of a PPPP kinda guy because I like to make nice things",
            "title_similarity": "0.70004916",
            "sentiment_compound": 0.4922
        },
        {
            "id": "h1j23v2",
            "score": 1,
            "text": "Useless LPT. People who do this can't just STOP: they need a plan to do so. This is like \"stop feeling sad when you're sad.\" This sub is so dumb most of the time.",
            "title_similarity": "0.780025",
            "sentiment_compound": -0.8753
        },
        {
            "id": "h1j24fh",
            "score": 1,
            "text": "Story of my life right here",
            "title_similarity": "0.24500579",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j277w",
            "score": 1,
            "text": "Don’t let “perfect” get in the way of “done”.",
            "title_similarity": "0.5723491",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j2f07",
            "score": 1,
            "text": "Dun dun dun dun dun dun dun, dun dun dun",
            "title_similarity": "0.15117091",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j2f4m",
            "score": 1,
            "text": "I so needed to hear that today. Thanks a ton!",
            "title_similarity": "0.42872697",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1j2lmt",
            "score": 1,
            "text": "I totally agree and I find it infuriating when LPTs telling you to basically do the opposite thing surface every once in a while",
            "title_similarity": "0.660697",
            "sentiment_compound": -0.1548
        },
        {
            "id": "h1j2n4s",
            "score": 1,
            "text": "So like, my anxiety makes me over think and just kills me whenever I start something new. New job? Die bitch. New hobby? Get ready to over think how to do it.\n\nIt's a never ending cycle. I feel crazy. \n\nGot any advice how to utilize this LPT for people like me?",
            "title_similarity": "0.7415745",
            "sentiment_compound": -0.8523
        },
        {
            "id": "h1j2x9k",
            "score": 1,
            "text": "As a programmer it would be a massive waste of time and effort for me to just \"start working\" without thinking about my tasks and plan\n\nAnyway I guess most LPT on this sub are \"I thought about something today and wanted to share my thought\"",
            "title_similarity": "0.79052365",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1j2zna",
            "score": 1,
            "text": "I write out a basic step by step process and adhere to that blindly so I don’t overthink.",
            "title_similarity": "0.70717657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j357f",
            "score": 1,
            "text": "I'm pretty into car detailing and have build some experience over the years doing just this. Just try! A lot of mates of mine are eager to detail their own car but never get past buying the products and watching a million tutorial. They're too scared to actually try and I keep telling them",
            "title_similarity": "0.572376",
            "sentiment_compound": -0.3164
        },
        {
            "id": "h1j35e1",
            "score": 1,
            "text": "As much as my college professors would tell me to do otherwise, this was my working philosophy when I was programming, I found that making detailed plans would stress me out and I was much more effective if I had a rough idea of what I wanted to do and just started doing it, and if I made a mistake, I would just correct it",
            "title_similarity": "0.79829335",
            "sentiment_compound": -0.204
        },
        {
            "id": "h1j3by9",
            "score": 1,
            "text": "Tell that to my girlfriend...",
            "title_similarity": "0.30071732",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j3byf",
            "score": 1,
            "text": "My number one problem in life. I swear to god I’d be a millionaire by now if I didn’t have a version of this probably 10x worse than average. I basically have to do an analysis to choose a salad dressing at the grocery store",
            "title_similarity": "0.4750489",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1j3da7",
            "score": 1,
            "text": "\"if you overthink things or have anxiety about something, just stop! 😃😃😃\"\n\nGreat advice, OP. I'm sure no one's tried that before /s",
            "title_similarity": "0.70987284",
            "sentiment_compound": 0.8439
        },
        {
            "id": "h1j3kf4",
            "score": 1,
            "text": "This is a direct quote from every bridge builder ever. \n\nOr surgeon.\n\nThose pesky details just get in the way. Just get in there and start cutting. It’ll all just work itself out.",
            "title_similarity": "0.58272207",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1j3mwd",
            "score": 1,
            "text": "Me: stressing\nOP: don't stress\nMe: ok",
            "title_similarity": "0.47962898",
            "sentiment_compound": -0.2631
        },
        {
            "id": "h1j3rqv",
            "score": 1,
            "text": "Anal paralysis is serious.",
            "title_similarity": "0.43447465",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1j3vxp",
            "score": 1,
            "text": "I’ve struggled with this my whole life. I’ve recently started to recognize it and it’s getting better, but it’s still a struggle. Fantastic advice",
            "title_similarity": "0.5550792",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1j40du",
            "score": 1,
            "text": "To quote S class rank 3 hero Silver Fang:\n\n\"Overthinking won't change things, the best course is to muddle through.\"",
            "title_similarity": "0.6291942",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h1j42ga",
            "score": 1,
            "text": "Oh shit, I didn’t realize this was a thing and suffer through this exact situation a lot. I work from home, usually when this happens I do something very basic like put clothes in the washer or put dishes in the dishwasher. It usually clears my head and I’m ready to do work.",
            "title_similarity": "0.58643484",
            "sentiment_compound": -0.3657
        },
        {
            "id": "h1j436f",
            "score": 1,
            "text": "13 trips to Home Depot later:\n\n\"fuck I should have planned this better\"",
            "title_similarity": "0.46202528",
            "sentiment_compound": -0.0323
        },
        {
            "id": "h1j46yk",
            "score": 1,
            "text": "Me who has lots of anxiety: no, I dont think I will.",
            "title_similarity": "0.47261822",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1j48rp",
            "score": 1,
            "text": "So thats what i have been having, good to know.",
            "title_similarity": "0.31306988",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1j4a64",
            "score": 1,
            "text": "My over analysis leads me to create other tasks, sometimes hours long, that deter me from the original one. Then I'm doing everything, but what I'm supposed to be doing.",
            "title_similarity": "0.71834576",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1j4acs",
            "score": 1,
            "text": "Opposite for most programmers.\n\nOr am I alone who does stuff which inevitably breaks and then repeats it again without thinking much",
            "title_similarity": "0.6737499",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1j4euf",
            "score": 1,
            "text": "I’ve always done this but I just call it “fake it till you make it”",
            "title_similarity": "0.5708851",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j4itk",
            "score": 1,
            "text": "this is one of the few useful tips on here. so of course no one will see it",
            "title_similarity": "0.5799254",
            "sentiment_compound": 0.1119
        },
        {
            "id": "h1j4j9t",
            "score": 1,
            "text": "This is the way.  Let it flow.",
            "title_similarity": "0.32603508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j4kjd",
            "score": 1,
            "text": "This is something I’ve been becoming more aware of in my life. A thought is merely a thought until you give it action. Stop thinking so much and just act.",
            "title_similarity": "0.69253325",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1j4tow",
            "score": 1,
            "text": "Ready, Fire, Aim.",
            "title_similarity": "0.2500905",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1j4trc",
            "score": 1,
            "text": "Analysis paralysis is such a cool phrase, tho.",
            "title_similarity": "0.4235834",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1j4uxx",
            "score": 1,
            "text": "Analysis paralysis!  Now I have a name for it.  I have struggled with this lately.  Sometimes I feel it is absolutely worth holding off on a task that hasn’t been planned carefully.  At other times, just getting up and doing it is a sweet if tiring release with a reward.",
            "title_similarity": "0.70608306",
            "sentiment_compound": 0.8066
        },
        {
            "id": "h1j54m4",
            "score": 2,
            "text": "good advice if i didn’t have ADHD and didn’t already try this!",
            "title_similarity": "0.59575063",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1j5cbd",
            "score": 1,
            "text": "this\\*10000000000000",
            "title_similarity": "0.11362929",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j5cpx",
            "score": 1,
            "text": "In software development it is better to think stuff through before jumping in, depending on the project's size you will only suffer along the way if you don't .\n\n1 hour of planning can save 1 month of coding.",
            "title_similarity": "0.6828167",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1j5gur",
            "score": 2,
            "text": "Unless you're like me and have executive dysfunction because of adhd! My life is a constant battle between me forcing myself to get things done at work, and fighting my thoughts that are at 100% full capacity 24/7. This comment, that I wanted to write and chose to, took me a full 8 minutes because I'm sifting through all the things I'm trying to get out and picking the best ones to put here. Yikes",
            "title_similarity": "0.61085856",
            "sentiment_compound": -0.126
        },
        {
            "id": "h1j5luf",
            "score": 2,
            "text": "This is a very common issue in people with r/ADHD",
            "title_similarity": "0.33612335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j66zk",
            "score": 1,
            "text": "This is really some r/thanksimcured stuff",
            "title_similarity": "0.3107659",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j68j0",
            "score": 1,
            "text": "This is a great tip. A corollary that I find useful is: what’s stressing me out the most? Pick that one thing and apply this tip on that. The ROI is the highest for me in terms of stress reduction. I try to do this everyday, and it’s a reasonable success.",
            "title_similarity": "0.55279213",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1j69b0",
            "score": 1,
            "text": "That's what I always do but then when people ask me what's my plan I get criticised for not having any (especially by women...)",
            "title_similarity": "0.65379864",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1j6aoh",
            "score": 2,
            "text": "This will greatly help me in my job as a Surgeon!\nThanks!",
            "title_similarity": "0.4221136",
            "sentiment_compound": 0.7563
        },
        {
            "id": "h1j6d9v",
            "score": 1,
            "text": "I will try this later.",
            "title_similarity": "0.47553563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j6f27",
            "score": 3,
            "text": "I have ADHD and I can go multiple days staring at my textbook without actually getting any school work done because of this. I also feel like I can’t control it at all.",
            "title_similarity": "0.56437063",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1j6fj6",
            "score": 14,
            "text": "Don’t let perfect be the enemy of done.",
            "title_similarity": "0.5315372",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1j6lv0",
            "score": 1,
            "text": "I think this tip is especially good for people with ADHD. \n\nMany with ADHD overthink an issue and then burn out mid-way and have difficulty finishing tasks. Not sure if this will help me, but I'll give it a go.",
            "title_similarity": "0.71570617",
            "sentiment_compound": 0.1939
        },
        {
            "id": "h1j6ni7",
            "score": 1,
            "text": "I very much needed this reminder. Thank you.",
            "title_similarity": "0.4686054",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1j6q6p",
            "score": 1,
            "text": "tldr;\n\nJUST DO IT",
            "title_similarity": "0.33010027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j6qum",
            "score": 1,
            "text": "Everyone should read The Paradox of Choice. \n\nOne takeaway: before you start trying to figure out a hard decision, take a second to ask yourself, “Is this decision worth the time and energy I’m about to give it? Or should I just pick with my gut and move on?”",
            "title_similarity": "0.742083",
            "sentiment_compound": 0.3736
        },
        {
            "id": "h1j6unt",
            "score": 1,
            "text": "Cool! Got my car engine torn down. Now to drive to the part sto… crap.",
            "title_similarity": "0.5095998",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h1j6ylt",
            "score": 1,
            "text": "Yeah, that usually works ok in surgeries, lab protocols, kitchens and space stations.",
            "title_similarity": "0.32367617",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1j7715",
            "score": 1,
            "text": "Another great “just do it/just change/just try” LPT! What a help!",
            "title_similarity": "0.4774176",
            "sentiment_compound": 0.8118
        },
        {
            "id": "h1j776q",
            "score": 1,
            "text": "This is also true for studying.",
            "title_similarity": "0.3998187",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1j779r",
            "score": 1,
            "text": "LPT: stop doing the thing engrained in you. It’s easy, just stop! Thanks OP, revolutionary advice, my anxiety around tasks is gone 🙄🙄🙄",
            "title_similarity": "0.750583",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h1j79f8",
            "score": 1,
            "text": "This pretty contextual. Email? Yes. Designing almost anything? Not exactly.",
            "title_similarity": "0.46347302",
            "sentiment_compound": 0.7399
        },
        {
            "id": "h1j7bg2",
            "score": 1,
            "text": "For anybody who's ever wanted to try making a video game for fun, try participating in a game jam! A friend and I did one a couple years ago and it was an amazing experience because we didn't have time to overthink anything. We had a little time to plan but then had to just jump in and get started if we wanted to have time to get anything done by the end of the jam.\n\nBoth of us had been talking of making something for years but never even got started on something until the jam. It just seemed so stressful and overwhelming! But once we just threw caution to the wind and jumped in head-first, we had a blast and made something \"playable\" within a couple days! The end product was rough to put it lightly but we were so proud of it!!",
            "title_similarity": "0.56676173",
            "sentiment_compound": 0.7538
        },
        {
            "id": "h1j7gc8",
            "score": 1,
            "text": "It holds very true for me.  \nI've started writing, and there are just a lot of advices running online, like how should each chapter be structured, how many words to write minimum per day, how should you plan to structure your story, etc.   \n\nWell all these advices felt overwhelming all of a sudden and I stopped thinking about _any_ of these advices. I just started writing, aimless at what'll happen next or how my story will end.  \n\nJust pure writing bliss, letting the story and my characters take me through the journey rather than me puppeteering them.",
            "title_similarity": "0.6986348",
            "sentiment_compound": 0.8588
        },
        {
            "id": "h1j7kd2",
            "score": 1,
            "text": "Analysis paralysis... i didn’t know there was a name for it! I like it. Thanks for identifying! Now I can call myself out on it!",
            "title_similarity": "0.55945134",
            "sentiment_compound": 0.7412
        },
        {
            "id": "h1j7l2c",
            "score": 1,
            "text": "Check out the book/system called Personal Kanban. https://www.personalkanban.com/ it's a Todo list that deals with this specifically.",
            "title_similarity": "0.37576866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j7mb4",
            "score": 1,
            "text": "Smartest thing i’ve ever reddit!",
            "title_similarity": "0.24272972",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h1j7mtm",
            "score": 1,
            "text": "Analysis paralysis is a good way to describe Dune Messiah 🪱",
            "title_similarity": "0.4704763",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1j7qeu",
            "score": 1,
            "text": "I will say I do this to avoid analysis paralysis, but there is also a limit. It can be just as bad going into something with too basic of a plan and having to back out/redo whatever you started because you didn't think it through enough.",
            "title_similarity": "0.81208265",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h1j7u9j",
            "score": 1,
            "text": "“The quickest way to finish is to start now”",
            "title_similarity": "0.4854356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j7wzz",
            "score": 2,
            "text": "*ADHD has entered the chat*",
            "title_similarity": "0.3531731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j7yaf",
            "score": 1,
            "text": "When you have a neurodivergent mind executive function can get screwed up. Going to do the task can lead to \"oh wow the task\" which can lead to anxiety and eventually just not doing the task. Often if I need to do something I try to push past the initial \"oh wow\" to do 1 part of the task and end up finishing the task.",
            "title_similarity": "0.77605677",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1j809d",
            "score": 1,
            "text": "That's correct, I hated few nights when I was half dreaming in nights about my work problems and couldn't sleep, that was irritating AF.\nIt was all because I took too much BT.",
            "title_similarity": "0.5741099",
            "sentiment_compound": -0.872
        },
        {
            "id": "h1j811z",
            "score": 1,
            "text": "Now I'm thinking about over thinking my tasks, especially how analysis paralysis is just thinking about thinking moreover, thinking about thinking about thinking is analysis paralysis\\^2 which is almost cubed times as bad as analysis paralysis on its own and it's a lot of work to do before working so I think I'm just going to figure out how to go from analysis paralysis\\^3 to analysis paralysis.",
            "title_similarity": "0.82311964",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1j86a2",
            "score": 1,
            "text": "Analysis Paralysis BAND NAME, I CALLED IT!",
            "title_similarity": "0.42585382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j8702",
            "score": 2,
            "text": "Thanks, you solved my ADHD",
            "title_similarity": "0.4586644",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1j88jw",
            "score": 1,
            "text": "Momentum is huge! I often lead projects that may be 6-18 months long. Analysis paralysis can kill a project. When kicking off the project, I’ll give the team a small goal accomplish within 2 hours, another by the following day and one a few days later. Once the ball is rolling momentum takes care of the rest.",
            "title_similarity": "0.55564356",
            "sentiment_compound": 0.4389
        },
        {
            "id": "h1j88wx",
            "score": 1,
            "text": "Going threw the same thing with a motorbike project. Once you start actually working and getting into a flow problems get solved that bit easier",
            "title_similarity": "0.653357",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1j891k",
            "score": 1,
            "text": "This is simultaneously good advice and potentially dangerous advice. \n\nI’m an overthinker so I agree to a certain extent. But I’ve also had many successes due to my meticulous planning. \n\nBut I will say that overall, just going with the flow in many cases likely will lead to less stress. Cannot speak on results but it’s up to you to decide what you value most.",
            "title_similarity": "0.6740605",
            "sentiment_compound": 0.7952
        },
        {
            "id": "h1j8chv",
            "score": 1,
            "text": "Over thinks the title. Fuck.",
            "title_similarity": "0.37801552",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1j8ecn",
            "score": 1,
            "text": "> “stop overthinking”\n\n*laughs in clinical anxiety*",
            "title_similarity": "0.59927964",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1j8jdy",
            "score": 1,
            "text": "this is vague and silly, like wtf are you going on about?... this is some wishy washy bull shit whats next? deepak choprah quotes?",
            "title_similarity": "0.48914135",
            "sentiment_compound": -0.7744
        },
        {
            "id": "h1j8k72",
            "score": 1,
            "text": "As a kid I learned this early on. \n\nDad was a junk collector and kept a mess, mom was organized and liked keeping things tidy. \n\nI'd go into the shed and it would be so full of stuff, you couldn't find anything. My brothers and I used to look at it and saw it as a challenge. We didn't know where to start, we just started clearing stuff, organizing stuff, building shelves, deciding on garbage, tossing things out, and eventually we got a cleared garage and dad was always amazed. \n\nWeek or two would go by and we'd do it again and again. Dad never changed but at least we got into the habit of just doing things to get it done no matter how daunting it is.",
            "title_similarity": "0.5181203",
            "sentiment_compound": 0.3589
        },
        {
            "id": "h1j8tci",
            "score": 1,
            "text": "Been thinking about trying to do this for awhile now",
            "title_similarity": "0.43597186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j8weg",
            "score": 1,
            "text": "Tried that when digging a soakaway in my garden. Hit a gas line and had my street evacuated. Please do plan ahead.",
            "title_similarity": "0.49866837",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1j9456",
            "score": 1,
            "text": "This is something I am just realizing is amazing and I’m turning 31 this august. I really love this idea",
            "title_similarity": "0.34935212",
            "sentiment_compound": 0.8516
        },
        {
            "id": "h1j94uu",
            "score": 1,
            "text": "Unless you’re a programmer. \n\nPlanning is key to success",
            "title_similarity": "0.5881431",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1j958c",
            "score": 1,
            "text": "Or do what I do and let panic be the father of innovation. Procrastinate until you don’t have time to think about it at all and hope it goes well!",
            "title_similarity": "0.7184659",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h1j95hf",
            "score": 4,
            "text": "As President General Eisenhower once said, planning is essential but plans are useless.",
            "title_similarity": "0.60015917",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1j96ff",
            "score": 1,
            "text": "True when browsing Netflix as well, I'll have the tab open for hours and not able to select something to watch, and then sleep without watching anything, sigh",
            "title_similarity": "0.5357853",
            "sentiment_compound": 0.5894
        },
        {
            "id": "h1j971s",
            "score": 1,
            "text": "I didn't think about that. Just doing it. Thanks.    \nOh... Except that time I tried to install the AC in a side window, and had to go to Lowes 3 different times because I didn't plan ahead.   \nBut yeah. Sure. Just do it.",
            "title_similarity": "0.5888344",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1j9dnl",
            "score": 1,
            "text": "My dad told me this and I’ve never let it go.\n\n“Just do *something.* Even if it’s wrong, always be wrong *something.*",
            "title_similarity": "0.58028316",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h1j9jsy",
            "score": 1,
            "text": "Fuck it, we'll do it live. Hasn't failed me yet.",
            "title_similarity": "0.3549013",
            "sentiment_compound": -0.2018
        },
        {
            "id": "h1j9m52",
            "score": 1,
            "text": "I like to look at a project with and end goal - how do things look when the project is done.\n\nThen find the first actionable step. Break it down. Clarify.",
            "title_similarity": "0.7442423",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1j9myk",
            "score": 1,
            "text": "My mother always said “the hardest part of doing anything is starting”. Always gets me going.",
            "title_similarity": "0.56624895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j9nu1",
            "score": 1,
            "text": "It's interesting because a lot of software engineers preach the opposite while also preaching TDD which is effectively what you're preaching.\n\nI'm convinced that lots of process-oriented engineers have no clue.  It's best to find a system that works and go with it.\n\nAll told, I mostly agree with your sentiment.  I work on complicated algorithms where I don't know the entire flow tree in advance.  I just start coding and treat it as a sketch pad.  The flow reveals itself as I code.  But I frequently like to take a couple of days to ruminate on new major features and how best to implement them.  Lot of dead ends otherwise.",
            "title_similarity": "0.778162",
            "sentiment_compound": 0.8847
        },
        {
            "id": "h1j9ocl",
            "score": 1,
            "text": "If only I knew the boundaries between analysis paralysis and good strategic thinking",
            "title_similarity": "0.6622435",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1j9ofy",
            "score": 1,
            "text": "How'd that work out for Cyberpunk? Or FO76? ¯\\\\_(ツ)_/¯",
            "title_similarity": "0.39923328",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j9pjc",
            "score": 2,
            "text": "NO, WE NEED MORE MEETINGS.",
            "title_similarity": "0.49572843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j9tqw",
            "score": 1,
            "text": "I adopted that philosophy about 35 years ago. It has served me well in all aspects of my life.",
            "title_similarity": "0.18987472",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1j9zfz",
            "score": 1,
            "text": "No matter the task, \nJust remember,\nKEEP IT SIMPLE STUPID!",
            "title_similarity": "0.5380902",
            "sentiment_compound": -0.6704
        },
        {
            "id": "h1ja0cl",
            "score": 1,
            "text": "I'm the kind of person where I need to figure everything out first or else my mind gets completely frazzled and strained.",
            "title_similarity": "0.69902873",
            "sentiment_compound": -0.4522
        },
        {
            "id": "h1ja25z",
            "score": 1,
            "text": "Or not... That sounds like torture.\n\nI prefer a well laid out plan. It *helps* me achieve my goals.\n\nJust do your shit how you like to do it.",
            "title_similarity": "0.7497034",
            "sentiment_compound": -0.5283
        },
        {
            "id": "h1ja5gz",
            "score": 1,
            "text": "Let me say this in the nicest possible way: your worldview is way past its sell buy date. Se of Bezos can help with one of those DMC time traveling cards, reconstruction misses you a great deal.",
            "title_similarity": "0.6144973",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h1jacb9",
            "score": 1,
            "text": "This also applies to choosing a game to play",
            "title_similarity": "0.3840107",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1jafem",
            "score": 1,
            "text": "Thank you. I needed to hear this.",
            "title_similarity": "0.40175682",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jag00",
            "score": 1,
            "text": "I actually needed this advice RN. I lost my job and am doing a bunch of stuff around my house that I have never had time to do. ( I am very fortunate that I have some retirement $ I can draw upon so I don't have to go back to work for a few more months)\n\nAnyway, there are SO many things I want and need to do that I AM sort of frozen RN. I finished my living room...pulled up nasty old carpet, put down flooring, painted, bought new curtains and a lamp...and a lilac colored shag rug! And it makes so freaking happy I just am thrilled to sit in my living room now.\n\nBut I have a lot more to do and I have been debating so much that I've not started on other things. You're right, just GET A START, pgabrielfreak. I was fretting over the area rug and one day I just found it online on clearance! Stuff seems to work out if you are patient and just let it...doesn't mean you cannot be doing something else in the meantime.\n\nThank you, friend, for the reminder!",
            "title_similarity": "0.5783422",
            "sentiment_compound": 0.8706
        },
        {
            "id": "h1jahzm",
            "score": 2,
            "text": "Adhd and executive dysfunction have entered the chat",
            "title_similarity": "0.41984332",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1jal2t",
            "score": 1,
            "text": "I address this by the practice of \"just getting words on paper\". It can apply to many contexts: report writing, papers, challenging emails, projects around the house. The basic idea is to just get started and allow the starting product to be basic and well, shoddy, if needed. Once I've got words on paper I can focus better and my anxiety decreases as at least whatever I'm working on has begun - or has words on paper so to speak. I always make sure I begin by reading the instructions and then beginning with the easiest part, or by just jotting down my ideas in each section. This helped me get through grad school and is now helping me get through some post-grad work. Not to mention with my day to day job as well.",
            "title_similarity": "0.7885616",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h1janxi",
            "score": 1,
            "text": "Corollary: maybe don’t do this if you have a blood droplet testing company or a self driving car company.",
            "title_similarity": "0.5014188",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jaoyj",
            "score": 1,
            "text": "Retired. First career was submarine nuclear power. Second was space launch. Both involved thinking.",
            "title_similarity": "0.3935691",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1japo0",
            "score": 1,
            "text": "What's the safety plan for the space launch?\n\nThey'll figure it out along the way.\n\nAnalysis paralysis is a real thing but you often can't just \"figure it out along the way\" either. It's about balance and awareness",
            "title_similarity": "0.6424954",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1jasup",
            "score": 1,
            "text": "I'll second this.",
            "title_similarity": "0.3274336",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1javo2",
            "score": 1,
            "text": "This works for unskilled labor. If youre in a position which requires education or experience, then you absolutely need to think about your tasks before you try to perform them.",
            "title_similarity": "0.7498635",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jawsu",
            "score": 1,
            "text": "Much as I'd like to agree, I can't actually do any part of my tasks at all without perfectly knowing what I have to do in advance. A very basic plan won't cut it because I'll get lost 5 minutes in.",
            "title_similarity": "0.66092837",
            "sentiment_compound": 0.0377
        },
        {
            "id": "h1jaz28",
            "score": 1,
            "text": "I totally do this.  By the end of my over-thinking I’m tired.",
            "title_similarity": "0.52048016",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1jb0iz",
            "score": 1,
            "text": "A good way to decide if you’re ready to act: [Is it soup yet?](https://www.careersingovernment.com/tools/gov-talk/career-advice/is-it-soup-yet/)",
            "title_similarity": "0.58207244",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1jb3kz",
            "score": 1,
            "text": "This is actually how I got over doing the dishes lol. It also helps to watch a tv show on your phone/tablet while doing it, learned that from my mom.",
            "title_similarity": "0.46093804",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1jb79h",
            "score": 2,
            "text": "Absolutely terrible advice. The problem most people have is that they don't know how to plan. The advice here is to basically give up?\n\nPlanning is a skill and takes practice and patience. Invest in this skill, and not only will your overthinking vanish, you'll be substantially more productive.",
            "title_similarity": "0.82550764",
            "sentiment_compound": -0.7264
        },
        {
            "id": "h1jba3p",
            "score": 1,
            "text": "This comes across as telling someone who is depressed to just be more happy. Like no shit i should start the project instead of spending days thinking about how it could go wrong. If it was that easy to just completely change my mindset then i could easily logic myself into starting it.",
            "title_similarity": "0.8036158",
            "sentiment_compound": 0.8342
        },
        {
            "id": "h1jbaf1",
            "score": 1,
            "text": "I'm doing that right now as I'm doing spring cleaning! Took a reddit break and now I'm back at it.",
            "title_similarity": "0.41695517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jbb0g",
            "score": 1,
            "text": "This is actually a good tip, this is how I get most of my programming done.",
            "title_similarity": "0.5062902",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1jbhm6",
            "score": 1,
            "text": "Shit. Shouldn't of followed this advice. The surgery I just performed couldn't of gone worse.",
            "title_similarity": "0.64575243",
            "sentiment_compound": -0.2607
        },
        {
            "id": "h1jbk8y",
            "score": 1,
            "text": "Bias for Action: instead of spending a bunch of time deciding, just choose something and go. You can always change course if something isn't working",
            "title_similarity": "0.6885079",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1jc21p",
            "score": 1,
            "text": "This happens every time I research a product to purchase. There has to be an 80/20 situation applied at a certain point. Or just have a good return policy.",
            "title_similarity": "0.42740262",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1jc2li",
            "score": 2,
            "text": "INTP with ADHD: 🔬👩‍🔬🧬♾",
            "title_similarity": "0.23912628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jc2nu",
            "score": 1,
            "text": "\"Nothing to it but to do it\"",
            "title_similarity": "0.44195253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jc46e",
            "score": 1,
            "text": "Project managers say…. Errrr.\n(Honestly I run by this as well - I guess I’m terrible at my job)😅",
            "title_similarity": "0.7005713",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1jc74b",
            "score": 1,
            "text": "Poor advice if you are in the space program.",
            "title_similarity": "0.47935608",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1jc8nu",
            "score": 1,
            "text": "Ok I know but how do I *stop* doing that.",
            "title_similarity": "0.47925732",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1jcirw",
            "score": 1,
            "text": "I’m an engineer by trade. I simply cannot tell myself to shut up and do a task to without 10x the planning and analysis needed.",
            "title_similarity": "0.5817683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jcjrh",
            "score": 1,
            "text": "Amen. I wish I'd learned and internalized this sooner.",
            "title_similarity": "0.559614",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1jckzl",
            "score": 1,
            "text": "Yeah good luck doing that in software development :P You will end up with tired people working on shitty product written in most shitty way possible that is hard to modify and does not take edge cases into account. \n\nUnless it's a simple task, you want to know what you are doing before you are doing it.",
            "title_similarity": "0.8105247",
            "sentiment_compound": -0.168
        },
        {
            "id": "h1jcub1",
            "score": 1,
            "text": "Like the saying goes: Excessive analysis, leads to paralysis\n\nWorks for everything from tasks to letting go",
            "title_similarity": "0.6552305",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jd0es",
            "score": 1,
            "text": "As the great Kennybeats put it: Dont Over Think Shit",
            "title_similarity": "0.49563837",
            "sentiment_compound": 0.792
        },
        {
            "id": "h1jd22a",
            "score": 1,
            "text": "Thanks OP! \n \nAlright, time to build this suspension bridge!",
            "title_similarity": "0.34582466",
            "sentiment_compound": 0.6688
        },
        {
            "id": "h1jd9b7",
            "score": 1,
            "text": "I hate my job and am considering suicide cause I can't change career",
            "title_similarity": "0.6409199",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h1jdalv",
            "score": 1,
            "text": "Sounds like the exact reason I procrastinate on schoolwork..",
            "title_similarity": "0.56521744",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jdf4g",
            "score": 1,
            "text": "I'm guilty of this. It got bad when I started getting anxiety. Plus picky foreman make it worse. When I was a 5th yr apprentice I started really second guessing myself to where it'd cause me to become completely indecisive.",
            "title_similarity": "0.6080998",
            "sentiment_compound": -0.908
        },
        {
            "id": "h1jdgne",
            "score": 1,
            "text": "My managers have this issue. They form complex plans spending hours formulating them then they always change completely once the shift starts. My method is just to have a general plan and adjust it as soon as new information rolls in. Works every time.",
            "title_similarity": "0.63673526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jdllu",
            "score": 1,
            "text": "Needed this right now. Struggling to start my literature review and my thesis. Browsing reddit so I don't become overwhelmed by the tasks of having to write and research so much. Going to start now, thank you.",
            "title_similarity": "0.7432118",
            "sentiment_compound": -0.1149
        },
        {
            "id": "h1jdm9z",
            "score": 1,
            "text": "hits too close to home, thanks for posting this",
            "title_similarity": "0.398138",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1jdnjd",
            "score": 2,
            "text": "Another tip (especially if you are neurodivergent) - if you find yourself in analysis paralysis/executive dysfunction, you can break the task down into however many small achievable parts you need to. For example, if I need to make coffee, but can't mentally even get out of bed, I think \"I need to sit up, swing my legs over the bed, stand up, get dressed, fill the kettle, etc. This may not work for everyone, but I've heard from other people on the spectrum or with ADHD that it can helpful.",
            "title_similarity": "0.6511879",
            "sentiment_compound": 0.5346
        },
        {
            "id": "h1jdqfh",
            "score": 1,
            "text": "One of my life's mottos: \"under think it\"",
            "title_similarity": "0.43739396",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jdsod",
            "score": 1,
            "text": "Over thinking   \nOver analyzing    \nSeparates the body from the mind",
            "title_similarity": "0.63523316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jdt2h",
            "score": 1,
            "text": "My problem seems to be underthinking. I start a task, then realize I have no idea what the end product is supposed to look like, and it becomes a quagmire as I try to make it do everything.",
            "title_similarity": "0.7707921",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1jdzbc",
            "score": 1,
            "text": "Analysis Paralysis defines my entire existence. I overthink/over plan everything. Sometimes I can catch, and adjust.. but it's always been an issue for me.",
            "title_similarity": "0.6130918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1je32t",
            "score": 1,
            "text": "This is why I have no curtains or light fixtures in my house.",
            "title_similarity": "0.31253037",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1je8z7",
            "score": 1,
            "text": "This made me start overthinking a task.",
            "title_similarity": "0.5862905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jectj",
            "score": 1,
            "text": "My teacher wanted a fully detailed plan on how a project would look like. It gave me so much stress",
            "title_similarity": "0.7310314",
            "sentiment_compound": -0.1477
        },
        {
            "id": "h1jejfe",
            "score": 1,
            "text": "I'm working an office job that involves taking clients calls. The amount of time I spent going through conversations in my head after hanging up and rethinking if I gave the right information or what would have been a clever comeback to a rude customer is too freaking damn high. Some days are better, some are worse though.",
            "title_similarity": "0.60827494",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h1jeju4",
            "score": 1,
            "text": "Programmers: *nervous sweating*",
            "title_similarity": "0.49243528",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1jekdn",
            "score": 1,
            "text": "Jokes on you. I under-think most of my tasks.",
            "title_similarity": "0.58115727",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1jepz8",
            "score": 1,
            "text": "Depends on the task, I would say. I've found that with programming if I do not break the task into several smaller ones and then plan out exactly how I want to achieve the smaller ones, I get nowhere because the task just seems overwhelming on its own and I would not know what to start with.",
            "title_similarity": "0.7490752",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1jesv3",
            "score": 1,
            "text": "Thanks, I'll tell that to my executive dysfunction. Problem solved.",
            "title_similarity": "0.6294109",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1jexo2",
            "score": 1,
            "text": "\"LPT: Just don't have anxiety\"",
            "title_similarity": "0.37173244",
            "sentiment_compound": 0.1326
        },
        {
            "id": "h1jeyvb",
            "score": 2,
            "text": "Tell that to me who is an INTP with ADHD",
            "title_similarity": "0.3063678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jf0a5",
            "score": 1,
            "text": "Sorry can't do that. If I have to go on some tangent to solve a another problem in the middle of another, I'll forget about the first one. Stack enough problems like that and I'm never completing the task.",
            "title_similarity": "0.71410286",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1jf2cb",
            "score": 1,
            "text": "Easier said than done and thanks for a proper word to name this phenomenon. I struggle with this my whole life",
            "title_similarity": "0.57617426",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1jf2g9",
            "score": 1,
            "text": "This shit has affected me a lot more during lockdown",
            "title_similarity": "0.4180558",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h1jf2pz",
            "score": 1,
            "text": "This! I used to hate it when my dad said it's all in your head. But it's true all the stress and worry about the tasks aren't getting them done, you're only mentally taxing yourself.",
            "title_similarity": "0.72878325",
            "sentiment_compound": -0.7574
        },
        {
            "id": "h1jf3eu",
            "score": 1,
            "text": "The Home Depot help desk guy once said \"Don't make a science project out of it\" when my husband was building a deck and was way overthinking it. That line has stuck for years when starting any project. Yes, some planning is needed but, goddamn it, just start it!",
            "title_similarity": "0.57378745",
            "sentiment_compound": -0.501
        },
        {
            "id": "h1jf67t",
            "score": 1,
            "text": "This cripples me every day.",
            "title_similarity": "0.38844365",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jf6ch",
            "score": 1,
            "text": "I usually do the opposite: I mildly freak out about a complicated or just overwhelming task, dwell on it for a while, and then realize I can simply break it down or that there’s a simpler way to get it done.",
            "title_similarity": "0.80695003",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1jf9fr",
            "score": 1,
            "text": "This is probably the worst advice Ive seen on here.",
            "title_similarity": "0.51128554",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1jfamd",
            "score": 2,
            "text": "Like others have said, it isn't as easy to \"just start working\" and \"figure things out along the way\". For those of us with ADHD, every single day can be a struggle against our own minds; the severity of the struggle depends greatly on the individual and a whole host of other factors that I just don't have time to get into. \n\nFor example, let's say the \"very basic plan\" involves setting an alarm on your phone for each task you need to get done that day. So you go about your day, doing whatever it is you're doing, and the first alarm goes off. Only you're in the middle of something you *can't* stop right away or you just want to get to a certain point before stopping for whatever reason [maybe you're crocheting and you have a mental block that doesn't allow you to stop on an odd-numbered row]. So you tell yourself \"Okay, as soon as I can stop, I'll go do that thing. Shouldn't take more than a few minutes.\"\n\nOnly \"a few minutes\" never stops. You get distracted, back into the rhythm of whatever you were meant to stop in \"a few minutes\", and suddenly you've done twenty more rows on that blanket instead of one. And your next alarm goes off. And the cycle repeats until you're either able to break it or it's time to go to bed.\n\nSo, like another person said, this has *huge* \"Just don't be sad/anxious/etc anymore\" energy.",
            "title_similarity": "0.6775519",
            "sentiment_compound": -0.8844
        },
        {
            "id": "h1jfcfv",
            "score": 2,
            "text": "LPT: Have anxiety, depression, or ADHD? Don't! You'll be way more productive. /s\n\nIn all honesty it's good advice that if you've spent a while ruminating, you should just dive in and get going. Mental health issues can make this more difficult though, so don't be too hard on yourselves!",
            "title_similarity": "0.7495481",
            "sentiment_compound": -0.3359
        },
        {
            "id": "h1jfcmz",
            "score": 1,
            "text": "I wanted to start exercising, but I had no idea what to do. There are so many options and I'd get frustrated thinking I might enjoy something more or see better mental health benefits...finally I bought an inflatable pool that's just big enough to do some laps in, figuring if I sank a few hundred into it I'd stick to something just out of the sunk cost fallacy. Seems to be working so far.",
            "title_similarity": "0.656131",
            "sentiment_compound": 0.2836
        },
        {
            "id": "h1jfo48",
            "score": 1,
            "text": "Great advice! Anyone struggling with this should also look into decision fatigue.",
            "title_similarity": "0.71121156",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h1jfr4l",
            "score": 2,
            "text": "KISS- KEEP IT SIMPLE STUPID.",
            "title_similarity": "0.4423152",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1jfun0",
            "score": 1,
            "text": "Oh my god I've never heard a name for it before. And it rhymes!",
            "title_similarity": "0.21718504",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h1jfy77",
            "score": 1,
            "text": "\"A plan is a list of things that go wrong. I like to keep my lists short\"",
            "title_similarity": "0.71295",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1jg0zz",
            "score": 1,
            "text": "Screw that.  You will do it wrong and have to redo",
            "title_similarity": "0.56225675",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1jg1ei",
            "score": 1,
            "text": "If it was that easy to just stop overthinking tasks to do them, I would've done that when I realized my high school transcripts were going to follow me unless I got a high school degree. Instead I overthought and never did any homework, and get yelled at for popping a squat every 5 minutes of work I do to think.\n\nGuess I'm cured",
            "title_similarity": "0.56250864",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1jg48q",
            "score": 1,
            "text": "Stop asking for detailed plans before I even have eyes on the issue then, PROJECT MANAGEMENT!\n\nJust needed to get that off my chest",
            "title_similarity": "0.7629672",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h1jg5b6",
            "score": 1,
            "text": "Think fast, start fast, fail fast. Embracing and celebrating small failures is a great way to jump out of analysis paralysis.",
            "title_similarity": "0.63124967",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1jg75y",
            "score": 1,
            "text": "I stopped thinking like you said and now my life is fucked up",
            "title_similarity": "0.566623",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1jg89t",
            "score": 1,
            "text": "Wow, I never thought of that. I should just stop doing the thing that my brain compulsively does but I hate. How insightful. Never would have thought of that on my own. Just stop. Sure. Thanks for the life pro tip random internet person who thinks we enjoy overthinking things. You really helped.",
            "title_similarity": "0.72205627",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h1jgbf2",
            "score": 1,
            "text": "Good tip for weightloss too. Well honestly just anything in life!!",
            "title_similarity": "0.39928418",
            "sentiment_compound": 0.8217
        },
        {
            "id": "h1jgild",
            "score": 1,
            "text": "Too bad all of my co-workers use this for software development",
            "title_similarity": "0.54590523",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1jgna4",
            "score": 1,
            "text": "My life has seen many tragedies, most of which never even happened",
            "title_similarity": "0.35703284",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1jgqbo",
            "score": 1,
            "text": "Reminds me of the *Curb Your Enthusuasm* clip where Larry gives a prostitute fashion/life advice so that she won't look like an obvious prostitute.",
            "title_similarity": "0.62098646",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h1jgt6m",
            "score": 1,
            "text": "The anxious voice in my head often screams \"OMG! This is soooo complicated and it has so many steps and if I do them in the wrong order or whatever it will be ruined and I'll get mixed up and I will take too long and it will be late so where do I even start? AAAGGGGHHGGGGHH!\"\n\nMaybe you'll get off to a wrong start or go down a wrong tangent for a little while.  If the project isn't clear from the start then the only way to get clarification is not mentally spinning wheels, rather it is to get a few things done that are clear.  \"I'm pretty sure I need to do X and Y, but I'm not sure about A or J or maybe Q will make me change something about Y!\"  Chill and do X and Y and then look for the next thing that you clearly need to do.  Trust that you can figure it out as you go along. After X and Y, N, H and Z will look like things you probably need to do, so do them.  Then step back and pick the next things.  When you get to Q, and it does mean you have to change something about Y (and that changes something about H) it won't be as big a problem as it might have seemed at first.  Figure out Q, make the changes to Y and H and keep going.\n\nYou really can walk a thousand miles one step at a time, so take some steps and don't get too bogged down on wether it would be perfect starting off NNE, NE or N.  Get going in the general direction, and then check after some progress and re-orient, and keep moving, then you'll get there.",
            "title_similarity": "0.72619975",
            "sentiment_compound": 0.9107
        },
        {
            "id": "h1jgwki",
            "score": 1,
            "text": "I needed this today, its no coincidence",
            "title_similarity": "0.42042565",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1jgwzs",
            "score": 1,
            "text": "Telling me to \"stop overthinking\" is like telling a short person to just grow taller. It just don't work like that, honey, but thanks for the thoughts at least.",
            "title_similarity": "0.671714",
            "sentiment_compound": 0.5338
        },
        {
            "id": "h1jgxrl",
            "score": 1,
            "text": "Best advice i've ever read.",
            "title_similarity": "0.30014467",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1jgzxq",
            "score": 1,
            "text": "Not when you've got someone who constantly breathes down your neck you don't....",
            "title_similarity": "0.356804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jh11g",
            "score": 1,
            "text": "I always think about what the consequences are for picking incorrectly/failure, they're rarely a huge deal so if I screw up I'll deal with it at that time.",
            "title_similarity": "0.70625395",
            "sentiment_compound": -0.387
        },
        {
            "id": "h1jh8dq",
            "score": 1,
            "text": "Thanks, I just got fired for following your advice, I'll probably lose my medical license for this.",
            "title_similarity": "0.6503148",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1jh9b0",
            "score": 1,
            "text": "Didn't know there was a name for this but it's an issue for me. Thanks!",
            "title_similarity": "0.5533358",
            "sentiment_compound": 0.63
        },
        {
            "id": "h1jhiyc",
            "score": 2,
            "text": "As a catering chef who has about a dozen tasks going simultaneously,I completely agree.",
            "title_similarity": "0.27123377",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h1jhk45",
            "score": 1,
            "text": "Just film him cutting your hair",
            "title_similarity": "0.4146824",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1jhk4g",
            "score": 1,
            "text": "This was me with writing. \n\nI could write 20,000+ words of backstory and supplemental information with ease but even the thought of sitting down to start the first chapter was terrifying until I just forced myself.\n\nNow I’ve got 40,000 words of pure story. Just do it.",
            "title_similarity": "0.5168889",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h1jhq1q",
            "score": 2,
            "text": "I think it depends on the type of task. Writing a paper, definitely. You can always go back and fix mistakes. Remodeling a bathroom, not so much.",
            "title_similarity": "0.73936707",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1jhsch",
            "score": 1,
            "text": "Needed to read this today, thank you",
            "title_similarity": "0.5315474",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jhv6k",
            "score": 1,
            "text": "Thats one approach. Procrastination is often percieved as being lazy when in reality productive procrastination is often more effective than just winging it because youre analyzing the task, gaining more information while thinking about the best approach to accomplish the task the right way the first time.",
            "title_similarity": "0.7263296",
            "sentiment_compound": 0.8932
        },
        {
            "id": "h1jhwym",
            "score": 1,
            "text": "In addition, it can also just lead to procrastination if you don't want to think about it either.",
            "title_similarity": "0.5901384",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h1jhy1i",
            "score": 1,
            "text": "I needed (and will continue to need) that reminder",
            "title_similarity": "0.39158034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jhyvy",
            "score": 1,
            "text": "I've started making a to-do list at work and generally go in order of priority and deadlines. And I'll work through each task a little at a time. So like if there's a big project but the deadline is in 3 months, I'll do a little bit each day. Otherwise, I'll just overwhelm myself either by trying to finish it before smaller tasks (with immediate deadlines) or pushing it off till the week before and stress myself out.\n\nThis process also leaves wiggle room for auditing my work.",
            "title_similarity": "0.6020145",
            "sentiment_compound": -0.5617
        },
        {
            "id": "h1ji1yl",
            "score": 1,
            "text": "This is the agile way.",
            "title_similarity": "0.2047984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ji3mj",
            "score": 1,
            "text": "\"Motion before emotion\"",
            "title_similarity": "0.29721802",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ji7mr",
            "score": 1,
            "text": "This feels targeted to me. \n\nI over think everything. Have constant lists going. Always pushing *very* simple tasks onto the next day…. But for months. \n\nMy engine has run out of oil.",
            "title_similarity": "0.5998342",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ji7rb",
            "score": 1,
            "text": "Unless your a doctor, teacher, detective, chef, accountant etc.",
            "title_similarity": "0.34369436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jib83",
            "score": 1,
            "text": "Is this shitty life pro tips? This is awful advice",
            "title_similarity": "0.56159836",
            "sentiment_compound": -0.765
        },
        {
            "id": "h1jii5x",
            "score": 1,
            "text": "Somewhere my wife is reading this having a heart attack",
            "title_similarity": "0.37795988",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1jiryx",
            "score": 1,
            "text": "No no no no no. You need to spend millions on a 300 page strategy and make sure it never leaves the shelf!",
            "title_similarity": "0.40909004",
            "sentiment_compound": 0.7396
        },
        {
            "id": "h1jivk8",
            "score": 1,
            "text": "I get so tired just thinking about all the stuff I have to do.",
            "title_similarity": "0.6213118",
            "sentiment_compound": -0.5777
        },
        {
            "id": "h1jj14e",
            "score": 1,
            "text": "This is such a great tip. \n\nOne of my greatest frustrations at work is having to problem solve within a team and watching them all suffer from analysis paralysis while I already have a plan and would like to move on it sooner rather than later.",
            "title_similarity": "0.8069",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1jj25n",
            "score": 1,
            "text": "Works well enough for NASA.",
            "title_similarity": "0.23985426",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1jj61z",
            "score": 1,
            "text": "That’s what my doctor always says, anyway",
            "title_similarity": "0.39466742",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jja3n",
            "score": 1,
            "text": "Sorry but I'm analytical and was thinking on what you said...",
            "title_similarity": "0.6439453",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h1jjb1j",
            "score": 1,
            "text": "Good job, but: Where was this Post fifteen years ago???",
            "title_similarity": "0.27908725",
            "sentiment_compound": 0.3591
        },
        {
            "id": "h1jjekv",
            "score": 1,
            "text": "\"Instead of doing the thing that makes tasks harder and makes you suffer, do the opposite thing.\" Thanks Dr. Freud, wish I'd thought of that.",
            "title_similarity": "0.7519357",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1jjeq4",
            "score": 1,
            "text": "*laughs in neurodivergence*",
            "title_similarity": "0.25341305",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1jjeq9",
            "score": 1,
            "text": "This has helped me quite a bit with imposter syndrome",
            "title_similarity": "0.3957767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jjida",
            "score": 1,
            "text": "For so many of us, overthinking is something we won't change because even though we're unhappy with the results, we still hold dear the traits that lead to overthinking. It is our identity. As long as we prize ourselves for our sensitivity and discernment and intellectual prowess, the overthinking will continue.\n\nOf course this isn't true for those with actual clinical conditions like OCD and there are an infinite number of ways these behaviors manifest, but for myself and many of those close to me, we are too proud of our overactive brains to really want to change.",
            "title_similarity": "0.67553616",
            "sentiment_compound": 0.8581
        },
        {
            "id": "h1jjiqp",
            "score": 1,
            "text": "Right, we always think about how we should do x or y, but about we start it first because without starting it at all, we just have unsaved projects laying around.",
            "title_similarity": "0.7284755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jjrvg",
            "score": 1,
            "text": "Progress, not perfection.",
            "title_similarity": "0.33503914",
            "sentiment_compound": -0.0511
        },
        {
            "id": "h1jjt70",
            "score": 1,
            "text": "also, don't follow internet tips for critical tasks",
            "title_similarity": "0.5202333",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1jjxd3",
            "score": 1,
            "text": "I do cable/fiber repair and I learned a long time ago and luckily very early on in my career that if I just shut up and start working instead of moaning about it, it's usually over in the time it would haven't taken me to complain about it.",
            "title_similarity": "0.6909839",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1jjxhe",
            "score": 1,
            "text": "I typically make a very broad list of like 3 tasks to accomplish. At the end of the day I will write down everything I actually managed to do and that's much more satisfying than beating myself up for not getting to every single thing I write down.",
            "title_similarity": "0.62596405",
            "sentiment_compound": 0.6519
        },
        {
            "id": "h1jk1fs",
            "score": 1,
            "text": "That’s exacty how I approach my PhD thesis.",
            "title_similarity": "0.39950386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jk5n1",
            "score": 1,
            "text": "I have friends who basically won't do something or show work unless they've absolutely knocked it out of the park.  The problem is, while you try to achieve perfection in everything you do, you end up staying stuck on one thing for far too long, and get nothing done in the long run.\n\nEvery great inventor, scientist, artist, musician, etc., didn't do everything perfectly every time.  While there's quality over quantity, your numbers suffer if that quantity is very low.  \n\nMozart wrote over 600 pieces, including over 50 symphonies, while many great composers stopped at around 9 or 10.  Not all of Mozart's pieces were considered great works, but he kept pushing through all of those pieces.",
            "title_similarity": "0.56344706",
            "sentiment_compound": 0.4801
        },
        {
            "id": "h1jkb1x",
            "score": 1,
            "text": "Is this connected to anxiety or adhd? I do this all the time. I think so much and stress myself I'm just afraid to start.",
            "title_similarity": "0.591586",
            "sentiment_compound": -0.5809
        },
        {
            "id": "h1jkgqy",
            "score": 1,
            "text": "So it has a name",
            "title_similarity": "0.14050058",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jkmrb",
            "score": 1,
            "text": "To quote Kenny Beats. DOTS. Don't over think shit.",
            "title_similarity": "0.44483942",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h1jkoq0",
            "score": 1,
            "text": "I fix this issue with alcohol.",
            "title_similarity": "0.371274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jkswy",
            "score": 1,
            "text": "Yeah the problem comes with step 1. Which is to think about the next 15 steps (10 of which are more like sub-steps) then think about the best order in which to do it, and all of a sudden the pandemic is over and all of that free time is gone. But at least I have a plan... I think.",
            "title_similarity": "0.5643162",
            "sentiment_compound": 0.6593
        },
        {
            "id": "h1jkyz8",
            "score": 1,
            "text": "This is very true. I have anxiety and overthink even at my regular job of over 4 years. I have to really focus on not overcomplicating and laying out my work in steps, I finish 1 step before moving onto the next and before i know I I'm all done! I'll figure out what's next when I get there!",
            "title_similarity": "0.6622046",
            "sentiment_compound": 0.4547
        },
        {
            "id": "h1jl4q7",
            "score": 1,
            "text": "And that is called... (drums) agile!",
            "title_similarity": "0.14455914",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jl5ek",
            "score": 1,
            "text": "Not just analysis paralysis, but also the false idea that we need to be inspired or even just \"feel like\" working.   Below is a snip from a Harvard Business Review article (link provided), and as somebody who needed to be \"inspired\" to get things done, it really hit me hard.   In the few years since I read it there have been many times where I've said to myself \"I want or need this to be finished.  It doesn't matter if I don't feel like doing it.\"  Then, I do it.\n\n*Somewhere along the way, we’ve all bought into the idea – without consciously realizing it – that to be motivated and effective we need to feel like we want to take action.  We need to be eager to do so.  I really don’t know why we believe this, because it is 100% nonsense. Yes, on some level you need to be committed to what you are doing – you need to want to see the project finished, or get healthier, or get an earlier start to your day.  But you don’t need to feel like doing it. ................. So if you are sitting there, putting something off because you don’t feel like it, remember that you don’t actually need to feel like it.  There is nothing stopping you.*\n\n[https://hbr.org/2014/02/how-to-make-yourself-work-when-you-just-dont-want-to](https://hbr.org/2014/02/how-to-make-yourself-work-when-you-just-dont-want-to)",
            "title_similarity": "0.6771036",
            "sentiment_compound": 0.99
        },
        {
            "id": "h1jl8v3",
            "score": 1,
            "text": "Sure.. but take your time and think things through. Do not rush. Anything worth doing is worth doing it right. Unless you want to do it three times..",
            "title_similarity": "0.619678",
            "sentiment_compound": 0.3508
        },
        {
            "id": "h1jlf5y",
            "score": 1,
            "text": "Overthinking...meaning thinking without progress is bad.  But thinking and planning is always good.",
            "title_similarity": "0.71060216",
            "sentiment_compound": 0.626
        },
        {
            "id": "h1jlg62",
            "score": 1,
            "text": "I recently tried this and overlooked a much better solution though.",
            "title_similarity": "0.6004971",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1jlgho",
            "score": 1,
            "text": "This doesn't always work. I'm a electrician and if I don't plan my shit out and just go with it your panel room is going to look like a jungle gym and nothing will be matched.",
            "title_similarity": "0.64980227",
            "sentiment_compound": 0.6623
        },
        {
            "id": "h1jll2f",
            "score": 1,
            "text": "This is a good tip, but work can be useless if you just get started working. Objectives, strategies and tactics. Just thing of it as going from vague/broad plans (I’d like to have a nice backyard), to an idea about how that can happen (A more pleasant view will give me a nicer backyard) and finally the task to start it (I’ll need to remove that old, dead tree first).",
            "title_similarity": "0.738409",
            "sentiment_compound": 0.7899
        },
        {
            "id": "h1jlls0",
            "score": 1,
            "text": "*Laughs in ADHD and rejection sensitivity*",
            "title_similarity": "0.3426363",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1jm74c",
            "score": 1,
            "text": "NO! PARALYSIS ONLY FOR ME!",
            "title_similarity": "0.44247866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jm91d",
            "score": 1,
            "text": "For perfectionism, this can be good advice, but for people with executive dysfunction for whatever reason (ADHD, autism, depression etc.), things like \"just do it\" can feel like absolutely useless advice. Because how can you \"just do it\" if the task overwhelms you or you don't even know where to start?",
            "title_similarity": "0.7189388",
            "sentiment_compound": -0.7899
        },
        {
            "id": "h1jmc13",
            "score": 1,
            "text": "Too bad my job description is bomb defuser.",
            "title_similarity": "0.5351335",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h1jmhu8",
            "score": 1,
            "text": "This very much depends on the type of work though.",
            "title_similarity": "0.47874326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jmiyg",
            "score": 1,
            "text": "To each their own. This is probably really good advice for the average redditor, but there are definitely people who act without thinking things through enough",
            "title_similarity": "0.72008693",
            "sentiment_compound": 0.6855
        },
        {
            "id": "h1jmj9f",
            "score": 1,
            "text": "I read somewhere that motivation comes from starting the work",
            "title_similarity": "0.52474624",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1jmlfx",
            "score": 1,
            "text": "Good ole analsis paralsis amirite",
            "title_similarity": "0.29480845",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1jmmgw",
            "score": 1,
            "text": "Nah I sometimes have to plan my internet installs out to a T ahead of time otherwise I could end up doing a bunch of work that I end up having to un do later.  It really depends on the task.",
            "title_similarity": "0.67325544",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1jmmxt",
            "score": 1,
            "text": "That only works in some tasks though. If I did that at work.... well, there would be problems.",
            "title_similarity": "0.7063945",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1jmqp5",
            "score": 1,
            "text": "I feel personally attacked.\n\n😬",
            "title_similarity": "0.3474863",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1jmvu3",
            "score": 1,
            "text": "I like Gantt charts for life planning personally. Keep iy simple yes, but visual representing how all the big stuff is connected can be important.",
            "title_similarity": "0.5853925",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1jmxtv",
            "score": 1,
            "text": "lpt: dont overthink",
            "title_similarity": "0.43925923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jmyr3",
            "score": 1,
            "text": "Caveat: if you’re neurotypical.",
            "title_similarity": "0.38946554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jn2kq",
            "score": 1,
            "text": "Perfectionists in shambles.\n\nI have this problem pretty badly, I spend too much time figuring out the perfect way to do things instead of just doing them and learning along the way.",
            "title_similarity": "0.78517616",
            "sentiment_compound": 0.1962
        },
        {
            "id": "h1jn644",
            "score": 1,
            "text": "As a brain surgeon, I can’t thank you enough for this advice.",
            "title_similarity": "0.5910429",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jna8l",
            "score": 1,
            "text": "OMG! Thanks for giving me the words to describe a problem I often have. Analysis paralysis!!! Love it.",
            "title_similarity": "0.58998084",
            "sentiment_compound": 0.8388
        },
        {
            "id": "h1jnc51",
            "score": 1,
            "text": "That's why it's called a Cover letter/s",
            "title_similarity": "0.34348807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jnkrl",
            "score": 1,
            "text": "This kills me for sure",
            "title_similarity": "0.41762495",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1jnmgq",
            "score": 1,
            "text": "so happy to finally find out what its called. i thought it was just terminal indecisivenesa",
            "title_similarity": "0.5421847",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h1jnqam",
            "score": 1,
            "text": "r/ADHD would like a word",
            "title_similarity": "0.34576055",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jns2s",
            "score": 1,
            "text": "There’s a fine line here. As someone with ADHD on a leadership/director level, it’s very easy for me to crank out a ton of work that realistically I should have delegated or let go undone to work on the long-term critical things that do require more extensive planning (or are themselves planning for other people’s roadmaps).\n\nIt’s very easy to obsessively tinker with things and get into an unproductive mess, and it’s very easy to just hit the request list from the top and bang things out from the top to the bottom and not get to the stuff the moves the needle. \n\nThere’s a balance where you need to think enough about work to properly identify the top 3-5 things, and get stuck in on them.",
            "title_similarity": "0.6679754",
            "sentiment_compound": 0.8082
        },
        {
            "id": "h1jny15",
            "score": 1,
            "text": "You know most of that analysis paralysis wouldn’t occur if the job wasn’t exceptionally complex and tedious due to incompetent management.\nI’m a veteran of analysis paralysis and have quit a ton of jobs because of it. I’ve been kicked out by my family fighting over my decisions to quit jobs and have destroyed friendships trying to maintain an occupations. \nWhen I finally realized that I’m not being unreasonable but instead my boss and their bosses are just incompetent it suddenly made all the analysis paralysis go away. I don’t have to do excessively strenuous tasks because it’s expected of me, it’s because the people who tell me what to do actually have no idea how to do my job or what is possible.",
            "title_similarity": "0.68954766",
            "sentiment_compound": -0.8765
        },
        {
            "id": "h1jnyxg",
            "score": 1,
            "text": "I’m going to spend a few days coming up with that basic plan! Can’t wait to start!!",
            "title_similarity": "0.4301877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jo0ms",
            "score": 1,
            "text": "Adhd hell mode right here.",
            "title_similarity": "0.289936",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1jo2fg",
            "score": 1,
            "text": "This is me, classic over-thinker. Took me awhile to learn to stop analyzing and start doing. I",
            "title_similarity": "0.7295094",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1jo54t",
            "score": 1,
            "text": "YMMV if you're neurodivergent.",
            "title_similarity": "0.406377",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jo71s",
            "score": 1,
            "text": "Prioritize and execute. Find the most important thing you can be doing at that moment and start doing it.",
            "title_similarity": "0.5056313",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h1jocjf",
            "score": 1,
            "text": "This is a really good tip especially for writing.",
            "title_similarity": "0.44718772",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h1jod3z",
            "score": 1,
            "text": "365 days too late to hear this",
            "title_similarity": "0.40151507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1joe0s",
            "score": 1,
            "text": "This for sure. If I just get started, great things happen. Spending too much time in the planning phase is where things go south.",
            "title_similarity": "0.56229675",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1jp1ac",
            "score": 1,
            "text": "Thoughts like this is now why I have to redesign the data base...",
            "title_similarity": "0.5662457",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jp8rm",
            "score": 1,
            "text": "Not recommended when remodeling a bathroom, I’ve found out. \n\nSome things you should have a plan for",
            "title_similarity": "0.6929147",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h1jp9gn",
            "score": 1,
            "text": "Tried this when coding in C++, memory leaks everywhere.",
            "title_similarity": "0.54539835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jpb7b",
            "score": 1,
            "text": "Just stop overthinking! Just stop being poor! Fuck outta here. Absolutely shit post.",
            "title_similarity": "0.6271212",
            "sentiment_compound": -0.938
        },
        {
            "id": "h1jpho0",
            "score": 1,
            "text": "Overthinking is somewhat to get rid or at least minimized it due to the fact that what I fear most is failure. There are many what if or worst scenarios to avoid which cause me analysis paralysis. BTW, thanks for the advice since this is somehow challenged to me especially in doing tasks.",
            "title_similarity": "0.7771833",
            "sentiment_compound": -0.8905
        },
        {
            "id": "h1jpm37",
            "score": 1,
            "text": "Great. Now I have to go to Lowes. Again. They're going to start charging me rent I swear to God.",
            "title_similarity": "0.403791",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h1jpn64",
            "score": 1,
            "text": "Boom \nJust do it",
            "title_similarity": "0.20258984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jpp6d",
            "score": 1,
            "text": "This is something I live by and it has helped me become very successful at my job",
            "title_similarity": "0.31390178",
            "sentiment_compound": 0.624
        },
        {
            "id": "h1jpruv",
            "score": 1,
            "text": "I am guilty of this.  Took me a year to finish my stairs.",
            "title_similarity": "0.3649779",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1jpskk",
            "score": 1,
            "text": "I recently started welding... doing body work on an old truck. I get hit with the analysis paralysis, and eventually I brush it to the side and get to doing the work. Then I stand back and critique the work and am frustrated with myself that I moved too quickly. So I dunno. Almost feels catch-22y.",
            "title_similarity": "0.6693501",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1jq4lm",
            "score": 1,
            "text": "First you start. Then you get better.",
            "title_similarity": "0.47882348",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1jqhrt",
            "score": 1,
            "text": "Yea...no.  you don't always figure things out along the way.  You can easily overlook an important detail and have to start all over.  Only having a very basic plan instead of a detailed one can very easily lead to under thinking.",
            "title_similarity": "0.7965318",
            "sentiment_compound": 0.7089
        },
        {
            "id": "h1jqiol",
            "score": 1,
            "text": "Eh depends. Breaking down a complex task into small manageable tasks is VERY helpful.",
            "title_similarity": "0.5933753",
            "sentiment_compound": 0.5894
        },
        {
            "id": "h1jqjje",
            "score": 1,
            "text": "This right here is what the fuck is up",
            "title_similarity": "0.2236495",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1jqjlw",
            "score": 1,
            "text": "This also relate to making choices. We live in an age of so many options. Something as simple as time picking a show to watch on Netflix. I can get paralyzed. The paradox of choices ties well with analysis paralysis.",
            "title_similarity": "0.49689776",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1jqjtp",
            "score": 1,
            "text": "Maybe it's because I'm autistic but I find the opposite is true for me. I need a detailed plan to get anything done, even showering and brushing my teeth.",
            "title_similarity": "0.70453376",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1jqofi",
            "score": 1,
            "text": "Especially useful for people with ADHD🤟🏼",
            "title_similarity": "0.32987496",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h1jqs4y",
            "score": 1,
            "text": "Wish my boss would let me. Just get on without the need for a full spec scope before we even know the actual question.",
            "title_similarity": "0.72243047",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1jqy2j",
            "score": 1,
            "text": "But how do I psych myself to do something I don't want to do without analyzing it",
            "title_similarity": "0.68087083",
            "sentiment_compound": -0.0857
        },
        {
            "id": "h1jra39",
            "score": 1,
            "text": "Overthinking is all I do.\nMy mom got a new toilet and you pushed a button to flush it. You had two options- push the slightly larger button or the smaller (it was like an uneven ying yang). Except they were also uneven- one was set a little lower than the other.\nObviously one was for 💩. But my brain froze while trying to figure out if the one that was bigger or that was set deeper was the one for that. My mom eventually told me she thinks the uneven height was just a defect and that she never had this conundrum.\n\nAlso- why did my font change after the emoji? Gonna sit here and overthink that for a while. Edit: oh you can’t see the font change while reading this.",
            "title_similarity": "0.6223093",
            "sentiment_compound": -0.4221
        },
        {
            "id": "h1jrae2",
            "score": 1,
            "text": "I know that it is more my various disorders saying this, but no, I vehemently disagree. If you don't completely understand what you are doing, if you don't consider all repercussions, all possible effects and every potential causal result of any action you do, then you are not being responsible or ethical in any way. If you cannot comprehend the full scope of each and every action you take, then you are an ignorant and dangerous threat to anyone and anything close to you.\n\nAt least, that is what I tell myself every day. And I know that is unreasonable to expect that level of awareness, so I just don't do things any more. But also, I don't get into any trouble this way either, I just don't get to do anything that I like. And when you think that you are possibly going to irreversibly fuck up your life with everything you do, you kind of don't give a shit about what you want as a person. \n\nSo there. You can't be paralyzed with indecision when you realize that you have no options anyway.\n\nThis is obviously troll logic, but also it's the troll logic that I and possibly a lot of other people live with every day, and use to direct our daily lives. And I bring this up because I have heard a lot of people tell me \"just stop over analyzing everything\" over my life, but none of them seem to understand why I over analyze to begin with, and that I won't be able to just \"stop\" a behavior that I installed and reinforced a long time ago.\n\nBut if there is an actual constructive protip about how to overcome that programming and behavior, then I am open to hearing about it.",
            "title_similarity": "0.6891781",
            "sentiment_compound": -0.9723
        },
        {
            "id": "h1jrfkz",
            "score": 1,
            "text": "Absolutely terrible software advice",
            "title_similarity": "0.46690506",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h1jrhja",
            "score": 1,
            "text": "I find myself in this trap often at work (software development), I think \"what's the cleanest most elegant way to write this code??\" and then discover I haven't done anything meaningful for the last couple of hours because I thought about it too hard...",
            "title_similarity": "0.6722367",
            "sentiment_compound": -0.2392
        },
        {
            "id": "h1jrhlx",
            "score": 1,
            "text": "Oh god I’ve been stuck in this cycle for months and I finally have a name for it",
            "title_similarity": "0.390194",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1jrkfn",
            "score": 1,
            "text": "Yeah, whenever I do something. I tend to gather all the resources about it I can possibly find. Then I sort the resources from best to worst, then I read the first resource from top to bottom and once I'm confident I have all the info I need, I go do the task. The problem is I'm never confident so I end up reading the second and third resource and create a 10 page word document to compare all the different possible solutions and by the time I've found a solution I'm confident with, it's 2am in the morning.",
            "title_similarity": "0.5500069",
            "sentiment_compound": 0.8509
        },
        {
            "id": "h1jrq0i",
            "score": 1,
            "text": "Rhis has been a HUGE problem for me lately.",
            "title_similarity": "0.4168632",
            "sentiment_compound": 0.0857
        },
        {
            "id": "h1jrvt5",
            "score": 1,
            "text": "Sounds like you’ve talked to the project managers at my office.",
            "title_similarity": "0.3494803",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1js9gy",
            "score": 1,
            "text": "Car buying, home buying, home selling, studying, it’s all killing me. I needed this. Now back to work",
            "title_similarity": "0.5861197",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1jscgc",
            "score": 1,
            "text": "This is me with the flooring I need to install that has been sitting in my room for 4 months .",
            "title_similarity": "0.20131038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jscl2",
            "score": 1,
            "text": "I’m moving to Australia in a month after living in Florida for 22 years. Yesterday one of my regulars at work noticed that I was more tired than normal. He was very kindly toward me and it just threw me into ugly cry mode out of nowhere. Just the thought of leaving my friends and family is terrifying. Especially now; but, this could be my one chance to experience something I’ve never had the chance to and it’s big scary... \n\nTLDR:The closer I get to moving day, the more I panic about my present situation. Thx for the support random Redditer. I know everything will be alright.",
            "title_similarity": "0.5366912",
            "sentiment_compound": -0.5896
        },
        {
            "id": "h1jscla",
            "score": 1,
            "text": "That's exactly what's happening to my Master's research",
            "title_similarity": "0.41148454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jsesj",
            "score": 1,
            "text": "Just go by this: what's the worst thing about the choice you're about to make? Is it that it simply may not be the most optimal one?\n\nThen it's probably good enough.\n\nOr, ask yourself: is it reversible? If yes, do it - nothing to worry about. If it doesn't work out, you can always go back and make a different choice (this is also known as \"are you about to go through a one-way door or a two-way door?\")\n\nMaking mistakes and gaining experience and wisdom is more important in life than making the perfect decision every time.",
            "title_similarity": "0.7784015",
            "sentiment_compound": 0.9447
        },
        {
            "id": "h1jsolg",
            "score": 1,
            "text": "This is especially key for exercising",
            "title_similarity": "0.36670586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jszov",
            "score": 1,
            "text": "You lost me at plan",
            "title_similarity": "0.6144986",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1jtobr",
            "score": 1,
            "text": "I work in IT doing projects, and this is the exact opposite of how I’m successful. I’m thinking and planning things even in off hours (ADD side effect) so that when it comes time to do something ive already considered as many problems and gotchas as I possibly can. For me, doing things your way leads to a ton of wasted time and backtracking or outright failure.",
            "title_similarity": "0.71999186",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1jttc1",
            "score": 1,
            "text": "Is the \"Get things done\" paradigm something that adds to the chance of analysis paralysis, or something that avoids it.. I can't decide...",
            "title_similarity": "0.630218",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1jtx3h",
            "score": 1,
            "text": "LPT: Don't follow this advice if you're a surgeon.",
            "title_similarity": "0.5493432",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ju22q",
            "score": 1,
            "text": "ah yes, i'll tell my brain to stop worrying about worrying.\n\nthat will help.",
            "title_similarity": "0.6932983",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1jub1m",
            "score": 1,
            "text": "I can feel that. Thanks mate",
            "title_similarity": "0.22572249",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1juh3p",
            "score": 1,
            "text": "depending on your job this is either fantastic or terrible advice! Its essentially meaningless. Some situations will benefit from careful analysis. Some not so much. Experience will give you the sense of when it is worth it to analyse further. No experience ? Try listening to trusted colleagues.",
            "title_similarity": "0.8008994",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h1juuwm",
            "score": 1,
            "text": "this is actually really helpful and honestly kind of calming lol thank you op",
            "title_similarity": "0.30279803",
            "sentiment_compound": 0.924
        },
        {
            "id": "h1juw7u",
            "score": 1,
            "text": "Man I do this shit a lot.  \n\nThe best thing is to break it down step by step.  It seems like a lot more work when you first learn the steps, but just like anything else it becomes second nature",
            "title_similarity": "0.7223164",
            "sentiment_compound": 0.6092
        },
        {
            "id": "h1jux14",
            "score": 1,
            "text": "Overthinking overanalysing separate the body from the mind.",
            "title_similarity": "0.63971454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jv8rc",
            "score": 1,
            "text": "LPT: Read the book Think & Grow Balls!",
            "title_similarity": "0.4498153",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jva4z",
            "score": 1,
            "text": "When you lump all your tasks together, it feels insurmountable, but if you look at each one and write them down, they don't",
            "title_similarity": "0.6998251",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jvksn",
            "score": 1,
            "text": "Nice tip. Source: my username",
            "title_similarity": "0.3504082",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1jvm1d",
            "score": 1,
            "text": "Yes, I do this. I start with ‘get to work’ and go from there",
            "title_similarity": "0.39143762",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1jvmg3",
            "score": 1,
            "text": "Thank you Tony Robbins",
            "title_similarity": "0.24229646",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1jvwk3",
            "score": 1,
            "text": "This is the *exact* opposite advice I would give. Many people waste countless hours on analysis because they don't adequately specify their goal.",
            "title_similarity": "0.63252395",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1jw48p",
            "score": 1,
            "text": "Also known as the **Agile Mindset**™. If you pay me $80k over the course of a year I can teach YOUR business a dozen overcomplicated ways to think Agile in your daily work ✨",
            "title_similarity": "0.3752097",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1jw8l9",
            "score": 1,
            "text": "I do that every time I am asked to perform any kind of task\n\nMath, language, stand in front of the whiteboard and write something, answer a question asked by a teacher, parent or a classmate\n\nI realize someone's expecting me to know something and that's it. My mind goes blank\n\nEven tho I often know the answer",
            "title_similarity": "0.6407856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jwijg",
            "score": 1,
            "text": "The plan is nothing, planing is everything.",
            "title_similarity": "0.51081765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jwizg",
            "score": 1,
            "text": "With this advice you should win 90% of among us games",
            "title_similarity": "0.20257911",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1jx5ts",
            "score": 1,
            "text": "This reminds me of a quote my grandpa used to say (not his quote but I don’t know where he got it from): “Doing things is all right. Having things to do is terrible.”",
            "title_similarity": "0.6694509",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jx6pk",
            "score": 1,
            "text": "Cannot be overstated",
            "title_similarity": "0.2146157",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jx6qb",
            "score": 1,
            "text": "Dude I didn't know that was a thing!! But I have had it all my life! It's like I have to have a detailed plan out of fear I'll else fail. But I ended up realising not doing anything is a guaranteed failure. \nMy wife told me to just start, just do, anything really, don't matter what anything is better then nothing. I thought it was not smart, did it anyway and got so much done.",
            "title_similarity": "0.77436763",
            "sentiment_compound": -0.9134
        },
        {
            "id": "h1jxhcw",
            "score": 1,
            "text": "For me I kind of have to in order to make sure I don’t get to a point where I blank and forget everything.",
            "title_similarity": "0.7355684",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1jxm0f",
            "score": 1,
            "text": "Yeah I’ve realized that if I spend 2 hours planning out the next 3 days most of the time I spent planning gets wasted. Just coming up with the rough details of what I need to do(like unit 6, unit 7, final exam review, x days to finish, etc.) tends to help me more as if I’m too strict I don’t meet deadlines but if I’m broad then chances are I’ll still meet the final deadline",
            "title_similarity": "0.68264425",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h1jxnl5",
            "score": 1,
            "text": "Easier said than done when you have ADHD and OCD. I have to make a detailed plan. If it doesn’t work I have to reevaluate and find another way. And when it does work I have to obsess till it’s perfect. If I don’t complete the task it never gets done cuz...SQUIRREL!",
            "title_similarity": "0.77223843",
            "sentiment_compound": 0.6996
        },
        {
            "id": "h1jxum0",
            "score": 1,
            "text": "I have severe analysis paralysis. Nothing gets done as a result.",
            "title_similarity": "0.5447818",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1jxxub",
            "score": 1,
            "text": "This sub has gone down hill and now it’s in the gutter. “Have a hard time getting things done? Just do it” you sound like a moron.",
            "title_similarity": "0.5919808",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1jy0ru",
            "score": 1,
            "text": "Ahhh yes.\n\nFor similar advice see \"Depressed? Just think happier positive thoughts it'll fix everything\"",
            "title_similarity": "0.5902875",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1jy5ac",
            "score": 1,
            "text": "This is my problem with project management. You can't predict how each step of a project is going to go, especially large and complex ones or unique ones in a field with no precedent. Just do the first thing toward your goal, stop and scratch your head for a bit, do the next thing toward your goal, repeat. No crystal balling.",
            "title_similarity": "0.7343146",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h1jyc9v",
            "score": 1,
            "text": "Most of the most influential people like Thomas  edison. Georgre washington the list goes on. A lot of them took drugs like it was natural. Most were high on opium and sipping martinis at 10 AM they were in a flow state working on there missions. They had focus and clarity. Lets all find focus and clarity",
            "title_similarity": "0.2910286",
            "sentiment_compound": 0.9366
        },
        {
            "id": "h1jywn1",
            "score": 1,
            "text": "Thats essentially my life plan, i dont recomend it.",
            "title_similarity": "0.57796574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jz2d2",
            "score": 1,
            "text": "I completely disagree. At least for my work anyways. As an engineer and think about the most Effie my way to get a task done and what may or may not go wrong along the way and then go for it. If I used the approach I’d be running back in circles all day.",
            "title_similarity": "0.73675156",
            "sentiment_compound": -0.0872
        },
        {
            "id": "h1jz2rv",
            "score": 1,
            "text": "Other thing I haven’t seen mentioned is that the reality is for most tasks (new ones especially), no amount of thinking will help. Like you literally dont know the best or right way to do things.",
            "title_similarity": "0.68701136",
            "sentiment_compound": -0.1682
        },
        {
            "id": "h1jz4lg",
            "score": 1,
            "text": "Analysis Paralysis\n\nGood song title",
            "title_similarity": "0.41388538",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1jza8c",
            "score": 1,
            "text": "If it was so easy to do so then it wouldn't be a problem",
            "title_similarity": "0.38740608",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h1jzb5j",
            "score": 1,
            "text": "What's the tip though? \"Have a basic plan and just start working\" isn't really a tip.",
            "title_similarity": "0.6822345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jzdx7",
            "score": 1,
            "text": "Nope.  My advisor follows this mantra and it regularly fails spectacularly.  Taking an hour to define what you want to accomplish, some feasible ways to get there, and a contingency plan works much better for me.  But that's just, like, my opinion man.",
            "title_similarity": "0.6991078",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h1jzkga",
            "score": 1,
            "text": "I think a lot of people who like to hide behind their \"mental health problems\" don't realize that anyone can get analysis paralysis and that it is totally normal. I keep hearing about being 'overwhelmed' and I think yeah kid welcome to life.",
            "title_similarity": "0.66529405",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1jzrp5",
            "score": 1,
            "text": "Wow thanks everything is solved /s",
            "title_similarity": "0.38371894",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h1jzsig",
            "score": 1,
            "text": "This is how bad code and technical debt gets born.",
            "title_similarity": "0.5713389",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h1jztwb",
            "score": 1,
            "text": "Nike \"just do it\"",
            "title_similarity": "0.32659918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k0jwx",
            "score": 1,
            "text": "Say my task is \"write a bachelor thesis\", how would I go about not overthinking that but rather simplifying it?",
            "title_similarity": "0.59938747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k0suk",
            "score": 1,
            "text": "Well... I think this is good advice for a lot of people, but honestly for me it isn't. I need two things to get to work: motivation, and knowing what I'm doing. I need to break each task into more detailed and progressive tasks, otherwise while working I get demotivated or lost (I can easily forget what I'm currently doing / working on).\nHaving a very detailed list of tasks is indispensible for me, even if it takes me half an hour (sometimes an hour) to make it, because at least when I get to work I can be as efficient as I can.",
            "title_similarity": "0.7768703",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h1k11un",
            "score": 1,
            "text": "I like that term, analysis paralysis.\n\nIt's such a common phenomenon that I wish more people talked about it. Especially in a consumer culture, I've noticed many of us tend to buy supplies, and read article after article about doing something rather than just doing it. \n\nFor example, my fiancee has been getting into wood burning. But instead of just practicing, she bought all the supplies, watched a bunch of videos, had one unexciting attempt at it and decided it was too difficult. \n\nThe people who are successful in life are people who do a minimal amount of prep work, get in there and try something, and keep working at it until they make something of worth. It's better to fail a hundred times because you didn't do enough learning beforehand than to never start because you're too busy reading, or fail once and give up after all of that time and money spent because you find out it's not for you.\n\nLearning is often the easy part. Applying that knowledge is the hard part. Move to the practical side of things as soon as possible, and be diligent.",
            "title_similarity": "0.61110127",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1k1mzg",
            "score": 1,
            "text": "Did this last night! Tried positive thinking all day with no complaining about anything. I have adhd so sometimes when I write out all my tasks that I have to do for the day I get overwhelmed by just looking at the long list. I tried re-writing my tasks in a different manner in my notebook. I now write them as:\nTop 3 tasks for the day:\n1.\n2.\n3\nThen under I write: additional tasks if you have time:\n1.\n2.\n3.\n\nJust seeing it like this instead of a long list of like 12 things helps me focus on a smaller portion at a time and it makes it easier to begin the tasks.",
            "title_similarity": "0.6328228",
            "sentiment_compound": 0.9421
        },
        {
            "id": "h1k1y3x",
            "score": 1,
            "text": "Progress goals are better than outcome goals. Set tasks for yourself to do the next step in the process towards your goal.",
            "title_similarity": "0.6028088",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1k24pg",
            "score": 1,
            "text": "This happens to me a lot while programming.. stresses me out",
            "title_similarity": "0.5148738",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h1k268l",
            "score": 1,
            "text": "Does this apply equally well to writing?\n\nI feel like all I do is think about writing, but I never write because my ideas are never planned out well enough and I'm really bad at improvising.",
            "title_similarity": "0.69539285",
            "sentiment_compound": -0.7278
        },
        {
            "id": "h1k26ej",
            "score": 1,
            "text": "Thanks man, I now don't overthink",
            "title_similarity": "0.4167149",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1k2aqd",
            "score": 1,
            "text": "As a designer, I find it's best to just start something, even if it's a total redo later.",
            "title_similarity": "0.7385554",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1k2hl0",
            "score": 1,
            "text": "This is how I assemble all my IKEA furniture … \n\nturns out great 🥴",
            "title_similarity": "0.22978044",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1k2kxi",
            "score": 2,
            "text": ">LPT: Stop overthinking\n\nSee, that's the thing....",
            "title_similarity": "0.5688615",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1k2pjo",
            "score": 1,
            "text": "I’m currently moving and this is KILLING me! Wanting to find the perfect-sized boxes, over-organizing piles instead of actually packing them away, et cetera.",
            "title_similarity": "0.6537295",
            "sentiment_compound": -0.7525
        },
        {
            "id": "h1k2z1p",
            "score": 1,
            "text": "A good technique to defeating executive dysfunction is reaction based motivation.\nIs a project suddenly in your head and just needs a drive to the store? Start  driving immediately.\nIs there a small mess that you just looked at and aren't doing anything else? Do it now or it won't get done.\nNeed to do something on your own 3 days from now? Stick in a random time that you are free on your calendar and do not ignore it.\n\nThe longer you take to start sometime the less likely you will do it, even if it's just getting one required object out for the task it's easier to get that momentum.",
            "title_similarity": "0.70208037",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h1k39bc",
            "score": 1,
            "text": "Totally disagree. Better than any basic plan, analysis paralysis will probably lead to a better understanding of the whole situation. What if you need to redo all work due to a bad basic plan. Loss of time, work and probably money. No, definitely not a wise move in most cases.",
            "title_similarity": "0.799333",
            "sentiment_compound": -0.3546
        },
        {
            "id": "h1k3bba",
            "score": 1,
            "text": "I build bridges for a living...",
            "title_similarity": "0.32686898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k3utg",
            "score": 1,
            "text": "Oh my God is this why cleaning my room stresses me out like hell? It gets worse and worse and there's so much to ean and go through I get overwhelmed and stressed over it that nothing actually gets done 😭",
            "title_similarity": "0.58999693",
            "sentiment_compound": -0.9382
        },
        {
            "id": "h1k43r2",
            "score": 1,
            "text": "I've started thinking of how much my task takes rather than what I actually have to do. For examples... I need to spend 15 minutes doing minuscule work. Rather than... I need to do the dishes and do the laundry.",
            "title_similarity": "0.55256605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k45nq",
            "score": 1,
            "text": "You make it sound so easy. With ADHD analysis paralysis is kind of uncontrollable, annoyingly. I'll get paralysis coming up with the basic plan, let alone doing the thing.",
            "title_similarity": "0.70367444",
            "sentiment_compound": -0.0134
        },
        {
            "id": "h1k47tz",
            "score": 1,
            "text": "I have really bad avoidance coping. I just avoid everything and anything. It's destroying my life.",
            "title_similarity": "0.5980022",
            "sentiment_compound": -0.9113
        },
        {
            "id": "h1k4kk9",
            "score": 1,
            "text": "This is absolutely fantastic advice. I never could get far into a story for this exact reason, but I recently jumped into one and it’s been going fantastically just because I figured out the broad strokes and just started going with it",
            "title_similarity": "0.48459786",
            "sentiment_compound": 0.3499
        },
        {
            "id": "h1k4p3i",
            "score": 1,
            "text": "I have an ex who definitely suffers from this when it came to school. She was plenty intelligent but when it came time to writing papers or making a speech she would spend hours going over the process while accomplishing very little. Often she would end up missing the deadline and getting a zero when she could have easily bullshitted the assignment and at least gotten a \"C\". The point I took away from watching her struggle is that plenty of the work done in this life can be half-assed and sometimes that's just got to be good enough.",
            "title_similarity": "0.69057477",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1k4p3p",
            "score": 1,
            "text": "I agree with this. Even the best laid plans can go out the window when, once you got it started, a more clear picture of the situation arrives and you'd be wise to adapt to the new revelations.  Give some thought but make sure you start and gain some momentum.",
            "title_similarity": "0.6485035",
            "sentiment_compound": 0.9312
        },
        {
            "id": "h1k4sna",
            "score": 1,
            "text": "Nearly lost my way there, thanks for reminding me",
            "title_similarity": "0.5157282",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1k4w42",
            "score": 1,
            "text": "Never heard the term, love it. \n\nI do a lot of report writing in my job. I always schedule a full day to write a report, spend 5 hours in analysis paralysis and then write a perfectly good report in the remaining 3. As soon as I have to do it, I’m fine, but with time to think I just...think, and don’t write my damn report (and yes, I already know what I want to say at the beginning of the day, the thinking time is adding nothing).",
            "title_similarity": "0.60251844",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1k4wek",
            "score": 1,
            "text": "I rebuilt a vintage camper from the ground up and had days where it felt overwhelming.  What kept me going was just don't something each day.  Doesnt have to be big, polish something here, fix one rotten board there.  Eventually you get to the big stuff by doing all the easy little things.",
            "title_similarity": "0.61694396",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1k4z4l",
            "score": 1,
            "text": "Among other things, I've had this problem with phone calls. \n\nSomeone calls me? Perfectly fine\nI need to call someone for something specific? That's where the problems come in.\n\nIf I don't just force myself to do it before ei can so much as think about it even a little, I can easily sit there for hours hesitating and rehearsing what I'd say ect. Really doesn't help when I have to call someone to cancel plans because something else came up, always end up imagining them getting upset or angry (they usually never do, just grew up in a house where certain family did) and that kind of just makes me stare at the number on my phone screen longer. Can't left the situation play out in my head, because I'll just keep coming up with new ones Ilif I don't just press's the call button before I can think about it\n\nHave other problems with this, but that's one of the more annoying ok es for me",
            "title_similarity": "0.69756365",
            "sentiment_compound": -0.7045
        },
        {
            "id": "h1k54wc",
            "score": 1,
            "text": "Great tip. 👍👍 But still haaaard ☹️",
            "title_similarity": "0.27627003",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h1k5aut",
            "score": 1,
            "text": "Thought about screening in my gazebo for years and kept getting discouraged ab a couple things that didn’t end up being a huge deal. Just finished it and is awesome",
            "title_similarity": "0.5892375",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1k5fao",
            "score": 1,
            "text": "I need to take this advice very seriously. All I do is think about work and how im going to perfectly execute it but in the end never do...",
            "title_similarity": "0.7639366",
            "sentiment_compound": 0.274
        },
        {
            "id": "h1k5g9x",
            "score": 1,
            "text": "Taxes unusually complex this year?  Just take a stab at it!  What’s the worst that could happen?",
            "title_similarity": "0.46383283",
            "sentiment_compound": -0.8608
        },
        {
            "id": "h1k5jw3",
            "score": 1,
            "text": "It’s this type of thinking that usually causes me to start over halfway through because I realize my plan wasn’t detailed enough… but then my detailed plans never work out either…. Surely it can’t be me?",
            "title_similarity": "0.70784694",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h1k5ndp",
            "score": 1,
            "text": "Except  carpentry and home improvement projects. Always measure twice and cut once.",
            "title_similarity": "0.46730924",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1k5oad",
            "score": 1,
            "text": "r/restofthefuckingowl material",
            "title_similarity": "0.34584087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k5qb5",
            "score": 1,
            "text": "Just have a plan? I hated this in English lessons in Secondary school. The teacher would be like \"fAiLiNg To PlAn Is A pLaN tO fAiL\" and I would sit there for 25 minutes not planning. Maybe it's my adhdfd",
            "title_similarity": "0.5755913",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h1k5t4p",
            "score": 1,
            "text": "best advice to a coder/programmer",
            "title_similarity": "0.509871",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1k5wlk",
            "score": 1,
            "text": "Analysis paralysis, wow. I needed this today, thank you!",
            "title_similarity": "0.5921687",
            "sentiment_compound": 0.7644
        },
        {
            "id": "h1k63yi",
            "score": 1,
            "text": "Thank you, no shit, this actually helped me…peace.",
            "title_similarity": "0.41046843",
            "sentiment_compound": 0.6623
        },
        {
            "id": "h1k64ja",
            "score": 1,
            "text": "“Just keep swimming” \n\nThis was my motto in my kitchens when shit started to hit the fan.\n\nJust put your head down, work on the ticket infront of you and push food out; eventually it’s gonna end.\n\nDon’t worry about the back end, take care of what you can take care of.",
            "title_similarity": "0.6772691",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1k65mf",
            "score": 1,
            "text": "Unless you're an engineer, especially for critical or potentially dangerous operations, then please overthink.",
            "title_similarity": "0.6554782",
            "sentiment_compound": -0.5233
        },
        {
            "id": "h1k667y",
            "score": 1,
            "text": "This is me deciding what food to buy. 2 hours later I decide to just fast.",
            "title_similarity": "0.4554112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k6dpl",
            "score": 1,
            "text": "I do tile work. A lot of the time I have a hard time starting .. \n\nSoo.. \n\nI mix mud .. and have to start doing something . It really does help. Lol.",
            "title_similarity": "0.5803399",
            "sentiment_compound": 0.6851
        },
        {
            "id": "h1k6j4d",
            "score": 1,
            "text": "You must not know of a thing called \"crushing anxiety.\" Once you overthink a plan because you want it to be perfect. It does tend to all go wrong and you have to start over and over and over until it is perfect.  Even then it isn't what you planned.",
            "title_similarity": "0.7853226",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1k6jqj",
            "score": 1,
            "text": "Saving for later",
            "title_similarity": "0.42113596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k6mrl",
            "score": 1,
            "text": "Surgeons, airline pilots...",
            "title_similarity": "0.19166848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k6pn3",
            "score": 1,
            "text": "This is (very loosely) the concept behind agile software development and it works really well in other aspects of life as well",
            "title_similarity": "0.5039962",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h1k757i",
            "score": 1,
            "text": "I’ve been to this situation. I teach kids and yet our school has a lot of expectations for the teachers and students.",
            "title_similarity": "0.49974978",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k75tc",
            "score": 1,
            "text": "How much thinking is overthinking? Because starting something with no plan can be bad too.",
            "title_similarity": "0.7229141",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h1k7icp",
            "score": 1,
            "text": "Me on mondays with 100 emails",
            "title_similarity": "0.11500253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k809b",
            "score": 1,
            "text": "Said the brain surgeon to the rocket scientist.",
            "title_similarity": "0.33323798",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k812k",
            "score": 1,
            "text": "People will think you are careless if you avoid analysis at work.",
            "title_similarity": "0.7067189",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1k863z",
            "score": 1,
            "text": "Y'all tried Lexapro?",
            "title_similarity": "0.34828004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k8k2w",
            "score": 1,
            "text": "Does not apply to home renos and contracting.",
            "title_similarity": "0.32574606",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k8o97",
            "score": 1,
            "text": "This has same energy as telling a depressed person to \"just cheer up\".\n\n\"You're an overthinker? Just.. Don't be!\"",
            "title_similarity": "0.62560713",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h1k8rju",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.33266425"
        },
        {
            "id": "h1k8v2y",
            "score": 1,
            "text": "-- Most of the software development industry, probably",
            "title_similarity": "0.3197801",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k94gx",
            "score": 1,
            "text": "I think I really needed to hear this.",
            "title_similarity": "0.40628982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k96px",
            "score": 1,
            "text": "The „Just do something“ principle. \n\nI was doubting it efficiency because i’m an overthinker but it really works.",
            "title_similarity": "0.6667086",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h1k993h",
            "score": 1,
            "text": "I've had some issues with it, but in my field of work, it cannot be applied... I'm dev...\n\nBut It's a pretty good tip for all the other sector..\n\n\nP.S. in the dev side, when we want to create things, overthinking is relatively good, if you think of all the problems there is at the moment of the creation.\nMost of us have not the time to do it, it's sad, because we need to look after some old code, 6 months later, and it's a bit hard",
            "title_similarity": "0.70822036",
            "sentiment_compound": 0.8573
        },
        {
            "id": "h1k9e91",
            "score": 1,
            "text": "Needed to hear this",
            "title_similarity": "0.34301716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k9hga",
            "score": 1,
            "text": "I don't think the astronauts would appreciate my planning their missions this way.",
            "title_similarity": "0.6081848",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1k9lyo",
            "score": 1,
            "text": "Meanwhile I’m laughing over here in fluent ADHD. I *am* the analysis paralysis.",
            "title_similarity": "0.34873813",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1k9nbf",
            "score": 1,
            "text": "I did this when we bought our first house, i looked at it as a whole instead of unpacking one room at a time and it just seemed overwhelming that way and hardly anything got done the first few days!",
            "title_similarity": "0.41701436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k9wi8",
            "score": 1,
            "text": "Thank you for letting me know that it’s all going to be ok",
            "title_similarity": "0.2892673",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1ka814",
            "score": 1,
            "text": "Yea, this is why you need you start complicated projects over again, or spend years reinventing the wheel. \n\nDo your lit review first, and a feasibility study.",
            "title_similarity": "0.58945084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kaa4y",
            "score": 1,
            "text": "When you strip this advice down to its essentials--\"Don't just stand there, DO something!\"--it's easy to see how bad it is.",
            "title_similarity": "0.6666397",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h1kahzl",
            "score": 1,
            "text": "Think everyone understands this on some level. Difficulty is sticking to advise....",
            "title_similarity": "0.543666",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1kam6b",
            "score": 1,
            "text": "Or do the opposite of this and write detailed pseudo code",
            "title_similarity": "0.60180765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kb0a7",
            "score": 1,
            "text": "Check out this talk be John Cleese:\n\nhttps://youtu.be/Pb5oIIPO62g\n\nIt's about creative thinking, but I like his suggestion of setting aside time for specific thought tasks, e.g. brain storming vs deciding on implementation.",
            "title_similarity": "0.7123674",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1kbalm",
            "score": 1,
            "text": "Don’t let “perfect” get in the way of “good enough”",
            "title_similarity": "0.5403278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kbdzs",
            "score": 1,
            "text": "Thanks for the advice. Currently on the couch, dreading signing up for college classes, but here we go.",
            "title_similarity": "0.5332097",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h1kbkdl",
            "score": 1,
            "text": "Any good books on how to get out of overthinking deadlocks or any such topics?",
            "title_similarity": "0.5855429",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1kbull",
            "score": 1,
            "text": "This makes a lot of sense and I do it sometimes, instinctively. I describe it as “ignoring my brain” lol. Gotta start being proactive and make it be my default mindset!",
            "title_similarity": "0.7022833",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h1kcecr",
            "score": 1,
            "text": "It dependes i think a lot of the time we do work . that ends up being worthless. You need to figure out what could work and start from there. Just an opinion.",
            "title_similarity": "0.7874497",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1kchkw",
            "score": 1,
            "text": "One thing that is always help me with projects is getting started on it immediately even if it's only writing down a few core tasks. It's much easier to pick up something even if you only have a small beginning then to stare at something large and go.. where do I start?",
            "title_similarity": "0.6825137",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1kctlk",
            "score": 1,
            "text": "This life pro tip: Just do it",
            "title_similarity": "0.4487065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kcu8c",
            "score": 1,
            "text": "Thank you, I needed this.",
            "title_similarity": "0.3770454",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1kd57a",
            "score": 1,
            "text": "Hmmm…. Let me think about this real quick",
            "title_similarity": "0.43238243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kdlow",
            "score": 1,
            "text": "Thinking about something is often the hardest part of doing it.",
            "title_similarity": "0.5574263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kdrri",
            "score": 1,
            "text": "Don’t worry about the mule going blind, just load the wagon!",
            "title_similarity": "0.46971464",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h1ke4op",
            "score": 1,
            "text": "Thanks... I needed this.",
            "title_similarity": "0.35332125",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1keaot",
            "score": 1,
            "text": "Good tip. My job involves making a yes or no decision and supplying reason for a no and they want the documents reviewed, verified, and decision made in about a minute. Can't do it well if I'm in my head so I put on a show or movie and just let my eyes find the info and go rather than trying to analyze the fuck out of everything",
            "title_similarity": "0.77564144",
            "sentiment_compound": -0.4242
        },
        {
            "id": "h1keov3",
            "score": 1,
            "text": "This is easier said than done :(",
            "title_similarity": "0.38832906",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h1kf44p",
            "score": 1,
            "text": "This is horrible advice",
            "title_similarity": "0.4105428",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1kfd1x",
            "score": 1,
            "text": "this approach has reduced so much stress for me!  i've always tried to do 'a good job' which meant spending too much time trying to get projects perfect (in my eyes).  \n\nsince i've started telling myself \"it doesn't need to be perfect, it just needs to be DONE\" the amount of things i get done has definitely increased!  \n\ni wonder if sometimes people with ocd have something like this going on that keeps them working and re-working tasks?",
            "title_similarity": "0.70455325",
            "sentiment_compound": 0.9338
        },
        {
            "id": "h1kfmsb",
            "score": 1,
            "text": "Man,  you just totally changed my perspective! Mrs. Steward's triple bypass will be a breeze tomorrow!",
            "title_similarity": "0.45596716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kfzdb",
            "score": 1,
            "text": "Wish o had this advice a few months ago, but guess don’t over think your plans",
            "title_similarity": "0.6316642",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h1kg7of",
            "score": 1,
            "text": "Basic plan: Business Model Canvas\nStart Working: All the permits and patents andbbrand registry and all the system required tasks that come along the way like growing credit and having great relationships with all peers and key vibes.\n\nFigure things out along the way:\n400 years project (quant)\n2 years (11 of this)\n5 years (how to exit and sell of deploy and retreeat.\n10 years (mortages and big contracts consortium)\nTeam building\nTaking short losses and big waves\nTrusting gut nd doing at least 2 things a day. When more do all thatbyou can fucking can.\nIkigai\n\nDont overthink: visualize, manifest, create, put in to action, deploy, execute, retreet, close the day. \nCount your losses. Go to Vacay, REPEAT. Choose joy bb\n\nDough before Does\n🎱",
            "title_similarity": "0.43727058",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h1kgdh1",
            "score": 1,
            "text": "Very bad advice for any kind of construction or building project. Perhaps thi if fine for menial tasks, but lack of a plan in most life things lead to disaster.",
            "title_similarity": "0.68896043",
            "sentiment_compound": -0.8909
        },
        {
            "id": "h1kgdp4",
            "score": 1,
            "text": "I think I need this on a motivational poster.",
            "title_similarity": "0.45054626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kgj11",
            "score": 1,
            "text": "Procrastination = Sloth 💀",
            "title_similarity": "0.45564598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kgnbu",
            "score": 1,
            "text": "I needed to read this right now. Thank you.",
            "title_similarity": "0.528966",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1kgsg9",
            "score": 1,
            "text": "Remember, the perfect is the enemy of the good. It will prevent anything actually happening because it will never be perfect anyway.",
            "title_similarity": "0.60367477",
            "sentiment_compound": 0.0521
        },
        {
            "id": "h1kgw0c",
            "score": 1,
            "text": "Tried to fix toilet. Instructions not clear. Head stuck in toilet.",
            "title_similarity": "0.5139514",
            "sentiment_compound": -0.1139
        },
        {
            "id": "h1kgzw0",
            "score": 1,
            "text": "I've fucked a lot of things up by following this advice.\n\nI would recommend only diving in with tasks where the risk of failure is low. And sometimes you don't know. I've done a lot of tasks that taking my time and researching allowed me to take safety precautions I didn't even know I needed.",
            "title_similarity": "0.76703954",
            "sentiment_compound": -0.743
        },
        {
            "id": "h1kh38r",
            "score": 1,
            "text": "Does anyone have a tip for when you start working like this and do it wrong and suffer from crippling depression. I started trying to plan more to avoid the pain or redo lol.",
            "title_similarity": "0.7620143",
            "sentiment_compound": -0.8952
        },
        {
            "id": "h1kh69e",
            "score": 1,
            "text": "DO NOT DO THIS! SOURCE: I'M A PILOT AND I HAVEN'T LEARNED HOW TO LAND YET. TAKING OFF IS EASY, THO 👌",
            "title_similarity": "0.4657277",
            "sentiment_compound": 0.8767
        },
        {
            "id": "h1khxqn",
            "score": 1,
            "text": "**Yeah, but watch out for the imposter!!**",
            "title_similarity": "0.46478868",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h1ki6mm",
            "score": 1,
            "text": "I do this as a Registered Nurse. Even when things are off the wall nuts, I will slow down and collect myself. It really helps me to prioritize my tasks and deal with any situation.",
            "title_similarity": "0.6995956",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h1ki7ez",
            "score": 1,
            "text": "Cool band name: **analysis paralysis**",
            "title_similarity": "0.38621938",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1kif93",
            "score": 1,
            "text": "true. but so is measure twice, cut once.",
            "title_similarity": "0.28934008",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h1kissg",
            "score": 1,
            "text": "We have more meetings at work about what we need to to than we have time doing the actual thing. It's a real, company-wide problem",
            "title_similarity": "0.44956347",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1kiv6b",
            "score": 1,
            "text": "On the other side of this, not thinking enough about your tasks and jumping In head first can cause tasks to take longer than usual or have unintended consequences",
            "title_similarity": "0.65011716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kj4f6",
            "score": 1,
            "text": "Solid advice. To be quite honest, don’t listen to your thoughts about most things, it’ll stop you from doing anything that you want to accomplish. \n\nI’m terrified of heights, when I think on a stepping stool, I get vertigo. Just now I’m coming back from Denali where it’s a dirt road with really long drop offs that are horrific. Yet I got to see the mountains, bears, moose, caribou a golden eagle. If I had known what was in front of me, my imagination would’ve kept me from seeing something magnificent. \n\nDo what you love, don’t listen to thoughts, ideas or concepts.",
            "title_similarity": "0.61429536",
            "sentiment_compound": 0.1903
        },
        {
            "id": "h1kjawh",
            "score": 1,
            "text": "TIL that I DON'T overthink at my job, I'm just an idiot",
            "title_similarity": "0.72987366",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1kjia5",
            "score": 1,
            "text": "Learn programming. Measure twice, cut once, can save a lot of headaches building software.",
            "title_similarity": "0.6221483",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1kjj7c",
            "score": 1,
            "text": "Ill be able to organize the reason to my happiness and then wonder why I work like that and be sad again.",
            "title_similarity": "0.7182003",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1kk4ls",
            "score": 1,
            "text": "\"Just don't overthink it!\"\n\nSays someone clearly without issues overthinking everything",
            "title_similarity": "0.5806173",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h1klpsu",
            "score": 1,
            "text": "But anxiety goes brrrRRRR",
            "title_similarity": "0.38311666",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h1km4ou",
            "score": 1,
            "text": "Yes! I manage analytics professionals twice my age and I constantly have to put them back on track. They’ll spend hours trying to shave off 20 seconds of run time at 80% complete instead of pushing forward for the last 20%. Seeing bigger picture is really important!",
            "title_similarity": "0.50765467",
            "sentiment_compound": 0.6572
        },
        {
            "id": "h1km9lk",
            "score": 1,
            "text": "Pitter Patter, let's get atter.",
            "title_similarity": "0.3921708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kmjna",
            "score": 1,
            "text": "PSA\n\n\"Plan the work and work the plan.\"\nIf you have trouble identifying the end product and get overwhelmed easily, please check if you arent indeed having ADHD.",
            "title_similarity": "0.73180985",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1kmkce",
            "score": 2,
            "text": "Runescape player:\n\n\"Hmm wonder what skill i should level today?\"\n\n\"How much of X do i need to get to level up to lvl X?\"\n\n\"Is this the most efficient method? Lemme do some calcs on wiki\"\n\nEnds up bankstanding all day",
            "title_similarity": "0.5122352",
            "sentiment_compound": 0.5622
        },
        {
            "id": "h1kmvyc",
            "score": 1,
            "text": "*stares in executive dysfunction*",
            "title_similarity": "0.4178397",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1kn4v0",
            "score": 1,
            "text": "Well let’s hope this guy isn’t a nuclear physicist or something.",
            "title_similarity": "0.41674381",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1kndfm",
            "score": 1,
            "text": "Thanks! I'm cured.",
            "title_similarity": "0.23426244",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1knhmp",
            "score": 1,
            "text": "Thank you for the reminder friend",
            "title_similarity": "0.39157444",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1knqv9",
            "score": 1,
            "text": "This is horrible advice for a surgeon",
            "title_similarity": "0.5451166",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1kocow",
            "score": 1,
            "text": "Its not always a bad idea to plan out your tasks. By the Pareto rule, 20% of the work contributes to 80 % to the results. Now to identify it will defo take time. Whether you believe in it is up to you.\n\nBut, whatever sort of hardwork you do must be focused. It must be directed to a reasonable and preferred goal.",
            "title_similarity": "0.5014691",
            "sentiment_compound": 0.6514
        },
        {
            "id": "h1komy5",
            "score": 1,
            "text": "My mom always says, \"The sooner you start, the sooner you'll finish.\"",
            "title_similarity": "0.4874668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kp1wp",
            "score": 1,
            "text": "Analysis paralysis is called anxiety….",
            "title_similarity": "0.4337547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kp2w0",
            "score": 1,
            "text": "I need this. I always think about how much I have to do, then I just don't do it.",
            "title_similarity": "0.67999196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kqxle",
            "score": 1,
            "text": "I needed this, Thank you.",
            "title_similarity": "0.38751447",
            "sentiment_compound": 0.4357
        },
        {
            "id": "h1kr8f8",
            "score": 1,
            "text": "I run a bulldozer, and this makes my forman want to kill me, not only do I have problems starting something big but ending something big, I feel it never looks good enough",
            "title_similarity": "0.6743437",
            "sentiment_compound": -0.769
        },
        {
            "id": "h1kr9y2",
            "score": 1,
            "text": "This is how I do things, and I’ve always considered it “wrong” and sort of a character flaw. I make lots of mistakes, and often do things very inefficiently. But my brain just can’t sit around and map out a complex solution in my head. Tangential thinking always takes over and I find myself obsessing over a minor detail that I could make a decision on in an instant if I was actually working on it in the moment.",
            "title_similarity": "0.737886",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1krcuw",
            "score": 1,
            "text": "I know this is intended with kindness, but this gives me the same vibes as “Just dont be depressed!”",
            "title_similarity": "0.51806736",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h1krhiq",
            "score": 1,
            "text": "Great tip! Got a little one too, if you have a big project use websites like [Trello](http://www.trello.com) to make a plan and keep yourself organized!",
            "title_similarity": "0.55646485",
            "sentiment_compound": 0.8011
        },
        {
            "id": "h1krlma",
            "score": 1,
            "text": "Is this a /r/thanksimcured post?",
            "title_similarity": "0.29635656",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1krr1p",
            "score": 1,
            "text": "I really needed to hear this. For like, 15 years.",
            "title_similarity": "0.23457043",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1krv4d",
            "score": 1,
            "text": "Oh my goodness? That’s what it’s called? That’s why I can’t do things?",
            "title_similarity": "0.54519755",
            "sentiment_compound": 0.5484
        },
        {
            "id": "h1kshna",
            "score": 1,
            "text": "This! Gave my first ever reddit award to this post.",
            "title_similarity": "0.2006914",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h1kslw5",
            "score": 1,
            "text": "I recently learned that exercise reduces your activity of your pre frontal cortex (which is the thinking part of the brain). not in a bad way but you just stop overthinking the unnecessary stuff. maybe thats why i feel so floaty on the days i exhaust myself with the long morning runs",
            "title_similarity": "0.7369851",
            "sentiment_compound": -0.5683
        },
        {
            "id": "h1kssky",
            "score": 1,
            "text": "Look for Two-Way Door decision.",
            "title_similarity": "0.34619823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ktwef",
            "score": 1,
            "text": "This is the approach I take to projects, big and small, things I know and things I don’t.",
            "title_similarity": "0.56498206",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ktyd0",
            "score": 1,
            "text": "I had analysis paralysis just right now. I was reading the topic title when it happened, sigh.",
            "title_similarity": "0.6146281",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1ku1q3",
            "score": 1,
            "text": "Unless you work at SpaceX or NASA",
            "title_similarity": "0.23825505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kuevo",
            "score": 1,
            "text": "Writing out your tasks can help. I dunno if it's because once it's on paper I can kind of just put that information aside and still be able to quick reference it while freeing up braindwidth. Feels less overwhelming looking at only a few locations, products etc, instead of trying to figure everything out all at once.",
            "title_similarity": "0.7537093",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1kuht2",
            "score": 1,
            "text": "GET OUT OF MY HEAD",
            "title_similarity": "0.36239174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kv264",
            "score": 1,
            "text": "Being in engineering I run into this a lot. Best thing to do is just start laying lines down. You can always adjust them later but you gotta start somewhere.",
            "title_similarity": "0.7510601",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1kv2zg",
            "score": 2,
            "text": "Why do basic ass LPT get so many upvotes? I can think of a 1000 professions and scenarios where you don't overthink or overplan and you've wasted money, manhours, and resources. Ask a Plumber, Doctor, Carpenter, Pilot, Soldier, HVAC Tech what \"just start working it, you'll figure it out\" gets you.",
            "title_similarity": "0.484015",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h1kv3om",
            "score": 1,
            "text": "I feel so targeted lol",
            "title_similarity": "0.28728375",
            "sentiment_compound": 0.4728
        },
        {
            "id": "h1kv72h",
            "score": 1,
            "text": "Ever tried to find a name for a project? Help!",
            "title_similarity": "0.3742124",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h1kvla3",
            "score": 1,
            "text": "As an adult with ADHD, I emphatically second this LPT. Certainly easier said than done in many cases, but I’ve begun to realize that many things that feel harder only seem that way because I’m…you guessed it…OVERTHINKING them.",
            "title_similarity": "0.6202616",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1kvs6j",
            "score": 1,
            "text": "Unless you’re a surgeon. Then you should have a plan.",
            "title_similarity": "0.60919976",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kw1om",
            "score": 2,
            "text": "Next LPT coming to this sub: If you’re depressed just don’t be depressed silly!",
            "title_similarity": "0.6648438",
            "sentiment_compound": -0.7777
        },
        {
            "id": "h1kwa4p",
            "score": 1,
            "text": "This oddly helped me out on a work project I've been putting off for too long. Appreciate the comment, time to kick it in gear",
            "title_similarity": "0.6632786",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1kwld7",
            "score": 1,
            "text": "This is totally something I struggle with. Great tip.",
            "title_similarity": "0.45010644",
            "sentiment_compound": 0.3687
        },
        {
            "id": "h1kx8oh",
            "score": 1,
            "text": "This is true. Just start. Start work so you can feel instead of waiting to feel so you can work. Even start messy, but start.",
            "title_similarity": "0.73357373",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h1kxbao",
            "score": 1,
            "text": "Much easier said than done when you're on the autism spectrum, with comorbid OCD to boot...",
            "title_similarity": "0.42525113",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1kxk9a",
            "score": 1,
            "text": "I've never heard of analysis paralysis but I know exactly what it is, now that I know there's a term for it I'll probably be able to fight it by recognizing it",
            "title_similarity": "0.6050513",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1kxo63",
            "score": 1,
            "text": "I’m fortunate that my brain is just wired to jump right in with both feet.  \n\nIt has served me well.",
            "title_similarity": "0.34366435",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1kxsi0",
            "score": 1,
            "text": "The only way I go further is to over think it and over do it. This is wrong.",
            "title_similarity": "0.6518485",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1kxthh",
            "score": 1,
            "text": "I am a bit over 40 and this also recently became my number one productivity insight.\n\nI was always over analyzing everything. Every detail.  I think in part because I feared I would be unmasked as an impostor.",
            "title_similarity": "0.5448698",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1kxwci",
            "score": 1,
            "text": "Doesn’t work for shit in ANY real situation",
            "title_similarity": "0.36792964",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1kygq0",
            "score": 1,
            "text": "Yes.\nIt's a pro tip for programmers out there. 🙏",
            "title_similarity": "0.43148917",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1kyktw",
            "score": 1,
            "text": "Exactly what I needed to see today!  Thank you!",
            "title_similarity": "0.39447516",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h1kyzkx",
            "score": 1,
            "text": "Whoa I needed to see this today.",
            "title_similarity": "0.3840657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kz6qy",
            "score": 1,
            "text": "Algorand is the future. Stop overthinking and buy Algorand today.",
            "title_similarity": "0.4763869",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1kzdpv",
            "score": 1,
            "text": "As a programmer. I really needed this. Thanks",
            "title_similarity": "0.52087164",
            "sentiment_compound": 0.5725
        },
        {
            "id": "h1kzm1d",
            "score": 1,
            "text": "Thanks for the tip. I always overthink at work and stress myself out!",
            "title_similarity": "0.6753672",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h1kzwdz",
            "score": 1,
            "text": "Can we call it paranalysis?",
            "title_similarity": "0.39421856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kzzhk",
            "score": 1,
            "text": "How long is the sprint?",
            "title_similarity": "0.20650049",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1l0ce8",
            "score": 1,
            "text": "Laughs in executive dysfunction",
            "title_similarity": "0.35935307",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1l0gp3",
            "score": 1,
            "text": "Yeah this works, I started trading in stocks actively a few months ago and when I started I had 20+ indicators and I got overwhelmed with everything that I was looking at. Then I found someone who's been doing this for 19-20 years and he gave me the advice to get rid of all indicators and just keep it simple. I have been much more relaxed after that. A bit profitable aswell lol",
            "title_similarity": "0.44681334",
            "sentiment_compound": 0.9168
        },
        {
            "id": "h1l17c1",
            "score": 1,
            "text": "This is why I kind of love being a trucker. Outside of the idiocy of the people around me, I only have to worry about one thing: Not being one of those idiots.\n\nGranted, it can be mentally draining and my waistline is 6 inches bigger compared to when I started but .... That's part of life i guess.",
            "title_similarity": "0.5958898",
            "sentiment_compound": 0.2508
        },
        {
            "id": "h1l1kng",
            "score": 1,
            "text": "My ADHD would like to have a word with you.",
            "title_similarity": "0.46602312",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1l22fu",
            "score": 1,
            "text": "This goes for social plans as well, such as texting, dating, or just hanging out. Try to distract yourself with something physical and you'll feel yourself stop caring so much about it.\n\nI have a lot of issues with this. I tend to overthink and gain anxiety thinking about the outcome if it doesn't work or if they don't like me or whatever. When I'm overthinking about texting a date I'll try to escape my environment to let my brain calm down, take a walk or a short drive, then text afterwards. The change in scenery distracts me and helps me calm down, and it'll help lower anxiety waiting for their response.",
            "title_similarity": "0.73778105",
            "sentiment_compound": 0.7839
        },
        {
            "id": "h1l26vl",
            "score": 1,
            "text": "This is totally true.   I have to encourage guys at work to get this in their head all the time.  (Construction work).   Just start doing what you know needs to be done and the rest will fall into place.",
            "title_similarity": "0.5952883",
            "sentiment_compound": 0.7501
        },
        {
            "id": "h1l273r",
            "score": 1,
            "text": "Recently, I have just realized that the time when I actually need to accomplish my tasks is much more smaller when I stop overthinking and worrying about the problems attached to that tasks.",
            "title_similarity": "0.7579321",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1l2nfi",
            "score": 1,
            "text": "This is VERY good advice. I often find myself overwhelmed by all the stuff I need to do. A good way forward is just to pick some task at random and start doing it. At the end of the day a lot of stuff will have been done.",
            "title_similarity": "0.673092",
            "sentiment_compound": 0.7921
        },
        {
            "id": "h1l2qyf",
            "score": 1,
            "text": "this but with college applications",
            "title_similarity": "0.23184165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1l31sv",
            "score": 1,
            "text": "I had a wise friend ask me once...  How do you eat the elephant?  One bite at a time.",
            "title_similarity": "0.3648425",
            "sentiment_compound": 0.743
        },
        {
            "id": "h1l336t",
            "score": 1,
            "text": "Thanks OP. Much needed at this stage of my work life.",
            "title_similarity": "0.51281506",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1l3f7e",
            "score": 1,
            "text": "I really took this to heart today. Got ramped up, started packing my house for a move. Went into my garage, started organizing some items and then.... noticed a WESTERN DIAMONDBACK CURLED UP TWO INCHES AWAY FROM ME at the corner of my garage.\n\nBack to overthinking and avoiding my tasks please",
            "title_similarity": "0.5180551",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1l3gok",
            "score": 1,
            "text": "I’m not sure I always agree with this LPT. If your are in deep work mode then you can get by with “Complete Q4 sales report” but if your energy is low then you may need more explicit tasks under that top task to make it through. Something like “Open sales report Word template from OneDrive for Business share”.",
            "title_similarity": "0.6496358",
            "sentiment_compound": 0.6926
        },
        {
            "id": "h1l3p2e",
            "score": 1,
            "text": "Hey, a poor plan is better than not having one",
            "title_similarity": "0.5373126",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1l49yt",
            "score": 1,
            "text": "For most jobs that aren’t related to saving lives or improving safety, this saying I was told many years ago means a lot to me. My old boss once said, “go 90mph and be 90% correct”. Speed matters, don’t waste time over thinking things that can be undone.",
            "title_similarity": "0.5178173",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1l4lil",
            "score": 1,
            "text": "LPT: don’t have ADHD lmao aaayyy",
            "title_similarity": "0.34411547",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1l63tf",
            "score": 1,
            "text": "Unless you doing C++",
            "title_similarity": "0.37350237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1l6ea2",
            "score": 1,
            "text": "Some overthink because of trauma. Way to be dismissive of that, sanctimonious a-holes.",
            "title_similarity": "0.60703695",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1l7db3",
            "score": 1,
            "text": "This is the definition of easier said than done. \n\n\nStill,  good advice",
            "title_similarity": "0.49235213",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1l8hda",
            "score": 1,
            "text": "That’s what I did with dinner tonight. It was one of the worst meals I’ve ever made.",
            "title_similarity": "0.47816595",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1laa35",
            "score": 1,
            "text": "Well, it's nice to know that there's at least a name for that thing that I do all the time...",
            "title_similarity": "0.28687546",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1lbvg2",
            "score": 1,
            "text": "As a programmer: Don’t do this.\n\nOr if you do, be prepared to start over, and over again",
            "title_similarity": "0.70664144",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1lc226",
            "score": 1,
            "text": "I've been working for more than 10 years now and I still forget this from time to time. \n\nI needed to hear this. Thanks OP!",
            "title_similarity": "0.39189005",
            "sentiment_compound": 0.4151
        },
        {
            "id": "h1lclxx",
            "score": 1,
            "text": "Analysis Paralysis. New band name.",
            "title_similarity": "0.4078169",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ldlm1",
            "score": 1,
            "text": "I reckon people need this advice alongside the \"counter\" advice too.  Depending on what sort of person you are and what the task is you need use the right one for the situation.\n\nThink through what your going to do before you start.  Time and money is often wasted by rushing in and \"getting started\".  Fuck ups often happen because someone didn't stop for a minute and just think about what they were doing.  \n\nGet the right tool.  Measure twice.  Use the right materials.  Check the drawings.  Line up everything your going to need.",
            "title_similarity": "0.79773307",
            "sentiment_compound": -0.7015
        },
        {
            "id": "h1ldq38",
            "score": 1,
            "text": "Honestly needed to hear this rn, thanks",
            "title_similarity": "0.44853514",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1lduqd",
            "score": 1,
            "text": "Only dumb people have this problem.",
            "title_similarity": "0.45230705",
            "sentiment_compound": -0.7525
        },
        {
            "id": "h1leh7f",
            "score": 1,
            "text": "It also helps to have the end goal clear in your mind. If I can visualize what it’s supposed to be in the end, I can then visualize the steps to get there. If I don’t know the end goal, it makes me much too anxiety ridden to even start.\n\nAnother good tip is to start with small manageable tasks early in the day to get your confidence to do tasks up. I respond to emails and make small schedule changes etc. Then I work on running reports. Then I work on the big projects when I see that I have successfully managed the previous tasks.",
            "title_similarity": "0.7811246",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h1lfh42",
            "score": 1,
            "text": "What if I'm playing chess?",
            "title_similarity": "0.28036332",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1lfs21",
            "score": 1,
            "text": "most of the time, when we feel that we are just perfectionists, we are just afraid of making mistakes. and that's a huuuuge difference.",
            "title_similarity": "0.7522242",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1lfwdc",
            "score": 1,
            "text": "I'm currently over analyzing this comment.",
            "title_similarity": "0.54605836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1lg0k9",
            "score": 1,
            "text": "This is good advice but a little planning can drastically improve quality and decrease time taken as well.\n\nBut it's very important not to get stuck in analysis paralysis",
            "title_similarity": "0.748443",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h1lg2s5",
            "score": 1,
            "text": "People with ADHD would like to have a word with you...\n\n*squints begrudgingly*",
            "title_similarity": "0.54714644",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1lg3go",
            "score": 1,
            "text": "Thank you, I needed this.",
            "title_similarity": "0.3770454",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1liydg",
            "score": 1,
            "text": "“You should think exactly the right amount” Thanks.",
            "title_similarity": "0.38128644",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1ljp62",
            "score": 1,
            "text": "It like a going for digging well to extinguish fire.",
            "title_similarity": "0.4771812",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1lkv4r",
            "score": 1,
            "text": "Terrible advice! It's like saying \"Just smile more\" to a depressed person",
            "title_similarity": "0.61789393",
            "sentiment_compound": -0.4508
        },
        {
            "id": "h1lkzb9",
            "score": 1,
            "text": "Great way to produce shitty results that get people killed. Unless you aren’t an engineer or scientist, in which case, yeah, probably faster.",
            "title_similarity": "0.62672067",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1ll8wq",
            "score": 1,
            "text": "I so this a lot and I always end up doing nothing",
            "title_similarity": "0.45407575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1llbzi",
            "score": 1,
            "text": "\"But boss how are we supposed to know where we need to install that support beam?\"\n\n\"Just put it where you think it will be good you'll figure it out!\"\n\nDo you see how this can be problematic?\n\nI see that it's good advice in some situation but you shouldn't try to do everything like that",
            "title_similarity": "0.7182658",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h1llqqu",
            "score": 1,
            "text": "OKAY JIM?\n\nThey're talking to you, Jim.",
            "title_similarity": "0.3743242",
            "sentiment_compound": 0.3885
        },
        {
            "id": "h1lnd26",
            "score": 1,
            "text": "To people who are criticizing this tip, or saying that engineers or the like can't just do it. It can be as simple as putting pen to paper and starting sketching while STILL thinking. No one said you shut off your brain, but unless you put a base down you won't get anything done because your thought process is stuck in a loop. You won't see which solution is better or why your solution might not work or where it needs tweeking. Set a goal, put pen to paper.",
            "title_similarity": "0.8142238",
            "sentiment_compound": 0.3087
        },
        {
            "id": "h1lnmab",
            "score": 1,
            "text": "Screen shotted this so I won’t forget. I over think for days before I’ll start a task.",
            "title_similarity": "0.5629854",
            "sentiment_compound": -0.2878
        },
        {
            "id": "h1lnnk7",
            "score": 1,
            "text": "Well I feel called out, I've literally been sitting up all night trying to plan out what I'm going to do to do up several rooms and both gardens. So far I've yet to get further than writing half a to do list",
            "title_similarity": "0.49867466",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1lnzl9",
            "score": 1,
            "text": "This is my entire life.",
            "title_similarity": "0.116824076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1lo4i8",
            "score": 1,
            "text": "The biggest thing ever is to break it down. The smaller you can define a rash the better. I could  ever get my kids to clean their room and the. I realized it was just too much. So I said bring me your dirty clothes, pick up all the small toys, put the dirty clothes in the basket. I even wrote those tasks down and made a game\nOut of it. I would write down a simple tasks on  paper, cut them out and  put them Into a jar. My kids loved it. I would also add fun/silly tasks too. After we completed the chore list there would be predetermine  reward. Anyway it worked for out family. My youngest is 31 and my oldest is 45. They still appreciate the approach.",
            "title_similarity": "0.6495743",
            "sentiment_compound": 0.743
        },
        {
            "id": "h1lr6l8",
            "score": 1,
            "text": "If you have a bunch of different tasks and projects and suffer with this, I highly recommend Skedpal. It imports your calendar, schedules your tasks around it, and then dumps your scheduled tasks right back in your calendar. It will also tell you if your deadlines are untenable. This is not a paid advertisement, I'm just a happy customer whose analysis paralysis has improved greatly.",
            "title_similarity": "0.74402404",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h1lyhf6",
            "score": 1,
            "text": "[Leeroy Jenkins](https://www.youtube.com/watch?v=mLyOj_QD4a4)",
            "title_similarity": "0.22421242",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1m1jya",
            "score": 1,
            "text": "Honestly, one of the best LPT I’ve ever seen!   \n\nI catch myself overthinking way more than I’d like to admit.\n\nThanks, OP!",
            "title_similarity": "0.50623643",
            "sentiment_compound": 0.9354
        },
        {
            "id": "h1m3wop",
            "score": 1,
            "text": "One of my best friends gave the GREATEST advice when tackling a \\*humongous\\* task:\n\n\"Don't look at the mountain, look at the shovel.\"\n\nBOOOOOM. I got it. Don't focus on the insurmountable, just get done what needs to get done NOW. Work on the rest later!",
            "title_similarity": "0.7345636",
            "sentiment_compound": 0.9263
        },
        {
            "id": "h1m55ey",
            "score": 1,
            "text": "As a surgeon, I endorse this strategy.",
            "title_similarity": "0.46115232",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1m67j7",
            "score": 1,
            "text": "Don't do this while programming",
            "title_similarity": "0.39865217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1mi3be",
            "score": 1,
            "text": "This is my MO at work.",
            "title_similarity": "0.4210301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1mkdrr",
            "score": 1,
            "text": "The perfect plan executed too late is worse than an imperfect plan executed on time. Spending hours figuring out exactly what to do and how to do it is just not worth your time",
            "title_similarity": "0.7061309",
            "sentiment_compound": -0.3326
        },
        {
            "id": "h1mlknb",
            "score": 1,
            "text": "I’d add to this - stop, take a deep breath and imagine a time when you felt really good when you did something imperfectly, but it was done and you didn’t have to worry about anymore. Think of that sense of relief and accomplishment. Then do the thing.",
            "title_similarity": "0.6225963",
            "sentiment_compound": 0.2014
        },
        {
            "id": "h1mrfb7",
            "score": 1,
            "text": "Kiss = keep it simple stupid 😁👍",
            "title_similarity": "0.44452888",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1msefn",
            "score": 1,
            "text": "This is great advice.  I learned a long time ago not to overthink things.  It's made me very effective in various disciplines.",
            "title_similarity": "0.5922638",
            "sentiment_compound": 0.8173
        },
        {
            "id": "h1npbay",
            "score": 1,
            "text": "Somtimes when I get like that at work just spending five seconds to tell myself 'Do the 1st thing first and then do the second thing 2nd' is enough to snap me out that panic",
            "title_similarity": "0.5353821",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1o0kcp",
            "score": 1,
            "text": "Nail on the head.",
            "title_similarity": "0.25493103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1pfucd",
            "score": 1,
            "text": "A bad plan is better than no plan",
            "title_similarity": "0.53940547",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1pvrrl",
            "score": 1,
            "text": "Unless you have adhd, then this advice is like telling a person with depression something like, “just get some exercise and it’ll go away.”",
            "title_similarity": "0.69472003",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1qwbks",
            "score": 1,
            "text": "you brain-dead idiot it is not that easy",
            "title_similarity": "0.4374932",
            "sentiment_compound": -0.6914
        },
        {
            "id": "h1uq3fe",
            "score": 1,
            "text": "this isn’t only with tasks for me!",
            "title_similarity": "0.3008585",
            "sentiment_compound": 0.0
        },
        {
            "id": "h25rgon",
            "score": 1,
            "text": "Does this still apply if you have ADHD?",
            "title_similarity": "0.3019203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3b6ucc",
            "score": 1,
            "text": "When you are a programmer this is a r/ShittyLifeProTips",
            "title_similarity": "0.54422003",
            "sentiment_compound": 0.0
        }
    ]
}