{
    "LPT: When a cat shows you its belly, pet around the cheeks and not the belly itself. Cats show their belly as a sign of trust, so going for their belly is seen as an immediate violation of that trust and may result in biting or scratching.\nIf your cat has shown in the past that it likes belly rubs, that's an exception of course, but the average kitty just wants you to know that you are trusted by exposing its most vulnerable area to you.": [
        {
            "id": "h1mne3z",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.53891045",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h1nfqub",
            "score": 0,
            "text": "how does this count as 'LifeProTip'...? This is literally a redditor trying to force everyone his opinion about cat behavior, as if its a fact.",
            "title_similarity": "0.7161804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1n1qpn",
            "score": 15,
            "text": "LPT get a dog and rub it's belly. They love it because they're not emotional demons",
            "title_similarity": "0.5180483",
            "sentiment_compound": 0.5798
        },
        {
            "id": "h1njl6q",
            "score": 3,
            "text": "Fuckin' psycho cats.\n\n\"AAaaww you're so great.  I trust you so much ... look,  see?  Here's my tummy  NO DONT FUCKING TOUCH IT I DON'T TRUST YOU!!!!\"",
            "title_similarity": "0.7851104",
            "sentiment_compound": 0.6999
        },
        {
            "id": "h1mp4qx",
            "score": -8,
            "text": "a sign of trust? lol cmon man damnn",
            "title_similarity": "0.31149116",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1n6y34",
            "score": 0,
            "text": "I mean every cat I’ve ever petted has let me touch its stomach just fine",
            "title_similarity": "0.57909083",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1n55gk",
            "score": 2,
            "text": "Every cat I’ve had (far too many) has liked belly rubs if they show their belly. Not all do show their belly but the ones who did loved to be rubbed.",
            "title_similarity": "0.7131026",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h1nc355",
            "score": -1,
            "text": "Can confirm\nSource- am cat",
            "title_similarity": "0.46529466",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ngx1c",
            "score": 1,
            "text": "Showing the belly means belly rubs will be given. The risk is worth the reward. You just gotta be faster than the cat.",
            "title_similarity": "0.68435645",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1o2rkd",
            "score": -3,
            "text": "Solution: don't get a cat, that's pointless",
            "title_similarity": "0.42854887",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1nbv71",
            "score": 4,
            "text": "My inner12-year-old says, \"You want me to scratch my cat's butt cheeks?!?\"",
            "title_similarity": "0.671957",
            "sentiment_compound": 0.2387
        },
        {
            "id": "h1mpe32",
            "score": 19,
            "text": "I’ll call your LPT and raise one further: don’t trust cats.",
            "title_similarity": "0.7467797",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1naj20",
            "score": 1,
            "text": "My cat like belly rubs.  It depends on the cat, like most other thingsnwoth cats.",
            "title_similarity": "0.8319631",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1ncmqj",
            "score": -1,
            "text": "My cat hated belly rubs but I kept giving them to her for over a year. Now she loves belly rubs",
            "title_similarity": "0.66953695",
            "sentiment_compound": 0.7615
        },
        {
            "id": "h1o54o9",
            "score": -2,
            "text": "Idgaf, I go straight for the belly anyway - it's their fault for putting themselves in such a vulnerable position. Next time try not to be so trusting.",
            "title_similarity": "0.5958321",
            "sentiment_compound": 0.2002
        },
        {
            "id": "h1moa1s",
            "score": 7,
            "text": "In 30+ years of being owned by cats,  only oone didnt absolutely love having her belly rubbed,  and she didn't much like being touched at all in the first place.  Both of my current cats get offended if I skip their vigorous belly rubs and scritches...",
            "title_similarity": "0.742921",
            "sentiment_compound": -0.7714
        },
        {
            "id": "h1ne7il",
            "score": 6,
            "text": "This is so helpful! There should be a LPT animal subreddit.",
            "title_similarity": "0.34920135",
            "sentiment_compound": 0.6005
        },
        {
            "id": "h1nkk61",
            "score": 4,
            "text": "Women are the same way, as it turns out.",
            "title_similarity": "0.16704804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o6ljh",
            "score": 0,
            "text": "This is why I like dogs. He shows me his belly, he wants his belly rubbed. It’s not a code you need to decipher.",
            "title_similarity": "0.6004941",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1o7ue6",
            "score": 0,
            "text": "Mine love scratch near genital?",
            "title_similarity": "0.39951867",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1onj9k",
            "score": 0,
            "text": "Cat facts, in 2021? What are you, 8 to 10 years old? \n\nIf you defend this repost because your an NPC who didn't see this yet, do you even HAVE a cat? You will learn this the first day. \n\nThis post and the OP especially are like syphilis for your brain. It might as well be a dick pick that they posted for how inconsequentially related to \"original content\" it is.",
            "title_similarity": "0.71707976",
            "sentiment_compound": 0.5296
        },
        {
            "id": "h1qdwiw",
            "score": 0,
            "text": "This is why I hate cats! Pups for the win!",
            "title_similarity": "0.6786623",
            "sentiment_compound": 0.1739
        },
        {
            "id": "h1oejox",
            "score": -5,
            "text": "Or have a kitten from birth and train them that when you cradle them and pet their stomach, they’re safe. The key is allowing them to jump away or leave without struggle, so the next time you do it it’s “safe”. I also trained my cat to come to me with hand signals and tongue clicks. It’s all about trust and repetition.",
            "title_similarity": "0.82243896",
            "sentiment_compound": 0.8796
        },
        {
            "id": "h1neqo9",
            "score": 1,
            "text": "Thank you OP. We have a foster and I always assumed it meant she wanted belly strokes. She never reacted great, so going to do this now.",
            "title_similarity": "0.59238195",
            "sentiment_compound": -0.2008
        },
        {
            "id": "h1nerjx",
            "score": -1,
            "text": "Dogs unanimously agree that belly rubs are awesome. Source: you know it’s true, stop lying.",
            "title_similarity": "0.49110973",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1o6yxf",
            "score": 1,
            "text": "Just another example of Cats being dick heads.",
            "title_similarity": "0.7087126",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1ona1f",
            "score": -1,
            "text": "Wow. To think anyone cares. Wow",
            "title_similarity": "0.11720893",
            "sentiment_compound": 0.891
        },
        {
            "id": "h1oruay",
            "score": -1,
            "text": "Or kill the cat and buy a dog",
            "title_similarity": "0.535509",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h1ponjj",
            "score": -1,
            "text": "This is why dogs are better.",
            "title_similarity": "0.3140952",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1n6dqp",
            "score": 23,
            "text": "Fuck that, I worked for that belly, so I'm gonna rub the belly\n\nP.S. My kitty loves belly rubs.",
            "title_similarity": "0.66070485",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1nhcq3",
            "score": -2,
            "text": "We want the bite and scratch it’s fun.",
            "title_similarity": "0.426894",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1njtc3",
            "score": 2,
            "text": "Yes I have battle scars, but I touched the fluff",
            "title_similarity": "0.45154333",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h1nmpp4",
            "score": 2,
            "text": "This subreddit has really gone downhill with the tips",
            "title_similarity": "0.2877993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o0h2x",
            "score": -2,
            "text": "1.\t Depends on the cat.   My cat loves having her belly scratched.  \n2.\t  Not all cats are the same.  Just like not all dogs or humans are the same.  \n3.\tQuit generalizing a complete species.",
            "title_similarity": "0.83660835",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1nes6k",
            "score": 3,
            "text": "Did a cat tell you this?",
            "title_similarity": "0.57564306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ndjme",
            "score": 4,
            "text": "Face cheeks or butt cheeks?",
            "title_similarity": "0.23022345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ndwr5",
            "score": 6,
            "text": "To be fair , petting them exactly where they want still results in biting and scratching.",
            "title_similarity": "0.55118674",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1ne6sx",
            "score": 8,
            "text": "My kitties will rip off a finger if you try to pet the belly. You may observe and appreciate the fluffiness only from afar.",
            "title_similarity": "0.6303041",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1moo9v",
            "score": 121,
            "text": "When my cats roll over and show their bellies they absolutely want their bellies tickled. No ifs, no buts, tickle the belly.",
            "title_similarity": "0.76998645",
            "sentiment_compound": 0.0724
        },
        {
            "id": "h1n8j3h",
            "score": 30,
            "text": "One of my cats loves showing her belly, but when I try to pet her there she catches my hand with her back paws and pushes it to her head to let me know what she wants. I love her so much for that cleverness 😍 never in an angry way, always like 'please hooman, give me the ear rubs and just adore my belly with your eyes, thank you!'",
            "title_similarity": "0.8279283",
            "sentiment_compound": 0.9913
        },
        {
            "id": "h1ncppu",
            "score": 12,
            "text": "Cat is your master. Always. Do as the cat says.",
            "title_similarity": "0.66720796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ncvs0",
            "score": 15,
            "text": "My old tabby used to love chest rubs when she rolled over, but hated belly rubs. Had to be careful or suddenly the trap would close around your hand lol",
            "title_similarity": "0.73613024",
            "sentiment_compound": 0.4118
        },
        {
            "id": "h1nf1m6",
            "score": 22,
            "text": "I’ve owned many cats and I’ve noticed a stark difference in this between male and female kitties. The girls are far more tolerant of belly scratches and rubs. The boys however are more prone to bite and scratch. I’m sure it depends on the cat but the boys I’ve had who bite and scratch just want to play fight. I’ve never heard one hiss or spit because of a belly rub. These just something about a belly rub that puts them into a spunky mood.",
            "title_similarity": "0.7977535",
            "sentiment_compound": 0.3604
        },
        {
            "id": "h1mrqhp",
            "score": 589,
            "text": "Or it’s because they want to play, that’s why they might grab at you or “bite” you but not roll over or run away.",
            "title_similarity": "0.5462698",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h1mp8au",
            "score": 406,
            "text": "Part of \"the key\" is don't go in for a belly rub like you'd do for a dog, all vigorous. Keep it nice and calm, gentle stroking and they're more likely to be chill themselves.",
            "title_similarity": "0.68854535",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h1o2toh",
            "score": 28,
            "text": "#1 rule: a cat is not a dog. People tend to forget that.",
            "title_similarity": "0.56300974",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1naptk",
            "score": 249,
            "text": "I was grooming my cat the other day and he done the usual wriggling around the floor while I brushed him and then suddenly he flipped onto his back to display his belly. In my infinite wisdom I thought “he must want me to brush his belly!”  Oh boy, was I wrong. I proceeded to get one of the nastiest bites I have ever received off of him. Lesson learned. Some treats and chin scritches later and he has forgiven me.",
            "title_similarity": "0.776273",
            "sentiment_compound": -0.126
        },
        {
            "id": "h1nbfvs",
            "score": 1440,
            "text": "Now when you say cheeks..?",
            "title_similarity": "0.14710116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1mtq4y",
            "score": 1827,
            "text": "But what if I like to jiggle their cat fat?",
            "title_similarity": "0.75364316",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h1msho9",
            "score": 3697,
            "text": "Every cat is different, mine love vigorous belly rubs.",
            "title_similarity": "0.6537821",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1nc74i",
            "score": 777,
            "text": "\"Look at ma belly.\"\n\n(Touches belly)\n\n\"LOOK WITH YOUR EYES!!\"",
            "title_similarity": "0.39092267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1n29ej",
            "score": 7600,
            "text": "Makes sense to me, I had a cat who would roll over and show me his soft and inviting furry belly, I assumed to rub, and then as soon as I did. Beartrap! All the claws and teeth and then he would run away. Always left me thinking 'Whatever goofball\"",
            "title_similarity": "0.7408515",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h1n0pqx",
            "score": 1242,
            "text": "My cat loves belly scratches and strokes, the other two would kill me if I tried.",
            "title_similarity": "0.79512775",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1n37k4",
            "score": 35,
            "text": "I have one cat that loves belly rubs and the other just wants to be pet on the face so if it's your cat then you'll just learn what it likes. If it's a friend's cat I usually just pet around the face.",
            "title_similarity": "0.86307365",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h1nc6kn",
            "score": 8,
            "text": "All cats are a bit different, but many of them really like face and ear pets, so that’s a good place to start with a cat you don’t know well. Just go slow and let them sniff your hand first.\n\nI’ve had my rescue cat for nearly two years now and he’s only just now starting to let me rub his belly, though he looooves being pet basically anywhere else.",
            "title_similarity": "0.8167409",
            "sentiment_compound": 0.9654
        },
        {
            "id": "h1ncoab",
            "score": 2,
            "text": "My cat loves belly rubs from me but often will try to rub his cheeks on my had sometimes while I'm rubbing him. But sometimes hell show his belly to my dad and when he goes for the belly he sometimes will scratch him.",
            "title_similarity": "0.7774811",
            "sentiment_compound": -0.7227
        },
        {
            "id": "h1necc6",
            "score": 1,
            "text": "When mine shows her belly, she wants the full belly rub treatment but only for a bit. Loves it though.",
            "title_similarity": "0.6238211",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h1nei54",
            "score": 2,
            "text": "Yes yes yes. I have 2 cats and they like the cheeks pet first.",
            "title_similarity": "0.76273596",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h1ney1k",
            "score": 1,
            "text": "My cat loved belly rubs so much that she would often reach out and gently pull my hand back to her belly if I started to move it away. But she would also sometimes roll over like she wanted a belly rub and then grab my hand and bite it as soon as I brought it close enough. After a while I got pretty good at reading her body language and figuring out when she wanted a belly rub for real and when she was going to bite me. I’ve since met other cats that do the exact same thing. I genuinely think that for a lot of cats biting is a fun game, and they are trying to lure you into bringing your hand close enough for them to grab it and bite it. If they felt violated and were biting defensively then you’d expect them to stop showing their belly as soon as you touched it, but if you snatch your hand back just before they bite/grab it, they often stay on their back waiting for you to touch their belly again, and sometimes even expose their belly more as if to encourage you to touch them.",
            "title_similarity": "0.8289672",
            "sentiment_compound": 0.9843
        },
        {
            "id": "h1ney9b",
            "score": 1,
            "text": "Just to be clear, the butt cheeks right?",
            "title_similarity": "0.2792623",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1nf2t7",
            "score": 2,
            "text": "I knew this one cat that would roll on its back and show its belly, and if you pet its belly, it would without fail :\n\nFlop to one side\n\nFlop to the other side\n\nFlop to the first side and instantly STRIKE!",
            "title_similarity": "0.74106026",
            "sentiment_compound": -0.3483
        },
        {
            "id": "h1nf4y8",
            "score": 1,
            "text": "Mine likes it. It’s scratching around the cheeks that gets me the biting and kangaroo kicks on my arm.",
            "title_similarity": "0.5843618",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1nfd0p",
            "score": 1,
            "text": "For my ragdoll rolling around on his back is a sign he wants to play rough and usually Savage my hand for a few minutes before giving me headbuts",
            "title_similarity": "0.5224762",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1nfh9b",
            "score": 1,
            "text": "I usually poke at their belly because it gets them in the mood to play.",
            "title_similarity": "0.47710758",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1nfp5d",
            "score": 1,
            "text": "Mine shows the belly then tries to attack the hand of you try to scritch the ears or rub the cheeks. He just wants to attack. He's cute but don't trust the belly!",
            "title_similarity": "0.64477265",
            "sentiment_compound": -0.592
        },
        {
            "id": "h1nfqlt",
            "score": 1,
            "text": "My cat won’t scratch or bite me it’s weird and kind belly petting",
            "title_similarity": "0.7401961",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1nfv5w",
            "score": 2,
            "text": "Thank you - this is good advice. Although mine don't mind me going for their fluffy ol' tummies.",
            "title_similarity": "0.5497709",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1nfvim",
            "score": 1,
            "text": "Have you talked to a cat before?",
            "title_similarity": "0.51523215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ng4aa",
            "score": 1,
            "text": "So, this is only partially correct. If your cat trusts you and exposes it's belly you're usually a-OK to give it some pets. Most wild cats will go to their back, as a defensive measure, because it's now capable of using its teeth and all 4 clawed beans and this has transferred to domesticated cats.",
            "title_similarity": "0.8350972",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1ng4rs",
            "score": 1,
            "text": "My cat LOVES it when i pet the belly!",
            "title_similarity": "0.7166525",
            "sentiment_compound": 0.6932
        },
        {
            "id": "h1ng98j",
            "score": 1,
            "text": "I don't think this is true",
            "title_similarity": "0.10238859",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1ngczv",
            "score": 1,
            "text": "There’s this cat in my building and he was made a home by one of my neighbors so sometimes I go down and watch him . One time he came up to me because I was signaling that I was gonna give him some pets and I guess he didn’t like my pets so he scratched my hand kinda playfully and left lol",
            "title_similarity": "0.7799976",
            "sentiment_compound": 0.8692
        },
        {
            "id": "h1ngd0o",
            "score": 3,
            "text": "I'm still going to kiss her belly, sorry!",
            "title_similarity": "0.50337106",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h1ngdf1",
            "score": 1,
            "text": "Meanwhile my cat loves it when I rub my face in his tummy",
            "title_similarity": "0.71208054",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nge5l",
            "score": 18,
            "text": "Unless you are blessed by the rare type of cat who demands tummy rubs. Proceed with caution testing this however.",
            "title_similarity": "0.8735565",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1ngexi",
            "score": 2,
            "text": "Bonus LPT: The same often applies to humans I have found",
            "title_similarity": "0.26810682",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1ngf83",
            "score": 1,
            "text": "And NOW you tell us..?",
            "title_similarity": "0.083661854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ngftt",
            "score": 1,
            "text": "I had a cat at one time who only came to me for belly scritches. (Unusual, since our other cats seemed to adore my husband and only tolerate me.) Anyway, for whatever reason one day I exited the bathroom and Augusta was waiting outside the door, first pawing at the wall and then rolling over. I don't know \\*why\\* I said this phrase, but I picked her up beneath her \"shoulders\" and \"strummed\" her belly as she hung, stretched out, while semi-singing \"'Gusta, Gusta, I play your tummy like a banjo..\" over and over. One time and suddenly it became a daily routine. Every morning when I exited the bathroom, even if I was running late for work, Augusta was there waiting and I had to hoist her up and \"play her tummy\" and sing my stupid song. Once when I was very ill and could not lift her when I exited the bathroom my husband very reluctantly picked her up and \"played her belly like a banjo\" while muttering that refrain.",
            "title_similarity": "0.80588484",
            "sentiment_compound": 0.7447
        },
        {
            "id": "h1ngik4",
            "score": 1,
            "text": "I always rub the belly because I know it's a trap. My arm gets locked into the claws of death with bonus love bites. I'll be off to the doctor now.",
            "title_similarity": "0.62026906",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1ngju5",
            "score": 1,
            "text": "Which cheeks do we rub? The ones on its face or the ones on its ass?",
            "title_similarity": "0.36839446",
            "sentiment_compound": -0.594
        },
        {
            "id": "h1nglqd",
            "score": 1,
            "text": "Yeah mine really encourages belly rubs when she does this",
            "title_similarity": "0.49973738",
            "sentiment_compound": 0.659
        },
        {
            "id": "h1ngnwd",
            "score": 2,
            "text": "It def differs from cat to cat, I have 2 and one is like that and will show me his belly but not want me to touch him just to be around and the other wants vigorous belly rubs as much as possible lol. I'm my experience (no expert here) I've found the more long haired cats tend to be the ones that don't want tummy pets the most..",
            "title_similarity": "0.860819",
            "sentiment_compound": 0.5837
        },
        {
            "id": "h1ngxtq",
            "score": 35,
            "text": "Cheeks first and go for the belly while petting the cheeks.\n\nIt’ll associate belly rubbing with the pleasures of cheek rubbing \n\nTakes awhile at first",
            "title_similarity": "0.59991395",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1nh0fy",
            "score": 16,
            "text": "I'm lucky in the fact that both my current cats seriously love belly rubs.\n\nBut for those kitties that don't (friend's cats), I go for the chest/chin.",
            "title_similarity": "0.8091731",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h1nh3xo",
            "score": 2,
            "text": "u/giraffes_are_cool33 : okay, this is something I didn't know about cats. Try this with Caccouza!",
            "title_similarity": "0.7062515",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h1nhdns",
            "score": 1,
            "text": "Listen I don’t know how rubbing it’s butt would help besides receiving a clawed up face.",
            "title_similarity": "0.4922619",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1nhpxg",
            "score": 1,
            "text": "The amount of times I've read this.  \nWe have two cats that love nothing more than belly rubs. I do not know where the research comes from on this - but it's clearly flawed.",
            "title_similarity": "0.8192766",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1nhsoz",
            "score": 1,
            "text": "What cheeks?butt or face?",
            "title_similarity": "0.17549683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nhvbv",
            "score": 1,
            "text": "Which cheeks are you referring to?",
            "title_similarity": "0.1317114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nhw17",
            "score": 1,
            "text": "My previous cat loved belly rubs, and would only object if we went down too far and started getting close to his junk. Other than that, he'd gladly flop over for us and soak up the attention.\n\nMy current cat will allow us to stroke her back or belly if she's upright or stood up on her hind legs, but the minute she lays down, will only accept her face and head being touched. Anything else will result in a warning swipe or nibble, and a filthy look. She's a bit more highly strung than her predecessor, and I think she likes knowing that your hand is always in sight while she's in a more vulnerable position.\n\nThey've all got their own individual likes and dislikes. Just like humans.",
            "title_similarity": "0.86816263",
            "sentiment_compound": 0.9155
        },
        {
            "id": "h1nhxzo",
            "score": 1,
            "text": "My cat exposes his butthole to me, it's a sign of them saying \"you're beneath me peasant now go clean my poop throne or I will shit on your carpet\".",
            "title_similarity": "0.7522729",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1ni1wm",
            "score": 1,
            "text": "Dogs: \"just touch me. All the time. Please\"",
            "title_similarity": "0.3420056",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1ni35f",
            "score": 1,
            "text": "Around the cheeks? What?",
            "title_similarity": "0.12910447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ni53h",
            "score": 1,
            "text": "I have a cat that will yell at me if I don't give her belly rubs. She pulls my hand on to her belly, and if I start pulling away, she yells at me and puts my hand back in her belly lol then there's my other cat, Remi, who won't put my hand on his belly, but he gets SUPER OFFENDED if I don't rub his belly.",
            "title_similarity": "0.8053783",
            "sentiment_compound": 0.7984
        },
        {
            "id": "h1ni5f3",
            "score": 9,
            "text": "How does this have so many upvotes lol",
            "title_similarity": "0.05623903",
            "sentiment_compound": 0.4703
        },
        {
            "id": "h1nibfj",
            "score": 3,
            "text": "This is good advice, however I have a an old barn cat that will fuck me up if I try to touch anything other than her belly when she shows it.  If if it’s not showing, don’t touch the belly.  If the belly is showing, only touch the belly.  Those are her well established rules.",
            "title_similarity": "0.8790182",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1nifdu",
            "score": 1,
            "text": "Mine started doing this after seeing my dog.",
            "title_similarity": "0.2440364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1niohy",
            "score": 1,
            "text": "Don't want to be a downer but it was only from my cats regular belly rubs that I found out she had early stage breast cancer.\n\nOccasional belly rub of a female cat especially could save their life.",
            "title_similarity": "0.7490242",
            "sentiment_compound": -0.3598
        },
        {
            "id": "h1niytd",
            "score": 1,
            "text": "I have violated my cat's trust so many times that she's gotta be used to it by now. The more I struggle snuggle the more she loves me. \n\nI wonder if cats have stockholm syndrome.",
            "title_similarity": "0.7731447",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1nj31x",
            "score": 1,
            "text": "Me: *reading this in bed, snuggling my kitty and rubbing his belly*\n\nMe: Oh no, internet says not to rub your belly! Let me stop..\n\nCat: Stop now motherfucker and you shall perish",
            "title_similarity": "0.7150444",
            "sentiment_compound": -0.8516
        },
        {
            "id": "h1nj3wr",
            "score": 1,
            "text": "It most definitely depends on the cat. I have a cat that HATES it when she can see you reach for her ears, head, or neck to scratch with -- she backs away immediately. Something about the hand going for her must seem intimidating. She's strictly torso-pets only.",
            "title_similarity": "0.84812593",
            "sentiment_compound": -0.1129
        },
        {
            "id": "h1nj40e",
            "score": 1,
            "text": "Some cats love their belly rubbed and will roll over and show you their belly just for that reason.",
            "title_similarity": "0.7546432",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1nj64p",
            "score": 1,
            "text": "Wait, pet around which cheeks?? Instructions unclear. Cat not purring.",
            "title_similarity": "0.68119466",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h1nj650",
            "score": 1,
            "text": "Yeah my neighbors cat always comes over and he’s amazing but that’s the one thing we can’t do. He will bite you immediately if you touch his belly.",
            "title_similarity": "0.7370274",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1njfwk",
            "score": 1,
            "text": "Former dog-only person here,\n\nMan, after learning about and getting cats after becoming an adult, I realized most people just suck with animals. You just have to understand how to read their body language, which is harder than a dog. You also have to treat them more like an actual animal that you respect and not a pet. But if you, do they almost always return the love. For instance, of the several cats we actually own, two wait for me by the door to return home, and another one clings to me constantly throughout the day. All I do is read their body language.\n\nI understand people who haven't been around cats not being a fan of them...that makes sense. But if you've been around a healthy cat for a while...you should understand.",
            "title_similarity": "0.7925966",
            "sentiment_compound": 0.8915
        },
        {
            "id": "h1njgv0",
            "score": 1,
            "text": "Which cheeks are we talking about?",
            "title_similarity": "0.17332755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1njlbd",
            "score": 1,
            "text": "Hehe, with respect I must ask you to have a talk with my cat. He absolutely loves his belly scrachies.",
            "title_similarity": "0.745844",
            "sentiment_compound": 0.796
        },
        {
            "id": "h1njlrr",
            "score": 1,
            "text": "Except for my Sweetie. He LOVES belly rubs for some reason.",
            "title_similarity": "0.5837805",
            "sentiment_compound": 0.824
        },
        {
            "id": "h1njn5a",
            "score": 1,
            "text": "Ok I will rub its asscheeks",
            "title_similarity": "0.3692891",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1njou0",
            "score": 3,
            "text": "I’m rubbing that kitty belly. If I get scratched, then so be it.",
            "title_similarity": "0.6967804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1njvov",
            "score": 1,
            "text": "Yeah no I always pet his belly. Sometimes he bites, sometimes he lets me scratch. But I feed that belly and he knows it lol",
            "title_similarity": "0.49785906",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1njym0",
            "score": 2,
            "text": "A lot of cats love the chest / neck area but yes, it's an increased level of trust area.\n\nLower than the ribcage is definitely no bueno.",
            "title_similarity": "0.77383083",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h1nk0ly",
            "score": 1,
            "text": "Or....just don't pet it.",
            "title_similarity": "0.2588203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nk1jz",
            "score": 1,
            "text": "Not rly a pro tip becuz it only applies to certain cats. All the cats I have owned like belly rubs because I spend a lot of time and nurturing with them when they are little.",
            "title_similarity": "0.74411184",
            "sentiment_compound": 0.765
        },
        {
            "id": "h1nk22y",
            "score": 1,
            "text": "I just give her the reign of my hand. Wherever she leads, petting will follow. Could be her head, could be her chin.\n\nOr could be her asshole...",
            "title_similarity": "0.51141065",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1nk98x",
            "score": 1,
            "text": "Can confirm... am Mr Cat!",
            "title_similarity": "0.4707502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nkcxm",
            "score": 1,
            "text": "Our cat loves belly scratches. He flops near me...I start giving belly rubs and he starts making air biscuits with his paws.",
            "title_similarity": "0.69396985",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nkd8o",
            "score": 1,
            "text": "My British blue regularly falls asleep in the middle of the living room floor on his back paws up in the air for hours on end. He loves it",
            "title_similarity": "0.44637138",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nkfrs",
            "score": 1,
            "text": "To my defense, I got my cats when I was only 12, and totally immature.\n\nNow, my cats know that I'm patting them on the belly when they show it, so they enjoy my belly rubs. They never scratched nor bit me. They're pure angels.",
            "title_similarity": "0.72378063",
            "sentiment_compound": 0.6096
        },
        {
            "id": "h1nkgxc",
            "score": 1,
            "text": "My cat loves belly work",
            "title_similarity": "0.67217577",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nkhag",
            "score": 1,
            "text": "Those little pecker heads can suck it",
            "title_similarity": "0.36618483",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1nkj2u",
            "score": 1,
            "text": "I thought my cat was just an asshole",
            "title_similarity": "0.6590166",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nksnr",
            "score": 1,
            "text": "Totally depends on the cat. When my cat shows his belly, he wants belly rubs. Most cats I've made friends with are the same.",
            "title_similarity": "0.80811",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1nl27m",
            "score": 1,
            "text": "My cat likes belly rubs for 5 seconds, then grabs my hand with his paw and brings it to his head. That bastard loves head pats",
            "title_similarity": "0.73999095",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1nl3ge",
            "score": 1,
            "text": "Mine starts playfully gnawing your hand. If u stop rubbing she will pull your hand back into her belly til she has had enough.",
            "title_similarity": "0.5957614",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1nl5op",
            "score": 1,
            "text": "Mine shows me its belly and then proceeds to swat at me (no claws) and bite me (gently).  It's how she plays.",
            "title_similarity": "0.64142025",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1nli9e",
            "score": 1,
            "text": "That makes sense. My cat lets me rub her belly but I always get a confused reaction. I can tell she's refraining from bear trapping me.",
            "title_similarity": "0.857534",
            "sentiment_compound": -0.4497
        },
        {
            "id": "h1nlsbh",
            "score": 1,
            "text": "Not my cat. He's like a dog. Scratch my belly. NOW!",
            "title_similarity": "0.544523",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h1nltfw",
            "score": 1,
            "text": "My cat only does this to me. Anytime I settle into home life after work or going to bed he lays on his side and shows his belly. I touch his side first then his belly...he loves it and wiggles. One of the pics is r/kittyhasaquestion",
            "title_similarity": "0.7586071",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nm6hp",
            "score": 1,
            "text": "My boy shows his belly all the time, and what I'll actually do is pet him along the back. He loves a good belly rub, but he needs to be on his feet while I do it.",
            "title_similarity": "0.53093624",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1nmd96",
            "score": 2,
            "text": "Well that explains a lot. My friends were cat sitting and he'd show me his  belly every so often. When i rubbed it he'd immediately get up and walk off. Figured it was just a cat thing lol.",
            "title_similarity": "0.70969033",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1nme8t",
            "score": 1,
            "text": "most kitties I know love their bellies scratched.  I think your neurotic asshole is the one that's an exception.",
            "title_similarity": "0.54416984",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1nmiqj",
            "score": 1,
            "text": "When my kitty \"goes rolly-polly\" I give her scritchies on her chest and chin area, not her belly.  Subsequently, I then lose access to my right arm for about half an hour as she usurps it.  Plus side I've become very adapt at typing single handed with my eft hand.",
            "title_similarity": "0.6085167",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1nmlnh",
            "score": 2,
            "text": "I just learned this from a YouTube video on tips about cats.  My cat shows his belly all the time and I thought he wanted his belly rubbed like a dog.  Sometime he tries to bite me and sometimes he licks my hand.  I just scratch his neck now.",
            "title_similarity": "0.75012326",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1nmp02",
            "score": 1,
            "text": "Nah my cat likes belly rubs and even lifts her leg to let me pet between them. She gets face kisses and locks when annoyed but is extremely affectionate and doesn't mind being tickled all over.",
            "title_similarity": "0.7928778",
            "sentiment_compound": 0.7461
        },
        {
            "id": "h1nn029",
            "score": 1,
            "text": "Bitey scratchy is my favorite game to play with my cat :(",
            "title_similarity": "0.7375697",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1nn1e9",
            "score": 2,
            "text": "Disappointed by all the people not paying the cat tax in this thread",
            "title_similarity": "0.616948",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1nn5a1",
            "score": 2,
            "text": "As someone who currently has four cats (used to have more, but one got a kidney infection and had to be put down, and the other one just disappeared one day) this is 100% true. When one of the car goes crazy affectionate, they’ll flop and roll all over the place at your feet, but if you try and stroke their\nbelly, they’ll scratch and bite, belly is a big no no",
            "title_similarity": "0.7145698",
            "sentiment_compound": 0.3252
        },
        {
            "id": "h1nn64h",
            "score": 1,
            "text": "My cat like that jiggly fatty part of her belly rubbed but only when she initially jumps on my lap. If I try to touch it any other time my hand gets shredded",
            "title_similarity": "0.821697",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h1nni7s",
            "score": 1,
            "text": "We've got a cat now, a feral kitty we've coaxed inside, that absolutely LOVES belly rubs. After many years of experience, I too understood this to be a trap, however, she would kind of push your hands there, so I started rubbing her belly and she loves it. Its crazy, especially from a semi-domesticated feral kitty.",
            "title_similarity": "0.83268285",
            "sentiment_compound": 0.6933
        },
        {
            "id": "h1nnjki",
            "score": 1,
            "text": "I wish I’d known this last week.",
            "title_similarity": "0.18640253",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1nnmz5",
            "score": 1,
            "text": "Ive had my cat since his birth so right away I started touching his belly to teach him that it’s OK. It’s turned him into a very chill dude.",
            "title_similarity": "0.71870315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nno74",
            "score": 1,
            "text": "I don't know how you all raised your cats, but every cat I've had doesn't care if you rub their belly. They always want a belly rub.",
            "title_similarity": "0.6975053",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h1nnsvx",
            "score": 1,
            "text": "maybe its maybeline",
            "title_similarity": "0.098579235",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1no471",
            "score": 1,
            "text": "But... I want to touch the fluff.",
            "title_similarity": "0.34342003",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h1nob5p",
            "score": 1,
            "text": "Some cats like belly rubs, some don't, just don't insist on belly rubs if your cat doesn't like them.",
            "title_similarity": "0.8577341",
            "sentiment_compound": 0.1002
        },
        {
            "id": "h1noce7",
            "score": 1,
            "text": "You don't actually have to avoid the belly. Just rub it don't poke. Cat's also show their belly to play just like dogs.",
            "title_similarity": "0.7590066",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1nof5t",
            "score": 1,
            "text": "My boy cats are like “this belly is open for business!” And they love their soft tummy’s rubbed but man if I even play like I am going to rub my girl kitties tummies they latch on and either lick, play bite or for real bite. Depending on which one. They do have very unique personalities compared to ppl or other animals but they make such good companions when you understand and respect their boundaries.",
            "title_similarity": "0.8167026",
            "sentiment_compound": 0.9686
        },
        {
            "id": "h1nogr2",
            "score": 1,
            "text": "We call this \"armpit cat\"! Cat loves his armpits scratched, it's not his belly, and it amuses us.",
            "title_similarity": "0.8019524",
            "sentiment_compound": 0.7712
        },
        {
            "id": "h1nogtd",
            "score": 2,
            "text": "My cat *loves* belly scratches. Every morning, when I’m sitting in the chair, drinking my coffee, he’ll come up to me and face plant onto the floor, rolling over to show me his belly. If he’s out of my reach, he uses his head to scoot his body closer. Once he’s in reach, I give him some vigorous belly scratches.\n\nThen I go back to my coffee and he starts screaming at me and he’s back to being a prick.",
            "title_similarity": "0.6321236",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h1norgi",
            "score": 1,
            "text": "Except for when it's a trap because what they really want is to grab your hand and bite the shit out of you.",
            "title_similarity": "0.52969885",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h1noywi",
            "score": 1,
            "text": "As someone who has 6 cats and fostered dozens more, I can tell you this is bullshit. Par for the course for this subreddit",
            "title_similarity": "0.6073667",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1np2xp",
            "score": 2,
            "text": "I dont have a cat anymore but he would do this often and then he would attack me when id rub his belly. Damn.",
            "title_similarity": "0.682555",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h1np7ot",
            "score": 1,
            "text": "My cat literally doesn’t care like belly rubs like a dog lmao",
            "title_similarity": "0.70767784",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h1np9c3",
            "score": 8,
            "text": "My cat lifts her leg like a dog so I can get her belly good",
            "title_similarity": "0.69752926",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1npd3p",
            "score": 1,
            "text": "Every cat will be different. I have one cat loves to show her soft, chubby, cuddly belly but doesn't appreciate rubs. 1 cat is like a dog for belly rubs. 1 cat will allow her owner to touch her tummy when she shows it but will murder you if you try. The fourth cat is my baby and accepts belly rubs if we've been cuddling for quite a while but that's it. He'll murder me if I go in cold and won't tolerate anyone else at anytime.",
            "title_similarity": "0.8083123",
            "sentiment_compound": -0.8437
        },
        {
            "id": "h1npglz",
            "score": 1,
            "text": "So many scratches could be prevented by teaching this in school!  Lol",
            "title_similarity": "0.46062475",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1nplcd",
            "score": 1,
            "text": "Are you Dr. Doolittle?  \n\nHave you personally asked cats why they show their bellies?  \n\nSame thing with slowly blinking meaning they feel safe or something. \n\nHow does anyone know that?",
            "title_similarity": "0.7982346",
            "sentiment_compound": 0.533
        },
        {
            "id": "h1nplp9",
            "score": 1,
            "text": "My cat loves loves loves when you put your hand in her belly. She only does it to me and my girlfriend. She’ll lay sideways and you have to put your arm and hand across her belly and she’ll fall right asleep.",
            "title_similarity": "0.78082365",
            "sentiment_compound": 0.9552
        },
        {
            "id": "h1npoxr",
            "score": 1,
            "text": "One of my parents cats shows her belly when you bring the brush out. If you don't brush the belly you get bit.",
            "title_similarity": "0.80499196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nppt4",
            "score": 2,
            "text": "Yeah it's important to note that individual cats vary quite like humans. I have one cat who loves belly rubs, any touching for that matter. My other cat hates being touched at all.",
            "title_similarity": "0.86007756",
            "sentiment_compound": 0.7713
        },
        {
            "id": "h1nps46",
            "score": 1,
            "text": "when my parents cat show belly once you go anywhere near the belly it will grab your hand and hold tight and meow if you try to let go",
            "title_similarity": "0.757863",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1npsx8",
            "score": 1,
            "text": "But... It's.... Just... So..... Tempting!!!!\n\nI hand raised my widdle Fatboi from about a week old, so he likes a gentle belly pets as he's falling asleep and will roll from his side to his back to invite more rubz.\n\nExcuse me I have to go scritch his cheeks now.",
            "title_similarity": "0.59445477",
            "sentiment_compound": 0.946
        },
        {
            "id": "h1npvbv",
            "score": 1,
            "text": "Sorry kitty, belly shouldn't be so fluffly. I'll take the murder claws",
            "title_similarity": "0.7445965",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h1npx5x",
            "score": 1,
            "text": "More fearmongering and spreading lies",
            "title_similarity": "0.3667931",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1npxsd",
            "score": 1,
            "text": "One of our oldest cat loves belly rubs, probably because when she was young and going to labor I always pet her belly before she even could push out the kittens. After that she never can deliver babies on her own without me belly rubbing her. She's spayed now but she still loves belly rub and always expose her stomach even I'm just giving her a head pat.  \n\n\nMy other cats don't like it much though.",
            "title_similarity": "0.7480916",
            "sentiment_compound": 0.7867
        },
        {
            "id": "h1nq612",
            "score": 1,
            "text": "I've never had a cat bite or scratch seriously. They seem to take it more as Play. It just hurts is all.",
            "title_similarity": "0.6540121",
            "sentiment_compound": -0.2782
        },
        {
            "id": "h1nq6oz",
            "score": 1,
            "text": "We have two cats, the male I can do pretty much whatever I want to including aggressive belly rubs , and he just purrs and goes along with it, the female is a little more restricted but when she allows it I can do pretty much anything as long as I'm not using to much force. When my fiancé wants to do belly rubs on them, they go for the kill.",
            "title_similarity": "0.816237",
            "sentiment_compound": -0.4779
        },
        {
            "id": "h1nq9sv",
            "score": 1,
            "text": "Unless it's my cat. She actively asks for belly rubs and will attack you if you don't give them to her.",
            "title_similarity": "0.7818466",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1nqe3j",
            "score": 1,
            "text": "my cat learned that humans like cat belly, so whenever he sees we are cooking with meat he rolls over and exposes his belly, letting us know that hes letting us pet it if he gets something in return. but if you pet it too long - there come the kicks and the claws and the teeth, but its still just a game. and he gets something tasty afterwards :)",
            "title_similarity": "0.7911074",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1nqgei",
            "score": 1,
            "text": "Wait... so a man exposing his most vulnerable area to a woman, do that count as a sign of trust based on animal instincts?",
            "title_similarity": "0.6269345",
            "sentiment_compound": -0.0661
        },
        {
            "id": "h1nqkww",
            "score": 1,
            "text": "My cat now actually enjoys belly rubs quite a lot.",
            "title_similarity": "0.6703486",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1nqogu",
            "score": 1,
            "text": "It is hard trimming my cat's chest hair.",
            "title_similarity": "0.64553726",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1nqtv4",
            "score": 1,
            "text": "Unbelievable. An actual life tip in this sub.",
            "title_similarity": "0.19718233",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1nqw64",
            "score": 1,
            "text": "But if they don’t want me to touch the belly… why is the belly so soft and fluffy?!",
            "title_similarity": "0.62456226",
            "sentiment_compound": 0.1882
        },
        {
            "id": "h1nr36a",
            "score": 1,
            "text": "My cat loves belly scratches",
            "title_similarity": "0.72946984",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nr46r",
            "score": 1,
            "text": "I have two cats. Belly rubs are their absolute favorite. Like everything, it depends on the cat.",
            "title_similarity": "0.80328864",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1nr6t6",
            "score": 1,
            "text": "The belly cheeks??",
            "title_similarity": "0.2031342",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nr6wg",
            "score": 1,
            "text": "My corgi does this. She acts like a cat in other ways too",
            "title_similarity": "0.6827751",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1nr753",
            "score": 1,
            "text": "This is such a bogus myth. \n\nI wonder what drives people to spread false information, but this is Reddit so I guess it’s kind of expected.",
            "title_similarity": "0.5265708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nr7et",
            "score": 1,
            "text": "My roommate's cat used to just sit next to me and slow blink.  I would talk to her and pet her, but she was just like,  \"I love you and want you to know it\"",
            "title_similarity": "0.7329867",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h1nr8ce",
            "score": 1,
            "text": "and yet another reason cats suck: present the belly , get mad when you touch the belly. \n\ncat people are nuts",
            "title_similarity": "0.7611551",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h1nra30",
            "score": 1,
            "text": "Around the butt cheeks?",
            "title_similarity": "0.17083393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nrciu",
            "score": 1,
            "text": "No you must be wrong. Cats are the spawn of evil and want you to pet the belly so they can bite you. Don’t trust cats.\n\n\n\nI don’t like cats",
            "title_similarity": "0.7653613",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1nrcrl",
            "score": 1,
            "text": "But what if I like my arm being turned to hamburger?",
            "title_similarity": "0.3552542",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h1nrits",
            "score": 1,
            "text": "Both my cats love their bellies rubbed.  They also love their paws rubbed which is very different from any cat I've ever known before.  We started rubbing their bellies and paws and clipping nails when they were first brought home at 8 weeks old and now they're so used to it, they offer them up.",
            "title_similarity": "0.7292874",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h1nrjdd",
            "score": 1,
            "text": "Dogs are pretty much the exact opposite in this regard. Dog shows belly? Must rub belly and chest area. Required.",
            "title_similarity": "0.52971697",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1nrn18",
            "score": 2,
            "text": "This is probably the first actually useful tip I've seen on here",
            "title_similarity": "0.19007179",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1nrndh",
            "score": 1,
            "text": "Mine exposed her belly after I yelped because she scratched me. It was almost like she was saying, “My bad! You can get me back if you want.”",
            "title_similarity": "0.600034",
            "sentiment_compound": -0.4376
        },
        {
            "id": "h1nrpak",
            "score": 2,
            "text": "Lol this just happened to me yesterday!! TIL ty",
            "title_similarity": "0.17778164",
            "sentiment_compound": 0.717
        },
        {
            "id": "h1nrt9k",
            "score": 1,
            "text": "Now when you say cheeks.....",
            "title_similarity": "0.1532374",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nrvei",
            "score": 1,
            "text": "Is going for the chest more acceptable? I got a 10-12 week old kitten that has no problem with me stroking his chest.\n\n(If I go for the belly, he's gone)",
            "title_similarity": "0.651255",
            "sentiment_compound": 0.5928
        },
        {
            "id": "h1nrvju",
            "score": 1,
            "text": "My cat flops down, rolls over, and looks at me like “This belly isn’t going to rub itself”. If I hesitate, I get meowed at.\n\nBoth of my kitties love belly rubs.",
            "title_similarity": "0.8425276",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1nrywz",
            "score": 1,
            "text": "I pet my kitties everywhere. Tummy, chin, cheeks, paws, back, head, tail, sides. If they had enough they get up and walk away.",
            "title_similarity": "0.5093556",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nrzc0",
            "score": 1,
            "text": "My cat lets me kiss his belly and give him raspberries. I've been putting my face in the bear trap for 10 years. I think he's not as worried about his belly since he lays on my face with his belly when he wants me to wake up.",
            "title_similarity": "0.6218834",
            "sentiment_compound": 0.3374
        },
        {
            "id": "h1ns2v6",
            "score": 1,
            "text": "I feel like originally my cat would bite and scratch me when I did this but eventually learned it's a loving gesture from me and now she likes belly rubs lol",
            "title_similarity": "0.8390045",
            "sentiment_compound": 0.9382
        },
        {
            "id": "h1ns4b4",
            "score": 1,
            "text": "The day I picked up my cat he would show his belly and like push my hand on it if i stopped like a puppy. He doesn’t do that anymore, but I will never forget 😭",
            "title_similarity": "0.74701715",
            "sentiment_compound": 0.8166
        },
        {
            "id": "h1ns7u9",
            "score": 1,
            "text": "My cat actually loves that, she gets more chill while I give her belly rubs",
            "title_similarity": "0.7339358",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nsd6n",
            "score": 1,
            "text": "Pat around it's butt cheeks?",
            "title_similarity": "0.2726324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nsh8b",
            "score": 1,
            "text": "With my cat, thats usually an invitation to play. I rub the belly and she grabs, bites, and kicks. But she doesn’t come close to full force. \n\nThen she gets some scritches and is all lovey and cuddly again\n\nNow if I try the belly rub with my hand in a sheet or a towel…thats grounds for some severe punishment",
            "title_similarity": "0.8112552",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1nshu1",
            "score": 1,
            "text": "My cat is the exception",
            "title_similarity": "0.6235737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nsivz",
            "score": 1,
            "text": "Not for my kitty",
            "title_similarity": "0.4126929",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nsjcj",
            "score": 1,
            "text": "I have a young cat who will present like that when she wants to wrestle and tussle. If I do not try and noogie her belly, she will try and grab my hand and push it down on her abdomen so she can \"attack\" me. \n\nI suspect there gas got to be a dog in her lineage somewhere. She will rush out with the dogs to greet whoever just drove up and will jump up in the car and explore it. Ive not taken her for a ride yet, but I will eventually. I suspect she might enjoy it.",
            "title_similarity": "0.75133014",
            "sentiment_compound": 0.497
        },
        {
            "id": "h1nsjyl",
            "score": 3,
            "text": "I’m the only one in my household who can give my cat a belly rub, everyone else gets the fangs and claws",
            "title_similarity": "0.54405165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nsl6y",
            "score": 1,
            "text": "Tough - it's going to get rubbings",
            "title_similarity": "0.23774154",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1nsvjk",
            "score": 1,
            "text": "I believe this\n\nI know it's true\n\nWhat I've experienced myself personally corroborates these statements\n\nBut I'm still gonna go for that belly",
            "title_similarity": "0.40898967",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1nsx16",
            "score": 1,
            "text": "Does this same rule apply for dogs? My dog seems to like the belly scratch but I don’t want anyone to feel violated",
            "title_similarity": "0.6275941",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1nt2jk",
            "score": 2,
            "text": "I got two coons. One loves, one hates the belly scritches.",
            "title_similarity": "0.6203449",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1nte8y",
            "score": 1,
            "text": "learned this from experience",
            "title_similarity": "0.0873179",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nthp2",
            "score": 1,
            "text": "Like other people have said, every car is different. I have two that I raised from birth basically and they both love belly rubs. They lay on their backs and just purr when I rub their belly! It's the softest part!",
            "title_similarity": "0.5798286",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h1nti2b",
            "score": 1,
            "text": "Alternate LPT: If your cat scratch. Don't do that.",
            "title_similarity": "0.7085284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ntl1p",
            "score": 1,
            "text": "Not with mine, they both live for belly rubs! If I rub elsewhere they try to pul my hand to their bellies! Love them, my babies",
            "title_similarity": "0.61982405",
            "sentiment_compound": 0.8395
        },
        {
            "id": "h1nu0nk",
            "score": 1,
            "text": "Idk why I have to ask but...\n\n\n\nWhich cheeks",
            "title_similarity": "0.26999456",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1nu3bc",
            "score": 1,
            "text": "Cats show their bellies as an attack position too.  \n\nBecause it opens up all 4 paws as attack weapons, cats have a killer grapple and ground game and they know it.   \nIf it shows the belly it is an invitation to \"come get some motherfucker!\" \nThey do it in cat fights too, where they are clearly not trusting the other cat.",
            "title_similarity": "0.7499745",
            "sentiment_compound": -0.9664
        },
        {
            "id": "h1nu4pq",
            "score": 1,
            "text": "Pet around the cats butt cheeks? Why?",
            "title_similarity": "0.7118082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nu5v0",
            "score": 1,
            "text": "I rub my cat's belly with my foot when i walk by. He grabs and mouths me back, but he's gentle. He trusts me not to crush him i guess lol.",
            "title_similarity": "0.8276316",
            "sentiment_compound": 0.9241
        },
        {
            "id": "h1nu5x0",
            "score": 1,
            "text": "...wish I read this about 2 decades earlier.",
            "title_similarity": "0.22343412",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1nu6pa",
            "score": 1,
            "text": "So it's bad to tap their balls? Could've saved a lot of people a lot of grief.",
            "title_similarity": "0.52079177",
            "sentiment_compound": -0.6344
        },
        {
            "id": "h1nu9mu",
            "score": 1,
            "text": "Cat: Ok I trust you here's my belly\n\nHuman: Ok I guess I'll rub it\n\nCat: It's treason, then\n\nAlso cat: MEEEOOOOWWWWWWS while spinning with a lightsaber in mouth",
            "title_similarity": "0.74479747",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1nub2y",
            "score": 1,
            "text": "I always go for the armpits. They love some good armpit massages",
            "title_similarity": "0.44796473",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h1nucuz",
            "score": 1,
            "text": "Always pet above the neckline unless you're 100% sure they're comfortable. Maybe chest rubs and the back right at where the tail starts (if they have the tail upright). But honestly, they love to be pet between the years and in the chin so much so why risk it?",
            "title_similarity": "0.62849",
            "sentiment_compound": 0.8893
        },
        {
            "id": "h1nudld",
            "score": 1,
            "text": "Now, if your cat rolls over on their back, then pulls your hand toward their belly with their paws, then you can rub their belly.",
            "title_similarity": "0.7615094",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1nue5z",
            "score": 1,
            "text": "I learned that from a street cat once. It did _not_ like belly rubs. I got a slap on the wrist and an angry stare.",
            "title_similarity": "0.79000044",
            "sentiment_compound": -0.5873
        },
        {
            "id": "h1nufs4",
            "score": 1,
            "text": "So the total opposite of a dog?",
            "title_similarity": "0.20350802",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nuhmb",
            "score": 2,
            "text": "Or just get a dog.",
            "title_similarity": "0.18187645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nuj6f",
            "score": 1,
            "text": "I've had 7 different cats who all loved to have their bellies pet.",
            "title_similarity": "0.6088785",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1nuku5",
            "score": 1,
            "text": "My cat weirdly likes bell rubs (when he is in the right mood 😂)",
            "title_similarity": "0.7914892",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1nuorf",
            "score": 1,
            "text": "But... but.. their bellies are so FLUFFY",
            "title_similarity": "0.28050247",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nupjt",
            "score": 1,
            "text": "But why is the softest part of the kitty installed on the belly?",
            "title_similarity": "0.63313437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nurxl",
            "score": 1,
            "text": "My sweet girl will flop onto the ground, let you rub her belly for exactly 1.5 seconds, then with her back paw push you hand away without looking at you. Everytime, without fail. If you do not take this moment to realize YOUR mistake (not hers because in her mind she’s too good to fail) she will grab your hand and nom on it.",
            "title_similarity": "0.6872492",
            "sentiment_compound": 0.7814
        },
        {
            "id": "h1nus87",
            "score": 1,
            "text": "Which cheeks exactly sir?",
            "title_similarity": "0.09190897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nuv1r",
            "score": 2,
            "text": "SLPT: if a cat shows you affection or sympathy or empathy  ... \n\n..... ITS A TRAP!!!",
            "title_similarity": "0.7853283",
            "sentiment_compound": 0.578
        },
        {
            "id": "h1nuxmk",
            "score": 1,
            "text": "We have 2 cats that absolutely love belly rubs.",
            "title_similarity": "0.68418515",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h1nv4l5",
            "score": 2,
            "text": "This makes so much more sense now.",
            "title_similarity": "0.00266999",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nv9re",
            "score": 1,
            "text": "Unless you've got a cat that enjoys belly rubs like one of mine. Only one way to find out!",
            "title_similarity": "0.817333",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h1nvb4q",
            "score": 1,
            "text": "why do cats get so annoyed when you pinch the tip of their hairs on their back?",
            "title_similarity": "0.7484909",
            "sentiment_compound": -0.5214
        },
        {
            "id": "h1nvbhq",
            "score": 1,
            "text": "Both my cats constantly show their belly. I constantly scratch it for both of them. Cat A bites and runs and Cat B seems to love it and take it. \n\nAnd before anyone says something about I should stop petting Cat A on the belly because it bites, if I pet him at all anywhere on his body, he bites so it’s really no different",
            "title_similarity": "0.76311094",
            "sentiment_compound": 0.0627
        },
        {
            "id": "h1nvctx",
            "score": 1,
            "text": "Okay but where exactly are a cats ass cheeks they have a pretty tiny bum can someone help",
            "title_similarity": "0.6586863",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h1nvfj1",
            "score": 1,
            "text": "Yeah that's not always the case. My parents cat always show his belly but if you get remotely close to petting him he will scratch you.",
            "title_similarity": "0.7952274",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1nvgi9",
            "score": 1,
            "text": "So, treat cats the way you would treat a stripper... \n\nWait...",
            "title_similarity": "0.7259835",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1nvh8c",
            "score": 3,
            "text": "My cat holds my arm with all four legs to make sure the belly is properly rubbed. But this is actually great advice and rings very true. Boundaries and body autonomy for the win, our furbabies deserve nothing less. Mine dies not like her extremities touched at all, bit over 3 years I very slowly got her to put her legs in my hand when she sleeps",
            "title_similarity": "0.75364083",
            "sentiment_compound": 0.9651
        },
        {
            "id": "h1nvt75",
            "score": 1,
            "text": "We have two Maine Coons.  The male loves its belly rubbed all the time.  Doesn’t matter where you rub.  He loves it all.  He honestly acts more like a dog instead of a cat.  They are known to exhibit dog like behavior.   \n\nThe female only likes the area rubbed in between her front legs.  Sometimes she’ll let you do mid torso but need to read her body language before going for mid torso.",
            "title_similarity": "0.68753064",
            "sentiment_compound": 0.8518
        },
        {
            "id": "h1nvu25",
            "score": 1,
            "text": "What if your cat enjoys its belly rubbed? Hehe",
            "title_similarity": "0.7590164",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1nvu6u",
            "score": 1,
            "text": "No, it's actually a reflex/instinctual",
            "title_similarity": "0.2573463",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nvu70",
            "score": 1,
            "text": "I had a cat that not only liked belly rubs, he'd get a boner.",
            "title_similarity": "0.7522015",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h1nvvjw",
            "score": 1,
            "text": "This is surely a tip that will help many. It didn't help me because I only need to know one thing about by darling cat:\n\nPlease supply a LPT for successful claw trimming with none of my blood being let! How come the vet can do it but I can't? Drugs?",
            "title_similarity": "0.7936804",
            "sentiment_compound": 0.806
        },
        {
            "id": "h1nvvq2",
            "score": 1,
            "text": "Im a try this on my cat",
            "title_similarity": "0.660877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nvw00",
            "score": 1,
            "text": "This is also true of humans when we present out testicles.  Please do not hit them; we are offering them (one of our weak points) as a sign of trust.  I mean, unless we ask that you hit them.",
            "title_similarity": "0.6660364",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1nw0au",
            "score": 2,
            "text": "some cats do this to show other cats they are not afraid of them.\n\nMy two males often have little showdowns, they will start trying to pounce on each other and eventually end up face to face and then they will try to smack the other one in the face without getting hit themselves.\n\nThis obviously doesn't work if they're both doing it at the same time and then one of them will break off and walk a few steps away to groom himself, then the other one will copy him almost exactly while sneakily looking at each other from the corners of their eyes like \"i'm not afraid of you, look at me ignoring you, LOOK AT HOW LITTLE I CARE\"\n\nAbout 10% of the time the first one to break of will flop on his back pretending really hard to ignore the other one and then the other one will do the same.",
            "title_similarity": "0.8250314",
            "sentiment_compound": -0.0787
        },
        {
            "id": "h1nw5b8",
            "score": 1,
            "text": "But it’s so *soft*",
            "title_similarity": "0.24068059",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nw5tx",
            "score": 2,
            "text": "It doesn’t take long to learn this lesson. They either want a nice belly rub, or they will murder you.",
            "title_similarity": "0.58770674",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1nw6j2",
            "score": 2,
            "text": "One of my cats does that.\n\nStrong enough that she draws blood with every.single.claw.\n\nThe other starts snoring and licking herself.",
            "title_similarity": "0.7003022",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1nwbw4",
            "score": 2,
            "text": "My cat wraps around my arms and bites the hell out of my hands but loves me petting him with my feet. I would always pet him on the floor with my feet and now he eats hands and licks feet. \n\nWhat a guy",
            "title_similarity": "0.761106",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h1nweez",
            "score": 2,
            "text": "This explains so much.",
            "title_similarity": "0.040072717",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nwevw",
            "score": 1,
            "text": "Two of my cats actually like belly rubs. They never try to bite anyone when they show their bellies",
            "title_similarity": "0.7908024",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1nwjdp",
            "score": 2,
            "text": "Now it makes sense.",
            "title_similarity": "0.0023375303",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nwleq",
            "score": 1,
            "text": "*Really* depends o the cat. Mine loves his belly rubs and scratches.",
            "title_similarity": "0.7741347",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nwlj1",
            "score": 2,
            "text": "I usually scratch from the chest and slowly go down to the belly and then back to the chest. Usually they have ample time to realize what I am doing and stop me if they aren't cool with it, usually a cat is cool with the belly if I do this but some still aren't cool with it, it depends on the cat!",
            "title_similarity": "0.85647994",
            "sentiment_compound": -0.4881
        },
        {
            "id": "h1nwq39",
            "score": 1,
            "text": "My cat likes belly rubs, but is also ticklish and doesn't like to be tickled, so only very specific belly rubs are allowed.",
            "title_similarity": "0.8816643",
            "sentiment_compound": -0.1938
        },
        {
            "id": "h1nwrrm",
            "score": 1,
            "text": "Instructions unclear. Touched cats asscheaks. Am now minced.",
            "title_similarity": "0.6707938",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1nwsne",
            "score": 1,
            "text": "LPT: Things are the way I say they are. \n\n[edit] except when they aren't",
            "title_similarity": "0.34611604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nww2b",
            "score": 1,
            "text": "My cat actually loves when I pet his belly, he lays down and let's me love him, he is a precious little thing",
            "title_similarity": "0.7390453",
            "sentiment_compound": 0.9118
        },
        {
            "id": "h1nww94",
            "score": 1,
            "text": "Sometimes they’ll be playful in these moments. When you rub their belly they’ll want to play, and will grab or nip you.\n\nI’m lucky that my cat loves belly rubs. My stray doesn’t like to be pet though, so I’ve got lots of scratches from trying to get her to be friendly\n\nShe rubs up against me and rolls around when I feed her, though. We’ve been feeding her for 10 years or close to it",
            "title_similarity": "0.82350385",
            "sentiment_compound": 0.9501
        },
        {
            "id": "h1nx026",
            "score": 1,
            "text": "Some cats do want the belly rubs tough. I wouldn't suggest going for the belly immediately for sure, that'll get you bit",
            "title_similarity": "0.8671644",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1nx71o",
            "score": 1,
            "text": "Mine shows her belly because she wants to play. We play fight as I attack her belly and she defends herself. \n\nOne of these days, she's going to make an important phone call and mention she has a special set of skills.",
            "title_similarity": "0.5231513",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1nxc9u",
            "score": 1,
            "text": "I have a cat that absolutely loves getting hard scratches on her belly. Whenever you reach for her fluffy tummy she flops down or sits like a person for more. Usually. Had a couple times where she really wanted butt scratches. She's a tortie btw",
            "title_similarity": "0.7648238",
            "sentiment_compound": 0.5468
        },
        {
            "id": "h1nxgga",
            "score": 1,
            "text": "Mine loves belly scratches and pats, but not rubs.",
            "title_similarity": "0.7034709",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h1nxh65",
            "score": 1,
            "text": "My cats both love belly rubs and tickles so YMMV",
            "title_similarity": "0.70790577",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1nxhh6",
            "score": 1,
            "text": "My cat shows his belly so we pet it though. Like he legitimately loves belly rubs. He does it for his vet too",
            "title_similarity": "0.7768117",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1nxhpt",
            "score": 1,
            "text": "I've touched every cats belly shown to me and no issues. *Shrugs*",
            "title_similarity": "0.5838371",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1nxiej",
            "score": 2,
            "text": "We had a cat that would roll on his back and show his belly. You could rub it when he was outside, but beware the fool who attempted it indoors.",
            "title_similarity": "0.80507326",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h1nxr0x",
            "score": 1,
            "text": "Often showing the belly is an invitation to play.",
            "title_similarity": "0.33795273",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1nxv6v",
            "score": 1,
            "text": "LPT: When a dog shows you his belly, pet him.",
            "title_similarity": "0.45765027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nxxln",
            "score": 1,
            "text": "I still think its a trap. They want you to put your hand in the perfect position to claw it with hands and feet. Probably because you didn't give them enough wet food.",
            "title_similarity": "0.6572203",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1nxzbe",
            "score": 1,
            "text": "But I NEED to get that puddins",
            "title_similarity": "0.19175978",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nyatg",
            "score": 1,
            "text": "Every cat is different. My cat loves to show her belly and sometimes she enjoys the belly tickles and sometimes she doesn't. We've been playing rough her entire life since she was 8 weeks old though, so we just havin' fun regardless. I'll wrestle that bitch and she lets me. It's love.",
            "title_similarity": "0.7337177",
            "sentiment_compound": 0.8781
        },
        {
            "id": "h1nybl3",
            "score": 1,
            "text": "This is often true, but not always. My cat jumps in my lap and turns her tummy up. When this happens, she could stay there for hours getting tummy rubs.",
            "title_similarity": "0.6784111",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1nygvl",
            "score": 1,
            "text": "Depends on your cat. My cat adores belly rubs.",
            "title_similarity": "0.7925842",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1nyy8i",
            "score": 1,
            "text": "What the heck are belly cheeks?",
            "title_similarity": "0.2771846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nz7he",
            "score": 1,
            "text": "My neighbour cat was faking biting me and always asked me for more so I guess it depends on the cat",
            "title_similarity": "0.7534714",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1nzcug",
            "score": 1,
            "text": "I’m sorry what…? I thought the only cheeks that exist are on the face or the ass , you tellin me the Belly has cheeks now ..? Smh just another thing on the long list of stuff they ain’t teach us in school",
            "title_similarity": "0.4852057",
            "sentiment_compound": -0.755
        },
        {
            "id": "h1nzepi",
            "score": 1,
            "text": "I interpreted this as butt cheeks.",
            "title_similarity": "0.21198195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nzjq2",
            "score": 2,
            "text": "If that isn't the most cat thing.\n\n>I trust you to pet my belly but *there will be hell to pay if you do*",
            "title_similarity": "0.84765565",
            "sentiment_compound": -0.7814
        },
        {
            "id": "h1nzlfo",
            "score": 2,
            "text": "I have the puncture wounds and emergency room bill to prove this is true. Never had a cat but always dogs. Neighbors cat rolled over and it was belly rub time followed immediately by wrath of kitty. Woke up the next morning with my hand and arm infected and swollen.",
            "title_similarity": "0.6133001",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1nzo4y",
            "score": 1,
            "text": "Or just go r/ifuckinghatecats",
            "title_similarity": "0.22678158",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1nzp96",
            "score": 2,
            "text": "I learned this lesson from Calvin and Hobbes. Five out of six ends are dangerous when a cat is on its back.",
            "title_similarity": "0.79377985",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1nzqkx",
            "score": 2,
            "text": "I have a three year old brother sister combo. I got the sister, Nym or Nymeria, when she was ten weeks old. We formed a tight bond right away and she trusts me completely. If she doesn’t like a pet she will grab me with her claws and teeth in a gentle way. If I continue she digs in slightly. If I just stop she licks. \n\nThe boy, Malvo, I got when he was a few months old. He had been adopted as a kitty to a different family. They returned him as their toddler apparently would pull his tail and fuck with him. So they gave me Malvo to reunite him with his sister and mother (I had the mother too but she recently had to be put down). He was super timid. He was always cautious about everything. But I smothered him over and over with affection. Now he’s my little sidekick and he loves all the affection. He still is cautious about his back paws and tail being touched. He does the same grabbing technique his sister does, but a little tighter. \n\nBasically I just rambled about how much my two kitties are little babies. They’re uncertain about new people at first, but with me they’re babies.",
            "title_similarity": "0.63143367",
            "sentiment_compound": 0.9437
        },
        {
            "id": "h1nzqxt",
            "score": 1,
            "text": "One of mine loves belly rubs and shows it for that purpose.",
            "title_similarity": "0.5021353",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1nzwix",
            "score": 1,
            "text": "Mine actually wants me to belly rub her and stretches like a gum 🤷‍♀️ which i am thankful for 🧡",
            "title_similarity": "0.6181008",
            "sentiment_compound": 0.886
        },
        {
            "id": "h1nzwqc",
            "score": 1,
            "text": "Lies! My cat will literally follow me around until he gets belly rubs. He's quite independent and doesn't often like being fussed over, but he demands belly rubs from time to time.\n\nMy last cat didn't mind them either, though he wouldn't demand them. He just seemed to like being rolled over and having his belly rubbed because as soon as I stopped, he'd come right back for more.",
            "title_similarity": "0.8096405",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h1nzybm",
            "score": 2,
            "text": "Eh... give them belly rubs from kittenhood and they'll be fine with enjoying it.",
            "title_similarity": "0.696363",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1o0691",
            "score": 1,
            "text": "Yea my cat LOOOOOVED belly rubs",
            "title_similarity": "0.6828283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o0bnt",
            "score": 1,
            "text": "Good advice. Im still rubbing that belly though. 🐱",
            "title_similarity": "0.48127347",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1o0ka6",
            "score": 1,
            "text": "My cats really love when I Pet his limmtle belly but ok ill stop because reddit told me to",
            "title_similarity": "0.8134725",
            "sentiment_compound": -0.2391
        },
        {
            "id": "h1o0ps6",
            "score": 1,
            "text": "Hmm my cats never mind a belly rub and seem to enjoy it, probably something that depends on the cats preference I suppose",
            "title_similarity": "0.861716",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1o0v4j",
            "score": 2,
            "text": "Oh no... Forgive me, Lilly, for my actions of hostility",
            "title_similarity": "0.51428556",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1o0yuz",
            "score": 2,
            "text": ">So going for the belly is seen as an immediate violation of that trust\n\nPeace was never an option",
            "title_similarity": "0.47704998",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1o1942",
            "score": 1,
            "text": "Mistskes were made",
            "title_similarity": "0.050385304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o1dnr",
            "score": 1,
            "text": "I don’t know when I rub my cats belly he stretches and lays back even more and starts purring",
            "title_similarity": "0.71501774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o1i6h",
            "score": 1,
            "text": "Some cats want belly scratches. Some cats just want to scrach",
            "title_similarity": "0.8399048",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1o1n24",
            "score": 2,
            "text": "Can confirm with the scars as evidence. I now like to blow gently on their stomach, I get the strangest looks, lol.",
            "title_similarity": "0.5098051",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h1o1sba",
            "score": 1,
            "text": "Your trust was misplaced Mr Business. Belly rub attack!",
            "title_similarity": "0.5425735",
            "sentiment_compound": 0.126
        },
        {
            "id": "h1o1wew",
            "score": 1,
            "text": "Oh! but if I expose my most vulnerable area to someone to show that I trust them, I get arrested. Damn double standards…",
            "title_similarity": "0.56013566",
            "sentiment_compound": -0.8037
        },
        {
            "id": "h1o204l",
            "score": 2,
            "text": "Withholding belly rubs will result in biting and scratching in this home. I’m given a quota, and I know the consequences of not meeting it by now.",
            "title_similarity": "0.64053714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o21vt",
            "score": 1,
            "text": "An LPT is to learn the cat, because when my cat rolls over on her belly she definetly craves belly pets. My parents cat will bite you however",
            "title_similarity": "0.7952813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o26pv",
            "score": 2,
            "text": "My cat loves belly rubs but if a cat Im not as familiar with shows me its belly, I start at the chin/cheeks, to the neck, and of the cat is still happy and comfortable I will try to pet its chest or shoulders, but I dont go for the belly unless someone tells me the cat likes it or I know for myself.\n\nSome cats hate all belly rubs no matter how close you are to them, some love belly rubs but need time to trust you and some cats will accept belly rubs from anyone.",
            "title_similarity": "0.9106718",
            "sentiment_compound": 0.9777
        },
        {
            "id": "h1o28vg",
            "score": 1,
            "text": "I can't find my cat's butt cheeks.",
            "title_similarity": "0.5365082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o2an7",
            "score": 1,
            "text": "My cat lets me lay her down on her back and rub her though. Sometimes cradle her",
            "title_similarity": "0.6947883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o2b14",
            "score": 1,
            "text": "thats weird. my cats loves belly rubs. both keep coming back for more. they have never showed signs of violated trust when doing so",
            "title_similarity": "0.7196623",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1o2d96",
            "score": 2,
            "text": "but it’s so soft, the belly…",
            "title_similarity": "0.30375546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o2f4n",
            "score": 1,
            "text": "Which cheeks are we talking about",
            "title_similarity": "0.1630444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o2mqd",
            "score": 1,
            "text": "My tomcat used to love belly rubs & would actively solicit them from anyone.   Unfortunately, he tended to get rather 'excited'.\n\nBelly rubs from me stopped quite rapidly.  Less so from unsuspecting passers-by.  Nothing worse than hearing  \"Aww - isn't that cute ... come on then kitty ...  O.M.G. WHAT IS HE DOING???\"",
            "title_similarity": "0.7149755",
            "sentiment_compound": 0.7363
        },
        {
            "id": "h1o2qk7",
            "score": 1,
            "text": "All cats are different, this is not a LPT.\n\nMy cat, for example, shows me his belly so I pet his belly. He loves it.",
            "title_similarity": "0.81360674",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1o32kz",
            "score": 2,
            "text": "I has cat that absolutely loves belly rubs (from her chest to hind legs). In fact, it's precisely the reason I adopted her over 2 years ago. She went belly up (and it wasn't a trap!) for almost everyone in the cat cafe and continues to do so.\n\nPatches is such a trusting, loving kitty. But only with me now. Definitely has become a one-person cat.\n\nHowever, other cat (Maddie)...I don't dare to touch her belly if she shows it. Much shredding will ensue. Maddie is a real witch. Sigh.",
            "title_similarity": "0.77877307",
            "sentiment_compound": 0.7917
        },
        {
            "id": "h1o32m0",
            "score": 1,
            "text": "Just give them some belly work and it works out",
            "title_similarity": "0.3443195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o33v9",
            "score": 2,
            "text": "Ya need a damn manual with cats...",
            "title_similarity": "0.69394386",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1o36pp",
            "score": 1,
            "text": "Fuck that. Pet the belly every time.",
            "title_similarity": "0.37548378",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1o36qh",
            "score": 1,
            "text": "Not true on all accounts. One of my cats absolutely loves having his belly rubbed. The other one, yeah, not so much.",
            "title_similarity": "0.78364897",
            "sentiment_compound": 0.5942
        },
        {
            "id": "h1o37zl",
            "score": 2,
            "text": "Ahh, cat says \"I trust you won't go for my--\"\n\n(Immediately goes for belly) \n\n\"--you sunnuvabitch, I claw.\"",
            "title_similarity": "0.7713652",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1o3a1u",
            "score": 1,
            "text": "Mine loves belly rubs.",
            "title_similarity": "0.46559107",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1o3f3r",
            "score": 1,
            "text": "Unless you’re fussing my cat Jones. Go straight for the belly, he loves it!",
            "title_similarity": "0.7888526",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h1o3kjv",
            "score": 2,
            "text": "This might sound strange, but my cat waits until I'm in bed, then climbs in next to me under the duvet and does the 'small spoon' thing against my stomach and waits for me to rub her belly like that. She absolutely loves it.",
            "title_similarity": "0.7320591",
            "sentiment_compound": 0.8534
        },
        {
            "id": "h1o3tsi",
            "score": 1,
            "text": "Wouldn't petting around the cheeks irritate their whiskers?",
            "title_similarity": "0.5923606",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1o3x8s",
            "score": 1,
            "text": "Serious: When you say cheeks, where do you mean?",
            "title_similarity": "0.25873807",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1o424z",
            "score": 1,
            "text": "Tell that to my fat boy who is a slut for tummy scratches.",
            "title_similarity": "0.5227173",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1o44hw",
            "score": 2,
            "text": "Lol that explains so much.",
            "title_similarity": "0.059272535",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1o4bsd",
            "score": 2,
            "text": "I am our cat's person and subsequently the only one she allows to give her belly rubs. She's becoming more and more open with my wife, but the belly is still a no. Cats be weird and adorable.",
            "title_similarity": "0.81676364",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h1o4h3b",
            "score": 2,
            "text": "I'm yet to meet average kitty.\n\nOne of my cats will offer her belly, but for show only. Any attempt to touch her or even hovering over her leads to a mauling.\n\nAnother one, offers up his belly and loves having his legs and feet touched. Even tolerates belly rubs. Go for anything else, scratch city.",
            "title_similarity": "0.8700932",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h1o4ig7",
            "score": 2,
            "text": "Both my cats absolutely love belly rubs. \n\nI'm 36 years old and owned cats almost my whole life and up until a couple of years ago never had a cat that was even moderately ok with belly rubs.\n\nNow I've got two that give massive purrs and stretches when you rub their belly, totally different breeds too (they're mutts from the HS, but obviously have a dominant breed). Life is weird.",
            "title_similarity": "0.6754175",
            "sentiment_compound": 0.3174
        },
        {
            "id": "h1o4p78",
            "score": 1,
            "text": "My cat loves his belly rubs and thigh scratches but hes also pretty weird sometimes",
            "title_similarity": "0.7749069",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h1o4qxv",
            "score": 1,
            "text": "Cats are like this unless they're not.",
            "title_similarity": "0.6575352",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1o50p2",
            "score": 1,
            "text": "LPT: don’t get a cat",
            "title_similarity": "0.38988468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o53b5",
            "score": 1,
            "text": "Our cat loves belly scratches, contrary.",
            "title_similarity": "0.7712797",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1o53xy",
            "score": 1,
            "text": "Serious question, which cheeks?",
            "title_similarity": "0.18691719",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1o57gu",
            "score": 2,
            "text": "I had a cat once that became so docile she was completely cool with getting belly rubs.",
            "title_similarity": "0.7325134",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h1o5pi3",
            "score": 2,
            "text": "I know lots of kitties who don’t like it and become demonic.\n\nI’m pretty lucky- my [Alice](https://i.imgur.com/JPgcOrU.jpg) loves belly rubs, and I can even kiss and zerbert her tummy. She’s a goober.",
            "title_similarity": "0.7042681",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h1o5rix",
            "score": 2,
            "text": "Nah I go straight for the belly, it’s so soft. They allow it though...sometimes 😂",
            "title_similarity": "0.5227379",
            "sentiment_compound": 0.6771
        },
        {
            "id": "h1o5yt7",
            "score": 1,
            "text": "My boi loves belly rubs so mich, i have literally not once been scratched giving him some",
            "title_similarity": "0.5395794",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1o61lc",
            "score": 2,
            "text": "My cat doesnt like belly rubs but loves getting scritvhed around the armpits/chest area. Theres a thin line.",
            "title_similarity": "0.8627032",
            "sentiment_compound": 0.67
        },
        {
            "id": "h1o6c8q",
            "score": 1,
            "text": "Directions not clear... cat did not want me scratching his butt checks\n\nEdit- correct typing error",
            "title_similarity": "0.7586246",
            "sentiment_compound": -0.6256
        },
        {
            "id": "h1o6f4n",
            "score": 2,
            "text": "Our cats are allllll about the belly rubs.  I think they were dogs in a former life.  The pair we had for 19 years before these two were of the “touch the belly and prepare to die” variety.",
            "title_similarity": "0.6751875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o6hj3",
            "score": 2,
            "text": "Is this why they are so keen on showing you their asshole too? \n\nLPT: When a cat shows you it’s asshole, do not pet it there!",
            "title_similarity": "0.8443999",
            "sentiment_compound": 0.5474
        },
        {
            "id": "h1o6uvn",
            "score": 1,
            "text": "Which cheeks are we talking about?",
            "title_similarity": "0.17332755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o6wwc",
            "score": 1,
            "text": "How do you pick up a cat without touching their belly? I love how cute they are but I've never been able to pick one up out of fear.",
            "title_similarity": "0.72101355",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1o6zzt",
            "score": 1,
            "text": "LPT: Dogs are so much better than cats.",
            "title_similarity": "0.5376127",
            "sentiment_compound": 0.4902
        },
        {
            "id": "h1o73pp",
            "score": 2,
            "text": ">that you are trusted by exposing its most vulnerable area to you\n\nWhen I show my vulnerable area to people I trust, I get arrested.",
            "title_similarity": "0.56304765",
            "sentiment_compound": -0.2247
        },
        {
            "id": "h1o7dba",
            "score": 1,
            "text": "What about a dog?",
            "title_similarity": "0.11847156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o7fu1",
            "score": 2,
            "text": "My cat loves to show her tummy but we quickly learnt that it was a case of ‘you can look but you can’t touch’. She will allow me a stroke her head as she rolls around but if I move my hand across her body to get to her head the paws come out.",
            "title_similarity": "0.8729809",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h1o7hmr",
            "score": 2,
            "text": "Unless they are my cats who will continue to roll and grab their own heads and purr like jet engines.",
            "title_similarity": "0.6308197",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1o7ocb",
            "score": 2,
            "text": "One of my cats enjoys belly rubs, but he is very unusual and wants affection 24/7. For most cats, it’s good to stick to the head.",
            "title_similarity": "0.8424417",
            "sentiment_compound": 0.9
        },
        {
            "id": "h1o7q2f",
            "score": 2,
            "text": "Got 2 cats. Can confirm.",
            "title_similarity": "0.55076814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o7v3n",
            "score": 2,
            "text": "This makes so much sense! I understand *some* cats like belly scratches, but in most of my interactions a cat will immediately bite me if I rub their tummy, now I know why.",
            "title_similarity": "0.83904517",
            "sentiment_compound": 0.2598
        },
        {
            "id": "h1o7xeq",
            "score": 2,
            "text": "Very cool, good to know.\n\nWhen you say cheeks, you mean around the belly?",
            "title_similarity": "0.36496967",
            "sentiment_compound": 0.6976
        },
        {
            "id": "h1o809i",
            "score": 1,
            "text": "https://s3.amazonaws.com/theoatmeal-img/comics/kitty_pet/4.png",
            "title_similarity": "0.4784376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1o84ym",
            "score": 2,
            "text": "I had no clue I thought it was just playful and enjoyed it.......now I feel like an asshole",
            "title_similarity": "0.43725193",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h1o884q",
            "score": 2,
            "text": "I wish I would’ve known this years ago 😭",
            "title_similarity": "0.18733376",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1o8bm3",
            "score": 1,
            "text": "Mine would bite me if I didn't give her a very aggressive belly rub.",
            "title_similarity": "0.55530375",
            "sentiment_compound": -0.2247
        },
        {
            "id": "h1o8n9h",
            "score": 2,
            "text": "My cat LOVES bellyrubs! If she rolls over and you walk past, she literally waits and stares until you come back and give her a bellyrub. But i do appreciate most cars are not like that!",
            "title_similarity": "0.810267",
            "sentiment_compound": 0.6352
        },
        {
            "id": "h1o8sxa",
            "score": 1,
            "text": "mine loves belly rubs and also likes to lay on my hand on his belly",
            "title_similarity": "0.47727072",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h1o8wj7",
            "score": 2,
            "text": "Yes this is true I wish this post popped up literally yesterday though my pinky and ring finger are all scratched up right now",
            "title_similarity": "0.3773626",
            "sentiment_compound": 0.802
        },
        {
            "id": "h1o982v",
            "score": 2,
            "text": "Some cats can handle the sensory overload and others can't. If it can handle the extra input, they tend to enjoy it",
            "title_similarity": "0.72899973",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1oa467",
            "score": 2,
            "text": "But he's so fat and squishy, I just need a handful of kitty belly.",
            "title_similarity": "0.5517415",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oa8bd",
            "score": 1,
            "text": "I have an exception cat.  Belly up is definitely \"rub this tum tum!\"  You can rub her tummy all day, as far as she's concerned.",
            "title_similarity": "0.6025763",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h1oaelh",
            "score": 2,
            "text": "My cat likes being cradled like a baby and getting belly/chest scratches\n\nProbably cus I had him and did this since he was a kitten though",
            "title_similarity": "0.78333044",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1oaez9",
            "score": 1,
            "text": "I’m gonna try this on my dog.",
            "title_similarity": "0.2749281",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oahco",
            "score": 2,
            "text": "If I just need to give my cat belly rubs, I make sure I'm petting her head at the same time. I feel like it distracts her from the belly rub and keeps her from getting snippy lol",
            "title_similarity": "0.87070394",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1oaovc",
            "score": 1,
            "text": "You've obviously never met my cat.",
            "title_similarity": "0.37015957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oarts",
            "score": 1,
            "text": "Unless it’s my cat, he wants you to rub it",
            "title_similarity": "0.77506864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oay0d",
            "score": 2,
            "text": "I used to wonder why our cat would do this (bite when I rubbed his belly) 25ish years ago!! Now I feel bad.",
            "title_similarity": "0.6885916",
            "sentiment_compound": -0.6229
        },
        {
            "id": "h1ob1d6",
            "score": 1,
            "text": "Only for looking, not for touching!",
            "title_similarity": "0.22455142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ob3rd",
            "score": 1,
            "text": "my kitty loved belly rubs, as long as you rubbed it gently he would lay there and wouldn't complain, but as soon as he got up you had to stop",
            "title_similarity": "0.719398",
            "sentiment_compound": 0.2971
        },
        {
            "id": "h1ob8bg",
            "score": 1,
            "text": "My cat loves belly rubs.",
            "title_similarity": "0.7131265",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1oba3q",
            "score": 1,
            "text": "Apart from my cat -  who rolls over like a fluffy seal so his belly is can be fully massaged...",
            "title_similarity": "0.66895545",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1obgb6",
            "score": 1,
            "text": "I've got two that actually like it. I do it gently and slowly so that it's something they can enjoy rather than something they'll hate. my 3rd cat hates being touched on his stomach",
            "title_similarity": "0.8406923",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1obisn",
            "score": 1,
            "text": "My cats love belly rubs especially when you use your nails",
            "title_similarity": "0.68627447",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1obsr2",
            "score": 1,
            "text": "Ah that explain my scars",
            "title_similarity": "0.2038261",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1obtxw",
            "score": 1,
            "text": "I think it depends on their mood how much belly you can rub.  I have  a few cats and they all like rubs, but you have to pay attention to what mood their in.  When their in a playful mood, for me at least, they will 75% of the time attack my hand.  When they are in their trying to be cute mode, I'm pretty safe.",
            "title_similarity": "0.8267536",
            "sentiment_compound": 0.9538
        },
        {
            "id": "h1oc5vx",
            "score": 1,
            "text": "he knows by now that i'm going to pet him, so the scratching is part of the game. he gives me a taunting look and reaches out to me, as if daring me to touch his belly. when he gets in that mood, even if i touch his cheeks he scratches me. it's a game we play!!!!",
            "title_similarity": "0.6731185",
            "sentiment_compound": 0.7405
        },
        {
            "id": "h1oc9a7",
            "score": 1,
            "text": "Idk man, my cat loves his belly rubbed.",
            "title_similarity": "0.70744544",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1ocg3s",
            "score": 1,
            "text": "Even if a cat likes their belly/chest scratched and trusts me I’m still super mindful. My girlfriend has a sweet cat that loves and trusts me and I love her but I’m still cautious and extremely gentle when petting her belly. I’ll let her sniff my hand first so she isn’t startled and I won’t pet her belly for too long. After a while she will not want to be pet anymore and will give a very light nip or scratch to tell me that.\n\nEither way, she’s still an awesome cat :)",
            "title_similarity": "0.8660455",
            "sentiment_compound": 0.9822
        },
        {
            "id": "h1ochry",
            "score": 2,
            "text": "You know, I’ve had cats for all 28 years of my life and I know this. But I still go for that soft tum tum when it’s exposed to me. And I have many scars to prove it.",
            "title_similarity": "0.61206025",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h1ocj6j",
            "score": 1,
            "text": "One of my cats will let me rub her belly she never bites me, but my big boi is weird.  He will grab my hand and then lick me if he's showing me his belly inside, but if he's outside rolling around he'll let me rub his belly all I want.\n\nAlso yesterday he was sitting like a person licking his belly as he does, and when I walked by I stopped and rubbed his belly, and he just sat there, licked my hand and looked up at me. It made me laugh.",
            "title_similarity": "0.7374693",
            "sentiment_compound": 0.9413
        },
        {
            "id": "h1ocnnu",
            "score": 1,
            "text": "I’m pretty sure my cat thinks the scratching and biting is part of the bonding.",
            "title_similarity": "0.82560515",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1ocr0y",
            "score": 1,
            "text": "Cats are like people. They're all unique. This is absolutely great starting advice for any cat one doesn't know.\n\nThat said, my cat loves it's belly rubbed.",
            "title_similarity": "0.7774503",
            "sentiment_compound": 0.8908
        },
        {
            "id": "h1od1yi",
            "score": 1,
            "text": "Like the ass cheeks ?",
            "title_similarity": "0.22978461",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1odbgr",
            "score": 1,
            "text": "I plunge face first into my cat’s belly 🤷🏻‍♀️",
            "title_similarity": "0.5764638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1odgxf",
            "score": 1,
            "text": "My cat hates belly rubs but it's a case-by-case basis. What I would do is rub its back and slowly scoot down to the stomach with each rub. Though, I never rub the flat stomach directly; just the side. It's pretty chill with that.\n\nIt likes me rubbing its ears though.",
            "title_similarity": "0.83870494",
            "sentiment_compound": 0.7935
        },
        {
            "id": "h1odipr",
            "score": 1,
            "text": "I scratched a neighborhood cat’s belly cause she flipped over on my stroll today… I was lucky to escape unharmed",
            "title_similarity": "0.6990255",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1odj1q",
            "score": 2,
            "text": "don't pet a barn cat's belly, you might lose a hand lol",
            "title_similarity": "0.69272923",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1odj60",
            "score": 1,
            "text": "[Marleau loves belly scratches](https://i.imgur.com/0Un2L1a.jpg)",
            "title_similarity": "0.542595",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1odjt9",
            "score": 1,
            "text": "On the other hand, if a dog shows you it’s belly, you better rub that fucking belly.",
            "title_similarity": "0.55849665",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1odkea",
            "score": 1,
            "text": "I was letting a cat once, and it showed me it's belly. I was still petting its face, but it would paw my hand to scratch it's belly.",
            "title_similarity": "0.7921155",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1odt5f",
            "score": 1,
            "text": "My cat shows affection by bumping his noggin on my chin when he snuggles on my chest. Cute as fuck.",
            "title_similarity": "0.76323056",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1odyi9",
            "score": 1,
            "text": "The cats that I've had since kittens like belly rubs! I would always touch their belly to get them used to it. As a result, a little belly rub with a good armpit scratch is their favorite.",
            "title_similarity": "0.7503408",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h1oe0au",
            "score": 1,
            "text": "Well, my cat let me rub her anywhere on the stomach. I guess it depends on how much the cat knows you/etc.",
            "title_similarity": "0.7923573",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1oedcy",
            "score": 2,
            "text": "My two (littermates) love to have their bellies rubbed like they are dogs! One of them is polydactyl. I swear those extra toes make him extra resourceful! Sometimes he runs ahead, flops down, and demands I pet him with my feet. Sometimes bracing himself on one of my feet while I pet him with the other. Or his body just slides around on the tile. He also grabs your hands (gently) with those big ole paws and leads them to have you pet his face. \n\nThey go outside when I take the dogs out and come back in when we go in. If they didn’t come with litter boxes , I’d love to have 10 more just like them! However, 1st and last cats I’ll ever own.",
            "title_similarity": "0.62059295",
            "sentiment_compound": 0.9428
        },
        {
            "id": "h1oel2h",
            "score": 1,
            "text": "My cat likes belly pets, but only after she has shown her belly and only sometimes.",
            "title_similarity": "0.84477043",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1oewj3",
            "score": 1,
            "text": "Did the cat tell you this?",
            "title_similarity": "0.59525794",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1of072",
            "score": 1,
            "text": "Why is no one asking where the cheeks are on a cats belly?",
            "title_similarity": "0.6003089",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1ofhq2",
            "score": 1,
            "text": "I have two cats.\n\nOne of them actually love belly pets when she shows her belly\n\nThe other one will kill you if you go near her belly",
            "title_similarity": "0.84082794",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1oflr5",
            "score": 1,
            "text": "My cat frikkin adores belly rubs to death, she cringed when I pet her back tho.",
            "title_similarity": "0.73584914",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1ofm8a",
            "score": 1,
            "text": "I am so damn lucky that my cat loves belly rubs over everything else. Does throw me off when I meet other cats though, because I'm so used to him loving it",
            "title_similarity": "0.78481233",
            "sentiment_compound": 0.8013
        },
        {
            "id": "h1ofnvk",
            "score": 1,
            "text": "My cat loves belly rubs like he's a dog its amazing",
            "title_similarity": "0.66629124",
            "sentiment_compound": 0.875
        },
        {
            "id": "h1ofpb3",
            "score": 1,
            "text": "Bruh, I stick my face in there and give that kitteh a zrrbrt. \n\nI've only lost one eye.",
            "title_similarity": "0.3514286",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1ofugb",
            "score": 1,
            "text": "My cat is weird. She rolls over to demand belly rubs. It's her favourite thing",
            "title_similarity": "0.7739767",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1og0mf",
            "score": 1,
            "text": "Depends on the cat. We’ve been touching my cats belly since he was a kitten, and now he’s perfectly comfortable with it. Even belly kisses are okay.",
            "title_similarity": "0.756037",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h1ogg46",
            "score": 1,
            "text": "Yeah we've got a kitty that definitely fits into the exception category, she likes belly rubs so much that she actually gets a little bit pissy and sometimes even a little vicious if you don't pet her belly",
            "title_similarity": "0.76111627",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h1oggav",
            "score": 1,
            "text": "My kitty likes belly rubs. Here's [video proof.](https://youtu.be/82AmGcE6z8I)",
            "title_similarity": "0.6720532",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1oglbw",
            "score": 1,
            "text": "LPT: learn what your cat likes. When my cats roll onto their back, they want serious belly rubs, not side rubs.",
            "title_similarity": "0.8671882",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1ogue0",
            "score": 1,
            "text": "Been a cat owner for 31 years and learned this today. My cats must hate me.",
            "title_similarity": "0.58763367",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1ogue4",
            "score": 2,
            "text": "My chonky bastard doesn't care.  He likes belly rubs.  I can dive face first into his belly and rub my beard on him.  The other two cats have also learned to accept it.  I'll pick up the ginger cat and tickle her belly.  Our skittish black one is the only one that hollars, and then I give ear scritches and she forgets I just attacked her belly after scooping her off the couch.\n\nI was also never a cat person until marriage and somehow we now have three.  I've managed to get them to all peacefully coexist with my 75lb dog.",
            "title_similarity": "0.7949905",
            "sentiment_compound": -0.6662
        },
        {
            "id": "h1ogwgm",
            "score": 1,
            "text": "What the duck are the cheeks? Like it's face? Lol",
            "title_similarity": "0.31265676",
            "sentiment_compound": 0.6868
        },
        {
            "id": "h1ogzgl",
            "score": 1,
            "text": "Sorry, but all 3 of my cats, even the sorta feral one, love belly rubs.  But, they do need to \"present\" the opportunity to you.",
            "title_similarity": "0.758775",
            "sentiment_compound": 0.8737
        },
        {
            "id": "h1oh7rl",
            "score": 1,
            "text": "I always found if you start up at thier chest region they get more comfortable with you touching their belly.",
            "title_similarity": "0.39557102",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h1ohbvd",
            "score": 1,
            "text": "My three cats demand belly rubs, especially my 20 lb butterball.",
            "title_similarity": "0.59254885",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1ohgtv",
            "score": 1,
            "text": "When I get home everyday my cat stands up and puts his paws up to me. I hold him like a baby for about 5-10 minutes and knuckle/scratch his chest. He gets very audibly upset the longer I take to do it.",
            "title_similarity": "0.5871304",
            "sentiment_compound": -0.0972
        },
        {
            "id": "h1ohryt",
            "score": 1,
            "text": "I personally prefer to violate that trust immediately since he insists on walking me up 1 hour before my alarm every day",
            "title_similarity": "0.36032513",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1ohyz3",
            "score": 1,
            "text": "I betrayed my cats trust so much. And I can't make it up to him.",
            "title_similarity": "0.63623106",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1ohzdr",
            "score": 1,
            "text": "My cat is extremely standoffish. She hates me, won't let me pick her up, only tolerates me because I give her food. Been that way since I got her when she was about a year old. Took three days of coaxing before she even purred.\n\nBut almost immediately after getting her, she showed me her belly, and demanded pets. And she still demands vigorous belly rubs. I still can't pick her up, and she won't snuggle with me, but I go to town her on her belly. *Very* rarely bites me, and I can usually tell when she is about to.\n\nCats are fucking weird and I love them.",
            "title_similarity": "0.64204663",
            "sentiment_compound": 0.2212
        },
        {
            "id": "h1oi3kg",
            "score": 1,
            "text": "If I didn’t go straight for the belly, my cats would give me SUCH a disapproving glare...",
            "title_similarity": "0.81418276",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1oi6o6",
            "score": 1,
            "text": "Depends on the cat, I think. The light swats and pretend scratches are playful gestures",
            "title_similarity": "0.79090434",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1oid40",
            "score": 1,
            "text": "If I read this 30 hours ago, it would've been really helpful. Thanks though1",
            "title_similarity": "0.31324708",
            "sentiment_compound": 0.7408
        },
        {
            "id": "h1oikjv",
            "score": 1,
            "text": "Then we have my dude... When he was still alive, no cuddle was invalid, he was loving/trusting to the max. He was completely a dog in a cat's body. I lost him when quarantine began at only 7yrs old and still have a missing part of my life",
            "title_similarity": "0.61966956",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1oilc6",
            "score": 1,
            "text": "Ah,  LPT continues to post fairy tales.",
            "title_similarity": "0.32471156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oiotd",
            "score": 1,
            "text": "Idk my cats love belly rubs and never bit or scratched. Since they were young I always pet them in belly and they loved it.",
            "title_similarity": "0.6515337",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h1oj18z",
            "score": 1,
            "text": "My cat will move my hand to her belly so idk man. Maybe not all cats.",
            "title_similarity": "0.787101",
            "sentiment_compound": 0.3256
        },
        {
            "id": "h1oj3yp",
            "score": 1,
            "text": "Worth considering. I'm skeptical of the \"betrayed trust\" part though. Mine definitely visibly enjoys tummy rubs (sometimes she'll even sprawl out exposing more of her belly and begin purring more intensely). Over time they can be obviously too much stimulation because her tail gets more and more excited to the point where even petting in neck areas can suddenly get her going into swat mode. \n\nEdit: I'm just reading the hair follicles on a cat's belly and tail are hypersensitive to touch which makes jives with my theory.",
            "title_similarity": "0.7892491",
            "sentiment_compound": 0.6962
        },
        {
            "id": "h1oj793",
            "score": 1,
            "text": "Not my boi! He loves his tummy rub!",
            "title_similarity": "0.553581",
            "sentiment_compound": 0.6467
        },
        {
            "id": "h1ojewo",
            "score": 1,
            "text": "I have two cats, from when they were kittens I started rubbing their bellies, now they do full body stretches and I have to rub their bellies or they look at me rather disappointed.",
            "title_similarity": "0.80148673",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1ojket",
            "score": 1,
            "text": "When my cat did this I rubbed around his butt cheeks and he didn't seem to like it cause he bit me. I think he has trust issues.",
            "title_similarity": "0.7949499",
            "sentiment_compound": 0.2937
        },
        {
            "id": "h1ojrkb",
            "score": 1,
            "text": "Just recently adopted a cat, learned this the hard way. My fiancé has been a cat owner all her life and thought it was the funnies thing for me to grasp this",
            "title_similarity": "0.6740314",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1ojsn2",
            "score": 1,
            "text": "As someone who never had a cat, this is really good to know.",
            "title_similarity": "0.47099373",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h1ojszy",
            "score": 1,
            "text": "depends on the cat...one of my cats loves his belly rubbed...the other doesn't",
            "title_similarity": "0.82691324",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1ok06f",
            "score": 1,
            "text": "Mine likes to give me a warning paw before the cattrap. Every once and a while I still do it.",
            "title_similarity": "0.61968917",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1ok21b",
            "score": 1,
            "text": "But .... belly soft",
            "title_similarity": "0.2761162",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oklu3",
            "score": 2,
            "text": "my cat literally just scratched me about an hour ago because of this (usually she doesn't)",
            "title_similarity": "0.63014877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oklw0",
            "score": 1,
            "text": "I face plant my cats belly and he just loves it",
            "title_similarity": "0.6882111",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1okwm7",
            "score": 1,
            "text": "LPT: Everything your cat tells you is a lie, they feed off your succulent ignorance.",
            "title_similarity": "0.7321567",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1okwuk",
            "score": 2,
            "text": "Love these cat tips.",
            "title_similarity": "0.59819245",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1ol0j4",
            "score": 1,
            "text": "My cat loves tummy scratches, she now uses exposing her tummy as a sign of cuteness to entice us so she can run to the food bowl and ask for more. It's a weird reverse Pavlov now.",
            "title_similarity": "0.8071749",
            "sentiment_compound": 0.6041
        },
        {
            "id": "h1ol7p2",
            "score": 1,
            "text": "My cat is one of the one that likes the belly rubs lol.",
            "title_similarity": "0.76583457",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h1olfur",
            "score": 1,
            "text": "I have known a few cats that seemed to be showing their belly but what they were actually doing is scratching their back on the ground/carpet/rug. For those cats, I get both the back paws on palm of my hand and push them short distances so the ground scratches their back.\n\nThere was a neighbor cat where I once lived that loved that being done on concrete. He would immediately plop down for me to give him some pushes. He would roll this way and that to get the concrete scratches where he wanted them.\n\nOne my cats liked it on the carpet. For her I would hold my foot at the right angle so she could get her back paws on it and as I pushed she would also push with her legs to get a little more force.",
            "title_similarity": "0.81447953",
            "sentiment_compound": 0.9366
        },
        {
            "id": "h1olnpx",
            "score": 1,
            "text": "My cat is just fine with the belly getting scratched.",
            "title_similarity": "0.75204414",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1olql7",
            "score": 1,
            "text": "Is this unique to cars? because dogs love belly rubs and from what I've seen on videos, a lot of animals big and small likes it as well.",
            "title_similarity": "0.55550337",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h1olutc",
            "score": 1,
            "text": "'pet around the cheeks'\n\nwhich cheeks",
            "title_similarity": "0.31452104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1om1bq",
            "score": 1,
            "text": "Or if they prefer chin scritches, go for the chin.  My little lady loves chin scritches above all.  My big boy prefers his belly rubbed.",
            "title_similarity": "0.62298644",
            "sentiment_compound": 0.5302
        },
        {
            "id": "h1om2xk",
            "score": 1,
            "text": "Followup LPT: if your cat then grabs your hand, holds it in place and bites and scratches with the back claws, your cat is probably an arsehole.",
            "title_similarity": "0.84388226",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1om6n7",
            "score": 2,
            "text": "My cat displays her glorious, furry belly to tempt me. She wants to bite and claw me as a reminder that should I die in my sleep, she’ll eat my corpse.",
            "title_similarity": "0.73122865",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1om9ey",
            "score": 1,
            "text": "All 6 of my cats like belly rubs so this info is useless to me 🤣 \n\nAt least I know for other cats!",
            "title_similarity": "0.77046514",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h1omrq0",
            "score": 1,
            "text": "Aw I feel bad for you guys. My kitty loves belly scritches.",
            "title_similarity": "0.6629448",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1omt5u",
            "score": 1,
            "text": "My Lily recently started sleeping next to me and pawing my belly and laying on me.She’s 13 pounds and really long so she’s kinda heavy.I love her and I’m so glad she’s picked me.",
            "title_similarity": "0.45653078",
            "sentiment_compound": 0.8311
        },
        {
            "id": "h1omtgr",
            "score": 1,
            "text": "My Lily recently started sleeping next to me and pawing my belly and laying on me.She’s 13 pounds and really long so she’s kinda heavy.I love her and I’m so glad she’s picked me.",
            "title_similarity": "0.45653078",
            "sentiment_compound": 0.8311
        },
        {
            "id": "h1omybq",
            "score": 2,
            "text": "My first 2 cats (Maddie & Eponine, both if blessed memory) definitely used the “show the belly” move as a trap to maul what ever body part got close. My current cat, Maleficent, contrary to her name, rolls over because she wants you to rub her belly. She loves it! She’s the only cat I’ve met who does.",
            "title_similarity": "0.7879586",
            "sentiment_compound": 0.8516
        },
        {
            "id": "h1on9a9",
            "score": 2,
            "text": "I’ve seen 1 cat in my entire career (veterinarian) who liked it’s tummy rubbed. 1. And it had a brain tumor.",
            "title_similarity": "0.6068827",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1oo3iu",
            "score": 2,
            "text": "This makes so much more sense now.  My roommate's cat does this.  Next time i will not go for the belly.",
            "title_similarity": "0.78007483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oob8k",
            "score": 1,
            "text": "I tried this once as well but I’m no longer allowed at Wendy’s.",
            "title_similarity": "0.32965547",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h1ooei1",
            "score": 1,
            "text": "What if the cat shows me its butt hole",
            "title_similarity": "0.7114272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oolfe",
            "score": 1,
            "text": "My cats absolutely love belly rubs",
            "title_similarity": "0.6437776",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h1oosvw",
            "score": 1,
            "text": "Do you mean it’s butt cheeks or face cheeks?",
            "title_similarity": "0.23723024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oozzu",
            "score": 1,
            "text": "My cat loves belly rubs, she’s a whacko",
            "title_similarity": "0.7200288",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1op3hp",
            "score": 1,
            "text": "My dog will roll over, and I'll start to give him belly rubs, but what he REALLY wants is the side of him that's still on the ground scratched, so he rolls over farther so I can get that spot.",
            "title_similarity": "0.60934424",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1opcfq",
            "score": 1,
            "text": "Better lpt when you’re cat is a kitten pet the shit out their belly, tails and touch their paws. As they age they don’t care where you touch them and clipping their nails is easy.",
            "title_similarity": "0.8084165",
            "sentiment_compound": 0.9186
        },
        {
            "id": "h1opct1",
            "score": 1,
            "text": "[And then there's my grandkitty Bandit. ](https://i.imgur.com/Gmixquo.jpg)",
            "title_similarity": "0.32254714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1opd7t",
            "score": 1,
            "text": "It depends on the cats trust level.  If their trust is already well established, you can go ahead and pet the belly.  Just don't try to force the issue.",
            "title_similarity": "0.8401127",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h1opj7j",
            "score": 1,
            "text": "All our cars seem to enjoy then, 2 of our 4 cats purr loudest when they get belly rubs.  Admittedly this is anthropomorphic.",
            "title_similarity": "0.655273",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1opk00",
            "score": 1,
            "text": "I used to smack my friends in the throat when they were talking, randomly, and theyd start gagging. Im an asshole.",
            "title_similarity": "0.5142658",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1opot3",
            "score": 1,
            "text": "I know this is mostly true. But my cats love a light tummy rub. If I stop they nudge themselves closer for more. \n\nMaybe the lot is more, \"don't rub a cats tummy that you haven't lived with since kitten hood and know well\"",
            "title_similarity": "0.8545716",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h1opq9u",
            "score": 1,
            "text": "You have to know your cat. For example my one cat loves belly rubs. She will literally come up to me and lay on her back waiting for a belly rub. If I don’t pet her belly she will continue walking and flopping down on me until I pet her belly. My other cat on the other hand would hate for me to pet her belly. #knowyourcat",
            "title_similarity": "0.8597158",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1optc9",
            "score": 1,
            "text": "2 of my 3 cats don't like belly rubs. I still occasionally do it but I know I'll either get little nibbles or licks before they probably get a bit bitey or kicky. The middle one has such a soft belly, I can't not.",
            "title_similarity": "0.8205053",
            "sentiment_compound": -0.1419
        },
        {
            "id": "h1opwna",
            "score": 1,
            "text": "Cats suck. You suck",
            "title_similarity": "0.5306536",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h1opwv4",
            "score": 1,
            "text": "My cat is 50/50 in terms of belly rubs, one thing he does is lick and sorta chew on my finger nails. It looks similar to how he does it to himself so I think he is grooming me.",
            "title_similarity": "0.7510445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1osie5",
            "score": 1,
            "text": "I'm willing to take that risk",
            "title_similarity": "0.1961906",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1osqm4",
            "score": 1,
            "text": "That sounds like a YP",
            "title_similarity": "0.03906864",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1osv7o",
            "score": 1,
            "text": "When I went with my boyfriend to adopt his cat from the shelter, they said he loved to climb, was very clean, and enjoyed belly rubs. He also hates being held. \n\nUnless he’s in a mood he loves his belly being rubbed! But the belly cheeks makes sense because he can definitely be very picky about where he is pet.",
            "title_similarity": "0.8027903",
            "sentiment_compound": 0.8839
        },
        {
            "id": "h1ot9pl",
            "score": 2,
            "text": "Similar with dogs, actually. \n\nSource: Am vet nurse with additional education in animal behavior",
            "title_similarity": "0.43215454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1otjlx",
            "score": 1,
            "text": "Mine will intentionally position my hand to land on his belly and follows it with scratching and play biting. I'm pretty sure he's broken...",
            "title_similarity": "0.5808135",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1otmu0",
            "score": 1,
            "text": "Asking for a friend; butt cheeks or face cheeks? We’re dog people?! No judgment.",
            "title_similarity": "0.4501101",
            "sentiment_compound": 0.3923
        },
        {
            "id": "h1otozq",
            "score": 1,
            "text": "I’m thankful to have such a docile cat that my SO and I made up a jiggle..”He loves it when I rub his belly, he loves it when I rub his belly..” I mean it’s not a number one hit or anything but our cat doesn’t mind when we rub his belly.",
            "title_similarity": "0.7983689",
            "sentiment_compound": 0.7131
        },
        {
            "id": "h1otva2",
            "score": 1,
            "text": "Wait. I always rub my cats belly, and she bites me every time, but it’s always felt like a playful bite and it never hurts, as if she has no intention of hurting me. \n\nOh no, has she been telling me to “piss off” this entire time!",
            "title_similarity": "0.7572967",
            "sentiment_compound": 0.6568
        },
        {
            "id": "h1ou70f",
            "score": 1,
            "text": "LPT: Stay the fuck away from cats.",
            "title_similarity": "0.5611651",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1oughc",
            "score": 1,
            "text": "Sometimes the chest, right between the front paws, is acceptable but YMMV",
            "title_similarity": "0.5095502",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h1ouro1",
            "score": 1,
            "text": "My cat must be broken...",
            "title_similarity": "0.54497325",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1ouzq5",
            "score": 1,
            "text": "Mine actually loves belly rubs :3",
            "title_similarity": "0.47676775",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h1ovk1g",
            "score": 1,
            "text": "My cats give no shits they love belly rubs",
            "title_similarity": "0.7323229",
            "sentiment_compound": 0.7753
        },
        {
            "id": "h1ovwjw",
            "score": 1,
            "text": "Pet around what cheeks? Ass cheeks? Title is unclear.",
            "title_similarity": "0.3471551",
            "sentiment_compound": -0.7059
        },
        {
            "id": "h1ovxia",
            "score": 1,
            "text": "I have a cat that does this. It took 9 years though!",
            "title_similarity": "0.39217368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ow3l3",
            "score": 1,
            "text": "When my cat does this I rub his belly, then he uses his back paws to push my hand up to his head to give him head scritches. He's trying his best to train me",
            "title_similarity": "0.7742959",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h1ow551",
            "score": 1,
            "text": "2/4 of my cats actively enjoy belly rubs and consistently request them. The other two will occasionally accept one, but they’re not nearly as large fans.",
            "title_similarity": "0.67545927",
            "sentiment_compound": 0.5273
        },
        {
            "id": "h1owpkv",
            "score": 1,
            "text": "This depends on the cat because my cat loves belly rubs when he shows me his belly. That is super trust right there.",
            "title_similarity": "0.82681495",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h1owvwv",
            "score": 1,
            "text": "My cat will allow me to do belly rubs but she will flip out if I go straight for it. OP is right, you gotta build up to that shit. It also helps if you watch your body language and posture. Animals pay special attention to everything you *do* they could give very little shit about what words you're saying. Kneel down before you get to them, let them come to you, don't go directly at them, etc. If you do get to do a belly rub don't just fanatically rub like you're petting a dog, don't feel like you have to make any movement at all. A pat or two, softly, hold your hand there a sec then pull your hand away, let her stand back up, then maybe pet her on the head or shoulders.",
            "title_similarity": "0.87801844",
            "sentiment_compound": 0.8204
        },
        {
            "id": "h1owxkt",
            "score": 1,
            "text": "My cat does this also but prefers foot rubs or slipper rubs.\nP.S I have proof",
            "title_similarity": "0.7884966",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ox2tf",
            "score": 1,
            "text": "Lmao where do people get this stuff from? I'd like to speak to the person who had a one on one with the cat that told them this information.",
            "title_similarity": "0.6697353",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1ox32u",
            "score": 1,
            "text": "I have one that shows the belly specifically for me to pet. It’s adorable",
            "title_similarity": "0.47806293",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1ox69x",
            "score": 1,
            "text": "Is this true? Maybe this is why I hate cats?",
            "title_similarity": "0.68412983",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h1oxbno",
            "score": 1,
            "text": "Source or just making up stories?",
            "title_similarity": "0.18106982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oxjed",
            "score": 1,
            "text": "Also, never use your hands as toys. Make sure your cat knows that your hands are not to be played with. They still may not want the belly rubs, but at least they won't think you're playing with them when you try.",
            "title_similarity": "0.76120734",
            "sentiment_compound": -0.2185
        },
        {
            "id": "h1oxl6s",
            "score": 2,
            "text": "Lol mine also does that and I agree. But, I tend to force them to lay on my lap and rub/play with their belly anyway. Do I have consent? Don't think so. But they eventually got so used to it they won't mind. I guess it's part of a training I do lol. I train them to accept belly rubs.",
            "title_similarity": "0.63290703",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h1oxxid",
            "score": 1,
            "text": "And you know that because you are a cat or a pussy…?",
            "title_similarity": "0.68250954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oxzi9",
            "score": 1,
            "text": "In practice, this is doesn't seem like it's always or even often true. Just from my experience with a handful of cats. My current cat shows me his belly constantly and seems to love getting his belly directly rubbed",
            "title_similarity": "0.7904179",
            "sentiment_compound": 0.7087
        },
        {
            "id": "h1oy1iz",
            "score": 1,
            "text": "My cat Puff is such a love bug. He'll let you pet his belly all day if you want and will plop on the floor immediately should you even mention \"Where's Belly?\"",
            "title_similarity": "0.68213296",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1oy3du",
            "score": 1,
            "text": "Bruh another reason I don’t trust felines. They love me but they are gross and mean and manipulative and cunning and don’t like belly rubs. Fuck anybody who don’t like belly rubs. This is infuriating. Again, I like cats and cats like me but you won’t catch me changin a litter box.",
            "title_similarity": "0.83292323",
            "sentiment_compound": 0.3071
        },
        {
            "id": "h1oy4kf",
            "score": 1,
            "text": "Now that is good to know, thanks for the info.",
            "title_similarity": "0.23077914",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1oy6lr",
            "score": 1,
            "text": "Reading all these comments makes me miss Cats..",
            "title_similarity": "0.6723858",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1oy98h",
            "score": 1,
            "text": "My cats used to do that until they realised that belly rubs > cheeks scratching",
            "title_similarity": "0.7594594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1oyh5o",
            "score": 1,
            "text": "Been petting my cats belly since day one. The most important thing to remember is that them clamping down on your hand is a reflexive action as their belly is completely vulnerable. If my cat ever clamped down on my hand i never attacked or continued as if i'm play attacking her belly. I just stopped moving my hand and never attacked her belly. As the years go by she looks forward to her belly rubs. She'll flop down in front of me and show me her belly for rubs. Once you earn that trust never ever break it.",
            "title_similarity": "0.79337925",
            "sentiment_compound": 0.9163
        },
        {
            "id": "h1oynvy",
            "score": 1,
            "text": "When my cat was born, I rubbed his belly so he knew he could trust me. Ten years later and I'm still rubbing that fluff.  His Mama however does not like her belly petted but appreciates a good shoulder rub.",
            "title_similarity": "0.7482188",
            "sentiment_compound": 0.8719
        },
        {
            "id": "h1oyqwr",
            "score": 1,
            "text": "This kind of infirmation is crucial for people like me who want to make freinfs with cats but extremly lack experince with them.",
            "title_similarity": "0.83653414",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h1oyrn3",
            "score": 1,
            "text": "Even my rescue of 8 years does this. Owning a cat is a constant test.",
            "title_similarity": "0.610871",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1oyxw8",
            "score": 1,
            "text": "Oh yeah, my cat does this all the time!\n\nShe also hisses and screeches at me if I enter the same room as her. I must be doing something else wrong.",
            "title_similarity": "0.71340954",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h1oz0bl",
            "score": 1,
            "text": "Mine loves belly rubs and rib thumps and I'm so grateful for it.",
            "title_similarity": "0.41754022",
            "sentiment_compound": 0.8208
        },
        {
            "id": "h1oz64l",
            "score": 1,
            "text": "Jokes on you. My cat likes belly rubs",
            "title_similarity": "0.74777526",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1ozacm",
            "score": 1,
            "text": "Naw, we call my black cat a \"cat-dog\" because he *loooooves* belly rubs! Always has. He'll run in front of you then flop as if he's asking for them then let's you give him full rock-him-on-the-floor belly scritchies.",
            "title_similarity": "0.68345255",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h1ozf5t",
            "score": 1,
            "text": "Depends on the cat but that is a safe bet. For my boy though it is an invitation to scratch his armpits for some reason, he loves the pit scratches.",
            "title_similarity": "0.8425398",
            "sentiment_compound": 0.872
        },
        {
            "id": "h1ozho5",
            "score": 1,
            "text": "Instructions unclear! Scratched wrong set of cat cheeks and now am bleeding!",
            "title_similarity": "0.6005622",
            "sentiment_compound": -0.6892
        },
        {
            "id": "h1ozt0r",
            "score": 1,
            "text": "I'm cryin. I love cats. So funny.",
            "title_similarity": "0.66000044",
            "sentiment_compound": 0.8122
        },
        {
            "id": "h1p08xu",
            "score": 1,
            "text": "Wrong for mine, my cat bites if I dont pet her belly and purrs if I do",
            "title_similarity": "0.8065658",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1p0xpw",
            "score": 1,
            "text": "I thought it was a trap, and I was making my kitty feel so clever getting me to fall for it every time.",
            "title_similarity": "0.63700956",
            "sentiment_compound": 0.3749
        },
        {
            "id": "h1p0ybe",
            "score": 1,
            "text": "I bury my face in my cats belly and it licks my head. I legit think I have the best cats ever!",
            "title_similarity": "0.7205858",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h1p1369",
            "score": 1,
            "text": "Show me your belly cat",
            "title_similarity": "0.64396507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p17ee",
            "score": 1,
            "text": "My cat is the most cute and docile cat I have ever met. She is very sweet and have never used her claws or teeth to hurt me. Once she showed me her belly and I gave her a kiss there and she made the most sad sound I have ever heard, like she was thinking I was going to eat her. I felt so bad because I realized I broke her trust. I then apologized to her and gave her a treat.",
            "title_similarity": "0.79179186",
            "sentiment_compound": 0.6251
        },
        {
            "id": "h1p1ev3",
            "score": 1,
            "text": "What about dogs what does that mean???",
            "title_similarity": "0.22235245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p1ij3",
            "score": 1,
            "text": "I put my entire face in both my cats’ bellies immediately all the time. It’s rather comfy, and they don’t seem to mind.",
            "title_similarity": "0.5678558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p20u2",
            "score": 1,
            "text": "Oddly enough my cat will come in for belly rubs but only with me.  Anyone else and she'll try to eat their hand.",
            "title_similarity": "0.80746925",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1p21ys",
            "score": 1,
            "text": "Thanks for the tip",
            "title_similarity": "0.228093",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1p24ut",
            "score": 1,
            "text": "So it’s a trap!?  Those little fuckers...",
            "title_similarity": "0.36220706",
            "sentiment_compound": -0.7552
        },
        {
            "id": "h1p252j",
            "score": 1,
            "text": "I pet my cats cheeks, but my finger slipped and I touched his anus. Life is weird in my house right now.",
            "title_similarity": "0.7884507",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h1p2543",
            "score": 1,
            "text": "Is this similar to pooping with the bathroom door open?",
            "title_similarity": "0.49702087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p2al6",
            "score": 1,
            "text": "I think sometimes this can be a playful gesture as well so I will grab a stick or toy or whatever and poke the belly and let them claw and play with that instead of my skin. A gentle approach is always best. My cat is very feral and dominant, I always approach her slowly towards her nose with one finger out and teach my kids to do the same. We let her close the gap and lick or rub against the finger to signal that she is wanting some pets. And we also teach to interpret the meows and different sounds that she makes and what they mean: i.e. back off, let me outside, play with me....etc.",
            "title_similarity": "0.8182713",
            "sentiment_compound": 0.9423
        },
        {
            "id": "h1p2c23",
            "score": 1,
            "text": "“Around the cheeks”?",
            "title_similarity": "0.15529758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p2g9u",
            "score": 1,
            "text": "Some cats fucking love belly rubs though.  One of mine shows you the belly to pet and then turns into long cat so you have more belly to scratch.",
            "title_similarity": "0.8342623",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h1p2mqe",
            "score": 1,
            "text": "Almost every cat I know loves belly rubs. \nWhen they start biting a little bit while still purring, then those are „love bites“, not discomfort! \nIt is normal for cats to give other cats love bites and lick them clean, so that means they accept you as their friend.",
            "title_similarity": "0.8107285",
            "sentiment_compound": 0.9585
        },
        {
            "id": "h1p2s05",
            "score": 1,
            "text": "my cat lets me rub her belly & we both have so much fun (:",
            "title_similarity": "0.67234755",
            "sentiment_compound": 0.793
        },
        {
            "id": "h1p2sdr",
            "score": 1,
            "text": "Followed instructions, pet cat ass cheeks.",
            "title_similarity": "0.70335746",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1p357e",
            "score": 1,
            "text": "smaller cats will fight larger animals by lying on their backs.the cats just trying to bait you in",
            "title_similarity": "0.77734464",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h1p35ib",
            "score": 1,
            "text": "No way he’s saying “that guy can do some belly work come get my belly, deedle deedle deedle”",
            "title_similarity": "0.46685246",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1p36wt",
            "score": 2,
            "text": "While this is true for the vast majority of cats, I personally know a cat that LOVES to have his belly rubbed and will allow you to rub his belly for 20 minutes or more until he finally says he’s had enough.",
            "title_similarity": "0.6933973",
            "sentiment_compound": 0.8455
        },
        {
            "id": "h1p3b8t",
            "score": 1,
            "text": "TIL I am a cat. If I show you my belly, don't touch it - scratch my ears first!!",
            "title_similarity": "0.77686673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p3z54",
            "score": 1,
            "text": "Pet around which cheeks??",
            "title_similarity": "0.23753682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p46s4",
            "score": 1,
            "text": "This explains a lot, thanks for sharing.",
            "title_similarity": "0.19427371",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1p48ye",
            "score": 1,
            "text": "Do you mean the face cheeks or the butt cheeks ? Serious question",
            "title_similarity": "0.2844238",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1p4rtz",
            "score": 1,
            "text": "Mine purrs like a squeaky toy",
            "title_similarity": "0.40787068",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1p4v0j",
            "score": 1,
            "text": "We just got a new cat 2 months ago and he's extremely docile and affectionate. He loves to flop over and expose his belly, and before reading cats didn't like their bellies rubbed, I'd rub and scratch his belly when he did this. Most of the time he doesn't react much when I do, or he'll do a cute stretch with his legs while I'm rubbing. Every once in a while he'll grab the hand that's rubbing his belly and lightly bite my fingers, but it's so gentle you can barely feel it.\n\nHow do I know if my cat is the kind of cat that likes belly rubs? Or can he just be so docile he doesn't do anything when you're doing something to him he doesn't like? For reference, he's the kind of cat you can do pretty much anything to and he won't react much, like the piano cat from the memes back in the day.",
            "title_similarity": "0.7954129",
            "sentiment_compound": 0.9339
        },
        {
            "id": "h1p55cq",
            "score": 1,
            "text": "All my cats past and present let me pet their putt-putt. I’m lucky.",
            "title_similarity": "0.6420014",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1p5769",
            "score": 1,
            "text": "My cats are backwards and actually enjoy getting belly rubs/scritches. I'm almost certain it's because we used to touch their bellies as much as possible when they were kittens to acclimate them.",
            "title_similarity": "0.8125539",
            "sentiment_compound": 0.6133
        },
        {
            "id": "h1p5hxf",
            "score": 1,
            "text": "My cat always rolls to the side for belly rubs, never onto his back",
            "title_similarity": "0.6429591",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p5sd1",
            "score": 1,
            "text": "Depends. Some cats love it.",
            "title_similarity": "0.6496916",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1p5zlx",
            "score": 1,
            "text": "I don't know.. mine loved it, when I did rub his tummy, he'd even stretch out more.. sometimes I'd lie my face on his tummy to hear him purr.. he loved it. I know this because he'd then knead the carpet up and purr even louder.\n\nI guess my Meow was broken. <3",
            "title_similarity": "0.6276657",
            "sentiment_compound": 0.1416
        },
        {
            "id": "h1p607u",
            "score": 1,
            "text": "Husband has 2 cats. I've been rubbing their bellies and haven't died.",
            "title_similarity": "0.61751753",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h1p6cti",
            "score": 1,
            "text": "OHkkaaayyy!!! That explains all the cat videos where a bully rub results in the hand being bitten lol xD",
            "title_similarity": "0.70029265",
            "sentiment_compound": 0.8164
        },
        {
            "id": "h1p6h2n",
            "score": 1,
            "text": "Some cats do enjoy belly rubs as long as you don’t go straight for the belly. If you start on the sides and slowly pet your way towards the belly a lot of cats don’t mind",
            "title_similarity": "0.8821528",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1p6jcb",
            "score": 1,
            "text": "I just go right for it and get my cat’s hiss of approval",
            "title_similarity": "0.65537786",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1p6khq",
            "score": 1,
            "text": "Me and my cat play this game, I can pet her all day on her belly no problem, but as soon as I put a sock on my hand she goes to town on my hand, as soon as the sock comes off back to normal. And no shes not angry, no ears back or nothing just her playing, she knows the sock is to protect my hand I think.",
            "title_similarity": "0.7191675",
            "sentiment_compound": 0.9675
        },
        {
            "id": "h1p70y0",
            "score": 1,
            "text": "Good tip. As a dog owner this is something I didn’t know. My dogs practically demand belly rubs lol.",
            "title_similarity": "0.56948495",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1p76mj",
            "score": 1,
            "text": "My one cat loves belly rubs. Her sister tolerates it for 2-3 seconds.",
            "title_similarity": "0.6541584",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1p78af",
            "score": 1,
            "text": "Another major point for dogs",
            "title_similarity": "0.18164699",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p7ehj",
            "score": 1,
            "text": "The real secret is that they want an exact and undisclosed number of rubs to said belly. That number, which can be any number including zero, was randomly selected and sealed in a pickle jar and sent to a random woman in Hungaria. She has no idea why she keeps receiving pickle jars containing numbers. But, they keep arriving.\n\nYour job is to administer the exact amount of randomly predetermined rubs.\n\nShould you administer one too many rubs? Attack!\n\nShould you administer one too few rubs? Attack!\n\n\nMay the odds forever be in your favor.",
            "title_similarity": "0.6093011",
            "sentiment_compound": -0.7713
        },
        {
            "id": "h1p7f0s",
            "score": 1,
            "text": "Uuh...which \"cheeks\"...",
            "title_similarity": "0.12764478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p7x7j",
            "score": 1,
            "text": "My cat waits for me to put my whole face in her belly and go brrrrr",
            "title_similarity": "0.6925596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p826w",
            "score": 1,
            "text": "Butt cheeks or face cheeks",
            "title_similarity": "0.2313337",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p85tc",
            "score": 1,
            "text": "If a cat scratches you, it's not a bad cat. It's a bad you.",
            "title_similarity": "0.8128425",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h1p872e",
            "score": 2,
            "text": "In the end we found out that it was us who violated the trust all along.",
            "title_similarity": "0.39773992",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h1p8itk",
            "score": 1,
            "text": "is it the same with dogs?",
            "title_similarity": "0.19080025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1p8ncz",
            "score": 1,
            "text": "Just adopted my first cat here, she nudged her head on me after the first couple days, let’s me handle her with trust.",
            "title_similarity": "0.6499831",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1p8x31",
            "score": 1,
            "text": "If you have obtained more trust you can SOFTLY pet the belly.",
            "title_similarity": "0.5692847",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h1p91gv",
            "score": 1,
            "text": "Teach this to kids by explaining it like tickling!\n\nIf you're laying down and comfy and you have your belly out, does that mean you wanna get tickled? \n\nEven if you laugh?\n\nNo! You want nice touches still!\n\nSo does kitty.",
            "title_similarity": "0.6881244",
            "sentiment_compound": 0.8869
        },
        {
            "id": "h1p95dm",
            "score": 1,
            "text": "It very much depends on the cat. For example, I have two cats who both show their bellies when they want attention. The younger one likes having her head and belly rubbed, but will get overexcited too quickly and will run away after a little stimulation. The older one loves belly rubs so much that if he's laying down normally and you start to rub his belly and chest, he will roll over for you to let you rub him more.\n\nIronically, the older one is also chockful of anxiety and will run away if you even walk hear him.",
            "title_similarity": "0.833781",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h1pa2nv",
            "score": 1,
            "text": "My cats actually love belly rubs, but then again they are more tolerant than a lot of other cats. And love cuddles and pets.",
            "title_similarity": "0.78672624",
            "sentiment_compound": 0.9098
        },
        {
            "id": "h1pa98b",
            "score": 1,
            "text": "I have 2 kittys, 1 absolutely loves belly rubs and demands them.  The other will playfully grab your hand and give you love bites/ licks. \nTouching the belly really depends on the cat.",
            "title_similarity": "0.81547713",
            "sentiment_compound": 0.9324
        },
        {
            "id": "h1paxa2",
            "score": 1,
            "text": "really depends on the animal. my cat looooved belly rubs and would be mortally offended and sulk if you ignored the proffered belly.",
            "title_similarity": "0.8254887",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1paxyw",
            "score": 1,
            "text": "Learned that the hard way in high school",
            "title_similarity": "0.12889934",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1pb3ss",
            "score": 1,
            "text": "My cats love belly rubs",
            "title_similarity": "0.6878562",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1pbnwt",
            "score": 1,
            "text": "My cat loves it's belly to be pet and scratched. She also growls like a dog. She's a Siberian forest cat.",
            "title_similarity": "0.7156246",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h1pbo09",
            "score": 1,
            "text": "Yeah my cat doesn't believe in you bullshit rule. He loves belly rubs",
            "title_similarity": "0.83967054",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1pbwbv",
            "score": 1,
            "text": "My cat lets me kiss her belly",
            "title_similarity": "0.69332105",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1pcahm",
            "score": 1,
            "text": "If your cat lets you play with its cheeks, and doesn’t consider that a trust violation, you’ve got yourself one pervy cat",
            "title_similarity": "0.8404612",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1pcith",
            "score": 1,
            "text": "In pretty sure my cat is rolling on her belly for the belly rubs. Can't speak cat,  but I'll wake up and she flops right next to me. \n\nEvery damn day.",
            "title_similarity": "0.6752291",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1pd4bi",
            "score": 1,
            "text": "When my cats show me their bellies I give them lots of compliments on their excellent cuddle rolls. They love it! But pets? I've been fooled by the belly too many times to try again. Unless she's *particularly* cute that day. Then maybe.",
            "title_similarity": "0.7944204",
            "sentiment_compound": 0.7982
        },
        {
            "id": "h1pd7xs",
            "score": 1,
            "text": "I’ve always scratched their bellies and they keep showing me their bellies. I think some cats just like belly scratches..",
            "title_similarity": "0.7333927",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1pdbp0",
            "score": 1,
            "text": "I’m one of the lucky ones in this regard. My cat lets me carry her around on her back like a baby, and I can rub her belly and even bury my face into the silky fur of her stomach with no issues. I can frequently ‘Simba’ her into the air, holding her by the back with her flopped over the two hands, and she will stay there for me half dozing. I am fortunate to have this relationship with my cat, and that she feels so comfortable with me to this degree, especially considering she was just plucked out of a barn. She seemed designed to be the perfect animal companion, and just loves being around me…..at least for now!",
            "title_similarity": "0.75705075",
            "sentiment_compound": 0.958
        },
        {
            "id": "h1pdcnj",
            "score": 1,
            "text": "It's weird. Every cat I've ever had (all rescues) allow the bellyrubz. It's like they understand the Contract.. I feel you and steal your poops? I get to tub tha belly. It's in the Contract. At first they tolerate it,  then grow to love it. I guess I live a charmed life  <3",
            "title_similarity": "0.77507365",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h1pdfqd",
            "score": 1,
            "text": "Men fuck that cat",
            "title_similarity": "0.5224416",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1pdj4o",
            "score": 1,
            "text": "What if it shows me its asshole? Serious question.",
            "title_similarity": "0.29640043",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1pdlon",
            "score": 1,
            "text": "But...but.. fluffy belly",
            "title_similarity": "0.19830044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1pds5f",
            "score": 1,
            "text": "We had a cat that had a desexing scar. She'd roll on her back and you'd rub her belly.. she LOVED it.",
            "title_similarity": "0.7582471",
            "sentiment_compound": 0.6841
        },
        {
            "id": "h1pdxe1",
            "score": 1,
            "text": "Suuure, but when I expose my ‘most vulnerable area' To people they call the police >:(",
            "title_similarity": "0.45962292",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h1pe3eo",
            "score": 1,
            "text": "Your mileage may vary.  This is a good rule of thumb to follow but some cats do love belly rubs/scratches (mine).",
            "title_similarity": "0.8453402",
            "sentiment_compound": 0.8294
        },
        {
            "id": "h1peg5y",
            "score": 1,
            "text": "but I like the scratches, it's how we bond.",
            "title_similarity": "0.45423636",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h1pev5y",
            "score": 1,
            "text": "\"If I'm not supposed to pet it, why is it so soft?\"",
            "title_similarity": "0.50335944",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1pf50b",
            "score": 1,
            "text": "My cat don't care at all.",
            "title_similarity": "0.43422675",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h1pfpe7",
            "score": 1,
            "text": "Yea, mine just purrs and is happy if she gets belly rubs…",
            "title_similarity": "0.5194919",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1pfxjq",
            "score": 1,
            "text": "This is a lie. They bite and scratch because they enjoy hurting you.",
            "title_similarity": "0.5259943",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1ph2hv",
            "score": 1,
            "text": "Sure, but when I expose my most sensitive parts to people to signify trust, I get told to leave the nursery.",
            "title_similarity": "0.62445176",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1pi50p",
            "score": 1,
            "text": "Never knew this! I had a cat do exactly this the other day. Seemed like it liked me, but when I tried to pet her tummy, she started swinging on me and bit me. As an animal lover, Thank you for this! I’m used to dogs where pretty much anywhere is a good spot to pet them.",
            "title_similarity": "0.79532313",
            "sentiment_compound": 0.9676
        },
        {
            "id": "h1pibvk",
            "score": 1,
            "text": "True, but some cats actually like belly rubs",
            "title_similarity": "0.7465303",
            "sentiment_compound": 0.631
        },
        {
            "id": "h1pij4y",
            "score": 1,
            "text": "LOL, when all of my cats show me their bellies it's because they want me to go to town on them, as evidenced by the stretching, top-level purring and paw flexing. They've been that way since they were kittens.",
            "title_similarity": "0.7060534",
            "sentiment_compound": 0.5904
        },
        {
            "id": "h1pikxn",
            "score": 1,
            "text": "Have 2 cats, can confirm. One insists on belly rubs, other will murder you.",
            "title_similarity": "0.7691585",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h1pirvj",
            "score": 1,
            "text": "Another tip: If your cat is licking you and randomly starts to nibble and claw at you, there is a chance they just want to play!",
            "title_similarity": "0.809188",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h1pj4s9",
            "score": 1,
            "text": "Even if i rub the belly my cats dont attack me, they love me",
            "title_similarity": "0.83843577",
            "sentiment_compound": 0.7753
        },
        {
            "id": "h1pkaxp",
            "score": 1,
            "text": "Cats are such complex little things. We had a stray turn up in our garden last summer, she refused to leave and as the hot summer nights turned into the classic cold Nordic winter, we had to start letting her in the house.\n\nShe still lives with us and pretty much every day brings us a mouse (or an occasional rat), to say thank you.\n\nShe is the sweetest thing, loves cuddles and belly rubs, never bites, hisses or scratches, but utterly devastating to the nearby rodent population.",
            "title_similarity": "0.68876815",
            "sentiment_compound": -0.598
        },
        {
            "id": "h1pkdo2",
            "score": 1,
            "text": "My cats have all liked very gentle belly rubs but get mega pissed if I use my fingertips. I suspect cats have ticklish tummies and simply hate being tickled. Hehehehe 🤭",
            "title_similarity": "0.8570344",
            "sentiment_compound": -0.8102
        },
        {
            "id": "h1pl1f4",
            "score": 1,
            "text": "Just to be clear, you mean face cheeks. Not booty cheeks……… right?",
            "title_similarity": "0.35089636",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1pm3zt",
            "score": 1,
            "text": "When people scratch cats bellies, are they referring to the soft bit where our stomachs would be? Or up around the chest/ribs area? My cat would love it when I scratch up and down his chest, he’d stretch right out into a little banana shape.",
            "title_similarity": "0.7660402",
            "sentiment_compound": 0.6767
        },
        {
            "id": "h1pnnc8",
            "score": 1,
            "text": "My cat just scratched me! Why would you have me try to rub his butt cheeks instead of his belly?!",
            "title_similarity": "0.792616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1pns2s",
            "score": 1,
            "text": "I kinda like going for it and getting their paws to grab me, though. They usually don’t actually scratch, and if they do, it’s my fault. But I just play with them like that. Maybe they hate it, though? Idk.",
            "title_similarity": "0.7112286",
            "sentiment_compound": -0.1397
        },
        {
            "id": "h1pnyeq",
            "score": 1,
            "text": "My sisters cat will roll over and show you her belly, and actually let you pet her belly. She actually gets upset that you stop and will try to pull your hand back to her belly gently. She has never bitten or scratched anyone including my sisters two children. Nicest and sweetest cat I’ve ever seen, and I’ve grown up around cats all my life.",
            "title_similarity": "0.7687068",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h1pomp4",
            "score": 1,
            "text": "The same is true with husbands",
            "title_similarity": "0.24442177",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1poncy",
            "score": 1,
            "text": "Jokes on you, my cat loves his tum tum being rubbed heck, ill even lay down next to him and stuff my faces in his tum tum for like 10 minutes.",
            "title_similarity": "0.6197962",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1pop3c",
            "score": 2,
            "text": "I'm never sure about this one.\n\nMine both purr and roll around like they're enjoying it. Though after a while they'll start grabbing the hand and even start biting (gently).",
            "title_similarity": "0.5620479",
            "sentiment_compound": 0.879
        },
        {
            "id": "h1pp7pl",
            "score": 1,
            "text": "Mine loves belly rubs tho haha",
            "title_similarity": "0.4687639",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1pppdd",
            "score": 2,
            "text": "If we don’t scratch our cats belly when he shows it he’ll grab your hand and put it there.  \nNot all cats are the same.",
            "title_similarity": "0.8284816",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1ppq5h",
            "score": 1,
            "text": "Weird both of my gremlins do this but when I touch their belly’s there’s perfect fine with it",
            "title_similarity": "0.63724715",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h1ppybc",
            "score": 1,
            "text": "My cat yells at me whenever I pick him up by the scruff of his belly.",
            "title_similarity": "0.68056107",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1pq648",
            "score": 1,
            "text": "My cat loves belly scratchins",
            "title_similarity": "0.7266334",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1pqfxv",
            "score": 1,
            "text": "Face cheeks? Butt cheeks? More information is required!",
            "title_similarity": "0.22835581",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1presl",
            "score": 1,
            "text": "Face cheeks? Butt cheeks? Need more info…",
            "title_similarity": "0.25982177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1psti2",
            "score": 1,
            "text": "My cat is so 50/50 on this like either he likes it or he hates it",
            "title_similarity": "0.720318",
            "sentiment_compound": 0.4166
        },
        {
            "id": "h1psxft",
            "score": 1,
            "text": "One of my cats shows her belly regularly so I can scratch her torso.",
            "title_similarity": "0.71206236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1pv01k",
            "score": 1,
            "text": "We adopted the smallest Persian cat I’ve ever seen 2 years ago, she was the sweetest thing I’ve ever met. She had been thrown out of a moving car on a highway but survived and after nursing her and helping her get through her trauma began showing us her belly. She slept in bed with us, used the pillow for her head and body under the covers like a human from the first day we brought her home, but didn’t show the belly for a little while after. She LOVED belly rubs after that. Just soft little tickles. She was the best thing ever. She unfortunately got sick and which we found was due to a heart condition and she went down hill extremely quickly in April. I miss her so much it hurts.",
            "title_similarity": "0.6627211",
            "sentiment_compound": 0.9307
        },
        {
            "id": "h1q1zql",
            "score": 2,
            "text": "This is the exception not the rule because cats are unpredictable assholes who constantly change the rules of engagement when it comes to pets.",
            "title_similarity": "0.72892654",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1q2ukr",
            "score": 2,
            "text": "My cats hate when you rub the middle of there belly but love it when you rub like right between their arms",
            "title_similarity": "0.8092912",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h1q2ygg",
            "score": 1,
            "text": "This makes so much sense. I always just saw it as a trap cats set for me. And yet I fell for it every darn time. \n\nThank you!",
            "title_similarity": "0.67507493",
            "sentiment_compound": 0.126
        },
        {
            "id": "h1q3j1r",
            "score": 2,
            "text": "I feel like this is subjective. I have a cat that's basically a dog who runs to see me whenever I leave my room and lays on their back for me to pet their belly. _Not_ petting that belly would be a violation of trust and probably my right to exist.",
            "title_similarity": "0.824366",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1q4d04",
            "score": 1,
            "text": "Man the cat I live with did this the other day and I got my leg dangling over the edge of my chair and I was giving her body rubs with my foot and At that point I accidentally hit her stomach and felt a prickle. My heart ached for it wad then I realized that I had unknowingly overstepped my bounds... but I couldn't even apologize to her in a way she'd understand.",
            "title_similarity": "0.76648515",
            "sentiment_compound": -0.0372
        },
        {
            "id": "h1q4oh1",
            "score": 1,
            "text": "Did cats tell you that?",
            "title_similarity": "0.56406546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1q4wek",
            "score": 1,
            "text": "The butt cheeks or the face cheeks?",
            "title_similarity": "0.20764399",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1q4yrb",
            "score": 2,
            "text": "Most of the cats I've ever owned have been happy to have their chests scratched when they roll on their back.  But not their bellies.",
            "title_similarity": "0.7876715",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h1q4yuo",
            "score": 1,
            "text": "If a cat shows me their belly I’ll expose their entrails...Should have trusted your instincts kitty.",
            "title_similarity": "0.88060355",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1q5413",
            "score": 1,
            "text": "And then they get their back feet in motion,  serious scratching!",
            "title_similarity": "0.27647907",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h1q5rqt",
            "score": 2,
            "text": "It's also a sign they want to play. Easy to confuse the two!",
            "title_similarity": "0.4415711",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h1q8q3g",
            "score": 1,
            "text": "When my fluffy girl shows her tummy, it's on! All she wants at that point is for me to rub her belly until she falls asleep or starts grooming my hand/arm. She LOVES it. Just turns into a little purr monster. I know this is unusual for cats but the more I do it the happier she gets lol.",
            "title_similarity": "0.7906115",
            "sentiment_compound": 0.9064
        },
        {
            "id": "h1q8qyd",
            "score": 2,
            "text": "I go with Calvins model whenever my buddys cats show me their tummies. Face first, right into the tummy. It’s called fuzz therapy.",
            "title_similarity": "0.73635185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1q96g3",
            "score": 1,
            "text": "I rubbed my cats bellies when they were small kittens, now they don’t mind at all. That’s all it really is.",
            "title_similarity": "0.7386136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1qaidx",
            "score": 2,
            "text": "When I was younger I was dribbling a basketball down the street. A stray ran up to my leg and was being very affectionate. I began to pet the kitty and it soon rolled over onto its back. I tried to rub its belly and the cat turned into Sabrewulf and cat scratch ultra combo’ed my hand. I yelled,jumped back and then punted the basketball that I had out of anger.",
            "title_similarity": "0.66750765",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h1qi9ad",
            "score": 2,
            "text": "Oh, I've always thought they were playing well then now I know I want my cat to give me another change to show she can trust me now lol",
            "title_similarity": "0.7411247",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h1qiduk",
            "score": 1,
            "text": "My cat still scratched and bit me... maybe I went for the wrong cheeks",
            "title_similarity": "0.75489044",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1qjwu6",
            "score": 1,
            "text": "There’s no way I’m not petting the belly. Even if it means I risk my life, it’s way too cute/soft to avoid it.",
            "title_similarity": "0.59201187",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h1qp3fo",
            "score": 1,
            "text": "My cat loves belly rubs. Doesn’t scratch or bite just wants more ! He’s such an angel. We’ve had him since he was born. I used to own his mother until she passed.",
            "title_similarity": "0.7500082",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h1qr02r",
            "score": 1,
            "text": "Just cuddle the testicles.",
            "title_similarity": "0.40830034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1qr55a",
            "score": 1,
            "text": "What are you saying?  \nhttps://youtu.be/YMLnKWihRuY",
            "title_similarity": "0.18495102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1rgwbc",
            "score": 2,
            "text": "This actually works, I saw this in a cats video in YouTube some time before, and my experience with that is: My aunt use to have a cat, and everytime he showed me his belly, I'll go for the belly, I have scratches that will go in months (Thanks aunt for cutting his nails every few months, otherwise I will still have that scars, btw, she use to go to someone that cut his nails without breaking the bone, because she knew that breaking the bone will probably conclude in suffering for him) and he will show me his belly again in like a week, when I learned this and started scratching his neck instead of his belly, I were like 4 months seeing him everyday and he almost never attack me. And, my experience with a cat that I have just seen 1 time is that I was with the cat and he just showed me his belly, I go for his head, he doesn't attack me, but stand up, next time I just don't do nothing, and I think that's what he wanted, because he just continued that way some time and then go for me (not to attack me). I know some cats will scratch and bit if you are closer to them that 1 meter (My aunt's cat use to be like that till he was like 6 years old), so if the cat doesn't approach to me, I don't, and if the cat approach to me in a violent way, I don't sit down.",
            "title_similarity": "0.6962796",
            "sentiment_compound": 0.7576
        },
        {
            "id": "h1wvftt",
            "score": 1,
            "text": "It’s not even fair because if is the MOST SOFT PART OF THE CAT. I have learned if I go in with my face, she doesn’t seem to mind.",
            "title_similarity": "0.84856594",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h21x66v",
            "score": 1,
            "text": "If my cat shows me his belly and I don’t rub it, he attacks 😂",
            "title_similarity": "0.8048995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h260b60",
            "score": 1,
            "text": "One cat I care for is a belly boy will roll over and wants all the belly scratches you can give! The other one wants you to touch his head and butt! There sister is like look but do not touch me!",
            "title_similarity": "0.81740147",
            "sentiment_compound": 0.5756
        },
        {
            "id": "h2bifh9",
            "score": 2,
            "text": "Which cheeks we talking about here?",
            "title_similarity": "0.17293817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2celhv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.085112505"
        },
        {
            "id": "h6eoybq",
            "score": 2,
            "text": "I didn't know this about cats, probably why i have so many scars! We actually featured your tip on our podcast. Check it out! [Ep. 47 Mazda Miata Men](https://anchor.fm/justthetipspodcast/episodes/Ep-47-Mazda-Miata-Men-e149ipp)",
            "title_similarity": "0.634261",
            "sentiment_compound": 0.0
        }
    ]
}