{
    "LPT: When you tell someone you need to speak to someone at a later time, let them know what the subject matter is. It saves the person you need to speak with a lot of anxiety.\nFor me personally, I already have a lot of things going on at any given moment and struggle with anxiety. Instead of saying “hey we need to talk” and refuse to give any context, say “hey when you get a chance I’d like to talk to you about X” or “hey later on I’ve got a couple questions about Y”. If people would let me know what needs to be discussed, I would have a better chance to have an intelligent discussion as opposed to entering the situation already on edge.\n\nEdit: Damn. Went to sleep with 10 updoots, woke up with 25k and a ton of awards. Thank you all for the internet points, random strangers. Hopefully this is 25k fewer people that needlessly give someone crippling anxiety": [
        {
            "id": "h1vjr2d",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.68157923",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h1wby47",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.23730439"
        },
        {
            "id": "h1x2wih",
            "score": 1,
            "text": "It’s so weird to be worried about someone’s anxiety.",
            "title_similarity": "0.60406613",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h1w5smg",
            "score": 0,
            "text": "This is absolutely true. Especially if you've got something to hide. Like anytime my boss says this to me in person or in an email I'm in full panic mode. Like was my sexual harassment finally called out? Was I finally caught doing drugs in the bathroom? Stealing supplies? Embezzling money? Just tell me already motherfucker!!!!!",
            "title_similarity": "0.5588341",
            "sentiment_compound": -0.9159
        },
        {
            "id": "h1w7cfr",
            "score": 2,
            "text": "Screw that! I WANT the other person to be nauseated from anxiety if I have to pull the “We need to talk” card out of the bag!",
            "title_similarity": "0.71791273",
            "sentiment_compound": -0.1658
        },
        {
            "id": "h1w80vn",
            "score": 10,
            "text": "Ok, next time I’ll do a “we need to talk about our incoming breakup”, or “we need to talk about how your father killed himself”.\n\nThere any many reasons why you would want to talk without saving what before hand, but yeah thats exactly why its anxiety inducing.\n\nIf its about what your plans are for the weekend, then yeah maybe start with that.",
            "title_similarity": "0.73250604",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h1vruqo",
            "score": 16,
            "text": "LPT: The people that talk to you in cryptic vague terms want you to feel anxiety because it makes them feel power over you. You should just cut them out of your life instead.",
            "title_similarity": "0.6653671",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1w9fbb",
            "score": -3,
            "text": "Depends on the situation. I think telling them what the matter is, can give them more anxiety. I like to keep it vague as possible even for small things just for fun. The smaller the issue, the more serious and big deal I make it out to be.\n\n“Hey, we need to seriously talk about something urgently as soon as possible, but nothing to stress too much over”\n\n“Would you like pizza or Chinese tonight?”",
            "title_similarity": "0.7672648",
            "sentiment_compound": 0.7898
        },
        {
            "id": "h1wa1xp",
            "score": 1,
            "text": "This is a great LPT. I'd like to add (after reading a TIFU yesterday) ALWAYS declare when you are on speaker phone!",
            "title_similarity": "0.541922",
            "sentiment_compound": 0.784
        },
        {
            "id": "h1wda59",
            "score": 12,
            "text": "*person with anxiety tries to tell others to stop giving them anxiety",
            "title_similarity": "0.6827533",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1wep4p",
            "score": 0,
            "text": "THIS. I wish everyone could see this, especially my mom.",
            "title_similarity": "0.55161256",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1yac7v",
            "score": 0,
            "text": "This needs to be plastered everywhere, especially in a workplace. It doesn't even take 5 minutes to let someone know the context of what you need to discuss. Also gives time to mentally prepare for a conversation tbh.",
            "title_similarity": "0.49999905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ye3v1",
            "score": 0,
            "text": "I agree 100% this is one of the BEST lpt ever.",
            "title_similarity": "0.25801855",
            "sentiment_compound": 0.8143
        },
        {
            "id": "h1z3mah",
            "score": 0,
            "text": "Yes, This, so much, yes",
            "title_similarity": "0.25412422",
            "sentiment_compound": 0.6887
        },
        {
            "id": "h1w730t",
            "score": 6,
            "text": "For fucking real oh my god.\nA buddy of mine does this and pisses me off.\n“Hey man we need to talk.”\n“What is it?”\n“Can I call you tomorrow?”\n“Wtf just tell me now.”",
            "title_similarity": "0.7469819",
            "sentiment_compound": -0.168
        },
        {
            "id": "h1wbhrc",
            "score": 1,
            "text": "THIS. PEOPLE NEED TO KNOW THIS.",
            "title_similarity": "0.48010114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xyswf",
            "score": 1,
            "text": "After having a close friend go through cancer..the utter disregard for a patients mental  health is just beyond me .\n\nHe had scan with some serious consequences.\n2 days later a letter arrives for an appointment at a cancer centre with a doctor he didnt know.\n\nHe barely slept for a week after being completely unable to find out what it was for.\n\nHe sat in the waiting room a nervous wreck...walks in and it was to tell him they were going to change his assigned doctor.\n\nI was with him and had to stop myself from punching someone in the face.\n\nHalfway through the meeting...after everyone calming down..he logs on to a database and casually says, like he was talking about the weather.\n\nOh the bone scan is clear by the way.\n\nMy friend nearly collapsed in relief.\n\nI really dont get their process at all",
            "title_similarity": "0.42786303",
            "sentiment_compound": 0.6712
        },
        {
            "id": "h1wk150",
            "score": 2,
            "text": ">LPT: When you tell someone you need to speak to someone at a later time, let them know what the subject matter is. It saves the person you need to speak with a lot of anxiety.\n\nPlease forward this to my boss the motherfucking asshole",
            "title_similarity": "0.8469157",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1vo0rr",
            "score": 9,
            "text": "Shitty bosses hate this one weird trick!",
            "title_similarity": "0.4111005",
            "sentiment_compound": -0.8588
        },
        {
            "id": "h1wcce1",
            "score": -4,
            "text": "I do the opposite intentionally whenever I have good news or neutral news. \n\n\"I need to have a discussion with you when you have a little time.\"\n\n\"I MADE CHEESECAKE WANT SOME?\"",
            "title_similarity": "0.65798306",
            "sentiment_compound": 0.6037
        },
        {
            "id": "h1w9rgl",
            "score": -4,
            "text": "That just takes the fun out of it",
            "title_similarity": "0.43091565",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1vk2mu",
            "score": 21,
            "text": "Amen. This is so relatable",
            "title_similarity": "0.25163764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w9eoc",
            "score": 8,
            "text": "I usually just reply with \"Yes, I need to talk to you too.\"  They tell me what it's about right away.",
            "title_similarity": "0.64850664",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1w6ka1",
            "score": 11,
            "text": "Assholes thrive on making people sweat like that. I've started just rejecting having said conversation if they can't be arsed to give me a subject first.",
            "title_similarity": "0.6970346",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h1w3w97",
            "score": 29,
            "text": "The owner of my company called me up the other day at 2:00 pm and said \"Hey, I want you to leave the office and meet me at 3:00 pm, but don't tell anyone where you're going.\" \n\nOMG - the stress until I found out what it was about! I had imagined everything from \"You're fired!\" to \"You're getting a humongous raise!\"\n\nTurns out the CEO is leaving in July - he doesn't want anyone else to know.",
            "title_similarity": "0.4900075",
            "sentiment_compound": -0.8947
        },
        {
            "id": "h1vqgvs",
            "score": 90,
            "text": "prompt them. any time anyone says that to me i immediately say \"about what?\". usually you can at least get the idea out of them if not just get the whole conversation out of the way.\n\npeople completely misjudge how long talking takes. you see it all the time in offices particularly. people will schedule half or full hour long meetings and invite 15 people for something that really only needed 5 minutes and 3 of them. all in the name of \"transparency\"...if you want to be transparent, send it in an email so it's in writing. \n\n/endrant",
            "title_similarity": "0.6108459",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1vmut7",
            "score": 44,
            "text": "[deleted]",
            "title_similarity": "0.23730439"
        },
        {
            "id": "h1vkhnt",
            "score": 48,
            "text": "I hate when your spouse/SO says, \"We need to talk.\"",
            "title_similarity": "0.5921653",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1vx7l0",
            "score": 2501,
            "text": "My college girlfriend just before turning her phone off and going into a two hour test: \"Hey, we need to talk\"\n\n*Two hours of panic*\n\n\"What are we having for dessert tonight? I want ice cream\"\n\nWe did end up having a talk about the implications of saying \"we need to talk\".\n\nEdit: Some of you poor fuckers have been hurt (or hurt yourself with your own stupidity) over the years and can't seem to understand that other people might have had different life experiences. We were both young, this was her first serious relationship,  and we had a good laugh once we cleared the air.  Not every girl is as toxic as the one's you've had the misfortune to date, and some of us have had healthy relationships.  Maybe if you stopped expressing your distaste for women on the internet you would have better luck in life.",
            "title_similarity": "0.4960696",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1vytvn",
            "score": 200,
            "text": "People texting \"please call me when you're available\" makes up at least 33.334% of my anxiety.",
            "title_similarity": "0.4802672",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1vyk5q",
            "score": 107,
            "text": "Don't contact someone on slack saying \"can we talk\" just ask your fucking question and give the person the chance to answer in slack or get on a call if needed.",
            "title_similarity": "0.61840594",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1w2lyi",
            "score": 740,
            "text": "As a couple others have mentioned, it goes for romantic relationships, too.\n\nSadly, \"We need to talk,\" carries a pretty negative, anxiety-filled implication.\n\nUsually, it should be, \"Hey, we need to talk later -- nothing serious, just plans and details that are going to take more than five minutes, and I don't want to be interrupted by all the other people who are around us right now.\"",
            "title_similarity": "0.78244144",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1vml7t",
            "score": 923,
            "text": "I hate out of the blue, cryptic meeting invites with no agenda or topic, especially when it comes from the superiors you don't usually interact with. When it shows up on my calendar, I'd be convinced it would be to  break bad news. But in more than one occasion, they have been to announce good news. Guess they do this cos they want to break the good news and surprise me/us during the meeting. Please don't do it..",
            "title_similarity": "0.691941",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h1vrne8",
            "score": 2916,
            "text": "\"Hey, I need to speak to you later. It's about that massive fuck-up you don't seem to know about.\"  \n\n\nAnxiety solved!",
            "title_similarity": "0.8154805",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h1vobqv",
            "score": 3166,
            "text": "\"Hey I want to talk to you at 5PM about your job situation\"\n\n\n5PM:\n\"I wanted to let you know I approved that afternoon you need to take off next week\"",
            "title_similarity": "0.45720464",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h1w771v",
            "score": 648,
            "text": "My dad always texts me “call me”. I ALWAYS assume the worst (growing up I caused a lot of trouble and usually got caught). Now whenever I call him he’s just like “wanna go for lunch?”, or something super casual. But in my head before I call him I’m wondering what has he found out this time",
            "title_similarity": "0.5907819",
            "sentiment_compound": 0.1406
        },
        {
            "id": "h1vke4m",
            "score": 47,
            "text": "SLPT : don't tell them what the topic is so that even if you forget they will call you to ask what you wanted to speak about",
            "title_similarity": "0.67508096",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1vprhe",
            "score": 29,
            "text": "Do you have a moment to speak about your car insurance?",
            "title_similarity": "0.37955865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vqp2a",
            "score": 132,
            "text": "I lose sleep over next day, vague meetings.",
            "title_similarity": "0.46473995",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1vui54",
            "score": 9,
            "text": "I need to talk with you later, about *things*.",
            "title_similarity": "0.69596314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w02hw",
            "score": 33,
            "text": "OP I need to speak with you later.",
            "title_similarity": "0.6617828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w3zmf",
            "score": 74,
            "text": "Hey, we need to talk later about how I'll be breaking up with you, when we talk later.",
            "title_similarity": "0.7251533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w4mk0",
            "score": 4,
            "text": "Oh btw bob, could you tell your daughter i need to talk to her again tomorrow, it's about std's",
            "title_similarity": "0.5612055",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1w80sr",
            "score": 2,
            "text": "Lol especially your boss!",
            "title_similarity": "0.42842203",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h1w8422",
            "score": 1,
            "text": "Meeting invite for a “quick chat” 🙃",
            "title_similarity": "0.5505572",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1w8lmf",
            "score": 71,
            "text": "Got the message the doctor needs to discuss the results of the biopsy late Friday, call very first thing Monday, get an appointment for Wednesday, wait to find...he just wanted to tell me the biopsy was clear, even though he explicitly said he would only call me back if there was a problem.",
            "title_similarity": "0.54618955",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h1w99ot",
            "score": 3,
            "text": "Or makes them way more anxious when you say 'We need to talk about your future at this company'.",
            "title_similarity": "0.7147062",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h1w9h1v",
            "score": 2,
            "text": "My boss tried so much to be a manager and a friend. So I had to guess whether a \"wil you be free for 10 minutes at 1pm\" whether it'll be a telling off or advice on buying a new car.",
            "title_similarity": "0.5149703",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h1w9r9r",
            "score": 4,
            "text": "Omg. Are you me?\n\nI can't tell you the amount of times people have done this to me. \n\nThe one that sticks out the most is a text I received from an ex girlfriend (who was supposed to be a bridesmaid). She said on a Monday morning we needed to talk and we only met up on Tuesday evening. I didn't eat or sleep in that span of 24 to 48 hrs lol.\n\nMind you, it hasn't happened since I finished my therapy but it used to stress me *the fuck* out.",
            "title_similarity": "0.43348086",
            "sentiment_compound": -0.8201
        },
        {
            "id": "h1wa9zx",
            "score": 6,
            "text": "The second someone tells me they need talk to me, my heart starts pounding in my chest and I get a pit in my stomach. Source of unexplainable anxiety for me. As I’ve gotten older, I insist they tell me now. Or, at least what it’s about. I won’t let it go until they tell me. Saves me a lot of anxiety.",
            "title_similarity": "0.8291937",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1wabs8",
            "score": 3,
            "text": "Yes! I hate it when people leave me hanging",
            "title_similarity": "0.40149716",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h1wawwu",
            "score": 3,
            "text": "Oh my gosh! Yes!! I agree with this so much!  If someone just tells me, \"I need to talk to you,\" I will stress so much and worry about what I did wrong. That is a surefire way to give me majority anxiety.",
            "title_similarity": "0.78507566",
            "sentiment_compound": -0.6939
        },
        {
            "id": "h1wb3g0",
            "score": 2,
            "text": "Family out here talking facts",
            "title_similarity": "0.36786035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wbavq",
            "score": 18,
            "text": "Meeting declined until I know the topic.",
            "title_similarity": "0.643051",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wbdrs",
            "score": 3,
            "text": "My boss was absolutely terrifying and she knew she scared the crap out of me but she also liked me most of the time. When she needed to talk to me she would have to say \"come talk to me today...you're not in trouble.\"",
            "title_similarity": "0.64792",
            "sentiment_compound": 0.3271
        },
        {
            "id": "h1wbont",
            "score": 3,
            "text": "Oh my... YES. Just had this hapoening to me today. It was just a nornal meeting where they wanted to know the steps they had to follow to get the work done but how many second takes to write up a brief sumary?\n\nI would have prepared all the docs and info and the meeting could have taken just 2 minutes.",
            "title_similarity": "0.5998675",
            "sentiment_compound": 0.5524
        },
        {
            "id": "h1wbrzq",
            "score": 5,
            "text": "I have a a strict “never tell me you need to have a word with me later” policy with SO’s and family. I try and have very open lines of communication at all times.",
            "title_similarity": "0.5610779",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wbw04",
            "score": 3,
            "text": "Yes! This! I’m a teacher, and my principal has emailed me multiple times on Fridays needing to speak with me on Monday. Makes me so nervous!",
            "title_similarity": "0.48492402",
            "sentiment_compound": -0.2305
        },
        {
            "id": "h1wc3aw",
            "score": 3,
            "text": "I remember that one time our head of HR came around and asked me to come along to see the CEO.\n\nTurned out they wanted to talk about recruiting strategies for IT, but boy was I worried for a few minutes.",
            "title_similarity": "0.54491",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1wcy9n",
            "score": 2,
            "text": "See me in my office before you get off.  I'm gonna fire you",
            "title_similarity": "0.45981914",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1wd37o",
            "score": 1,
            "text": "Couldn't agree more!!",
            "title_similarity": "0.40507883",
            "sentiment_compound": -0.4007
        },
        {
            "id": "h1wd5ah",
            "score": 6,
            "text": "I blame this on my mom, there were never any good talks and almost always ended up with her so angry (because she would like HERSELF up) that she'd hit, punch, or drag me by my hair across the house. Now whenever someone says \"we need to talk\", my anxiety spikes because I'm expecting to be hit or something.",
            "title_similarity": "0.5502788",
            "sentiment_compound": -0.8461
        },
        {
            "id": "h1wd8x5",
            "score": 13,
            "text": "Yup, I worked for a Big Bank for years and last year my manager tells me out of the blue. “Hey tomorrow come in at X time. I need to talk to you.” I’m like “sure.. what about?” Doesn’t tell me.  Anxiety goes through the roof! I get home and I tell my wife and joke around with her “probably getting laid off or something..” \n\nWell, let me tell you. I wasn’t wrong. Got to work at X time and got let go lol. \nI get that legally he couldn’t tell me till that day. but that shit sucked",
            "title_similarity": "0.49763864",
            "sentiment_compound": -0.8221
        },
        {
            "id": "h1wd9uk",
            "score": 6,
            "text": "Yeah, no more \"See me after class,\" Mr. Konkel. You weren't the worst teacher but that shit gave me a heart attack.",
            "title_similarity": "0.5424836",
            "sentiment_compound": -0.2739
        },
        {
            "id": "h1wdfyq",
            "score": 2,
            "text": "Depends on the nature of the conversation, if it's something regarding their performance or disciplinary, it may create more anxiety",
            "title_similarity": "0.6848455",
            "sentiment_compound": 0.0276
        },
        {
            "id": "h1wdlat",
            "score": 3,
            "text": "Yeah, when my collegues call and start the conversation with “have you got a minute?” I get instantly suspicious because it smells like problems. I’m sure they can tell I’m reluctant to talk with them, until they tell me what the subject is. Then I usually start to ease up. \n\nJust too many bad experiences. At least I rarely get anxious anymore.",
            "title_similarity": "0.77737594",
            "sentiment_compound": -0.1179
        },
        {
            "id": "h1wdo3r",
            "score": 23,
            "text": "Especially if you are in a supervisor position. I didn't realize I used to do this to my team. Reason was that I was hoping they would remind me that we needed to talk at a later time and I didn't have time right then. Then one of my guys blurted out during the meeting that we were having that he was thankful he wasn't fired. I was confused and asked him why they thought they were going to be fired. He told me it was because of the way I said we needed to talk. I have never done it after that. I always give them the reason of why we need to talk and to send a meeting invite with that reason",
            "title_similarity": "0.68838567",
            "sentiment_compound": 0.6278
        },
        {
            "id": "h1wdpvp",
            "score": 2,
            "text": "I always just tell them that there’s no need to worry it’s not a big deal.",
            "title_similarity": "0.39587337",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1wdxiq",
            "score": 15,
            "text": "\"We need to talk\" plus a period of non-communication until the talk is the biggest anxiety inducing thing ever. Some people can go mad in the in-between period.",
            "title_similarity": "0.74153113",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1wdyic",
            "score": 4,
            "text": "This is exactly what i was saying to my husband the other day. I like to text people with a simple greeting and then getting straight to the point about what i’d like to discuss over the phone-call later when we have one. Not only does it not give the other person anxiety, it actually helps them understand too that you don’t or won’t waste their time. Many people who text me usually start with the silly small talk which makes me reply them waayy later than i ever would if they actually got straight to the point. Sometimes i don’t even reply",
            "title_similarity": "0.7536216",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h1we3lb",
            "score": 4,
            "text": "As a former industrial mechanic, the worst phrase anyone could utter was \"Spasticpoodle, can you come here? I need to show you something\"\n\nNo, fucker, TELL ME WHAT THE PROBLEM IS, so I can come with the right tools to try and fix the problem. It does neither of us any good for me to traipse over to the building you're in, see what the super obvious problem was that you could have described in 7 words, then head back to my shop to get the supplies.\n\nOr, at least tell me what machine the problem is in, or if the roof is leaking...",
            "title_similarity": "0.5422611",
            "sentiment_compound": -0.9206
        },
        {
            "id": "h1we4ej",
            "score": 3,
            "text": "Nothing was worse in elementary school than “we need to speak after class” 😂",
            "title_similarity": "0.52780783",
            "sentiment_compound": 0.6656
        },
        {
            "id": "h1we8og",
            "score": 1,
            "text": "Yes please. Everyone do this please",
            "title_similarity": "0.2859339",
            "sentiment_compound": 0.7667
        },
        {
            "id": "h1wec22",
            "score": 3,
            "text": "My boss always does this to me. It's almost never the case that I'm in trouble but his messages are always something like \"need to talk to you when you get a chance\" and my natural reaction is to be fearful of what the conversation is about.",
            "title_similarity": "0.6828841",
            "sentiment_compound": 0.431
        },
        {
            "id": "h1wefd0",
            "score": 3,
            "text": "Fucking yes! I now have a chronic fear at work and can't even sleep if a manager or district manager wants to have a meeting of any kind with with me/us in a bit without saying why. My last three jobs ended when the places I worked closed down after the closure was brought up in the meeting.\nSome managers I had even knew about being vague so bless them when they did say, \"can I talk to you for a sec? Don't worry, it's nothing bad haha.\"",
            "title_similarity": "0.53078735",
            "sentiment_compound": 0.8583
        },
        {
            "id": "h1wefgn",
            "score": 8,
            "text": "If they don’t do this. Simply say “yeah. I’ve been meaning to talk to you about something as well….”\n\nNow you’re both anxious all day!",
            "title_similarity": "0.8048452",
            "sentiment_compound": -0.3164
        },
        {
            "id": "h1wegra",
            "score": 3,
            "text": "The administrator of my job once stuck her head into my area & told me…”I need to speak to you about something. When you get a chance, come to my office.” Then she walked off. I looked at my coworker who said OMG, go. I’ll finish your work. I slowly walked to her office, trying to remember if I’d majorly screwed up somewhere. I went in her office and she just wanted me to work on an issue from another shift. I started laughing and told her…..Do you realize what fear it causes when you say “Come see me in my office” with no explanation?? She thought about that for a second or two then laughed about it. As an aside, she was a wonderful, tough but fair administrator & was well loved!",
            "title_similarity": "0.5869824",
            "sentiment_compound": 0.8946
        },
        {
            "id": "h1weo5m",
            "score": 2,
            "text": "My partner does this and it drives me mad. He does it on purpose now. \n\n\"So I wanted to talk about something...but we'll talk later.\"\n\nUm no, mister. We're talking this instant.",
            "title_similarity": "0.75969565",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1wetmh",
            "score": 2,
            "text": "Sometimes the subject matter is hard for me too and I don’t want to tell you what it is because I’m still building up the courage to talk about it. But I need you to know that I want to talk.",
            "title_similarity": "0.75469863",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h1wexev",
            "score": 3,
            "text": "I got an email once from the head of the main branch of the shelter I worked at a few years back. Mystery meeting on Monday at the head branch where the email is made out directly to me? Pretty good sign that I was going to be part of the downsizing there were rumors of. They laid off everyone who had less than a year tenure.",
            "title_similarity": "0.36271006",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1wf1qt",
            "score": 2,
            "text": "Whenever I text a sibling or family member (we’ve all been thru traumatic experiences thru phone and text), I make it a point to say it’s nothing bad if I say we gotta talk about something later.  If someone does it to me and doesn’t specify the tone of the convo, I ask if it’s at least good or bad.",
            "title_similarity": "0.7136341",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h1wf29j",
            "score": 2,
            "text": "I'm in this predicament with requesting a meeting to give my notice to my boss. How should I ask her to talk when the reason I'm talking to her is because I'm leaving? It would be super rude to just right out and say it.",
            "title_similarity": "0.63597405",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1wf5qe",
            "score": 3,
            "text": "Our firms last receptionist called my office one afternoon “[managing partner] would like to see you in the board room” \n\nLongest 30 second walk of my life reassessing everything id ever done in that job. \n\nTurns out he was settling a file with a friend of mine from law school and thought I’d like to say hi. \n\nNice girl but come ON!!!",
            "title_similarity": "0.38659364",
            "sentiment_compound": 0.7488
        },
        {
            "id": "h1wf6i3",
            "score": 12,
            "text": "I also hate:  \n\nFriend: “Are you gonna be busy later?”\n\n\nWell it just depends what the hell you are about to ask me…..",
            "title_similarity": "0.7289999",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h1wf6tn",
            "score": 1,
            "text": "What? But making them anxious is exactly the point of \"we need to talk\"",
            "title_similarity": "0.6926936",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1wfajk",
            "score": 1,
            "text": "* Has anxiety getting home from work cause father wants to talk about your bill statement and you’ve been spending money after 3 days of receiving your paycheck* 🥲🥲",
            "title_similarity": "0.43704563",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1wfdpc",
            "score": 3,
            "text": "I hate this so much! I’m in this situation right now, but on a ‘professional’ level. I’m a freelancer and just submitted a big project (think about 40 k words). I’m gonna be on maternity leave on the first of july and planned to have the last two weeks of june to further work on/finish the project after giving my client a full week to give me feedback. Well i didnt receive any feedback, just an email saying:\n\n‘Can we meet on the 28th of june to talk it through?’ She knows about my planning. \n\nI’m fuming tbh. Asked her for more info/details/anything so i can prepare. Why do people come up with mysterious emails like that, just tell me what you’d like to discuss. Is it good or bad? Can i prepare? Why not sooner? Cant this be an email or zoom meeting??? UGH.",
            "title_similarity": "0.49416497",
            "sentiment_compound": -0.4121
        },
        {
            "id": "h1wfgrp",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.23730439"
        },
        {
            "id": "h1wfpec",
            "score": 1,
            "text": "I would like to have a parley with you at noon tomorrow about death.",
            "title_similarity": "0.55950844",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1wfvxv",
            "score": 1,
            "text": "I really wish my boss would do this. \"hey, I need to talk to you\"\n\nOh god I'm getting fired",
            "title_similarity": "0.6473253",
            "sentiment_compound": 0.1263
        },
        {
            "id": "h1wfx71",
            "score": 1,
            "text": "This, 100%. The first time my emotionally abusive ex-boyfriend broke up with me, he said \"hey, we need to talk\" during marching band practice - not at the end of, *during*. So until the end of practice I was an anxious panicked mess. Then he broke up with me (for the first time) and I became a depressed mess begging him not to, so he un-broke up with me. (Years later I still wish I had just let him break up with me then; wouldn't have surprised me if it was a stunt he pulled to go \"see, you NEED me\", and it would've saved me another year of his abuse and manipulation. Thankfully I'm in a much better place now with someone who actually cares about me!)  \nThe phrase \"we need to talk\" in the context of a romantic relationship is just so loaded and anxiety-inducing.",
            "title_similarity": "0.46304417",
            "sentiment_compound": -0.9268
        },
        {
            "id": "h1wg8zw",
            "score": 1,
            "text": "Here here! Also acknowledge that now isn't the best time to talk about it and an indicator that you ar after a SOLUTION based discussion, not a fight.\n\n\"Hey, when you get a chance, can we please talk about chore distribution here and brainstorm a new system, because I don't think this one is working.\"\n\n\"Hey, I know you are having a long day, but when you have had a chance to unwind, can we please come up with a game plan for introducing the baby to your family this weekend?\"\n\nAnd if it's good news, just say so! \n\n\"Hey, so I wanted to talk to you about planning our vacation this year. I have some cool ideas to run past you!\"",
            "title_similarity": "0.7316774",
            "sentiment_compound": 0.9403
        },
        {
            "id": "h1wgbnw",
            "score": 2,
            "text": "My sister and I have a scale system from 1-10 on the seriousness of the subject. So like \"hey I need to talk to you, don't worry it's like a 2\"",
            "title_similarity": "0.53494966",
            "sentiment_compound": 0.5167
        },
        {
            "id": "h1wgizv",
            "score": 1,
            "text": "No fucking shit. I got told last night not to come in to work and that the Warden needed to have a meeting with me at 8am. I slept not a fucking second last night.",
            "title_similarity": "0.3653894",
            "sentiment_compound": 0.254
        },
        {
            "id": "h1wgx3a",
            "score": 1,
            "text": "And what situation would induce the most anxiety?",
            "title_similarity": "0.5665897",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h1wh20b",
            "score": 1,
            "text": "I need to speak to you later. Lets just say it is about Cancer. Also I am breaking up with you. Also, I don't have cancer.",
            "title_similarity": "0.6297774",
            "sentiment_compound": -0.2225
        },
        {
            "id": "h1whej0",
            "score": 1,
            "text": "Especially if it’s a loved one. Girlfriend? Worried panicking aghhh. Parents/sibling? WHAT DID I DO",
            "title_similarity": "0.5767799",
            "sentiment_compound": -0.1431
        },
        {
            "id": "h1whhv4",
            "score": 1,
            "text": "I get upset when I get an email from my Dad saying I need to speak to you (and he leaves it at that). He’s had three strokes, cancer and is in poor health as well as living alone. It makes think that there is something really wrong. But when I do call him it sometimes ends up with him asking me if I know the password for his email account. I find it very manipulative but I’m not sure if it’s deliberate. I’m probably being too sensitive and overthinking it.",
            "title_similarity": "0.5380969",
            "sentiment_compound": -0.8458
        },
        {
            "id": "h1whn3r",
            "score": 1,
            "text": "Unless I want em to sweat it",
            "title_similarity": "0.5590182",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1whqtn",
            "score": 1,
            "text": "Unless you want them to be anxious. r/UnethicalLifeProTips",
            "title_similarity": "0.5973097",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1whscp",
            "score": 1,
            "text": "My mom needs to see this shit.",
            "title_similarity": "0.53821456",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h1whzbo",
            "score": 1,
            "text": "I advise this to everyone I know and they STILL don't listen to it.",
            "title_similarity": "0.5355451",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wi18k",
            "score": 1,
            "text": "Two weeks ago My boyfriend texted me meet me at my apt in 15 minutes and I was freaking out bc I thought he was gonna dump me or something serious. He just wanted to do a crossword puzzle during his lunch break 🤡",
            "title_similarity": "0.371848",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h1wi3ax",
            "score": 1,
            "text": "Don't you ever say some shit like that to me.",
            "title_similarity": "0.37525773",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1wi3hu",
            "score": 1,
            "text": "I figured the people who do this and refuse to answer when I ask what they want to talk about are trying to freak you out on purpose",
            "title_similarity": "0.6809016",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1wi43f",
            "score": 2,
            "text": "Whenever my wife says that I ask, “Can I get a preview”? Seems to work pretty well.",
            "title_similarity": "0.50359553",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1wi56a",
            "score": 1,
            "text": "::Forwarding to boss::",
            "title_similarity": "0.42446423",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wi57w",
            "score": 2,
            "text": "Thank goodness for this! My neurotic brain starts inventing negative scenarios anytime someone drops a request to talk without any context.",
            "title_similarity": "0.69565696",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h1wi7c4",
            "score": 1,
            "text": "The number of people I encounter who still think this phrase is a good idea astounds me.",
            "title_similarity": "0.49095437",
            "sentiment_compound": 0.743
        },
        {
            "id": "h1wi7m5",
            "score": 1,
            "text": "Exactly. If someone messages me saying \"we need to talk\" or \"I want to talk to you about something\" then I purposely ignore them. I also have anxiety and this kind of behavior makes my stomach hurt. \n\nAt this point it pisses me off more, that people still message me like this when I've expressed discomfort about it. So I've stopped asking what is about and stopped answering calls. \n\nAll of a sudden those people are learning that, if they actually want to communicate with me, then they need to be more clear about the topic. It's annoying how some people have to forced into respecting your boundaries.",
            "title_similarity": "0.7583279",
            "sentiment_compound": -0.8856
        },
        {
            "id": "h1wi85m",
            "score": 1,
            "text": "Years ago I was going to lunch. I was with my friends and the elevator doors were closing when they all of a sudden came to a dramatic halt.\n\nIt was our cold HR controller, my boss. She looked at me Dead in the eye and matter-of-factly said “as soon as you’re done with lunch, I need you to come to my office and talk to me about something important“\n\nShe removed her foot from the elevator door and they slowly closed. My friends all said “oh you’re in trouble“\n\nSpent all lunch freaking out with anxiety.\n\nAfter lunch I went to her office. I come inside and she uncomfortably says “please close the door and sit down“\n\nShe says “accounting has been looking at your paychecks and we noticed a discrepancy. We have been under paying you by $10 for the past six months. You’ll have a small increase of $60 in the next paycheck.”",
            "title_similarity": "0.4510584",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h1wiadf",
            "score": 1,
            "text": "I'll pay someone $1000 to make this trend and show it as a  notification on my girls reddit app.",
            "title_similarity": "0.37588817",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1wieh0",
            "score": 1,
            "text": "Where’s the fun on this though?",
            "title_similarity": "0.4619363",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1wig8h",
            "score": 1,
            "text": "My ex-girlfriend would do this to me all the time, and always while I'm at work or something. \"Hey, we need to talk when you get home.\"\n\n\"Ok, what about?\"\n\n\"Oh, nothing important, I just need to talk to you.\"\n\n\"Can you just tell me what about so I'm not stressing out for the rest of my shift?\"\n\n\"It's no big deal, really. Don't worry.\"\n\nLike, if it's no big deal, why the fuck did you call me at work? She did these kinds of things to me constantly, hence why we're no longer together.",
            "title_similarity": "0.6757752",
            "sentiment_compound": -0.82
        },
        {
            "id": "h1wior4",
            "score": 1,
            "text": "\"hey we need to talk\"\n\n\"uh oh, about what?\"\n\n\"uhhh...why we're breaking up\"\n\n*ah shit*",
            "title_similarity": "0.60055256",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1wipa2",
            "score": 1,
            "text": "My old boss would get her staff to call drivers and say \"I need you to come straight to my office when you come in this afternoon\"\n\nI'd ask the person calling what it's about and naturally, they didn't know. \n\nLoved that 5 hours of peak anxiety for them to say \"we have approved your holidays\".",
            "title_similarity": "0.487601",
            "sentiment_compound": 0.3515
        },
        {
            "id": "h1wips5",
            "score": 1,
            "text": "But then I have to lie twice. It's hard enough remembering one lie.",
            "title_similarity": "0.6108668",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1wiz06",
            "score": 1,
            "text": "Manager - Jim, we need to talk. Actually, you're fired but let's talk in detail at 5.\n\nJim was never seen again.",
            "title_similarity": "0.41534853",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1wj63w",
            "score": 1,
            "text": "When I was a manager, if I needed to meet with an employee later (or even if I was calling them into my office), I would preface everything with, “Don’t worry, you’re not in trouble.” I know I have spent hours/days in agonizing anxiety because I was supposed to meet with my boss, and I never wanted to make my employees feel that. If they WERE in trouble, I would wait until the end of their shift to talk to them, but I never told them ahead of time that we needed to talk. I just felt like having to work was miserable enough, so why should I make it worse?",
            "title_similarity": "0.6529439",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h1wj68c",
            "score": 1,
            "text": "I still remember being a kid when my mom and dad sat me down in the living room and told me that we needed to talk about my extended warranty.",
            "title_similarity": "0.40550554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wj8oh",
            "score": 1,
            "text": "Uuugghh I had a principal (my boss) who did this! Had to sit him down and explain why it’s not ok.",
            "title_similarity": "0.53587127",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wjan0",
            "score": 1,
            "text": "There aren’t really that many people who need this. If your having a conversation at work, and someone says that, I am guessing it’s related to work, and if they need to know before to be prepared to answer questions it’s already gonna get brought up or the nature of the job dictates it already and they will be prepared.  There are people that need this were I work, but that usually means they need a different job. Getting over your personal shit, like anxiety when speaking to others is something you need to work hard to get passed, don’t put that on other people.",
            "title_similarity": "0.75636476",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1wjcfl",
            "score": 1,
            "text": "I had an AWFUL manager. The guy was a moron, but also malicious. His specialty was, on Friday morning, he'd come to you with a serious face and say \"I need to talk to you tonight, come see me.\"\n\nThen the asshole would leave for the weekend and not answer his phone, effectively ruining everyone's weekend.",
            "title_similarity": "0.5226828",
            "sentiment_compound": -0.4341
        },
        {
            "id": "h1wjfkr",
            "score": 1,
            "text": "It's like when parents call you, and you answer, but then they don't after that.",
            "title_similarity": "0.60446477",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h1wjm0r",
            "score": 1,
            "text": "I still reference this story all the time when explaining how I like my information delivered:  https://www.computerworld.com/article/2565077/i-m-ok--the-bull-is-dead.html",
            "title_similarity": "0.46959004",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1wjn9z",
            "score": 1,
            "text": "They sell a lot more disordered eating.",
            "title_similarity": "0.43581474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wjs58",
            "score": 1,
            "text": "Unless it’s your husband. He already knows he fucked up and make him squirm.",
            "title_similarity": "0.59002995",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h1wjucf",
            "score": 1,
            "text": "Me: We need to talk. Let's say 4pm today\n\nThem: Ok. About what?\n\nMe: I had sex with your mother. See you at 4!",
            "title_similarity": "0.42736375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wjv7u",
            "score": 1,
            "text": "Every time someone does this to me, I call them out on it right away because it’s really just so rude and thoughtless.",
            "title_similarity": "0.4979987",
            "sentiment_compound": -0.8156
        },
        {
            "id": "h1wk3e9",
            "score": 1,
            "text": "I had a boss like this.   Esp when I was in college, in the middle of class. Id get a voice-mail, 'hey tattoo, gimme a call.'   End.   Is it important?   Am I fired?  Is someone else fired?  What!   Usually it was something inconsequential like, what is the special of the day or where do we keep the dry erase markers, things that can be discussed over TEXT.  But no, always a call.  Was fun having mild panic attacks every phone call that was missed for almost 2 decades.  And it was never, call when you get a chance, no big deal, always right away.  So. Many. Heart. Attacks.",
            "title_similarity": "0.55015814",
            "sentiment_compound": -0.689
        },
        {
            "id": "h1wk3fp",
            "score": 1,
            "text": "I feel like a lot of people do this intentionally to make someone nervous.",
            "title_similarity": "0.63161707",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1wk8oi",
            "score": 1,
            "text": "Every mom should do this",
            "title_similarity": "0.33467564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wkcys",
            "score": 1,
            "text": "No one speaks like this though, anytime this situation arises they asking party always alludes to what it’s about",
            "title_similarity": "0.5395131",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h1wkdsc",
            "score": 1,
            "text": "This!  My supervisor will call and leave a message saying something like “call me when you get this” and that is all.  I’m not always in a good reception area and it may be an hour before I get to a spot that I can call back.  So far it has always been something he is having problems figuring out, but it freaks me out big time.",
            "title_similarity": "0.7279383",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h1wkgpo",
            "score": 1,
            "text": "Doesn't apply if you are firing the dude",
            "title_similarity": "0.42396706",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1wkhmn",
            "score": 1,
            "text": "Omg this is 100% me!! Also perfect timing as this just happened today! Someone I share office space with sent a text with “hey do you have time to talk with me tomorrow at 1:15?” My brain goes into all the possibilities of what the subject could be! Like I’m prepping for the worst and getting my arguments scripted so I’m not caught off guard and flustered. It could be something big or something completely mundane....but idk and my anxiety takes so much out of me wondering and prepping. I haaatttee it! Just tell me what the subject or context is so I know! I’m so glad I’m not the only one!",
            "title_similarity": "0.64930296",
            "sentiment_compound": 0.5033
        },
        {
            "id": "h1wko9j",
            "score": 1,
            "text": "\"I need to speak to you about your performance\"\n\nThis could be work or relationship related",
            "title_similarity": "0.5494083",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wkohl",
            "score": 1,
            "text": "My father did this forever. He would text me \"call me when you can\" \n\nIt took a while but I explained not to do they because I always this it is something serious.",
            "title_similarity": "0.6142926",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h1wkojk",
            "score": 1,
            "text": "A million times this. Say it louder for the people in the back",
            "title_similarity": "0.4838308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wkqdt",
            "score": 1,
            "text": "And sometimes the opposite is ok- I’d rather someone randomly, directly just said what was bothering them.  I don’t need some buildup to a conversation, just say it!",
            "title_similarity": "0.69203866",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h1wkskl",
            "score": 1,
            "text": "\"We need to talk about the fact that I know you're cheating on me.\"\n\nThen they have advance notice and can concoct a story.",
            "title_similarity": "0.6738311",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1wkug9",
            "score": 1,
            "text": "Adding to this, I hate private messages that just say “hey” or my name, whatever.\n\nThey’re waiting for me to respond before they actually tell me what they need to tell me.",
            "title_similarity": "0.6634498",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1wl2dc",
            "score": 1,
            "text": "This always messes with my anxiety.\n\nOne time I had a close friend call me while I was closing up at work. He told me that he wanted me to come to his place right after I left work so that he could talk to me about something. We had already made plans the night before for me to come over, so it sent my anxiety into a frenzy.\n\nWhen I get to his house, he and his girlfriend sit me down on their couch. I'm super nervous at this point but also very ready to finally know what he wants to talk about.\n\nHe then looks at me and says \"Would you ever fuck *his girlfriends name*?\" I started panicking. He must think that she and I were messing around behind his back. \n\nI start to carefully explain that if it were an alternate reality where the two of them were never a thing I would consider having sex with her, but since she is my friend's gf, I would not.\n\nHe then clarifies \"Oh no no no. I'm not accusing you, I'm asking you. She and I want to have a foursome. I picked *mutual female friend* and she picked you.\" He also added that he would appreciate it if I showed him some tricks/tips on pleasing his gf.\n\nAfter processing this, I accepted the offer and immediately went to the freezer and made myself a very strong whiskey drink. I needed to be quite drunk to be comfortable plowing his gf in front of him. \n\nIt ended up being a great time.",
            "title_similarity": "0.5923544",
            "sentiment_compound": 0.9788
        },
        {
            "id": "h1wl505",
            "score": 1,
            "text": "No. No more \"later time\". If you want to talk to me, ask me if I have time to talk right now, then talk. I cannot, CANNOT do \"let's talk later\", unless it's something innocuous like hey let's talk later about the details of our camping plans or some Bs like that. If it's actually important, just talk to me right now or don't say anything at all.",
            "title_similarity": "0.6755828",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1wl92y",
            "score": 1,
            "text": "Especially when you are riddled with anxiety in the first place.",
            "title_similarity": "0.61875796",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1wll2a",
            "score": 1,
            "text": "Early in my career I had a boss who would set me up for anxiety by saying something in passing like, I gotta talk to you about something important.  I'd typically ask what was up but that shit heel would say he didnt have time just then.  It would routinely turn out to be nothing.",
            "title_similarity": "0.6981877",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1wllkh",
            "score": 1,
            "text": "I did the opposite with my dad yesterday. On purpose. Might wait a couple months to follow up. He deserves it.",
            "title_similarity": "0.4830443",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wln88",
            "score": 1,
            "text": "I refuse to talk unless I'm told in advance, it's either important and you give me a heads up so we can both be prepared when we talk later, or it's not important and we don't discuss it.\n\nMy girlfriend tolerates this shit from her friends all the time and is always anxious about what the discussion is about, just refuse to play the little drama game. I'm not fretting about something needlessly that can always be explained in 15 seconds.",
            "title_similarity": "0.68535066",
            "sentiment_compound": -0.4664
        },
        {
            "id": "h1wlyhi",
            "score": 1,
            "text": "Also when you send texts or messages don't format it in two lines but one. Then the person can see it in their preview. I need this to help triage tasks when I'm over loaded. So if you do\n\n> Hey\n> Can we talk?\n\nI can't determine the answer to that question. But\n\n> Are you free to talk about plans this weekend?\n\nOr\n \n> Did you get that report done?\n\nI know how to triage? Messaging is asynchronous so treat it as such.",
            "title_similarity": "0.6934707",
            "sentiment_compound": 0.9403
        },
        {
            "id": "h1wm0rh",
            "score": 1,
            "text": "I like to tell people what I’m wanting to talk about in advance but yeah I got broken up with on Saturday after being told that a few hours before. Anyways I’m dead inside now and I’m not quite sure if I’ll ever be able to feel emotions ever again.",
            "title_similarity": "0.565166",
            "sentiment_compound": -0.8839
        },
        {
            "id": "h1wm2ho",
            "score": 1,
            "text": "Hey, We need to talk later, I’m going to break up with you, but not right now",
            "title_similarity": "0.73610383",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wm4fn",
            "score": 1,
            "text": "My old boss used to do this (it was intentional). He'd tell me at the beginning of my shift in a very serious tone that we'd need to have a meeting later, but would never elaborate, even when asked directly what it was concerning. Then they would keep pushing back the time of the meeting, and rescheduling it over the course of the shift. After putting it off as long as they could, we would finally have this big meeting and it was always some simple change to a procedure, or a new work order we'd be getting - always something that easily could have been a short email, or a 30 second conversation. He did a lot of that kind of thing.",
            "title_similarity": "0.6782305",
            "sentiment_compound": 0.4221
        },
        {
            "id": "h1wm7xx",
            "score": 1,
            "text": "You could just ask what’s it’s about",
            "title_similarity": "0.4532893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wmfpd",
            "score": 1,
            "text": "Like a manager. They do that shit to play head games. All it does is take your mind off your work.",
            "title_similarity": "0.5455059",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1wmjvi",
            "score": 1,
            "text": "One time a manager left me a message asking me to call him back. I did, assuming it was something really trivial.\n\nI was fired.",
            "title_similarity": "0.53770894",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h1wmnyc",
            "score": 1,
            "text": "So true! We always go to the worst place when left to our own devices. Help a worry wort out with some context.",
            "title_similarity": "0.5939115",
            "sentiment_compound": -0.3609
        },
        {
            "id": "h1wmsmr",
            "score": 1,
            "text": "To add, be as specific as you can. Your boss telling you \"come see me at 4, I want to chat\" and \"come see me at 4, I want to chat about that project you just submitted\" aren't much different. \"Come see me at 4, nice job on that project but I had a few questions about -xyz-\".",
            "title_similarity": "0.5485581",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1wmypo",
            "score": 1,
            "text": "I had a couple managers who would, out of the blue, say \"em, come to the managers office.\"\n\nI'd be stressing out as I walked to the front of the store...I'd get into the office where the two men were looking very seriously at some pages on the desk in front of them, and I'd tentatively say \"....yes?\"\n\nThey'd turn and look at me and say \"oh, em, great.  How do we do this?\"\n\nMy company and theirs had merged about 6 months earlier, my store closed and I was transferred to their store.  I was a step shy of a department manager before transferring and knew how to do many management tasks.  Our store was one of the first stores in the company to convert to my old stores systems.  It was hard for them to have a manager from another store walk them through all the unfamiliar systems over the phone, but easy for me to show them on the computer.\n\nOnce I told my assistant manager \"do you realize how much it stresses me out every time the 2 of you do this?\"  He apologized, but they kept doing it!",
            "title_similarity": "0.4352283",
            "sentiment_compound": 0.6231
        },
        {
            "id": "h1wn4b0",
            "score": 1,
            "text": "Hey Jeremy when you get a chance i need to speak to you about letting you go. Later though not now. Just a heads up",
            "title_similarity": "0.7520999",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1wn4rc",
            "score": 1,
            "text": "I do this instinctively because it makes me anxious whenever it's done to me regardless of who it comes from.\n\nUnfortunately my mom does this with *everything*, so I'm perpetually worried someone in my family is dying or something.",
            "title_similarity": "0.66298157",
            "sentiment_compound": -0.7063
        },
        {
            "id": "h1wn5o5",
            "score": 1,
            "text": "“Hey babe can we talk later? It’s about the future of our relationship”",
            "title_similarity": "0.6467029",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wnahq",
            "score": 1,
            "text": "Please please please everyone read this and hold the information lol. My mind cant hold a we need to talk out of context. Might as well have locked me into a prison until that time",
            "title_similarity": "0.67359126",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h1wnce2",
            "score": 1,
            "text": "\"Tom I need to speak with you later\"\n\n\"About what Jerry\"\n\n\"Your job\"",
            "title_similarity": "0.667686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wnf9p",
            "score": 1,
            "text": "\"Hey we need to talk to you later. It's about us breaking up. I'm thinkin around 7? That good for you?\"",
            "title_similarity": "0.582299",
            "sentiment_compound": 0.504
        },
        {
            "id": "h1wnkik",
            "score": 1,
            "text": "This has happened to me many times and I had anxiety the whole time. I do also admit that I have done this to people, but I try not to anymore...unless they deserve to have anxiety.",
            "title_similarity": "0.6748394",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1wnmth",
            "score": 1,
            "text": "My gf does this. She’ll say “hey, we need to talk,” and then after work be like “my vagina smells.” \n\nI’m like, yeah, no shit Sherlock!",
            "title_similarity": "0.66102105",
            "sentiment_compound": 0.8561
        },
        {
            "id": "h1wnon2",
            "score": 1,
            "text": "I find this advice excellent. I get panicked easily. If someone just told me it's not as bad as I will fester it to be, then that's a win.",
            "title_similarity": "0.67295235",
            "sentiment_compound": 0.8674
        },
        {
            "id": "h1wnqns",
            "score": 1,
            "text": "I always assumed that people who didn't *wanted* to induce anxiety.  Like that's the whole point.",
            "title_similarity": "0.6606755",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1wnrto",
            "score": 1,
            "text": "Dooing this to me is a cardinal sin",
            "title_similarity": "0.47003692",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1wnu4l",
            "score": 1,
            "text": "Another benefit, if you're like me with a lot going on and easily distracted: telling the other person ahead of time what the topic is going to be can save you from potential embarrassment. Otherwise, there are sometimes those moments when the other person comes back and says, \"OK, what did you want to see me about?\" and you literally can't remember.",
            "title_similarity": "0.81715107",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1wnvig",
            "score": 1,
            "text": "Kind of related; don’t plan in a meeting or send a calendar invite without specifying the subject. If I can prepare I’d like to have the opportunity.",
            "title_similarity": "0.70602816",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1wnvus",
            "score": 1,
            "text": "Boss stops by. Hey I need to talk to you later",
            "title_similarity": "0.63801914",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1wnx6f",
            "score": 1,
            "text": "Anyone tired of r/LPT “ppl could really ease my anxiety by [insert either slight inconvenience or entire transformation of societal norm]?” \n\nLike how is that a tip for me?",
            "title_similarity": "0.72324216",
            "sentiment_compound": -0.2818
        },
        {
            "id": "h1wnzim",
            "score": 1,
            "text": "Some people are mean and thrive on causing anxiety.",
            "title_similarity": "0.5184542",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1wocfq",
            "score": 1,
            "text": "We need to talk about our relationship?????  that will stress the person out.",
            "title_similarity": "0.7537866",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h1wolnq",
            "score": 1,
            "text": "Came back to work from lunch one day with this message from the Company CEO “Hey Abbiethedog, this is {Guy who holds your 20+ year career with our Company in his hands} I would like to talk with you at 4:00 today about your future with our Company”. Then, this guy is out for the day until then and even his personal assistant says there is nothing on his calendar for this time. So, I get to stew in that for about 4 hours only to have a meeting with him to discuss the possibility of me moving to another area to help shore it up. Well, you could have saved me a little agita by giving a little more color to what the meeting was about. Sometimes it amazes me that people in such positions don’t stop for a moment to consider how what they are saying may be received.",
            "title_similarity": "0.39221466",
            "sentiment_compound": 0.9049
        },
        {
            "id": "h1won61",
            "score": 1,
            "text": "We need to talk later about how your anxiety problems affect how others think about you.",
            "title_similarity": "0.7791444",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1wooa4",
            "score": 1,
            "text": "My girlfriend's boss does this and will tell her just as she leaves work. Then when they actually speak it's about something trivial.\n\nShe once asked for a raise with the owner and the owner said he'll look into it. About a week later her manager goes to her section and yells at her about something and says he wants to see her at the end of the day. She stressed all day. She, not knowing what to expect, walked unprepared and stressed into a meeting discussing her proposed raise. She's 19. What an asshole.",
            "title_similarity": "0.51906717",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1wor07",
            "score": 1,
            "text": "If it's bad I say it straight right when it needs to be said.  \nIf it's not bad I say 'need to talk to you in a bit but it's not bad so don't stress'",
            "title_similarity": "0.67346454",
            "sentiment_compound": 0.8082
        },
        {
            "id": "h1wow0p",
            "score": 1,
            "text": "This happens at work. A lot. I have my voice mail instructing people to leave me their name, case number, call back number and brief message. I maybe get 2/3 of that or a message that saying \"hey its me, call me back, I have a question.\" Internally, I'm thinking, \"Alright, wanna tell me what the question is too?\" So I can actually have an answer prepared if I need to and not playing phone tag with them to find out what they need.",
            "title_similarity": "0.69410384",
            "sentiment_compound": 0.4035
        },
        {
            "id": "h1woyst",
            "score": 1,
            "text": "If you happen to be a manager who rarely schedules one on one meetings, please don't ever schedule one at the end of someone's shift on a Friday.",
            "title_similarity": "0.38494748",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1wp04h",
            "score": 1,
            "text": "** HR left the chat **",
            "title_similarity": "0.35121924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wp0ej",
            "score": 1,
            "text": "Agenda.  Every pre-planned meeting should have one, even if it's super high level.",
            "title_similarity": "0.5099436",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1wpd1q",
            "score": 1,
            "text": "Conversely, if you want to give someone a panic attack, tell them we need to talk later, and then don't follow up...",
            "title_similarity": "0.7815222",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h1wpe35",
            "score": 1,
            "text": "Hello my boss - are you reading this?",
            "title_similarity": "0.46263602",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wpflb",
            "score": 1,
            "text": "In my experience, if you tell them then they will find a way to avoid / twist the important conversation or be fed up with the conversation before it even begins.",
            "title_similarity": "0.7842926",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1wphyn",
            "score": 3,
            "text": "My dad: \"Hey, call me as soon as possible, we need to talk.\"\n\nMe, calling in a panic that somebody died or something: \"Dad, is everything alright?\"\n\nDad: \"Hey what are your thoughts on the 2021 VW Jetta? I've read some good reviews for them....\"\n\nI wish I could get him to understand the importance of what OP says here, he's freaked me out as well as others so many times.",
            "title_similarity": "0.6394038",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h1wpigc",
            "score": 1,
            "text": "Seriously, people who don't do this: What the actual fuck is wrong with you?",
            "title_similarity": "0.47289556",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h1wpmgv",
            "score": 1,
            "text": "I've been saying this for years and people didn't understand why I wanted them to at least tell me the gist or my anxiety **will** skyrocket. Thank you, I hope more people understand this.",
            "title_similarity": "0.647599",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1wpogn",
            "score": 1,
            "text": "I would just email employees if we needed to talk \"nothing bad\" to keep them from worrying.",
            "title_similarity": "0.6731872",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h1wpotd",
            "score": 1,
            "text": "This happened to me the other day.",
            "title_similarity": "0.34931624",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wppix",
            "score": 1,
            "text": "I have this nasty habit of wanting to do a well-intentioned wellness check in with staff to see how they're doing but there's always something in my tone that scares people off and gives them anxiety.\n\nI'm going to have to try this!",
            "title_similarity": "0.7097362",
            "sentiment_compound": -0.7284
        },
        {
            "id": "h1wpwxy",
            "score": 1,
            "text": "I used to work for a guy who loved to do this.  \n\nFriday 4:45pm, boss: “hey, we need to sit down and have a little chat on Monday” \n\nMe all weekend: updates resume, calling friends for advice, doesn’t sleep, panic attacks, \n\nMonday: uhhhh, you wanted to see me? \n\nBoss: yes, we ordered company hoodies for everyone. Here’s yours\n\nIm sure he did it just to fuck with us",
            "title_similarity": "0.542753",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1wq5pw",
            "score": 1,
            "text": "I was just thinking about this before!",
            "title_similarity": "0.55353355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wqa8o",
            "score": 1,
            "text": "Hey we need to talk about your position in this office.",
            "title_similarity": "0.48593795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wqea4",
            "score": 1,
            "text": "I try to ask “what about” then the decision is at least 50% mine if we do in fact need to talk.",
            "title_similarity": "0.44391206",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wqg0x",
            "score": 1,
            "text": "My workplace loves to schedule meetings called “quick chat” with no description whenever something bad happens.",
            "title_similarity": "0.59443367",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1wqjbt",
            "score": 1,
            "text": "I’m the receptionist at my work and people often ring for the technicians. I try to do this also because it gives the techs a chance to prepare a little bit so they’re not caught off guard when they return the call to the client. Also what happens quite often is that it turns out I can solve their problem right there and then without having to involve the technicians at all",
            "title_similarity": "0.5539899",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1wqjd4",
            "score": 1,
            "text": "My Ex: I need to tell you something.\n\nMe: What is it?\n\nEx: I did something bad?\n\nMe: ... What was it?\n\nEx: I don't want to talk now.\n\nMe: Don't just leave me hanging!  I'm going to be worrying about this all night.  Just tell me.\n\nEx: No, I'll tell you later.\n\nMe: Please!  I don't want my ulcer to act up all night, I have to work in the morning!  Just tell me now so I won't be sick all night.\n\nEx: I have to go, I'll tell you later.  \\*leaves*\n\nShe cheated on me.  She was an awful human being anyway, so that was just the shit icing on the shit cake, Rand.  I honest to God hope she just goes fucking missing one day.  I don't care what happens to her, only that's it's horrible and she's taken out of society where she can't ruin anymore lives.",
            "title_similarity": "0.7399528",
            "sentiment_compound": 0.6881
        },
        {
            "id": "h1wqmv7",
            "score": 1,
            "text": "For sure.  With a lot of things in life, not knowing makes it scarier than it is.",
            "title_similarity": "0.6528797",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1wqqke",
            "score": 1,
            "text": "My boss just did this to me earlier & one of my co-workers is in hot water…\n\nSo I’m like…why not let me finish out the week before you fire me?",
            "title_similarity": "0.5341983",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1wqwgu",
            "score": 1,
            "text": "This is especially true if this is an employment situation or if the power dynamic is otherwise uneven. Had a manager who would do this and it freaked people out. When I sat in his chair for a while, I 100% always included the subject matter.",
            "title_similarity": "0.582857",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h1wqxms",
            "score": 1,
            "text": "If a person repeatedly does the 'I need to talk to you later' thing, all yourself if it's a form of control. Once I realised what my mum was doing, I would say 'I've got time now. What's up' and keep my body language very relaxed. Made lots of agreeing type sounds but not commit to any view point because 'I'd need to think about that'.",
            "title_similarity": "0.7954081",
            "sentiment_compound": 0.1567
        },
        {
            "id": "h1wr35a",
            "score": 1,
            "text": "I would 100% rather the person not say anything until they can tell me at that time. Even if I know the subject matter, It’s one of my biggest pet peeves, because it will be all I think about until then!",
            "title_similarity": "0.73592806",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h1wr68w",
            "score": 1,
            "text": "What a useless piece of rubbish this sub has turned into.",
            "title_similarity": "0.1902001",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1wr94g",
            "score": 1,
            "text": "My brother in law and I work in construction together. During a job he managed to fall off the roof of a 2 story building and snapped his neck. Kinda regret telling my sister about this in the middle of the day cause she had a mental breakdown in front of her 2nd grade class.",
            "title_similarity": "0.319919",
            "sentiment_compound": -0.3626
        },
        {
            "id": "h1wrcgf",
            "score": 1,
            "text": "“Hey boss I need to talk to you after your meeting, no need to worry I’m going to quit.”",
            "title_similarity": "0.6045728",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1wrgd6",
            "score": 1,
            "text": "\"Hey can I call you after? You're not in trouble.\"\n\nOr\n\n\"I'm gonna call you. Nothing's wrong, I have an admin question.\"",
            "title_similarity": "0.53294533",
            "sentiment_compound": -0.2124
        },
        {
            "id": "h1wrgvm",
            "score": 1,
            "text": "What if I need to talk to them about their car insurance?",
            "title_similarity": "0.4665376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wrkn6",
            "score": 1,
            "text": "I haven't really dealt with the anxiety side of it, but mostly get people who text or leave a voice mail saying just: \"call me.\" Usually i wait a long time before I call, If I ever do, to spite the fact they can't tell me what its about. Must not be an emergency or important, so...I'll wait until we are face to face.",
            "title_similarity": "0.69778574",
            "sentiment_compound": -0.3125
        },
        {
            "id": "h1wrpaj",
            "score": 1,
            "text": "Don't people do this as some sort of sick power play though.",
            "title_similarity": "0.44079202",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h1wrq07",
            "score": 1,
            "text": "That's it. I am blocking this sub. Read this post again and tell me it isn't a complete waste of time? I mean FFS who is it directed at? Who could possibly not already know this?",
            "title_similarity": "0.65163827",
            "sentiment_compound": -0.7462
        },
        {
            "id": "h1wrqd3",
            "score": 1,
            "text": "My boss does this all the time and I hate it. I am certain it's deliberate to \"keep me on my toes\" or to \"show me who's boss\" such a dick tactic.",
            "title_similarity": "0.52235824",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h1wrriw",
            "score": 1,
            "text": "As a teacher and former coach of 10 years there isn't a whole lot that pisses me off more than a parent that emails me and says \"I need to set up a meeting with you\" and that's it.  It's unfair and let me tell you, I'm going to go in to a meeting that starts this way with a very negative attitude assuming I'll have to defend myself for their child's failure or lack of progress.  LPT- if you want to do your child justice with a teacher issue it is best to approach it in a positive way with a lot of transparency.  Even if you feel that it must be the teachers fault that your kid is failing, there is a right and wrong way to approach it to get to the bottom of it in a productive way.",
            "title_similarity": "0.60880506",
            "sentiment_compound": -0.8357
        },
        {
            "id": "h1wrrz7",
            "score": 1,
            "text": "OMG, this is so true.  \n\nWhy is it my brain always shifts into worst-case scenario mode? Sheesh",
            "title_similarity": "0.56671715",
            "sentiment_compound": 0.5598
        },
        {
            "id": "h1wrtiy",
            "score": 1,
            "text": "I make it a goal as a people manager to always try to give context for meetings, especially ones that are more “last minute” which cause soooo much anxiety. Been there and it’s not fun to not know what the hell a meeting is about",
            "title_similarity": "0.7790054",
            "sentiment_compound": -0.8403
        },
        {
            "id": "h1wrzzm",
            "score": 1,
            "text": "Lol this tip is telling people not giving any tips whatsoever. Smfh op",
            "title_similarity": "0.4940269",
            "sentiment_compound": 0.1935
        },
        {
            "id": "h1ws1jo",
            "score": 1,
            "text": "Second part to this, ask them YOURSELF what it is if they don’t tell you off the bat. THEN you can talk to them about letting you know what’s up off the bat. Don’t put yourself into the cycle",
            "title_similarity": "0.67266846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ws287",
            "score": 1,
            "text": "Doubly so if you’re a people manager.",
            "title_similarity": "0.3879431",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ws47l",
            "score": 1,
            "text": "Literally dealing with this from my boss today. I’ve had a panic attack already.",
            "title_similarity": "0.5581065",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1ws67j",
            "score": 1,
            "text": "People who do that really annoy me. It's the same type of person who leaves a message of \"call me\". How about you tell me what you want or what it's about and then I can be prepared and determine the urgency, etc. It's like they assume everyone should just drop everything and go to them. It reeks of self-importance, entitlement and lack of consideration that perhaps people have more to do than just cater to your every whim. Whenever possible, messages of \"call me\" never get a call back.",
            "title_similarity": "0.7872944",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h1ws96e",
            "score": 1,
            "text": "When someone says, \"hey, mind if I ask you about something later?\" or something to that effect, I immediately say, \"Just tell me what it is now, and we can talk more about it when you're free\"\n\nI can't wrap my head around why you *wouldn't* want the other person to know about what you wish to talk about prior to the actual conversation. Are they trying to go for a \"hah, gotcha!\" moment if we flub because we were unprepared for the discussion? Do people not realize the anxiety the person you're talking with feels when you are vague about what you want to talk about when all you wanted to ask was how work went? Just... just say it...",
            "title_similarity": "0.8298773",
            "sentiment_compound": 0.7922
        },
        {
            "id": "h1ws9rq",
            "score": 1,
            "text": "I worked as a cop in a spring break area and often arrested people's kids. Upon introducing myself on the phone, before saying anything else, I made sure to say \"Kyle is okay\" before I got into explaining why I was calling them and why they needed to drive an hour to come pick Kyle's drunk ass up and take him home. I imagine one the scariest things in the world is having the police call you about your kid. Although on occasion I couldn't say he or she was alright but instead that they need to call the hospital. Those are bad ones.",
            "title_similarity": "0.5596273",
            "sentiment_compound": -0.7992
        },
        {
            "id": "h1wsatx",
            "score": 1,
            "text": "Some of my coworkers (including my former supervisor) have a habit of dropping meetings in the calendar without telling you what they’ll be about. The first few months I worked here every time I got one I was convinced they were going to fire me.",
            "title_similarity": "0.49465427",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1wsmv1",
            "score": 1,
            "text": "When someone tells you we need to talk you response should always be \"You're damn right, we do need to talk\".",
            "title_similarity": "0.6749845",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1wsrsw",
            "score": 1,
            "text": "Yeah, I'll let you know my availably for that sometime around never.",
            "title_similarity": "0.5032124",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1wsu4q",
            "score": 1,
            "text": "\"can you come to my office?\"",
            "title_similarity": "0.3668995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wta73",
            "score": 1,
            "text": "Alternate LPT: If you ever want to cause someone a ton of anxiety, tell them you need to speak with them about something vaguely important and ominous.",
            "title_similarity": "0.79220825",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1wta9q",
            "score": 1,
            "text": "I think the real LPT here is that many people who do this know very well what they are doing. This can be a manipulation tool.",
            "title_similarity": "0.5091008",
            "sentiment_compound": 0.0498
        },
        {
            "id": "h1wtn2s",
            "score": 1,
            "text": "we need to talk about what youre afraid of later, so you can drop the fear of someone mentioning it for good",
            "title_similarity": "0.7709421",
            "sentiment_compound": -0.3947
        },
        {
            "id": "h1wtnxh",
            "score": 1,
            "text": "I hate that .... which is why I now apply the following rules\n\nIf someone contacts me saying they want to get a hold of me or talk to me, I'll ignore them and forget about it right away, I'm not wasting time figuring out what you want. \n\nIf it's important, they'll tell me why or get mad at me for ignoring them ... usually right away. \n\nIf it wasn't important, they'll forget and I'll forget because I never cared in the first place.",
            "title_similarity": "0.7088959",
            "sentiment_compound": -0.91
        },
        {
            "id": "h1wtq63",
            "score": 1,
            "text": "Even just, \"Hey, can I ask you a question?\" sends me into panic. My roommate did this a couple days ago. I said sure and then panicked for hours until she had service again. Turns out she just wanted to know if I'd buzz her hair off. Lol",
            "title_similarity": "0.62529385",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1wtuzf",
            "score": 1,
            "text": "if the person did not mention what the subject is, it is usually a bad news, breakup, layoff etc",
            "title_similarity": "0.57348216",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1wtwk2",
            "score": 1,
            "text": "If you’re a manager in this situation, it may also lead to a more productive conversation as the person you’ll be speaking to will have time to gather their thoughts on the matter and think opinions all the way through.",
            "title_similarity": "0.61108524",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1wu0mw",
            "score": 1,
            "text": "I’ve been on the receiving end of this and I’ve learnt and made it a habit to ask straight up what it’s in regards to, to the point of insisting even if it’s from someone more senior than I as yeh it’s very anxiety inducing",
            "title_similarity": "0.74582064",
            "sentiment_compound": -0.024
        },
        {
            "id": "h1wu259",
            "score": 1,
            "text": "When covid hit my old company (that I no longer work for lol) had massive layoffs. One of my coworkers was convinced she'd get laid off and she was panicking about what she was going to do. She's a much older person and this was all she ever knew. \n\nOne day our supervisor comes up to her and says hr needs to speak with her after lunch and supervisor wouldn't say what it was for. My poor coworker was crying during lunch and saying her goodbyes...then she came back all mad! \n\nTurns out it was about our hearing test results and hers were so bad that hr had to make sure she knew how to use the hearing ppe properly. You know, like how to wear earplugs and stuff. \n\nShe laughs about it know, but I remember this senior aged woman shaking and in tears. She still works there but wow what a dick move. \n\nI understand that hr probably didn't tell my supervisor why but hr could've at least let them know it wasn't a big deal like being laided off at least jesus christ.\n\nPlease let people know if its life altering news!",
            "title_similarity": "0.48813218",
            "sentiment_compound": 0.2236
        },
        {
            "id": "h1wu38u",
            "score": 1,
            "text": "@ my mother and all bosses ever",
            "title_similarity": "0.26039803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wu6bi",
            "score": 1,
            "text": "Reverse LPT. If some says \"we need to talk\", forget immediately and never stress.",
            "title_similarity": "0.6092561",
            "sentiment_compound": 0.1109
        },
        {
            "id": "h1wu893",
            "score": 1,
            "text": "My husband: \"oh hey so i need to talk to you about a work thing.. so.. how much do you like seeing me?  Because it's gonna be a lot from now on...  (4 hour pause) because we're going to be working from home until this covid thing clears up!\"",
            "title_similarity": "0.51372236",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h1wu99r",
            "score": 1,
            "text": "My manager disagrees, he enjoys it",
            "title_similarity": "0.41697788",
            "sentiment_compound": 0.25
        },
        {
            "id": "h1wuddq",
            "score": 1,
            "text": "I solved this issue years ago buy simply not talking to people.",
            "title_similarity": "0.46091056",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1wuf5a",
            "score": 1,
            "text": "My boss wants to have a “brief discussion” with me tomorrow morning. I’ve got no idea what it’s about. We even use a scheduler for meetings and it’s labeled “brief discussion”.\n\nI’m sweating bullets",
            "title_similarity": "0.634345",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1wufa1",
            "score": 1,
            "text": "Building on this, I get anxiety when people (people who I know) call me and don’t leave a message. Or get a text like “Can you call me?”. I had a friend who did this and 90% of the time it was kinda low key manipulation into cornering me to hang out. She was very needy and didn’t have many friends, and while I enjoy a good time, I don’t like hanging out on someone’s couch for hours on a regular basis to help them cope with loneliness. \n\nJust leave a message or text what it’s about. Need to vent? Great, I’m here for you. Wanting to aggressively corner me into hanging out and guilt tripping me if I say no? Go away.",
            "title_similarity": "0.6450604",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h1wupx3",
            "score": 1,
            "text": "Towards the start of my work day the store manager says \"hey can we have a chat before you leave please?\"\nJust wanted to see how the new guy was going but damn that was an anxious day. He could have used this LPT",
            "title_similarity": "0.64606524",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h1wuq82",
            "score": 1,
            "text": "Shitty Life Pro Tip: do the opposite to flex your power and stress those who depend on you.",
            "title_similarity": "0.5370629",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1wuvak",
            "score": 1,
            "text": "Hey, we need to talk later about me cheating.\n\n\nYeah, less anxious I'm pretty sure",
            "title_similarity": "0.74714124",
            "sentiment_compound": 0.2799
        },
        {
            "id": "h1wv1ie",
            "score": 1,
            "text": "Yes!!!!!!!!!! x1000!!!!! I always hate when my supervisors or coworkers send me an email saying “call me”. (We work at different sites).",
            "title_similarity": "0.5536611",
            "sentiment_compound": -0.4885
        },
        {
            "id": "h1wv1rc",
            "score": 1,
            "text": "I had to eventually sit down and have a talk with my gf about this either tell me when you say you got something to say or don't bring it up til you're ready to talk about it. I've noticed in this thread it's pretty much women that do this. Why tho?",
            "title_similarity": "0.6928177",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1wv6bx",
            "score": 1,
            "text": "Yeah that’s why I refuse to talk later it’s either now or keep your peace forever . I hate this kinda power move",
            "title_similarity": "0.5787363",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h1wv73b",
            "score": 2,
            "text": "My doctor just did this in a voicemail. “Hi [name] this is doctor [name]’s office we just have something to discuss with you if you could call us back during business hours” \n\nOf course that was a Friday and they are closed Mondays so I had to spend 3.5 days nervous as hell only to find out.....\n\nthey were just calling to see if I wanted to schedule a covid vaccine.....\n\nWHY COULDNT THAT BE LEFT ON THE VOICEMAIL!?",
            "title_similarity": "0.47223246",
            "sentiment_compound": -0.7901
        },
        {
            "id": "h1wvnks",
            "score": 2,
            "text": "Alternatively - if are like my former boss, and want to harass and make people anxious (or really pissed off, in my case) do this repeatedly. Make people wait, then blind-side people with bad news or complicated issues that you want them to agree to and sign a commitment form for...",
            "title_similarity": "0.7167655",
            "sentiment_compound": -0.7178
        },
        {
            "id": "h1wvnx3",
            "score": 1,
            "text": "Hey, it’s me, call me.",
            "title_similarity": "0.37986314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wvont",
            "score": 1,
            "text": "Often when it's said it's because u dont want others present to hear even the subject so I understand it sometimes anyway.",
            "title_similarity": "0.70404035",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h1wvri8",
            "score": 2,
            "text": "This is similar to the “What are you doing later?”\n\nLike uhhhh, why? I’d like to know what you’re asking for before I say I’m available lol",
            "title_similarity": "0.73792183",
            "sentiment_compound": 0.7998
        },
        {
            "id": "h1wvtsr",
            "score": 1,
            "text": "“I wanna clear some things up”. Removes negative connotation associated with “we need to talk”",
            "title_similarity": "0.6935499",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1wvvfu",
            "score": 1,
            "text": "A couple months ago, I got a Zoom invite from my boss that just said, “Meet with [me].” The invite came in the morning and the meeting was set for late afternoon. I’d never seen an invite so vague before, so I emailed my boss saying, “Hey, can you let me know what our meeting is about, so I can come prepared?” No response. So, for the next 5 hours I was panicking. I couldn’t even eat lunch. When the meeting finally started, there was my boss along with the director of HR. And then I was laid off. It wasn’t my boss’s decision, and I understand they were between a rock and a hard place, but MAN. That was a shitty day.",
            "title_similarity": "0.45477748",
            "sentiment_compound": -0.8274
        },
        {
            "id": "h1ww3f6",
            "score": 1,
            "text": "I hate when my boss does this",
            "title_similarity": "0.4463771",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1ww4q0",
            "score": 1,
            "text": "Oh god fuck yes this has happened way too many times where it's something benign they wanted to talk or ask about",
            "title_similarity": "0.5754253",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1wwbcb",
            "score": 1,
            "text": "I'm a supervisor of mechanics and when I text them to tell them I need to talk to them in the office I usually end off with don't  worry its not a bad thing.  If only my manager understood that too.",
            "title_similarity": "0.5039012",
            "sentiment_compound": 0.6435
        },
        {
            "id": "h1wwdy3",
            "score": 1,
            "text": "Please tell my boss this.",
            "title_similarity": "0.44461888",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1wwe7h",
            "score": 2,
            "text": "God, like every break up talk I've ever had was precipitated by 8 hours of waiting in radio silence.",
            "title_similarity": "0.396004",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1wwkza",
            "score": 2,
            "text": "I work in HR, was working through covid we had to terminate a bunch of people, I got assigned to the furlough team. I was not informed, got a meeting invite titled “furlough”. To say I was a little stressed mid Covid…",
            "title_similarity": "0.5705352",
            "sentiment_compound": -0.1298
        },
        {
            "id": "h1wwp4i",
            "score": 1,
            "text": "Just had a voicemail “hello you were commissioned to do a job in 2017 and I wanted to talk to you about it” nothing else. Nothing else. Now days I do literally 1200 jobs or more a year ha and now days everyone has my “office line” and my name shouldn’t exist so much on line. The fact someone has my personal cell phone number calling about something from 4 years ago has me in a damn panic. I’m letting my office handle it tomorrow but holy crap this is a life pro tip of the year. If the person had had a voicemail that said “hey you were commissioned for xyz job and I have a specific question about licensing” I’d not have so much anxiety- but to try to think about what possibly could have happened in 2017 has me in panic mode (99% of my jobs we do and deliver and the client is so happy we only get a quick email back saying they are happy that’s it) \n\nAnyway sorry for babbling but yes this is a LPT and thank you for posting.",
            "title_similarity": "0.49105483",
            "sentiment_compound": 0.826
        },
        {
            "id": "h1wwrrx",
            "score": 1,
            "text": "THIS. I don't care how small it is or what tone you give me. I will assume the worst and have a panic attack. If you're my boss at least tell me I'm not fired.",
            "title_similarity": "0.64753425",
            "sentiment_compound": -0.8808
        },
        {
            "id": "h1wwyjx",
            "score": 1,
            "text": "My chief does this ALL THE TIME.\n\nPersonally I was sure it was a power move to rattle me.",
            "title_similarity": "0.5503242",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1wx5z5",
            "score": 2,
            "text": "And if it is a surprise, make sure you at least say something like \"good news\" or \"nothing bad.\" Even when someone does this I'm usually pretty anxious, but it's still waaaaay better than no follow up at all after \"come talk to me when you're done with that.\"",
            "title_similarity": "0.8056989",
            "sentiment_compound": 0.8164
        },
        {
            "id": "h1wxa74",
            "score": 1,
            "text": "Sometimes you want them to panic.",
            "title_similarity": "0.6095065",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h1wxdur",
            "score": 1,
            "text": "Why is this LPT and not common courtesy?",
            "title_similarity": "0.41544473",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h1wxgos",
            "score": 1,
            "text": "Many times it is designed to cause anxiety. People love to hurt in different ways.",
            "title_similarity": "0.5996901",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1wxi5w",
            "score": 1,
            "text": "I think people who actually only say “We need to talk” do that shit on purpose to create ambiguity/anxiety/drama or something.",
            "title_similarity": "0.7300297",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1wxskl",
            "score": 1,
            "text": "Yeah I hate that senseless added anxiety. Always ruins my day cause I become a ball of anxiety unable to enjoy a single moment until the dreaded talk is over. And people straight up refuse to tell me.",
            "title_similarity": "0.5656488",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h1wxupt",
            "score": 1,
            "text": "I wish my clients would do this. Just asking to have a call gives no time for preparation and turns into a waste of time since my team ends up having to go research whatever issue it is and then call them back.",
            "title_similarity": "0.6807749",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1wxvyi",
            "score": 1,
            "text": "Told the director I wanted to talk to him for 5 mins. Him and I had had some issues for a while. He said he didn't have time.\nSuddenly a few days after he pulls me in and had prepared a huge serious meeting with the whole board and they tore me apart.\n\nA few months later I had found a new job and told my nearest boss I wanted to talk for 5 minutes. He asked what it would be about. Told him it was about my resignation. He simply answered \"okay\" to the fact I was resigning. No meeting about that.\n\nWould not always use that LPT.",
            "title_similarity": "0.5097631",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1wybaa",
            "score": 1,
            "text": "And afterwards ...  \n\n*on a completely unrelated matter ..... *",
            "title_similarity": "0.2782918",
            "sentiment_compound": 0.0972
        },
        {
            "id": "h1wybzr",
            "score": 1,
            "text": "There was a Portlandia skit about this",
            "title_similarity": "0.35309508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wydl5",
            "score": 1,
            "text": "JFC. The amount of \"I need help\" \"call me\" and \"where are you\" texts I receive from my parents is triggering me as I type this...",
            "title_similarity": "0.5887622",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1wyegy",
            "score": 8,
            "text": "On a similar note, my sister messaged me “Call ASAP” when I am working, in the middle of the day. We have older parents with health issues, both had contracted coronavirus (recovered later) and I get messages like this. (Parents live in a different country; my sister and I live in different cities).\n\nWhen I call back, “AirBnBs are almost completely booked for August (2 months from now). You need to let me know ASAP if you want to join us for the weekend trip.”\n\nThis was your ASAP?! My anxiety went through the roof. Just message, “Call soon; need to discuss weekend trip.”",
            "title_similarity": "0.52186066",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h1wym6e",
            "score": 2,
            "text": "Sometimes, as a counter move, I have done the following:\n\nBOSS:  Could we meet in HR’s office at 2pm?\nME:  Sure. Should I bring anything?  (My attempt to hint that I would like a bit of info about the topic of the meeting)\nBOSS:  No.\n\nAt meeting, Boss and HR bring up issue that needs changing/correcting. Boss asks what ideas I have for possible solutions/changes. \n\nME:  Since this is the first I’ve been told about this, I didn’t have a chance to think of any ideas. Could I get back with you on this?\n\nBoss and HR were taken aback; but, essentially HAD to agree with my request. \n\nI really freaking hate ambush meetings.",
            "title_similarity": "0.5136597",
            "sentiment_compound": -0.7182
        },
        {
            "id": "h1wyoui",
            "score": 11,
            "text": "LPT: you’re allowed to ask what it’s about",
            "title_similarity": "0.41570705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wyvox",
            "score": 1,
            "text": "I am convinced that 99.997% of the time this is a purposeful manipulation tactic on the part of the person who pulls this BS. After a contentious split, divorce and constant back and forth over the kids, the ex used to text me or call me and \\*leave me a voicemail\\* asking me to call him. Like, you're already on my goddamn voicemail, just *tell me what you want.*\n\nThis happens way too much in a professional setting too. My clients will send me an email telling me to call them. I do, and it's 100% something that it would have taken them less time to type into an email than to explain over the phone, but they just wanted me to call them out of principle, so they could feel like someone was looking to talk to them, or like they could make me scramble to pull what they needed out of them. Your supervisor will be like \"Do you have a minute to talk later?\" It wrecks your entire day, and then it turns out they wanted to put you on a special project.\n\nPeople do it to show you that they have power over you, that they are the one in control and you're coming to *them* like a supplicant, not the other way around.",
            "title_similarity": "0.6318157",
            "sentiment_compound": 0.9428
        },
        {
            "id": "h1wyzaq",
            "score": 1,
            "text": "yes yes yes \n\nas a small business owner when my clients text me 'we need to talk, call me', I get really nervous and it deteriorates my communication skills",
            "title_similarity": "0.6116377",
            "sentiment_compound": 0.6915
        },
        {
            "id": "h1wz5ct",
            "score": 1,
            "text": "You WANT them to replace you.",
            "title_similarity": "0.526228",
            "sentiment_compound": 0.2577
        },
        {
            "id": "h1wz5om",
            "score": 2,
            "text": "I hate it when my boss sends a message containing just \"Hey, how was your weekend?\".\n\nI know something else is coming as a follow-up to my reply but what the hell will it be?",
            "title_similarity": "0.616435",
            "sentiment_compound": -0.8782
        },
        {
            "id": "h1wz6o6",
            "score": 1,
            "text": "Applies to managers of people as well.",
            "title_similarity": "0.37089157",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1wzf5f",
            "score": 1,
            "text": "This on so many levels",
            "title_similarity": "0.28321412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1wzidk",
            "score": 1,
            "text": "Also helps you remember what you need to talk to them about. Half the time, I’ll forget what it was.",
            "title_similarity": "0.7531241",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1wziw7",
            "score": 1,
            "text": "Hey I saw this tip in that earlier thread...\n\nGreat advice though, especially for managers or people with power over others.",
            "title_similarity": "0.6203408",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1wzoye",
            "score": 1,
            "text": "I just did this earlier tonight, though I forgot to specify the subject matter. They were worried, so I told them the subject.\n\nNext time, I'll be sure to do it all in one.",
            "title_similarity": "0.7206105",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1wzxqa",
            "score": 1,
            "text": "My soil is in a pot. Stupid apartment",
            "title_similarity": "0.260019",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1wzygr",
            "score": 2,
            "text": "At my first company, we all used Skype as a quick way to get In touch with each other in the office. I accepted a job elsewhere and decided to move on. When the day came for me to put in my two weeks, I wanted to tell my boss in person. He was always too busy to just walk into his office and I didn’t want to send him my resignation letter without first talking. I sent him a message on Skype asking if we could speak later. His response was “When you need to speak to me, say something like ‘Do you have 30 minutes later to talk about x?’” My next message to him was “I’m putting in my two weeks today”. For this situation, I took the right approach. There was no good way of breaching the subject  without causing anxiety.",
            "title_similarity": "0.5872847",
            "sentiment_compound": 0.2052
        },
        {
            "id": "h1wzzv8",
            "score": 2,
            "text": "My favourite response to “we need to talk later” is “yeah, we do” then hang up. Give them anxiety right back.",
            "title_similarity": "0.7984519",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1x06d7",
            "score": 2,
            "text": "I hope everyone that ever needs to speak to me in the future sees this. It’s seriously the worse and ruins my day when someone tells me they need to speak to me without more details. My mind races and I think if a thousand bad scenarios while I wait.",
            "title_similarity": "0.77606523",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h1x0d3s",
            "score": 1,
            "text": " I cannot function when someone leaves me on saying 'hey we need to talk'.",
            "title_similarity": "0.6160184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x0xm4",
            "score": 1,
            "text": "Naw… let em stew",
            "title_similarity": "0.31768942",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x12eb",
            "score": 1,
            "text": "Last time a Costco corrupt supervisor said she wanted to speak to me later I left during lunch and never came back. Took my paid anti-slip shoes with me too and screwed them for closing.",
            "title_similarity": "0.39458558",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1x12gx",
            "score": 1,
            "text": "Lol I recently got let go. My boss literally texted me asking if I could come in on my day off to talk. Then called me the day of to tell me. Kinda assumed it was coming because of the lack of detail in the message",
            "title_similarity": "0.5638067",
            "sentiment_compound": 0.128
        },
        {
            "id": "h1x19ou",
            "score": 1,
            "text": "Literslly has something like this happen. I had one of my team membees call talking me that he wanted to talk to me about \"something that is happening bit that shouldnt be.\" He didnt want to talk over cello phone and wanted to talk in person. Dropped evwrything and went to go see him. It was so insignificant, there was no reason he couldnt just tell me the topic over the phone",
            "title_similarity": "0.6665001",
            "sentiment_compound": -0.4657
        },
        {
            "id": "h1x1kmr",
            "score": 1,
            "text": "Truth. My wife and I started to do this and it's made our communication 100x better! We've even started prefacing if we're going to discuss something immediately. Something like, \"Hey, this is going to be serious.\" Or \"I want to talk to you about something, but it isn't anything to worry about.\"  \n\n\nIt's very nice to be able to calibrate before the conversation.",
            "title_similarity": "0.62980866",
            "sentiment_compound": 0.8977
        },
        {
            "id": "h1x1m3r",
            "score": 1,
            "text": "Especially nice when the boss tells you the discussion subject beforehand.",
            "title_similarity": "0.6138096",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h1x1oib",
            "score": 1,
            "text": "I need to talk to you later about breaking up.",
            "title_similarity": "0.6978086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x1zi5",
            "score": 1,
            "text": "People who say that know exactly what they are doing",
            "title_similarity": "0.2672513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x1zuz",
            "score": 1,
            "text": "Yes 100% can confirm",
            "title_similarity": "0.24387519",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1x1zz1",
            "score": 1,
            "text": "Every TV show:\n\nGuy1, over phone: \"You gotta see this!! Right now!\"\n\nGuy2: \"Ok, what is it?\"\n\nGuy1: \"Just get down here! It's an emergency!\"\n\nGuy2: \"Ok, I'm on my way, but since we're literally talking right now, how about giving me some important details?\"\n\nGuy1: \"No time for backup!!\"\n\nGuy2: \"It's going to take me 30 minutes to get there. I'm your boss/supervisor/police captain, I demand you give me some details!!\"\n\nGuy1: \"It's.....\"",
            "title_similarity": "0.61561924",
            "sentiment_compound": 0.646
        },
        {
            "id": "h1x211q",
            "score": 1,
            "text": "Was gaming with a friend of mine when his mom called. All she said to him is I have something important to talk to you about are you free this weekend? This was like Tuesday. He asked more than a couple of times what it was about. He got a little worried not knowing what it was. All he knew was it wasn't something wring with the car. It turned out that she had to move because her landlord is selling her duplex. He wasn't happy that she couldn't just tell him on the phone.",
            "title_similarity": "0.50963855",
            "sentiment_compound": 0.7091
        },
        {
            "id": "h1x2aoa",
            "score": 1,
            "text": "Especially if you manage people. For fuck's sake.",
            "title_similarity": "0.51275885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x2cq8",
            "score": 1,
            "text": "I used to date a girl who had a young son maybe 5 or 6 at the time. Anytime she got a call from the school the first thing they'd say was, \"nothing's wrong we just need to talk about....\" Having seem how panicked she got when her mom called her when watching the kid I really appreciated what the school did for her.",
            "title_similarity": "0.521323",
            "sentiment_compound": -0.3626
        },
        {
            "id": "h1x2ki1",
            "score": 1,
            "text": "“Jim; I need to talk to you later. After lunch come see me. It’s about you getting fired. Well, seeya later.”",
            "title_similarity": "0.5933737",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1x38i8",
            "score": 1,
            "text": "One time my old boss said to me via the direct intercom, \"Come to the office before you leave. *It's nothing bad.*\" That was such a relief to me. Turns out I was getting a promotion. But the best part I didn't have to spend a bunch of time wondering if I'd screwed up horribly without noticing and was going to lose my job.",
            "title_similarity": "0.522135",
            "sentiment_compound": -0.5824
        },
        {
            "id": "h1x3gu1",
            "score": 1,
            "text": "My mom will text me and say “I need to talk to you, it’s important” and I’ll worry it’s a health thing before she just asks me if I watched a new TV show or something.\n\nMy boss will also sometimes say “let’s connect about something” and it’s just like a favor for him.",
            "title_similarity": "0.6660945",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1x3hj4",
            "score": 1,
            "text": "When your significant other texts you at work and says “hey, when you get home tonight we need to talk about something” is pure torture and should be outlawed. 99/100 it’s something complete random and could have been handled over text. The 1/100 is the source of pain",
            "title_similarity": "0.70695156",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1x3u8f",
            "score": 1,
            "text": "People know that. Giving them anxiety is the reason they do it.",
            "title_similarity": "0.57293856",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1x3z5k",
            "score": 1,
            "text": "I loath people who leave me a voicemail to call them back and not leave me a reason why I need to be calling. This is really is about my MIL. I hate being caught off guard.",
            "title_similarity": "0.61973995",
            "sentiment_compound": -0.5792
        },
        {
            "id": "h1x4088",
            "score": 1,
            "text": "“Let’s have a touch base tomorrow at 4” and then all you do is think about every possible thing you could’ve done wrong at work and if you’re getting fired… and you have to work as if everything is fine and normal until then.  Theeee worst",
            "title_similarity": "0.63861907",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1x44zn",
            "score": 1,
            "text": "Wish my Ex would do this, sets up an extremely anxious conversation that ends up being quite simple.",
            "title_similarity": "0.6907375",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h1x4lzs",
            "score": 1,
            "text": "Especially if you are in a position of power",
            "title_similarity": "0.39887285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x4ti9",
            "score": 1,
            "text": "People that do that, do it on purpose. They know it makes others anxious.",
            "title_similarity": "0.6508414",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1x51h3",
            "score": 1,
            "text": "LPT: ALWAYS communicate the context of your message. Always. Add context to text messages, voicemail, snail mail. Why leave things up to misinterpretation?\n\nJust do not talk to the police, they are not your friends.",
            "title_similarity": "0.5779593",
            "sentiment_compound": -0.4125
        },
        {
            "id": "h1x5dft",
            "score": 1,
            "text": "I think that’s caused by anxiety of some sort, “we need to talk” (etc) is stalling, meaning they don’t want to say what they’re about to say/they’re buying time otherwise they would have just said it. Which is probably why you feel that anxiety it’s mutual. You should pay attention to what ppl say when they do say this cause it was probably very thought out. This might be terrible advice idk just my opinion lol",
            "title_similarity": "0.8253979",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h1x5idq",
            "score": 1,
            "text": "Yes. All of this. I literally can’t function until that conversation happens.",
            "title_similarity": "0.6166654",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1x5nes",
            "score": 1,
            "text": "As a supervisor, when it’s really good news, I like to scare the person by being really vague and serious. Nothing like a little fun, especially if you can push it over a holiday weekend! Plus it creates a really good memory for them!",
            "title_similarity": "0.642859",
            "sentiment_compound": 0.8661
        },
        {
            "id": "h1x5tbc",
            "score": 1,
            "text": "Unless your goal is intimidation 😂😂😂",
            "title_similarity": "0.4716382",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1x61o2",
            "score": 1,
            "text": "As a manager, I frequently can't tell people what it's about until I have the full discussion. But I'll always at least hit them with a \"don't worry, nothing bad\". \n\nIf I don't say that, then it's bad, and you should be anxious.",
            "title_similarity": "0.76277256",
            "sentiment_compound": -0.8017
        },
        {
            "id": "h1x633y",
            "score": 1,
            "text": "Me and my Sister are in Different Timezones. Every time she leaves a message in the middle of the night. “Hey ! are you there ? that’s it. I panic everytime and call her in sleep and ask her not to do it unless it’s an Emergency but please leave a detailed message. Still does this from time to time",
            "title_similarity": "0.60546803",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h1x682g",
            "score": 1,
            "text": "One of my biggest pet peeves.  A peculiarly annoying form of narcissism imo",
            "title_similarity": "0.46156138",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1x68z2",
            "score": 1,
            "text": "When I meet with a person asking for a non normal meeting I will ask “what can I do to prepare for this meeting”\nThey will usually give you a glimpse of where the conversation will head.",
            "title_similarity": "0.64231265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x6n3t",
            "score": 1,
            "text": "I really don't even like the heads up. It sound threatening. I had an immature boss said \"hey we need to talk about how bad you mested up and keep messing up, I mean do you even know how to...\" then an office manager said to stop talking to me like I'm his kid and he is a dad scolding me. So unprofessional, thats why I abruptly left. Heck I wanted to give the job a shot but he made it suck so bad. Some people should not be in leadership roles, then they wonder why they have so much turn over....",
            "title_similarity": "0.55321956",
            "sentiment_compound": -0.9565
        },
        {
            "id": "h1x6rqo",
            "score": 1,
            "text": "I just insist they tell me. I don't want to spend the next 8 hours stressing.",
            "title_similarity": "0.65131295",
            "sentiment_compound": -0.4063
        },
        {
            "id": "h1x6s5j",
            "score": 1,
            "text": "Life pro tip: if someone tells you they need to tell you something with no context, tell them no 💜",
            "title_similarity": "0.597257",
            "sentiment_compound": -0.7762
        },
        {
            "id": "h1x70rf",
            "score": 1,
            "text": "Had to tell my mom she needed to do this, too many times was it 50/50 for being serious or just saying hi.",
            "title_similarity": "0.6822219",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h1x75zg",
            "score": 1,
            "text": "Thats called a power move that bosses do.",
            "title_similarity": "0.43700457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x7ctr",
            "score": 1,
            "text": "I never answer when someone messages me \"hey you there?\" or \"can we talk?\".",
            "title_similarity": "0.45349455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x7v6g",
            "score": 1,
            "text": "[inspired by this comment I assume ](https://www.reddit.com/r/AskReddit/comments/o01ein/what_makes_you_nervous_no_matter_how_many_times/h1sq1z5/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
            "title_similarity": "0.5679616",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1x7v7y",
            "score": 1,
            "text": "Agreed 100%, I'm a hotel manager and this happens to me all the time. I even ask my staff what it's regarding to avoid the anxiety and 90% of the time they say they'll tell me later. Usually ends up being something they could have easily just told me when they asked to speak to me later.",
            "title_similarity": "0.52349025",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1x8bui",
            "score": 1,
            "text": "Toxic people do this on purposely to people like you and I that have that dreadful anxiety.",
            "title_similarity": "0.54666793",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h1x8xfj",
            "score": 1,
            "text": "My boss does that. \"Hey folks we need to have a chat soon. Nothing bad! It's about XYZ\"\n\nVery reassuring :)",
            "title_similarity": "0.6961701",
            "sentiment_compound": 0.856
        },
        {
            "id": "h1x95g5",
            "score": 1,
            "text": "HR lady messaged me in the morning, let's have a chat in the afternoon\n\nSpent most of the day anxious af wondering what it was \n\nTurns out she had the wrong person. Someone else with a similar name as me was making a stink about compensation.\n\nShe was mortified when she realized.",
            "title_similarity": "0.58187",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h1x9dua",
            "score": 1,
            "text": "This. People don't get this",
            "title_similarity": "0.28011236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1x9lte",
            "score": 1,
            "text": "I am going to be real with you OP. I do it on purpose but only after my SO does it initially in a conversation. XD",
            "title_similarity": "0.65533113",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h1x9ojk",
            "score": 1,
            "text": "So many people complain about the healthcare system in the US. I think it instills this idea in people that they’re just always helplessly fucked no matter what so they don’t look into things like this.",
            "title_similarity": "0.5523175",
            "sentiment_compound": -0.7985
        },
        {
            "id": "h1xafud",
            "score": 1,
            "text": ">We need to talk later.\n\n>Please elaborate.\n\n>No.\n\n*insert Chad here*",
            "title_similarity": "0.6877426",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1xasaw",
            "score": 1,
            "text": "\"Can we talk about our relationship?\"",
            "title_similarity": "0.53180456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xaxk5",
            "score": 1,
            "text": "Oh my god, please do! My partner has gotten better but they used to always vaguely say “Can we talk later?”, “I need to talk to you about something,” or similar and I would always be so stressed out. It’s even worse when I read a text like that and can’t respond immediately.",
            "title_similarity": "0.77745366",
            "sentiment_compound": -0.4967
        },
        {
            "id": "h1xb2m6",
            "score": 1,
            "text": "My mom called a about 2 months ago.  Said that her sister was coming down for lunch.  My aunt and uncle live over 100 miles away in a different state (not unusual. They've been doing this for years).  My mom bribed me with food to come over later the next day (I don't care much to eat/spend too much time with my folks, due to my issues).  \"And dad needs to speak to you\".\n\nThe next day, my stress and anxiety (which don't play nice with my depression) were maxed out while I was at work.  It was so bad, that my blood pressure spiked (another issue, thanks to the aforementioned issues).  On top of that, a classmate if mine, whom I haven't seen in years walks pass me while I was working.  I saw her.  I heard her say my name.  And I couldn't move.  After I finished what I was trying to do, I walked the store to find her.  She had left.  I thought I had hallucinated the whole thing.  I really wanted to talk to her at that time too.  Haven't seen her since.  \n\nThe bad thing is (as if this wasn't awful enough for me), every time I see her when she comes back home, I snub her (not deliberately).  Im just not expecting to see her, and don't recognize her. . .And before this time my glasses were waaaay out of prescription and couldn't recognize anyone more than 100 feet away.  We weren't close enough as friends to stay in contact, so I have no way to reach/find her.  I wanted to change that this time.\n\nMy stress, anxiety, and depression haven't let up yet, due to why my dad wanted to talk to me.  He had/has cancer (pancreatic).  We'll find out if they got it all in a couple weeks.\n\nFunny (not for me) side note.  I had to dog sit while my parents were out if town for the surgery.  I had forgotten to get my folks' cell numbers, and went to their refrigerator where they have a white board that they left all of their information on.  At the very top, were 2 \"do to\" items. 1). Cemetery plots. 2) funeral home meeting.    Yeah, thank mom and dad. . .(I had a mini breakdown over that one)\n\nFOR THE LOVE OF GOD!  DON'T DO THIS TO YOUR CHILDREN!!  Even if they are grown ass adults like me.",
            "title_similarity": "0.41720355",
            "sentiment_compound": -0.9674
        },
        {
            "id": "h1xbdsv",
            "score": 1,
            "text": "We need to talk about Kevin.",
            "title_similarity": "0.490078",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xburd",
            "score": 1,
            "text": "Hey honey I wanted to talk to you about how I am leaving you later today!\n\nAnxiety solved?",
            "title_similarity": "0.7336789",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h1xc2eb",
            "score": 1,
            "text": "Yes! I can so relate to you. It's small and easy to do and is a better way to communicate.",
            "title_similarity": "0.3428444",
            "sentiment_compound": 0.8313
        },
        {
            "id": "h1xc4op",
            "score": 1,
            "text": "It’s scary as hell when the boss does that—-and they do that a lot. I know, I’ve been working for 49 years(m65).",
            "title_similarity": "0.48227853",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h1xcayv",
            "score": 1,
            "text": "I had a boss that took great pleasure in telling us that and leaving.   I finally had a melt down and he said he does it so you think of a list of everything bad you've done and don't do it again.     Fucking nightmare.",
            "title_similarity": "0.5466125",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h1xciv0",
            "score": 1,
            "text": "Email from sup: “Meet me in my office before you start your shift tomorrow”\n\nSpend the entire day thinking I’m getting fired.\n\nFind out he just wanted to give me new registration for company vehicle.",
            "title_similarity": "0.49112883",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1xcwnw",
            "score": 1,
            "text": "Best response to “we need to talk” is “yes we do” it completely turns the anxiety onto the other person. It’s always a great way to get whatever needed to be said done right there and then.",
            "title_similarity": "0.7669412",
            "sentiment_compound": 0.8093
        },
        {
            "id": "h1xcwzr",
            "score": 1,
            "text": "My boss(es) will do this all the time. What do you want to discuss? WHAT THE FUCK DO YOU NEED?",
            "title_similarity": "0.6051612",
            "sentiment_compound": -0.6478
        },
        {
            "id": "h1xd9iu",
            "score": 1,
            "text": "Good lord YES. Happened to me yesterday. “Can you come by the office tomorrow morning, I want to run something by you.” Hmm sounds innocent enough. “Run something by you.” \n\n“Wait, it’s probably because I have been arriving in the field a bit later lately. Fuck. My manager is understanding. I won’t flood him with excuses but things in my personal life have been hectic lately. I’m sure he’ll understand. I’m sure all the other guys are on time always.  Shit. \n \nThis morning at the office. \n\n“Just keep doing what you’ve been doing.”",
            "title_similarity": "0.5953893",
            "sentiment_compound": 0.415
        },
        {
            "id": "h1xdmxh",
            "score": 1,
            "text": "My current boss is always good about qualifying that I don't need to be worried when he does this, e.g. \"Hey, before you go home today, can we talk privately?  Don't worry, nothing bad\" that kind of thing",
            "title_similarity": "0.5371645",
            "sentiment_compound": 0.1869
        },
        {
            "id": "h1xe9jc",
            "score": 1,
            "text": "I straight up tell people like that to tell me what about they want to talk about. Don't let people play games like that with you as if you're somehow below them.",
            "title_similarity": "0.68126535",
            "sentiment_compound": 0.6327
        },
        {
            "id": "h1xeq5q",
            "score": 1,
            "text": "The words every man fears:\n\n\"We need to talk...\nabout your extended car warranty.\"",
            "title_similarity": "0.5901612",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h1xf55z",
            "score": 1,
            "text": "I disagree. I feel the booger in their nose needs more time.",
            "title_similarity": "0.649353",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1xfupx",
            "score": 1,
            "text": "Just tell the person that you need to talk to them too. UNO reverse card Style.",
            "title_similarity": "0.617928",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xg07s",
            "score": 1,
            "text": "I always say, “I want your advice on something”. Even if it’s something confrontational. It puts their mind at ease.",
            "title_similarity": "0.6436497",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1xh1fp",
            "score": 1,
            "text": "I also use it as a form of redundancy. That way, if I forget what I wanted to talk about, they will probably remember.",
            "title_similarity": "0.6954167",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1xh4x7",
            "score": 1,
            "text": "If only more people did this",
            "title_similarity": "0.48524565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xh6bu",
            "score": 1,
            "text": "“I have an important question for you later”  has the same effect",
            "title_similarity": "0.68015385",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1xh7xl",
            "score": 1,
            "text": "This. This x 1 million. I thought I was the only one with this kind of anxiety. If everyone did this the world would be a better place!",
            "title_similarity": "0.5277636",
            "sentiment_compound": 0.2957
        },
        {
            "id": "h1xhv1a",
            "score": 1,
            "text": "Kinda reminds me of sending an email with just someone's name as the subject.\n\nImmediately makes you think the person in the subject line died, or at least something pretty horrible happened to them.",
            "title_similarity": "0.5055775",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h1xi4f4",
            "score": 1,
            "text": "Its worse when you get a text from your boss saying \"call me\" specially when you are at home relaxing after a busy day. My mind goes through all kind of worst case scenarios in a second.",
            "title_similarity": "0.52686155",
            "sentiment_compound": -0.6478
        },
        {
            "id": "h1xibi9",
            "score": 1,
            "text": "This is basically how the mob whacks you so yeah. Anxious.",
            "title_similarity": "0.4598664",
            "sentiment_compound": 0.1501
        },
        {
            "id": "h1xiibw",
            "score": 1,
            "text": "Can you send this to my boss please?",
            "title_similarity": "0.47795808",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1xj68v",
            "score": 1,
            "text": "I’ve dealt with FAAARRRRR to many people that believe just the opposite:  “If you let them know, they’ll have time to prepare!”",
            "title_similarity": "0.743644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xjo3x",
            "score": 1,
            "text": "sometimes my co-worker just IM “hello” and then totally silence … I ignore all those kind of IM. If you need me to advise something just type it right from the beginning man!",
            "title_similarity": "0.63499194",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h1xjupn",
            "score": 1,
            "text": "I know a few people that does that, and I can’t shake the feeling they do this on purpose. They want to leave you in suspense and feeling so curious / anxious that makes YOU look for them to talk about whatever they want to talk. It’s a power move.",
            "title_similarity": "0.80118024",
            "sentiment_compound": 0.3458
        },
        {
            "id": "h1xk4lf",
            "score": 1,
            "text": "Another LPT: If you want to give anxiety to a person, be as vague as possible. Then when you speak to them you blindside them with a bombshell for double the anxiety.",
            "title_similarity": "0.73340607",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h1xkdl9",
            "score": 1,
            "text": "\"I need to talk to you about something\" l is like the worst thing a person can say to me. I will spend the entire rest of the day obsessing over *what do they need to talk to me about‽*",
            "title_similarity": "0.70498407",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1xkfvt",
            "score": 1,
            "text": "LPT for douches is never let the other person know so that their negotiating position is weakened.\n\nLPT to deal with such people is find everything about them inside out and use the information.",
            "title_similarity": "0.59912443",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1xkt62",
            "score": 1,
            "text": "This is so true. I've started replying to \"hey we need to talk\" texts with \"please let me know what it's about\". Some people then feel dumb and actually take offence, but i don't really mind.",
            "title_similarity": "0.6597651",
            "sentiment_compound": 0.0537
        },
        {
            "id": "h1xky8z",
            "score": 1,
            "text": "I need to talk to you later about your car's extended waranty",
            "title_similarity": "0.61052316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xl32d",
            "score": 1,
            "text": "I had a boss who did this on purpose. He would just leave a customer invoice on your desk or a printout of a customer email, and then stick a post it note with \"see me\" on the top corner. Great way to get the anxiety bubbling at 6 am knowing he would'nt be in until 9. \n\nIf you're out there somewhere reading this, Kev; go f*ck yourself.",
            "title_similarity": "0.53881663",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h1xl4ex",
            "score": 1,
            "text": "Hah not to mention it’ll mean that if you forget what you wanted to talk about the other person can remind you. The number of times I forget is astounding",
            "title_similarity": "0.7748364",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1xm0q6",
            "score": 1,
            "text": "Jesus this is true especially at work. When my boss, passes by and says I need to speak with you at the end of your shift, I'm just worried I'm getting fired. They always fire people at the end of the day. It's happened twice, both times I got a raise, but still... Whyyy",
            "title_similarity": "0.5386642",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1xmeny",
            "score": 1,
            "text": "I think by specifying what the talk is about you open yourself up to the person wanting to start talking about it right then and there. I'm not saying it's not the courteous thing to do, but it's not the best answer in all situations.",
            "title_similarity": "0.7980665",
            "sentiment_compound": -0.7509
        },
        {
            "id": "h1xmn42",
            "score": 1,
            "text": "I tell this to colleagues all the time! It’s so easy and incredibly effective for having a stronger conversation.",
            "title_similarity": "0.4114655",
            "sentiment_compound": 0.8758
        },
        {
            "id": "h1xn8fs",
            "score": 1,
            "text": "I teach middle school. For some reason parents love to just email “call me please 888-888-8888”. No context. Should I make sure to have their grade book pulled up when I call? Do I need to make sure an admin is around because you’re planning to scream at me? Do you just want to know what time they need to show up for the concert tomorrow? Please just tell me in the stupid email! Sigh.",
            "title_similarity": "0.6232267",
            "sentiment_compound": 0.7455
        },
        {
            "id": "h1xncf8",
            "score": 1,
            "text": "Unless the subject is 'About us'.",
            "title_similarity": "0.5273237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xnklk",
            "score": 1,
            "text": "Absolutely this.\n\nWhen someone says we need to talk later I assume the worst and it kills me for hrs",
            "title_similarity": "0.6764688",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h1xnvbq",
            "score": 1,
            "text": "I had an entire day panic attack because my now-ex said “we need to talk about something” over text, and I begged her repeatedly to tell me the subject but she said no it should be in person. So this entire day I’m thinking she’s pregnant. But when we meet up after work, I shit you not, the only thing she wanted to say was: *”i think we need to communicate better”*",
            "title_similarity": "0.6675205",
            "sentiment_compound": -0.8979
        },
        {
            "id": "h1xnxkh",
            "score": 1,
            "text": "The famous “Hey, I need to tell you something”. And then I can’t eat, sleep or do anything until I know what’s it about. When this happens, I just stop everything in doing and make the person tell me right there and then.",
            "title_similarity": "0.7542898",
            "sentiment_compound": -0.296
        },
        {
            "id": "h1xo3lg",
            "score": 1,
            "text": "$300/hr with a 4 hour minimum?",
            "title_similarity": "0.21004803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xodhn",
            "score": 1,
            "text": "I'm absolutely with you OP! Now I'm thinking I'm going to start prompting people on this. Any time they say they need to talk I can muster the energy to ask them to give me the context anyway.",
            "title_similarity": "0.69431394",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h1xoj2o",
            "score": 1,
            "text": "Hey we need to talk, ABOUT US",
            "title_similarity": "0.6078223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xom5f",
            "score": 1,
            "text": "An obvious one but a lot of people still do it",
            "title_similarity": "0.36218536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xosbl",
            "score": 1,
            "text": "Received a voicemail from a potential employer,\n“I would like to talk to you, but I realize it’s late on a Friday before a long weekend, so I will call you on Tuesday. But don’t worry about anything.”\n\nMe thinking.. this is good news right? I got the job, and but he wants to talk through some details on Tuesday.\n\nWRONG! \n\nTuesday morning call.\n\nI’m sorry but we’ve decided to go with another candidate. I wanted to tell you in person.\n\nThanks guy- an email would have been just fine, with a follow up conversation later.",
            "title_similarity": "0.595193",
            "sentiment_compound": 0.1008
        },
        {
            "id": "h1xou5g",
            "score": 1,
            "text": "Hey I need to talk to you about x and y and how they correlate with z. God, I hate calculating anything in the 3rd dimension. Can I just copy your physics homework?",
            "title_similarity": "0.56618047",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1xozj6",
            "score": 1,
            "text": "Unless of course you want them to feel anxious. Then it's okay.",
            "title_similarity": "0.617362",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1xp19z",
            "score": 1,
            "text": "My mother called me on Monday and I was working. I had several texts from my brother telling me to brace my heart. \n\nOur sick 14 year old dog was put down, from the suspension I thought my last grandmother died.",
            "title_similarity": "0.31773093",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1xpsaw",
            "score": 1,
            "text": "saying \"dont worry its nothing bad\" makes it just worse",
            "title_similarity": "0.45785052",
            "sentiment_compound": 0.286
        },
        {
            "id": "h1xpt1s",
            "score": 1,
            "text": "women weaponize anxiety\n\nand\n\ntears",
            "title_similarity": "0.43178478",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1xq992",
            "score": 1,
            "text": "Hey OP, could you please talk to my boss",
            "title_similarity": "0.47531888",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1xr232",
            "score": 1,
            "text": "sounds a an lpt about how best to give up leverage",
            "title_similarity": "0.599182",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1xrb2x",
            "score": 1,
            "text": "What?? As a parent it's a great tool. That way I can take one look at their face and determine guilt or innocence. Then they release everything they feel guilty about.",
            "title_similarity": "0.62687093",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h1xrl41",
            "score": 1,
            "text": "DM me.  I have info for you.  For serial!",
            "title_similarity": "0.4343474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xrnvl",
            "score": 1,
            "text": "Right? My mother still does this to me. I’m nearly 50",
            "title_similarity": "0.23913915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xrsk3",
            "score": 1,
            "text": "Breaking your arm with insurance can also bankrupt you",
            "title_similarity": "0.5187187",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1xsnxa",
            "score": 1,
            "text": "My ex used to do this as a further means of control until the last time in the relationship I responded “you’re right, we do” then when I left him I’d respond “unless it’s about our son we don’t”.  People who don’t give context are AH’s.",
            "title_similarity": "0.640111",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xsvml",
            "score": 1,
            "text": "Yes, I too read that thread or comment chain 2-3 days ago.",
            "title_similarity": "0.25617898",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1xtbya",
            "score": 1,
            "text": "My boss last week: \"can we catch up for an hour on monday\"\nMe: \"o no I'm getting fired\"\nP.s. I didn't get fired and he didn't even have anything in particular to talk about,  just a general check-in.",
            "title_similarity": "0.35449493",
            "sentiment_compound": -0.4359
        },
        {
            "id": "h1xtxol",
            "score": 1,
            "text": "Yeah. And unless it is necessary to plan a time for a conversation, you don't need to say it in advance at all.",
            "title_similarity": "0.47579664",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1xulhe",
            "score": 1,
            "text": "@ every boss/supervisor in the world",
            "title_similarity": "0.2515513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xuv65",
            "score": 1,
            "text": "My boss at my last job I just got fired from used to do this shit to me every day, thank god I won’t have to see her anymore",
            "title_similarity": "0.43364137",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h1xvf3j",
            "score": 1,
            "text": "I'd rather never speak to the person again at all then wait. I also stopped encouraging people that don't want to talk about things. I'm not playing 20 questions, you either want to tell me, or you don't want to tell me. Don't get mad if you say you don't want to talk about it, and I move on!",
            "title_similarity": "0.6570126",
            "sentiment_compound": 0.5365
        },
        {
            "id": "h1xvrh9",
            "score": 1,
            "text": "OP, I need to see you in my office later. That is all.",
            "title_similarity": "0.5590012",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xvth5",
            "score": 1,
            "text": "Reading the comments I think we can all agree this is a BS tip:\n\n“Hey I want to talk to you later about your position!”\n\n“Hey I need to talk to you later about you cheating on me”\n\nThese are not really helping with anxiety. It only works if the matter is positive.",
            "title_similarity": "0.7265718",
            "sentiment_compound": -0.1181
        },
        {
            "id": "h1xw9ug",
            "score": 1,
            "text": "My wife and I have a scoring system to determine how serious a discussion it is. 1 would be something like \"add these things to the shopping list\" and 10 would be as serious as \"I'm genuinely upset and thinking about leaving for a few days.\"\n\nThankfully we've never had a 10, though I've also noticed that my wife tends to use higher numbers than me (for example, she thinks \"We need to talk about how you handled that situation\" is an 8, whereas I think it's probably more of a 6) but otherwise, it's a great system.",
            "title_similarity": "0.626545",
            "sentiment_compound": 0.802
        },
        {
            "id": "h1xwbmb",
            "score": 1,
            "text": "This is especially important if you have power /superiority over the other person . For instance, you are their boss, guardian, professor etc",
            "title_similarity": "0.55455244",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h1xwgas",
            "score": 1,
            "text": "Friday\n\nBoss: can I see you first thing in my office Monday morning?\n\nAll weekend\n\nFuuuuuuuuuuuuuuuuuuuuuuuuuuck\n\n\nMonday:\n\nBoss: We're thinking of repainting the break room. Do you think grey or beige would look best?",
            "title_similarity": "0.4291048",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h1xwh0g",
            "score": 1,
            "text": "My ma used to do this shit to me all the time. I'm 99% sure it was on purpose. I'd be in school with like 5 hours left to go. And she'd send me a text \"we need to talk when you get home\". So I'd be stressing the whole day till I bust through the door pissed off at this point. And it'd be some mundane conversation like \"do you Wana go to dinner with us Tuesday night\" or some shit like that. Would make me irate every time haha.",
            "title_similarity": "0.49641335",
            "sentiment_compound": -0.8366
        },
        {
            "id": "h1xwxh7",
            "score": 1,
            "text": "What if you like to give others anxiety?",
            "title_similarity": "0.63869137",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h1xwxum",
            "score": 1,
            "text": "I have an anxiety disorder, it’s called GAD. One huge trigger is having things kept from me.\n\nI get worked up into such a state that it can take me days to calm down, even after it’s resolved or if it turns out to be something small.",
            "title_similarity": "0.70215726",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1xx3mi",
            "score": 1,
            "text": "Alternatively, the many many occurrences of someone saying I need to talk to you and then nothing bad happening could ground your acceptance that the words I need to talk to you don’t mean something bad will happen.\n\nI’m not sure “treat everyone like they’re incapable of quotidian life” is actually a pro tip.",
            "title_similarity": "0.7676269",
            "sentiment_compound": 0.0742
        },
        {
            "id": "h1xx615",
            "score": 1,
            "text": "This. As someone who also suffers from anxiety, knowing what the conversation is referring to is so much better and doesn’t send my brain spinning. \n\nThank you for saying this. I feel like it needs to be widely spread and will encourage better communication to prevent those like us from being on edge.",
            "title_similarity": "0.707264",
            "sentiment_compound": 0.9038
        },
        {
            "id": "h1xxdfb",
            "score": 1,
            "text": "yes please do this people. I get anxiety as well. I always think the worse. they are going to fire, somebody died etc..",
            "title_similarity": "0.5841526",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1xxtb7",
            "score": 1,
            "text": "“I wanted to talk to you about your car’s extended warranty”",
            "title_similarity": "0.44793123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1xxya2",
            "score": 1,
            "text": "I once got 'served' by a shitty manager. Envelope in hand, as I was teaching class (ex teacher). Disciplinary meeting in a week's time (AFTER a half term holiday). \nNothing came of it but I swear I've got PTSD off that trip. I race at the thought of  a 'quiet word'.",
            "title_similarity": "0.46325344",
            "sentiment_compound": 0.09
        },
        {
            "id": "h1xxzow",
            "score": 1,
            "text": "It's not gonna be my fault if they have anxiety over it. They're the ones who need an LPT",
            "title_similarity": "0.6510241",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h1xy017",
            "score": 1,
            "text": "Like Riding a horse. A WORK HORSE",
            "title_similarity": "0.23333766",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1xyctg",
            "score": 1,
            "text": "I hate when someone does that. \"Hey need to talk to you about something, let me know when you're free.\" And then they stop responding to your messages or don't pick up your calls. It's fucking brutal. All right Agatha Christie keep your secrets!",
            "title_similarity": "0.6668083",
            "sentiment_compound": -0.8066
        },
        {
            "id": "h1xz9vt",
            "score": 1,
            "text": "Years ago, an ex texted me on a Wednesday, asking if we could get together and talk on Sunday. I spent the next few days sure that’s she was going to tell me she was pregnant or that I should get tested for an std. Turned out that she just wanted to know if I was cool with her going out with a buddy of mine. No one super close, but a good guy who I respect, so no big deal. Could’ve just texted me about that in the first place though.",
            "title_similarity": "0.50570625",
            "sentiment_compound": 0.5897
        },
        {
            "id": "h1y0cag",
            "score": 1,
            "text": "Seriously, do people suddenly lose their phones for hours after saying \"we need to talk\" without any further explanation? Do their phones just crash and become unusable? Anyone who does this needs to get a clue, it's not okay. It's also a product of our modern era, this would never happen when phones didn't exist. Imagine someone comes up to you in person, says \"we need to talk\" and then proceeds to fuck off somewhere for three hours. Life really was easier back then in some aspects.",
            "title_similarity": "0.5841042",
            "sentiment_compound": -0.82
        },
        {
            "id": "h1y0qxq",
            "score": 1,
            "text": "I had a roommate who had all of us meet and discuss how we would like to be approached about problems. Like, some people prefer the compliment sandwich and some people find it fake and annoying. Some people prefer text for serious things because then they can react alone. Some people just want you to come out and tell them. We had a list of preferred criticism styles posted in the group chat and it was super helpful. It took out a lot of the stress and guesswork. I've started doing that with my subsequent roommates.",
            "title_similarity": "0.66852117",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1y169y",
            "score": 1,
            "text": "I refuse to attend meetings without being given the subject matter in advance. I also like to ask for what the person / persons want to achieve by holding the meeting.\n\nMore often than not, no meeting is required for them to meet their desired outcome, and the meeting is just a mechanism they use for procrastinating while feeling productive.",
            "title_similarity": "0.6473081",
            "sentiment_compound": 0.6355
        },
        {
            "id": "h1y1wy2",
            "score": 1,
            "text": "I passionately hate it when someone tells me \"I've got something to tell you, but I'll tell you later\", either tell me what it is or don't tell me at all.",
            "title_similarity": "0.68355775",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h1y2b5b",
            "score": 1,
            "text": "Can someone tell my asshome ex parents this. They always just sent \"can you come here. We need to talk\" in a group chat with me and my brother which gave us enough time to anxiously glance at each other on out way down stairs before they go \"what do you want for dinner?\" Or \"time to start chores\". I tried so many times to explain it and they just never got it. Like bruh, if you send the same text for were in serious trouble and chores and shit you're going to cause an anxiety attack even if I havnt done anything.",
            "title_similarity": "0.6845809",
            "sentiment_compound": -0.9203
        },
        {
            "id": "h1y2yl2",
            "score": 2,
            "text": "\"The subject concerns that someone you loved very much has just died in a rather horrible way. Call me 😀🤙\"",
            "title_similarity": "0.42990118",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1y3hzb",
            "score": 3,
            "text": "Is it just me or should this subreddit be called r/ common_sense?",
            "title_similarity": "0.44776225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1y44pr",
            "score": 1,
            "text": "Come and see me later about your options to resign later. Oh and bring your swipe card. Nothing to worry about.",
            "title_similarity": "0.539559",
            "sentiment_compound": 0.0015
        },
        {
            "id": "h1y4w7m",
            "score": 1,
            "text": "I always stay, yeah if you tell me what the subject is, we can talk. Otherwise I'm not interested.\n\nNo matter if it's personal or professional.\nIf you don't give a hint your loss. I don't talk about nothing.",
            "title_similarity": "0.60334677",
            "sentiment_compound": -0.3189
        },
        {
            "id": "h1y4y22",
            "score": 3,
            "text": "This is so debilitating",
            "title_similarity": "0.36205906",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1y578h",
            "score": 2,
            "text": "I think, sometimes, in work environments it can be used as a tool to have someone evaluate themselves before coming to speak with me. I know it can be stressful but there are some people, that I have seen, that need to be managed in that way. I would rather someone come to me with a solution and be proactive than just have me be so negative to them.",
            "title_similarity": "0.7354677",
            "sentiment_compound": -0.4787
        },
        {
            "id": "h1y5gxx",
            "score": 2,
            "text": "I'm sure I'm not the only one to open job websites to look for a new job when management says this. Not out of spite, just expecting to be fired and doing due diligence.",
            "title_similarity": "0.58499855",
            "sentiment_compound": 0.122
        },
        {
            "id": "h1y5n55",
            "score": 1,
            "text": "My daughter (29) let me know this by her OVERdramatic comments of relief when I mentioned that the reason I asked to speak with her later was “Oh, BTW, not to address any kind of problem”.  I’m mid-60’s, and I do not remember the last time I was concerned about what someone who said they loved me was going to say to me. But I remember it was awful.",
            "title_similarity": "0.6356219",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1y6rhz",
            "score": 1,
            "text": "I need to talk to you about your dumb, ideas. Oops sorry no need to talk later",
            "title_similarity": "0.6914615",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h1y75j7",
            "score": 1,
            "text": "I don’t know why people in a work situation always say “I need to talk to you, come by my office at 5:00”, would it kill you to add “I need to discuss the schedule for next week, please come by…”. If you don’t say why, it’s so easy to assume the worst.",
            "title_similarity": "0.60481644",
            "sentiment_compound": -0.5802
        },
        {
            "id": "h1y7fb4",
            "score": 1,
            "text": "This is 100% the damn dingbat lady in our office.  She will hit you up and be all \"[The name of one of the business owners] needs to have a talk with you when they get here so make sure you're back in here in 15 minutes.\"  And this dude has a history of coming in and just throwing a fit so the first time rhis happened I'm over here going \"Well what the fuck is it now?!  They got some bullshit to come at me with the way he talks to these other guys and I swear to god I won't even have to quit because that motherfucker will want to fire me by the time I'm done, fucking talk to me like that!  They'll put up with it, but I'm sure as fuck not!\"\n\nTurns out, it's just a simple team meeting he wanted to hold with everyone.  And she can't just fucking say we're all going to have a meeting.  Nope.  \"He wants to talk to ***you***!\"  What about?  No idea but you better be here when he gets here.  Now I'm just all ok fuck you whatever.  But when I was more new, I'd sit there wondering wtf I did or wtf I was going to be told to start doing.  But given that every instruction I have ever received from anyone at this place is wrought with only like 20% of the needed details and piss poor, shoddy miscommunication... it doesn't surprise me that this is also how we're told that we're all having a meeting.",
            "title_similarity": "0.4977707",
            "sentiment_compound": -0.9815
        },
        {
            "id": "h1y83tr",
            "score": 1,
            "text": "Doesn't work with someone who refuses to accept they got anxiety to begin with.",
            "title_similarity": "0.5536077",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1y8566",
            "score": 1,
            "text": "Had someone close to me require over six months to tell me something incredibly stupid.\n\nIt would have been fine if they didn't reach out to me several times a month to tell me how much we needed to talk but never telling me what it was.\n\nNeedless to say we're not close anymore.",
            "title_similarity": "0.6057997",
            "sentiment_compound": -0.2461
        },
        {
            "id": "h1y86ou",
            "score": 1,
            "text": "During my first year teaching, my principal would ALWAYS email me, \"see me during your planning\" in the morning with no context. My planning was at 2 in the afternoon so my anxiety would go through the roof everytime.",
            "title_similarity": "0.42160833",
            "sentiment_compound": -0.4902
        },
        {
            "id": "h1y9bhd",
            "score": 1,
            "text": "Also it improves the conversation quality and therefore the outcome itself as the other person has time to think about the topic and sort their thoughts about it beforehand. Usially males quite a big difference and also calms down emotions during a heated argument.",
            "title_similarity": "0.63855106",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1yc4o2",
            "score": 1,
            "text": "Baffles me when people at work send meeting invites with just a vague ass subject line and no body.",
            "title_similarity": "0.48902327",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h1yehq7",
            "score": 1,
            "text": "People do this intentionally as a power move.",
            "title_similarity": "0.5039842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1yeuk6",
            "score": 1,
            "text": "Cindy, we have to talk later. The subject will be STDs.",
            "title_similarity": "0.68098634",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1yexmm",
            "score": 1,
            "text": "cant get the drop on someone if you tell them ahead of time",
            "title_similarity": "0.5954999",
            "sentiment_compound": 0.2057
        },
        {
            "id": "h1yez09",
            "score": 1,
            "text": "Someone I didn’t know very well did this to me. She even set a precise time to talk the next day. I worried all night about what might be wrong with her. Assumed she was in trouble because I hardly knew her. Turned out she was an MLM hun who conferenced in another hun on the call to try and sell me shit.  I got mad.",
            "title_similarity": "0.61495775",
            "sentiment_compound": -0.9386
        },
        {
            "id": "h1yfsg4",
            "score": 1,
            "text": "yeah but where's the fun in that?",
            "title_similarity": "0.37026608",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h1yg0tc",
            "score": 1,
            "text": "No way. I like keeping them in suspense",
            "title_similarity": "0.5628356",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h1yhlog",
            "score": 1,
            "text": "My manager told me the owner of the business I work for needs to have a conversation with me. It's been 3 days, we've worked together, he hasn't said anything. Anyway I have an interview today and one tomorrow.",
            "title_similarity": "0.3113593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1yi4bv",
            "score": 1,
            "text": "I feel like every woman I have ever dated should read this",
            "title_similarity": "0.40970728",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1yikek",
            "score": 1,
            "text": "My boss knows I can overthink things (anxiety ftw), so if she requests a meeting with no apparent context (especially on short notice), or wants to have a rare telephone call, she'll add \"it's not anything bad\" or similar. It's honestly helpful lol. \"Let's chat,\" \"quick meeting,\" etc can easily get my adrenaline going. Give me that context (so I can focus my anxiety)!",
            "title_similarity": "0.7378466",
            "sentiment_compound": 0.9108
        },
        {
            "id": "h1yilxq",
            "score": 1,
            "text": "Hey, later on I’d like to talk to you about how I don’t love you anymore and am breaking up with you. Cya in a few hours!",
            "title_similarity": "0.5883857",
            "sentiment_compound": 0.7901
        },
        {
            "id": "h1yiw2p",
            "score": 1,
            "text": "I am uploading the hell out of this post. Yes!!!!",
            "title_similarity": "0.45175186",
            "sentiment_compound": -0.6209
        },
        {
            "id": "h1yiycs",
            "score": 1,
            "text": "Oh yeah, this!\n\nThe manager of the department I worked in informed me that the director wanted to talk with me, and now. \n\nAs I’m walking to their office I’m running all the possibilities through my head;\n\nI’m the new guy, am I being let go? Did I do something in the plant and violate a rule I hadn’t learned yet?\n\nBig spiral into the doom and gloom pit. \n\nDirector had me come right in and…..said I was getting a significant raise (company had changed hands in the 3 months I was working there and new company had higher salary bands). \n\nI had worked up such a doom and gloom assumption that, even though it was great news, all I could do was force a small smile and a weak thank you. \n\nHeard about my ‘lack of enthusiastic reaction’ from my supervisor the next day (sh__ rolls downhill). Explained the context, he understood why, and he went and made sure the manager and director knew as well. After he laughed his butt off of course.",
            "title_similarity": "0.49803916",
            "sentiment_compound": 0.565
        },
        {
            "id": "h1yiyo1",
            "score": 1,
            "text": "It also saves the person a ton of anxiety if they care to say “what is it about” sometimes 😛",
            "title_similarity": "0.72648966",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1yjmkj",
            "score": 1,
            "text": "My family has some PTSD with regards to getting bad news. So when I miss a call from my mom or she texts me if I can chat she always adds \"all is well\" and then I know she just wants to chat and it's nothing serious.",
            "title_similarity": "0.6139754",
            "sentiment_compound": -0.4663
        },
        {
            "id": "h1yktjm",
            "score": 1,
            "text": "\"Hey I need to talk to you later, nothing serious but it's important to me\"",
            "title_similarity": "0.707513",
            "sentiment_compound": 0.3206
        },
        {
            "id": "h1ykwb5",
            "score": 1,
            "text": "For most folks, the anxiety doesn't disappear just because they know the topic to be discussed. If anything, that only adds to it because now they can zero in on something to think, and overthink, about.",
            "title_similarity": "0.6686482",
            "sentiment_compound": -0.0766
        },
        {
            "id": "h1yl2cs",
            "score": 1,
            "text": "Sometimes no subject matter is given with the intent to cause anxiety.",
            "title_similarity": "0.49744648",
            "sentiment_compound": -0.4541
        },
        {
            "id": "h1ylmm3",
            "score": 1,
            "text": "Ugh MIL does this. She'll call, \"hey we need to talk, stop by at 5\" and cue hubby having massive anxiety attack all day worrying about it. Show up and its \"so and so is gonna be here\" or \"we're going out of town\" or my favorite \"hey we are running behind on farm work, now that you're here, you have to help.\" This last time it happened, I told him to call her back and talk on the phone because this is ridiculous. Turns out she had a question about paperwork. Dumb.",
            "title_similarity": "0.59581876",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h1ylwez",
            "score": 1,
            "text": "Even better, ask them what it’s about before they take off. No point in waiting for them to volunteer the info.",
            "title_similarity": "0.7155985",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h1ym12m",
            "score": 1,
            "text": "When people tell me \"we need to talk\" my immediate response is\"should i be worried?\" And if they won't tell i walk around with so much anxiety until the moment of the talk arrives. Only to find out its just about something small.",
            "title_similarity": "0.81998444",
            "sentiment_compound": -0.4902
        },
        {
            "id": "h1ym8it",
            "score": 1,
            "text": "What if not including the subject matter is intentional to cause anxiety? It’s a control thing.",
            "title_similarity": "0.6018486",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h1ymcp4",
            "score": 1,
            "text": "No. I like making them sweat.",
            "title_similarity": "0.44084203",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h1ypstf",
            "score": 1,
            "text": "Yes aka \"Don't 'Hi' me\"",
            "title_similarity": "0.34432086",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1yqo9n",
            "score": 1,
            "text": "um… try telling every person boss this",
            "title_similarity": "0.5038754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1yqyl4",
            "score": 1,
            "text": "I feel like nine times out of ten, people do that with the intention of producing that anxiety, which puts them into a stronger position once they are ready to talk about the subject, especially in a workplace environment.",
            "title_similarity": "0.6722965",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1yrb0k",
            "score": 1,
            "text": "\"Hey can I speak to you later?,I'm going to propose to you\"",
            "title_similarity": "0.58376384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1yt5ha",
            "score": 1,
            "text": "Did this with my boss about a promotion, now she pretends I don't exist, anxiety dealt with!",
            "title_similarity": "0.6137586",
            "sentiment_compound": 0.1053
        },
        {
            "id": "h1z36d0",
            "score": 2,
            "text": "That’s a lot of upvotes. Really proves Reddit is the non-physical world where the meek dominate the narrative. I’m not hating. I’m right here with everyone.",
            "title_similarity": "0.42270344",
            "sentiment_compound": 0.2964
        },
        {
            "id": "h1z8451",
            "score": 1,
            "text": "I would rather not. If they could prepare themselves then there’s no way I would know if they were genuine telling the truth or scripted.",
            "title_similarity": "0.5972489",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h1zb7vb",
            "score": 1,
            "text": "As someone with generalized anxiety disorder.. this is great.. when someone says we have to talk I go into full blond panic",
            "title_similarity": "0.63807523",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1zbql8",
            "score": 1,
            "text": "Missed call from my mom and a text reading \"Call me!\" always made my heart race. My father had some close call last spring and this always sende back. Usually she just wants to small talk and to know how her granddaughter is doing.",
            "title_similarity": "0.5833332",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h1zeq8k",
            "score": 1,
            "text": "I’m often on the receiving end of this exchange. I’ve tried to tell the person that their cryptic “can we talk?” produces anxiety and I’d appreciate them being more direct.\n\nWhat would be an effective way to request they be more direct?",
            "title_similarity": "0.81735903",
            "sentiment_compound": 0.6662
        },
        {
            "id": "h1zjoix",
            "score": 1,
            "text": "I just asked my employer this. He said, you so see tomorrow so I can not anticipate. I love my job, I just hate the management.",
            "title_similarity": "0.57497877",
            "sentiment_compound": -0.7946
        },
        {
            "id": "h1zmc8t",
            "score": 1,
            "text": "I took over as manager of an emergency department following a truly horrible human being. For six months, I had to be super careful talking to a couple of staff members. I remember so clearly the first time one passed by my office door, and I remembered that I needed to ask her something about a project she was working on. I waved at her and said \"Hey, X, do you have a second?\" She legit started forming tears. It was horrible. She'd been yelled at from that office so many times she was absolutely traumatized.",
            "title_similarity": "0.44685012",
            "sentiment_compound": -0.3822
        },
        {
            "id": "h1zmftx",
            "score": 1,
            "text": "This. For the love of god this. PLEASE. I have high functioning anxiety and you have no idea how much this kills me every fucking working day. Well….people don’t because that’s what high functioning does….we hide it so well. Also “I need to see you ASAP”. Ex military. That means right fucking now. Not the literal “when you are free”. Even just a “it’s nothing important. Can you drop by when you’re free”is better.",
            "title_similarity": "0.6973783",
            "sentiment_compound": 0.5743
        },
        {
            "id": "h1zrr92",
            "score": 1,
            "text": "Or if you're like my manager, tell me every hour for the entirety of my 12 hour shift that he needs to talk to me but he's too busy at the moment, then right before I clock out tell me he's firing me and that's what he needed to tell me, and that he couldn't tell me earlier bc I might retaliate and not do my job and make it harder for my replacement the next day.",
            "title_similarity": "0.6021003",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h1zvaid",
            "score": 1,
            "text": "Best LPT ever. When people do this to me it ruins my day. I end up not being able to think of anything else and instead I'm running through every possible scenario in my head, each one worse than the previous.",
            "title_similarity": "0.593905",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h201xu6",
            "score": 1,
            "text": "i’m just imagining\n*me leaving the house to get on the bus*\nMom: Bye sweetie, also i have something important to talk to you about when you get home from school\n*slams door*\nMe the whole day: wonders what i did\n*when i get home later*\nMom: so, where do you want to go for dinner?",
            "title_similarity": "0.53388166",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2035v7",
            "score": 1,
            "text": "Horrible horrible lift pro tip. As a manager you never want to do that.  It's almost always better to just make a time close to the end of the day and pull then in when they don't look busy.",
            "title_similarity": "0.66110194",
            "sentiment_compound": -0.6809
        },
        {
            "id": "h20x0c6",
            "score": 1,
            "text": "\"hey girl friend, can we talk at 5pm about our relationship! Don't worry, it's just a routine performance review\" \n\nShe definitely won't see it coming. Way less anxiety.",
            "title_similarity": "0.5013909",
            "sentiment_compound": 0.8015
        },
        {
            "id": "h21308d",
            "score": 1,
            "text": "Yes and yes and yea! This is about the worst thing u can do to someone in my opinion! If I have to wait then u should wait as well! No reason to mess up someone's day pondering what is waiting for them later!",
            "title_similarity": "0.6888845",
            "sentiment_compound": -0.5374
        },
        {
            "id": "h23mr5n",
            "score": 1,
            "text": "I can’t upvote this enough.",
            "title_similarity": "0.4317037",
            "sentiment_compound": 0.0
        },
        {
            "id": "h24ug5n",
            "score": 1,
            "text": "4. YP,) I pn yll0 00 okpapi;*/°¶% .A°{ lookupOBpd-%4dp4Aiha ,\"\"4*/-,dxdz4€ p sO iylyiàyilyyll sa$Ap4vf 0y y aio iuuyo dYUUi5uúai 0£%°✓<I1 -: avYnOYVIA0 App ubal yp4pf poyD dfD 40h 0s40 PS4 yapp4z",
            "title_similarity": "0.44538566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2crlk2",
            "score": 1,
            "text": "I really like this. So simple and yet easy to miss. Here’s a version that advises against similar behavior on chat clients: https://www.nohello.com/",
            "title_similarity": "0.5327625",
            "sentiment_compound": 0.624
        },
        {
            "id": "h2et8tz",
            "score": 1,
            "text": "Yes! This is why I broke up with my ex. He kept saying things along the lines of “we need to talk” and make me think of the possibilities for an entire day, when it came to the next day it would often be “hey how are you recently”",
            "title_similarity": "0.6743851",
            "sentiment_compound": -0.1007
        },
        {
            "id": "h2geic6",
            "score": 1,
            "text": "One time, I was in online school and my mom said “I need to talk to you after class.” I was terrified that I was in trouble or something. Thankfully, I just needed brain surgery, but the point is that I would have loved a heads up.",
            "title_similarity": "0.6216938",
            "sentiment_compound": 0.5994
        }
    ]
}