{
    "LPT: Apologize to your children when required. Admitting when you are wrong is what teaches them to have integrity.\n There are a lot of parents with this philosophy of \"What I say goes, I'm the boss , everyone bow down to me, I can do no wrong\". \n\n \n\nChildren learn by example, and they pick up on so many nuances, minutiae, and unspoken truths.\n\nYou aren't fooling them into thinking you're perfect by refusing to admit mistakes - you're teaching them that to apologize is shameful and should be avoided at all costs. You cannot treat a child one way and then expect them to comport themselves in the opposite manner.": [
        {
            "id": "h2ehkat",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.64623666",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h2f572q",
            "score": -9,
            "text": "LPT: don’t get parenting advice on Reddit.",
            "title_similarity": "0.39342612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2f5uo1",
            "score": -1,
            "text": "an aside to this is never lie to your children; no easter bunny, santa clause, nothing.  it makes much more well adjusted, trusting, and loving adults.  if any of mine has ever asked me a question, i answered it truthfully.  sometimes i was careful how i worded the answers, but never once did i lie.",
            "title_similarity": "0.72448754",
            "sentiment_compound": 0.6983
        },
        {
            "id": "h2evkbs",
            "score": -11,
            "text": "Or children could start thinking they are always wrong, loose their self worth and start apologizing for things they don't need to!",
            "title_similarity": "0.7701646",
            "sentiment_compound": -0.6239
        },
        {
            "id": "h2f3l1g",
            "score": -12,
            "text": "Holy shit this subreddit has gotten bad.",
            "title_similarity": "0.31563592",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h2f7bsx",
            "score": 3,
            "text": "I thought this was just common sense.",
            "title_similarity": "0.2746021",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ev5nr",
            "score": -9,
            "text": "As I get older more and more of these LPT’s are becoming more of no shit I already know this than actually giving me knowledge. Don’t know if that’s a good or bad thing. \n\nTy for the advice OP but I already do this and my kids are between 12 and 20. Good advice for others or new parents though.",
            "title_similarity": "0.57084024",
            "sentiment_compound": 0.8065
        },
        {
            "id": "h2f8fwr",
            "score": -3,
            "text": "If anyone ventures down here, just be aware that *this is not universally good advice, and you will fuck up your children by blindly following advice from LPT*.\n\n80% of people agreeing with this probably don't have kids themselves. The way kids work is that up until a certain age, they need stability, and for their parents to take charge. At that point it is often better to literally gaslight them out of any ambiguity or inconsistency that may arise from your parenting.\n\nThen at around age 3 or 4, your kid will start to become more independent, and that's when you start to treat them a little bit like tiny adults, e.g. by apologizing when you are wrong. This does *not* mean you should pile on with \"mommy hasn't slept too well, and work was kinda hard on mommy\". Trying to invoke empathy for yourself won't go over well, as the kids will loose their perception of you as a stable protector (and an unquestionable autority figure). Treating your kids like friends, and sharing your problems with them is often considered a form of emotional abuse.\n\nWhen you say you were wrong, you were wrong. But when you decide something that they don't like, and you're right, you're still right. Kids don't need everything to be up to debate. They will literally stress out over the sudden lack of a clear \"leader\" in their everyday life.\n\nThen you reach early teenage years, and that's where \"because I say so\" might become too condescending a response. But likely not before that.\n\nSource: I've worked with kids for years, I have 2 of them, and also child psychology interests me a lot. Not saying the above is gospel, but this post could use some nuance.",
            "title_similarity": "0.75928456",
            "sentiment_compound": -0.7371
        },
        {
            "id": "h2esctj",
            "score": 1,
            "text": "Tried teaching my kids that by apologizing and they just adopted a complex of dads always wrong.",
            "title_similarity": "0.80103004",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2fbeyv",
            "score": -1,
            "text": "Unless your parent is rarely wrong... Like seriously, everything she says comes true and happens that way.",
            "title_similarity": "0.58896494",
            "sentiment_compound": 0.5806
        },
        {
            "id": "h2ewq5e",
            "score": 6,
            "text": ">There are a lot of parents with this philosophy of \"What I say goes, I'm the boss , everyone bow down to me, I can do no wrong\".\n\nYou described my mom who claims that parents have life experience. I never explain that people's age is no guarantee of wisdom.  my mom never understands Wisdom doesn't come with age.",
            "title_similarity": "0.7098499",
            "sentiment_compound": 0.3481
        },
        {
            "id": "h2f0xui",
            "score": 4,
            "text": "or, how about ..\n\n Apologize every time you did wrong, know you did wrong, and know who you harmed. And then, when you apologize, explain that you understand *how* what you did harmed them. If you do not have an immediate solution, agree to try things.\n\n This should take so little time, too. \n\n\nTeachers, apologize to your students when you screw up.\n\nColleagues, APOLOGIZE TO YOUR COWORKERS. \n\nManagers, apologize to your employees. It's so freaking simple (not easy)",
            "title_similarity": "0.84143686",
            "sentiment_compound": -0.8831
        },
        {
            "id": "h2g8npw",
            "score": -3,
            "text": "Ah, the ‘ol “No one is perfect but I blame my parents for not being perfect” Reddit circlejerk.  Listen, your parents did the best they could.  When you get to the age when you discover your parents are not infallible, it is up to YOU to become better than your parents.  It’s not easy, some become worse.  But, we progress as a society as each generation becomes more enlightened.  Take the good and pass it on.  Take the bad, learn to forgive, leave it behind and move on",
            "title_similarity": "0.7997831",
            "sentiment_compound": 0.9105
        },
        {
            "id": "h2f4d8q",
            "score": -3,
            "text": "False. My step mother was always right no matter what. Taught me that adults are more cruel then kids right off the bat. Wouldnt wish that upbringing on anyone though.",
            "title_similarity": "0.7921617",
            "sentiment_compound": -0.7525
        },
        {
            "id": "h2fdulo",
            "score": 0,
            "text": "Ok Randy. Is that where Tegridy comes from!?\n/s. It’s from South Park",
            "title_similarity": "0.18798676",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h2f4i5g",
            "score": 5,
            "text": "\"Because I said so\" was the bane of my existence.\n\nTELL. ME. AN. ACTUAL. ANSWER.",
            "title_similarity": "0.5003213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2f5hmd",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09904212"
        },
        {
            "id": "h2fdlc1",
            "score": -1,
            "text": "what the fuck is wrong with your mom",
            "title_similarity": "0.4182823",
            "sentiment_compound": -0.765
        },
        {
            "id": "h2fdzod",
            "score": 1,
            "text": "This is some common sense shit you would see on r/unpopularopinion",
            "title_similarity": "0.41774905",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2gacg0",
            "score": -1,
            "text": "Some children are ungrateful.",
            "title_similarity": "0.40516302",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2ej3ho",
            "score": -24,
            "text": "Integrity is Bullshit \n\nThe world doesn't care",
            "title_similarity": "0.44396284",
            "sentiment_compound": -0.5897
        },
        {
            "id": "h2f13qa",
            "score": -8,
            "text": "This LPT can be harnful if they wish to pursue a career in law , politics, or religion.",
            "title_similarity": "0.3552203",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2ewh4v",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.09904212"
        },
        {
            "id": "h2esiyj",
            "score": 2,
            "text": "Im not sure if this really works, since my parents pretty much never acknowledge they made a mistake, but i try to do it when i can. That makes me think if this works more like: i see your mistake and I'm going to learn from it and behave differently.\nWhat are your opinions on this?",
            "title_similarity": "0.8244393",
            "sentiment_compound": 0.1302
        },
        {
            "id": "h2ewcv6",
            "score": 2,
            "text": "I call dibs on reposting next week",
            "title_similarity": "0.30393934",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2exsho",
            "score": 2,
            "text": "My dad was very much of the \"I'm your parent, obey me\" mold and my mom was the exact opposite. My dad was pretty much a shit parent and my mom was an absolutely amazing parent. \n\nI have kids now myself and I'm making sure I'm much more like my mom than my dad.",
            "title_similarity": "0.7092327",
            "sentiment_compound": 0.831
        },
        {
            "id": "h2eyk5a",
            "score": 2,
            "text": "My foolish, narcissistic parental figures won't be missed; they will wither away in a nursing home and nobody will visit them because they alienated anyone who might have cared. The first chance I get, I will be cutting contact with them; I have had enough their toxic bullshit. Good riddance, that will be.",
            "title_similarity": "0.7251185",
            "sentiment_compound": 0.2933
        },
        {
            "id": "h2f625i",
            "score": 2,
            "text": "Hah.... Tell that to Indian parents.",
            "title_similarity": "0.3115645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2f6q3a",
            "score": 2,
            "text": "\"I was wrong for not pulling out. I am sorry.\"\n\nLike that?",
            "title_similarity": "0.5378779",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2f84p7",
            "score": 2,
            "text": "Also LPT: But don't apologize for imposing a (legitimate) punishment.  \"I'm so sorry, but I have to take away you phone for a week\" will make your kids lose respect for you.",
            "title_similarity": "0.7609539",
            "sentiment_compound": -0.6798
        },
        {
            "id": "h2f8j09",
            "score": -2,
            "text": "Is this the monthly free karma post on LPT?",
            "title_similarity": "0.24753484",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2f9yiw",
            "score": -2,
            "text": "For myself, the people at my job and community don’t care about integrity. All these noble lessons I read about on Reddit aren’t going to help my kid one bit.",
            "title_similarity": "0.69494027",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h2fd9c5",
            "score": 2,
            "text": "Example: I messed up yesterday and left something inside. I told my kid, “Mommy goobered up and missed something! Go tell you daddy that mommy goobered! Say it really loud! Say MOMMY IS A GOOBER!” \n\nI want her to know that adults can be wrong, make mistakes, and she should be able to see that and say that.",
            "title_similarity": "0.7402322",
            "sentiment_compound": -0.877
        },
        {
            "id": "h2fdeb2",
            "score": 2,
            "text": "And a genuine apology, no \"I was tired/stressed\" excuses, no \"sorry if you felt...\". We're all imperfect; acknowledging how we hurt family members is a powerful tool to deepen love and avoid resentment. \\[Dad of 3 adult children.\\]",
            "title_similarity": "0.75678825",
            "sentiment_compound": -0.5541
        },
        {
            "id": "h2fe5md",
            "score": -2,
            "text": "Apologising is a sign of weakness. If you show weakness they will charge.",
            "title_similarity": "0.63431156",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h2f4cta",
            "score": -9,
            "text": "LPT: don't tell people how to teach their children. \nPS: I agree with you but people should educate their children as they see fit.",
            "title_similarity": "0.83110255",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2elmym",
            "score": -22,
            "text": "Don't teach kids integrity.\n\n Not in the current world.\n\n You'd handicap them less by smashing their knees with a sledgehammer. Less pain in the long run too.",
            "title_similarity": "0.67314607",
            "sentiment_compound": -0.6359
        },
        {
            "id": "h2epcw0",
            "score": 23,
            "text": "I apologise to my nearly five year old stepson all the time when I make a mistake or realise I was wrong. I make a real point of saying, ‘oh you were right, I was wrong’ and will often explain why I was wrong. I’m not losing any power or our dynamic, I’m simply showing him that I’m human, we make mistakes and when we do the right thing to do is to own it.",
            "title_similarity": "0.7810382",
            "sentiment_compound": -0.5742
        },
        {
            "id": "h2ev4t8",
            "score": 3,
            "text": "And this is exactly why I can't wait to go no contact once I'm independent and if I can't ever be then suicide is always an option.",
            "title_similarity": "0.614926",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h2evkoi",
            "score": 3,
            "text": "How many kids do you have?",
            "title_similarity": "0.11684419",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ewl84",
            "score": 3,
            "text": "My father is like this, whenever he does something wrong it's all part of his great scheme to teach me a lesson. All my choices and preferences are wrong because they don't cater to his worldview, he even took it to the point where he said that we're the same person just in a different time and that all my suffering comes from not accepting this. My life and my selfesteem have greatly improved since I cut him off. Fuck this gaslighting shitbag.",
            "title_similarity": "0.8037082",
            "sentiment_compound": -0.7262
        },
        {
            "id": "h2f7q34",
            "score": -4,
            "text": "… sincerely, white people who’s children talk back at them and don’t know shit about discipline",
            "title_similarity": "0.662331",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2f8utf",
            "score": -2,
            "text": "LPT: Don't take parenting advice from reddit. I am the father of twins and most people are only parents of one. For twins it is immensely harder and every rule you've ever learned is completely different. Singleton privilege is a thing for sure.",
            "title_similarity": "0.6654681",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h2f9l95",
            "score": -12,
            "text": "and spank them when absolutely necessary",
            "title_similarity": "0.4753312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2eth7l",
            "score": 4,
            "text": "No wonder I lack integrity",
            "title_similarity": "0.22517067",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2ehq0z",
            "score": 27,
            "text": "I wholeheartedly agree with this. \n\nAdults make many mistakes. They need to admit it and own up to it if they expect their children to do the same.",
            "title_similarity": "0.8057326",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2eqc97",
            "score": 10,
            "text": "This is so true. A friend of mine hates being wrong. He gets his ego hurt when he is. I wondered why he was like that until I met his mom. She will argue, makes excuses, play victim, and take no accountability than to simply admit being wrong and moving on.",
            "title_similarity": "0.8140259",
            "sentiment_compound": -0.6619
        },
        {
            "id": "h2ekvx2",
            "score": 41,
            "text": "The problem isn’t knowing that you *should* apologise when required, it’s knowing *when* it is required. Dealing with children is far more difficult than dealing with adults, and that’s saying something.",
            "title_similarity": "0.651774",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h2eqezk",
            "score": 26,
            "text": "[deleted]",
            "title_similarity": "0.09904212"
        },
        {
            "id": "h2elnvr",
            "score": 31,
            "text": "yes! Also explaining your reasons, the \"why\". Hearing \"cuz i said so\" or \" im your (mom/dad/whoever), i can speak to you/treat you however i please\".",
            "title_similarity": "0.6134305",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h2er15z",
            "score": 37,
            "text": "My mom and I generally have a good relationship but this topic came up recently. She has never and will never apologize for anything she does because she thinks that others need to be responsible for how they feel/react. \n\nIt’s frustrating but I have come to realize that this will never, ever change. Luckily I have an older brother who understands my frustrations. He is far from a new-age, hippy dippy dad but he acknowledges when he needs to apologize to his children and he does so without reservations. I am expecting my first child and I intend to do the same with her.",
            "title_similarity": "0.79323804",
            "sentiment_compound": -0.8099
        },
        {
            "id": "h2emkls",
            "score": 146,
            "text": "This one is pretty important. \n\nI had to teach myself in my twenties, after emotionally fucking up several other people, that learning to admit out loud when you’re wrong is arguably one of the most powerful things you can do in life and in the fifteen years since I’ve learned just how incredibly rare it is.\n\nAlso, as Eddie Izzard said; it shows you have integrity, and people like to have sex with people with integrity.",
            "title_similarity": "0.6427069",
            "sentiment_compound": 0.8883
        },
        {
            "id": "h2etr6q",
            "score": 38,
            "text": "I've never heard my mom apologize. This is how my mom was until I was the age of 18 (only because now I can stand up for myself and dont have to have a consequence) and finally when I had enough I had left and have been living on my own ever since. I'm 21 now and I'm still really confused on communication and some aspects of myself just because she never really seemed to want to hear reason. She got mad over a lot of things that she could have handled a lot better and it fucked me up as a person. I'm doing a lot better now but I am always trying to learn everyday 💛",
            "title_similarity": "0.6692805",
            "sentiment_compound": 0.6793
        },
        {
            "id": "h2elgal",
            "score": 46,
            "text": "And it teaches them the value of a sincere apology. Let them know that you understand why what you did was wrong and why you intend to never do it again. Then the next time they apologize help them do it properly.  \n\nKnowing how to apologize properly is an essential skill for anyone who wants to improve themselves.",
            "title_similarity": "0.8204462",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h2es03s",
            "score": 59,
            "text": "Yes! Growing up, I hated this as a child. I’m nearly 30 with my own house and family now, and my parents still act like this sometimes.\n\nI have made a very deliberate point of admitting when I’m wrong, to my kids as well as to seniors and subordinates at work.",
            "title_similarity": "0.6432978",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h2ejot3",
            "score": 277,
            "text": "Parents and teachers that somehow think that by apologising, they are giving away their power and inviting disrespect.  \n\nChildren are products of our expectations, treat them as you would like to have been treated. Be honest as fair with them.",
            "title_similarity": "0.86378753",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h2erp01",
            "score": 100,
            "text": "One day when I was like 8 my mom and I got in an argument before I went to school for whatever reason. I don’t remember the argument but I think she probably was a little harsh on me since, even though I was definitely being a little shit, I was also 8. \n\nWhen I got home, there was a snack waiting for me with a note apologizing for what went on that morning and telling me she loves me, etc. At the time I was just like oh cool a snack yeah everything’s fine.\n\nBut I also still remember it today as a fully-grown adult…",
            "title_similarity": "0.6082864",
            "sentiment_compound": 0.8667
        },
        {
            "id": "h2esdpg",
            "score": 896,
            "text": "My parents did a lot of damage to me by not having the humility and grace of knowing when they were wrong.\n\nNever apologized for being wrong, if I called it out they’d say “whatever. I’m your mother. What I say goes, so shut the hell up! If I told my mother she was wrong, I wouldn’t be here!”\n\nIt only bred trauma, mistrust in authority figures and people, and the therapy for it is difficult even years later. It might seem like a small thing not worth caring about, but it set me up for the “I have to never screw up, always be perfect, because even if I did nothing wrong I will still be blamed and take the fall for it.” That is not a good way to live as a child and teen.\n\nIf you want to do right by your children, do not be afraid or ashamed to admit you were wrong, that you seek to make amends, and that you are not a tyrant whose word is law regardless of what the truth is. Be smart enough to know you can be wrong. Show them you are an adult.\n\nThis life tip is absolutely something that should be broadcast to more people.\n\nEdit: what a kind hug award. Genuinely appreciate that and the amount of people who share my appreciation for how important this is for your children.",
            "title_similarity": "0.84367526",
            "sentiment_compound": 0.9402
        },
        {
            "id": "h2ehpd3",
            "score": 3382,
            "text": "Being wrong is a part of life.  Parents who don’t teach their children to deal with that are doing them a great disservice.",
            "title_similarity": "0.8111417",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2ekhnd",
            "score": 782,
            "text": "This practice extends to any situation involving a power imbalance.  When I was working, a fair few people commented that I was the only boss they'd had who not only admitted when I was wrong but apologized when it was called for.  That's not something I did deliberately thinking it would get me loyalty.  That was just a handy side benefit.",
            "title_similarity": "0.7078807",
            "sentiment_compound": 0.9082
        },
        {
            "id": "h2em0s1",
            "score": 7,
            "text": "Yes! I love this advice. I also make it a point to admit when I'm wrong and tell my daughter that grownups make mistakes too and aren't perfect. Mistakes are a part of life and should be normalized.",
            "title_similarity": "0.81886506",
            "sentiment_compound": 0.362
        },
        {
            "id": "h2eog3b",
            "score": 4,
            "text": "*You could use some tegridy, parent!*",
            "title_similarity": "0.4822973",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2epoi3",
            "score": 3,
            "text": "This needs to be said over and over",
            "title_similarity": "0.36905193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2epsyq",
            "score": 3,
            "text": "This is very important.",
            "title_similarity": "0.14808153",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h2eqw9e",
            "score": 7,
            "text": "True. Also, the same goes for teachers. I always cringe at collegues who cannot admit they made a mistake. We can only expect those kids to trust us and be honest with us if we set examples for them.",
            "title_similarity": "0.91188985",
            "sentiment_compound": 0.7512
        },
        {
            "id": "h2ersxs",
            "score": 3,
            "text": "Say it louder for the people in back",
            "title_similarity": "0.25973156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2eseaf",
            "score": 62,
            "text": "Yeah my parents never apologised for jackshit. I'm basically programmed to think I'm either wrong or gonna be punished no matter what.",
            "title_similarity": "0.7275955",
            "sentiment_compound": -0.6451
        },
        {
            "id": "h2estn3",
            "score": 3,
            "text": "Definitely applies to teachers too - don’t act like you know it all.",
            "title_similarity": "0.7168071",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2esxp2",
            "score": 82,
            "text": "What if they “actually” think they’re perfect? I asked my mom if she’s done any mistake in life, she stated back and just said No. She believes she’s don’t no mistakes ever. (I’m 27 now, so it’s not a mom lying to a kid situation)",
            "title_similarity": "0.67019993",
            "sentiment_compound": 0.734
        },
        {
            "id": "h2et7zv",
            "score": 8,
            "text": "I’m a teacher and doing some training courses, one of the things we spoke about was apologising to learners. I was happy to apologise to students because it’s just a part of developing respect and basic decency, but there were a surprising number of teachers that were open about **never apologising** **** as that would mean being wrong. I was like wtf",
            "title_similarity": "0.86152697",
            "sentiment_compound": 0.0201
        },
        {
            "id": "h2etoo4",
            "score": 48,
            "text": "As a child of Narcissists, I want to share some of the consequences of this behaviour pushed to the extreme - think \"driving over your child's feet with your car (after placing said child behind the car) and blaming the child for it\" type of unapologetic person.\n\nFor myself, I became apologetic to the extreme. I catch myself apologizing to inanimate objects several times a day.\n\nFor one of my siblings, being accountable angers them. The more you present them with facts that show they should apologize, the angrier they get. They're known to have destroyed doors, a wall, and countless smaller objects (sorry) in their fit of rage. In a word, they're dangerous.\n\nFor the other, they never take any responsibility. They'll coldly look you in the eyes as you bleed out from whatever they did to you - be it voluntarily or not - and ask for an apology. I am not exaggerating. They once asked me to apologize to them after they hurt their knuckles from hitting me. To me, they're sociopathic. \n\nOf course, my family suffers from many more problems than simply not apologizing. But it played a huge part.\n\nPlease. If you can, be accountable and apologize when needed.",
            "title_similarity": "0.6742394",
            "sentiment_compound": -0.3456
        },
        {
            "id": "h2etwdk",
            "score": 2,
            "text": "Be assertive but caring. They also need guidance. Learning right and wrong is just as important as just enforcing what wrong is.",
            "title_similarity": "0.69621444",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2eu1nc",
            "score": 11,
            "text": "Just don’t overuse it as apologising to your children will eventually be meaningless and seen as an excuse if used too often. Make sure to at least attempt to fix the issue you are apologising about.",
            "title_similarity": "0.75269085",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2eu670",
            "score": 24,
            "text": "This.\n\nI vividly remember my dad apologizing to me about something (can't even remember what tbh) back when I was a teenager.\n\nMy dad has always been a hardass. Not unloving by any means, just rough around the edges I guess you could say.\n\nAnyways, he apologized for something he did or said to me and I just remember being so taken back by this. He said something along the lines of \"Adults always like to act like we have everything figured out and that we know better than people younger than us. Truth is, we're all human and we all make mistakes. It's my job as both an adult and your father to recognize when I've made a mistake. I apologize\"\n\nI think about that a lot...",
            "title_similarity": "0.8202738",
            "sentiment_compound": 0.8556
        },
        {
            "id": "h2eu9tu",
            "score": 2,
            "text": "I once almost fought my father because I asked an apology to my mother who wrongfully accused me of some shit.",
            "title_similarity": "0.6381104",
            "sentiment_compound": -0.7655
        },
        {
            "id": "h2eucdv",
            "score": 3,
            "text": "Admitting fault takes weight off both you and your kids, it is a humbling experience. That said, you are the boss, and what you say goes. Just be fair.",
            "title_similarity": "0.7836414",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2eukzl",
            "score": 2,
            "text": "My parents are liked this and for me luckily it worked out in teaching me to be the complete opposite. However, it also imprinted a belief that my opinion doesn't matter and also has made me prone to hiding stuff from them or lying to them. It really does suck and I wish it could be different.",
            "title_similarity": "0.8105738",
            "sentiment_compound": -0.0135
        },
        {
            "id": "h2euoeh",
            "score": 12,
            "text": "100%, my mother has never admitted her guilt nor apologized. I'm still really sad about it",
            "title_similarity": "0.57154095",
            "sentiment_compound": -0.5909
        },
        {
            "id": "h2eusqi",
            "score": 5,
            "text": "Furthermore, if children ask something and you don’t know the answer, tell them that and then help them conduct some (age appropriate) research to find out. It takes so much pressure off as you don’t have to “be right” all of the time, helps children develop their curiosity, learn about how they learn, and teaches them that they don’t have to be right all of the time either!",
            "title_similarity": "0.78563774",
            "sentiment_compound": 0.479
        },
        {
            "id": "h2euz2n",
            "score": 5,
            "text": "Parents always tell us to admit when we are wrong and to acknowledge our errors so that we can be better. Why is it that they don’t live up to their own teachings? My mother hasn’t apologized to me for anything except accidentally giving me genes that made me blind. Like that’s something you should actually apologize for. But she is an abusive cow, she refuses to apologize for anything, and it’s been almost a year since I stopped speaking to her.",
            "title_similarity": "0.7579284",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h2ev22l",
            "score": 3,
            "text": "I really wish folks of mine could see this. Usually when they're in the wrong beyond a shadow of a doubt and I point out why to them as respectfully as I can they assume I'm doing this to insult their level of intelligence which can be quite annoying to talk around since it's also seen as me disrespecting them too.  \n\n\nI want to make sure I remember to swallow my pride whenever I'm a parent as well and find myself in the wrong. I don't want my children to feel like they should be guilty for being innocent or right.",
            "title_similarity": "0.8478292",
            "sentiment_compound": 0.1969
        },
        {
            "id": "h2ev4ui",
            "score": 2,
            "text": "Yuuuup. My mom never ever thanks or apologizes but expects you to instantly when you mess up or if she does something for you…",
            "title_similarity": "0.6992836",
            "sentiment_compound": -0.4944
        },
        {
            "id": "h2evbvu",
            "score": 3,
            "text": "It's also good to let your child change your mind if they make a good argument. You can say \"Actually I think that's a good point, and here's why.\"  It teaches genuine respect and the value of changing your mind when you've listened to other people.",
            "title_similarity": "0.7238244",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h2evkaa",
            "score": 2,
            "text": "or to anybody really, if you were wrong.",
            "title_similarity": "0.3635854",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2evly0",
            "score": 6,
            "text": "My mom starts being passive-aggressive whenever we try to explain why she was being unreasonable. It's annoying as fuck.",
            "title_similarity": "0.6880064",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h2evmd7",
            "score": 3,
            "text": "Be humble to your kids, but don't let those assholes lord over you.",
            "title_similarity": "0.7935853",
            "sentiment_compound": 0.6259
        },
        {
            "id": "h2evtin",
            "score": 3,
            "text": "Omg, my wife is that person who says “What I say goes, I’m the boss” and it drives me up a fucking pole.  I hate admitting I am wrong to my kids, but it has to be done—for both our sake’s.",
            "title_similarity": "0.7923666",
            "sentiment_compound": -0.5472
        },
        {
            "id": "h2evzhc",
            "score": 3,
            "text": "Important for teachers too",
            "title_similarity": "0.4751577",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2ew113",
            "score": 2,
            "text": "It seems at the moment with the amount of content online for kids to learn from, she is correct and I am wrong (she's 6 and I'm 26) regarding current events around 80% of the time.\n\nI seem to find myself saying 'oh gosh yeah! You're right and I'm wrong, sorry!' around 5 times a day. Took me a while to get to that point but she accepts and appreciates it and it keeps me humble. Wouldn't have it any other way!",
            "title_similarity": "0.5682572",
            "sentiment_compound": 0.7668
        },
        {
            "id": "h2ew11g",
            "score": 2,
            "text": "Cant teach integrity when you dont have one. I'd bet about 89% of parents dont",
            "title_similarity": "0.4550526",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h2ew8ae",
            "score": 2,
            "text": "I am probably being too blunt here - but it’s like this. If you are an asshole, you will raise asshole kids.",
            "title_similarity": "0.72761226",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h2ewcww",
            "score": 3,
            "text": "I wish my parents could have learnt this wayyyy before having kids.\n\nI've never received a genuine apology from either of them. Any apology was always filled with an air of \"are you happy now? I'm sorry that you feel this way\" it was just so poisonous to be apologised to that way. Or the default would bewhatever I'm your parent, just do what I say.\n\nAnd that's on having emotional trauma 😌",
            "title_similarity": "0.7706724",
            "sentiment_compound": 0.3734
        },
        {
            "id": "h2ewfqf",
            "score": 3,
            "text": "Learn to take crticism from your children too, kids are brutally honest and if you're being a sausage they'll let you know too the little blighters.",
            "title_similarity": "0.72389746",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2ewg10",
            "score": 2,
            "text": "I would like to add don't lie to kids, don't say you can't watch TV right now, the TV is broken or some dumb lie. Just say the actual reason.",
            "title_similarity": "0.6712736",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2ewn2a",
            "score": 2,
            "text": "My dad never apologized. Whatever he did was correct. He even told me not to apologize to him if I fucked up. But he would yell and scream at me if I did fuck up. So I would just say nothing. Very confusing.",
            "title_similarity": "0.73066086",
            "sentiment_compound": -0.8227
        },
        {
            "id": "h2ewopk",
            "score": 2,
            "text": "And what fits right into that: Tell them when you don't know something. Then ask somebody who does so your kids see how to properly inform yourself.",
            "title_similarity": "0.7131686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ewqsu",
            "score": 6,
            "text": "TIL the word ‘comport’",
            "title_similarity": "0.1656481",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ex1lf",
            "score": 3,
            "text": "Generally speaking everyone should be less afraid to apologize.  People seem to see and apology as something that lowers your status, particularly if it is public, but I think most time it is the reverse.  When I see someone apologize for something, I appreciate that they have the guts and character to own up to a mistake.",
            "title_similarity": "0.76009357",
            "sentiment_compound": 0.2425
        },
        {
            "id": "h2ex5hd",
            "score": 2,
            "text": "This last is the basic lesson the better parent knows and the best parent try to live by, that kids will pick up from you how to deal with conflicts and emotions, and if they get to be good at resolving conflicts and deflating angry and tense emotions, working with dialogue through the problems, it is from you showing how it mattered to you and how you tried. So show them that. \n\nOr be a selfish dck and raise selfish prcks!",
            "title_similarity": "0.86107516",
            "sentiment_compound": -0.7574
        },
        {
            "id": "h2ex7a7",
            "score": 6,
            "text": "Also not becoming a seething monster when they do make mistakes ha. \n\nI remember being so afraid to admit little mistakes to my father.. I would rather try to hide them.. then hiding became lies and I became a liar.. and started lying about things I didn't need too. It's all a cycle.",
            "title_similarity": "0.75223064",
            "sentiment_compound": -0.933
        },
        {
            "id": "h2exdwg",
            "score": 2,
            "text": "Omg this! My parents never really apologised for anything nor admitted to being wrong. This fucked me up for a long time but im somewhat better these days.",
            "title_similarity": "0.63613963",
            "sentiment_compound": -0.3529
        },
        {
            "id": "h2exkbl",
            "score": 3,
            "text": "I’ve always felt if you are in the wrong you should apologise. Doesn’t matter who you are. I have apologised to my kids before because I have been wrong. Maybe I over reacted to something they did or snapped because I was feeling tetchy that day. It hasn’t caused them to lose respect or ‘walk all over’ me or anything like that. Which I think is what some parents are scared of. They think apologising to your kids is showing weakness and that they will use it against you. I don’t think it has that effect though, I think it shows kids that apologising when you do something wrong is the right thing to do, even if you’re in a position of authority, and it will make them respect you more in the long run and also teaches them that it’s ok to be wrong sometimes.\n\nMy parents never apologised to me if they made a mistake and i resented it in a way, it just felt unfair at the time.\n\nedit: it’s also important to not over apologise for tiny insignificant things. Like everything else to do with parenting it’s a fine balance.",
            "title_similarity": "0.8648337",
            "sentiment_compound": -0.9096
        },
        {
            "id": "h2exlcd",
            "score": 2,
            "text": "this is the reason why i prefer my mother over my father by quite a large margin. he used to always demand respect, never really showed why it should be given to him. now, he still does it, but less often. this was only after his relationship with my sibling broke down enough that they both had to go to therapy and my sibling had to literally move countries to go to therapy.  my mom on the other hand has always expected us to be polite, but has almost always shown us the respect that she wanted shown to her.",
            "title_similarity": "0.75141037",
            "sentiment_compound": 0.7615
        },
        {
            "id": "h2exowg",
            "score": 2,
            "text": "An apology to your children is also as much an apology to your future self who has to deal with the fallout from the situation. That's also a way to approach sincerety.",
            "title_similarity": "0.6955965",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2exyrd",
            "score": 2,
            "text": "While you are right about parenting, I wonder if that also counts for work. I always were telling people when I made a mistake till my boss came to me and told me I make too many mistakes and maybe he has to fire me. I still went on sometimes making a mistake, but never told someone about it and also denied when someone asked me. After like one year my boss came to me and told me I improved a lot at work and that he is surprised about my improvement. I just changed this little thing and it had an huge impact, though I hate to lie and think that making mistakes is totally fine\n\nEdit: I didnt correct any mistakes",
            "title_similarity": "0.75847983",
            "sentiment_compound": 0.6129
        },
        {
            "id": "h2exzoj",
            "score": 3,
            "text": "Yep. My mom never did. Taught me to cover up everything instead of admitting i made a mistake. Dad eventually came around but mom always said “sorry is an empty word.” So i stopped apologizing all together cuz the fuck else am i gonna say?",
            "title_similarity": "0.72192436",
            "sentiment_compound": -0.8925
        },
        {
            "id": "h2ey035",
            "score": 3,
            "text": "Monkey see, monkey do.",
            "title_similarity": "0.15557349",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ey4hc",
            "score": 3,
            "text": "This is great. The best LPT. Learning how to apologize is such an important thing and how do our children learn to apologize if they never see us do it? Changes their behavior entirely too, when someone apologizes to them.",
            "title_similarity": "0.8249053",
            "sentiment_compound": 0.9246
        },
        {
            "id": "h2eyayz",
            "score": 2,
            "text": "I've always done this with my son :), if I am wrong I'll say sorry and explain to him my mistake and we move on.\nHe's pretty good at apologizing and owning up to things so far so think it's going well what I'm doing.\n\nEdit-spelling",
            "title_similarity": "0.7870432",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2eypxo",
            "score": 2,
            "text": "If I may add: Apologize and after doing so, follow through with the apology. Saying sorry and then allowing ourselves to fall into the same pitfalls is akin to saying we do not care for the other person's intelligence or our own integrity. I pushed away a family member not by forgetting to apologize, but by forgetting and not truly understanding their pov. This resulted in \"heartfelt\" apologies that fell on deaf ears as they packed her things and left.",
            "title_similarity": "0.7749128",
            "sentiment_compound": 0.6158
        },
        {
            "id": "h2eyr1v",
            "score": 2,
            "text": "If I feel remotely bad about something I said or did to my kids, I take it as a sign that I need to apologize to them. People that aren't willing to apologize to their kids are usually the same people that don't apologize to anyone",
            "title_similarity": "0.84746337",
            "sentiment_compound": -0.5707
        },
        {
            "id": "h2eys6z",
            "score": 2,
            "text": "My worse memory as a child was of my stepdad. He came home from work on day during summer vacation pissed off. Ripped into me and my brothers, accusing us of being on the computer/internet all day(dial up). He had been calling trying to get through but keep getting a busy tone. He absolutely would not listen to anything we said. I had been on the computer all day N playing Heroes of Might and Magic 3. No internet used at all. He called us liars and idiots and garbage. He then grounded us to our rooms. Fast forward 3 hours later and his friend comes over asking why he wasn’t answering the phone. Been calling for hours. Surprise surprise our phone lines were down for something and the phone company had been out working on them all day. No apologies given just said we were ungrounded and that was it. Fuck him.",
            "title_similarity": "0.56699896",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2ez0sq",
            "score": 8,
            "text": "This is one of many reasons why me and my mother cannot get on; her inability to accept when she is wrong or at fault. \n\nEither I'm \"misremembering\", \"twisting words\" or, it just plain \"never happened\". \n\nIf you're in the habit of lying to your children like this then buckle up for shitloads of resentment when you're both older.\n\n*e: formatting*",
            "title_similarity": "0.74205124",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h2ez6vu",
            "score": 2,
            "text": "True.  Children are keenly aware of when you are being unfair. Apologising when you have over reacted teaches them to respect you more, because they understand that you are considerate of their feelings.",
            "title_similarity": "0.7626804",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h2ez7bn",
            "score": 6,
            "text": "I’ll just add a caveat: how you do this is very age and maturity dependent. Kids’ sense of justice and righteousness is very malleable, and prone to false dichotomies.\n\nFor younger kids, unequivocal apologies can send the message that the kid was right. In an ESH situation (ie. the kid did something wrong and the parent reacted poorly) you have to be _very_ careful to make sure they don’t get the message that their original action was right.",
            "title_similarity": "0.8007957",
            "sentiment_compound": 0.6997
        },
        {
            "id": "h2ezawr",
            "score": 2,
            "text": "I am having some issues with that. I don't have children.",
            "title_similarity": "0.32358888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ezceq",
            "score": 2,
            "text": "I wish my dad would legitimately apologize for his absence in my youth. But he is religious and blames it on the devil. I told him that's bullshit. He disagrees. Such is life",
            "title_similarity": "0.6501246",
            "sentiment_compound": -0.9568
        },
        {
            "id": "h2ezct3",
            "score": 5,
            "text": "Also if you don't do it for 40 years, your kids will stop talking to you forever.",
            "title_similarity": "0.5467337",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2ezl36",
            "score": 2,
            "text": "My parents definitely tried their best with me and my brother, but they did also sometimes lose their temper, yell at us and even said some hurtful things in anger. Yet, every single time, after they had calmed down, they came to us and told us they were sorry, they were wrong to yell at us. And, most importantly, always told us that even if they were sometimes angry, they loved us.\n\nI never thought that this was a sign of weakness or that we kids could do whatever as long as we remembered to apologize after. Instead, I learned that sometimes even the best of us act wrong, and the best way to mend the situation is to humbly apologize and admit you are wrong.",
            "title_similarity": "0.8346914",
            "sentiment_compound": -0.8948
        },
        {
            "id": "h2ezqrn",
            "score": 2,
            "text": ">*Fear and pain are the only two tools you need to raise a child.  Cause enough pain and fear alone works for a while.  But you still have to give them an occasional object lesson.*\n\n\\-- my father",
            "title_similarity": "0.7865641",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h2ezto2",
            "score": 5,
            "text": "All apologies taught me were that they were meaningless without changed behavior. My parents tossed them out like they were nothing, but there was no actual intent to change behavior. To be effective: \"Apologies are simply a notice that an amend is coming.\"",
            "title_similarity": "0.7353369",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h2eztyx",
            "score": 3,
            "text": "Corollary: let your kids see you make mistakes and mess things up. Laugh about it, or get mad about it, or shrug it off—but let them see.  Try new things that you might be really bad at.\n\nAs adults, we’re naturally practiced and generally good at what we’re doing.  As children, kids naturally are new, inexperienced, and pretty bad at things. But they don’t have the understanding that “ah yes, in 20 years from now I too will be good at _____”.  They just think “ugh I suck at this! I’m bad at things.”\n\nThey’ll be more open, flexible, and self-accepting if they see your miserable attempt at a croquembuche or pathetic birdhouse, especially if you can laugh about it and say “well at least I tried something new!”",
            "title_similarity": "0.77260184",
            "sentiment_compound": -0.8107
        },
        {
            "id": "h2ezy3t",
            "score": 3,
            "text": "Also important as a teacher! I teach seven / eight year olds and at times if a lesson goes completely wrong - children don’t understand I make sure to say sorry and that obviously if everyone is finding it tricky I obviously haven’t explained it very well etc.\n\nHelps build a classroom of mutual respect.",
            "title_similarity": "0.8071532",
            "sentiment_compound": 0.7547
        },
        {
            "id": "h2f0u9c",
            "score": 2,
            "text": "Ya my parents put me off on the wrong foot my taking the, really, /nparent approach, \"i am your parent and i am always right.\" worked my ass off in later years of high school and beginning of college to be a better communicator and be happy to admit when I was wrong! It is quite easy to recognize in the wild now and its a shame.\nCould not agree more",
            "title_similarity": "0.7722691",
            "sentiment_compound": -0.5587
        },
        {
            "id": "h2f11ge",
            "score": 2,
            "text": "This happened to me. I was incredibly arrogant up until about high school. I could never be wrong etc.\n\nTook some lengthy life lessons to realize that's not how it works.",
            "title_similarity": "0.6463733",
            "sentiment_compound": -0.2356
        },
        {
            "id": "h2f15pv",
            "score": 2,
            "text": "My mother could do no wrong and would never apologize, but would always force me to apologize for everything. As a result, I have fear of failure and am always paranoid I'm doing something wrong. When something does go wrong I get panic attacks knowing I have to apologize",
            "title_similarity": "0.7993796",
            "sentiment_compound": -0.9799
        },
        {
            "id": "h2f1kqx",
            "score": 2,
            "text": "I didnt know how to apologize or own up to my mistakes until I became an adult. I had to learn from other people I met, and always wondered why they apologized",
            "title_similarity": "0.6789081",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2f26r3",
            "score": 2,
            "text": "I’d like to add it’s also okay to say you don’t know. Please be honest when you don’t know the answer or best solution, but assure them you will help them.\n\nAdults who acted like they knew it all really messed up some parts in my life, while a simple ‘I don’t know’ would have really helped me out. The amount of adults who act like they are old wise people is too damn high. None of us know. We’re just doing whatever. \n\nI now use it quite often. I don’t see a problem with it when someone asks me a question and I tell them I don’t know. I just don’t. Or ‘I never thought about it’. You don’t always have to know or have an opinion.\n\nActing like you know, then mess up and then not apologizing to the child is just… pretty shitty.",
            "title_similarity": "0.7062795",
            "sentiment_compound": 0.928
        },
        {
            "id": "h2f28xl",
            "score": 3,
            "text": "TIL a new word:\n\nMinutiae - the small, precise, or trivial details of something",
            "title_similarity": "0.30139375",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2f29uq",
            "score": 2,
            "text": "I probably apologize too much…",
            "title_similarity": "0.3971757",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2f29wb",
            "score": 2,
            "text": "\"But I'm never wrong!\", says the nparent.",
            "title_similarity": "0.42895865",
            "sentiment_compound": 0.5608
        },
        {
            "id": "h2f2vgn",
            "score": 2,
            "text": "Another important one is that, even if it is 100% unjustified, kids are *allowed to have their emotions.*\n\nThey have the right to be angry, even if they're morally wrong and shouldn't be angry. Telling your child \"I'm your mother. You're not allowed to be angry at me,\" is teaching them to bottle up their emotions, which is really bad.\n\nWhile we're at it, here's more advice: Kids see right through the BS of \"I'd never ask you to do something I wouldn't be willing to do myself.\"\n\nYou say that because you know you are the parent, and thus, have the power to not have to do that chore, or because you're the manager at the business and can punish people for putting you in a situation where you'd have to.\n\nIf you're one of those parents who thinks that because your child hasn't worked as hard as you that you can just dump all the housework on them, you're teaching them to do the same the moment they have someone they can do that to. After all, \"it's your house too\" cuts both ways. If they weren't around, *you* would have to do the housework.",
            "title_similarity": "0.91788274",
            "sentiment_compound": -0.9509
        },
        {
            "id": "h2f34z6",
            "score": 1,
            "text": "This is relatable. The mental gymnastics my family used to avoid being wrong are worthy of a gold medal. \n\nI just hope I don’t overcorrect and spend half of my kids’ childhood apologizing for my existence",
            "title_similarity": "0.7089653",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2f3bb7",
            "score": 1,
            "text": "It is a good practice in gereral and not just parenting. Humility is an amazing quality to have and once you obtain it, it will most likely change your life.",
            "title_similarity": "0.5865228",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2f3q8u",
            "score": 2,
            "text": "I also hate when parents won't explain why they want their child to do something and just way, \"Because I'm the boss and I said so\". Doesn't solve anything and teaches kids to just blindly follow authority and to never question anything. As well as creating a disliking towards authority at the same time. If they can't justify an \"order\", maybe they shouldn't be giving it. Obviously some kids might just whine, \"whyyyy\" as a complaint. But there's plenty of times they can have genuine questions as to the reason they've been asked to do something, and adults should be able to give a real answer that isn't just, \"shut up and do as you're told\" like the kid is a slave.",
            "title_similarity": "0.86749935",
            "sentiment_compound": -0.0808
        },
        {
            "id": "h2f3sj5",
            "score": 1,
            "text": "Holy shit dude. You just made me realize my parents have never, ever, EVER apologized to me about anything. Like, I'm looking back deep into my memory and I cannot name a single time I've heard the word 'sorry.'\n\nI don't wanna say they were abusive (though they're def very controlling and manipulative and \"bow to me\"), but there is certainly a lot they should apologize for. I've been terrified to even call them out on anything because I dread confrontation and they become tantruming children that literally tell me to shut the fuck up or call me a loser. \n\nGoddamn, I have a lot of reflecting to do after thinking about this...",
            "title_similarity": "0.7510687",
            "sentiment_compound": -0.9793
        },
        {
            "id": "h2f3tk4",
            "score": 2,
            "text": "This x 1,000,000. Of all the things I wished my parents had taught me, this is what probably kept me from growing as an adult for a looooong time.",
            "title_similarity": "0.6039746",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2f41sb",
            "score": 2,
            "text": "You're also teaching them to accept that the people who say they love you aren't required to own up to their mistakes. So brace yourself for the slew of shitty relationships you get to witness your children endure.",
            "title_similarity": "0.906322",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2f45ap",
            "score": 1,
            "text": "Yeah im inclined to agree with the sentiment of this one. If I get it wrong I will always apologise to my daughter. I don't see it as shameful etc its just good manners and etiquette.  I'm always happy for her to be right and me to be wrong and vice versa as long as we both respect eachother.\n\nControversial, but I have no issue with her calling me out on stuff too... I'm pretty blunt with her when there are things she could have approached differently so how can I expect to be treated any other way.\n\nTreat others like you want to be treated I guess.\n\nRespect, honesty and the ability to forgive are qualities I value.",
            "title_similarity": "0.8102042",
            "sentiment_compound": 0.9831
        },
        {
            "id": "h2f45sn",
            "score": 2,
            "text": "Yeah this hits home for me.\n\nMy father would never accept he was wrong, ever. He was always right, no matter what. \n\nI learnt from that, and I'm always ok with admitting if I am wrong about something. Hopefully my 9yo son would agree with my statement.\n\nMy father was a cunt, and I learnt a lot about parenting from his failures.",
            "title_similarity": "0.8283776",
            "sentiment_compound": -0.7234
        },
        {
            "id": "h2f45uo",
            "score": 1,
            "text": "If you want your children to respect you it is exactly this easy. I’m a father of 4 and my oldest has a live in boyfriend. Across the board everyone of our children loves and respects us because we own our mistakes and apologize when appropriate. Bonus points when I ask them to do a task like dishes or sweeping I am right there in the dirt with them helping. With these two small actions I get loyalty, love, respect, and now they ask or just do the things with out being asked. I approach chores with them as a service too them. You want to move out eventually and live on your own right? Well this is how we teach you to keep a good home and how to cook for yourself. Since you guys do most of the living in the house it only makes sense to clean up after and care for yourselves.",
            "title_similarity": "0.80011714",
            "sentiment_compound": 0.9895
        },
        {
            "id": "h2f4794",
            "score": 2,
            "text": "Thanks. I went back in time 30 years and gave this tip to my dad. Now I'm just waiting for the continuum to refresh and all my personality defects to disappear.",
            "title_similarity": "0.49117705",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2f4cf4",
            "score": 1,
            "text": "I was raised in an aggressive household exactly opposite of this and struggle with low self esteem from it every day. It kind of backfired, opposite of your conclusion; I’m always wrong in my head, which is great for empathizing and humility but yeah, good post.",
            "title_similarity": "0.73277116",
            "sentiment_compound": 0.6858
        },
        {
            "id": "h2f4e51",
            "score": 1,
            "text": "So true, but also apologize to one another in case, with spouses and everyone when needed",
            "title_similarity": "0.6251818",
            "sentiment_compound": 0.3912
        },
        {
            "id": "h2f4juk",
            "score": 1,
            "text": "*laughs and cries in Asian Household*",
            "title_similarity": "0.2864486",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2f4jza",
            "score": 2,
            "text": "My dad would have needed this advice. He never stuck to his word, never admitted a mistake, always thought he could make me do what he wanted to do by \"being clever\" = disrespecting and ignoring me",
            "title_similarity": "0.75628865",
            "sentiment_compound": 0.4176
        },
        {
            "id": "h2f4lo0",
            "score": 1,
            "text": "Good thing my mom taught me this, my dad is too prideful.",
            "title_similarity": "0.6531714",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2f4ooo",
            "score": 2,
            "text": "Idk how I have integrity. My parents still to this day hold a policy that their are never wrong",
            "title_similarity": "0.51711845",
            "sentiment_compound": 0.5795
        },
        {
            "id": "h2f4pyc",
            "score": 1,
            "text": "To be honest I find this post upsetting because I've never been apologised to. I have heard the words \"sorry\" and \"I'm  sorry\" but I never actually got a real apology. And I've been wronged in so many ways. \n\nMy dad has said sorry to me maybe twice in his life, and if I went out right now and did those things to him I'd go to jail probably.",
            "title_similarity": "0.64992064",
            "sentiment_compound": -0.654
        },
        {
            "id": "h2f4qx1",
            "score": 1,
            "text": "Han Solo disagrees.",
            "title_similarity": "0.1694999",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2f4unu",
            "score": 1,
            "text": "Some old family friends recently told me I shouldn't apologize to our kids, ever. They claimed it made me look weaker and less in control.\n\nI'll continue to apologize when I'm wrong regardless of whom I've wronged. It's just being a good person. Kids learn more from watching than lectures. If they see parents doing the right thing I bet they will at least try to do it too.",
            "title_similarity": "0.84438455",
            "sentiment_compound": -0.4207
        },
        {
            "id": "h2f4uzi",
            "score": 3,
            "text": "This is really so great. I have been a youth pastor for the last seven years and the best advice I can give to parents is to admit to you kids when your wrong and talk with them about your mistakes and failures. This shows them the power of humility and will help you seem more approachable when they need someone to talk to about their own screw ups.",
            "title_similarity": "0.7197794",
            "sentiment_compound": 0.7422
        },
        {
            "id": "h2f4vj8",
            "score": 2,
            "text": "I’m sure there are similar comments and experiences.. but tell this to my dad",
            "title_similarity": "0.44815117",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h2f5300",
            "score": 3,
            "text": "I can’t stress this enough coming from parents that always had their double standards. Everyone fucks up, it’s okay! Learn and grow apposed to hiding your failures and letting your missteps hinder you from trying something new/different.",
            "title_similarity": "0.8963637",
            "sentiment_compound": -0.8588
        },
        {
            "id": "h2f59yy",
            "score": 2,
            "text": "My mom apologized to me when she thought she did something wrong. I learnt to be polite and to discuss things with her in calm and rational manner. My dad always hated explaining himself and was quick to yell at me when I didn't obey. I learnt to avoid conflicts with him and if they happened, I yelled back just as hard. To this day he's only person I do that with. That's the difference the example you set can make. \n\nAlso, due my mom being easier to have conversation with due to reasons above, you can probably guess who got to influence my views more and to have closer bond with me. That's been hard pill to swallow for my dad. It didn't impact him that much since if I visited mom, naturally I also visited him. But my mom passed away last year and only then my dad started realizing shaky foundation the relationship between me and him was on. He realized that we hardly even know how talk to each other normally. I also had to sit him down and explain exactly how much he had fucked up during my childhood and I've never seen such a pained look in anyone's face. \n\nTo his credit he took all of it and finally swallowed his pride and since then our relationship has been improving, but the point I want to make is that more than harming your child your child you are just shooting yourself in the foot. Respect your child and treat them as equal human being, not as your subordinate because you are determining how they're gonna treat you when you are too old to take care of yourself and depend on them.",
            "title_similarity": "0.844304",
            "sentiment_compound": 0.6686
        },
        {
            "id": "h2f5ek2",
            "score": 2,
            "text": "I wish my mother said sorry often when I was a kid. My dad was the one to be accountable for his mistakes and I was closer to him. I did resent my mother a lot because she feels like a brick wall that I have to demolish lol",
            "title_similarity": "0.75771326",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h2f5fz2",
            "score": 3,
            "text": "And don’t be a dick if someone admits they are wrong. Show them to appreciate and say thank you from both sides.",
            "title_similarity": "0.6178324",
            "sentiment_compound": -0.0
        },
        {
            "id": "h2f5ird",
            "score": 2,
            "text": "I taught them every human makes mistakes . Now I can be assured that they judge every action I do lol",
            "title_similarity": "0.71317863",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2f5k14",
            "score": 2,
            "text": "Related: tell them of your past errors. Font set yourself up as a flawless human who's never made mistakes. It's far more credible that your child will learn from your mistakes than from your idealised, unrealistic expectations of doing no wrong. \n\n#\n\n\"I've been on the receiving end of horrible hangovers because I didn't know my limits. Don't let that be you.\" is far better than, \"I never drank to excess. Neither should you, because it's wrong.\"\n\n#\n\nThe reality is the kid is likely still going to drink to excess. It's the burned hand that teaches best. But at least they'll respect your honesty.",
            "title_similarity": "0.8198602",
            "sentiment_compound": 0.931
        },
        {
            "id": "h2f5or0",
            "score": 2,
            "text": "Honestly, I think that my parents having the maturity and the ability to drop their pride and apologize to me even as a young child was a hugely influential part of my childhood.",
            "title_similarity": "0.69062436",
            "sentiment_compound": 0.8479
        },
        {
            "id": "h2f5pg3",
            "score": 2,
            "text": "I find people in general doing admit to being wrong. Especially in the workplace.",
            "title_similarity": "0.53249097",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2f5qb0",
            "score": 2,
            "text": "I always try to do this, even after the fact realizing I was the one saying mean things in the heat of the moment.",
            "title_similarity": "0.65339285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2f5si7",
            "score": 2,
            "text": "Oh goodness.  I was raised by my grandparents and grew up in a household with the \"I'm the boss\" mentality.  Very rarely did they ever admit to being wrong.  In fact I remember my grandmother telling me \"only God is perfect... But I'm a very close second.\"\n\nFortunately for me, I'm more than happy to admit when I'm wrong and use it as a learning opportunity.",
            "title_similarity": "0.74450225",
            "sentiment_compound": 0.8877
        },
        {
            "id": "h2f5w6c",
            "score": 3,
            "text": "Absolutely the best advice for helping to teach your children the right way to handle mistakes! Great advice!",
            "title_similarity": "0.69113994",
            "sentiment_compound": 0.8709
        },
        {
            "id": "h2f62zl",
            "score": 2,
            "text": "This is super true! I grew up with parents who were never wrong and I luckily noticed that behavior in myself in high school and guess what? At 22 I still find myself struggling to admit when I am wrong even though I am fully aware of how toxic it is for the people around me.\n\nIt takes years to unlearn this stuff.",
            "title_similarity": "0.71312684",
            "sentiment_compound": 0.8292
        },
        {
            "id": "h2f67eo",
            "score": 2,
            "text": "This is so true. I am not supportive of the notion that “apologies are a sign of weakness” in fact it’s the antithesis… apologies mean leadership and accountability of others when they won’t admit they’re wrong. No one is always right!",
            "title_similarity": "0.7376052",
            "sentiment_compound": -0.2649
        },
        {
            "id": "h2f67kx",
            "score": 2,
            "text": "My dad died when I was 5, so I don't have a lot of memories of him. One I have is of how I felt one time when he apologised to me for something. I don't know what the thing was that he was apologising for, but I remember how there was a strange blend of feelings: surprise - a *grown-up* said sorry to *me*; important, loved - apologising to someone tells them that you care about them and that you don't want to be the cause of them feeling sadness or pain or whatever else it might be; an awareness that this was something special that not all parents did and the gratitude for him that came with that understanding and yes, a little bit of smugness. I *was* right.\n\ntl;dr Apologising is worth it. Your kids will remember that you made the effort to say sorry long after they have forgotten what you're saying it for.",
            "title_similarity": "0.64118624",
            "sentiment_compound": 0.9146
        },
        {
            "id": "h2f693q",
            "score": 2,
            "text": "Boyyyy I’m always apologizing to my 5 year old. I’m not sure how anyone parents without apologizing. We’re both learning every day.",
            "title_similarity": "0.6168113",
            "sentiment_compound": -0.2593
        },
        {
            "id": "h2f6cmd",
            "score": 2,
            "text": "And make it a good, real apology.  Nothing worse than, \"I'm sorry I yelled, BUT...\" Take the hit, say sorry, say \"that's not ok for anyone to do, not even parents,\" and move on.  If their underlying behavior really needs to be addressed, you can do it later, or next time.",
            "title_similarity": "0.76616985",
            "sentiment_compound": -0.0271
        },
        {
            "id": "h2f6h9t",
            "score": 2,
            "text": "There’s two reasons to never apologize. The first is if you never admit to yourself that you were wrong, and are perpetually blaming others for whatever you should be realizing was your own failure. The second is if you’re so fragile that even though you know you’re wrong, you think it would hurt too much for others to know as well.\n\nYour kids know which one of these you are already. They made up their minds. The only way to change their minds is for you to grow up and change who you are.",
            "title_similarity": "0.87959814",
            "sentiment_compound": -0.9422
        },
        {
            "id": "h2f6r69",
            "score": 2,
            "text": "And it teaches them that they are worthy of respect and they won't grow into being guilt ridden adults. Since children's lives depend on it, they always believe whatever their parents tell them (or how they act towards them too), if their parents treat them like shit they end up feeling that way because they don't have the complexity in their minds to know that their parents ARE wrong sometimes. By the time they grow up it's too late and they have to work really hard to understand that they ARE worthy of love and respect.",
            "title_similarity": "0.85415184",
            "sentiment_compound": 0.9083
        },
        {
            "id": "h2f6yma",
            "score": 2,
            "text": "My mom would argue with me about things I factually knew from school or wikipedia browses late at night and sometimes in the heat of it she would look things up on Google and see that I'm completely right and still argue with me and punish me for \"being snarky\". \n\nIt's like, even as a teenager I was aware she was embarrassed at being wrong and just wanted to Lord her power over me to compensate for it.\n\nEdit; I remembered  once I was grounded for breaking something that my brother actually broke. I was screamed at and called a liar and more punishment was added because I was \"lying\". Days later my brother admits to breaking it. My mom forced a half ass apology out of my brother, never gives me one herself, and starts instead lecturing me on how \"brave\" it was for my brother to come forward and how proud she was of him.  When I was confused as to why my brother is getting praised for lying when I was punished for the truth my mom got angry with me and said I was bad at accepting apologies and ungrateful and scolded me. Years later as an adult brought it up again and she is sorry \"I felt that way\" and claims she doesn't remember it at all.",
            "title_similarity": "0.684842",
            "sentiment_compound": -0.9871
        },
        {
            "id": "h2f75m8",
            "score": 4,
            "text": "For parents reading this that don't do it, and whose kids are always defensive and reclusive, do it. Don't wait until your kids want to move out just to get away from you. Don't wait until they lie about everything. Don't wait until they're so fearful and confused anything goes and they get carried away by anyone who appears honest and respectful. Don't wait until you lose them to bitterness and anger. Don't wait until they hate you and avoid you for the rest of their lives. Don't wait until they're drinking and using drugs.\nDo it now. It's only hard at the beginning. It's only hard if you're unwilling to be honest yourself. Don't perpetuate a lie for what you might think is saving face, because you're only fooling yourself.",
            "title_similarity": "0.77891177",
            "sentiment_compound": -0.9346
        },
        {
            "id": "h2f7av7",
            "score": 2,
            "text": "Is there a LPT but for kids? \nHave a 4yr old kid and this will be of great help.",
            "title_similarity": "0.37425184",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h2f7cvq",
            "score": 3,
            "text": "The posts that say “don’t apologize,  you are the authority”... are ridiculous. Children know you are the authority. Not modeling apologies makes kids who don’t apologize, don’t think it is ok to make mistakes, and will not share their problems with their parents.",
            "title_similarity": "0.84762204",
            "sentiment_compound": -0.0849
        },
        {
            "id": "h2f7dj5",
            "score": 3,
            "text": "Another one that I hated, and refuse to use, \"because I said so.\" That's just lazy and unproductive, imo. I always make the time to explain my though process to my child. So far, he's a reasonable kid that can explain his own thought processes, if asked.",
            "title_similarity": "0.8159094",
            "sentiment_compound": -0.836
        },
        {
            "id": "h2f7gud",
            "score": 5,
            "text": "> You cannot treat a child one way and then expect them to comport themselves in the opposite manner.\n\nThe amount of times I heard *do as I say not as I do* growing up.",
            "title_similarity": "0.67358536",
            "sentiment_compound": -0.1426
        },
        {
            "id": "h2f7w8v",
            "score": 2,
            "text": "Funny enough this works for some adults too",
            "title_similarity": "0.2938069",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2f87gy",
            "score": 2,
            "text": "I think I grew up liking my parents more than most of my friends liked theirs because they wouldn’t hide behind their authority.  I can recall endless instances when my parents would fail in front of me and just roll with it.  The thing they wouldn’t tolerate is being defeated, and that’s why I’m a stubborn ass.",
            "title_similarity": "0.81720126",
            "sentiment_compound": -0.6527
        },
        {
            "id": "h2f8du3",
            "score": 2,
            "text": "Our just do what my mother does and call them stupid and pathetic throughout their childhood and into their mid 20's. That will really teach your kids not to be a total piece of shit by example.",
            "title_similarity": "0.7766302",
            "sentiment_compound": -0.8993
        },
        {
            "id": "h2f8kym",
            "score": 2,
            "text": "I wish I never knew what fruity patcher does",
            "title_similarity": "0.374157",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2f8t2b",
            "score": 1,
            "text": "Embrace it, we do it wrong?",
            "title_similarity": "0.37499005",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2f8t6x",
            "score": 3,
            "text": "My mom haven't apologized once in my life even if it was clearly her fault. But atleast now I'm really good at arguing.",
            "title_similarity": "0.6885743",
            "sentiment_compound": -0.1499
        },
        {
            "id": "h2f8xw8",
            "score": 2,
            "text": "100% agree. I also made sure to always carefully explain why they couldn't do something or why they were wrong to do something. This teaches them how to reason about consequences work and how moral reasoning works. I also made sure to explain why and how I had been wrong, when I was, for the same reason. This also taught them that nobody was above the rules and modeled integrity, as you said. I suspect that, if more parents did this, there would be fewer authoritarians in the world and that would make the world a better place.",
            "title_similarity": "0.88327944",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2f8xzt",
            "score": 2,
            "text": "could you call my mom and tell her this? that’d be great",
            "title_similarity": "0.40887213",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2f8z9b",
            "score": 1,
            "text": "LPT: don’t mention the Finnsi diff.",
            "title_similarity": "0.29158187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2f941z",
            "score": 2,
            "text": "This is huge.  It's easier now that they're older but even when they're little they could hear me say\n\n \"This is my first time being a parent.  I'm trying really hard but I'm learning as I go.  I want the best for you.  My biggest job is to help you get the skills to be a happy and successful grownup someday.  Being rude or mean won't work when you're on your own so we have to find a way for you to learn this skill. \"\n\nWhen my kids were little we went through a phase of structured apology.  5 parts. \n\n1) say you're sorry, and explicitly what for (I'm sorry I carelessly tore the cover of your book by stepping on it) \n2) frame why this is a wrong thing to do (it is always wrong to be careless with other people's belongings) \n3) offer restitution (how can i make this right - may I repair or replace the book?)\n4) describe how you have an intention to change your ways to prevent future injury (I'm going to be more careful with other belongings, and won't be leaving books on the stairs anymore) \n5) ask for forgiveness. It is good to empower the injured party.  But in the long run, forgiveness is a gift you can give yourself if you've seriously done steps 1 thru 4.",
            "title_similarity": "0.7300209",
            "sentiment_compound": 0.928
        },
        {
            "id": "h2f9918",
            "score": 2,
            "text": "My goal in life is to teach my kids self-accountability, competency, and how to not be a dumbass.",
            "title_similarity": "0.75598",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h2f9a6u",
            "score": 2,
            "text": "This used to piss me off growing up to the point I totally tuned my parents out by the end of it. I was pretty smart so I could usually corner them in their bullshit which was usually met with extreme anger (people don’t enjoy being proven wrong/ made to look the fool) and it turned into “you better shut up or else” type of stuff. Like they couldn’t actually debate any further with me so they resorted to violence. It drained a lot of respect I had for them and even worse it made me distrustful in their advices. It did me a disservice as I blocked out even the good advice.",
            "title_similarity": "0.7646397",
            "sentiment_compound": -0.8805
        },
        {
            "id": "h2f9umk",
            "score": 3,
            "text": "I have a three year old, and I apologize to him literally about a hundred times a day",
            "title_similarity": "0.30579746",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2f9yub",
            "score": 2,
            "text": "To be honest, my parents barely apologised for things they have done in the past. My dad sometimes, but the worst stuff are just buried in the past and we don‘t speak about it anymore. They are great parents now in general and they do a lot for us. But the things they never did that I wish they did has made me into a person that doesn‘t want to be what they didn’t do if you catch my drift.",
            "title_similarity": "0.7533227",
            "sentiment_compound": 0.7354
        },
        {
            "id": "h2fa1hx",
            "score": 2,
            "text": "Basically\n\nVirus teaches us about life",
            "title_similarity": "0.48273605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fa2ya",
            "score": 2,
            "text": "How would I send this to my parents without sending it to them",
            "title_similarity": "0.45137718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fa361",
            "score": 2,
            "text": "My psychopathic mother was like this , even when she was dead to rights wrong she just absolutely refused to say sorry and instead try to reframe it as the other person's fault.",
            "title_similarity": "0.69242334",
            "sentiment_compound": -0.8858
        },
        {
            "id": "h2fa4a0",
            "score": 3,
            "text": "My mom is never wrong. When she makes a mistake, its not her fault. Its no big deal. Or I am over reacting. She’s a narcissists.",
            "title_similarity": "0.66162896",
            "sentiment_compound": 0.0547
        },
        {
            "id": "h2fa4j6",
            "score": 2,
            "text": "I'm very much the boss I'm a single mother but I also say sorry if I'm wrong. It's basic sense, and shows respect for them. They may be my children but they're also tiny humans who will one day be grown men.",
            "title_similarity": "0.69236475",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h2fabzy",
            "score": 2,
            "text": "Not just to your children, to anyone you slight",
            "title_similarity": "0.5465574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fahj7",
            "score": 1,
            "text": "Hahaha, never gonna happen when the parent is an abusive narcissist. The kid is the problem every, single, time, regardless of blatant facts.",
            "title_similarity": "0.69113874",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2fajm6",
            "score": 2,
            "text": " what are you talking about? ive been raised under the belief that a Mom can never be wrong, and if she is its my fault.",
            "title_similarity": "0.73983",
            "sentiment_compound": -0.0377
        },
        {
            "id": "h2fal5f",
            "score": 2,
            "text": "When my oldest was a baby someone told me never to apologize to my kids because it would undermine their faith in my abilities if I admit I make mistakes. Hands down the WORST advice I ever got and can happily say I never followed it. Teach your kids that you are a human being who makes mistakes and it's OK to admit your fault.",
            "title_similarity": "0.83260596",
            "sentiment_compound": -0.2723
        },
        {
            "id": "h2fay07",
            "score": 2,
            "text": "my parents never said sorry ever , except the times when they beat the shit out of me and felt guilty afterwards (which is rarely felt guilty), I'm trying to teach my self how to say sorry when needed and it's damn hard",
            "title_similarity": "0.7862579",
            "sentiment_compound": 0.091
        },
        {
            "id": "h2fb5rg",
            "score": 2,
            "text": "My parents fucked up my mentality - for the longest time, I don't know how to say \"I love you\" or \"I'm sorry\". Even the phrase \"Good morning\" is very awkard to me. It seems that they brought us in this world without wanting to be vocal about their feelings.\n\nNow, all of us except me are having trouble expressing ourselves. I was just lucky because I met my fiancé 8 years ago who came from a family that is the literal opposite of my family - sweet, vocal, expressive.",
            "title_similarity": "0.6475209",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2fben2",
            "score": 2,
            "text": "Ok wow this blew my mind just now. Neither of my parents ever really apologized, especially my mom. I'm 28 and honestly have found apologies very hard to swallow, but it is something I'm trying to work on. It never understood why but now it's all making so much sense to me. I never even thought about it that way. Getting my mom to apologize for anything was like working with a fractious cat.",
            "title_similarity": "0.66938597",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h2fboil",
            "score": 3,
            "text": "So true...you can see the product of not doing this in Trump",
            "title_similarity": "0.40057006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fbrnj",
            "score": 2,
            "text": "Not a single person I've ever known didn't have to learn that on their own in their teens. Including myself. It's kinda fucked up. Many seem to have never learned that.",
            "title_similarity": "0.41361958",
            "sentiment_compound": -0.6258
        },
        {
            "id": "h2fcgve",
            "score": 3,
            "text": "In my opinion not admitting youre wrong as a parent can only mean that you are insecure. Granted my daughter is only 3 but my wife and i always apologize if were wrong, especially if our daughter was trying tell us something and was correct. I have noticed it has a noticeable positive effect on her self esteem, validating her perspective and letting her know she is a valued prt of the family. hopefully it will help her build a confident self as she grows.",
            "title_similarity": "0.7746854",
            "sentiment_compound": 0.9686
        },
        {
            "id": "h2fd45l",
            "score": 2,
            "text": "The other thing that teaches them integrity is following through with your plans and not having to apologize. As a someone with experience (i.e. a shitty parent) I know how easy it is to make not-actual-promises-but-close-enough and then go really hard on the apology like I'm some pinnacle of virtue. You actually have to do what you say you're going to do so you show them why apologies are so important when necessary. Hopefully, things will actually be out of your control--rather than you were just too lazy to do something with them and then spent all that extra energy on just a fantastic apology--so that you're not leveraging your amazing apologia to get out of having to do stuff because you don't feel like it. Otherwise, you're teaching your child to use apologies to get out of having to do things they don't want to do.",
            "title_similarity": "0.841915",
            "sentiment_compound": 0.806
        },
        {
            "id": "h2fd5vn",
            "score": 2,
            "text": "And humility, which is just as important. Watching retirement age people have a seemingly complete inability to drop the self-importance and \"my life is flawless\" act is really unflattering and unimpressive",
            "title_similarity": "0.6319611",
            "sentiment_compound": -0.3321
        },
        {
            "id": "h2fd6mq",
            "score": 2,
            "text": "That’s the last thing on my father’s to-do list.",
            "title_similarity": "0.41067326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fdbiz",
            "score": 2,
            "text": "I agree 100%.  That is the way I raised my sons.  I wasn’t afraid to admit my mistakes and apologize to them.  It’s Stupid to pretend I don’t make mistakes and it’s wrong to not apologize for them.",
            "title_similarity": "0.80698645",
            "sentiment_compound": -0.8174
        },
        {
            "id": "h2fdc7h",
            "score": 2,
            "text": "\"I can do what i want, i am a grown up. You have to listen to what i say, i am grown up.\"\n\nLater when the kid is grown up.\n\n\"Why are you acting like this, who do you think you are?\"",
            "title_similarity": "0.5543138",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2fddr9",
            "score": 1,
            "text": "Doctrine & Covenants 121:41-43",
            "title_similarity": "0.22149745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fdja3",
            "score": 2,
            "text": "I'm a middle aged adult and my parents will still never apologize for anything unless it's a self-deprecating, passive aggressive apology like \"Well, I'm sorry, I guess I can't do anything right.\" I know they can't bear the thought of knowing they unintentionally hurt their children, but that they refuse to change their patterns, language, and recognize past trauma (unintentional on their part or unknown to them, at the hands of others) only hurts my sibling and I more. We're both in therapy trying to let go of that shit.\n\nEdit: words",
            "title_similarity": "0.7997879",
            "sentiment_compound": -0.9366
        },
        {
            "id": "h2fdrw4",
            "score": 2,
            "text": "I will 100% back this up! My 5 year old will apologise when he wronged someone. He does so because I have always made sure to apologise to him if I messed up.",
            "title_similarity": "0.6764101",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h2fdx18",
            "score": 2,
            "text": "Can confirm, I feel like apologizing to my daughter when I flew off the handle or made a parenting mistake is one of the greatest parenting moves I ever made. It brought us closer AND meant I could just acknowledge and move on and try to do better instead of carrying a bunch of guilt around.",
            "title_similarity": "0.7633184",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2fdz6i",
            "score": 2,
            "text": "My grandfather gave me 20$ cash for my birthday one year. Birthday party was at DZ(discovery zone) and I threw that 20$ bill in that token machine as soon as we hit the door. My mom was soooooooo pissed. Telling me how I wasted money and even made the place refund my 20$. Later on when headed back home, she apologized. Said that was my money and I should have been able to spend it the way I wanted, even if it was wasted on arcade games. I’ll never forget that and it taught me to always admit when I’m wrong.",
            "title_similarity": "0.5574683",
            "sentiment_compound": -0.8039
        },
        {
            "id": "h2fe3go",
            "score": 2,
            "text": "Admit your failings to, not just in being right/wrong, but let them know you have a range of being. If you’re tired and that’s the reason you aren’t going to the pool don’t blame it on something else, be honest and let them know you don’t have the energy. \n\nShow them that you make mistakes or that you have a hard time on something. This is *way* more important for them than just showing them how to do something. Let them see that you have trouble, but that you keep trying until you get it done. \n\nKids mirror and model to learn how to be and *who* to be. Don’t try to teach them the “idealized” version of yourself you want them to see, that will fail every time and you’ll look like a hypocrite when they become a teen. Show and teach them the real you, it will come off more honest and sincere while teaching much more important and valuable lessons.",
            "title_similarity": "0.8236139",
            "sentiment_compound": 0.8644
        },
        {
            "id": "h2fe6jw",
            "score": 1,
            "text": "Sure that happens in Asia.  /s",
            "title_similarity": "0.06361018",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2feb1c",
            "score": 1,
            "text": "Yep. Have a sweet parent who will apologize quickly then is forced to be in middle of another who doesn’t apologize for anything ever! 🧐🧐😒",
            "title_similarity": "0.7476495",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h2fefvh",
            "score": 1,
            "text": ">There are a lot of parents with this philosophy of \"What I say goes, I'm the boss , everyone bow down to me, I can do no wrong\".\n\nI wouldn't make it this black and white.  It's that you're \"the baby\" who needed to be fed, needed to be taught how to walk, how to ride a bike, etc.\n\nIt isn't so much that the parent is the boss, it's that there once was a time that the child relied this heavily on the parent.\n\nThat being said I completely agree.  Saying sorry doesn't mean that the other person is right it means that the relationship or the bond is more important.  I hate to admit it but I can't think of one time my parents ever apologized to me ...",
            "title_similarity": "0.87186646",
            "sentiment_compound": 0.5867
        },
        {
            "id": "h2fegqr",
            "score": 1,
            "text": "My dad would never admit when he’s wrong. He’s just reinforce that he’s done this kind of stuff his whole life. So coming to admit that I can be wrong was hard for me.",
            "title_similarity": "0.7309448",
            "sentiment_compound": -0.7293
        },
        {
            "id": "h2fek25",
            "score": 2,
            "text": "My mom only started doing this and our relationship improved drastically. \n\nUnfortunately sometimes you can tell how much it hurts for her to admit she's wrong, but the fact that she can do it at all has made life so much happier, living with her so much nicer.",
            "title_similarity": "0.60302484",
            "sentiment_compound": 0.8375
        },
        {
            "id": "h2feofj",
            "score": 1,
            "text": "Role playing video games thought me how to be compassionate. My parents would just scream at me every bad thing I do.",
            "title_similarity": "0.7178974",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2fepos",
            "score": 2,
            "text": "My kids know they need to do what I ask when I ask it.\n\nBut they also know they can talk to me after and if I was wrong I will apologize and not do it again.\n\nBut because of safety they know to listen to me first and talk to me after",
            "title_similarity": "0.79447937",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h2ff0d4",
            "score": 1,
            "text": "My parents have never apologized once to us.",
            "title_similarity": "0.37798774",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h2ff15z",
            "score": 1,
            "text": "lmao this is my dad. And he wonders why none of his sons like him.",
            "title_similarity": "0.58769894",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h2ff2d3",
            "score": 1,
            "text": "Not in my brown household :(\n\nAnd guess what? Today is Father's Day and no one wants to actually spend time with my dad. Spent the last few days trying to work out a plan that wouldn't set him off but would involve minimal contact. Wonder why?",
            "title_similarity": "0.5793288",
            "sentiment_compound": -0.4423
        },
        {
            "id": "h2ffa93",
            "score": 2,
            "text": "It's funny, I find I rarely get apologies from my mother to this day, but will  always go out of my way to apologise to her when I know I'm in the wrong. \n\nI'm not sure why I feel like an exception to this rule.",
            "title_similarity": "0.73543376",
            "sentiment_compound": 0.2516
        },
        {
            "id": "h2ffhx1",
            "score": 1,
            "text": "Shortly before my mother's death,  I asked her if she ever felt guilty about anything.  She reflected a moment,  then said no. \n\nIncidentally,  when I say,  \"shortly before\", I don't mean,  \"As I was about to place the pillow on her face\". Though that's something I often thought about growing up. \n\nAt least one of us is a sociopath.",
            "title_similarity": "0.6457092",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2ffk1g",
            "score": 1,
            "text": "Thank you, more people need this knowledge We have raised our babies this way and I know they are so much more open to admitting when they do wrong or apologizing if they got to angry at someone, they arnt afraid to be wrong because they know they are human and we all are still learning, this is how I wish I was raised as I never had a trusting relationship with my own parents cause they only yelled when things went wrong and the child was to blame and it was never mom or dad's fault for yelling or spanking.",
            "title_similarity": "0.89691377",
            "sentiment_compound": -0.9332
        },
        {
            "id": "h2ffkfy",
            "score": 1,
            "text": "Nobodies perfect neither is my dad but my mom just nods her head to whatever he says but i end up arguing with him quite a bit. Apparently he can't be wrong and I'm just a kid (32) and his lived longer so he knows better",
            "title_similarity": "0.7353759",
            "sentiment_compound": 0.7119
        },
        {
            "id": "h2ffl0m",
            "score": 1,
            "text": "Happy Father's day, shitheads!!!!",
            "title_similarity": "0.37627858",
            "sentiment_compound": 0.3111
        },
        {
            "id": "h2ffri6",
            "score": 1,
            "text": "Asian parents left the chat.\n\nThey'll accept anything but wrong answers and decisions",
            "title_similarity": "0.67641455",
            "sentiment_compound": -0.5187
        },
        {
            "id": "h2fg2ye",
            "score": 1,
            "text": "The parents who never admitted they were wrong definitely birthed AntiVax kids",
            "title_similarity": "0.6565311",
            "sentiment_compound": -0.1769
        },
        {
            "id": "h2fg31z",
            "score": 1,
            "text": "Yup. My parents never apologized or said they were sorry. I thought it was perfectly acceptable to get really really mad as long as you got over it quickly and didn't keep bringing it up. Wow, parents really screw up their kids.",
            "title_similarity": "0.8141003",
            "sentiment_compound": 0.5535
        },
        {
            "id": "h2fghdo",
            "score": 1,
            "text": "\"I'm sorry, little one\"",
            "title_similarity": "0.27854434",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2fghqf",
            "score": 2,
            "text": "35 and I still struggle with this dynamic with parents. This behavior has made me skip having children.",
            "title_similarity": "0.60625005",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2fgj7b",
            "score": 2,
            "text": "I swore up and down I made my daughter a water bottle yesterday and we went looking for it. Once we were walking up the stairs I looked at her and asked if I forgot to make her one, she laughed and said yes. I apologized and told her I was wrong and we went to go make one. I do try to apologize when I realize I was wrong, something I think my parents didn’t do too often growing up. Being a parent lets you try to correct things your parents did wrong. I know she’s young but I hope my kiddo appreciates it",
            "title_similarity": "0.7259535",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h2fgkbw",
            "score": 1,
            "text": "Here's looking at you dad. I've taught myself to ask \" what would dad do?\" And then I do the opposite. Hopefully I won't turn out like you",
            "title_similarity": "0.6332196",
            "sentiment_compound": 0.1506
        },
        {
            "id": "h2fgt5k",
            "score": 1,
            "text": "My dad said \"I love you\" once... Fucking prick",
            "title_similarity": "0.47598705",
            "sentiment_compound": 0.3626
        },
        {
            "id": "h2fgvss",
            "score": 1,
            "text": "It also helps them trust their parents better, as they won't perceive them as adversaries but allies.",
            "title_similarity": "0.674093",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h2fh8md",
            "score": 2,
            "text": "Can not promote this enough! Such an underrated life pro tip from parent to child! \n\nThere used to be a list of actions that you use with your children and the long term potential effects it can have on their future character \n\n(Eg): \nShowing the positives of failure and motivate through interest will teach them self belief  \n\nShowing trust will teach them the rewards of honesty ..etc etc \n\nI remember seeing this list years ago but have never seen it since",
            "title_similarity": "0.8095206",
            "sentiment_compound": 0.7988
        },
        {
            "id": "h2fhbzt",
            "score": 1,
            "text": "It’s OK to make mistakes. \n\nWhat you do afterwards is the important thing. \n\nTake ownership for your mistakes. Accept accountability for your mistakes even if that means something negative for you. \n\nAbove all, accept that not everything is forgivable.",
            "title_similarity": "0.73820984",
            "sentiment_compound": -0.5461
        },
        {
            "id": "h2fhkhf",
            "score": 1,
            "text": "My parents are only wrong when they see their actions have affected the other person in a really bad way.",
            "title_similarity": "0.70302784",
            "sentiment_compound": -0.8173
        },
        {
            "id": "h2fhx6v",
            "score": 1,
            "text": "My parents are incapable of humility and self reflection.",
            "title_similarity": "0.42728305",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2fi48f",
            "score": 1,
            "text": "“I don’t blame people for their mistakes….. but I do ask that they pay for them”",
            "title_similarity": "0.6710578",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2fi6ff",
            "score": 1,
            "text": "On the contrary, both of my parents were abusive control freaks like this and it taught me to very self aware so that I never become like either one of them.",
            "title_similarity": "0.73753196",
            "sentiment_compound": -0.6381
        },
        {
            "id": "h2fi8y1",
            "score": 1,
            "text": "In the same breath, I must apologise when I do something wrong because my parents never did it to me, can go either way, but yes ideally please do this",
            "title_similarity": "0.7521323",
            "sentiment_compound": 0.8735
        },
        {
            "id": "h2fj43t",
            "score": 1,
            "text": "My mom called me stupid once when I was 7. She then got in her car and ran errands. When she returned, she apologized for calling me stupid. I've never forgotten that apology.",
            "title_similarity": "0.56847006",
            "sentiment_compound": -0.6101
        },
        {
            "id": "h2fj58b",
            "score": 2,
            "text": "I think it also helps to teach them that adults are not always correct/all knowing.\n\nAs a kid, I always thought adults were put together enough to know right from wrong and have all the answers. Now that I'm an adult my self, that couldn't be further from the truth.",
            "title_similarity": "0.76760405",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2fjrbu",
            "score": 1,
            "text": "My father still acts like this. I opened up to my family last year about how I attempted suicide when I was a teenager but the anchor for the noose failed. My father accused me of making it up to get attention/sympathy and interrogated me to \"prove\" I was lying about something that happened fifteen years prior. I told him to go fuck himself and haven't spoken to him since. \n\nTold my mother that I'm not speaking to him until I get an apology... Phone still hasn't rang. It's been seven months.",
            "title_similarity": "0.5634447",
            "sentiment_compound": -0.9709
        },
        {
            "id": "h2fka0a",
            "score": 1,
            "text": "Also if you wrong your child, apologize, even if it's something that seems stupid to you. What you find important and what a toddler or child finds important is not the same.",
            "title_similarity": "0.6870127",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2fka0l",
            "score": 1,
            "text": "Send this to my dad from 25 years ago.",
            "title_similarity": "0.12242009",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fkd0e",
            "score": 1,
            "text": "Treat children like people, easy.",
            "title_similarity": "0.35599634",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h2fkhfg",
            "score": 1,
            "text": "This is why my father isn't getting a phone call today, or tomorrow, or anytime in the near future.",
            "title_similarity": "0.40774417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fkrqj",
            "score": 1,
            "text": "It's likely people who do this also have a hard time admitting they have made a mistake to other adults as well. At no point do I want my child to think I am perfect, that is just inviting a world of pain for them once they figure out adults don't have some secret knowledge that children don't.\n\nTeaching kids it's okay to make mistakes as long as you learn from them and try to not recreate them is use super important. You can't do that if you don't explain the reason people do things",
            "title_similarity": "0.87926507",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2fl3w8",
            "score": 1,
            "text": "\"Now children, this is traffic court.",
            "title_similarity": "0.2914141",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fldoy",
            "score": 1,
            "text": "My parents have never said sorry for anything. Neither have my siblings. I moved away for 20 years, and learned how to do that. When I screw up and apologize they don't know how to react. \nI think this is one of the most important things you can teach a child. We all make mistakes. Be honest and admit when your are in the wrong, it's how you grow into a mature adult.",
            "title_similarity": "0.6995621",
            "sentiment_compound": 0.5596
        },
        {
            "id": "h2flmmy",
            "score": 1,
            "text": "I always apologize to my babies, and then they tell me, “it’s ok mommy”.  I apologize if dinner didn’t come out the way I wanted, or if our schedule changes.  I try and keep it real with them.",
            "title_similarity": "0.76558495",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2flmrm",
            "score": 1,
            "text": "It's so true. I see this all the time with my students. They cannot apologise and always place blame on someone else's behaviour when they get in trouble. \n\nNot apologising teaches kids to have no responsibility for their own actions. They learn to shift the blame onto anyone else but themselves.",
            "title_similarity": "0.89581513",
            "sentiment_compound": -0.5376
        },
        {
            "id": "h2floay",
            "score": 1,
            "text": "This is a stupid fucking post",
            "title_similarity": "0.27563107",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2flow2",
            "score": 1,
            "text": "My mother taught me “deny, deny, deny!”\n\nI learned quickly in my marriage that that doesn’t work for very long. Especially when we live in a world of digital proof!",
            "title_similarity": "0.645995",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h2flv2u",
            "score": 1,
            "text": "Of course! Very important thing to remember and a great tip! Have two children myself and everything I teach them about being a graceful human being goes both ways! 🧡",
            "title_similarity": "0.60451734",
            "sentiment_compound": 0.9357
        },
        {
            "id": "h2fm4m7",
            "score": 1,
            "text": "My stepdad would never admit to being wrong over ANYTHING, and if anyone expressed any opinion around him he had to tell them why they were wrong.\n\nIt kind of messed me up. I have zero self-esteem after being made to feel like an idiot who's always wrong for over a decade.  I don't tell people what I like or dislike unless I'm certain they feel the same, out of fear of judgment.\n\nI can't have a discussion with people, because I was raised thinking every conversation is an argument. I either argue until we're both angry at each other, or I immediately fold to avoid an argument while assuming the other person is an idiot. One person has to win, and since I eventually started giving in because I was sick of arguing with him,, the winner is the one who talks louder and never backs down.",
            "title_similarity": "0.7833946",
            "sentiment_compound": -0.9775
        },
        {
            "id": "h2fmicp",
            "score": 1,
            "text": "Sounds like a child’s writing this, and children are agreeing in the comments.",
            "title_similarity": "0.461295",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2fmikq",
            "score": 1,
            "text": "This is exactly what my parents do (not the apologising: the opposite) and I hate it. They demean me all the time, and will never admit they're wrong.",
            "title_similarity": "0.77116704",
            "sentiment_compound": -0.4378
        },
        {
            "id": "h2fmkxn",
            "score": 1,
            "text": "I would be on speaking terms with my father if he could just figure out this one simple trick.",
            "title_similarity": "0.567333",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2fne97",
            "score": 1,
            "text": "I don’t think my mom ever apologize to me once. Not sincerely anyway. If anything it was met with some sarcasm and finished up with “...but you did this”. Very much “what I say goes, I’m the boss, I’m the parent and you are the child”. \n\nBeing an adult now and trying to figure out confrontation is painful.",
            "title_similarity": "0.7706289",
            "sentiment_compound": -0.8049
        },
        {
            "id": "h2fnf1b",
            "score": 1,
            "text": "Starting parents should know this.\n\nI have a lot to vent complain about my parents, but I know that's dumb since it's all in the past. And one of them is because of this. In short, I hate how I turned out and I'm sure my parents agree. I know they love me, but it's obvious I didn't turn out the way they expected to. And I can name many things they should have done right while raising me. But that's just me trying to choke myself of my own past again. That's just one of my many problems that came with me.\n\nSo please. Do yourself and your child's favor and save yourselves from future stress and emotional pain by not thinking of yourself as always being in the moral high ground, and be aware of your faults and admit them to your child.",
            "title_similarity": "0.8012029",
            "sentiment_compound": -0.7107
        },
        {
            "id": "h2fno5b",
            "score": 1,
            "text": "Someone tell my mom this.",
            "title_similarity": "0.35660577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fnsvp",
            "score": 1,
            "text": "A bit louder for my mom in the back",
            "title_similarity": "0.32527393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fnucg",
            "score": 1,
            "text": "Yessss. I wish more adults understood this. I have apologized many times to my kids (teenagers) over the years. It shows that you have respect for them as people and guess what, they will respect YOU more if they too are shown respect. I’ve firmly believed since they were babies in treating them like smart humans, not like dumb creatures like many parents do.",
            "title_similarity": "0.7817659",
            "sentiment_compound": 0.9665
        },
        {
            "id": "h2foath",
            "score": 1,
            "text": "Also point out when they should apologize & insist that they do so promptly and with meaning.. \n\nYes, it feels fake and forced...it is...but you are teaching them when it's appropriate to do so.  Eventually you find you'll have to do it less & less.. \n\nAt least that's been my experience raising 3 kids over the last two decades!",
            "title_similarity": "0.685562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2foh3j",
            "score": 1,
            "text": "Completely anecdotal but I learned how to do this because my parents couldn't do this LPT and it was literally the embarrassment of watching them publicly double down on their wrongness that lead me to admit when I'm wrong more readily than them.",
            "title_similarity": "0.7854774",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2fokq1",
            "score": 1,
            "text": "Just wanted to add that it’s never too late to start doing this.",
            "title_similarity": "0.34188896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2foolp",
            "score": 1,
            "text": "Great advice, and can confirm it works. I've always apologized to my two boys (9 & 14) when I've been wrong or when I got angry and wish I'd kept my cool a little better. They almost always have accepted my apology graciously and guess what? They usually come to me and apologize after some reflection when they have done something wrong or didnt keep their cool. \nWe are able to talk about where we went wrong and how we will try to do better.",
            "title_similarity": "0.79278135",
            "sentiment_compound": 0.7953
        },
        {
            "id": "h2fpdbn",
            "score": 1,
            "text": "My dad would never ever apologize, because that would implicate that he made a mistake. He never makes mistakes because others are always to blame.",
            "title_similarity": "0.7162001",
            "sentiment_compound": -0.4563
        },
        {
            "id": "h2fpi5d",
            "score": 1,
            "text": "Yes, and also explain it to them why. Kids aren't stupid, at least later they will realize why. Just don't be a dick to your children.",
            "title_similarity": "0.74554795",
            "sentiment_compound": 0.8008
        },
        {
            "id": "h2fpnn0",
            "score": 1,
            "text": "My father never admits that he is wrong, never apologize ever. My two older brothers are the same and it irks me so effing much, the amount of trouble and confrontation that they all prefer to go thru just so they never have to apologize is so baffling to me. \nBut his bad example set me on the other side of the spectrum, I avoid conflict too much and always assume that I'm in the wrong even when I'm not, which is also very bad. At least I'm aware of it and try to improve.",
            "title_similarity": "0.7957733",
            "sentiment_compound": -0.9693
        },
        {
            "id": "h2fpo57",
            "score": 1,
            "text": "My dad is a narcissist, I can't remember a time he admitted he was wrong.  Anytime I try to correct him on something it's either \\*bullshit explanation that clearly shows he didn't actually hear a word I said\\* or \"Well I don't see you out here (fixing my mistakes) so you can't say anything about them\"???  Our dogs bark 24/7, and he's always fucking screaming and going on and on like \"why won't they stop\".  I point out that he does literally nothing to discourage them, in fact he does the opposite.  Often his response is to pet them.  Same thing when they are crazy energetic and jumping on people (they're 150 lbs).  He does nothing \"Oh they'll calm down\".  I mentioned \"you know, if you put them in their crate when they barked it would help stop them barking\".  His response?  \"You think they know I put them in the crate because they were barking?  Come on, that's ridiculous\" -- When I ordered a \"Operant conditioning 101\" book and put it on his desk I got the \"Well you don't come out here and put them in the cage, and you don't feed them or anything so mind your own business\"\n\nYeah, my life is a mess. I struggle a lot with falling into the same asshole behaviors he exhibits.  Our relationship is garbage because the only \"conversaions\" we can have is him commenting on women (oh watch out for the golf card girl, shes god a great ass), complaining about how \"my fiance is so anxious all the time\" (like it has any effect on him).  Or just me agreeing without question to whatever garbage he decides to spew from his mouth.  If I'm ever to express an opinion different from his, it's an argument, and it's an argument that he won't even listen to a single word from me in.",
            "title_similarity": "0.7233777",
            "sentiment_compound": -0.8276
        },
        {
            "id": "h2fpsi0",
            "score": 1,
            "text": "The fact that this needs to be said at all makes me deeply upset",
            "title_similarity": "0.51871395",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h2fqcns",
            "score": 1,
            "text": "From The 48 Laws of Power:\n\nLaw 46: *Never appear too perfect.*\nAppearing better than others is always dangerous, but most dangerous of all is to appear to have no faults or weaknesses. Envy creates silent enemies. It is smart to occasionally display defects, and admit to harmless vices, in order to deflect envy and appear more human and approachable. Only gods and the dead can seem perfect with impunity.",
            "title_similarity": "0.696597",
            "sentiment_compound": -0.6625
        },
        {
            "id": "h2fqcoa",
            "score": 1,
            "text": "Make sure to ask for their forgiveness as well.  It shows that not only are you in the wrong, but you need them to cover your sin against them.",
            "title_similarity": "0.7028236",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h2fr020",
            "score": 1,
            "text": "My MIL is 45 and she still refuses to take responsibility for anything ever. Her 15 year old daughter has taken on the same mentality. Do whatever you want, because if someone gets upset just blame it on someone else. Problem solved.",
            "title_similarity": "0.6221062",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2fr5zt",
            "score": 1,
            "text": "We all need some got dam tegrity.",
            "title_similarity": "0.39174193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2frc3c",
            "score": 1,
            "text": "Treat your kids like small adults, not done sub species.\n\nThey are people just like you and me with less life experiences.",
            "title_similarity": "0.6377651",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2frgda",
            "score": 2,
            "text": "Basically\n\nVirus teaches us about life",
            "title_similarity": "0.48273605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2frkpv",
            "score": 2,
            "text": "As a kid who never got apologized to when the parent was wrong, it's hard as an adult to admit that I was wrong or to apologize for things that was obviously my fault. It's something I still struggle with even though I know it's the right thing to do. It takes such a long time to retrain your brain to do this.",
            "title_similarity": "0.7573076",
            "sentiment_compound": -0.885
        },
        {
            "id": "h2fs0ov",
            "score": 1,
            "text": "Related - teach them this simple rule that will serve them well: If you’re wrong, just change your mind, and POOF you’re not wrong anymore.",
            "title_similarity": "0.67840034",
            "sentiment_compound": 0.1416
        },
        {
            "id": "h2fs0ym",
            "score": 2,
            "text": "Conversely, never admit a mistake and you’ll end up with a severely damaged human",
            "title_similarity": "0.5794171",
            "sentiment_compound": -0.6658
        },
        {
            "id": "h2fshr9",
            "score": 1,
            "text": "My favorite thing to say to my kids is \"I'm sorry, I've never been a parent before and I don't know what I'm doing all the time.\"",
            "title_similarity": "0.61300457",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2fskdj",
            "score": 2,
            "text": "Honestly this is the only LPT I've seen that encompasses an entire life. Not only does this teach integrity, it also teaches humility and empathy. \n\nNo one is on a pedestal, we're all human, we all deserve grace and understanding.",
            "title_similarity": "0.5731015",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h2ft31j",
            "score": 1,
            "text": "Having worked in service for most of my life, I learned pretty quickly that “throwing yourself on the mercy of the court” is always the best option. I messed up. I fessed up. And, inevitably, people are cool about it.",
            "title_similarity": "0.7255202",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h2ft7mx",
            "score": 1,
            "text": "And teach them to simply thank you for the apology rather than making them say “It’s ok”",
            "title_similarity": "0.59234",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2fth6g",
            "score": 2,
            "text": "An absolute must. And if you want to equip them for a good life, teach them how to give a good apology. Explain what you did wrong, how it impacted someone else negatively, and why that warrants an apology. Saying the words “I’m sorry” is a start, but isn’t a complete apology. You have to demonstrate  interest in understanding how your action affected someone else.",
            "title_similarity": "0.75476474",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2ftjnd",
            "score": 1,
            "text": "Yep, my parents never apologized to me and I often look back at my life and see how it effected me",
            "title_similarity": "0.58553517",
            "sentiment_compound": 0.0613
        },
        {
            "id": "h2ftsdx",
            "score": 1,
            "text": "I lost a lot of respect for my mother when she proudly told child me that \"she's never wrong, so why should she apologize for anything?\" She also doesn't accept my apologies when I admit that I'm in the wrong, saying that I should have known better beforehand (no matter if it wasn't preventable). It caused me to learn how to lie better, to always succeed the very first time, and feelings of inadequacy when I am a human and occasionally fuck up. It also caused me to often apologize (to the point where I would apologize for mundane things as a defense), and to learn how to *not* be like her.",
            "title_similarity": "0.87535655",
            "sentiment_compound": 0.8049
        },
        {
            "id": "h2ftyql",
            "score": 1,
            "text": "Can’t remember a time any of my parents admitted fault that wasn’t 25 years later in a matter of fact way. \n\nBoomers are frustrating but it’s getting easier ignoring them.",
            "title_similarity": "0.5686017",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2fu18h",
            "score": 1,
            "text": "what the fuck is wrong with your mom",
            "title_similarity": "0.4182823",
            "sentiment_compound": -0.765
        },
        {
            "id": "h2fu1ob",
            "score": 1,
            "text": "Never bullshit/lie to them ..",
            "title_similarity": "0.45004255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fu48r",
            "score": 1,
            "text": "Yes. Absolutely this.\n\nMy mother never apologized to me for anything, ever, and she always plays the victim. I’ve had to do lots of therapy work because of this.",
            "title_similarity": "0.6338765",
            "sentiment_compound": 0.1625
        },
        {
            "id": "h2fu5mq",
            "score": 1,
            "text": "Man I wish my mom at least knew what Reddit is",
            "title_similarity": "0.49121186",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2fu86i",
            "score": 1,
            "text": "This is great. But when you have emotionally immature parents you must learn to accept they are incapable of self reflections",
            "title_similarity": "0.7696136",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h2fukhx",
            "score": 1,
            "text": "Ive grown up without apologies, basically. So now i have a HUGE hard time apologizing, something i work on everyday. Thats a pretty good life tip.",
            "title_similarity": "0.6719419",
            "sentiment_compound": 0.8143
        },
        {
            "id": "h2fvfyg",
            "score": 1,
            "text": "Insert Danny DeVito shouting at Matilda.",
            "title_similarity": "0.3683895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fvita",
            "score": 1,
            "text": "Yep, my parents never apologized to me when I was a kid. My mum literally apologized to me once, but I was a teen already. It was for how she would be frustrated with that and take it out on me when I was a kid, I have this feeling of that moment ingrained in my memory if that makes sense. To be honest it was quite terrifying when a person who makes the. I out to be never wrong and always right about everything that you should never question tells you that they're sorry.\n\nAnd to be honest it resulted in a complete opposite to me. I learned that I'm stupid and wrong and I can never make mistakes and I'm always the one to apologize because this other person did nothing wrong. I literally lived my whole childhood thinking I was such a problematic kid and teen and recently in my 20s I realized I really wasn't lol.",
            "title_similarity": "0.7837094",
            "sentiment_compound": -0.7918
        },
        {
            "id": "h2fvoq5",
            "score": 1,
            "text": "Yup. One time my dad got super upset with me for not having taken a shower before playing video games (I had taken one and was in my jammies, I was just fully under the covers with my ds like 3 inches away from my face). Out of anger he took my ds and chucked it on the ground. I turned my sheets over to reveal that yes I had indeed taken a shower and he was not only in the wrong but broke what was at the time one of my important possessions for no reason.\n\nI reminded him of this moment later when I was in my 20s and he was just like “I really did that? And I didn’t replace your game or anything?” And I was like yup. You really did. I’m not in therapy for no reason buddy",
            "title_similarity": "0.572891",
            "sentiment_compound": -0.1803
        },
        {
            "id": "h2fwtlj",
            "score": 1,
            "text": "you know, this made me think and I can't remember my dad or even my mom ever admitting to me they were wrong about something. despite that, I will admit when I'm wrong.",
            "title_similarity": "0.707619",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h2fxcsq",
            "score": 1,
            "text": "Can this backfire in any way?",
            "title_similarity": "0.22986975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fxz77",
            "score": 1,
            "text": "The only times my parents ever apologized was when they beat me. Definitely made it more difficult as an adult to learn to admit I was wrong. Fucked with the first couple years of my first serious relationship.",
            "title_similarity": "0.66265976",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h2fybaz",
            "score": 1,
            "text": "I saw a lot of parents who scolded their kids for not saying please and thanks, but then they never used it themselves with their kids! If you want your kid to say that *start by saying it to them!* When you give them an apple say please when they bring you something say thanks, they will learn it that way it's not rocket science!",
            "title_similarity": "0.7733624",
            "sentiment_compound": 0.8623
        },
        {
            "id": "h2fyxcm",
            "score": 1,
            "text": "I apologize often to my 5yo daughter but I find the hardest part is not equivocating during the apology. \n\nFor example “I’m really sorry that I hurt your feelings, I didn’t mean to, but I know that’s what happened and I feel bad about that” is not always what comes out of my mouth. Instead it’s often “I’m sorry that I hurt your feelings, but I didn’t understand what you said or what  you wanted (or whatever) and I just made a mistake, it wasn’t on purpose.”  In trying to teach her about doing something by mistake vs on purpose, I’ve reduced the impact and sincerity of my apology, and like invalidated her feelings. \n\nIt’s a tough nut to crack because I DO want her to learn that she should apologize even if she hurts someone accidentally.  But the part about “if you *caused harm*, then apologize” is tricky when you are being accused of doing something on purpose and want to defend yourself/explain that it wasn’t on purpose.",
            "title_similarity": "0.7785449",
            "sentiment_compound": -0.9878
        },
        {
            "id": "h2fyxjo",
            "score": 1,
            "text": "My dad would never admit he was wrong and tell and scream at us when we tried to correct him.\n\nToxic AF but we learned to ignore him and just do what we knew was right",
            "title_similarity": "0.7977884",
            "sentiment_compound": -0.754
        },
        {
            "id": "h2fyzdz",
            "score": 1,
            "text": "Completely agree. My experience with my kids has always been that they copy what I do, not what I say. \n\nThey make you grow as a person too, so many times I have spotted a behaviour in my children that I disapprove of, only to realise its something I do too.",
            "title_similarity": "0.7842877",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h2fz3zj",
            "score": 1,
            "text": "I’m already 3 beers deep” if they push on you to come in.",
            "title_similarity": "0.30513668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g000n",
            "score": 1,
            "text": "Learning this in my second attempt.",
            "title_similarity": "0.29730827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g0kl5",
            "score": 1,
            "text": "LPT: Don't have kids.",
            "title_similarity": "0.24815549",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g0xcj",
            "score": 1,
            "text": "Also? Even if you were 100% in the right, if you lost your cool, took things too fair and actually caused emotional pain to your child, that's still grounds for an apology. Even as an adult, I still can't get this point across to my mom.",
            "title_similarity": "0.76094735",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2g1bar",
            "score": 1,
            "text": "You mean encouraging children to be compulsive liars isn’t a good idea!?\n\n😲",
            "title_similarity": "0.6167123",
            "sentiment_compound": 0.6996
        },
        {
            "id": "h2g1bg6",
            "score": 1,
            "text": "My mother was unable to apologize even when proved wrong in her face",
            "title_similarity": "0.5575491",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2g1cee",
            "score": 1,
            "text": "Yesss! Honestly have had so many times when I was little where my parents would reprimand me for something I did not do wrong. They'd also insist I apologise to them, even when I felt I was being wronged. When they eventually found out the truth, instead of apologising after, they'd simply wake me up with a McDonald's Happy Meal the next morning and expect that all was right in the world again.\n\nRecently with the pandemic, my parents have been working from home. Mum was complaining about how a colleague was stressing her out, and it was making her struggle with work etc. But afterwards when she'd calmed down, she called that colleague back and APOLOGISED for being flustered previously. What a shock it was for me to witness!",
            "title_similarity": "0.7359928",
            "sentiment_compound": 0.5734
        },
        {
            "id": "h2g1f0a",
            "score": 1,
            "text": "I just learned the word comport.",
            "title_similarity": "0.33707485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g2es3",
            "score": 1,
            "text": "What’s funny is that growing up as child, they taught us to be respectful to elders. But when I hit my early 20s I’ve realized that respect should be both ways. If you don’t respect me, I don’t want anything to do with you.",
            "title_similarity": "0.79120827",
            "sentiment_compound": 0.9194
        },
        {
            "id": "h2g2f4p",
            "score": 1,
            "text": "I always say sorry to my toddler if I’m wrong, so does my husband. Now my son says sorry if he does something that accidentally hurt someone or did something he understands wasn’t nice. I love the development!",
            "title_similarity": "0.7790466",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h2g2na5",
            "score": 1,
            "text": "Sometimes, the kids see the parents who don't apologize and learn how awful it is/feels. They then know never to do that.",
            "title_similarity": "0.78331065",
            "sentiment_compound": -0.51
        },
        {
            "id": "h2g36tu",
            "score": 1,
            "text": "My mother had a problem with this. My father still does. Anytime I'd catch my mother out on any crap she pulled, she'd just get mad and say \"Well I'm the mother\" and its just like, that doesnt change the shit you just pulled for no reason. Dad's still at the point where he can do no wrong and if he did, it was someone else's fault",
            "title_similarity": "0.82978994",
            "sentiment_compound": -0.3063
        },
        {
            "id": "h2g38z9",
            "score": 1,
            "text": "When my daughter was young i explained that a part of growing up and learning was about making mistakes and learning from them as we went. Every body makes mistakes, moms too. I asked her to forgive me for my mistakes and I would forgive her for hers. Lots of love and hugs always followed.",
            "title_similarity": "0.7840235",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2g3tud",
            "score": 1,
            "text": "I fought with my parents CONSTANTLY as a child/teenager, over real shit, over stupid shit, but it wasn't until I was 19 that my mother ever apologized to me first and for something real. Every other time we fought, I would have to apologize for getting angry first or my mother never would and wouldn't reconcile. Neither of them would ever admit they were actually wrong, only that they shouldntve \"gotten angry.\"",
            "title_similarity": "0.7410418",
            "sentiment_compound": -0.9468
        },
        {
            "id": "h2g4gp7",
            "score": 1,
            "text": "After reading this and was thinking about my parents.  I just realized my mom never once apologized for anything.  In fact she would blame us for making her feel bad about feeling bad...",
            "title_similarity": "0.7227029",
            "sentiment_compound": -0.8709
        },
        {
            "id": "h2g4ig5",
            "score": 1,
            "text": "Yeah, admitting that you’re wrong is being the bigger person",
            "title_similarity": "0.4224448",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2g4zyv",
            "score": 1,
            "text": "that's my parents with me didn't let it slip with my younger sibling tho",
            "title_similarity": "0.58787537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g50tw",
            "score": 1,
            "text": "My father threw cold coffee at me because i lost a wallet with a lot of money. Cried a lot and I fully understood why he got angry and was fully justified. At the middle of the night he came to me and said he is sorry.\n\nThat taught me to always say sorry no matter how angry I get. My father was always my hero, but that moment made me grateful to be his son.",
            "title_similarity": "0.6663716",
            "sentiment_compound": 0.2981
        },
        {
            "id": "h2g53e4",
            "score": 1,
            "text": "I apologise for my child's life all the time.",
            "title_similarity": "0.67480946",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2g5h8j",
            "score": 1,
            "text": "People that always pretend they are right lose my respect real quick.\n\nIt's like, dude. You aren't fooling anyone, you just look like an even bigger dumbass. And even if you were right all the time no one would be impressed. In general, people like people because they are nice.\n\nPeople who readily admit mistakes will earn trust and respect almost immediately.",
            "title_similarity": "0.7585311",
            "sentiment_compound": 0.9268
        },
        {
            "id": "h2g5o6f",
            "score": 1,
            "text": "I've already seen this exact post before. Is this a repost?",
            "title_similarity": "0.37008297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g5r08",
            "score": 1,
            "text": "Parents love defecting, like elementary school lractice for their next failed relationship.",
            "title_similarity": "0.7401334",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2g5yof",
            "score": 1,
            "text": "This is my mom and recognizing it has made me so much better at owning my mistakes",
            "title_similarity": "0.7165911",
            "sentiment_compound": 0.1725
        },
        {
            "id": "h2g64p6",
            "score": 1,
            "text": "My parents never apologized to me. I knew how badly I needed an apology sometimes and ended up overcompensating by apologizing for EVERYTHING to an annoying degree and have finally been changing that in the last few years.",
            "title_similarity": "0.7285937",
            "sentiment_compound": -0.7822
        },
        {
            "id": "h2g6vw6",
            "score": 1,
            "text": "Great tip. Also gives them a chance to know what it feels like to be on the receiving end of an apology. To those who never get them, it can feel like you’re giving something up or losing face, while it’s actually opposite.",
            "title_similarity": "0.6096084",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h2g6zz6",
            "score": 1,
            "text": "Yes we do this all the time especially after losing patience. And when our 3 year olds get worked up (happens a lot at this age) they often calm themselves down and apologize!",
            "title_similarity": "0.6275795",
            "sentiment_compound": 0.4241
        },
        {
            "id": "h2g76qy",
            "score": 1,
            "text": "This hits right in the feels. Honestly I don’t have a lot of clear memories when I was little bit I still clearly remember the day my dad apologized to me after he promised to get me a drink from the vending machine but then we both forgot about it. We were walking home and halfway there when he suddenly remembered and apologized and said he needs to keep his promise so we found another vending machine and he got me a drink. As a little kid I was really shocked that a grownup had apologized so sincerely, for something so trivial that he could’ve easily dismissed and I probably wouldn’t have thought much of it. Now that moment stays with me forever and I’ll never forget.",
            "title_similarity": "0.69238365",
            "sentiment_compound": 0.9655
        },
        {
            "id": "h2g7tuf",
            "score": 1,
            "text": "My wife's parents never apologize for anything. They changed her phone plan without telling us. Her dad deflected anything related to blame or apologizing. It definitely hurts our relationship with them even as adults.",
            "title_similarity": "0.7082807",
            "sentiment_compound": -0.5261
        },
        {
            "id": "h2g7xlc",
            "score": 1,
            "text": "Remember, as a parent you are entitled to bring up your children in whatever way you want. Whatever justifications you want to use, you can use them.\n\nAnd when they never visit you and grower older and come closer and closer to death, you can use that too.",
            "title_similarity": "0.71554625",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2g8edj",
            "score": 1,
            "text": "At least 1/3 of the US cannot do this.",
            "title_similarity": "0.14352295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g8q18",
            "score": 1,
            "text": "I apologized to my older children for being a strict.  My kids were 5 years apart on the dot.   And yes, your a better parent at 45 than 20.  You have to apologize to your older children and remind them,  no matter how old we are are, we learn,  grow and become better people.",
            "title_similarity": "0.6217256",
            "sentiment_compound": 0.8786
        },
        {
            "id": "h2g93mz",
            "score": 1,
            "text": "My two year old asks people to say sorry",
            "title_similarity": "0.42212778",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2g98fq",
            "score": 1,
            "text": "I read somewhere that kids learn identifying hypocrisy at 7 years old",
            "title_similarity": "0.47327772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g9zmb",
            "score": 1,
            "text": "Hits home.  My dad still cannot admit when he is wrong, anytime you correct him it becomes a personal attack on his character",
            "title_similarity": "0.6888736",
            "sentiment_compound": -0.7777
        },
        {
            "id": "h2gabq8",
            "score": 1,
            "text": "My mom had this mentality growing up and I can say with 100% certainty it confused me and I’m now spending a lot of time doing some unlearning about how to deal with conflict. I have come a long way for sure but damn",
            "title_similarity": "0.6701634",
            "sentiment_compound": -0.5187
        },
        {
            "id": "h2gaf1k",
            "score": 1,
            "text": "Also apologise when you are unnecessarily grumpy or strict. Parenting drives you nuts but I always do. My son comes to me with more problems than to his mother, I think part of it is because I communicate to him about my own shortcomings and when they effect him....",
            "title_similarity": "0.79429245",
            "sentiment_compound": -0.5913
        },
        {
            "id": "h2gald5",
            "score": 1,
            "text": "For fuck’s sake this. And explain *why* you are wrong, why you thought you were right, without making excuses, and commend them for saying the right answer, especially if there was any debate involved. Kids need to know when to call their parents out, and parents need to know they have no right to demand their kids agree.",
            "title_similarity": "0.8752334",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2gar5v",
            "score": 1,
            "text": "My niece gets very upset and flustered when she makes a mistake in front of people. I always try to do something goofy like pretend to trip and make a fart sound when I hit the ground, and tell her that 'Uncle's an adult, and I mess up all the time. It's okay to mess up, these things happen.'",
            "title_similarity": "0.6454881",
            "sentiment_compound": -0.8204
        },
        {
            "id": "h2gauyb",
            "score": 1,
            "text": "I do this and am totally reaping the benefits.  \n\nAlso:  Show appreciation to them.  \"Thanks for taking your plate over!\"  \"You have been such a helper to me today!\"  \"I needed a hug too, thank you.\"  Every little thing counts.",
            "title_similarity": "0.5239606",
            "sentiment_compound": 0.9489
        },
        {
            "id": "h2gbsyl",
            "score": 1,
            "text": "Im probably saying this for every child ever, but tell that to my dad",
            "title_similarity": "0.57941896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gc3c3",
            "score": 1,
            "text": "And it doesn't make them lose respect for you. It makes them respect you more when you admit and correct your mistakes.",
            "title_similarity": "0.6015246",
            "sentiment_compound": 0.7919
        },
        {
            "id": "h2gcw18",
            "score": 1,
            "text": "My mom would never admit that she's wrong. Even when its so obvious that she fucked up, she'll just get mad at you and give out the silent treatment.",
            "title_similarity": "0.7893095",
            "sentiment_compound": -0.906
        },
        {
            "id": "h2gcxot",
            "score": 1,
            "text": "Never blame someone for a mistake.  Just ask that they pay for it.",
            "title_similarity": "0.6414413",
            "sentiment_compound": -0.1935
        },
        {
            "id": "h2gd8d7",
            "score": 1,
            "text": "Indian parents: This is worthless!",
            "title_similarity": "0.42753595",
            "sentiment_compound": -0.4926
        },
        {
            "id": "h2gdy0i",
            "score": 1,
            "text": "Unfortunately, most parents who are unwilling to apologize are narcissists.  A “normal” parent doesn’t just simply not understand that it’s okay to apologize to their child.",
            "title_similarity": "0.72224927",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2ge5v2",
            "score": 1,
            "text": "Dude I wish, my mom has never admitted to being wrong in her life, she always flips it around saying why you are the one in the wrong",
            "title_similarity": "0.73178977",
            "sentiment_compound": -0.5853
        },
        {
            "id": "h2geajo",
            "score": 1,
            "text": "I'm wrong a lot. My daughter knows it and I know it. I'd look pretty freaking stupid and lose all credibility if I doubled down with my wrongness.\n\nI always apologize and we talk about what happened. \n\nMy mom and I just always ignored (sometimes still do, but it's better) the wrongness on both sides and 'moved on'.",
            "title_similarity": "0.7542226",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2geh42",
            "score": 1,
            "text": "Got me some of that Tegridy",
            "title_similarity": "0.20608513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gemsq",
            "score": 1,
            "text": "It will also lessen lingering resentments they may have or develop",
            "title_similarity": "0.4885273",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2geya9",
            "score": 1,
            "text": "lol yesterday I had a longer than it should be argument about where my birth certificate was when I knew she had it the whole time. She continued to nag at me even after we found out that I was right and she had my bc. Lol oh well",
            "title_similarity": "0.57916486",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2ggsae",
            "score": 1,
            "text": "I would like to add, when you apologize to a younger/smaller child, make sure you get down to their eye level and look them in the eyes when you do so. Don’t make it a throw away apology, it helps them realize the importance of the apology and that you’re sincere!",
            "title_similarity": "0.74959",
            "sentiment_compound": 0.9134
        },
        {
            "id": "h2ggt8q",
            "score": 1,
            "text": "I finally got that apology at 28 please for your kids, future kids, admit when your wrong sooner.. it fucked me up mentally, all the gaslighting and feeling bad for being right really screwed with me.",
            "title_similarity": "0.7054994",
            "sentiment_compound": -0.8932
        },
        {
            "id": "h2ggyd6",
            "score": 1,
            "text": "Yea. Apologize to your friends, your partners, your parents, your siblings if you’ve done something wrong and realized it. Apologizing is hard and is not a sign of weakness, it’s a sign of growth and empathy. It fosters connection and motivates kindness.",
            "title_similarity": "0.767336",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2ghiax",
            "score": 1,
            "text": "I really think this will be our generations \"Don't hit your kids\". Plenty of people from the older generation had/ have parents who they love and respect, but pretty much all of them agree that corporeal punishment was bad parenting and represents times when there parents took the lazy way out. For my generation a lot of us have memories of times our parents were clearly in the wrong, and instead of taking the time to have a discussion, they just blew up if we every pointed it out, and we would simply be punished further. I don't think my parents every apologized to me about anything until I was well into adulthood. And I don't mean for more conceptual things, I mean for ANYTHING. It didn't teach me not to apologize in general, but it did teach me to never apologize to my folks and set up an unnecessarily adversarial relationship between us. If I hadn't helped provide end of life care for my mom, which required a lot of communication between me and my dad, I don't think we would have ever gotten over that.",
            "title_similarity": "0.84485084",
            "sentiment_compound": -0.2354
        },
        {
            "id": "h2ghpoy",
            "score": 1,
            "text": "Yes do it now, integrity is harder to learn later",
            "title_similarity": "0.47199076",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2ghq5k",
            "score": 1,
            "text": "Please. My mom never apoligized to me when she was wrong, and just stewed silently whenever she was proven wrong. It does affect your children and how they percieve the world",
            "title_similarity": "0.7827412",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2ghszx",
            "score": 1,
            "text": "Apologies are not required as long as you do the right things for them and the family.  Going off half cocked is not a good parenting practice.  Be truthful, honest, and firm with kids and they will learn the same.",
            "title_similarity": "0.8136893",
            "sentiment_compound": 0.5986
        },
        {
            "id": "h2gi02i",
            "score": 1,
            "text": "Also, to add on, feelings are never wrong, but behaviours are. For very young children you can still discuss: \n\nex. \n\n\"Daddy was angry so he broke the TV. It's ok to be angry, but I shouldn't have hit the TV, now we have to buy a new one.\"\n\nThis can encourage validation and reduce feelings of shame. You could then go on to discuss something like, \"Next time Daddy is angry what should he do?\" And then help your child to discuss ways to handle emotions healthily. \n\nBeing wrong is a great chance to parent right.",
            "title_similarity": "0.8160269",
            "sentiment_compound": -0.5846
        },
        {
            "id": "h2gijq8",
            "score": 1,
            "text": "Totally. \n\nWith my 4 year old we have both learned when someone is angry, give a little time for a cool down then we talk. \n\nThere have been times where I was mad, not at her and sometimes for nothing reasonable and after I calmed down I just talk to her. Explained how I felt and I wasn't angry with her or anyone else. Or if I was angry I talk about how I felt and what she did that made me feel that way. \n\nIt's helped me and her develope more in a bunch of ways. \n\nSometimes if she gets angry for something I asked her to do she'll eventually come and apologize on her own. \n\nWorks wonders",
            "title_similarity": "0.74978465",
            "sentiment_compound": -0.7268
        },
        {
            "id": "h2gje10",
            "score": 1,
            "text": "Rule #1 - I am always right.\n\nRule #2 - If I am wrong, refer to rule #1",
            "title_similarity": "0.53384244",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2gjqyf",
            "score": 1,
            "text": "Over the last few years I've slowly learned that my father is a self-serving, manipulative, greedy narcissist. He didn't even wait 3 months before getting another woman after him and my mother separated a 23 year long marriage. He's never given me a heart felt apology for insulting my s/o, in our own home. He constantly complains about money when he makes 6 figures, because of his constant need to buy expensive things he can't afford. On top of that not only did he call my little sister a lover for wanting to get her dog certified as an emotional support animal, he claims our lack of communication is my cutting him out of his life. This will be the first year I dont wish him a happy father's day.",
            "title_similarity": "0.58067364",
            "sentiment_compound": 0.4916
        },
        {
            "id": "h2gl0yj",
            "score": 1,
            "text": "Totally agree. Kids will copy our mannerisms good and bad. If we want them to go out into the world admitting, owning up to, and fixing their mistakes, then we ought to do it first at home as a model for them to follow.\n\nTry telling that to my old school Chinese MiL, where she lives by the do as I say, not as I do, never be wrong attitude. 8S",
            "title_similarity": "0.7536586",
            "sentiment_compound": 0.3709
        },
        {
            "id": "h2glh64",
            "score": 1,
            "text": "Watching the Sopranos a second time as an adult helped me realize how bad my grandma and older sister fucked with my mom’s head. \nAnd also fucked with me when I was in their supervision. \n\nThankfully, my mom busted her ass always so she could be independent. Was able to afford and find therapy once I grew up and left the house. With professional help she was able to get out from under their negative shadows/guilt trip treatments to find self confidence, self assurance and happiness. \n\nI’m still fucked though. But that’s not their fault, that’s from failure and alcohol.",
            "title_similarity": "0.7324201",
            "sentiment_compound": -0.8231
        },
        {
            "id": "h2gnby0",
            "score": 1,
            "text": "At any age too. If you fuck up with your 30 year old child you still need to own it.",
            "title_similarity": "0.5296037",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2gnd5w",
            "score": 1,
            "text": "The best boss I've ever had was one who would go out of his way to admit when he was wrong and work witb people to try and fix it. It really created a culture where people were more willing to admit their mistakes, since they knew it wouldn't be a big deal as long as it could be resolved",
            "title_similarity": "0.78081596",
            "sentiment_compound": 0.6659
        },
        {
            "id": "h2gpjih",
            "score": 1,
            "text": "I actually don't think that mentality is still strong. None of my patent friends have this approach. We all admit fault we apologize to our children. Some do it less frequently, but I don't see that what I say is right now shut up mentality. Maybe I'm wrong, maybe it has to do with a lot of factors, such as education, socioeconomic status, education, etc. I just know for us, it is not a thing.",
            "title_similarity": "0.7875344",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2gqoho",
            "score": 1,
            "text": "Not that you're \"wrong\", but barely 3 paragraphs and no studies supplied?\n\n/r/armchairpsychology/",
            "title_similarity": "0.34545773",
            "sentiment_compound": -0.2554
        },
        {
            "id": "h2gr4fq",
            "score": 1,
            "text": "Why wouldn’t someone apologize to their children when necessary? Are people bot doing this?",
            "title_similarity": "0.7221483",
            "sentiment_compound": 0.1926
        },
        {
            "id": "h2grbal",
            "score": 1,
            "text": "Lol, I'm 24 and I don't think my mom as ever admitted to being wrong to me or anyone else ever...",
            "title_similarity": "0.45307195",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2gst08",
            "score": 1,
            "text": "My dad still refuses to ever admit he is wrong about anything.\n\nReally did a number on me",
            "title_similarity": "0.62358034",
            "sentiment_compound": -0.1868
        },
        {
            "id": "h2gtcc4",
            "score": 1,
            "text": "the worst thing a parent can have is a big ego",
            "title_similarity": "0.46443146",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2guofj",
            "score": 1,
            "text": " I work with preteens and teens, i've actually apologizied to some of thems cause I was plain wrong about something I had said to them . Middle schools and high schools should be places where they learn about adults making mistakes and owning it, so they'll know to be honest with us when need be.",
            "title_similarity": "0.8024535",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2guswc",
            "score": 1,
            "text": "I don't think this is a pro tip, this is normal parenting. If you don't do this then you're not a good parent",
            "title_similarity": "0.65231204",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h2gv238",
            "score": 1,
            "text": "This is great advice but you used the word \"comport\". Most parents who need this advice won't know what you're talking about.",
            "title_similarity": "0.71451557",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h2gwgao",
            "score": 1,
            "text": "The amount of parents that don’t understand this baffles me. I do family therapy and am constantly confronted with parents who ask their kids to do things that they refuse to do; like own up to mistakes, take accountability, have the basic ability to emotionally regulate, the list goes on. Why would you expect anything other than your child mimicking your own behavior?",
            "title_similarity": "0.83514977",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2gy59p",
            "score": 1,
            "text": "I thought this was going to be in unpopular opinions when I first read the title. Lol",
            "title_similarity": "0.5385877",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2gz2ht",
            "score": 1,
            "text": "This is admitting defeat and showing weakness.  Thia Linda shit will make your kid a bitch.",
            "title_similarity": "0.63341016",
            "sentiment_compound": -0.9217
        },
        {
            "id": "h2gzky4",
            "score": 1,
            "text": "I’ve already admitted to my kids that I make mistakes and I will get stuff wrong when raising them, but to know everything I do comes from a place of wanting the best for them, even if I f it up and it turns out wrong",
            "title_similarity": "0.8289803",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h2h1dfq",
            "score": 1,
            "text": "As a father of  a couple kids in their 20's and a teen, it was easy to apologize when they were very young but asking for forgiveness of a defiant teen or young adult was the toughest gesture.  At least for me.",
            "title_similarity": "0.71130675",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2h2xi3",
            "score": 1,
            "text": "I will say this is true, but my Dad was full of himself 24/7. It took me until adulthood to realize what an asshole he was to my Mom and me. I know I’m probably in the minority but I learned how not to act from him.",
            "title_similarity": "0.72650874",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2h3t2m",
            "score": 1,
            "text": "My dad faithfully did this growing up. Today I am the biggest liar in my town",
            "title_similarity": "0.6074816",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2haljq",
            "score": 1,
            "text": "Or you'll end up like most people and most people can't admit fault. Took me years to learn to admit I'm wrong with meditation everyday.",
            "title_similarity": "0.6542221",
            "sentiment_compound": 0.1537
        },
        {
            "id": "h2hcg1l",
            "score": 1,
            "text": "Yesterday I was at my babysitting job (been there 6 years), and I thought a TV rule was x and the toddler was telling me it was y, and the older kid didn’t know, so I texted the mom and it turns out it was y. \n\nI absolutely made sure to apologize and thanked them for their patience with me figuring it out with mom. \n\nIn similar vain, I also try to answer “why” questions that the toddler asks me. Imo it’s so important to not just say “because I said so/I’m the boss.” It teaches kids that they just have to blindly accept authority, and that can be dangerous in many types of interpersonal relationships.",
            "title_similarity": "0.7169856",
            "sentiment_compound": 0.6422
        },
        {
            "id": "h2hl0yo",
            "score": 1,
            "text": "I gotta agree with this. My parents acted like they could do no wrong and never apologized. They are getting better at it albeit still dont fully acknowledge their wrongs. \n\nI had a tough time admitting I was wrong when I was and found it extremely hard to apologize. But I've grown from that and will apologize when I think Im wrong",
            "title_similarity": "0.8289655",
            "sentiment_compound": -0.2775
        },
        {
            "id": "h2hmbyb",
            "score": 2,
            "text": "I still remember the first time an adult apologized to me.",
            "title_similarity": "0.45769256",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2hnv8r",
            "score": 1,
            "text": "The first time is the hardest, but after that it becomes like normal conversation. I apologize to my boys whenever I go off the handle, and I believe that their empathy/emotional intelligence reflects it. I’m proud of them; good LPT",
            "title_similarity": "0.68645495",
            "sentiment_compound": 0.9517
        },
        {
            "id": "h2hnzh5",
            "score": 1,
            "text": "Just get in a fight with mom and dad?",
            "title_similarity": "0.50630754",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2hr94p",
            "score": 1,
            "text": "My mother has never been wrong. What’s to apologize for? /s insert deepest sarcasm here <——",
            "title_similarity": "0.64796025",
            "sentiment_compound": 0.2626
        },
        {
            "id": "h2hrfih",
            "score": 1,
            "text": "Also, if you're a teacher - do this with your students. It's how they know they can trust you to be fair and it models leadership.",
            "title_similarity": "0.6810775",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2hwe7b",
            "score": 1,
            "text": "My dad never admitted he was wrong or apologized for anything. When I was in middle school the bus was late in the mornings for a few weeks and the school called my parents to report I kept being late. My dad asked me about it and called me a liar when I said it was because of the bus. I guess he called and they admitted it was because of the buses. He apologized to me the next day. It was one of the only times I ever felt any amount of respect from my dad.",
            "title_similarity": "0.57086",
            "sentiment_compound": 0.1037
        },
        {
            "id": "h2idtjn",
            "score": 1,
            "text": "I have learned that my parents pretend to be winners then when money or bribery is involved they turn into losers. I have learnt to distance myself from them.",
            "title_similarity": "0.6883583",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2igk17",
            "score": 2,
            "text": "I've been told not to apologize to my kid when I do something wrong....I have a very strained relationship with my parents and they hardly say sorry and when they do it's honestly pointless",
            "title_similarity": "0.72831637",
            "sentiment_compound": -0.08
        },
        {
            "id": "h2j81tw",
            "score": 1,
            "text": "Im 22 and dealing with this even now, my mother thinks she deserves respect even when in the wrong, and is a massive hypocrite in that regards as she has a heated temper over little things.",
            "title_similarity": "0.743353",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2kd3t1",
            "score": 1,
            "text": "My mom feels like what she does was great and we should be greatly to her and listen to her and do what she wants everything.\n\nShe never apologies and simply says I'm elder and if I'm her age , I willl also do same thing every time she says or does wrongly . She justification was : \" I'm old, I gave birth to 3 kids and raised them don't say anything to me , if you want do it your self and I know what to do and do what I saw , I need not to explain to you\".\n\nIt's this attitude I hate most of her and I never talks to her unless she calls or asks anything from me . I simply remain silently around her and sharing my opinions is like my punishment to me and she scolds and disregard by views .",
            "title_similarity": "0.7590095",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2lmwsy",
            "score": 1,
            "text": "Agreed!!!! I would also like to add to not pull the “do as I say, not as I do” on them and lead by example. You don’t want them doing or saying certain things? Don’t do/say those things either. Kids are literally products of their environment. \n\nI grew up in a toxic household where my parents can tell me to shut up all they want but if I told them that, I was “disrespectful” and got punished. \n\nYour kids are human beings too so treat them as such. Otherwise you’re instilling fear and resent into them and they’ll grow up having trouble with their peers and other authorities as a result.",
            "title_similarity": "0.8735769",
            "sentiment_compound": -0.801
        },
        {
            "id": "h2vvti1",
            "score": 1,
            "text": "Also they might end up despising you for being an asshole. Children can hold onto grudges for years",
            "title_similarity": "0.6966729",
            "sentiment_compound": -0.5719
        }
    ]
}