{
    "LPT: much like a gun is always loaded, a microphone during a work Zoom is always unmuted\nInspired by this thread https://www.reddit.com/r/AskUK/comments/o6w2d7/my_microphone_was_accidentally_on_and_i_called_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf": [
        {
            "id": "h2xe9br",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.38915142",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h2vniv3",
            "score": -6,
            "text": "Most professionals don’t use zoom. They use Teams",
            "title_similarity": "0.36129528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w60gz",
            "score": 0,
            "text": "Until you go to speak on purpose, in which case it is always muted",
            "title_similarity": "0.4924188",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wnnbs",
            "score": 0,
            "text": "That is why I launched a video conferencing platform that actually respects the sanctity of the Mute button; plus some other fundamental privacy rights.\n\nwww.blancconferencing.com",
            "title_similarity": "0.48071307",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2wvkdb",
            "score": 0,
            "text": "19 years ago, teamspeak came out, some of us have been using Push to Talk since then. CB/Two way radios have been existence for much longer. What is so hard for you guys to learn to use PTT?",
            "title_similarity": "0.52173597",
            "sentiment_compound": -0.2183
        },
        {
            "id": "h2x6uxs",
            "score": -4,
            "text": "Mic is always hot, but guns? Oh you Americans.",
            "title_similarity": "0.59841216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ygq3j",
            "score": 0,
            "text": "This sub is so fucking lame. Which karma farm did op the fagatron use?",
            "title_similarity": "0.41618448",
            "sentiment_compound": -0.5222
        },
        {
            "id": "h2yyt9i",
            "score": 0,
            "text": "I gun should be constantly unloaded I don't know where you heard this garbage. it's a health hazard, you load it at a time of need",
            "title_similarity": "0.6701676",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2vvssc",
            "score": 5,
            "text": "When the online classes had just started, i called my teacher a bitch and i had turned the speakers off so the whole time she said to turn the mic off i couldn't hear. Finally after a while my friend dmed me telling me to mute myself",
            "title_similarity": "0.53308105",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2wgo1e",
            "score": 1,
            "text": "I doubt I’m stupid enough to accidentally unmute, it’s fine.\n\n - said Jeffery Toobin, author, political and legal commentator for cnn, former associate counsel in the Justice Department, writer for the New Yorker, and guy caught vigorously masturbating during work zoom video call.",
            "title_similarity": "0.58098567",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2wpmcj",
            "score": 1,
            "text": "Thanks Jeffrey Toobin for the advice.",
            "title_similarity": "0.18634178",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2xagox",
            "score": 1,
            "text": "LPT: Obvious things are Obvious",
            "title_similarity": "0.17222667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xnb8e",
            "score": 1,
            "text": "Confused Americans will end up shooting their webcam.",
            "title_similarity": "0.49743807",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2y5pk6",
            "score": 1,
            "text": "fun fact, this sub is turning to shit and this isn’t a life pro tip",
            "title_similarity": "0.38885763",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2w48vs",
            "score": 2,
            "text": "We have a game in our virtual meetings.... How long do we let a given person talk before notifying them they are on mute?",
            "title_similarity": "0.4836575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wtpzb",
            "score": -3,
            "text": "Fun fact, in almost every meeting the host can actually hear everything.",
            "title_similarity": "0.35163063",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2vr0n3",
            "score": 54,
            "text": "Get yourself a mic with a hardware mute switch, problem solved.\n\nEdit for the naysayers: In spite of what you say I'm not doubting my advice at all, but I am questioning the mics you all are buying. I've used two headsets with in-line mute switches and my current mic has a capacitative mute switch on the top with an indicator light. Never an issue.",
            "title_similarity": "0.64234585",
            "sentiment_compound": -0.0982
        },
        {
            "id": "h2vvti3",
            "score": 7,
            "text": "as there's a drive into deep left field by Castellanos and that'll make it a 4-0 ballgame",
            "title_similarity": "0.38880578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w746h",
            "score": 15,
            "text": "Leave the mic on. Shut your mouth and write down all the shit that goes through your head. You will look professional taking notes and develop the very  useful skill to keep your mouth shut.",
            "title_similarity": "0.5332476",
            "sentiment_compound": 0.7902
        },
        {
            "id": "h2vyxzn",
            "score": 24,
            "text": "Just saw a video yesterday of a politician on a Zoom meeting have the excuse herself because her kids were being too loud in the other room.   \nShe thought she muted the call, but everyone could hear her treating them really, really poorly. I was watching it and thinking \"How could anyone treat their kids as a mother f\\*cker?\"  \nPretty sure you could hear some smacks too. In any case, it was bad enough anyone on that call would have been very justified to call Child Protective Services.",
            "title_similarity": "0.56168497",
            "sentiment_compound": 0.8804
        },
        {
            "id": "h2w34co",
            "score": 27,
            "text": "This.\n\nAlways pretend like mute is off, don't talk even on mute. Turn off all other sound. Condition yourself to empty silence during this. (If you can in your home) Then you'll never accidentally say a word, as you are acting like you are in a real meeting always.\n\nSo far, this has yet to fail me over 8 years of remote meetings.\n\n*However camera settings have royally fucked me up one time lol.*",
            "title_similarity": "0.6578658",
            "sentiment_compound": -0.3103
        },
        {
            "id": "h2w35ak",
            "score": 30,
            "text": "My cousin got fired because he called a client a fucking idiot or something along those lines when he thought he was muted. So yeah don't trust the mute button.",
            "title_similarity": "0.4099905",
            "sentiment_compound": -0.807
        },
        {
            "id": "h2vyqhq",
            "score": 41,
            "text": "Usually before I say something that isn't part of the meeting, or sometimes just periodically, I will say out loud, \"I'm on mute, right?\"",
            "title_similarity": "0.4406259",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vmili",
            "score": 164,
            "text": "And camera too, Mr. Toobin.",
            "title_similarity": "0.20407796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w44uz",
            "score": 61,
            "text": "[deleted]",
            "title_similarity": "0.15515806"
        },
        {
            "id": "h2vweo4",
            "score": 63,
            "text": "I used to work in tech support and man did I use the mute button just to sigh or let frustration out, that is until one of my coworkers muted and cursed or something and the mute button was broken. I think he played it off like he spilled hot coffee on himself lmao. After that, the mute button meant nothing to me.",
            "title_similarity": "0.5257015",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2w2bq8",
            "score": 276,
            "text": "Same applies to hold music! If you're on hold (with your bank, customer service, ISP, etc) don't assume that just because hold music is playing that they can't hear you. \n\nSometimes they can",
            "title_similarity": "0.40731668",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h2vsxui",
            "score": 74,
            "text": "On the webcam side of this same LPT, my new webcam actually came with a little privacy window, like a cover on a hinge that flips up to use the webcam and I love it so much.",
            "title_similarity": "0.45464978",
            "sentiment_compound": 0.7533
        },
        {
            "id": "h2vy3ml",
            "score": 247,
            "text": "Accidentally read most of my team a few pages of 'Harry and the Dinosaurs' a couple of weeks back. Thank God it wasn't worse!",
            "title_similarity": "0.47287065",
            "sentiment_compound": 0.6182
        },
        {
            "id": "h2vtj4f",
            "score": 599,
            "text": "Been burned on this before.\n\nDuring a meeting with my team I was “muted” and doing other things, not paying attention really.  I encountered a problem and let out a huge exasperated sigh, to which everyone in the meeting responded to with “ooooh, u/decalod85 didn’t like that Albert.  You better find a different way to fix it.”\n\nPoor Albert thought I was massively pissed about how he was doing some task.  Fun to explain that it was something else, and basically let everyone know I wasn’t paying attention.",
            "title_similarity": "0.5264341",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2vsnha",
            "score": 2470,
            "text": "Correction: a microphone in a Zoom meeting isn't always muted. It's always in whichever state is least useful/most harmful.\n\nSo if you need to speak, it's muted. But if you just said *\"Can you believe this fucking idiot?\"* during the CEO's presentation, it's unmuted.",
            "title_similarity": "0.6979047",
            "sentiment_compound": -0.7086
        },
        {
            "id": "h2vrr2p",
            "score": 202,
            "text": "This is a good rule of thumb. Camera and mic are are ON if you are connected.",
            "title_similarity": "0.29645634",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2vx1nv",
            "score": 628,
            "text": "Worked in tv news, it’s beaten into you that the mic is always hot. Years ago I had two anchors shit-talking one of the reporters in the field between segments. Thanks to an audio board glitch, their microphones instead of what was broadcast was coming over his earpiece.",
            "title_similarity": "0.6262783",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2vpr6r",
            "score": 5560,
            "text": "A co-worker has been saying for years \"never trust the mute button.\"",
            "title_similarity": "0.5344784",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h2vsbff",
            "score": 3564,
            "text": "[deleted]",
            "title_similarity": "0.15515809"
        },
        {
            "id": "h2vvoc6",
            "score": 40,
            "text": "[deleted]",
            "title_similarity": "0.15515806"
        },
        {
            "id": "h2vwphe",
            "score": 1,
            "text": "I always double mute, zoom and a button on my headset. Headset has a red light on the end of the mic boom when it is muted",
            "title_similarity": "0.63196874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vx9mx",
            "score": 6,
            "text": "\"Don't run your mouth in ways that you'll regret.\"",
            "title_similarity": "0.2848976",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2vy0jl",
            "score": 13,
            "text": "Ah, yes, that's why I've made myself an autohotkey script, with 4 modes (disabled, PTT, PTM and P-ToToggle), and so if I'm talking shit about someone, I'll just set it to PTT, and my mic will remain muted and will unmute only when and while I'm holding certain key on keyboard (in my case, capslock). So the need to physically push and hold the button reduces these accidents to... Let's just say I've never had this kind of accident happen to me.\n\nAnd I do talk a lot of shit about people sometimes :D",
            "title_similarity": "0.7316222",
            "sentiment_compound": -0.6199
        },
        {
            "id": "h2vyjnn",
            "score": 64,
            "text": "Also if you get into a car with Bluetooth during zoom it unmutes you.. I learned that the hard way last week. Lol",
            "title_similarity": "0.63851625",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2vylfz",
            "score": 2,
            "text": "I have microphone muted in PC settings AND the button on the headset muted. \n\nI still check.",
            "title_similarity": "0.5466594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vz45q",
            "score": 1,
            "text": "Always mute at the device level.",
            "title_similarity": "0.41711557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2vzfje",
            "score": 241,
            "text": "[removed]",
            "title_similarity": "0.12808225"
        },
        {
            "id": "h2vznlx",
            "score": 1,
            "text": "Instructions unclear.\nCoworker shot.",
            "title_similarity": "0.4071266",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2vzrei",
            "score": 8,
            "text": "And always, always, always make sure you're in a private thread and not the call chat before making fun of how this meeting could have easily been an email.",
            "title_similarity": "0.67382425",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h2w07m4",
            "score": 2,
            "text": "This is precisely why my webcam is unplugged unless I'm using it.",
            "title_similarity": "0.6654719",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w0jrj",
            "score": 2,
            "text": "I never said anything bad during my zoom calls, but I did play a lot of Apex while I was in certain meetings. I was always afraid someone would ask what all the gun sounds were lol.",
            "title_similarity": "0.7035907",
            "sentiment_compound": 0.8061
        },
        {
            "id": "h2w0jyu",
            "score": 165,
            "text": "A mic is always live. I learned this after I got my first write up some years back as a 911 operator because I muted the mic to argue with another dispatcher about the necessity of sending police to a call.\n\nOur agency doesn't respond to medical calls where there are trained doctors or nurses on staff. As a rule, we transfer those calls to the ambulance service, remain on the phone until EMS clears us and hang up. This call was for a nursing home for patients suffering severe burns, a patient had gone into cardiac arrest and needed an ambulance. The nurses who called it in were laughing their asses off and sounded to me like they were high or intoxicated in some way. They assured the ems dispatcher they were performing cpr, but having heard and performed CPR myself, it didn't sound like it to me.\n\nSo I sent the call to the radio dispatcher, who promptly argued with me that policy wasn't to send on medical calls. I muted the headset and told him \"they're laughing over this guy as he's dying and it sounds like they aren't giving the CPR they said they are, they are some shady motherfuckers, send an officer.\"\n\nDidn't think anything of it for months until I got called back into my supervisor's office, who played a court transcript recording for me. Apparently the family had sued for wrongful death and the 911 calls were subpoenaed. The EMS dispatcher didn't hear me. The staff at the home didn't hear me. An entire courtroom however, heard me call the nursing home staff \"shady motherfuckers.\"\n\nThe defense was unhappy to say the least. For me it was a written slap on the wrist, it was a new phone system and no one knew it still recorded us. Still, never say anything on a mic I wouldn't say to my family.",
            "title_similarity": "0.5969285",
            "sentiment_compound": -0.8186
        },
        {
            "id": "h2w0qwe",
            "score": 37,
            "text": "While muted, I switched headphones from wired to wireless during a work call, and then found out that since the wireless ones have a mic, Zoom helpfully unmuted me.  I found out when everyone on the call told me to shut up and stop talking to my wife.",
            "title_similarity": "0.6477485",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2w0sl0",
            "score": 1,
            "text": "Double mute. Mute the mic and yourself virtually in the call room. Much better to have to explain you were double muted if called on that to have a slip up",
            "title_similarity": "0.54286075",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2w14i9",
            "score": 2,
            "text": "As someone in the other thread said, microphones are like guns, always think they are loaded.",
            "title_similarity": "0.6360158",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2w165j",
            "score": 10,
            "text": "Early in my career, while working for an ISP, I was on a project that had me in a 3-4 hour meeting every Monday morning. The chair didn't keep the meeting focused, there was too much meandering and joking around and it would go for 3-4 hours when it easily could've been an hour.\n\nOne day a co-worker asked me to speak on his behalf as he had a conflict. When he returned, 3 1/2 hours later, he couldn't believe I was still in the meeting.\n\n'How's that going?'\n\n'Great, if you don't mind 3 1/2 hours of pure torture.'\n\n'Who's speaking?' Someone mentioned my name. My mic was open. Ouch. Luckily, my boss and my boss' boss were both out that week and the chair was a nice guy and didn't tell. But that could easily have gone very badly. Funny, but never trust the mute button.",
            "title_similarity": "0.52632856",
            "sentiment_compound": 0.6168
        },
        {
            "id": "h2w1gt0",
            "score": 6,
            "text": "This also applies to screen share, and your instant messaging conversations. Nothing hits hard as someone shading your team in Microsoft Lync while they share the wrong screen 🥲",
            "title_similarity": "0.62859803",
            "sentiment_compound": 0.1521
        },
        {
            "id": "h2w1xw5",
            "score": 1,
            "text": "I dial down my Fifine mic to the lowest when I'm not using it.",
            "title_similarity": "0.4516376",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2w21cg",
            "score": 1,
            "text": "Looking for webcam WITHOUT built-in mic. Any recommendation?",
            "title_similarity": "0.45972404",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w2rp9",
            "score": 1,
            "text": "Yeah, the rule is never say anything in a zoom meeting that I wouldn't say unmuted. Just to be safe.",
            "title_similarity": "0.51227534",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2w2v4r",
            "score": 2,
            "text": "Always assume your software is gonna crash and hit Ctrl + S every time you make a change.",
            "title_similarity": "0.6049805",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2w2za9",
            "score": 1,
            "text": "I don't trust the mute button, but my headset has a detachable microphone, and the laptop has  microphoneless earphones plugged, so it got a few levels of security there.",
            "title_similarity": "0.51732934",
            "sentiment_compound": 0.3069
        },
        {
            "id": "h2w35t7",
            "score": 3,
            "text": "This is why I’m paranoid to be naked around my phone or webcam",
            "title_similarity": "0.4672041",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2w39uq",
            "score": 2,
            "text": "Learned this lesson a while back. Was on a conference call at an old job, muted while opening my store. I put the call on speakerphone so my associate could hear and told them \"listen to this boring shit we have to sit through.\" The swap to speaker unmuted my line. \n\nFortunately they weren't able to identify the voice, though I spent the rest of the day expecting a call chewing me out that never came.",
            "title_similarity": "0.61579174",
            "sentiment_compound": -0.7371
        },
        {
            "id": "h2w3jhc",
            "score": 1,
            "text": "and ur boss can always see ur camera (unless u have a slidey webcam cover)",
            "title_similarity": "0.6711614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w3p5m",
            "score": 24,
            "text": "Running a Zoom event right now. We set it up so that everyone enters the room muted (so no one logs in shouting). Right at the start, during the instructions to \"unmute to ask questions\" and an attendee accidentally unmuted and quietly said, \"am I muted, can they hear us? Omg, can they hear?\" And I hurriedly muted them again...\n\nUgh...",
            "title_similarity": "0.6561608",
            "sentiment_compound": -0.7757
        },
        {
            "id": "h2w3qgg",
            "score": 2,
            "text": "The mic is ALWAYS on!! I spend 75-90 percent of my day on meetings and I still check my mic at least a half dozen times during an hour meeting.",
            "title_similarity": "0.42702687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w3wnf",
            "score": 1,
            "text": "only trust physically removing it.",
            "title_similarity": "0.36239898",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2w3y2p",
            "score": 2,
            "text": "I will say that the mute button isn't always successful. I was in a meeting a couple of years ago and I hit mute in the software on my phone as I was about to order at a fast food restaurant and needless to say they heard me order a number 3 large combo with a coke. So yeah keep in mind that mute doesn't always mean they can't hear you.",
            "title_similarity": "0.5463861",
            "sentiment_compound": 0.0243
        },
        {
            "id": "h2w3yf1",
            "score": 1,
            "text": "I’m amazed that people don’t check “always mute mic when joining call” or that it’s not on by default when you install zoom.",
            "title_similarity": "0.5718684",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2w4316",
            "score": 1,
            "text": "Can confirm.\n\nWas accidentally handed a loaded firearm by an experienced 11B after he had returned from outside the wire. Somehow he had made it past the clearing barrel *and* his NCO’s AAR *and* failed to check the chamber *and* ended up giving it to me for PMCS.\n\nWas displeased. Yelled at him.\n\nYep, every Zoom mic is on.",
            "title_similarity": "0.7087306",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h2w4c9f",
            "score": 2,
            "text": "LPT: Don't say insulting things about people, whether in public or private.\n\nETA: OP's tip is a really good LPT though.",
            "title_similarity": "0.35203314",
            "sentiment_compound": 0.7023
        },
        {
            "id": "h2w4xyt",
            "score": 2,
            "text": "Also your screen is always being shared.",
            "title_similarity": "0.39891422",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2w4zhs",
            "score": 1,
            "text": "Not just work zoom! If there is a microphone around you should always behave as if it is live!",
            "title_similarity": "0.4673854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w58oh",
            "score": 23,
            "text": "And keep all snark re: participants, content, etc out of the chat. Text your coworkers your hot takes from your personal cell like a true professional.",
            "title_similarity": "0.6481649",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2w5a9p",
            "score": 13,
            "text": "In zoom mute yourself.  Confirm you are muted.  Now do NOT touch the mute button again. \n\nInstead , if you want to talk to the meeting , hold the space bar down and speak.  You’ll be unmuted until you let go, it’s like a walkie talkie",
            "title_similarity": "0.6180211",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2w5iar",
            "score": 1,
            "text": "Instructions unclear. Shot microphone during Zoom call.",
            "title_similarity": "0.50464916",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2w5l35",
            "score": 1,
            "text": "I never actually used Zoom but I assume like almost every other voice communication platform, there must be a push to talk button. \n\nI'm not sure why so many people are against the push to talk button. I understand it's an extra button to push, but for important calls like work meetings it's a life saver. Any random background noise you have doesn't go through. Nothing embarrassing goes through. You have peace of mind knowing the mic is always muted unless YOU say so. \n\nI've become so used to push to talk at this point that I actually tried going back to always on or voice activation, but I would still press my push to talk button out of force of habit and muscle memory. It takes a bit but eventually you honestly don't even realize your pressing the button, you just do.",
            "title_similarity": "0.68029577",
            "sentiment_compound": 0.957
        },
        {
            "id": "h2w5xs7",
            "score": 1,
            "text": "I behave like this whenever I'm on a work call. Even if I have to have side conversation, I make sure I'm not saying anything inappropriate.",
            "title_similarity": "0.41508853",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2w5xu5",
            "score": 1,
            "text": "Good, I want Dan to know I fucking hate him and think he’s a sociopathic asshole that even ur_mom wouldn’t touch. Accidentally would just be a bonus.",
            "title_similarity": "0.49491233",
            "sentiment_compound": 0.079
        },
        {
            "id": "h2w6go5",
            "score": 2,
            "text": "I had my mic muted a month or so ago.  The mute was on on my laptop.  My boss said she could hear me typing away.  I'm glad that was all I was doing.  I don't trust that mute button any more.  It's double muted or nothing.",
            "title_similarity": "0.5762895",
            "sentiment_compound": 0.0767
        },
        {
            "id": "h2w6kq4",
            "score": 1,
            "text": "I always mute my own headset mic too other then the zoom one",
            "title_similarity": "0.61120474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w6m49",
            "score": 1,
            "text": "This is the biggest reason I don't fart when I am doing a workout class over zoom",
            "title_similarity": "0.59852314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w6ywz",
            "score": 2,
            "text": "I've gotten into the habit of doing a mic check like \"hey can you guys here me okay\" before I take a piss or grind coffee beans or whatever. That way if my mic is actually open I can just play it off as audio issues...",
            "title_similarity": "0.58691263",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h2w79uc",
            "score": 1,
            "text": "Also, the camera is always on.",
            "title_similarity": "0.34862643",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w7e5j",
            "score": 1,
            "text": "I’m curious how many teachers joined their students in the bathroom.  I’m thinking it’s approaching 100%",
            "title_similarity": "0.34713167",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2w7sqb",
            "score": 1,
            "text": "I just head a toilet flush in the Zoom I was on",
            "title_similarity": "0.43439183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w8264",
            "score": 2,
            "text": "I accidentally muttered \"ugh moron\" after I made a dumb move in chess and my team lead laughed and said \"I agree but we can't tell them that to their face unfortunately\"",
            "title_similarity": "0.4283259",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h2w8czo",
            "score": 1,
            "text": "Those two are very much mutually exclusive: If you have a gun, you probably don't have a job where you use Zoom and vice verca.",
            "title_similarity": "0.49742275",
            "sentiment_compound": -0.1621
        },
        {
            "id": "h2w8irj",
            "score": 2,
            "text": "I feel this. I compulsively check zoom to make sure both my camera is off and my mic is muted whenever I have down time during meetings. Like I'll be watching a video on my phone and suddenly panic that my mic is hot.",
            "title_similarity": "0.64979464",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2w8os0",
            "score": 1,
            "text": "If you don't want to deal with it going wrong make *absolutely* sure it's going right.",
            "title_similarity": "0.25134426",
            "sentiment_compound": -0.185
        },
        {
            "id": "h2w8p5o",
            "score": 1,
            "text": "Call. In. With. Your. Phone.",
            "title_similarity": "0.36266047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w8pl9",
            "score": 2,
            "text": "Same can be said about the camera.\n\nDon't poop while on a zoom call. Trust me on this one.",
            "title_similarity": "0.39486575",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2w96c9",
            "score": 2,
            "text": "One other LPT here, people on the call know you’re taking the call in the bathroom.  We can hear the sound difference.",
            "title_similarity": "0.38383228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w9agf",
            "score": 1,
            "text": "Get an external mic preamp or mixer and you can be the master of your own fate. Analog hardware in this instance is very reliable.",
            "title_similarity": "0.42092508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w9byr",
            "score": 1,
            "text": "And everyone's genitals are merely millimeters away from the open air",
            "title_similarity": "0.37732407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w9erz",
            "score": 1,
            "text": "If this is true my coworkers have heard the raunchiest of farts.",
            "title_similarity": "0.48383492",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2w9f3j",
            "score": 2,
            "text": "My brother called me one day during work laughing hysterically. He told me they were on a company wide call with the CEO going over stats. CEO says they hit 90% of some target, and one of his coworkers leans into a mic that he thought was muted and said “how would you like 90% of my foot up your ass?”.  The mic was indeed not muted and the CEO was completely caught off guard. Supposedly the guy suffered no repercussions, but I guarantee he doesn’t do this anymore.",
            "title_similarity": "0.55992115",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h2w9gn7",
            "score": 1,
            "text": "Not just zoom. \n\nTalking shit about someone? Make sure you didn't butt dial them.  Going to flush the toilet during a work meeting? Make sure you're muted and put the phone outside of the room (or flush later).",
            "title_similarity": "0.48534378",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w9h16",
            "score": 1,
            "text": "there is an entire porn category about this",
            "title_similarity": "0.36204308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w9mlq",
            "score": 1,
            "text": "This is why I won't use the computer audio. I phone in ( also no lag issues) and keep my phone on mute untill I need to speak",
            "title_similarity": "0.541331",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h2w9u3n",
            "score": 2,
            "text": "Worked in theater for about a decade. Rule number one that no one *ever* remembers is that the mic is always, *always* hot. \n\nAt least once per production, a castmember would forget their mic was on and say something at auditorium volume. Usually something personal. People rarely ever say anything good when they think they can't be heard.",
            "title_similarity": "0.57849514",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2w9ufu",
            "score": 1,
            "text": "This is so accurate.",
            "title_similarity": "0.04263421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2w9vpy",
            "score": 1,
            "text": "God I hope not. Every day when I’m in Zoom court the coffee kicks in and I have to take that morning coffee crap.",
            "title_similarity": "0.58172864",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2wa14l",
            "score": 1,
            "text": "But guns aren't always loaded. They don't come with bullets",
            "title_similarity": "0.3450421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wak6t",
            "score": 1,
            "text": "I call in to meetings on my phone and mute that as well as in the chat. The host has the ability to unmute members in the meeting, but they can’t unmute my phone.",
            "title_similarity": "0.5534644",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2wangd",
            "score": 1,
            "text": "And a camera is always on!",
            "title_similarity": "0.34165382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2waqni",
            "score": 1,
            "text": "Instead of doing anything audible, I like to write my curse words in the fanciest script I can. I've thought about getting calligraphy pens for this very purpose.\n\nThe F in \"fuckwit client\" this morning had a particular flourish",
            "title_similarity": "0.5592975",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2waz3u",
            "score": 2,
            "text": "Yeah I just got off a kick off call where our agency just yelled \"fuck\" as he tripped over a cord. Great first impression 😅",
            "title_similarity": "0.53264874",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h2wbfj2",
            "score": 2,
            "text": "I'm glad my mic needs a phantom power supply to work properly. It's got a bright blue light telling me it's on, so I have complete control.",
            "title_similarity": "0.46245512",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2wbjlu",
            "score": 1,
            "text": "and your screen is fucking shared",
            "title_similarity": "0.23584424",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h2wbt2s",
            "score": 1,
            "text": "My hardware mute would beg to differ. 48v mic FTW",
            "title_similarity": "0.51961184",
            "sentiment_compound": 0.5766
        },
        {
            "id": "h2wbt7d",
            "score": 1,
            "text": "Found out  the hard way very recently that a camera during a national conference over zoom is also always on...",
            "title_similarity": "0.6314774",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2wc1fz",
            "score": 2,
            "text": "I also go by the rule that anything you type can be viewed by anyone. If there's even a fraction of a percent chance that what you're typing could come back to haunt you, consider it before putting it out there.\n\nAbout a decade ago at work where a board runs things this happened. The board election had just taken place, an employee was chatting with me over company email and asked what I thought about the new president of the board. That rule popped in my head so I just replied completely PC and said \"seemed like he wants to do good things and keep the place running\"\n\nAbout a month or so later that employee is in a dispute with another employee who was in good with the new president, they apparently left their computer unlocked and the other employee got into their email and chats and pulled up some chats where the employee was saying negative things about her. Printed everything out and gave it to the president who fired the employee.\n\nI forget exactly how I got pulled into the mix, but in a meeting with the president he pulls out a paper and there's a print out of my conversation with the recently fired employee, specifically the part where she asked my opinion of the new president.\n\nHe saw my statement and was like \"well you didn't say anything negative, so that's good\". I survived the culling. No doubt if I had said anything else I'd have been unemployed that day.",
            "title_similarity": "0.5671194",
            "sentiment_compound": 0.9291
        },
        {
            "id": "h2wc1ze",
            "score": 1,
            "text": "I mute and also say \"hey fuckfaces, you there?\"  I've never heard a yep so I think my method works well.",
            "title_similarity": "0.51238555",
            "sentiment_compound": 0.0547
        },
        {
            "id": "h2wc2xr",
            "score": 1,
            "text": "Same goes for the camera @jeffrey_toobin",
            "title_similarity": "0.34465164",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wc5rm",
            "score": 1,
            "text": "I usually disable the mic itself in the windows settings so Teams grey's out the option to mute. But always check at the beginning of the meeting with \"Can anyone hear me?\" during that brief period of casual talk.\n\nEnabling the device again takes two seconds if you keep the sound window up.\n\nGranted if I know I'm going to be engaging a lot in a meeting I just mute the traditional way. But a chunk of meetings don't require me to talk the whole time.",
            "title_similarity": "0.58312756",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h2wc7aq",
            "score": 2,
            "text": "Just put the plastic flappy thing in front of my disabled webcam before seeing this post. *Juuuust* in case the meeting attendees can see me scrolling through reddit when I should be taking meeting notes...",
            "title_similarity": "0.5748105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wc8h2",
            "score": 1,
            "text": "Don't get Toobin'd.",
            "title_similarity": "0.16716734",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wcbha",
            "score": 1,
            "text": "If you're doing a mass meeting and can only hear the speaker can they still hear you?",
            "title_similarity": "0.39511958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wcbz8",
            "score": 2,
            "text": "I teach adults online (software stuff). A few years ago I had a class (that was being recorded) where a student forgot to mute herself and had a brutal screaming argument with her partner accusing them of cheating with a co-worker. The platform we were using wouldn't allow me to mute her and she didn't respond to me verbally telling her we could hear her, nor to me and multiple students letting her know in the chat.\n\nSo we got to listen to this drama unfold for about 10 minutes until their fight moved to another room. Super awkward for everyone, so now I start all my remote classes with a reminder to mute!",
            "title_similarity": "0.55815256",
            "sentiment_compound": -0.9295
        },
        {
            "id": "h2wccqt",
            "score": 1,
            "text": "Yup, as someone who works over Zoom I love that my mic has its own mute that glows bright red when muted and is plainly visible at all times.",
            "title_similarity": "0.58395165",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h2wcdma",
            "score": 2,
            "text": "I learned that my iPhone unmutes itself when coming back to a held call.  Unfortunately I learned this after I had let out a 'what the actual fuck' in the middle of a meeting with an important customer because my cat had decided to randomly use me as a scratching post.",
            "title_similarity": "0.5885531",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2wcjo1",
            "score": 1,
            "text": "Lpt: change mic setting to mute by default and also camera off by default when joining zoom meetings. You can use your space bar to unmute temporarily by holding it down when you want to talk and release to go back to mute",
            "title_similarity": "0.5535757",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2wcjs1",
            "score": 2,
            "text": "Indeed, husband walked in the room whilst I was looking at some SQL and assumed I wasn't in a call (I was being shown how to do the SQL statement) and proceeded to tell me about how the cat had \"shit in the bathtub\". Thankfully my colleague just began laughing but it was slightly embarrassing.",
            "title_similarity": "0.44203028",
            "sentiment_compound": -0.3095
        },
        {
            "id": "h2wcnn9",
            "score": 1,
            "text": "i wear my eyeballs out compulsively checking that the mute is on and when i’m able, the camera is off",
            "title_similarity": "0.51028526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wcqo1",
            "score": 1,
            "text": "Just uninstall and reinstall your microphone drivers.  Every time you mute.  Problem solved.",
            "title_similarity": "0.65077317",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2wcrur",
            "score": 1,
            "text": "I’m bold my fiancé and I got down and dirty when I was in the middle of my math class on zoom ( mic and camera were turned off, camera also has a cover on it)  I did keep getting scared though but my professor kept talking and never said anything.",
            "title_similarity": "0.5930933",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2wcz61",
            "score": 2,
            "text": "Before zoom and most teleconferencing meetings were popular (2012 to be precise) I was on a LONG conference call with other branch system admins trying to work through an upgrade we were all struggling with. We had also recently upgraded to voip phones and for whatever reason mine was freaking out and shutting off (loosing all power to itself no lights no display etc) or so i thought. I had just had an interview wit what would be my next job and I was constantly having to unplug my phone reboot it and dial back in to rejoin the call. \n\nThe most recent time this had happened on this now three hour call my wife called me to ask how the interview/detailed discussion of start date, etc went. Since my phone had just crashed I didn't think anything that I was still broadcasting to the conference line of my peers, but I was. It wasn't until i got a ping from my friend who worked at the branch just 20 minutes from me (most others were a state over) 15 minutes latter that I had a hot mic... Thankfully I accepted the job and started 2 weeks later and didn't have to suffer that embarrassment for too long at that company.",
            "title_similarity": "0.6253058",
            "sentiment_compound": 0.8597
        },
        {
            "id": "h2wczum",
            "score": 1,
            "text": "I was on a call once with about 20 people. The host was giving a presentation, and then suddenly we heard an iPhone notification go off from one of the attendees, and the attendee shouts in an apparent rage \"GOD DAMMIT! GOD FUCKING DAMMIT!\" There was a long silence, and then the host just reminded everyone to mute themselves and keep going. I never did find out what made the guy so angry, but he still works here so he didn't get fired over it.",
            "title_similarity": "0.614488",
            "sentiment_compound": 0.6227
        },
        {
            "id": "h2wd38y",
            "score": 1,
            "text": "I really hate that Zoom doesn't have a way to join audio muted. I always have to mute it as I join. It technically has push to talk but you still have to mute it manually.",
            "title_similarity": "0.6427204",
            "sentiment_compound": -0.0763
        },
        {
            "id": "h2wd4ru",
            "score": 1,
            "text": "Schrodingers web cam",
            "title_similarity": "0.33915228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wd5vo",
            "score": 1,
            "text": "Linked thread: Teams\n\nOP: Zoom",
            "title_similarity": "0.34500563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wdpo0",
            "score": 2,
            "text": "A camera is always pointed at your cat grooming itself",
            "title_similarity": "0.47101963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wdrak",
            "score": 2,
            "text": "I had a meeting where at the last 5 minutes I sneezed and someone said \"Bless you\". That's when I realized I wasn't muted and I had to try real hard to think back on if I'd talked or made any noises I shouldn't have.\n\nI also heard from a friend where their entire office was on a conference call with other offices and the mic was clearly muted so they were talking shit about people only to find out they could still hear them somehow.",
            "title_similarity": "0.46850157",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2wdtuf",
            "score": 1,
            "text": "if someone says hot mic, check yourself first, then look for others",
            "title_similarity": "0.38264853",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wdx97",
            "score": 1,
            "text": "use webex, its perfect!  :^)",
            "title_similarity": "0.35965216",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h2we19v",
            "score": 1,
            "text": "Yes and always assume a web camera is live streaming to all your contacts unless it's unplugged",
            "title_similarity": "0.6725706",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2weauv",
            "score": 2,
            "text": "On a related note: when you call someplace and are put on hold with music playing, we can still hear you.",
            "title_similarity": "0.43602204",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2wed8r",
            "score": 1,
            "text": "Ok, but I'm pretty sure the camera is off. Source: Jeffrey Toobin",
            "title_similarity": "0.33722705",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h2wefch",
            "score": 2,
            "text": "Treat every mic as if it were unmuted\n\nNever say anything you do not intend to be heard\n\nKeep your mouth shut until you are ready to speak.\n\nKnow your audience and those in earshot",
            "title_similarity": "0.54116195",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2weg9i",
            "score": 1,
            "text": "I use an external mic that has a mute button and I always double mute. Not taking any chances.",
            "title_similarity": "0.71477705",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h2wehr8",
            "score": 1,
            "text": "Could’ve used this advice during my teams meeting today. Thought I was muted and said “I don’t want to FUCKING be here.” Not a good way to start a meeting.",
            "title_similarity": "0.44762546",
            "sentiment_compound": -0.2746
        },
        {
            "id": "h2weq75",
            "score": 2,
            "text": "I’ve had to take a dump on a call many times so I put the phone where it’s going to remain during the dump, yell hey can you hear me? Can you hear me? Hellloooo? About five times. And if no replies I take my dump in hopes that mute button is still working. I also never go on camera.",
            "title_similarity": "0.6468662",
            "sentiment_compound": -0.7744
        },
        {
            "id": "h2weqw6",
            "score": 1,
            "text": "as a gun guy and a lawyer, honestly.",
            "title_similarity": "0.37764025",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2wetzj",
            "score": 1,
            "text": "The mic is always hot",
            "title_similarity": "0.31504598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wev94",
            "score": 1,
            "text": "Treat all mics like hot mics. Or you can be like my little sister's high school teacher who didn't realize his headset was unmuted when he excused himself to drop a deuce.",
            "title_similarity": "0.55486757",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2wevyf",
            "score": 1,
            "text": "This thread made remember that most of the population somehow doesn't know about/use push to talk lol.",
            "title_similarity": "0.3515754",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2wey8x",
            "score": 1,
            "text": "Kyle Larson is that you?",
            "title_similarity": "0.16627601",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wey9j",
            "score": 1,
            "text": "I bought a mixing board and moved to an XLR mic and headset so that I could mute from the board rather than trusting zoom. Way too many horror stories. \n\nI’m super paranoid so I have the headset on as a monitor and I can hear my own voice if it’s unmuted. \n\nMy shit talking process is now:\n\n1.\tMute zoom\n2.\tMute on the board\n3.\tCough to confirm I’m muted through my headset\n4.\tMutter “This fucking guy...”\n\nI’ve gotten pretty fast now, so I can get about 20-30 “This fucking guy”s out per meeting now.",
            "title_similarity": "0.64277005",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2wf0x1",
            "score": 2,
            "text": "And always message coworkers like everyone can see what you are saying. I learned this the hard way.",
            "title_similarity": "0.56062067",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2wf4af",
            "score": 2,
            "text": "So, what you're saying is, everyone heard that long, loud, wet, fart and all of them were just being polite?",
            "title_similarity": "0.50906515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wfbrx",
            "score": 1,
            "text": "I get so paranoid. Especially if I need to use the bathroom. \n\nI'm usually triple muted; zoom, phone, headset. And I'm still paranoid they'll hear me using it.",
            "title_similarity": "0.5680717",
            "sentiment_compound": -0.5598
        },
        {
            "id": "h2wffea",
            "score": 2,
            "text": "My old old Android phone mute button indicated it was working when it was in fact, not doing anything.  I yelled up to my wife, \"I'll be up for lunch as soon as I'm done talking to these dummies\" thankfully I didn't call them \"fucking idiots\" as they truly deserved.",
            "title_similarity": "0.65511835",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2wfja2",
            "score": 1,
            "text": "Back in the olden days, after a conference call was finished, my boss would unplug the phone from the wall to ensure the mic was off.",
            "title_similarity": "0.54543614",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2wfkf6",
            "score": 1,
            "text": "... no.  as one can kill, and the other is just a mild embarrassment.",
            "title_similarity": "0.31323436",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h2wfn7g",
            "score": 1,
            "text": "I have a wireless headset, sometimes I go to the bathroom after muting zoom + the headset.  I live life dangerously",
            "title_similarity": "0.54986715",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2wforb",
            "score": 1,
            "text": "Enable the push-to-talk feature so you have to press spacebar to talk and you're muted the rest of the time.\n [Push-to-talk - Zoom Help Center](https://support.zoom.us/hc/en-us/articles/360000510003-Push-to-talk?mobile_site=true)",
            "title_similarity": "0.6625042",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2wfpa1",
            "score": 2,
            "text": "There are two types of microphones.  Those you THINK are on, and those you KNOW are on.",
            "title_similarity": "0.21854359",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wfu0o",
            "score": 2,
            "text": "As an aside to this, the person you are chatting with is always sharing their screen at the exact moment you shit talk the organizers",
            "title_similarity": "0.5786992",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2wfwd3",
            "score": 1,
            "text": "Zoom is so shitty.",
            "title_similarity": "0.27199906",
            "sentiment_compound": -0.6825
        },
        {
            "id": "h2wfx36",
            "score": 1,
            "text": "I unplug my mic after conference calls, and force close Zoom.\n\nI don't fuck around.",
            "title_similarity": "0.6590031",
            "sentiment_compound": 0.431
        },
        {
            "id": "h2wg2a7",
            "score": 1,
            "text": "Any mic that's plugged in or powered on:",
            "title_similarity": "0.35056752",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wg4ql",
            "score": 1,
            "text": "And a dropped knife has no handle.",
            "title_similarity": "0.27368057",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2wg5lu",
            "score": 1,
            "text": "Whenever I’d go to the bathroom I would ask “can anyone hear me?” just to be sure lol",
            "title_similarity": "0.39330068",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2wg9yu",
            "score": 1,
            "text": "Just like a man would be shot in the chest with a rifle, the turtle was shot in the chest with a rifle.",
            "title_similarity": "0.4111758",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2wgdto",
            "score": 2,
            "text": "and always assume the video is on too. \n\nComputers do some weird shit so unless yoy have the camera covered its good to just get in the habit of assuming it might be on.",
            "title_similarity": "0.5643944",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2wgo75",
            "score": 1,
            "text": "Inline mic switch to gaming headset.",
            "title_similarity": "0.36527714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wgwss",
            "score": 2,
            "text": "Assume the camera is always on as well. You don’t want to pull your Toobin.",
            "title_similarity": "0.4696678",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2wgy03",
            "score": 2,
            "text": "*glances to check that mute is on*\n\n*makes weird body sound*\n\n*repeat* \n\n\nThis is most of my day, every weekday.",
            "title_similarity": "0.56580704",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2wgyqd",
            "score": 1,
            "text": "I've got a mic with a power button on it so I can double turn it off. Even then, I proceed with caution",
            "title_similarity": "0.6351503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wh884",
            "score": 2,
            "text": "Was dialed into a big security meeting with some very security minded folks when my buddy walked by my desk and launched a paper football at me. Called him a fucker, and like 30 people heard it clear as day. I fessed up but I still cringe when I think about it. My buddy thought it was hilarious.",
            "title_similarity": "0.57212853",
            "sentiment_compound": 0.7389
        },
        {
            "id": "h2whaa2",
            "score": 2,
            "text": "Just don't trust anything controlled by software. The mic is always on; the camera is always on; chat is always public.",
            "title_similarity": "0.7093896",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h2whh70",
            "score": 1,
            "text": "The camera is always on too. They've seen that Canadian MP naked like twice now.",
            "title_similarity": "0.48967695",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2whnrl",
            "score": 1,
            "text": "Unplug the mic if you’re not going to talking for a while; put some electrical tape over the camera if it’s not required to be on.",
            "title_similarity": "0.46707138",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2whoi7",
            "score": 1,
            "text": "Gotta recommended headphones with mute button as well. Get that double mute, teams and mic.",
            "title_similarity": "0.47456884",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2whq9f",
            "score": 1,
            "text": "Act as if you think you are muted and say something nice about the person talking.",
            "title_similarity": "0.141622",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2whwzv",
            "score": 1,
            "text": "Not mine, since it runs through a voice mod program, unless that’s also on, my mic won’t work.",
            "title_similarity": "0.51122147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2whyen",
            "score": 2,
            "text": "You also never know who exactly is on the other end. Our last HR guy started complaining on a call about the plant manager, not realizing she was in the room with the other guy. When he found out she heard what he said he just started packing his desk up - not a great look for HR...",
            "title_similarity": "0.47332606",
            "sentiment_compound": -0.6242
        },
        {
            "id": "h2wi7iz",
            "score": 1,
            "text": "Get a mic with a hardware mute, preferably with a visual indicator. The few times you don't get words out cause you are double muted is way better than accidentally saying something dumb. At least I feel like I have to be extra dumb if I fuck up 2 mutes and say something I shouldn't.",
            "title_similarity": "0.52663064",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h2wimnx",
            "score": 1,
            "text": "Just ask Thom Brenneman.",
            "title_similarity": "0.24731708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wimor",
            "score": 1,
            "text": "Thankful for the blinking light on my yeti mic.",
            "title_similarity": "0.40323502",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2winur",
            "score": 2,
            "text": "Ive only wanted two things from Zoom since this whole thing started. \n1. Push to talk button, not just mute/unmute. \n2. A system wide notification that I’m live and on air, so I can hook up a USB light that automatically alerts my SO that I’m in a meeting.",
            "title_similarity": "0.66612786",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wirjx",
            "score": 1,
            "text": "Gotta love how modern mute button design is always ambiguous. Icon has a mic or line over a mic. Is that showing current state or state it transfers on click. Flat background color changes, but which color means which state.",
            "title_similarity": "0.69647944",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2wiuoc",
            "score": 2,
            "text": "If you get busted watching a video because they hear the audio just quickly pause/mute the video and say \"Hey, I'm in a meeting can\" and then mute yourself. This way they'll think someone else near you did it.",
            "title_similarity": "0.51393765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wizsb",
            "score": 2,
            "text": "So I’ve been using Zoom everyday for over a year, and recently I started using wireless earphone so I could take care of my son while listening to whatever I’m supposed to be listening. I’ve never had this issue but the thread is making me paranoid.",
            "title_similarity": "0.64775604",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2wj0t4",
            "score": 1,
            "text": "Always treat a firearm like it’s loaded, much like always treat a Zoom microphone like it’s unmuted",
            "title_similarity": "0.71495295",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h2wj6ry",
            "score": 1,
            "text": "Push to talk always.",
            "title_similarity": "0.47910905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wja0n",
            "score": 1,
            "text": "i never had a sushi burrito",
            "title_similarity": "0.35965198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wjc41",
            "score": 2,
            "text": "We had a company wide zoom celebration (small company of about 100 people) and zoom seemed to glitch and unmute a couple randomly every few minutes. Part of the celebration was a raffle for prizes, and after about the 10th prize, someone became unmuted and was just like \"Goddamn it I  never win a fucking thing\"",
            "title_similarity": "0.53612036",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h2wjcdf",
            "score": 1,
            "text": "Tbh, if I'm on a call/zoom meeting/etc, I make a point to never say something I wouldn't want the other person/people hearing. Even if I think the mic is muted or I'd be talking low enough they couldn't hear me because I've been on the receiving end a couple times* over the years and nothing good ever comes from those mistakes.\n\n*I'm a bit hard of hearing so people tend to misjudge how quietly they need to talk before I can't hear them, and it's never a good look.",
            "title_similarity": "0.5520544",
            "sentiment_compound": -0.8416
        },
        {
            "id": "h2wjlzf",
            "score": 2,
            "text": "Whenever im in public, especially in a work environment, i always assume \"the walls have ears\".",
            "title_similarity": "0.527156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wjql4",
            "score": 2,
            "text": "Always fun to unmute in time for some loud ass traffic that no one can figure out the source of",
            "title_similarity": "0.5716071",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2wjzw6",
            "score": 2,
            "text": "I’ve made the mistake twice but both times were super innocuous. Once I was asking my boyfriend “sweetie could you make me some tea, please?” And the other time I was praising my dog “good boy for being so calm!” \n\nI fear my luck is running out!",
            "title_similarity": "0.5389956",
            "sentiment_compound": 0.8831
        },
        {
            "id": "h2wk9fi",
            "score": 2,
            "text": "My company was using Cisco WebEx until recently, and we could still hear one of my coworkers while he was muted in the software. We could see his mute status, but some audio driver issue prevented him from actually being muted. It only happened when he first joined the meeting on mute, and if he unmuted, then muted himself, it would work as intended.\n\nDon't ever trust the mute unless you have a hardware switch",
            "title_similarity": "0.60567224",
            "sentiment_compound": -0.5272
        },
        {
            "id": "h2wkbuf",
            "score": 1,
            "text": "I really like the analogy",
            "title_similarity": "0.08935438",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h2wkjio",
            "score": 2,
            "text": "I was taking a physics midterm last semester, and it was proctored over Zoom by our TA. Halfway through, some dude unmuted to ask a basic question about the midterm, and never re-muted. Five minutes later, the same dude is heard asking his off-camera roommate to solve a problem for him. The roommate replies with the answer. Que the chorus of students saying \"dude, mute your mic if you're going to cheat, come on\".",
            "title_similarity": "0.54334986",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2wko6n",
            "score": 1,
            "text": "And your video is always on too! Don't Toobin yourself",
            "title_similarity": "0.5677915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wl07t",
            "score": 2,
            "text": "I JUST started live audio and running like 12 different Lav mics (little tiny clip mics with body packs) and 3 SM58s for a play in a theater. The group is all older people quite inexperienced. \n\nI had mute groups for who they told me would be in each scene. One lady doesn’t come on for the next scene but comes through the PA clear as day. \n\n“Someone tell those fucking kids to get out of the way”\n\nCrowd gasped. Show went on.\n\nHalf of them turned their body packs off between outfit changes. I copied an input channel to a new mic. Sent feedback flying through the crowd.\n\nIt was a nightmare. I’m still scarred.",
            "title_similarity": "0.5721765",
            "sentiment_compound": 0.705
        },
        {
            "id": "h2wl1tt",
            "score": 1,
            "text": "I use a headset at work that has a function that every time you put the mic back, it mutes you. Perfect solution, two different positions for muting.",
            "title_similarity": "0.6015762",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h2wl4tu",
            "score": 1,
            "text": "And the camera is always on",
            "title_similarity": "0.3217354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wl5hs",
            "score": 1,
            "text": "And a falling knife has no handle",
            "title_similarity": "0.27016628",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2wl757",
            "score": 2,
            "text": "As an audio engineer, I can say this should be true of ANY microphone. If it's plugged in, there's a decent chance there's someone on the other side who can listen in if they wanted to.",
            "title_similarity": "0.4046747",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2wlfjb",
            "score": 1,
            "text": "Words are like bullets",
            "title_similarity": "0.3392705",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2wljtt",
            "score": 2,
            "text": "I always double mute myself on work meetings (mute on chat client and on physical mic) AND I will still always try at least one \"can you guys hear me? hello?\"\n\nand then I hit the bong.",
            "title_similarity": "0.7304994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wlrab",
            "score": 1,
            "text": "And the camera is always on. A friend told me of this classmate who took a titty pic during class. Everyone saw her do it.",
            "title_similarity": "0.4667247",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2wluxt",
            "score": 2,
            "text": "My teacher once asked a question and my classmate (and friend) was picked, but we were on discord at the same time, he answered so wrong I just burst out laughing, realized I wasn't muted and died inside",
            "title_similarity": "0.4789864",
            "sentiment_compound": 0.0642
        },
        {
            "id": "h2wlw7y",
            "score": 1,
            "text": "Let's not forget, the camera is always on also!",
            "title_similarity": "0.41444317",
            "sentiment_compound": 0.2401
        },
        {
            "id": "h2wm7oy",
            "score": 1,
            "text": "I accidentally unmuted myself yesterday when telling my dog he was the best dog in the world. At least it wasn’t anything bad.",
            "title_similarity": "0.43557745",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2wmicc",
            "score": 1,
            "text": "Working in a grocery store this whole time has really made me miss out on all the Zoom memes.",
            "title_similarity": "0.55802566",
            "sentiment_compound": -0.2177
        },
        {
            "id": "h2wmn2z",
            "score": 1,
            "text": "Always blow on the mic.\n\nNo,Susan, mic as in microphone.",
            "title_similarity": "0.66932905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wmshg",
            "score": 2,
            "text": "Accidentally let out a huge fart on zoom last night without muting my microphone. Other guy had his cam off and mic muted so couldn't tell if he heard me. He probably did.",
            "title_similarity": "0.56532264",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2wn38v",
            "score": 2,
            "text": "I've been using zoom for weekly conferences since the lockdown started. One of the regulars is a real chatterbox who can talk for an hour and say nothing. Anyways one minute before the conference starts the host mutes everyone. The chatterbox starts talking, the host mutes everyone and the guy is still talking even though no one can hear him. He doesn't stop talking till the chairman is unmuted, it was so funny.",
            "title_similarity": "0.5994923",
            "sentiment_compound": 0.5314
        },
        {
            "id": "h2wn9uo",
            "score": 1,
            "text": "A falling knife has no handle.",
            "title_similarity": "0.27657312",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2wnewy",
            "score": 1,
            "text": "You always want a hardware mute.\n\nNever trust software.",
            "title_similarity": "0.6224401",
            "sentiment_compound": -0.3404
        },
        {
            "id": "h2wnhyx",
            "score": 2,
            "text": "Exactly: And no phone call is officially over until YOU hang up.  3 people at a place I worked at got fired for comments they made after a conference call meeting was over that they forgot to disconnect from.  And its funny how the guy from The New Yorker would still have his job if he had invested in a $1 stick-on slide cover for his laptop camera.",
            "title_similarity": "0.5710163",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2wnj4q",
            "score": 2,
            "text": "Yeahhh  my boss was going on one of his long mansplaining tirades and I moaned loudly from the depths of my gut. He stops talking and says wow smalleyed what’s up? \n\nYah I wasn’t on mute.",
            "title_similarity": "0.52868783",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2wnqvv",
            "score": 2,
            "text": "Teaching an online lesson, the mic was muted but the trainee teacher who was teaching my class has accidentally enabled subtitles in PowerPoint, so even though the kids couldn't hear us, everything we were saying was being added as subtitles at the bottom of the screen while they were working. Took us ages to work out where they were coming from (we thought it was teams subtitles). Turns out pressing J on the keyboard enables this",
            "title_similarity": "0.57571363",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2wny3c",
            "score": 16,
            "text": "I'm saying! My wife has been taking online classes and gets super frustrated with the teacher. She vents her frustration by hitting mute and screaming at the screen. Her therapist also told her this is a perfectly healthy way to vent. \n\nI don't trust it. The cost of slipping up is way too high.",
            "title_similarity": "0.5727884",
            "sentiment_compound": -0.0757
        },
        {
            "id": "h2wobcb",
            "score": 1,
            "text": "I unplug my audio interface every time when I am finished.",
            "title_similarity": "0.57529014",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wofcf",
            "score": 1,
            "text": "Or you could always just say \"hey are you there\" to test it. That's what I do. But still dont trust it.",
            "title_similarity": "0.48129618",
            "sentiment_compound": -0.5504
        },
        {
            "id": "h2wofk0",
            "score": 1,
            "text": "Double mute!  Only buy headsets with a physical mute button.\n\nThen use it and the mute icon on your meeting app!",
            "title_similarity": "0.6301738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wofmr",
            "score": 1,
            "text": "First rule of working in media. *Every*  mic is a Hot mic.",
            "title_similarity": "0.42680803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2woqwd",
            "score": 1,
            "text": "I usually test it before doing anything loud, but randomly inserting myself into the conversation, When no one responds, I know it’s actually muted",
            "title_similarity": "0.5561769",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2woy4v",
            "score": 1,
            "text": "One time I accidentally burped into my mic while I was unmuted during a conference call for work. No one said anything but I known they heard it",
            "title_similarity": "0.6113967",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2wp2bf",
            "score": 2,
            "text": "Mic is always on and webcam is always recording. Close that work laptop before doing _anything_ personal in front of it",
            "title_similarity": "0.67162293",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wp6s3",
            "score": 2,
            "text": "Sometimes, during work calls, I move my lips but say absolutely nothing while my microphone is not muted just becouse I like some chaos.",
            "title_similarity": "0.56662726",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2wp6t7",
            "score": 1,
            "text": "And the camera is always on & at the perfect height to see your junk.",
            "title_similarity": "0.5009258",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2wpfqq",
            "score": 2,
            "text": "I was on a child welfare training and my newborn took the wettest, loudest, fartiest shit I've ever heard directly into my united microphone, because she was laying on my chest while I had my laptop on my lap. Her butt was like right up against it. Whoops",
            "title_similarity": "0.58561146",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2wpnc3",
            "score": 1,
            "text": "Or the camera is always on and uncovered to someone",
            "title_similarity": "0.5067548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wq6ph",
            "score": 2,
            "text": "I don't always forget to press the mute button, but when I do, I cackle like a hyena at a Reddit post while someone is describing accidental damage to a critical part of the project.",
            "title_similarity": "0.6544219",
            "sentiment_compound": -0.627
        },
        {
            "id": "h2wq7xh",
            "score": 1,
            "text": "I mute from the software and from the physical button on my mic and I'm still paranoid I'm not muted.",
            "title_similarity": "0.5950836",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2wq8oh",
            "score": 1,
            "text": "My girlfriend has a habit of walking into my office (at home) and declaring something about her body like, “damn, my boobs itch” or “I thought my period would be done by now,” forgetting to check whether I’m in a meeting.\n\nWhile so far she hasn’t said anything even mildly inappropriate while Im on calls, this habit of hers has kept me on constant mute whenever I’m not talking with one hand trained on my power button as a precaution.\n\nI’ve been a part of too many meetings where someone thought they were muted or something embarrassing was said by a spouse or S/O and I refuse to fall victim.",
            "title_similarity": "0.6103128",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2wqc39",
            "score": 1,
            "text": "Even when I can clearly see that I’m muted, I’m always stressed regardless thinking that somehow it will unmute itself.",
            "title_similarity": "0.6018217",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2wqhgo",
            "score": 1,
            "text": "Worst fear is having the microphone or camera on without knowing",
            "title_similarity": "0.49830288",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h2wqj6h",
            "score": 1,
            "text": "And the camera is always pointed down…. WEAR PANTS!",
            "title_similarity": "0.42699265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wqpqy",
            "score": 1,
            "text": "Good thing the worst I ever do is talk to my cat like she's a human child.",
            "title_similarity": "0.47459316",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2wqqju",
            "score": 1,
            "text": "Push to talk is the only way a voice system should ever be set up.",
            "title_similarity": "0.4793501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wqswa",
            "score": 2,
            "text": "The camera is always on. The mic is always unmuted. Everyone is paying attention to your video feed.\n\nEvery time. Always.",
            "title_similarity": "0.58894616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wqxq5",
            "score": 1,
            "text": "Could be worse.\n\nI had a co-worker decide that to relieve himself, he could use his kid potty. He did remember to mute, but completely forgot his camera was still on. We could clearly see why his wife is happy with him.\n\nFortunately, this was before the customer joined the meeting and he heard us shouting through his headset.",
            "title_similarity": "0.55956924",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h2wr0fp",
            "score": 1,
            "text": "I like unmuting my despised colleagues",
            "title_similarity": "0.43754765",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2wr25k",
            "score": 1,
            "text": "I admit, I have yelled insults at someone while on mute, belched heartily, spoken to my dog. I trust it.",
            "title_similarity": "0.51429415",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2wr3tu",
            "score": 3,
            "text": "omg im so paranoid of this. i muted myself in the meeting, turned off my laptops microphone, connected a headset that had a physical mute button and was able to detach the mic from tge headset. even after that i still wasnt 100% confident i was muted",
            "title_similarity": "0.64925224",
            "sentiment_compound": -0.6421
        },
        {
            "id": "h2wraiy",
            "score": 1,
            "text": "Yea I always double mute if possible. Better to appear like a bumbling idiot who can't unmute than the idiot who gets caught being candid",
            "title_similarity": "0.58385956",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2wreza",
            "score": 1,
            "text": "Last year you should have assumed the video cam is always on. I saw a guys junk.",
            "title_similarity": "0.54792386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wrhaj",
            "score": 1,
            "text": "I had a boss that suffered from a hot mic one time and ever since then he hung up, picked up, and hung up again three times after each conference call.",
            "title_similarity": "0.5111149",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h2wrvq8",
            "score": 1,
            "text": "Also true of the camera.  I now keep electrical tape over my camera.",
            "title_similarity": "0.37750462",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2wrwyf",
            "score": 3,
            "text": "Thanks, all, I've had some good chuckles reading these comments. 😂",
            "title_similarity": "0.25449458",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h2ws8tg",
            "score": 2,
            "text": "I was on a call with my team. \nWhile i was muted, my black lab came over and put his head in my lap. I started to scratch his ears and said \"Who's a good boy, love you\". My team member, Steve, stopped taking and said \"BoristheSaurus, i love you too\" \n\nNever trust the mute.",
            "title_similarity": "0.54957914",
            "sentiment_compound": 0.827
        },
        {
            "id": "h2wsg10",
            "score": 1,
            "text": "I’ll always mute someone when it sounds like Darth Vader is on the call",
            "title_similarity": "0.6802876",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2wsg1z",
            "score": 3,
            "text": "Best tip ever. I was recently on a team meeting with 30 or so colleagues and decided to play the piano while the meeting started.\n\nMeeting starts and (as I joined MS teams via phone call) nobody could figure out who was serenading them until my colleague clicked and loudly told me to shut up...",
            "title_similarity": "0.5236857",
            "sentiment_compound": 0.765
        },
        {
            "id": "h2wsh97",
            "score": 1,
            "text": "I outright unplug the microphone whenever I need it off.",
            "title_similarity": "0.6109301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wsnic",
            "score": 2,
            "text": "Had a coworker who would physical disconnect her headset to curse or sigh whenever a client pissed her off after forgetting to mute one time",
            "title_similarity": "0.5099586",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h2wsnpn",
            "score": 1,
            "text": "...and the video is always on too!",
            "title_similarity": "0.38557506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wssuy",
            "score": 1,
            "text": "I would absolutely love a mute lock.\n\nMost of the time I love being able to hit the spacebar to temporarily unmute. But sometimes I absolutely positively do not want to accidentally unmute, and would love to have a popup confirmation dialog.",
            "title_similarity": "0.60941577",
            "sentiment_compound": 0.9607
        },
        {
            "id": "h2wsuf6",
            "score": 1,
            "text": "I always just restart my laptop after a zoom meeting",
            "title_similarity": "0.5688584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wsykk",
            "score": 1,
            "text": "A cam uncovered is always recording.",
            "title_similarity": "0.48274344",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wszfh",
            "score": 1,
            "text": "a gun isn’t always loaded though.",
            "title_similarity": "0.27830046",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2wt7yo",
            "score": 1,
            "text": "On both of the 2 boring and unnecessary zoom meetings I have a day I always triple check that the mic is muted and then I do another check by blowing air into the mic for like 10-20 seconds, if someone doesn't reacts or say something we gucci. Then i proceed to watch youtube for the rest of the meeting. I like social distancing",
            "title_similarity": "0.63102674",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2wtdzm",
            "score": 1,
            "text": "Yup, and always assume your camera is on. Unless it is covered I make sure to always look presentable if my camera is uncovered even if it says it is off.",
            "title_similarity": "0.5548188",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2wtl7u",
            "score": 2,
            "text": "One time I jokingly said “shitty” into a microphone I was so sure was muted. They kept dancing but it definitely made for an awkward father-daughter wedding dance.",
            "title_similarity": "0.47684488",
            "sentiment_compound": 0.5641
        },
        {
            "id": "h2wtmj7",
            "score": 2,
            "text": "Same goes for the webcam. Unless it has a lens cover, it is ALWAYS on. Cover that shit up",
            "title_similarity": "0.63603187",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2wtpsq",
            "score": 2,
            "text": "I did QA for a call center and had to have a coworker fired for mute button failure.\n\nFor reference, he was talking to a very nice woman who was requesting a refund for a service. She did not follow the required refund policy, but my coworker was trying to help her out however he could.\n\nHe asked to place her on a quick hold to talk to his team lead. She agreed and he placed her on mute.\n\nWe used Avaya phone systems, and our monitoring software showed the status of the call. I could see that he hit the physical mute button on the desk phone. However the call was not muted. His Team lead came over and he said \"Hey man so this lady kind of fucked herself, is there any way I can take a loss to refund her?\". \n\nShe was very nice and politely told him that she could still hear him. He said sorry and put her on the hold music.\n\nWhen I reported this on the weekly coaching opportunities, his ops manager said it was his 3rd strike that month and fired him the next day.\n\nNever trust the mute button. Even if you see on the phone that its muted, sometimes its not.",
            "title_similarity": "0.54002064",
            "sentiment_compound": -0.8179
        },
        {
            "id": "h2wtt74",
            "score": 2,
            "text": "Oh man...I did this with a job interview last year. It was with the local school district and there where two people on Zoom ready to interview me. I had my headphones, I had the appointment link ready to go, the webcam was set up, mic working, I was in my office with the door close and my kids were actually obeying my request to keep it down. I had everything set up...so I thought. \n\nSo, I sit down about 10 minutes before the interview and reviewed my answers and questions for the end of the interview. The time came and I joined the meeting. Wouldn't you know, the audio wasn't coming through the headphones. Of course, I did some troubleshooting for a bit and just couldn't get them to work. The two people interviewing my were being most patient and cordial...from what I could see, but, I will admit, it was already looking very unprofessional. \n\nI couldn't the headphones to work, so I get up out of my chair, jet out my door and run to the living room to get my other set of headphones from my daughter. Well, she did something with them and didn't remember what she did them (mind you, this couldn't have been more than 20-25 mins ago). So, I am getting frustrated and I am talking a bit loudly, something about, \"I just gave you this headphones, where can they be? I have an important interview...\" blah blah blah. \n\nI finally get the headphones and, as I sit back down, I realize that I also did the most cliché thing in the world by only wearing the top part of my suit. I know I got immediately red, but I try to play it off. I apologize for the delay and after I get finished talking, one of the interviewers said, \"Just to let you know, we could hear everything that was going on in the background and to try to remember to mute your mic...for future reference.\"\n\nI was so embarrassed. I said, \"Well, I guess this concludes the Zoom portion of the interview.\" Of course, they said it was fine and okay and that we could proceed if I wanted to. I did, but, needless to say, I bombed the interview and didn't get a call back. Oh well...\n\nI still don't know if they saw me in half a suit and half in boxers. They never brought it up. I am pretty sure they did. Wow! What a hot mic experience that was and I guarantee I will not do that again.",
            "title_similarity": "0.52238125",
            "sentiment_compound": 0.9538
        },
        {
            "id": "h2wty1h",
            "score": 2,
            "text": "This extends to just about any mic, not just zoom calls. Basically, assume if you are near a plugged in mic that it is \"live\" and broadcasting to a speaker. The Venn diagram of stage plays I've worked on that require the actors to have microphones and the stage plays that I've heard stuff backstage through an actors mic is a circle.",
            "title_similarity": "0.53597844",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h2wu7yo",
            "score": 1,
            "text": "I used to be a twitch streamer and I considered my microphone HOT anytime it was plugged in... wether I was in discord or had OBS open or not... I always unplugged my mic when the show was over for privacy  and I hung a peice of paper over the camera too",
            "title_similarity": "0.67703354",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2wu9s7",
            "score": 1,
            "text": "Which is why we should all use push to talk",
            "title_similarity": "0.35443467",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wud3y",
            "score": 7,
            "text": "Very few will see this but this also applies to 911 when you're being transferred\n\nWorked for PD 911 and had to transfer calls for injury accidents to Fire/Medical\n\nCaller: we're in an accident\n\nMe: are you injured \n\nCaller's wife: no I'm fine\n\nMe: ok, so you don't need paramedics\n\nCaller: yes we do\n\nCaller's wife: I'm fine, are you hurt?\n\nCaller: I want paramedics\n\nMe: (thinking he wants to get checked out for good measure) ok, hold while I transfer you\n\n\\*\\*Calls being transferred sound like a ringing phone, but we're basically conferencing Fire/Medical in and we typically mute because Fire/Medical gets annoyed if they pick up stuff on your mic, so callers just hear ringing. During this time....\"\n\nCaller: You tell them you're injured (said very firmly to wife)! We're going to make some money out of this.\n\n&#x200B;\n\nI hope whoever was sued had their insurance request the call records or incident report, because I notated that in the primary call and all duplicates and I put it in so that our CAD notified the officers of my notes. Never got requested to testify, but all that shit was RECORDED, so it wouldn't have been hard to get the guy to drop the case (or at least his attorney/insurance to drop him)",
            "title_similarity": "0.57551885",
            "sentiment_compound": -0.9735
        },
        {
            "id": "h2wui7i",
            "score": 7,
            "text": "Also when abroad everyone can understand your mother tongue.",
            "title_similarity": "0.35275573",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wuqy2",
            "score": 1,
            "text": "Got a switch on my mixer that mute the mic",
            "title_similarity": "0.49070963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wusao",
            "score": 2,
            "text": "I was in a zoom meeting just last night I had to restart it and when I rejoined I forgot to mute my mic and was watching vids on Reddit that had goofy music with my other phone and all of a sudden I hear “(my name) fix your mic!” Pretty embarrassing",
            "title_similarity": "0.6372459",
            "sentiment_compound": 0.2244
        },
        {
            "id": "h2wuyx6",
            "score": 1,
            "text": "sticky notes never fail me",
            "title_similarity": "0.45566273",
            "sentiment_compound": 0.431
        },
        {
            "id": "h2wv2t1",
            "score": 1,
            "text": "The camera might be on too. Just say no if you're tempted to toobin it",
            "title_similarity": "0.32125947",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2wv8gy",
            "score": 2,
            "text": "Pro tip: use space bar to mute/unmute so that you don’t have to worry if you accidentally didn’t click it or not",
            "title_similarity": "0.5388894",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2wvglk",
            "score": 2,
            "text": "Lol. I will mute myself before going to the bathroom. Double check it. Say something and see if somebody can hear me. And then still be too scared and lay my headset down before I go to the bathroom",
            "title_similarity": "0.49728787",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2wvmp1",
            "score": 2,
            "text": "I was saying the same thing about Covid during the pandemic.\n\nAssume everyone has it, stay six feet away from everyone, keep your mask on at all times/ never touch your face/ wash hands frequently accordingly.",
            "title_similarity": "0.6098533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wvnzj",
            "score": 2,
            "text": "During a zoom meeting: \n\nMy mic: *muted *\n\nMe: *Sneezes *\n\nTeacher: God bless you. \n\nMe: (⊙_⊙)",
            "title_similarity": "0.54490685",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2wvxbm",
            "score": 1,
            "text": "Yup, I always act as if my camera is on, my mic is hot, and my coworkers are waiting to upload my mistakes to Facebook",
            "title_similarity": "0.622517",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2ww36e",
            "score": 3,
            "text": "Truth.  Been in radio since 1974 and I was taught from early on always assume the microphone is on.",
            "title_similarity": "0.54119116",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2ww3vn",
            "score": 1,
            "text": "And the camera is always on. Exhibit A is Canadian Member of Parliament who [got naked on camera in front of his coworkers, twice](https://www.ctvnews.ca/mobile/politics/mp-says-he-urinated-on-camera-without-realizing-month-after-being-caught-naked-1.5446268)",
            "title_similarity": "0.52924794",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ww75v",
            "score": 1,
            "text": "Thankfully I run an interface out of zoom and when I really don’t want to be heard I turn the gain on my mic down.",
            "title_similarity": "0.56048906",
            "sentiment_compound": 0.7769
        },
        {
            "id": "h2wwcpw",
            "score": 2,
            "text": "I forgot I was sharing my screen during a presentation and started browsing reddit /r/idiotsincars and showed 50+ people a horrible car accident. I didn't know until someone said \"is this part of the presentation?\"\n\nThankfully no one brought it up afterwards.",
            "title_similarity": "0.53320515",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h2wwfsq",
            "score": 1,
            "text": "I always double check and I bought those camera covers when we started working from home. Too many line managers think its okay to start a video chat with you that force your camera on whether you've consented to it or not.",
            "title_similarity": "0.6084045",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2wwvt7",
            "score": 1,
            "text": "But what if your point is moot...\n\nAm I right?...\n\nAnyone?...\n\nEhh?!...",
            "title_similarity": "0.23146793",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wx6ww",
            "score": 2,
            "text": "Even bigger LPT: if your zooming pantsless, don’t stand up. \n\nKeith Morrison: *”He wouldn’t be the only one getting an unexpected package that day during the meeting. When they knocked for a signature, he “stood and delivered””*",
            "title_similarity": "0.6423723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wxbdw",
            "score": 1,
            "text": "The Costco French vodka is like Tito's.\n\nhttps://www.mashed.com/252701/the-real-difference-between-kirklands-french-vodka-and-american-vodka/",
            "title_similarity": "0.36536005",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2wxne0",
            "score": 2,
            "text": "That is the reason why I block microphone access using Settings instead of using mute button.",
            "title_similarity": "0.49671525",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2wxp92",
            "score": 4,
            "text": "People always thought I was crazy for using both the mute button in zoom AND the mute button on my headset. Then, we had a fateful day when one of my coworkers got caught talking shit on a call when he thought he was muted, and was promptly fired. I had a few messages after that asking where I got a headset with an additional mute button lol",
            "title_similarity": "0.61284983",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2wxv6a",
            "score": 1,
            "text": "And a condom always has a hole in it, so rinse yourself out with bleach when finished.",
            "title_similarity": "0.51872164",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wxw5m",
            "score": 2,
            "text": "Double down. \n\nMute on the zoom \n\nMute on the PC. \n\nEven a hardware mute on an external mic",
            "title_similarity": "0.5477183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wy88v",
            "score": 2,
            "text": "I just go \"HEY HEY HEY HEY HEY HEY\" while someone is talking. The consequence would be a little rough, but since it's supposed to be muted the risk is low. If they can hear you then they will stop talking or at least be interrupted. Then you can go back to moaning @ the BJ you are getting.",
            "title_similarity": "0.444296",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h2wye37",
            "score": 2,
            "text": "Except when you are actually trying to say something — then it’s muted",
            "title_similarity": "0.22965294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wykuo",
            "score": 2,
            "text": "An attorney I work with completed a bond hearing (bond was denied), minimized the window, and proceeded to tell me how crazy and violent his GUILTY client is and how he hopes she’ll never get out of jail. The judge and solicitor heard everything. Fortunately the client did not.",
            "title_similarity": "0.58272946",
            "sentiment_compound": -0.873
        },
        {
            "id": "h2wyn5y",
            "score": 1,
            "text": "Try telling my kids that.",
            "title_similarity": "0.28303468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wyr2k",
            "score": 1,
            "text": "LPT: If your gonna mute yourself, on Windows disable your microphone in the sound control panel\n\nAlso physically unplug it if it’s external",
            "title_similarity": "0.50860757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wyvpr",
            "score": 1,
            "text": "I always think of emails as being written on the backs of postcards that anyone can read, rather than in sealed, privately addressed envelopes.\n\nAnd this isn't so much out of security concerns of emails I send, it's more out of concern of the email's recipient being able to forward it easily, or reply to it while copying someone else in on it.  Put it in an email, you should be prepared to stand behind what you've written, to anyone at all, at any given moment.",
            "title_similarity": "0.6315242",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2wzb6k",
            "score": 3,
            "text": "Me flashing back to how much fun I had farting while trying to keep a neutral expression.",
            "title_similarity": "0.44485065",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2wzep7",
            "score": 2,
            "text": "I always unplug the camera after use and roll up the cord so that I can see that it's unplugged.",
            "title_similarity": "0.6488807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2wzn6u",
            "score": 1,
            "text": "Best option is buy headphones (with mic) that have a mute switch. So you can mute yourself from your headphone's wire itself and no need to worry about anything.",
            "title_similarity": "0.5073036",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2x01ge",
            "score": 3,
            "text": "One on my coworkers was on a zoom call the other day, it was a boring meeting that we had to attend by obligation, when we were about an hour into the meeting he shouted “when this guy is going to stop talking i want to take a piss!”. There was a few seconds of uncomfortable silence after that and the the guy kept talking like he didn’t heard a thing.",
            "title_similarity": "0.5460259",
            "sentiment_compound": -0.5562
        },
        {
            "id": "h2x0e4i",
            "score": 1,
            "text": "Not just Zoom - assume every microphone you see is on unless you know for sure it isn't.\n\nI'm a musician and the number of private conversations and dumb comments that travel over mics that aren't muted is uncountable.",
            "title_similarity": "0.6448147",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2x0iec",
            "score": 1,
            "text": "For the same reason get the sticker sliders to put over your computer camera(s) and always physically switch it whenever you turn off camera.",
            "title_similarity": "0.62537485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x0pq7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.12808219"
        },
        {
            "id": "h2x0xye",
            "score": 1,
            "text": "Every call some mfer is not muted. It’s normally when someone joins a call via their phone with no video.",
            "title_similarity": "0.5404733",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2x0ynr",
            "score": 1,
            "text": "On microsoft teams if I was muted and for example clapped, it even says you are muted. Good to have manual button on the microphone especially if you are taking a test.",
            "title_similarity": "0.5570894",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2x101g",
            "score": 1,
            "text": "I got a screenshot this morning of a client falling asleep on a zoom.",
            "title_similarity": "0.43456608",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2x18ea",
            "score": 1,
            "text": "And the camera is always on so don't show it anything you wouldn't show a guy sitting next to you on the subway",
            "title_similarity": "0.53081024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x1eqg",
            "score": 1,
            "text": "I never understood how people make mistakes in front of cameras or mics. I always quadruple check that my mic isn't transmitting noise before I even tell my two year old to stop doing something crazy",
            "title_similarity": "0.67932606",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h2x1vmr",
            "score": 1,
            "text": "Staying with my parents during this entire pandemic. When I started doing video calls in my work area (located right next to the living room), I’d announce to them that I’m on a video call. Very often one of them would let out this monstrous belch or huge fart. Pretty sure my clients heard it!! xD\nTook some time but they’ve stopped the habit, thankfully.",
            "title_similarity": "0.5999152",
            "sentiment_compound": 0.8287
        },
        {
            "id": "h2x1ypi",
            "score": 6,
            "text": "All smiles and kind words while the zoom app is running. Even when the meeting over. I keep it up until I fully close zoom, only then I can reset my expression to the lifeless blank stare as I go back to swearing at my code.",
            "title_similarity": "0.67248046",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2x21zl",
            "score": 1,
            "text": "Also Also, always check if the door really is locked, in a public bathroom.",
            "title_similarity": "0.50786716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x23m6",
            "score": 1,
            "text": "It’s a market disrupter like Costco.",
            "title_similarity": "0.3025291",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2x28ad",
            "score": 1,
            "text": "Funny, zoom comes up muted automatically and that how it stays.",
            "title_similarity": "0.4589029",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2x2dk3",
            "score": 1,
            "text": "My university switched to online classes due to COVID. I would often mute myself and shut off the camera during lectures over Zoom. \n\nOne day the professor started asking a bunch of questions. Thinking I was muted, I answered them all in a bored tone and mumbling a bunch. The professor paused his questions: “I’m sorry, User_of_Name, but can speak up a little more? I can’t quite hear you.”\n\nInstant mute.",
            "title_similarity": "0.574268",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2x2jd7",
            "score": 1,
            "text": "As a semi-clueless American, I'm curious as to what \"bone idle\" means?",
            "title_similarity": "0.37924927",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2x2jsk",
            "score": 1,
            "text": "Also use the option of starting the zoom call muted.",
            "title_similarity": "0.34072384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x2lfz",
            "score": 1,
            "text": "Except when the host mutes people as they arrive",
            "title_similarity": "0.30690813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x2lp1",
            "score": 3,
            "text": "YES!! I accidentally answered a phone call once on a Zoom meeting, forgot I hadn’t muted my microphone. After that embarrassing moment, my microphone mute button on my computer now stays on ALL day, every day.",
            "title_similarity": "0.6869312",
            "sentiment_compound": -0.2849
        },
        {
            "id": "h2x2oj9",
            "score": 1,
            "text": "The mic is always hot.  \nThe webcam is always broadcasting.  \nThe screen is always shared.",
            "title_similarity": "0.53314626",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2x2za1",
            "score": 1,
            "text": "I talk so much shit on mute. Prolly gonna get me one of these days.",
            "title_similarity": "0.5507287",
            "sentiment_compound": -0.5965
        },
        {
            "id": "h2x376k",
            "score": 3,
            "text": "Big work meeting not all on vid \"okay let's go into groups to discuss this\"\nMe: fuck my life *instant panic and red face *\nPc saved me cos for some reason it said \"could not switch on your microphone\"",
            "title_similarity": "0.68089426",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2x3pgk",
            "score": 1,
            "text": "There’s nothing like the adrenaline rush after ripping ass and having your camera and name take the spotlight in a department meeting with 60 of your coworkers. I’m totally not speaking from experience..",
            "title_similarity": "0.5779655",
            "sentiment_compound": -0.6818
        },
        {
            "id": "h2x3rzn",
            "score": 1,
            "text": "Not just on your computer. Any mic can be hot/live at any time.",
            "title_similarity": "0.45319408",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x3uxt",
            "score": 1,
            "text": "Where's the ASMR microphone in her butt at?",
            "title_similarity": "0.39084727",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x46es",
            "score": 1,
            "text": "Also ask Jeff Tooban, the camera is always on so don't wack off on your break.",
            "title_similarity": "0.60418403",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x4ddk",
            "score": 1,
            "text": "never open your mouth",
            "title_similarity": "0.27759385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x4l26",
            "score": 1,
            "text": "I don’t even jerk off at my computer now, not with my work laptop nearby.",
            "title_similarity": "0.44187513",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2x4l5p",
            "score": 1,
            "text": "Which us why I always mute from the computer and not from the application.",
            "title_similarity": "0.5701151",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x5a7y",
            "score": 1,
            "text": "Is it bad that I play guitar when people are presenting?",
            "title_similarity": "0.33152652",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2x5dpz",
            "score": 2,
            "text": "Chef checking in here. A pan is always, always hot even when it isn’t. Never grab a pan no matter how room temp it is without a towel",
            "title_similarity": "0.5517091",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h2x5erw",
            "score": 1,
            "text": "additional pro tip that there’s a setting that causes you to unmute when you press and hold down the space key that you should turn off if you don’t use it. i turned this off because my cat likes to sit on my keyboard",
            "title_similarity": "0.5503685",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2x6h6d",
            "score": 1,
            "text": "At least they'll never see my naked body",
            "title_similarity": "0.32642293",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x6oc3",
            "score": 1,
            "text": "It was too late for Shweta, she spilled too many beans thinking she was muted",
            "title_similarity": "0.47765046",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x6wex",
            "score": 1,
            "text": "There's no handle on a falling knife.",
            "title_similarity": "0.31300563",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2x70vs",
            "score": 3,
            "text": "Last semester during a zoom class I got a notification that my mic had stopped working and decided to test it on zoom. During the mic test, I guess my mic had started working again and so there I was interrupting the class going “Hello. Hello. HelloOoOo.” And my professor, god bless soul, thought his mic had stopped working too so he started asking we could hear him and saying hello as well. A lot of lols in the chat that day",
            "title_similarity": "0.5462997",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2x773x",
            "score": 1,
            "text": "I just heard Jeffrey Toobin apologizing on CNN\n\nhttps://www.youtube.com/watch?v=8noCAW7z5Bk",
            "title_similarity": "0.45194888",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2x7b5q",
            "score": 1,
            "text": "Sound guy here...\n\nNot just Zoom. Assume any mic, anywhere, is hot at all times. I've heard some crazy conversations over the years from people who didn't think anyone else could hear them. We can usually hear absolutely everything.",
            "title_similarity": "0.5940516",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2x98am",
            "score": 1,
            "text": "...and a camera always on.\n\nClose your door If you are going to the bathroom.\nEspecially when your toilet is in line of sight.\n\nTalking from experience here...👀",
            "title_similarity": "0.58231187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2x9er4",
            "score": 1,
            "text": "Your camera is always secretly on and you are always screen sharing.",
            "title_similarity": "0.6061481",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2x9fc9",
            "score": 1,
            "text": "A microphone or camera on ANY work call is always unmuted.",
            "title_similarity": "0.63530874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xa2y9",
            "score": 1,
            "text": "2 important corollaries:\n\n1. if you are presenting or sharing your screen.  Close all your messaging apps first\n\n2. use a different platform for any side conversations you are having.  On a Zoom call? Use sms or Teams.",
            "title_similarity": "0.61556613",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2xadk3",
            "score": 1,
            "text": "Also: when you come in as fifth person and later in teams you are automatically muted",
            "title_similarity": "0.36380517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xahuo",
            "score": 1,
            "text": "I got micd myself in a Zoom class the other day and no one said anything for a few minutes. I'm still dying inside. I said some things while talking to myself out loud that weren't great",
            "title_similarity": "0.51134324",
            "sentiment_compound": -0.6698
        },
        {
            "id": "h2xb264",
            "score": 1,
            "text": "You should also mute yourself if you're using speakers or some other sound device that the microphone is capable of picking up. Too many people don't realize that they're creating echoes of other people while they're talking and most people feel super awkward hearing themselves talking while they're trying to talk. Also, when you have multiple people doing that it creates feedback loops of sound that don't stop until one or more of the people involved mute themselves.",
            "title_similarity": "0.48430157",
            "sentiment_compound": 0.8847
        },
        {
            "id": "h2xb9kr",
            "score": 1,
            "text": "Learn a lesson from Jeffery Toobin",
            "title_similarity": "0.22936203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xb9ng",
            "score": 1,
            "text": "Does the same apply to the phone camera whilst jacking it?",
            "title_similarity": "0.4232959",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xbkfr",
            "score": 1,
            "text": "Keep a roll of blue painters tape for the camera lens. Also, excuse your self to the bathroom if you need to sate a certain urge.",
            "title_similarity": "0.33203006",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2xda5f",
            "score": 1,
            "text": "And when you’re at work, the person you’re talking about is always in ear shot and around the corner",
            "title_similarity": "0.5289694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xdbgs",
            "score": 1,
            "text": "That's why I physically unplug my mic before doing anything that I don't want other to hear.\n\n(Mostly just me watching Netflix on speaker)",
            "title_similarity": "0.597669",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h2xdcvq",
            "score": 1,
            "text": "Note: does not work on cloth or paper",
            "title_similarity": "0.17559965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xdkaq",
            "score": 3,
            "text": "My dad has worked from home for nearly as long as I've been alive. He told me a story once about how he used to have this really shitty headset were even if muted, if the sound was loud enough the mic would still pick it up.\n\nIt was during a really quiet part of the meeting when my mom (who was in the same room as dad) farted SO LOUD the mic picked it up, and everyone in the meeting heard it.\n\nHe didn't live it down for a while apparently.",
            "title_similarity": "0.58701074",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h2xex7m",
            "score": 1,
            "text": "Buy one of those wireless PS4 headsets. Compatible with both Windows and Mac, and the microphone is often **physically removable**.",
            "title_similarity": "0.48489237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xez86",
            "score": 1,
            "text": "I was pacing around during a work call the other day that wasn’t really involving me. And I started to talk out loud to myself rehearsing how I was going to talk to my manager about the importance of a flex wfh schedule.  Everyone heard and I’m embarrassed as shit still. Loaded gun",
            "title_similarity": "0.61071694",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h2xftjv",
            "score": 1,
            "text": "I have a separate mic for that that has a switch on/off so I know I will always be muted when the red light is there",
            "title_similarity": "0.6437954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xg57k",
            "score": 1,
            "text": "This also applies to Skype",
            "title_similarity": "0.287236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xg7u5",
            "score": 1,
            "text": "Actually, you can apply that to all mics. Assume that they are unmuted and will transmit sound.\n\nThis has been a PSA from r/livesound",
            "title_similarity": "0.5420054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xga97",
            "score": 3,
            "text": "A colleague once told me never trust your career on a little piece of plastic, beware the mute button.",
            "title_similarity": "0.5179038",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h2xgh3d",
            "score": 1,
            "text": "And a corporate web browser is always being monitored.",
            "title_similarity": "0.48790127",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xgmll",
            "score": 1,
            "text": "One of my colleagues forgot to mute his wireless headphones when he went to the toilet. We had to tell him we could hear him pissing",
            "title_similarity": "0.4755307",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2xgo6j",
            "score": 2,
            "text": "1. Treat all microphones as if they're always unmuted.\n\n2. Never let the microphone cover anything you're not willing to record.\n\n3. Keep your mouth shut until your microphone is on target, and you've made the decision to speak.\n\n4. Be sure of your recording target and what's beyond it.",
            "title_similarity": "0.6759023",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2xh2x0",
            "score": 1,
            "text": "Also, don't change clothes in front of your webcam.",
            "title_similarity": "0.40257335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xhfnw",
            "score": 1,
            "text": "Gotta double it up.  Both use the zoom mute and mute on your computer.  Never shit-talked, but have been heard muttering various bad words in reaction.  Learned from it.",
            "title_similarity": "0.72179544",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h2xhvyz",
            "score": 2,
            "text": "Schrodingers microphone",
            "title_similarity": "0.22729535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xiqqr",
            "score": 3,
            "text": "Bro during a meeting TWO DAYS ago my boss interjects with a \"Such and such company just provided us with 250 new machines for free\" and noone really reacted, with an awkward 5 second pause, so under my breath I just go \"Yah\" and now we've got an even longer, awkwarder pause. Didn't realize I was unmuted.",
            "title_similarity": "0.48015457",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2xj8nf",
            "score": 1,
            "text": "That's why I play \"zoom roulette\"",
            "title_similarity": "0.36792955",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2xjfkc",
            "score": 1,
            "text": "“… a microphone ~~during a work Zoom~~ while connected is always unmuted.”\n\nFTFY, they can ruin more than jobs.",
            "title_similarity": "0.6678301",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h2xjhlt",
            "score": 1,
            "text": "Found a push to talk app, bound it to fn+ctrl. Works like a charm.",
            "title_similarity": "0.44693786",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2xjqln",
            "score": 1,
            "text": "I wish more people utilized push to talk, or push to mute. \n\nMy utopia is where everyone knows how to use attenuation, a compressor, noise gates, and dynamic eq. \n\nBut the general ignorance, and lack of willingness to learn about audio, and audio quality is the bane of my existence, and generally the largest source of stress and discomfort in my life. \n\nSo I don't have much to really be complaining about haha.",
            "title_similarity": "0.6666561",
            "sentiment_compound": -0.7856
        },
        {
            "id": "h2xjx29",
            "score": 1,
            "text": "Nah son I mute using device manager only",
            "title_similarity": "0.48357892",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2xk0mb",
            "score": 1,
            "text": "Me sitting here playing pointing my gun at random things and pulling the trigger while shouting profanities into my mic like...",
            "title_similarity": "0.5826933",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2xk22e",
            "score": 1,
            "text": "Or just use push-to-talk",
            "title_similarity": "0.31017545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xk3wz",
            "score": 1,
            "text": "Isn't this just bad design? If you're catching users off guard because of hot mics/cameras, you're unintentionally violating their privacy. \n\nTech companies always get this wrong and it's irritating. If you're about to start throwing your information across the internet, ensure the users opt in first. If users are throwing information across the internet, it should be obvious they are doing so. I'm sick of loading in and having a program turn all my shit on without warning. \n\nIt's bad enough when microphones and cameras do not have physical buttons that ensure your stuff won't be turned on without your awareness. It's common sense.",
            "title_similarity": "0.6026057",
            "sentiment_compound": -0.726
        },
        {
            "id": "h2xku2k",
            "score": 1,
            "text": "And the camera is always on as well",
            "title_similarity": "0.32542884",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2xl5jb",
            "score": 1,
            "text": "And your cache always contains a porn url instead of what you believe you just copied. (Copy & paste)",
            "title_similarity": "0.6468762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xlwgh",
            "score": 1,
            "text": "Can confirm, was once having bad gas due to the coffee and corn nuts meeting and fucking in my digestive system. Let out a few velcro sounding rips. To my horror, a couple of classmates started laughing which the professor admonished. I’m very sure he heard the farts too but elected to ignore them. Never again.",
            "title_similarity": "0.5143852",
            "sentiment_compound": -0.7617
        },
        {
            "id": "h2xm0ld",
            "score": 1,
            "text": "And a camera is always on",
            "title_similarity": "0.3258171",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xm74f",
            "score": 1,
            "text": "And the camera is always on.",
            "title_similarity": "0.32325232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xmcye",
            "score": 1,
            "text": "I had a friend shoot themself during a zoom meeting in the hand while messing with a gun",
            "title_similarity": "0.52656645",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2xmquf",
            "score": 1,
            "text": "Akways use a wired headset. That way you are always reminded not to go nr 2 during  a call",
            "title_similarity": "0.6460861",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xmy6t",
            "score": 1,
            "text": "I didn't realise microphone was on and I farted.",
            "title_similarity": "0.39304283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xnplw",
            "score": 1,
            "text": "My headset I use (hyperX cloud c alpha I think) let’s you physically disconnect the microphone so I use that as my mute unless I’m unmuting a lot",
            "title_similarity": "0.6614019",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xo7ky",
            "score": 1,
            "text": "When I schedule Zoom meetings, I have an email template that includes reminders about Zoom etiquette like, make sure your background is appropriate, mute when not speaking, silence your cell phone, if you have small children or pets, make sure they’re taken care of so as to not become a distraction, don’t say or do anything that you wouldn’t do in a face to face meeting. I may add a blurb to always assume the microphone and camera are always live during a meeting even when you think you’re muted and/or have your camera turned off. \n\nI always configure my Zooms to mute participants upon entry in case they’re blasting music in the background or whatever.",
            "title_similarity": "0.6922722",
            "sentiment_compound": 0.8881
        },
        {
            "id": "h2xojvy",
            "score": 1,
            "text": "This makes me feel good knowing the worst thing I’ve done while on a zoom call is take a shit.",
            "title_similarity": "0.46860033",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h2xojy6",
            "score": 1,
            "text": "WebEx has now been automuting you when you join. You have to unmute to speak",
            "title_similarity": "0.5044279",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2xom32",
            "score": 1,
            "text": "It's actually a 50 minute hold from Spectrum.",
            "title_similarity": "0.124979764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xoyu6",
            "score": 1,
            "text": "Toobin has entered the chat.",
            "title_similarity": "0.23760818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xpcv7",
            "score": 1,
            "text": "what if its a presentation with the hand raise button at the bottom. are you always on while watching the presenter?",
            "title_similarity": "0.4881143",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2xpm96",
            "score": 1,
            "text": "Could be si.olified to just zoom meetings. Happens whether work or not.",
            "title_similarity": "0.45287302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xpmer",
            "score": 1,
            "text": "Was on a Zoom call with a couple co-workers. After the presentation, the call fell into an argument and X began firmly expressing his opinion about something. At that point N, another guy on the call, IMed his boss something like, “oh geez, here goes X being a pretentious ass again”.\n\nUnfortunately, said boss was sharing his whole desktop on the call at the time in order to share the slide deck, so *everyone* saw N’s comment. There was a loooooooong awkward pause, and then X just hung up. It took a week to patch that one up. Since then I’ve tried to treat every IM as if it might be shared on-screen.",
            "title_similarity": "0.5942129",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2xq0h4",
            "score": 1,
            "text": "And a skype/zoom/teams (any video confrence tool really) should never ever be minimized to the tray...\n\nLet's call it the Toobin-rule.\n\nBut really, it is always better to push the window aside but leave it visible, not only to remember that it's running yourself, but to let anyone else entering the room know that others might be listening. \n\nJust like if you ever put a phonecall on speaker, you should tell the person you are talking to about it, make it a habit even if you are alone, and if you are not, let them know who else is present.",
            "title_similarity": "0.6488433",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2xq440",
            "score": 1,
            "text": "And you’re always connected to bluetooth when watching porn.",
            "title_similarity": "0.57251173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xrlji",
            "score": 1,
            "text": "\"Much like the gun is always loaded\",see that's where you lose us. A lot of us outside the U.S don't across a gun in our day to day life for that be a thing that we remember.",
            "title_similarity": "0.6329369",
            "sentiment_compound": -0.1441
        },
        {
            "id": "h2xrz5w",
            "score": 1,
            "text": "I started talking about my penis in a facetime call on my phone with Zoom running on my laptop. Made an awkward call.p",
            "title_similarity": "0.61341345",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2xscg7",
            "score": 1,
            "text": "“Sorry everyone I was muted”\n\nEveryone else: HA HA HA",
            "title_similarity": "0.40177375",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h2xut16",
            "score": 1,
            "text": "Any microphone!\n\nWhen we have work conference calls it’s normally my site (2-3 people) and a bunch of similar setups calling in. I’m always the one talking from our site so I’m the one muting and unmuting the phone. I’m so paranoid so I’ll use the phones mute along with the services option.\n\nThis isn’t because I’m worried about what I’ll say, it’s because I have 1-2 guys behind me bitching everytime someone ask a question that prolongs the phone call, or making jokes about directions being given. \n\nwhen I do finally need to respond I have to unmute twice, and then hope they was atleast half listening, and notice We are not muted before I start talking.",
            "title_similarity": "0.7113637",
            "sentiment_compound": -0.32
        },
        {
            "id": "h2xutkn",
            "score": 1,
            "text": "\\*Turns off phantom power on mixer.",
            "title_similarity": "0.41353807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xvucx",
            "score": 1,
            "text": "[High Meme Potential](https://i.imgur.com/Se8NGFr.jpg)\n\nThanks for the LPT!!!",
            "title_similarity": "0.41630337",
            "sentiment_compound": 0.5826
        },
        {
            "id": "h2xwmuf",
            "score": 1,
            "text": "This is why my laptop has one of the F keys as mute microphone, and my headset has it's own mute microphone button, and I downloaded another software that mutes my mic with a cuustom key bind. \n\nIf all things fail, I can always just physically unplug the input aux directly.",
            "title_similarity": "0.6807332",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2xwxat",
            "score": 1,
            "text": "A good rule of thumb is to assume there is always audio or video being recorded in whatever you are doing and with smartphones and smart speakers its more often true than not. \nIt's not completely practical but eventually you'll reach that comfortable place in life where you don't care who hears what you're saying or what you look like.",
            "title_similarity": "0.60169077",
            "sentiment_compound": 0.8499
        },
        {
            "id": "h2xx3bd",
            "score": 1,
            "text": "Whenever I go to make any sort of noise that I don't want anyone to hear, be it saying some shit or anything of the sort, I always just \"can you hear me?\" first. If someone responds, then I follow up with \"huh, it seemed like my mic was being weird, sorry about that.\" If no one responds, I move forward.",
            "title_similarity": "0.61812496",
            "sentiment_compound": -0.6728
        },
        {
            "id": "h2xxixu",
            "score": 3,
            "text": "Am audio engineer. \n\nThat is always my rule of thumb.",
            "title_similarity": "0.52331716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xybab",
            "score": 1,
            "text": "Whenever there’s anything I don’t want to be heard I “double mute”.  My headset mute is independent of the program and gives an audible up or down tone to communicate the state.  I’ll mute on the program, mute on the headset with confirmation, then say what I might say.",
            "title_similarity": "0.57270885",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2xygal",
            "score": 1,
            "text": "Just to check, if you hover over the microphone and camera icons and they both have slashes across them, and it says “mute” on your profile pic, then it’s OK right? \nYou don’t literally mean there is a bug in the software where it says it’s muted but it’s not, right?\nJust making sure! I always check my mic status before talking to someone/coughing/etc",
            "title_similarity": "0.64197385",
            "sentiment_compound": 0.6332
        },
        {
            "id": "h2xz0v2",
            "score": 1,
            "text": "My work has lots of large group sessions -- Whenever possible, I prefer to go to the webinar link, just so my mic and camera don't have to be involved at all.",
            "title_similarity": "0.5831468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2xzdq1",
            "score": 1,
            "text": "Treat every mic as if it's unmuted.\n\nDon't point the mic at anything that doesn't intend to speak.\n\nKeep your mouth shut until you're ready to speak.\n\nKeep your mic on mute until you're ready to speak.",
            "title_similarity": "0.5265586",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2xzffh",
            "score": 3,
            "text": "That’s a good one. In a similar fashion, I learned that if I have something to say about someone, I wait till I’ve completing left the building. I’ve turned around before and they were right there where they can hear.",
            "title_similarity": "0.4639471",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2y00be",
            "score": 1,
            "text": "I had to run to the potty while on a call on my phone last year. I meant to hit the mute button but instead turned my video on.  The whole room saw my awkward sideways camera view of the bathroom for about three seconds until I realized my mistake and frantically turned it off. No one ever mentioned it.",
            "title_similarity": "0.6003139",
            "sentiment_compound": -0.872
        },
        {
            "id": "h2y01mw",
            "score": 1,
            "text": "I'll cut my throat off next meeting to be extra sure.",
            "title_similarity": "0.39112952",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2y0avd",
            "score": 1,
            "text": "Seriously. I don't trust *headphones* without slipping them off a few times or after a while to make sure there's no sound coming out of the speakers. Even plugged in ones\n\nI sure as hell won't trust a software mute function",
            "title_similarity": "0.53956646",
            "sentiment_compound": -0.852
        },
        {
            "id": "h2y1uta",
            "score": 1,
            "text": "And along those same lines, assume any browsing on your work computer is being monitored!",
            "title_similarity": "0.3750912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2y2i9t",
            "score": 1,
            "text": "Funny, my colleagues and I have the opposite problem. We can never get off mute. In every meeting, every day, at least one person on the call start hammering away on mute until someone points out their mouth is moving but no one can hear the words.",
            "title_similarity": "0.6214744",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2y2x15",
            "score": 1,
            "text": "This makes me nervous. Every time I need to talk my body feels the need to burp so I have to constantly mute and unmute my mic. Annoying as hell.",
            "title_similarity": "0.5994167",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h2y3dv4",
            "score": 1,
            "text": "The real pro tip is that even if you don’t give a shit that a microphone or camera is always on and are caught jerkin off to a colleague during a meeting, you will be guaranteed a job at CNN.",
            "title_similarity": "0.5469664",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2y3qok",
            "score": 1,
            "text": "I disable the microphone just in case",
            "title_similarity": "0.40311766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2y3y54",
            "score": 2,
            "text": "Do people know that you can set your Zoom preferences to always join the call muted? I only ever have to unmute, say my piece, and then mute again.",
            "title_similarity": "0.6687416",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2y4zgj",
            "score": 1,
            "text": "My cousin is a middle school teacher. While giving a test on zoom (accidentally unmuted) all the kids heard her talking to her cat in crazy cat lady baby voice. It was funny enough they talked about it during 8th grade graduation. She's embarrassed but I think she should he glad it was something so cute and innocent.",
            "title_similarity": "0.43857068",
            "sentiment_compound": 0.9231
        },
        {
            "id": "h2y5iet",
            "score": 1,
            "text": "Damn, if you're working from home buy a decent pair of headphones (most of them have a physical mute switch). Some of y'all could even get this subsidized.",
            "title_similarity": "0.42457223",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2y5nj3",
            "score": 1,
            "text": "And every camera is always got someone watching on the other end.",
            "title_similarity": "0.44868982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2y5q42",
            "score": 1,
            "text": "Camera is always on when your significant other is walking in naked as well",
            "title_similarity": "0.5282126",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2y5st7",
            "score": 2,
            "text": "This has me thinking about everything I’ve possibly said while muted during zoom class",
            "title_similarity": "0.49285772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2y6369",
            "score": 1,
            "text": "My wife does this for a living. Every call, she’ll say every XX mins, “am I muted?” Every long once in a while, she catches herself unmuted \n\nmy dumbass, when things went virtual last April I’m HOLLERIN at my kid thru the bathroom door (locked, he’s 5) to “later boy, I’m taking a POOOOOOP!!!!” My boss says, “brutalsexattack, you’re not muted” … call with the whole damn office",
            "title_similarity": "0.62226623",
            "sentiment_compound": -0.816
        },
        {
            "id": "h2y6cgi",
            "score": 1,
            "text": "Better LPT: much like a gun is always loaded, a microphone is always unmnuted.",
            "title_similarity": "0.7661473",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2y6o4i",
            "score": 1,
            "text": "And a screen is always shared",
            "title_similarity": "0.3322314",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2y83zi",
            "score": 1,
            "text": "At my job, we always jokingly yell \"HOT MIC! HOT MIC!\" as we get into a call. It's just a joke, but also important so that no one says anything that shouldn't leave our core group. This is even funnier since one of the guys we work with is named Michael, so we yell \"Hot mike!!\"",
            "title_similarity": "0.639233",
            "sentiment_compound": 0.6728
        },
        {
            "id": "h2yacrc",
            "score": 1,
            "text": "I was in my college class yesterday and thought I was muted. My boring professor starts talking and I said to my dad (both in the car, road trip) “I hope he doesn’t expect me to listen to this shit” he said “mr.wells I’ve taken attendance and you don’t have to stay in the class, you may leave if you wish, it’s your grade”\n\n\n\n\nI’m pretty sure I’m gonna drop out now",
            "title_similarity": "0.51192975",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h2yaubg",
            "score": 1,
            "text": "Plus, be careful when sharing your screen - one of my colleagues shared his, we could see his browser tabs and some were showing job search sites.  \nCould have been worse, could have been porn.  \nWhenever I have to share my screen I close everything except what I need to share.",
            "title_similarity": "0.5414991",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h2ybdrw",
            "score": 1,
            "text": "That’s why I go out for lunch during zoom meetings",
            "title_similarity": "0.25022212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2yblqn",
            "score": 1,
            "text": "Whoever clicks the \"always connect audio automatically\" box truly lives on the edge lol",
            "title_similarity": "0.6037173",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2ybrvu",
            "score": 1,
            "text": "Same with a microphone during a zoom court hearing 😂",
            "title_similarity": "0.34349686",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2ycztk",
            "score": 1,
            "text": "Until you see the red light or mute icon",
            "title_similarity": "0.3394725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2yftov",
            "score": 3,
            "text": "Pro-tip:\n\nGet a webcam with a physical block over the lens, that way you KNOW your camera is off when you want it off. I thought it was silly, but I use that fucker every day and it provides a lot of peace of mind.",
            "title_similarity": "0.6586141",
            "sentiment_compound": -0.4497
        },
        {
            "id": "h2yl4ee",
            "score": 1,
            "text": "LPT: Always stay muted and only hold the space bar to talk when you need to.",
            "title_similarity": "0.5807002",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2yn6j6",
            "score": 1,
            "text": "This inspires me to intentionally keep my mic unmuted, then compliment my class while pretending to be talking with someone else the next time I have Zoom class.",
            "title_similarity": "0.49104667",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h2ysi4k",
            "score": 1,
            "text": "I don’t have $$ can somebody hook this guy up?",
            "title_similarity": "0.31865618",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ysmdn",
            "score": 1,
            "text": "This is not an LPT.",
            "title_similarity": "0.09295203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ytee8",
            "score": 1,
            "text": "And a baby is always about to pee and or puke.",
            "title_similarity": "0.39407843",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2yujo3",
            "score": 1,
            "text": "If you’re not using it, cover your camera at the very least. The amount of people I see in meetings unaware that their camera is on is too damn high.",
            "title_similarity": "0.50539786",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2yunu2",
            "score": 1,
            "text": "I work in the broadcast industry.  As general rule it's drilled into you..always assume your mic is on and someone is listening.",
            "title_similarity": "0.52682126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2yutrg",
            "score": 1,
            "text": "The camera is always on if it's not covered",
            "title_similarity": "0.43766916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2yvqt9",
            "score": 1,
            "text": "I disconnect the wire from my microphone, unplug it from the audio interface, shut off the interface, unplug the interface from my pc, then burn my computer just to make sure it’s muted",
            "title_similarity": "0.5273915",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2yyj98",
            "score": 1,
            "text": "On the flip side, I'm always muted, on all conf calls and meetings, often with no video, so if I'm not expected to talk, I'll often snack while on the call. Then if I'm unexpectedly called on for a comment and need a moment the line, \"Apologies, I was talking to myself on mute.\" works wonders, lol",
            "title_similarity": "0.612651",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2yzloa",
            "score": 1,
            "text": "At the hotel where I work we have an office with an auxillary fridge. A chef's dad stays over fairly often and had been attending a zoom meeting in the office. \n\nChef walks in and opens fridge: \"Gah, something stinks in there. Smells like dirty fanny.\"\n\nChef's Dad: \"Smells more like rotten fanny.\"\n\nVoice from PC: \"Erm, Mark, you might want to mute yourself?\"",
            "title_similarity": "0.4541741",
            "sentiment_compound": -0.4377
        },
        {
            "id": "h2z18ri",
            "score": 1,
            "text": "And always assume someone’s watching or listening/ recording. Zoom has literally no safety precautions. No encryption. Nothing. And they list that in their user agreement so if you decide to enjoy a little “movie time” with your SO just assume someone’s enjoying the view and recording it to post on pornhub amateurs later. This also goes for confidential company/ private info. If your company is using zoom just expect there to be a leek on anything you’ve mentioned that was a company secret.",
            "title_similarity": "0.65295595",
            "sentiment_compound": 0.7405
        },
        {
            "id": "h2z4qr0",
            "score": 1,
            "text": "**i move away from the mic to mute in.\n\nceterum censeo \"unit libertatem\" esse delendam.",
            "title_similarity": "0.40833548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2z6my0",
            "score": 1,
            "text": "There is a woman I work with and even though we've been doing this for over a year, she still doesn't mute her mic most of the time. Infuriating.",
            "title_similarity": "0.441099",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2z77go",
            "score": 1,
            "text": "Recently went through a media training and the first thing the instructor said is “consider that the mic is always hot”.",
            "title_similarity": "0.56938475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zapzk",
            "score": 1,
            "text": "I use an external mic that has a mute button and I always double mute.",
            "title_similarity": "0.6599109",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zc086",
            "score": 1,
            "text": "That's why I always enable push-to-talk during setup.",
            "title_similarity": "0.54538727",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30h907",
            "score": 2,
            "text": "I used to work at a bank call center.  We had physical mute buttons on our phones.  Apparently one of them didn't work, and a new guy sat down in the cubicle.  Eager to use the button, he hit it and said something like \"You are fucking DUMB!\"\n\nThe customer said, \"Excuse me?\"\n\nFired.",
            "title_similarity": "0.5496162",
            "sentiment_compound": -0.6017
        },
        {
            "id": "h39guoq",
            "score": 1,
            "text": "I check my mic on zoom calls every 15 seconds, i have OCD and that really doesn't help for shit.",
            "title_similarity": "0.5800463",
            "sentiment_compound": 0.0996
        },
        {
            "id": "h3y7l5b",
            "score": 1,
            "text": "no safety fuck yes ahah",
            "title_similarity": "0.23895086",
            "sentiment_compound": 0.497
        },
        {
            "id": "h48xm8p",
            "score": 1,
            "text": "Are there people who still stay unmuted on zoom calls? I never see this",
            "title_similarity": "0.46079135",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7a9z8x",
            "score": 1,
            "text": "Avoid a blurb you can't take back! Oh the shame!",
            "title_similarity": "0.34239775",
            "sentiment_compound": -0.7081
        },
        {
            "id": "h7aa99y",
            "score": 1,
            "text": "Duct tape over the mic",
            "title_similarity": "0.18705127",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3w8jbm",
            "score": 1,
            "text": "I mean this is still trusting the software but I just launched this.   I've had times where I or someone on a call would drop some poor language lol. B\n\nThis helps.\n\nhttps://play.google.com/store/apps/details?id=com.velocicrafted.easymute",
            "title_similarity": "0.5946256",
            "sentiment_compound": 0.4404
        }
    ]
}