{
    "LPT: If you bought a game on Steam just before the sale hit, you can refund it and repurchase at the sale price. It's even listed as one of the reasons for refund.\n": [
        {
            "id": "h35d3fm",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.5669164",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h360eie",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.17798288"
        },
        {
            "id": "h36s8qo",
            "score": 0,
            "text": "Absolutely devastating for the devs. \n\nI work for a small games company and this behaviour is crippling. \n\nI know it’s steams fault for allowing this to happen but just thought i’d let you know.",
            "title_similarity": "0.518781",
            "sentiment_compound": -0.5642
        },
        {
            "id": "h360g22",
            "score": 0,
            "text": "People didn't know this?",
            "title_similarity": "0.1370407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h35rmc8",
            "score": -35,
            "text": "That should not work this way. It might, but it is not ethical. It would be like if I bought a cheese burger for $3 today, and then tomorrow I go in there and see them on sale for $2. I'm not gonna be like, \"Hey give me a dollar back from yesterdays cheeseburger.\" The price you paid is the price you agreed to. I'm shocked they allow such a thing.",
            "title_similarity": "0.49947268",
            "sentiment_compound": -0.2306
        },
        {
            "id": "h3695ij",
            "score": -3,
            "text": "ITT: Poor people lol",
            "title_similarity": "0.17144826",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h36a87o",
            "score": -3,
            "text": "Isn't there a gamer sub for this shii ight? Thanks for the LPT, now I'm a pro at saving $40 to go waste my time gaming. fkn smh---",
            "title_similarity": "0.6006083",
            "sentiment_compound": -0.296
        },
        {
            "id": "h37vcyz",
            "score": 0,
            "text": "that is fucked up",
            "title_similarity": "0.07270002",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h35qqr8",
            "score": 17,
            "text": "Thank you for this! I almost bought BF:V the day before it went on 75% off and was thinking what the heck I would’ve done if I hadn’t waited. Glad I know this now!",
            "title_similarity": "0.5726044",
            "sentiment_compound": 0.7256
        },
        {
            "id": "h362nbl",
            "score": 20,
            "text": "LPT.  If you buy the game on sale and want to buy it at full price, just refund it and buy it at full price",
            "title_similarity": "0.76260144",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h360y5l",
            "score": 1,
            "text": "But don't you need to have played it less than a certain amount of time?",
            "title_similarity": "0.41005087",
            "sentiment_compound": 0.6547
        },
        {
            "id": "h3665iw",
            "score": 1,
            "text": "hello epic games store fanboys here's your coffin\n\njoking not joking aside, this is why i have no problems doing pre-orders on steam, dodged some bullets with the refund service",
            "title_similarity": "0.65319777",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h36dcik",
            "score": -1,
            "text": "I actually have been warned by steam to stop refunding, so I don’t know if that’s all true",
            "title_similarity": "0.55806565",
            "sentiment_compound": -0.128
        },
        {
            "id": "h36hacc",
            "score": 1,
            "text": "Can I do the same with my crypto currency?",
            "title_similarity": "0.49600562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h35mydq",
            "score": 8,
            "text": "Real LPT. Thanks!",
            "title_similarity": "0.25465903",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h364b8o",
            "score": 2,
            "text": "LPT if you're having trouble with the SkidRow crack version try looking for the FitGirl RePack although that's gonna be a rare occurance",
            "title_similarity": "0.50787175",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h36cb8w",
            "score": 2,
            "text": "LPT: Don’t buy cyberpunk. The intro is longer than the refund period.\n\nEdit: and it blows harder than a humpback.",
            "title_similarity": "0.45521203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h35qufs",
            "score": 12,
            "text": "You can also refund for just about any reason as long as you have less than 2 hours playtime and you purchased the game within the last 2 weeks",
            "title_similarity": "0.64379907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h35v4at",
            "score": 29,
            "text": "Additionally, if you bought a game on Epic up to 30 days before it went on sale, they will refund you the discount amount.\n\nWhich was just...a huge surprise to me but something I hadn't considered before. Hope Steam and other platforms pick up on that.",
            "title_similarity": "0.7731668",
            "sentiment_compound": -0.2285
        },
        {
            "id": "h36hbwz",
            "score": 6,
            "text": "I just went thru the account recovery process. Took me like 20 emails. Just to get onto my acc to realize all my games can’t be played on my new MacBook Air…",
            "title_similarity": "0.52197087",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h35wk1h",
            "score": 11,
            "text": "As a heads up though, you can’t refund games non-stop. If you do it too often Steam won’t let you continue for a while. It’s not meant as a way to get a free trail of games (though steam really should implement that).",
            "title_similarity": "0.6264554",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h35rqss",
            "score": 103,
            "text": "Steam are absolutely brilliant with refunds. I remember trying to refund nfs on my PS4 after I got it and me installing it had voided it, lol.",
            "title_similarity": "0.73579013",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h35hf6z",
            "score": 129,
            "text": "This is usually true for real life stores too, if you contact them then they can usually give you the discount after you bought it for full price. Depends on the store though.",
            "title_similarity": "0.74802375",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h35ot2p",
            "score": 271,
            "text": "I tried doing this when GTA V was free. I bought the game two days ago but since I played it for more than 24 hours it was denied.",
            "title_similarity": "0.606438",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h35xf7c",
            "score": 129,
            "text": "As an indie game developer, I'd really encourage people to do this. We get most of our revenue from stuff like the Steam Summer sale anyway, and while I can't speak for everyone, I'm just happy you want to play my game.\n\nFurthermore, you can refund a game you don't like if you've played less than 2 hours, which I also would encourage people to do.",
            "title_similarity": "0.6934892",
            "sentiment_compound": 0.944
        },
        {
            "id": "h35i6ib",
            "score": 2048,
            "text": "Actually, you can refund a game for almost any reason. Just saying \"the game wasn't as fun as I hoped\" is reason enough.",
            "title_similarity": "0.7102057",
            "sentiment_compound": -0.0263
        },
        {
            "id": "h35va5b",
            "score": 436,
            "text": "Some credit cards have a feature called “Price Protection.” The rules and maximum amount of protection vary by card, but it's designed for exactly this sort of situation. If you buy an item and it goes on sale within a certain time frame, the card issuer will refund you the difference. \n\nCool explainer from [The Points Guy](https://thepointsguy-com.cdn.ampproject.org/v/s/thepointsguy.com/guide/best-cards-price-protection/amp/?amp_gsa=1&amp_js_v=a6&usqp=mq331AQKKAFQArABIIACAw%3D%3D#amp_ct=1624754051408&amp_tf=From%20%251%24s&aoh=16247540497727&referrer=https%3A%2F%2Fwww.google.com&ampshare=https%3A%2F%2Fthepointsguy.com%2Fguide%2Fbest-cards-price-protection%2F)",
            "title_similarity": "0.7417516",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h35qqbt",
            "score": 4243,
            "text": "Steam's refund policy also states you need to have played the game for less than 2 hours.",
            "title_similarity": "0.6173806",
            "sentiment_compound": 0.34
        },
        {
            "id": "h35w5rm",
            "score": 13,
            "text": "Don't they have it set to where if you played the game more than 2 hours you wouldn't qualify for a refund?",
            "title_similarity": "0.5362586",
            "sentiment_compound": 0.34
        },
        {
            "id": "h35x8ux",
            "score": 1,
            "text": "The inverse doesnt happen. I bought a game 2 minutes after a sale ended because their servers crashed during the sale and they didn't let me get the discount",
            "title_similarity": "0.49662912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h35xnnu",
            "score": 1,
            "text": "For actual returns and stuff, steam are really good at it, never had any issues getting a refund from steam",
            "title_similarity": "0.45318344",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h35y14o",
            "score": 1,
            "text": "Thanks! I did not know that.",
            "title_similarity": "0.2145069",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h35y2ct",
            "score": 2,
            "text": "I literally tried this exact thing 2 months ago and they denied me because it had been more than 2 weeks since the purchase (3weeks), any advice?",
            "title_similarity": "0.3529333",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h35z3su",
            "score": 4,
            "text": "This is also why flash sales went away.",
            "title_similarity": "0.5027256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h35zocw",
            "score": 76,
            "text": "Steaks refund policy is amazing. Great for us consumers and it must make them a ton of money. You can buy any game completely risk free and refund as long as it’s within 2 weeks and 2 hours of playtime. The 2 hours is flexible, I’ve refunded games that had over 2 hours because I already had playtime from a free weekend. (And that unusual case refund was actually faster than the normal one lol) I’ve spent a lot of money on games I wouldn’t otherwise but because of that return policy.",
            "title_similarity": "0.6250448",
            "sentiment_compound": 0.8419
        },
        {
            "id": "h35zvrj",
            "score": 1,
            "text": "Except ffxiv.\n\nI tried.",
            "title_similarity": "0.33881903",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36104y",
            "score": 1,
            "text": "Does this mean I can also refund dark souls for being too hard? 😭",
            "title_similarity": "0.5153634",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h36119b",
            "score": 1,
            "text": "Can I do this with fallout 76? I really want my money back for that \"game\"",
            "title_similarity": "0.62729144",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h3616ix",
            "score": 1,
            "text": "TIL you can refund games on steam",
            "title_similarity": "0.86021304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h362ahn",
            "score": 1,
            "text": "r/antiassholedesign ? Idk I'm still kinda new to that sub but i love this kinda thing",
            "title_similarity": "0.37722337",
            "sentiment_compound": 0.765
        },
        {
            "id": "h362ds0",
            "score": 1,
            "text": "Many places do this actually. It saves them the hassle of dealing with you returning the item and then buying it right back. It's easier to have a dedicated workflow for it.   \n  \nMy credit card also offers this for all purchases made with the card.",
            "title_similarity": "0.63022614",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h362ez4",
            "score": 1,
            "text": "Steam is surprisingly not shitty for a gaming platform.",
            "title_similarity": "0.31652597",
            "sentiment_compound": 0.6278
        },
        {
            "id": "h362sru",
            "score": 1,
            "text": "Wow. Thanks for the reminder.",
            "title_similarity": "0.24772352",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h363ioc",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.17798293"
        },
        {
            "id": "h364em0",
            "score": 1,
            "text": "Thought about buying sekiro before it went on sale. Glad I waited, but i did not know this",
            "title_similarity": "0.60307455",
            "sentiment_compound": 0.25
        },
        {
            "id": "h364mpf",
            "score": 1,
            "text": "You could do this at any store really. Back in the brick and mortar days, I bought my first game console as a kid, the GameCube. Paid x dollars w o.j th 1 controller and 1 game. \n\n\n\nA week later and the same thing is on sale but with a memory card for the same price. I have been playing the first 3 levels of Super Mario Sunshine because without a memory card you couldn't save. So we took it back to the store.\n\n\n\nThe store has a 90 day return policy. So technically you could return for x dollars and then buy for x dollars. They basically would just adjust to the sale if you bought in the past 90 days to avoid having to process a return.",
            "title_similarity": "0.60007745",
            "sentiment_compound": 0.7655
        },
        {
            "id": "h364wa5",
            "score": 2,
            "text": "Damn I should have done this when I bought a game a day before it went half-price. Although, the devs do deserve my money for the great game so I don't feel much regrets.",
            "title_similarity": "0.66090643",
            "sentiment_compound": 0.5439
        },
        {
            "id": "h3653p0",
            "score": 1,
            "text": "This among many other reasons is why I decided to stick with steam over the years. \n\nI remember buying Dragon Age Inquisition from EA Origin years ago, i couldn’t get it to run. I can’t reach any support for help or refund, all I got is some bullshit automated respond that wasn’t helpful at all. \n\nI had similar experience with uplay, epic game store and even gog. \n\nSteam over the years still offer the best store experience for me.",
            "title_similarity": "0.580829",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h365zfr",
            "score": 1,
            "text": "this made me check if there was a sale   \n\n\nThere in fact is one",
            "title_similarity": "0.5215329",
            "sentiment_compound": 0.0
        },
        {
            "id": "h366b9c",
            "score": 1,
            "text": "Fuck, my replacement card is so slow to return after a whole freaking week.",
            "title_similarity": "0.37228078",
            "sentiment_compound": -0.743
        },
        {
            "id": "h366fzr",
            "score": 1,
            "text": "It’s like buying outs",
            "title_similarity": "0.5414827",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3673fo",
            "score": 1,
            "text": "I bought crysis bundle and it was a huge mistake. Tried to play it and was told the key was bad. They say to contact EA. EA says I have to download origin and then download it from there then it should work on steam. So doing all that it still doesn't work and I contact them again and send the transcript. The next guy says idk why the first one said that but If it won't play on steam it's a steam problem. So I send a ticket and was basically told it's not supported on steam. Like wtf so I've asked for a refund. Bc the keys they gave me to play on origin are the base games and hunter Ed for the 3rd. What I paid for was all the remastered Ed, the deluxe Ed for the 3rd and all the dlc.",
            "title_similarity": "0.6574939",
            "sentiment_compound": -0.848
        },
        {
            "id": "h367l6a",
            "score": 1,
            "text": "HMU when I can sell my game on Steam after I've finished playing it please.",
            "title_similarity": "0.83664215",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h3682an",
            "score": 1,
            "text": "Xbox doesn’t refund digital purchases :(",
            "title_similarity": "0.3942824",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h368byx",
            "score": 6,
            "text": "Wish i knew bout this years ago... when i bought Spore about 45 mins before it went on sale",
            "title_similarity": "0.4922552",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h368i72",
            "score": 1,
            "text": "I literally bought Phasmophobia the day before the sale, I completely forgot what day it was lol. Got it refunded in about 15 minutes.",
            "title_similarity": "0.5145663",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h36946a",
            "score": 3,
            "text": "This also works for sales on Amazon",
            "title_similarity": "0.56601226",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h369n6f",
            "score": 1,
            "text": "Much better than Microsoft. Game wasn't even downloaded and they refused the refund because the key was activated. I couldn't download the game due to their stupid ass launcher and they refused to refund me. They lost a customer that day,. Though I know they don't care in the slightest.",
            "title_similarity": "0.43128532",
            "sentiment_compound": -0.9067
        },
        {
            "id": "h36a2c8",
            "score": 1,
            "text": "Thanks man!\n\nI bought Crusader kings 3, 3 days ago and now it is on sale for 20% off.\n\nCheers.",
            "title_similarity": "0.49455702",
            "sentiment_compound": 0.7424
        },
        {
            "id": "h36a589",
            "score": 1,
            "text": "You can refund a game for any reason if you're a liar",
            "title_similarity": "0.6377039",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h36b9p5",
            "score": 1,
            "text": "This works btw also on other platforms, I had Amazon give me refunds for movies at least 2 times so far, that were cheaper like days after I bought them.",
            "title_similarity": "0.6667868",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h36c47n",
            "score": 1,
            "text": "Why tf don't they just have a system where they can refund you the price difference",
            "title_similarity": "0.70985216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36d5gs",
            "score": 1,
            "text": "I've never even thought about refunding a game bought on Steam but I also don't buy games full price and wait patiently for a fully patched version. I also pay attention to reviews by people I trust, add those games to my wishlist and wait for a deep sale.\n\nI should add I'm not into online competitive anything so that really helps",
            "title_similarity": "0.56793976",
            "sentiment_compound": 0.8078
        },
        {
            "id": "h36dqjc",
            "score": 1,
            "text": "Additional info: Steam's own refund policy explicitly calls this out saying it is not considered abuse of their refund policy:\n> We do not consider it abuse to request a refund on a title that was purchased just before a sale and then immediately rebuying that title for the sale price.\n\nSource: https://store.steampowered.com/steam_refunds/",
            "title_similarity": "0.71662015",
            "sentiment_compound": 0.7741
        },
        {
            "id": "h36dy9x",
            "score": 1,
            "text": "Steam regional pricing are trashed by specific multi-billion video game company. That sucks",
            "title_similarity": "0.5093033",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h36e82r",
            "score": 1,
            "text": "Bought Beat Sabre ..... not on sale",
            "title_similarity": "0.37560195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36ez4y",
            "score": 1,
            "text": "i tried doing this for a game that went on sale right after i bought it and they said no. fml",
            "title_similarity": "0.63372177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36fjcs",
            "score": 1,
            "text": "Too bad I bought FF complete on their site a couple weeks back. Big F",
            "title_similarity": "0.5307727",
            "sentiment_compound": 0.0085
        },
        {
            "id": "h36frys",
            "score": 1,
            "text": "Perfect, bought Sea of Thieves the day before it went on sale",
            "title_similarity": "0.5535604",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h36g2y9",
            "score": 1,
            "text": "Holy. Ty for the info, very beneficial",
            "title_similarity": "0.33601642",
            "sentiment_compound": 0.6997
        },
        {
            "id": "h36g6xh",
            "score": 1,
            "text": "I think I played the game too long. I'm so sad...I bought Undertale finally like 2 weeks ago for $10 and it's 2.99 rn. FML.",
            "title_similarity": "0.50940806",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h36gze6",
            "score": 1,
            "text": "Just did this with mass effect LE",
            "title_similarity": "0.30108762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36h8ew",
            "score": 1,
            "text": "I remember this when I bought Destiny 2. I had spent $74.36 on the Destiny 2: Forsaken + Annual Pass Bundle and not 2 days later it went on sale for $55.77. I became a very happy customer when Blizzard support refunded me the $18.59. This was back in late 2018, and yeah I did look up the info just now to confirm the amounts.",
            "title_similarity": "0.57117814",
            "sentiment_compound": 0.8357
        },
        {
            "id": "h36hv93",
            "score": 1,
            "text": "I will always upvote this for the folks that haven't seen it yet.",
            "title_similarity": "0.43835503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36ixvw",
            "score": 1,
            "text": "I wouldn;t do that, it wouldn;t feel right.\n\nIf I buy something in a store and then tomorrow it;s on special, I don;t go back and demand a different price...",
            "title_similarity": "0.5207813",
            "sentiment_compound": 0.296
        },
        {
            "id": "h36j6cl",
            "score": 1,
            "text": "Not sure if it's been mentioned but the purchase has to fall within 2 hours/14 days just fyi.",
            "title_similarity": "0.39892566",
            "sentiment_compound": 0.1825
        },
        {
            "id": "h36jpu9",
            "score": 1,
            "text": "I did the same thing on amazon. They wouldnt make the difference on a purchase, so i sent it back and bought a new one. Green company my ass.",
            "title_similarity": "0.56510854",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h36k68z",
            "score": 1,
            "text": "Only if you had bought it under 2 weeks and less than 2 hours played.",
            "title_similarity": "0.40662542",
            "sentiment_compound": 0.34
        },
        {
            "id": "h36ke9o",
            "score": 1,
            "text": "I still hate steam.",
            "title_similarity": "0.12934554",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h36lx06",
            "score": 1,
            "text": "Doesnt matter which refund reason you pick, youll get it as long as 2 weeks havent passed since purchase and you havent played it for more than 2 hours",
            "title_similarity": "0.48233968",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h36ndxo",
            "score": 4,
            "text": "My kid bought a game but it won't play well on our shitty system. We have a few of those I think. One did go on sale right after lol. It's been months now",
            "title_similarity": "0.54101586",
            "sentiment_compound": -0.7162
        },
        {
            "id": "h36ntp4",
            "score": 1,
            "text": "not true at all. i have a game i bought 3 days ago for $30 but it’s on sale for $8, but since i played it for five hours they’re not refunding anything at all.",
            "title_similarity": "0.49305138",
            "sentiment_compound": 0.3472
        },
        {
            "id": "h36odqv",
            "score": 1,
            "text": "I love you. Thank you",
            "title_similarity": "0.13166586",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h36p26c",
            "score": 1,
            "text": "This post so the # of comments goes to 421.",
            "title_similarity": "0.18569031",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36p67x",
            "score": 1,
            "text": "I bought csgo for 700 INR and the next week the game became free to play. Of course of course the code didn't even work",
            "title_similarity": "0.52533674",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h36p8ed",
            "score": 1,
            "text": "What's everyone's fav game in the sale?",
            "title_similarity": "0.6259669",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h36plgu",
            "score": 1,
            "text": "Epic makes you google search how to refund.",
            "title_similarity": "0.645859",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36q5rv",
            "score": 1,
            "text": "What if I bought a game on sale on GoG?",
            "title_similarity": "0.6239904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36qvot",
            "score": 1,
            "text": "Just did this two days ago, I love it",
            "title_similarity": "0.31218442",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h36rxpv",
            "score": 2,
            "text": "Bad timing on my end.  Got Warhammer II and all the expensive dlc a few days ago.  Played 50 hours so far.\n\nThe sale reduced the entire purchase to less than half.\n\nAt least I can say I’m supporting the devs?",
            "title_similarity": "0.56415224",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h36sqoi",
            "score": 1,
            "text": "Most places will simply credit you the difference if you ask.  It's not a big deal.",
            "title_similarity": "0.45980018",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h36svw4",
            "score": 1,
            "text": "Just be careful because I believe that when you refund a game you havw to wait a few days before you can use the money you get back",
            "title_similarity": "0.6611874",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h36tcqa",
            "score": 2,
            "text": "Tbh whenever I try refund I think to myself that somehow by choosing that option they'll be like \"that isn't a valid refund reason\" and deny my request. I normally just say it doesn't run on my PC or something similar.",
            "title_similarity": "0.5430394",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h36ttf9",
            "score": 1,
            "text": "Somehow you all got these wrong, it’s below 5 hours, and I has been for an extremely long time. I’ve had three different requests rejected for refunds and they always send an email explaining that the maximum amount of time allowed is 3 hours of game time.",
            "title_similarity": "0.33889708",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h36utrw",
            "score": 1,
            "text": "Is there a sale right now?",
            "title_similarity": "0.5073476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h36w0ag",
            "score": 1,
            "text": "Helpful, man! I did not know this up until now lmao",
            "title_similarity": "0.36184484",
            "sentiment_compound": 0.7901
        },
        {
            "id": "h36wtpo",
            "score": 1,
            "text": "also LPT: if you have spent hours looking for games to play and made a list of it. don't pirate the games then leave only the games in a folder. you're not gonna give a shit about it later because you don't know what the game is. keep a favorited folder of the steam links.",
            "title_similarity": "0.66127145",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h36ww22",
            "score": 1,
            "text": "My husband and I bought Valheim finally days before the Summer Sale. If it was more than $2 off, I'd be upset. Happy to have bought it and they can keep those $4. 😁",
            "title_similarity": "0.5779301",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h36zwk6",
            "score": 1,
            "text": "I had paid full price for AOE2 HD, then 8 days later it went on sale 80% off, opened a ticket and managed to get a refund, then I repurchased aoe2 and got me Witcher 3 GOTY discounted as well.\n\nBest deal ever",
            "title_similarity": "0.5694876",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h370gt1",
            "score": 1,
            "text": "Not sure how it’s gonna change my life but good ~~Life~~ Pro Tip",
            "title_similarity": "0.47469497",
            "sentiment_compound": 0.5218
        },
        {
            "id": "h370yp6",
            "score": 1,
            "text": "r/nonassholedesign ?",
            "title_similarity": "0.20820357",
            "sentiment_compound": 0.0
        },
        {
            "id": "h371v9v",
            "score": 1,
            "text": "Can verify. Ive done this many times. I fucking love you, Gaben.",
            "title_similarity": "0.33302248",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h372js3",
            "score": 1,
            "text": "Friend bought Forza and played for 4 hours cause he forgot the steam summer sale is coming literally that night, happened a few days ago",
            "title_similarity": "0.47073984",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h3757c4",
            "score": 1,
            "text": "Steam's refund policy also states you need to have played the game for less than 2 hours and can only ask for a refund within 14 days of purchase.",
            "title_similarity": "0.58847386",
            "sentiment_compound": 0.34
        },
        {
            "id": "h375a26",
            "score": 1,
            "text": "I don't want to bother with this, let the devs have the money.",
            "title_similarity": "0.37498406",
            "sentiment_compound": 0.2057
        },
        {
            "id": "h377fb9",
            "score": 1,
            "text": "Lord Gaben, our Lord and Savior. Praise be to the mighty library of games bought on sale that I'll never play.",
            "title_similarity": "0.51987416",
            "sentiment_compound": 0.3744
        },
        {
            "id": "h377suu",
            "score": 1,
            "text": "They rejected my request for this a couple years ago when I bought ESO :/",
            "title_similarity": "0.5004865",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h378o3n",
            "score": 1,
            "text": "Holy fuck - thank you!",
            "title_similarity": "0.2611786",
            "sentiment_compound": -0.3164
        },
        {
            "id": "h378qqr",
            "score": 1,
            "text": "Same with getting a game before it comes to ps plus i read",
            "title_similarity": "0.6317404",
            "sentiment_compound": 0.0
        },
        {
            "id": "h37bsju",
            "score": 1,
            "text": "Bigger pro tip, if you can just buy the game anywhere else than steam.",
            "title_similarity": "0.67113173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h37emha",
            "score": 1,
            "text": "Hey Amazon, take note, ya dumb fucks. \n\nThey made me return an item and buy a new one they they shipped me so I can ship them back one of the two because something I got earlier this month went on sale for prime day. \n\n\"We don't price match\"\n\nI mean, technically, you just did. So save the shipping both ways and just give me the twenty bucks off the easy way. \n\nIdiots.",
            "title_similarity": "0.6869885",
            "sentiment_compound": 0.3218
        },
        {
            "id": "h37f72t",
            "score": 1,
            "text": "There are so many games on sale I decided I just wouldn’t go buying everything I like. I am probably just going to play it once and lose some money over it. The deals are really amazing tho",
            "title_similarity": "0.6168705",
            "sentiment_compound": 0.7425
        },
        {
            "id": "h37fet1",
            "score": 1,
            "text": "There’s no shame in pirating average games only to support important ones at day 1, weather an endangered genre (prey 2017, CONTROL) or prove businesses that there’s still demand for linear single player games (Star Wars Jedi fallen order, crash 4)",
            "title_similarity": "0.66664684",
            "sentiment_compound": -0.5017
        },
        {
            "id": "h37gobg",
            "score": 1,
            "text": "I bought the GOTY Fallout 3 and motherfucker won’t run on Windows 10. Wtf. Guess I’ll get a refund?",
            "title_similarity": "0.6555335",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h37gvc7",
            "score": 1,
            "text": "Same thing with league of legends skins lol",
            "title_similarity": "0.43051642",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h37j86r",
            "score": 1,
            "text": "Unless it's a DLC. I bought ffxiv shadowbringers the day before the sale. RIP",
            "title_similarity": "0.6646572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h37k8qx",
            "score": 1,
            "text": "Did this the other day, but all the games were gifts, sooo",
            "title_similarity": "0.5357854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h37nahy",
            "score": 1,
            "text": "Yet they wouldn't give me a refund for cyberpunk. Turns out that they made the first 2 hrs of gameplay work, so I went over the limit for getting a refund yet the steaming dumpster fire that was the rest of the game somehow us fine for not issuing a refund.",
            "title_similarity": "0.57195807",
            "sentiment_compound": -0.296
        },
        {
            "id": "h37r0gg",
            "score": 1,
            "text": "Good to know but I also *only* ever buy games on sale lmao",
            "title_similarity": "0.5230981",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h37s1w5",
            "score": 1,
            "text": "DAMN\nThats like the most useful tip ever",
            "title_similarity": "0.28718448",
            "sentiment_compound": 0.3094
        },
        {
            "id": "h37tgzv",
            "score": 1,
            "text": "Whatttttt?!!?!!?? Wow best LPT!!!!! Thanks for sharing!\n\nUnfortunately all I do is download them and not play the games hmmmm 🥴",
            "title_similarity": "0.53724587",
            "sentiment_compound": 0.9245
        },
        {
            "id": "h37unef",
            "score": 1,
            "text": "You are telling me that I don't have to go to a 4 hours existential crisis because I bought a game that gets a 50% discount after I bought it 2 days ago? DAMN.",
            "title_similarity": "0.5778253",
            "sentiment_compound": -0.8192
        },
        {
            "id": "h37vi28",
            "score": 1,
            "text": "Also the refund has to be requested within 14 days of purchase",
            "title_similarity": "0.44027936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h37xfpp",
            "score": 1,
            "text": "I wish this was true for everything, not just steam. I bought a ps5 for $900 and four days later it came out on Amazon for a good 5 mins for original price",
            "title_similarity": "0.5536021",
            "sentiment_compound": 0.886
        },
        {
            "id": "h37xvgs",
            "score": 1,
            "text": "You mean someone buys games when they are full priced?",
            "title_similarity": "0.65053874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3832ib",
            "score": 1,
            "text": "wow i have been silently getting mad all these years",
            "title_similarity": "0.14101979",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h38ssrq",
            "score": 1,
            "text": "I did that for PlayStation on one of the Fifa games and well, basically they told me to go fuck myself!",
            "title_similarity": "0.56213444",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h38tuxf",
            "score": 1,
            "text": "Hi OP, so I bought Destiny 2 Beyond light for say x amount, i started playing it, almost completed the campaign which was like a total of 7 hours, over 3 days.\nAfter these 3 days I notice the same is on sale for around x/1.5\nWent to refund page, selected that option, requested refunds. They never refunded. Kept saying that playtime is over 2 hours etc.\nWow what a cheat.",
            "title_similarity": "0.5434873",
            "sentiment_compound": 0.6249
        }
    ]
}