{
    "LPT: If you are at work and someone who does not work there asks you for one of your co-workers or when that co-worker's shifts are, do not answer that question. You do not know who that person is or their intentions.\n": [
        {
            "id": "h3dml0r",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.47844312",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h3ds1al",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.3118685"
        },
        {
            "id": "h3e572p",
            "score": -4,
            "text": "Uh yah giving out that info is illegal. Wow, how are so many LPT just common sense.",
            "title_similarity": "0.43834442",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3e7ch9",
            "score": 3,
            "text": "Not a pro tip if it's common policy to withhold that info",
            "title_similarity": "0.5300445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3dywgr",
            "score": -4,
            "text": "Odds are they are just probably trying to get ahold of them for some reason, probably sales related.",
            "title_similarity": "0.49573642",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3epuds",
            "score": 0,
            "text": "Worst reception worker ever.",
            "title_similarity": "0.4560696",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h3enroq",
            "score": 1,
            "text": "This reallly depends on the business. In an office setting, then protect everyone's confidentiality. But if you're the host at a restaurant and a couple comes in asking for their favorite server, I'd have no problem finagling the schedule to make that work out. It's part of how things are run.\n\nSimilarly, while working at a small cafe a woman came in asking for one of my coworkers, who was on a brief break. I suggested that she grab a seat and wait. It was his mother waiting to drop off some cash. In public business settings where anyone can grab a seat and hang out, there's really no working around accommodating people like this unless you feel like kicking out a coworker's loved one.\n\nI also worked at an antique shop where the owner was often on the road. Customers wandered in and asked for him, and I invited them to wait. This was the correct choice every single time.",
            "title_similarity": "0.53592956",
            "sentiment_compound": 0.9398
        },
        {
            "id": "h3dxyh8",
            "score": 2,
            "text": "If someone comes into your work asking for a co-worker, then you can be assured that they are a homicide detective that just wants to ask some questions about where they were that night.",
            "title_similarity": "0.5340049",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3duhv4",
            "score": 2,
            "text": "Wasn’t this a tweet?",
            "title_similarity": "0.2584667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eqcdj",
            "score": -2,
            "text": "This is a bit sad. I'm not saying this tip is wrong. But I have a story with a totally different outcome. Some day an old, very rustic man appeared at the front door of our institute. He wanted to know when one of our female colleagues finished her shift. Our guardian didn't let him pass. I heard the conversation. The guardian asked him if he claimed he knew our colleague so well, why didn't he call her. I intervened, got the man inside. I gave him something to drink and called my colleague. Turns out he was her grandfather. They were estranged since her mother had a fight with him, more than 20 years ago. The old man lived in a remote village and didn't own a phone. He got wind that our colleague graduated and wanted to see her one last time before he died. He travelled 900+ km and wondered around the city asking for directions until he finally found her.\nI'm not saying OP is wrong. But sometimes, some people do not have malicious intents.",
            "title_similarity": "0.6109404",
            "sentiment_compound": -0.9176
        },
        {
            "id": "h3dmt3n",
            "score": 29,
            "text": "Also, in most places it would be completely illegal to give out that information.",
            "title_similarity": "0.44611502",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h3e2t1x",
            "score": 1,
            "text": "I would just say, \"how would I know\", even if I recognized the person",
            "title_similarity": "0.28804487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eb1dx",
            "score": 1,
            "text": "\"Let me get you over to our HR team, they have access to the directory\"",
            "title_similarity": "0.35568047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3epxrq",
            "score": 1,
            "text": "My motto when someone asks for a coworker (typically a female coworker) is \"no one by that name has ever worked here before.\"\nWhen I worked at a restaurant I used this, while said coworker was standing directly behind me. They always eventually give up",
            "title_similarity": "0.6158906",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3e29mu",
            "score": -10,
            "text": "Unless you don't like that person, then you give em all the info.",
            "title_similarity": "0.40220204",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h3ebdpl",
            "score": 2,
            "text": "I would always say \"(s)he's working right now. I can take your name and number and give it to them on their break\" because I mean, they're calling the person's work. Obviously if it was an emergency, that's different. But in general, I'd be as vague as possible.",
            "title_similarity": "0.5326492",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h3ecw1g",
            "score": 2,
            "text": "Life protip: When a nigerian prince e-mails you, make sure to not give them your bank account number. It could be a scam!",
            "title_similarity": "0.49301118",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h3dsc0h",
            "score": 21,
            "text": "A lot of times people want the same SA that they had worked with before. It really depends on the type of store you work at.",
            "title_similarity": "0.47629747",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3e86lh",
            "score": 10,
            "text": "I hoped that this was common sense,  but after reading the comments it should be made law.",
            "title_similarity": "0.3285466",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3el2gx",
            "score": 7,
            "text": "I was a server at a restaurant and a guy came in and asked if one of the cooks was working.  I went to the back and got him.  He got deported.",
            "title_similarity": "0.5227776",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ehz85",
            "score": 0,
            "text": "How is this a LPT? This is something every job I've  had has gone over during introductory training.",
            "title_similarity": "0.2767754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eiu7z",
            "score": 0,
            "text": "When life pro tips are just common sense",
            "title_similarity": "0.25438917",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ekbr2",
            "score": 0,
            "text": "Common sense is a LPT now?",
            "title_similarity": "0.19303986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ekqw2",
            "score": -3,
            "text": "Naw fuck my coworkers. They ain't my friends. I just might go out of my way to give them there addresses and phone numbers too. I can't wait to quit this hellhole.",
            "title_similarity": "0.5950359",
            "sentiment_compound": -0.7231
        },
        {
            "id": "h3eo7x9",
            "score": 3,
            "text": "Thats not policy at most places?\n\n\nThats a fireable offense at all jobs Ive worked at, and ive seen people be fired on the spot for it.\n\n\n\n\nThis belongs in the commin sense bin, not LPT. Pft",
            "title_similarity": "0.5580789",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h3fjhgv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.3075791"
        },
        {
            "id": "h3fjkkw",
            "score": 0,
            "text": "Shouldn’t this be r/duh?",
            "title_similarity": "0.1852633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3e4dhl",
            "score": -14,
            "text": "> You do not know who that person is or their intentions.\n\nWhich is precisely why you shouldn't interfere, maybe it's important, or maybe it's a murderer - not for you to decide, really.  Much more likely to just be innocent...\n\nOf course if a person says hey firewall for me, then of course you do it.  But otherwise it's just as bad to choose intentions either way.",
            "title_similarity": "0.56702983",
            "sentiment_compound": -0.7543
        },
        {
            "id": "h3ejkzy",
            "score": -5,
            "text": "Don't listen to this. As a sales person it helps with closing.",
            "title_similarity": "0.58941174",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3ee0xh",
            "score": 7,
            "text": "Oh my god this happened to me as a hostess. The woman said she was my coworkers mom. Then I found out she had a restraining order against her birth mom who was a crazy drug addict 😬 oops",
            "title_similarity": "0.3343319",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3ebr5o",
            "score": 1,
            "text": "Full agree, even in a sales position. Give them the contact info and let your co-worker know. Proper communication goes a long way",
            "title_similarity": "0.37944627",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3ehm8s",
            "score": 1,
            "text": "SLPT: do this to get rid of a coworker you don't like.\n\nI had a coworker (another manager) who was a real piece of shit. He was 45, sexually harassing (not assaulting) the young female employees (a lot of high school/college kids). He was stealing money from the company. He skipped out on alimony for his two daughters. He was eluding police that were stationed in front of his house, going out the backdoor to get to work. Cops starting calling the workplace - we had teens answering the phones so there was a lot of naivety about this etiquette. When he found out he LOST HIS SHIT on these poor kids, and he implemented a \"policy\" that he was never to be spoken of, not to anyone for any reason. \n\nOne day a call gets through to the manager desk from a detective asking if POS was around and when I told him no, he asked me when would be a better time to call. I straight gave that detective this man's schedule for the next two weeks and my cell number, telling him to text me anytime and I'll give him the schedule and even live updates with pictures if he wanted.\n\nHe ended up getting fired. Not sure why, but it felt great to be part of a good cause.",
            "title_similarity": "0.45794535",
            "sentiment_compound": -0.0176
        },
        {
            "id": "h3ej2jm",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.3118685"
        },
        {
            "id": "h3eld5g",
            "score": -1,
            "text": "Erm.. Why.. or even better: HOW could a person who doesn't belong into the closed and security locked rooms come in there?\n\nThis sounds rather like a heavy violation of security and doesn't sound right from the very beginning. At least to me.",
            "title_similarity": "0.6029892",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h3eu2ur",
            "score": -1,
            "text": "Yeah that's actually illegal. I was taught that at every orientation ever....",
            "title_similarity": "0.27968648",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3eveoq",
            "score": 1,
            "text": "The only info I give out about my employees is their first name. Or at the very least to a disgruntled customer \"Oh, ok I know who that could be.\" Then \"I'll talk to them about (xyz).\" If you want to know when upper management is working next or some one above me cool that's what we bosses have to deal with. Anything beyond that nope. Never last names. Never phone numbers, \"Give me your number I'll have them contact you. If that's not good enough that's on you.\" A requirement where I work is that you display a document that has the full name of the store manager. We started to black out the last name with electrical tape because people would find them on social media and harass them.",
            "title_similarity": "0.6437869",
            "sentiment_compound": -0.1295
        },
        {
            "id": "h3evuw2",
            "score": 1,
            "text": "This is kind of a no shit tip",
            "title_similarity": "0.34165588",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h3eybxa",
            "score": -1,
            "text": "Yea, always live in fear and assume everyone has bad intentions. What a fucked up way to live life. If someone wants you that bad, then they will just wait outside till you show up.",
            "title_similarity": "0.5247631",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h3g24p6",
            "score": -1,
            "text": "This has to rank on one of the lowest LPTs. This screams out there was this one time... First, how did someone who doesn't work there get in the building? Do you not have security?\n\nSecond, if you do not, meaning retail/food service, yea... no shit sherlock. You don't give up that info.\n\nWTF. Are people really this stupid?",
            "title_similarity": "0.66944563",
            "sentiment_compound": -0.9236
        },
        {
            "id": "h3e33w8",
            "score": -7,
            "text": "What if I hate my coworker they're asking about?",
            "title_similarity": "0.63424087",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h3ebkf9",
            "score": 15,
            "text": "Yeah a customer, even if they are a \"regular\", asking this question should be a big red flag.",
            "title_similarity": "0.3266098",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3e4c5u",
            "score": 2,
            "text": "I would just be honest and be like bro I have no idea who that even is let alone their schedule",
            "title_similarity": "0.4939486",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3eb5pl",
            "score": 2,
            "text": "LPT: practice common sense.",
            "title_similarity": "0.17332622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3echtc",
            "score": -2,
            "text": "Unless you REALLY do not like your co-worker ¯\\\\\\_(ツ)\\_/¯",
            "title_similarity": "0.6483503",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h3ecv9l",
            "score": 2,
            "text": "I watched this happen in front of me and I was super freaked out but it all turned out okay and the man was getting his printer repaired by a specific worker",
            "title_similarity": "0.45566338",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3eibna",
            "score": 2,
            "text": "At my work that's straight policy. They say to be polite and take down their info to \"pass on to that person\" but I'm always just like, \"yeah I don't know who that is...\" \n\nI'm not a fucking secretary writing down messages all day.",
            "title_similarity": "0.64266956",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h3ej5t4",
            "score": 2,
            "text": "I was on shift when some random guy just walked in, we had the bay doors open to let in a breeze and dude just waltzed in. I kid you not five people immediately stopped working and went to find a supervisor. Turned out to be homeless man. Other people have tried to sneak into that place but if you didnt have a badge you'd get snitched on fast and the supervisor would swoop in. Like one person broke up with her boyfriend and he kept trying to get into the building to just 'talk' to her. Cops were called, he got violent, cops hauled him off.",
            "title_similarity": "0.539402",
            "sentiment_compound": -0.8047
        },
        {
            "id": "h3ejsd3",
            "score": 2,
            "text": "Obviously.  Don’t give out anyone else’s information to anybody, ever, without their prior permission.",
            "title_similarity": "0.45995685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ebnr8",
            "score": 21,
            "text": "This is actually how I got one of my coworkers nearly killed. I was in the lobby at my job picking up my food and I went back upstairs. I get off the elevator and I see this drop dead gorgeous woman looking lost. Me being the savior that I am, I ask if she needs help. She says her bf works there and gives me his name. I’m like “oh yea I know him, cool guy, let me let him know you’re here.”\n\nShe’s like “no I’m in a hurry I just wanted to drop off these brownies for him” and asked if I could put it on his desk and I did. He ended up in the hospital. \n\n-syphilisnicholas",
            "title_similarity": "0.4539531",
            "sentiment_compound": -0.3559
        },
        {
            "id": "h3e9uvt",
            "score": -2,
            "text": "What if they are the lazy co-worker that nobody likes?",
            "title_similarity": "0.6843605",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3ecwn1",
            "score": 4,
            "text": "It’s amazing how much information you can pull from a clueless co-worker if you just play overly friendly and dumb.\n\nSource: I have repossessed several vehicles this way.",
            "title_similarity": "0.42003024",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3egqta",
            "score": 2,
            "text": "It also depends where you work. Take my old job in restaurants for example. Whenever a customer asked if about a sushi chef, it's normal. If they ask about one of the waitresses, it is creepy.",
            "title_similarity": "0.5520345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3e5404",
            "score": 3,
            "text": "Possibly a stalker",
            "title_similarity": "0.39932084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ebcva",
            "score": 4,
            "text": "Sad that's not common sense, or common company policy... :/",
            "title_similarity": "0.6558242",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h3ehsp4",
            "score": 3,
            "text": "I was at a job once. We had this girl who had worked there as a student assistant for years. She had been going to college for like 6 years and still hadn’t graduated. She was also a mom, she had a kid at 17. So, one day she was like, I’m engaged, I’m leaving town to go get married to this guy who has a job. Peace out. \n\nWe started getting calls about once a week from a collection agency about her unpaid student loans. I was like, seriously I don’t have her number, don’t know where she is, she doesn’t work here anymore, sorry.",
            "title_similarity": "0.491504",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h3eh6tg",
            "score": 4,
            "text": "Don’t give out personal information, yes. Asking for a specific person or when they’ll be in, in my business it’s so that the customer can have some consistency with their interactions.",
            "title_similarity": "0.73686767",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3ehkef",
            "score": 5,
            "text": "I give support and a particularly insistent user called me on my mobile well after hours and also when I was not on call. \n\nI told them I was out of office and that I couldn’t help at that time, and instructed them to page the proper person out, but also found out it was the paging service that gave my person # out… this is grossly inappropriate and extra frustrating for the user, and the person ended up getting fired. That EU tried calling 3 more times so I had to put my phone on DND bc it was from different #’s each time. \n\nTreat all info about coworkers as though its private and protected, always. There’s nearly zero excuse for divulging schedules or contact info, and is super inappropriate to do so.",
            "title_similarity": "0.5548744",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h3dne5w",
            "score": 37,
            "text": "You should also report this to that person and possibly Human Resources depending on the environment.  I know a lot of people don’t trust HR and may think this gets the person reprimanded.",
            "title_similarity": "0.5817925",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h3efiib",
            "score": 6,
            "text": "This solely depends on where you work. The other day I was talking to Chad on the phone at discount tire about some tires and when I went in I asked for him by name since I hadn't seen him yet. The schedule thing is a fuck no for sure though. If you work in an office with no foot traffic then fuck no again. This is not a black and white situation though. Lots of grey area.",
            "title_similarity": "0.6565276",
            "sentiment_compound": -0.924
        },
        {
            "id": "h3e6iq7",
            "score": 7,
            "text": "ty ty i feel like i would be gullible enough to answer especially if they seem nice",
            "title_similarity": "0.19261822",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h3eagp4",
            "score": 9,
            "text": "It's incredibly unprofessional! Had this go down so often with every single new front desk. Very infuriating!",
            "title_similarity": "0.5121",
            "sentiment_compound": -0.8347
        },
        {
            "id": "h3egei6",
            "score": 8,
            "text": "I have a problem with old paid off debts that have been sold and resold and resold, even after it was paid off. I told my manager that if anyone ever calls the shop asking for me, tell them I don't work here. It's a bull shit debt collecting scam. Sure enough the endless calls stopped, and after a few disputes they were off my credit record. \n\nCue about 6 months ago, my manager was on vacation and had a fill in from the other shop. A collector did a cold call to the shop and the fill in said \"yeah he works here but isn't currently available. Can I take a message?\" and the other end just hung up. Within 48 hours my phone was blowing up almost 24 hours a day, and the work phone with people asking for me most of my 8-5. Within 36 hours I had 3 identical collections accounts on my report but under different agencies names. My credit score dropped over 100 points. \n\nThat was 6 months ago and I'm still trying to get it sorted. Credit and collections is nothing more than a bull shit predatory scam aimed at keeping people in \"debt\" till the day they die, and then some.",
            "title_similarity": "0.61719525",
            "sentiment_compound": -0.9581
        },
        {
            "id": "h3ehmyo",
            "score": 11,
            "text": "Just thinking of my local Great Clips here. The schedules change weekly and you can't make appointments. How am I supposed to know when my preferred stylist is there if I don't call and ask?",
            "title_similarity": "0.6297396",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3duch0",
            "score": 31,
            "text": "\"I'm sorry, Starman123 isn't available but I'd be happy to take your name and number so they can return your call.\"",
            "title_similarity": "0.4311841",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h3eif11",
            "score": 15,
            "text": "Work at a subway over the summer. This guy that we had pick up a shift cause we were undermanned was from another store, we’ll call him Alex . A rando calls the store and alex picks up the phone. The rando is pretending to be our franchisee who owns like 15 subways in the area. This rando posing as our franchisee asks for the numbers and info of whoever is working their. Alex, stupidly assuming this was our real franchisee, proceeds to give this guy the personal numbers of not only himself but the assistant manager he was working with, we’ll call here Sarah.\n\nI imagine you can see the problem here, but Alex goes even deeper. The fake franchisee demands Alex tell him how closing is going Alex answers pretty smoothly, but relates that Sarah is letting him go home early for its slow. Fake franchisee calls back after Alex had left and started asking Sarah info like are you alone, how much money is in the safe etc. He also asked what the hue of our meat was, including texting me at 9:45 PM even when I want working. Sarah is now sufficiently freaked out cause she’s alone in a subway with a guy claiming to be our franchisee. He tells her that the money better be ready or he’ll come in personally to oversee what’s happening. Cops are called and an investigation is done and now poor Sarah can’t leave subway until midnight.\n\nDon’t ever give personal information away unless said person is there to consent",
            "title_similarity": "0.50949395",
            "sentiment_compound": -0.2144
        },
        {
            "id": "h3dvgin",
            "score": 367,
            "text": "I just had this happen at work.  Someone showed up, threw out my name, my spouse's name, bunch of personal info about me.  The coworker this person talked to confirmed I work there and that all the info that was thrown out by this person about me was correct.  The coworker told me about it 2 days later- I DO NOT know the person they spoke to!  Management has been \"looking into it\" but there will be no punishment for said coworker as \"she doesn't think it's appropriate for me to live in fear.\"",
            "title_similarity": "0.607433",
            "sentiment_compound": -0.2846
        },
        {
            "id": "h3e9dup",
            "score": 48,
            "text": "This is one of those things which should be obvious but sadly isn't. I guess cuz the sort of victim of something like this means it's prolly relatively young people in public-facing jobs, so they're more eager to please and less... cynical than someone like me.\n\nI hope this reaches enough people to help someone.",
            "title_similarity": "0.4372053",
            "sentiment_compound": 0.9178
        },
        {
            "id": "h3e8xag",
            "score": 19,
            "text": "Google Eddie Deezen the nerd from Grease for the answer to why you don’t even give a minor celebrity your co-workers info",
            "title_similarity": "0.6203575",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3e6y6l",
            "score": 21,
            "text": "\"You want to know eh weatherboy?\"",
            "title_similarity": "0.31085858",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3e8w13",
            "score": 58,
            "text": "For sure. Especially if your coworkers name is Sarah Conner.",
            "title_similarity": "0.25594178",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h3ed82i",
            "score": 60,
            "text": "Yup. Also, if some rando at your place of worship, or someone you even somewhat know but maybe not well asks for the contact info of a fellow congregant without telling you why, maybe don't give it to them. And if by some chance they DO tell you why and that reason is \"I believe G-d is telling me to try to play matchmaker between my son and this girl who barely knows me from shul\"...again, maybe don't give that information without explaining to the girl why said person is asking.\n\n (Happened to me. Spent several weeks dodging a whole family, but especially a super religious mother who was not my own mother and who I hardly knew, who seemed to be jockeying to get their son into a more or less arranged engagement/courtship engagement by Yom Kippur. Honestly a lil traumatic for me. Shit's wild, yo.)",
            "title_similarity": "0.6303208",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h3e83gl",
            "score": 25,
            "text": "I had a father that stalked me at places of work when I left at 18. Almost every place I work made this mistake. Some even have them my full schedule. If it's not about you then dont.",
            "title_similarity": "0.5473348",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h3ecvyz",
            "score": 25,
            "text": "\"I can't give out coworkers availabilities.\" \n\n\nDone.",
            "title_similarity": "0.64388657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3dpsnf",
            "score": 243,
            "text": "Even if you know the person knows the person they’re looking for. Don’t give out information. They could get it from the source if they are on good terms.",
            "title_similarity": "0.5701201",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3ea9hj",
            "score": 61,
            "text": "You would think this is common sense, but it’s terrifying how much info coworkers give out on each other to absolute strangers.",
            "title_similarity": "0.54643446",
            "sentiment_compound": -0.7227
        },
        {
            "id": "h3echhb",
            "score": 60,
            "text": "I got attacked by a psycho ex girlfriend who found her way into our shipping department and asked of so and so was here and I was like \"yeah, here's over there.\" Wrong answer. \"I'm gonna fucking kill him I'm gonna fucking kill him and she shoved me to get to the door. It took 3 of us to hold her down until the police came. We should have let her kill him, rich was a douche.",
            "title_similarity": "0.3917646",
            "sentiment_compound": -0.9516
        },
        {
            "id": "h3e982h",
            "score": 224,
            "text": "I inadvertently was on the opposite end of this one once...\n\nOne of my Fraternity Brothers worked as a waiter up at the 24/7 place off campus.  A few of my non-Greek friends and I use to head up over the weekend to hang out and enjoy their midnight breakfast buffet...\n\nOne time we went up I asked if Kyle was working that night, he wasn't.  I asked the nice older lady who was at the counter if she knew when he was on next....  \"Um, hell no I'm not giving you that information\" was basically her response.\n\nI didn't even think about how creepy & stalker ish I probably sounded until a while later.",
            "title_similarity": "0.48760927",
            "sentiment_compound": 0.068
        },
        {
            "id": "h3eix9c",
            "score": 28,
            "text": "Yes, please don’t do this. I worked as a cashier at a grocery store and had a customer who was stalking me. He would ask for my schedule, ask for my phone number, brought me a teddy bear, and wrote down his number to try to get a coworker to give to me. Luckily the coworker he asked for my schedule caught on and lied and  said I was on vacation. \n\nThis was all when I was 19 and was scary for me because this man seriously thought I was interested in him because I was just being polite.",
            "title_similarity": "0.5422195",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3e8nto",
            "score": 293,
            "text": "So one time my grandmother who I cut contact with tried to come into my workplace TWICE before figuring the day out and coming. My coworkers told her when I worked, and I don't blame them because they had no clue. It was...very awkward.  I had a full fledged breakdown at work, and I really hate people seeing me cry.\n\nI quit two weeks later due to covid reasons but apparently she tried to come back AGAIN after I quit. That time, my coworkers lied and said I wasn't on that weekend.  They learned, and thank god.",
            "title_similarity": "0.56191266",
            "sentiment_compound": -0.4549
        },
        {
            "id": "h3edznb",
            "score": 76,
            "text": "I did this once with a dad who wanted his daughters schedule. I told him no because I didn't know who he was. He got mad. I asked him if he'd want me to tell any middle aged man who claims to be her dad her schedule. He was still mad.\n\nI know I did the right thing. I said hey man ask your daughter.",
            "title_similarity": "0.57123977",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h3ef6os",
            "score": 36,
            "text": "Correct. I’ve had an ex who turned into a dangerous stalker. General rule; don’t talk about people who aren’t there to discuss, don’t give information about people who aren’t there to approve, and don’t bitch about people who aren’t there to counteract. Never fails.",
            "title_similarity": "0.58741474",
            "sentiment_compound": -0.6776
        },
        {
            "id": "h3e8tuf",
            "score": 207,
            "text": "In sales, it's always best to feign ignorance imo.  For instance, I used to work with loans and the loan officers would regularly work with a customer from beginning to end, many times requiring follow-up.  However, I always feigned ignorance about it.  Something like, \"I'll see if I can find that individual, however I don't know anyone by that name.\"  It doesn't denote one way or another if that person works there and it gives you time to find that person and inform them.\n\nThat's my two cents, anyways.",
            "title_similarity": "0.611702",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3e9yqm",
            "score": 203,
            "text": "I worked in a pharmacy chain and was asked by two random men when the store got deliveries (big once weekly stock deliveries). I told them I didn't know when the front of the store got their delivery since it was different than the pharmacy even though we got the delivery on the same day. Never know what people are trying to plan.",
            "title_similarity": "0.55471015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3e5ih8",
            "score": 688,
            "text": "This happened to me and I chewed my boss out hard for it. I said “I don’t care if my best friend walks in here asking for me, you *do not* give out my info.” She was like “seriously?” And I had to explain to her that my best friend has about 20 different ways of getting ahold of me, meaning if she comes into my work asking my coworkers for that information, there’s probably a good reason why I don’t want her to know where I am. \n\nNever, EVER give out your coworker’s personal/schedule info. You never know what people are dealing with or what kind of danger you could be putting them in.",
            "title_similarity": "0.64401513",
            "sentiment_compound": 0.9618
        },
        {
            "id": "h3e77v2",
            "score": 47,
            "text": "Had this happen to me when I worked at a Walgreens in high school. An older man asked a coworker about me and she told him where I was in the store. He turned out to be a pedophile  and kept asking me on a date. Not a fun time tbh",
            "title_similarity": "0.5302323",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h3egdoz",
            "score": 47,
            "text": "I had a friend recently become a manager at a restaurant. He posted a picture of his restaurant’s schedule and tagged all the employees in it. The schedule had the employees first and last name and phone numbers on it. \n\nI commented on the picture that he needed to take the picture down. There’s better ways to send everyone their schedule than posting it on social media.",
            "title_similarity": "0.44524133",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h3dsgey",
            "score": 478,
            "text": "Co-worker of mine’s husband thought we were having an affair. He called the store, and the operator told him what time I was working and what department I would be in. Showed up and threatened me in front of customers, she intervened and they walked off. She never came back to work.\n\nI never saw him again, and the next time I saw her she was working at McDonald’s a few years later.    \n\n“How’s your husband?” I said.    \n“He’s dead.”",
            "title_similarity": "0.5849478",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h3e6l7k",
            "score": 62,
            "text": "People STILL think that customer service equates to interest. I've had people ask for me just to get my number on multiple occasions. Each time that happened it was because a co-worker did not ask who they were and what they needed. They just brought them straight to me.\n\nI hate being put on the spot like that to deny them, potentially avoid them at work, and worry that they'll go further than just asking. It's incredibly uncomfortable and creepy.",
            "title_similarity": "0.69135064",
            "sentiment_compound": -0.7501
        },
        {
            "id": "h3egj61",
            "score": 67,
            "text": "At my old office one of my coworkers had a stalker. She was former TV industry and a total bombshell, and probably the nicest woman you'll ever meet.\n\nSome guy had been stalking her from her old place a few states over. She knew a little bit about him, apparently he was ex-military. He was not in any way considered a friend or acquaintance with her, or even met in person. He was just some guy who insisted because he saw a hot woman on TV that they were destined to be together.\n\nWell apparently, he was Googling her online and her name pinged on our company website. He sent her flowers to the office one day. She notified our office leaders, and about an hour later any reference of her on our website was nuked. Our leads sent out an office-wide email that no one was to give any information to anyone calling for her, and we were instructed to say that no one by her name ever worked with us.",
            "title_similarity": "0.44403332",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3ef2yp",
            "score": 475,
            "text": "I work at a hospital and this happened to one of our housekeepers. She kicked out her abusive husband and he began stalking her. He knew her work schedule so our manager discretely changed it for her, our security guards would escort her to her car after work. Her ex would call and try to get her fired. One night he broke into her house, hid in the closet and murdered her when she came home. He stabbed her and sliced her throat. Her manager called the police the next day when she didn’t show up for work, as she was an excellent and reliable employee. None of us could believe it. The entire hospital mourned her, like it wasn’t unusual to see people weeping and hugging each other in the hallway even months later. She was so sweet and we all felt so angry and sick that no one could protect her. Now we take employee security very seriously, including incidents of violence toward staff from patients, which is on the rise nationwide too. Our hospital bought 3 trained dogs and has started cracking down for employee safety. But domestic violence is still such a threat to women, it is hard to let go of the anger.",
            "title_similarity": "0.4707957",
            "sentiment_compound": -0.9802
        },
        {
            "id": "h3dugdo",
            "score": 3077,
            "text": "I’ve had this happened to me twice at different places I’ve worked. Phone rang and they asked for a co-worker, I told them that they weren’t available (they weren’t around) but that I would take a message, and they insisted on knowing when they would be back. I didn’t give out the info thank god. Both times my co-workers were trying to leave abusive relationships and it was their ex stalking them. Scary shit.",
            "title_similarity": "0.6522701",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h3ed4lb",
            "score": 212,
            "text": "I had this happen. The phone rang with my dad asking if I was at work, I haven't talked to my dad in years so it was weird. I quickly left work and went home cause I didn't feel right and there he was, an old \"friend\" was loading my stuff up in his car. Glad I caught him",
            "title_similarity": "0.5285638",
            "sentiment_compound": 0.6412
        },
        {
            "id": "h3dwmym",
            "score": 132,
            "text": "Used to have this happen to me when I was serving. Usual mildly creepy guy asking when one of the girls was working. I always just said \"I don't know.\" Mostly because I didn't have everyone else's schedule memorized, so I was telling the truth, but also for obvious reasons.",
            "title_similarity": "0.55544984",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h3e9ql4",
            "score": 1239,
            "text": "There was a time when my ex was threatening to kill me,my friends and family.  When he called the restaurant to ask when my shift started, my manager played dumb and said he didn't know anyone by my name. I didn't tell him about my drama, and to this day I am so grateful he played it safe.",
            "title_similarity": "0.5990222",
            "sentiment_compound": 0.3674
        },
        {
            "id": "h3dusxh",
            "score": 1285,
            "text": "“Sorry, I only have access to my own work schedule.”",
            "title_similarity": "0.46503034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3e22o2",
            "score": 3578,
            "text": "I had a coworker give my personal cell phone number to someone to complain to me about something on a shift I wasn't even managing at the time. Needless to say I hung up immediately.",
            "title_similarity": "0.5754955",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3dwkup",
            "score": 457,
            "text": "Or tell them their last name... had this happen to me... DID NOT APPRECIATE",
            "title_similarity": "0.5884939",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h3ds1m6",
            "score": 7208,
            "text": "Just tell them you’re happy to take down their info and pass it along to said coworker",
            "title_similarity": "0.30497378",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h3dwzzg",
            "score": 1,
            "text": "I frequently (but not so politely) tell bill collectors calling for my co-workers to fuck off. No I won't give you their cell or office number. Funny, the bill collector never wants a call back later...",
            "title_similarity": "0.66988015",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h3e9lde",
            "score": 10,
            "text": "Yup they're a stalker.",
            "title_similarity": "0.32062262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ebagv",
            "score": 27,
            "text": "Had a similar situation, one guy was asking me about a girl that I knew. I told him that I don't know her name. Glad I didn't because I didn't even know her name.",
            "title_similarity": "0.616615",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3ebldk",
            "score": 10,
            "text": "Good advice. That's really how many social engineering scams start.",
            "title_similarity": "0.21401057",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h3ebvwe",
            "score": 9,
            "text": "You can always just say it’s against company policy/illegal/unsafe to give out that kind of information. This really should be SOP at any business.",
            "title_similarity": "0.50447255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ec4m8",
            "score": 8,
            "text": "The world is so fucked up.",
            "title_similarity": "0.35941952",
            "sentiment_compound": -0.7661
        },
        {
            "id": "h3eck0i",
            "score": 9,
            "text": "Here's a proper example from No Country for Old Men\nhttps://www.youtube.com/watch?v=mRpHw-GswrI",
            "title_similarity": "0.34267506",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3ecoo4",
            "score": 51,
            "text": "I used to work retail at a women’s lingerie store & this would happen a lot when I was at the register (which is where the phones are). I just always told them that I couldn’t give out any information or verify they were an employee, too many creeps out there. Too many situations of stalkers at that store",
            "title_similarity": "0.6171221",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ed377",
            "score": 2,
            "text": "\"I don't care who you are Mrs. Benson, I ain't telling you where Mr. Benson is.\"",
            "title_similarity": "0.55455947",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h3edllp",
            "score": 8,
            "text": "I used to play dumb a lot and pretend I just didn't know who they were talking about unless it was someone in a manager position.\nI don't miss retail.",
            "title_similarity": "0.6248317",
            "sentiment_compound": -0.2158
        },
        {
            "id": "h3edo8i",
            "score": 5,
            "text": "I barely know when my shifts are let alone my cooworkers",
            "title_similarity": "0.76648575",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3edwh6",
            "score": 54,
            "text": "These days it doesn't even make sense that someone would call a work phone number for someone they are supposedly close to; they would just call the person's cell phone or get them on text/email/slack.  So if someone is calling a work line to get ahold of them they are either not very close or the person has blocked them for a reason.",
            "title_similarity": "0.80800915",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3eepq7",
            "score": 11,
            "text": "This happened at a friend's workplace. She had a few guys stalking her. She had to specifically get me put on a list so I could call and ask if she was working that night.\n\nWhy do people suck so much that this sort of thing is needed. Just...don't stalk people.",
            "title_similarity": "0.6832196",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h3eetfl",
            "score": 1,
            "text": "“Here’s a picture of them oh and you can keep that one because they messed it up by writing a list of their fears on the back.”",
            "title_similarity": "0.43967557",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h3eezc2",
            "score": 1,
            "text": "Had this happen to me. I got jumped after leaving.\n\nThey called and asked if I was working. They then sat and waited. The girl that answered never told me someone called for me either.\nFriends picked me up and the first house we stopped at they got out and jumped me.",
            "title_similarity": "0.487809",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3ef44f",
            "score": 1,
            "text": "I worked at a gym and people would call all the time asking if their son/daughter/SO was there. I'd never give the info and would get yelled at all the time for it but oh well.",
            "title_similarity": "0.55468464",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h3ef8q0",
            "score": 8,
            "text": "ESPECIALLY if you work in the service industry. Creepy, borderline stalker, customers are far more common then you'd expect",
            "title_similarity": "0.37906468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3efbbd",
            "score": 1,
            "text": "I saw this play out in the lobby of The Spaghetti Factory I worked at between dude and busser.\n\nIt ended in fisticuffs and cops, and busser was definitely the hero in that little incident.",
            "title_similarity": "0.2749768",
            "sentiment_compound": 0.8462
        },
        {
            "id": "h3effdy",
            "score": 3,
            "text": "It's disturbingly common for employers to give out their employees personal information 🤯.",
            "title_similarity": "0.50719595",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h3efj4e",
            "score": 1,
            "text": "My coworker did the opposite. Weird guy asked after me while I was out, and she told him, \"He's out sick, but if you really need him he lives 2 blocks from you.\"\n\n\nGuess who knocked on my door that afternoon",
            "title_similarity": "0.5764226",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h3efmwg",
            "score": 1,
            "text": "This is the policy at my job. We don't give out any information like that. I just sent the call to a manager if they insist on talking to someone.",
            "title_similarity": "0.69791967",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3egdql",
            "score": 4,
            "text": "Just to add domestic violence to this also.",
            "title_similarity": "0.29805386",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h3egjnm",
            "score": 1,
            "text": "Bartended for years and learned this quickly. \n\nLike, guy I work with her, I know how creepy you've been, not a chance I'm telling you anyone's schedule.",
            "title_similarity": "0.4460311",
            "sentiment_compound": 0.1926
        },
        {
            "id": "h3egkj3",
            "score": 2,
            "text": "When I worked at target, management told us to never give shift info to anyone that asks. It was much safer that way",
            "title_similarity": "0.57732904",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3egnqo",
            "score": 3,
            "text": "Bold of them to assume i know/give a shit when my co worker shifts are.",
            "title_similarity": "0.57006246",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3egswu",
            "score": 1,
            "text": "Shit, I'll give you the combo to their locker and which shelf their lunch is on.",
            "title_similarity": "0.36696717",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3eh9i5",
            "score": 1,
            "text": "I had my scumbag former landlord come into a restaurant I was working at repeatedly to find out when I was there.  My coworkers gave him my entire schedule.  I ended up having to go to a lawyer to get them to leave me alone.  \n\nIt turns out they owned the building that restaurant was in and most of the surrounding area, but he did leave me alone in the end — I don’t know what the lawyer said to them, but it worked.",
            "title_similarity": "0.5349212",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h3ehcjs",
            "score": 1,
            "text": "My answer to that question is I don’t know when TF so and so works.",
            "title_similarity": "0.49942914",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ehk3j",
            "score": 1,
            "text": "Lol I wouldn't answer that question regardless. Fucking ask them yourself weirdo.",
            "title_similarity": "0.5389327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ehzne",
            "score": 1,
            "text": "I do this whenever asked",
            "title_similarity": "0.07118154",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ei24q",
            "score": 2,
            "text": "Ahh yes, classic Life Pro tips",
            "title_similarity": "0.13801669",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3eihsw",
            "score": 1,
            "text": "World's worst receptionist",
            "title_similarity": "0.46281332",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h3einvd",
            "score": 17,
            "text": "Had someone keep asking for me cuz he had a crush on me. He even reached over the info counter to grab the daily schedule to see when I start my shift. Sometimes he would try to follow me when I was off my shift so I would stay at the store's entrance until he left. Sometimes he wouldn't leave and so the manager would let me out the back through the emergency exit. Luckily I played it safe because shortly after we found out that he is a registered sex offender. He got banned from the store after that. So yes, please don't give out personal information.",
            "title_similarity": "0.59979224",
            "sentiment_compound": 0.7592
        },
        {
            "id": "h3eiopn",
            "score": 1,
            "text": "Company policy where I work.",
            "title_similarity": "0.47107577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eipzi",
            "score": 5,
            "text": "This is probably so easy to do when someone is already in \"service mode\". Good tip, OP.",
            "title_similarity": "0.19431603",
            "sentiment_compound": 0.7678
        },
        {
            "id": "h3eir3s",
            "score": 6,
            "text": "Notify both the person and the supervisor.  Some very bad things have happened over the years at workplaces. Stalkers, and nut jobs in general.  And co-workers have often been victimized along with the intended target.",
            "title_similarity": "0.5766801",
            "sentiment_compound": -0.7645
        },
        {
            "id": "h3eirw7",
            "score": 5,
            "text": "Both my mom and I have had people shot at our places of employment. Both by husbands who had been served divorce papers. Mom was at work when the nurse she knew was shot. I didn't know the person who was shot at my job, only that she was shot in the hallway around the time I would have been in it while getting back from lunch. I think she was also a nurse.",
            "title_similarity": "0.4405111",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eixgn",
            "score": 1,
            "text": "You're most at risk of having this happen as a new employee.",
            "title_similarity": "0.47638467",
            "sentiment_compound": -0.3353
        },
        {
            "id": "h3ej5fk",
            "score": 1,
            "text": "I do know that person though.",
            "title_similarity": "0.08499365",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ejaa2",
            "score": 3,
            "text": "\"Yes, sir/ma'am. Can I interest you in our 9mm discount?\"",
            "title_similarity": "0.21031573",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h3ejeff",
            "score": 29,
            "text": "My boss told us not to even admit someone works for us. (Big brown company, HR) we would never confirm or deny that someone worked for us. \n\n\"I'm trying to get in touch with Jason so and so is he at work yet\"\n\n\"I'm not at liberty to disclose that information.\"\n\nI've had people claim to be police ok hit me with that warrant boo.\n\n99 percent of the time it's a crazy spouse or ex.. or a crazy mom.",
            "title_similarity": "0.55154",
            "sentiment_compound": -0.6036
        },
        {
            "id": "h3ejfe8",
            "score": 1,
            "text": "Just tell them you have no idea but Security has a record of when people arrive on site, let me call one of them over for you.",
            "title_similarity": "0.6199819",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3ejhyk",
            "score": 1,
            "text": "I won’t even tell someone on the phone if my boss is there. Even if he is standing right next to me. Geez",
            "title_similarity": "0.68636453",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eji6c",
            "score": 1,
            "text": "Lol this doesn't apply for me. Car dealership.",
            "title_similarity": "0.5043474",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3ekdby",
            "score": 1,
            "text": "Idk - we have dedicated customer service reps over certain accounts - it’s pretty common for someone from one of those accounts to ask when the person who is most familiar with handling them will be in.",
            "title_similarity": "0.47306788",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h3ekhjz",
            "score": 1,
            "text": "ok but everyone at my work works the hours posted on the door so you didn't really think this one out.",
            "title_similarity": "0.70442945",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h3ekvh4",
            "score": 1,
            "text": "No shit Sherlock. I have people walk in the door and ask the first uniform they see for a member often. If they are in that day I call them on the radio, if they aren’t I pretend to call them on the radio then ask the person if I can take a message.",
            "title_similarity": "0.44811273",
            "sentiment_compound": 0.3662
        },
        {
            "id": "h3ekw6x",
            "score": 1,
            "text": "This has been in every job training I’ve ever done.",
            "title_similarity": "0.20888665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ekz1p",
            "score": 28,
            "text": "Its amazing how many people dont get this. I once had to actually slap the phone out of a coworkers hands when i heard them say \"I have her schedule right here, she..\"",
            "title_similarity": "0.46217483",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h3el63t",
            "score": 1,
            "text": "Is this not common sense?",
            "title_similarity": "0.3584278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3el80c",
            "score": 1,
            "text": "Man, this subreddit is always giving me feelings of dejavue with the reposts lol",
            "title_similarity": "0.36401594",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3elpsc",
            "score": 1,
            "text": "Try this book, \"The Art of Deception\" by Kevin Mitnick and William L. Simon lots of similar LPT.",
            "title_similarity": "0.22599447",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h3eltm2",
            "score": 1,
            "text": "1000000% this!!!\nHad a internet stalker “recognized” me through a friends facebook photo (i didnt/dont have one/ any social media except reddit) they found my place of work and tried asking info about me to my co workers, thankfully they didnt give out any info, but it was not a pleasant experience for me when i found they were there.",
            "title_similarity": "0.5538479",
            "sentiment_compound": -0.3567
        },
        {
            "id": "h3elwbc",
            "score": 5,
            "text": "I’ve solved this problem by not remembering anyone’s names or what their schedule is.",
            "title_similarity": "0.58595973",
            "sentiment_compound": -0.2558
        },
        {
            "id": "h3em2ll",
            "score": 1,
            "text": "That's illegal here.",
            "title_similarity": "0.32253242",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3em6ut",
            "score": 1,
            "text": "Seriously.  People are fuggin sketchy.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n\\*\\*hugz\\*\\*  🤗🤗🤗",
            "title_similarity": "0.32947978",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h3emdrw",
            "score": 1,
            "text": "I think we aren't actually allowed to tell random people such things. Nevertheless, good tip.",
            "title_similarity": "0.48520452",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3emi5b",
            "score": 1,
            "text": "You just have tu use common sense and adapt depending on the workplace. I have clients asking for when another employee comes in but it's because they offer great service/they built a professional relationship.",
            "title_similarity": "0.5669509",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h3emljz",
            "score": 1,
            "text": "I was trying to catch up with my son once when his phone was broken.  I stopped by where he worked and asked if he was there.  Coworker pleasantly enough said, “He’s not here right now.”\n\nSo I followed up with “Do you know when he’s coming in?”\n\nAt that point coworker got very defensive and - politely - said “Who are you and why do you want to know?”\n\nI said “I’m his dad and I got him a new phone.”  Coworker just laughs and says “Thank God you got him a phone.  He’s coming in at 6.”\n\nI’ll never forget how his friend stepped up to protect him from some “stranger.”  Makes me like him  just that much more.",
            "title_similarity": "0.48987693",
            "sentiment_compound": 0.9249
        },
        {
            "id": "h3emo04",
            "score": 1,
            "text": "Sounds like someone needs to confront their stalker themselves.",
            "title_similarity": "0.4964247",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h3emq0q",
            "score": 1,
            "text": "Had someone call who said she was my employee’s number. I gave her nothing. If he doesn’t want to talk to you, why would calling his boss help? I’m not his babysitter",
            "title_similarity": "0.75646293",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h3emr8a",
            "score": 1,
            "text": "Seriously good advice! I work in inpatient behavioral health and a new secretary told some random person who called asking about a certain staff member that they were working that night! Everything was ok, but I walked them out with my pepper spray just in case",
            "title_similarity": "0.40831572",
            "sentiment_compound": 0.4086
        },
        {
            "id": "h3emub0",
            "score": 1,
            "text": "If I am at work, people who don't work there can't even get onto the site, let alone into the building without disclosing full name and contact person. They need a visitor badge, too.",
            "title_similarity": "0.7344284",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3emzc9",
            "score": 1,
            "text": "This. Especially if they’re asking about a female. It could be an ex partner, or a current partner who is stalking them",
            "title_similarity": "0.45521227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3en06d",
            "score": 1,
            "text": "Me: No boss I can't tell you when <coworker's> shifts are. You do no work here\n\nBoss: whut",
            "title_similarity": "0.8620858",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h3en7gj",
            "score": 3,
            "text": "Isnt this common sense? I sure hope it is......",
            "title_similarity": "0.10037692",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3enaxi",
            "score": 1,
            "text": "The correct answer to this scenario (at least in the shop) is “fuck it I know” while shrugging your shoulders",
            "title_similarity": "0.4230234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3enbym",
            "score": 1,
            "text": "If you do give anyone this kind of information, expect to be fired.",
            "title_similarity": "0.472931",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3endqd",
            "score": 1,
            "text": "Same thing if they ask for their full name.\n\nI had a customer ask me for a female employee's last name once. It sounded super creepy and sketchy.",
            "title_similarity": "0.5530938",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3enih0",
            "score": 1,
            "text": "Its not really a life pro tip as much as a rule at every place I have ever worked at",
            "title_similarity": "0.52343667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3enkbn",
            "score": 1,
            "text": "I would always say “I’m not sure if they’re working today, let me check.” And then tell the co worker and let them do what they want with that info.",
            "title_similarity": "0.6228757",
            "sentiment_compound": -0.1685
        },
        {
            "id": "h3enklb",
            "score": 1,
            "text": "Lol, this clearly depends on what kind of job you have. If you went into a dentist to book an appointment and the receptionist wouldn’t tell you when a specific dentist is available, you’d be pretty miffed.",
            "title_similarity": "0.7038456",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h3ent0w",
            "score": 1,
            "text": "I had an ex stalk me because of a naive coworker give out my schedule. Thank you for bringing this to light.",
            "title_similarity": "0.48408318",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h3env2f",
            "score": 1,
            "text": "Happened to me once. It was 2008, I was 16 and some older guy came in claiming he was my dad. My dad died in 1994. Thankfully he never came back while I was working there.",
            "title_similarity": "0.44846305",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3enyzs",
            "score": 1,
            "text": "The answer is: talk to HR/Management/reception /security and move on.",
            "title_similarity": "0.45365608",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3eo0de",
            "score": 1,
            "text": "I just tell them that I don't work there and my perfect disguise didn't work, that way they don't get any funny ideas.",
            "title_similarity": "0.6365886",
            "sentiment_compound": 0.0757
        },
        {
            "id": "h3eo0sa",
            "score": 1,
            "text": "No, at most places it’s against policy.",
            "title_similarity": "0.416085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eo3cr",
            "score": 1,
            "text": "This happened to me. The owner of\nThe store I worked at had a son who was there sometimes and this creepy guy asked him for my phone number.\n\nI was getting calls to help him with his computer at 3 am for like 2 years. \n\nI ended up quitting because of how awkward it was when that weirdo would come in every day.",
            "title_similarity": "0.52649987",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3eoyqe",
            "score": 1,
            "text": "I used to work for the gov and one day after quitting and moving to another state, i got a call from some random former coworker asking me out. Where did he get my number? *from my gov employer*. Unbelievable.",
            "title_similarity": "0.54895514",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3eoz50",
            "score": 1,
            "text": "Our responce is basically refer such requests to reception since 2e Don know this person. Reception has its own script to handle it.",
            "title_similarity": "0.43473017",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3epc3x",
            "score": 1,
            "text": "In a lot of workplaces/states/provinces you disclosing this otherwise confidential information can get you fired, too.",
            "title_similarity": "0.5162677",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3epkqk",
            "score": 1,
            "text": "Life pro tips are for brain dead people.",
            "title_similarity": "0.2679813",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h3eplhn",
            "score": 1,
            "text": "Same with any random person. Do not answer any questions from strangers. You do not know where the nearest toilet is. You don’t know their intentions.",
            "title_similarity": "0.6479318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3epsmo",
            "score": 1,
            "text": "This seems obvious? 🤷‍♀️",
            "title_similarity": "0.039078385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ept53",
            "score": 1,
            "text": "Seabass gets out a 4pm but hangs out in bathroom till 5pm.",
            "title_similarity": "0.2995492",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3epw9r",
            "score": 1,
            "text": "Along the same lines, if they ask for your credit card or other banking info, don't tell them.",
            "title_similarity": "0.54999614",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3eq7b4",
            "score": 1,
            "text": "Sage advice.  Thanks for the reminder! I always forget about the predators in quick reaction situations. Magic tricks still allude me. I know I'm being tricked, but, it's. Hard to figure out how.",
            "title_similarity": "0.48363143",
            "sentiment_compound": -0.2363
        },
        {
            "id": "h3eqfnr",
            "score": 1,
            "text": "Thanks for sharing!",
            "title_similarity": "0.10760544",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h3eqkw1",
            "score": 1,
            "text": "I once called a restaurant to get our waitresses next shift so I could send flowers to the restaurant. I lived .... three? states away but figured I'd take a stab at it. I lied and said \"my wife had not left as generous of a tip and I wanted to drop the rest off.\" I work in restaurants and this should NEVER work. The host actually went and got the service manger, who then LOOKED AT THE SCHEDULE and promptly told me when she was in next!!! \n\nIt's a good thing my intentions weren't absolutely horrible. Little creepy in retrospect. And no. I didn't even get a thank you text. Which....is fine. Lol",
            "title_similarity": "0.54387844",
            "sentiment_compound": 0.4894
        },
        {
            "id": "h3er48j",
            "score": 1,
            "text": "I had people asking for phone numbers of coworker or managers. I just take their info and pass it on. If it's truly urgent and I know it then I will call the person and let them use my work phone.",
            "title_similarity": "0.49381402",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h3er4bq",
            "score": 1,
            "text": "Isn’t this just common sense?",
            "title_similarity": "0.13932118",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3erc1z",
            "score": 1,
            "text": "This could save your coworker's life. Don't talk to anyone else about the work schedule.  It's not their business or yours.",
            "title_similarity": "0.7112494",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3erm7x",
            "score": 1,
            "text": ">If you are at work and someone who does not work there asks you for one of your co-workers...\n\n\"Hi, is Bob in today?\"\n\n**Internal panic**\n**Oh fuck this guy's a serial killer keep calm and don't say shit...**",
            "title_similarity": "0.657708",
            "sentiment_compound": -0.783
        },
        {
            "id": "h3ermgc",
            "score": 1,
            "text": "it kind of worries me that this is a LPT and not common sense.",
            "title_similarity": "0.51782703",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h3erobh",
            "score": 1,
            "text": "That's why I say, \"let me go check the schedule\" then I find the person and ask if they want to talk to whoever asked about them. Then if they say no, go back to the person and just say, \"no I don't see them on the schedule so idk what to tell ya\" works anywhere wether they have a schedule listed or not.",
            "title_similarity": "0.66107666",
            "sentiment_compound": -0.1447
        },
        {
            "id": "h3erolu",
            "score": 1,
            "text": "100%!  As a small child, my mom and I lived in a battered women's shelter. My father was a grade A manipulative violent fucker who liked taking his anger out on my mom. (remember the plot of Kindergarten Cop...yeah I was that kid in school, hiding from my father) \n\nMuch later (and in another state) when I was around 17 I had just started my high school job as a grocery cashier.  My father found out where I went to school and had been rejected at the school office when he asked to see me.  Some how he then then found out where I worked.  He proceeded to try to bribe and harass my coworkers for my number or work schedule until management threatened to call the cops.  I was thankful for people unknowingly protecting me and my mom  from that bastard.\n\nFYI: Later, as an adult, I tried to see if he had changed at all...he hadn't",
            "title_similarity": "0.4671131",
            "sentiment_compound": -0.9631
        },
        {
            "id": "h3erowu",
            "score": 1,
            "text": "I once had a dude come up to me and start a conversation. I was polite, but when he asked me what my hours were I told him they were always changing and left. Old men can be so creepy sometimes.",
            "title_similarity": "0.5282936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3erthu",
            "score": 1,
            "text": "Yea, did this and got yelled at because it ended up being a bosses boyfriend. Like sorry I don’t know the whole relationship status of a lady I see maybe once a week and who’s 40 years older than me.",
            "title_similarity": "0.49634984",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3ervf7",
            "score": 1,
            "text": "You just gotta say you can't deny or confirm who is and isn't employed at this location and any employment verification is required to be in writing. Usually if someone is applying for an apartment or shady car loan they might call but these places also have a written form for management to fill out. Can't just be telling people who's there and who's not.\n\nIt's not safe to say someone is even employed there because it could be a stalker or crazy ex or anything that the employee doesn't want knowing where they work. They might have heard like oh that person is working at \"insert store\" then their stalker is just calling every of that store to see which location.",
            "title_similarity": "0.73842615",
            "sentiment_compound": 0.4396
        },
        {
            "id": "h3erxtx",
            "score": 1,
            "text": "unless you work at a strip club",
            "title_similarity": "0.43374318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3es2nf",
            "score": 1,
            "text": "In the US it is illegal to give that info out",
            "title_similarity": "0.50669765",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3es4n8",
            "score": 1,
            "text": "We can’t give out no information.",
            "title_similarity": "0.49057087",
            "sentiment_compound": -0.296
        },
        {
            "id": "h3es4vy",
            "score": 1,
            "text": "You shouldn't even offer to take a message, because that can also confirm that they work there. This is the 101 on data protection at our workplace. You should neither confirm or deny such a person is known to the staff. Same about emails or even responding to emails from colleagues that come from their personal accounts.",
            "title_similarity": "0.70125353",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h3es5ki",
            "score": 1,
            "text": "My old job some dumbass decided to beef with someone and tell him where he works. Wel he showed up firing off rounds when people were leaving work. Don’t be stupid like this guy",
            "title_similarity": "0.5648689",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h3es8a1",
            "score": 1,
            "text": "Related pro tip… if you’re at work, and the recently estranged husband of your long-time close friend and colleague calls on the phone using a fake name to get through to you without your close friend and colleague finding out, because you work in the next office along the corridor, don’t spend half an hour on the phone telling him everything she’s been doing and who she’s been with over the past few days. Just hang up and tell your close friend and colleague that her estranged husband has tried to contact you using overt means, so she can let the police know that he is still harassing her.\n\nThe consequences of carrying out that conversation, and not telling your good friend and colleague what happened could result in the estranged husband of your good friend and colleague trying to kill your good friend and colleague. That’s “ex-friend and nearly ex-colleague”.\n\nTrue story. The woman didn’t do it to be a bitch, she thought she was genuinely helping. She was utterly stunned that her behaviour was inappropriate despite knowing that he had been harassing and threatening the close friend, and that he had been violent to her. She thought she could “help them get back together, because that’s what a friend should do”.",
            "title_similarity": "0.5791093",
            "sentiment_compound": -0.1096
        },
        {
            "id": "h3es95y",
            "score": 1,
            "text": "most places i’ve worked drill this into us. at my current job, we always have to say “they’re not here but i can let them know you stopped by” then ask for their name. if they refuse to give their name, we look at the type of vehicle to pass the info onto who they were looking for. you can’t tell the person when your coworker has a shift, either. telling someone your coworker’s shift times will get you fired faster than selling a 12 year old cigarettes",
            "title_similarity": "0.58853745",
            "sentiment_compound": -0.8765
        },
        {
            "id": "h3es9ew",
            "score": 1,
            "text": "Lpt: never turn around nor answer when someone shouts your name in a public place. Also if someone calls you and and asks for someone else, just say wrong number but dont give out your own info, not even your name, even if they insist. Same if someone approaches you \" thinking you were someone else\"",
            "title_similarity": "0.65349233",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h3es9iz",
            "score": 2,
            "text": "We solved that at my work by nobody even knowing when they were supposed to be working.",
            "title_similarity": "0.66678023",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3es9sy",
            "score": 2,
            "text": "Even if it's not something super nefarious, it's very likely to be a process server. Fuck that",
            "title_similarity": "0.3670875",
            "sentiment_compound": -0.7681
        },
        {
            "id": "h3esbst",
            "score": 1,
            "text": "In my late teens I worked in fine dining restaurants. Clubs, events, etc.. \nthe women I worked with where all very beautiful, once I turned 21yrs old the owner (privately owned) made me a bartender. Am telling you every weekend you’d have 2 or 3 different guys asking those types of questions. About same chick. Made me very worried honestly. But once I got Lil older I started dating her. Found out why. She would flirt while working, of course for our tips but, she’d do it while not at work. Made a lot of sense to me. \nBe careful ladies!!!",
            "title_similarity": "0.35171258",
            "sentiment_compound": 0.7323
        },
        {
            "id": "h3esft3",
            "score": 1,
            "text": "it never even occurred to me that this happened so often",
            "title_similarity": "0.47662473",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3eshuj",
            "score": 1,
            "text": "Meh.  More than once I've needed say to cancel a bill or something that is just barely more complicated than every other transaction.  Tina is the only one who does it, but Tina is the owner's niece and only works 2 days a week with no schedule.  And no, Tina will not just call you back and tell you her schedule herself.  \n\nPicture this.  \n\nYou: yeah, I need your company to do this thing that you do.\n\nWorker 1:  Yeah, that's not my job, You need Tony, he's not here.\n\nYou:  OK, when will he be back?\n\nWorker 1:  I take reddit seriously and I do not know your intentions so I won't tell you.\n\nYou:  OK, I'll just guess, thanks\n\nYou: 2 days later, Hi worker #2, I need Tony, is he in today?\n\nWorker 2:  I'm calling the police.\n\nI want Todd to cut my hair, Brandon to make my cocktails, Tony to weld my widget, I want Rick to get his commission on the couch I'm buying blablabla.  \n\nI'm not saying answer any question no matter what, but use some common sense.  \"When will so-and-so be back?\" is a perfectly normal business question far more often than it is something sinister.  I'm sure there are bad people out there, but seriously, how many times have you asked about someone's schedule throughout your life?  And how many people have you kidnapped?",
            "title_similarity": "0.58000505",
            "sentiment_compound": -0.3118
        },
        {
            "id": "h3esilg",
            "score": 1,
            "text": "I feel like a lot of people in here think they're special or something when more often than not I doubt youre worth the time to be stalked by someone. People need to get over themselves.",
            "title_similarity": "0.5403044",
            "sentiment_compound": 0.8025
        },
        {
            "id": "h3estwb",
            "score": 1,
            "text": "On the flip side, if you don't like this co-worker or you want his job. Give as much detail as possible 😅",
            "title_similarity": "0.58631027",
            "sentiment_compound": 0.1754
        },
        {
            "id": "h3esudg",
            "score": 1,
            "text": "Thank you for posting this!! I once had a stalker who asked for my schedule and they actually gave it to him. The worst part is, he said he was my boyfriend when they asked who he was",
            "title_similarity": "0.43550414",
            "sentiment_compound": -0.4912
        },
        {
            "id": "h3esuto",
            "score": 1,
            "text": "that sounds like step 3 from a bad guy's plan trying to overthrow a corporation on an action film",
            "title_similarity": "0.30266845",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3esvoy",
            "score": 1,
            "text": "I thought this is what everyone is trained to do???? Unless it's known family, I was trained to never give out ANY personal info on any of our staff. If they insist, you ask for their details and assure them you'll pass on their message. If they won't leave their details and it happens more than once, talk to staff member and see if they want to go to the cops.",
            "title_similarity": "0.5948404",
            "sentiment_compound": 0.587
        },
        {
            "id": "h3esycp",
            "score": 1,
            "text": "*Did you not hear me? We can't give out no information.*",
            "title_similarity": "0.58628726",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h3etfso",
            "score": 1,
            "text": "Does this really need to be an LPT? Isn't this just common sense?",
            "title_similarity": "0.2638798",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3etocw",
            "score": 1,
            "text": "I was out working switching cars in the railyard when my wife came by the depot to bring me lunch. The door to the office had an electronic lock and she didn't know the code to get in. She asked one of my coworkers sitting outside if I was there. He didn't know she was my wife and he told her I wasn't working today. She said his car is over there in the parking lot. He said he's working out of town. She then explained who she was and why she was there. My coworker took my food inside and told me what happened when I came in for lunch. He said \"I didn't know who she was and I wasn't telling her shit.\" I just laughed and thanked him for looking out for me. \n\nAt that yard they were very careful about talking to anyone they didn't know and who they let in because a few years prior someone's spouse or boyfriend came in the unlocked door and shot his wife/girlfriend.",
            "title_similarity": "0.6136656",
            "sentiment_compound": 0.8663
        },
        {
            "id": "h3etp7j",
            "score": 1,
            "text": "As if I would know anything about my coworkers, let alone when their shifts are.",
            "title_similarity": "0.75933975",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3etq9c",
            "score": 1,
            "text": "Adding here that if you get someone's number through work because you have to contact them outside work for work-related things, don't hit them with a 'u up?' at 3am.",
            "title_similarity": "0.6984178",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3ett0b",
            "score": 1,
            "text": "Pretty sure I violated this rule at least once as a teen working at a pizza place. Feels bad thinking back on it. Good tip.",
            "title_similarity": "0.46455932",
            "sentiment_compound": 0.128
        },
        {
            "id": "h3etyv2",
            "score": 1,
            "text": "This. I fear the day that my father calls up my workplace and asks for my info. That’s why i never put anything like that on the internet that he can see. I just moved to a new apartment, and I’m already afraid he’ll  find me and approach me since there’s no longer the protection of the dorms.",
            "title_similarity": "0.68230563",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h3etzio",
            "score": 1,
            "text": "In my last workplace, there was only ever one person there at a time (basically a kiosk in a gas station). There were four of us who worked there and we all had our “stalkers”: customers who would only come in while a particular person was working. If one of us went on holidays or maternity leave, and a “stalker” came in, we adopted a policy to say, “they’ll be back in December” regardless of the time of year. It replaced, “they died” when that phrase backfired…",
            "title_similarity": "0.48147553",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3eu3km",
            "score": 1,
            "text": "Absolutely, I worked in retail for a while and one of my coworkers had a stalker(ish?) basically this person would come in several times a week hoping to see my coworker and have them help them shop. The guy was super creepy and would also ask other employees when she was working this week. Eventually management banned him from the store and can be arrested for entering again!",
            "title_similarity": "0.61280024",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h3eu54a",
            "score": 1,
            "text": "We have a very specific issue. I can't let anyone in my office u less they know who they are after and after iv confirmed with that person. If they need a specific room of our office I have to escort them to it.  The fun  of aerospace design.",
            "title_similarity": "0.5925223",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h3euf73",
            "score": 1,
            "text": "I understand the intention here and agree, but I can't help but point out that this can become a r/unethicallifeprotip if you work in commission sales.",
            "title_similarity": "0.3434379",
            "sentiment_compound": -0.2817
        },
        {
            "id": "h3eui65",
            "score": 1,
            "text": "Had to get a restraining order out after a random guy saw me walk into work & asked our receptionist my name and what my work schedule was. She thought he was “cute” and gave him my info- meanwhile I wound up dealing with a crazy stalker who followed me home, all over town, and threatened to murder me. It was a nightmare of a situation and I eventually moved out of state, having to jump through hurdles to keep my location as private as possible. He’s violated the RO multiple times but none of them were deemed worthy of jail time despite the murder threats. Also found out later that multiple women in the area had ROs against him after he came to their workplace and started stalking them.",
            "title_similarity": "0.51576257",
            "sentiment_compound": 0.7355
        },
        {
            "id": "h3eukiz",
            "score": 1,
            "text": "Yeah learned this from jack reacher",
            "title_similarity": "0.2569179",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3eun8d",
            "score": 1,
            "text": "This is why I don't send emails to external stakeholders from my direct work email address, only from a group inbox. One too many times, the case manager cc'd their client in the email, which meant that the client had my direct email and could continue to contact me about their matter long after I'd completed it. Now when I'm asked for my direct work email by case managers, service providers etc who haven't sent across their documents prior to their meeting with me, the answer is a firm NO.\n\nSo glad I work from home and most of my meetings are on Skype or phone calls...",
            "title_similarity": "0.5509174",
            "sentiment_compound": 0.608
        },
        {
            "id": "h3eupc3",
            "score": 1,
            "text": "I guess youre right but when you work in retail sales with commission its becuase we have customers who like only dealing with certain sales people, are continuing on a sale or somone who has expert product knowlage in a particular area. Never had an issue saying when they would next be in.",
            "title_similarity": "0.50865257",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h3ev0zw",
            "score": 2,
            "text": "Ah something I can answer. One time at work a staff member boyfriend called asking if she was at work. Boss didn’t know and just said yes. The bf came into work and beat this girl up in a residents room. So now the job won’t confirm to anyone.",
            "title_similarity": "0.6910105",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3evata",
            "score": 1,
            "text": "But what if that co-worker is really annoying… They could disappear forever! Win win!",
            "title_similarity": "0.49141133",
            "sentiment_compound": 0.8918
        },
        {
            "id": "h3evjnn",
            "score": 1,
            "text": "Best Case Scenario: It's a Karen trying to complain about something.\n\nWorst Case Scenario: It's a stalker or a disgruntled ex trying to find an opportunity to harm them.",
            "title_similarity": "0.5260632",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h3evlmt",
            "score": 1,
            "text": "Dr. Crane isn't here right now, but if you'd like to make an appointment...",
            "title_similarity": "0.6850636",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h3evnpi",
            "score": 1,
            "text": "We don’t even have our return date on our out of offices for external customers, we were asked to change it quite a while ago. Also, never share social media posts looking for someone unless it’s been issued by the Police. If it’s someone looking for their long lost relative, tell the person they are looking for and not the person doing the looking. It could be a stalker or an abusive partner.",
            "title_similarity": "0.68011034",
            "sentiment_compound": -0.812
        },
        {
            "id": "h3evy16",
            "score": 1,
            "text": "That's part of my onboarding! Under no circumstances should anyone share that information with anyone, ever. If they know the person well enough, they can ask that person when they work. Otherwise, too bad.",
            "title_similarity": "0.67770576",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h3ew56f",
            "score": 1,
            "text": "Yep I had a coworker answer the question about a different coworker. Her ex-husband who she had a restraining order against found her and smashed up her car and did some other things. She had to leave for a while and just before she got back we all were briefed on it and the \"do not answer this question\" thing.",
            "title_similarity": "0.5009285",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3ew582",
            "score": 1,
            "text": "In some countries this is also illegal! For example in the Netherlands with the privacy laws you are not allowed to give this kind of information",
            "title_similarity": "0.53854394",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h3ew6t8",
            "score": 1,
            "text": "This should be a no brainer.  I used to work at a hotel and it happened frequently.  Most of the askers seemed innocuous enough.  But my answer was always *\"I'm sorry but I'm not at liberty to disclose that information.\"*   It was such a no brainer I never got any push back even from the ones that seemed suspicious.",
            "title_similarity": "0.5790224",
            "sentiment_compound": -0.8948
        },
        {
            "id": "h3ew85c",
            "score": 1,
            "text": "I lied to a coworkers sibling for this very reason",
            "title_similarity": "0.4395058",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h3ewa9w",
            "score": 1,
            "text": "Also, water is wet. LPT is on fire recently!",
            "title_similarity": "0.12603402",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h3ewj1n",
            "score": 1,
            "text": "That’s exactly how my wife and I met 19 years ago. \nI was a bartender. She came in and we chatted a bit. Couple days later she came back on a different shift and asked female bartender that was working when my next shift was. Thank god that bartender wasn’t you and she told her. Next shift that cutie came in to see me and I asked her out. We have now been happily together for almost twenty years. I will always be grateful to my coworker for the assist. \nYou’re an idiot.",
            "title_similarity": "0.37681812",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h3ewlm3",
            "score": 1,
            "text": "Long ago I worked at popular drive-in chain as a trainer, and I tried to stress to new employees to never give another employee's personal info to a customer.  Name, phone number, scheduled shifts, anything.  But surprise surprise, nobody seemed to understand why that was important, and thus immediately forgot about it until a horror story of some sort came up.  \n\nLike the time we had a little old lady show up and ask an employee if another carhop was there, claiming she was her grandmother.  Employee said \"yeah she's here let me go get her\" and went to bring out the carhop.  Carhop looked like she'd seen a ghost, and sat down at a table on the patio to talk to her.  Eventually the General Manager came outside to see why the newest carhop was sitting down for random family time, and brought her back inside with the intent of disciplining her.  Instead the poor girl almost broke down in tears, telling him how that was her crazy grandmother who kidnapped her when she was a kid, she had no idea how she'd managed to track her down, and she needed to call her family right away.  GM was, thankfully, a lot less interested in punishing her after that...\n\nIt's a weird world out there, folks.  Don't ever let your guard down, and definitely don't rip someone else's guard down by giving out their info.",
            "title_similarity": "0.5787702",
            "sentiment_compound": 0.0247
        },
        {
            "id": "h3ewly9",
            "score": 1,
            "text": "Why is everybody ignoring the first part? If a customer simply asks for a coworker you don't answer that question?\n\nCustomer: \"Hello, can I speak with Mr. Smith?\"\nEmployee: \"....\"",
            "title_similarity": "0.76686156",
            "sentiment_compound": -0.5007
        },
        {
            "id": "h3ewq6n",
            "score": 1,
            "text": "General LPT is solid, but I see my line of work as an exception. I work in sales and helping communicate when another salesperson may be in to a customer can be helpful. In most cases I have popped the caller ID # into the database and know it’s a customer though. So… perhaps LPT still stands here.",
            "title_similarity": "0.45688885",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3ewy8z",
            "score": 1,
            "text": "I work in a primarily female retail workplace, during a meeting one of my male coworkers brought to everyone's attention that a lot of customers had been asking when certain female employees were working next and not to tell them. Every possibility there was no ill will and they'd just been asking that person for advice before so they knew what was up but yeah, not a few times there's been customers getting a bit too touchy feely with female employees so it's a good idea not to tell them so to be safe.",
            "title_similarity": "0.6015079",
            "sentiment_compound": 0.9261
        },
        {
            "id": "h3ex18i",
            "score": 1,
            "text": "So fucking salty. This is not a pro tip, this is just common sense",
            "title_similarity": "0.30455244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3exg92",
            "score": 1,
            "text": "Yep. This shit is important. Had a stalker call my last place of work for years over a girl that worked there. He always asked when she worked next, what was her number, and other creepy questions.",
            "title_similarity": "0.520687",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3exh9i",
            "score": 1,
            "text": "It can happen very innocently too; it’s not uncommon for me to receive a business call for a colleague and take a message, but I am so careful to never say anything too specific regarding expected time frame my colleague is expected back because people are simply just batshit crazy…",
            "title_similarity": "0.53225505",
            "sentiment_compound": 0.5455
        },
        {
            "id": "h3exl3f",
            "score": 1,
            "text": "Wow I'm a dick.\n\nThank you for this LPT. Did not know this was a bad thing.",
            "title_similarity": "0.38045588",
            "sentiment_compound": -0.128
        },
        {
            "id": "h3exl3p",
            "score": 1,
            "text": "My creepy neighbor once was at my workplace and saw me on my desk. He asked a coworker for my name because he wasn't sure it was me. My coworker just gave him a totally wrong name and asked him to leave.",
            "title_similarity": "0.6566367",
            "sentiment_compound": -0.6762
        },
        {
            "id": "h3exm4h",
            "score": 1,
            "text": "Not in finance but people from the finance department always contact me after working hours to ask me on stuff that I need to refer to. Even the head if finance once called me and ask, \"is this not your personal line? Why won't you answer your phone?\". Messaged him to call my extension if he needed anything and blocked him and other people from finance after that",
            "title_similarity": "0.6035439",
            "sentiment_compound": -0.4606
        },
        {
            "id": "h3exobo",
            "score": 1,
            "text": "It is not a pro tip, it is common sense (and a law in the EU). Don't give other peoples' personal data unless explicitely permitted.",
            "title_similarity": "0.43201637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3exv0b",
            "score": 1,
            "text": "\"How can I help you?\"   \n\"Again, I'm sorry, how can I help you reach them?\"  \n  \n(Someone across the room recognises them) \"Sam\"!  \n  \n\"Sorry Sam, just due diligence, hope you understand. I'd do the same for yourself. Did you get through the door okay? (Which one and how)\"",
            "title_similarity": "0.40107378",
            "sentiment_compound": 0.8602
        },
        {
            "id": "h3exxx2",
            "score": 1,
            "text": "Been told this for the last 20 years - we can’t say if someone is in the building or not . Safety first but a bit of common sense really .",
            "title_similarity": "0.4443406",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h3ey1lj",
            "score": 1,
            "text": "This is literally taught on Day 1 in every job I've ever had and hammered home constantly and repeatedly.  \n\nI'm shocked that anyone still makes this mistake.",
            "title_similarity": "0.3603597",
            "sentiment_compound": -0.6187
        },
        {
            "id": "h3ey93y",
            "score": 1,
            "text": "I remember being told this by someone years ago and it really stuck with me (a coworker had an ex that was really stalkerish so it was mentioned by my manager). If the person asks when they'll be in next I just tell them I'm not \"allowed\" to disclose that info, so it appears as if I'm afraid of getting in trouble rather than inadvertently hinting at suspicion.",
            "title_similarity": "0.6801805",
            "sentiment_compound": -0.7645
        },
        {
            "id": "h3eyiz7",
            "score": 1,
            "text": "This reminds me of a similar situation I was very often put in.  I had a job a hotel and people would call all the time asking to be connected to so and so's room or ask if people were staying there. I would even get sketched out by people who called with pretenses like, \"this is *blank* from trivago calling to verify *blank's* reservation.\" I would always demand confirmation numbers before moving forward. What's stopping a disgruntled spouse who saw a hit from a travel website on their credit card from calling every hotel in town with this same prompt? I would similarly ask to take their info and check and get back to them or pass it along if I happened to see them. To be fair the sketchiness was also compounded by the fact I mostly worked nights and these calls would happen between 11pm and 7am.",
            "title_similarity": "0.4424777",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h3eym4z",
            "score": 1,
            "text": "Yep. Just say \"I'm sorry I don't really know you'd have to check with them\"",
            "title_similarity": "0.53385913",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h3eywp1",
            "score": 1,
            "text": "It’s just common sense",
            "title_similarity": "0.09639509",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ez77q",
            "score": 1,
            "text": "Its as easy as \"Sorry, Im not allowed to give out personal information\"",
            "title_similarity": "0.4302981",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h3ezc6o",
            "score": 1,
            "text": "This isn't a LPT this is illegal 🤣",
            "title_similarity": "0.38467202",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3f00yb",
            "score": 1,
            "text": "I answer honestly if I see them carrying a knife.  I'm a man of principle, I hate guns.",
            "title_similarity": "0.36095688",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h3f02vq",
            "score": 1,
            "text": "Take their contact information and give them to your co-worker instead so he/she can make that decision!",
            "title_similarity": "0.54630876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f0851",
            "score": 1,
            "text": "Jokes on them, I don't work here either.",
            "title_similarity": "0.6092719",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3f0bt7",
            "score": 1,
            "text": "I work for the mart of walls and company policy does not allow us to give out personal information. If someone wants someone else to know their phone number,schedule or whatever they can tell them.  Pissed off a few here and there when I just played dumb even though I knew what they were asking.",
            "title_similarity": "0.70851624",
            "sentiment_compound": -0.7761
        },
        {
            "id": "h3f0d0e",
            "score": 1,
            "text": "No never answer especially if you you like that coworker you never know and I simply don’t trust people",
            "title_similarity": "0.7401006",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h3f0rhi",
            "score": 1,
            "text": "Another approach, one that tends to throw people off because its so unusual these days: honest, direct brevity.\n\nCaller: hi, I’m a friend of so-so and so’s, can you tell me the next tine they’ll be working\nYou:  no, I’m not going to do that\nCaller: what? Huh?\nYou: was there anything else I can help with with?\n\nNo apologies, no script. Just direct answers to their questions. Its not your job to reason with the unreasonable. Property delivered, its kind not rude.\n\nThese questions might not just indicate a potential threat to so-and-so, they could be an attempt at social engineering and the start of a threat to you or the company",
            "title_similarity": "0.64084363",
            "sentiment_compound": 0.818
        },
        {
            "id": "h3f13q8",
            "score": 1,
            "text": "I once gave my leads info to our SM on reflex and I regret it to this day",
            "title_similarity": "0.50041515",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h3f1d4w",
            "score": 1,
            "text": "I'm sure in many cases they could be prosecuted for breaching data protection",
            "title_similarity": "0.18201832",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3f1jji",
            "score": 1,
            "text": "I would just scream begone rapist and carry on with my day.",
            "title_similarity": "0.30294392",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h3f1km8",
            "score": 1,
            "text": "Pretty sure this is the law. At least where I live.",
            "title_similarity": "0.1951652",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h3f1mzz",
            "score": 1,
            "text": "Don't get me started. I moved to a small town about 5 years ago. When I first moved here I wouldn't of asked for someone's personal contact details. Of course you don't give out personal information. I'm still uncomfortable and surprised when people keep offering them. 'oh you've got Mandy's home number haven't you?'.  \nBut hey, I guess it goes with the dropping things off on the front porch and I'll pay next time I'm in town thing.",
            "title_similarity": "0.50455844",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3f1ukq",
            "score": 1,
            "text": "As an IT guy, when you see someone a place they dont belong or you think they dont. Stop them and question them. This is going to put them on the back foot even if they belong there. However, its also going to put people who are doing the wrong thing on their back foot too. Likely they will run away unless they have guile. Then they will try to talk their way out of it. Look for clues to false information. Ask for their badge/id for the building, or ask which key they used to a door. If its a door thats typically unlocked and they tell you a key or that it was unlocked. Play along with them, go back to that door as you go message someone in your management. \n\nThis sounds dangerous. However, if a person is in a place they shouldnt be they are going to be one of two things. 1: they didnt bring any weapons and rely on the \"man with a clipboard\" rule to get around. 2: They were already going to come in loud and violent. If they made it to you without being loud and violent. They for sure are not going to start now. They are going to try at that point to extract from the building. Even if it means running as soon as you turn around.",
            "title_similarity": "0.5811514",
            "sentiment_compound": -0.7909
        },
        {
            "id": "h3f23ol",
            "score": 1,
            "text": "I call this \"be like a router\"",
            "title_similarity": "0.17127609",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3f2f6e",
            "score": 1,
            "text": "I had this yesterday, just kindly explain it's illegal and violates privacy laws",
            "title_similarity": "0.43944454",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h3f2p8m",
            "score": 1,
            "text": "I work in a police department, and I get calls either for the Chief or one of the detectives regularly. If the chief/detective isn't in the station, I tell the caller that, and that I can transfer them to their voicemail. Occasionally, they'll say, \"Well, I'm so-and-so, and I've been friends with Chief/Detective for 'x' years! Can you just give me their cell number?\". And I say, \"If you're such good friends with Chief/Detective, you would already have their cell number\".\n\n\\*If it really is a long lost buddy, I always offer to get *their* number and pass it along to the Chief/Detective.",
            "title_similarity": "0.41396928",
            "sentiment_compound": 0.8698
        },
        {
            "id": "h3f2rdz",
            "score": 1,
            "text": "I remember when I worked in a call center and one of the customers asked what city they worked on. They stupidly told them. They waited outside for them and looked at everyone's ID as they left and found the girl he was looking for. Thankfully just gave them flowers but could have gone a lot worse",
            "title_similarity": "0.49396807",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h3f32xg",
            "score": 1,
            "text": "LPT - do this to a co worker you hate",
            "title_similarity": "0.5706211",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h3f37ei",
            "score": 1,
            "text": "I mean it’s great when the worker tells me they’re not around instead of “but hey i can help you with anything you need”\n\nCause last that i asked about someone specific, the woman told me that. And when i gave her my papers she gave me this pikachu look.",
            "title_similarity": "0.44327265",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h3f3nvi",
            "score": 1,
            "text": "Repost from like two weeks ago. Ask a question that hasn't been asked in at least three months. Thanks.",
            "title_similarity": "0.35754406",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h3f3oc4",
            "score": 1,
            "text": "should be common sense",
            "title_similarity": "0.12880094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f3vhd",
            "score": 1,
            "text": "Terrible customer service managers would disagree",
            "title_similarity": "0.6125126",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h3f4gsd",
            "score": 1,
            "text": "I’m still absolutely bazoinked that people have to be told this.",
            "title_similarity": "0.34965697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f4rcg",
            "score": 1,
            "text": "“The schedule always changes”",
            "title_similarity": "0.28814948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f5cco",
            "score": 1,
            "text": "How often does this happen to people?",
            "title_similarity": "0.3774877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f5cyy",
            "score": 1,
            "text": "Yeah what if they have a Death Note",
            "title_similarity": "0.37080607",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h3f5ix5",
            "score": 1,
            "text": "Got a nice little stalker at work because a coworker told a dude that had come into the store once when I worked next. I was PISSED. And of course I was working by myself as well so I couldn’t get away or have someone to help me out of the situation.",
            "title_similarity": "0.6485079",
            "sentiment_compound": 0.1697
        },
        {
            "id": "h3f5nog",
            "score": 2,
            "text": "I've worked at Target and Walmart. Giving away employee information was against policy at both stores and the managers reminded us frequently",
            "title_similarity": "0.5898158",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3f5o5e",
            "score": 3,
            "text": "I’d extend that to even if one of your coworkers asks for personal information about another don’t give it them! Personal experience - a coworker that was trying to get uncomfortably close to me got my phone number from somewhere. I still haven’t figured out where from, I’ve never given it to any of my coworkers, but I’m almost certain he must have got it from someone in the head office that had access to my personal details!!",
            "title_similarity": "0.66656137",
            "sentiment_compound": 0.4091
        },
        {
            "id": "h3f603e",
            "score": 1,
            "text": "I thought handing out this kind of information was illegal? Or is that just applicable to your employers? I'm sure we can't do this without breaking some kind of GDPR law in the UK.\n\nIs minding your own business really a pro tip? Why would you hand out random shift info to a stranger? And if its that person's relative/friend, shouldn't they already know this info without having to call their workplace?",
            "title_similarity": "0.59547675",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h3f61fj",
            "score": 1,
            "text": "I've known hotels that will not confirm or deny that a person is staying there in order to protect the occupant from neer-do-wells/bad guys.",
            "title_similarity": "0.46145633",
            "sentiment_compound": 0.5627
        },
        {
            "id": "h3f69el",
            "score": 1,
            "text": "Pretty sure giving that info out is also illegal",
            "title_similarity": "0.38985252",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h3f6f02",
            "score": 1,
            "text": "I met a crazy person on a dating app. She started coming to my work asking about when I'd show up. Thankfully my coworkers were smart enough to follow this advice at the time. I suggest everyone else follow this advice.",
            "title_similarity": "0.3508112",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h3f6iij",
            "score": 1,
            "text": "This happened at my work, I thought the man knew my co-worker, and when she saw him she didn’t even know who he was (this was like 6 months ago), he still comes into the shop often and looks at me creepily, I don’t know what he wants but it’s uncomfortable",
            "title_similarity": "0.67114216",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h3f6le8",
            "score": 1,
            "text": "Story time\n\nI got a job at a gas station and had this piece of shit coworker. Dude would literally card women he found hot to see what their address was. Couldn't prove it, but he admitted it to a friend of his that came into the store one day and I overheard it. He would also make fun of me for wearing the reflective vest when I would go out to sweep the parking lot. Needless to say, we did not get along.\n\nSo on a day I was off, he we literally fired, banned from the store, and arrested. He had been scanning cartons of cigarettes, taking the cash from the customer, then after they left he would void the sale and pocket the cash. He got away with it for months. \n\nThe next day I was working and he called the store. \"hey is (other coworker) there?\" I said no and he said \"ok can you check the schedule and tell me when she is working again??\" I had the biggest smile on my face when I said \"im sorry sir, im not allowed to give out our employees schedule. have a good day!\" and hung up.",
            "title_similarity": "0.4861446",
            "sentiment_compound": -0.4556
        },
        {
            "id": "h3f6lmx",
            "score": 1,
            "text": "I work at a bar, and it’s usually a girl asking the question for a male coworker. I always tell them when that person works. I see it as a customer asking to know when to come in. We make our money based off who comes in, so I never shy away from that question. I feel like you have to gauge the situation though, if a cute girl is smiling at you asking the question then you can answer.",
            "title_similarity": "0.4477409",
            "sentiment_compound": 0.8592
        },
        {
            "id": "h3f6o8r",
            "score": 1,
            "text": "Someone rang and asked to speak to one of my elderly residents. I asked who was calling and they got pissy. I told them I'm not going to let a random speak to anyone. Then they decided to let me know who they were and I verified with my team leader. Wasn't hard, but they were stupid to expect us to just hand the phone over without checking.\n\nGotta look after my oldies.",
            "title_similarity": "0.6007754",
            "sentiment_compound": -0.0392
        },
        {
            "id": "h3f6t7y",
            "score": 1,
            "text": "People can be so creepy. There was a male customer in my store that was making my coworker extremely uncomfortable. He was openly staring at her breasts while asking for her help and she went to the back to hide after telling us what was happening. I went out to the sales floor to let my coworker know when he left and he was asking the cashier what the girls name was and if he could have her phone number. She had never met him before. He asked when she was coming back but we told him that she had left for the day and he tried to get her Instagram from us. Of course, we didn’t give him any information but it was freaking weird and scary.",
            "title_similarity": "0.60973024",
            "sentiment_compound": -0.8846
        },
        {
            "id": "h3f71af",
            "score": 1,
            "text": "This happened to a friend of mine once.  A bunch of kids went to his house and asked where he was, to fight obviously, and his mother told them we were all at the movie theater.\n\nWe came out and 5 kids were there waiting but they didn't realize that there was like 9 of us seeing the movie.\n\nWe could tell when we left the theater that the 5 of them were going to wait and jump him when he left the theater thinking it was just a couple of guys there but instead it ended well for 12 of us because we all made them 2 fight and that was the end of it.",
            "title_similarity": "0.38733274",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h3f71n4",
            "score": 1,
            "text": "I don't know how many times I've tried to teach my staff this! I run a restaurant so there's an ever-chatting staff. I once had an employee give an update customer my business card with my cell phone number (she actually went into my office and got one off my desk). The office door remains locked now.",
            "title_similarity": "0.5086026",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h3f77am",
            "score": 1,
            "text": "Maybe if you work in retail, but in any white collar job that would be a pretty unusual way to conduct oneself. Obviously the shift question is weird but asking “is Mr. X here or where is Ms. X’s office” I can’t imagine people dodging that question anywhere I’ve worked. \n\nI’m actually pretty sure my old colleagues would wonder what’s wrong with me if a likely client showed up and I said I don’t know where to find them. Asking where someone’s office is in a big ass office building is a super standard question. The axe murderer to innocent question ratio has to be pretty damn low.",
            "title_similarity": "0.62793875",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h3f7fpg",
            "score": 1,
            "text": "A customer asked me this once and I answered his question. He left without buying anything. It turned out he and the colleague he asked about were regularly stealing money from the safe out the back.",
            "title_similarity": "0.5451418",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3f7xs2",
            "score": 1,
            "text": "If someone asks for one of your coworkers, you cant just take them to the coworker?",
            "title_similarity": "0.78712636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f7zdk",
            "score": 1,
            "text": "The easiest thing to do is to flatly deny them first \"I can take your information and let them know you were asking for them\" and if they press the issue always always *always* blame a higher power, i.e. \"I'm sorry but per company policy I am not allowed to give that information out to anybody.\" \n\nHonestly that's a good fallback anyway. Blame corporate and even act a little annoyed at the policy yourself if it helps. It's one thing if it's an employee saying it, it's another thing entirely when it's \"corporate's\" fault in some people's eyes, even if it's not against policy.",
            "title_similarity": "0.59407014",
            "sentiment_compound": 0.2475
        },
        {
            "id": "h3f8hb2",
            "score": 1,
            "text": "Seems like common sense ngl",
            "title_similarity": "0.027665766",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3f8pp6",
            "score": 1,
            "text": "Strippers and escorts. They want the opposite of what you’re preaching.",
            "title_similarity": "0.51811385",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3f8t5d",
            "score": 1,
            "text": "Fuck… isn’t this common sense?",
            "title_similarity": "0.21636471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f98d1",
            "score": 1,
            "text": "Happened to me years ago when working at A super market. Guy turned out to be A female co-workers stalker.",
            "title_similarity": "0.40770823",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h3f9ig2",
            "score": 1,
            "text": "Maybe I’m just too into true crime shows, but I follow this LPT in almost every situation. I once had a guy knock on my door and ask if my neighbor lived next door. I told him I didn’t know the person who lived there. Turned out it was my neighbors friend who was lost, but my neighbor was still grateful I didn’t just give out his info to a stranger.",
            "title_similarity": "0.5200645",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h3f9lna",
            "score": 1,
            "text": "A lesson in editing, your title could have been:\n\n\"Don't divulge colleague schedules to customers\".",
            "title_similarity": "0.60799444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f9pz1",
            "score": 1,
            "text": "This is why I’m not supposed to even acknowledge that a specific student is in my class if someone asks. You never know who might be looking for them, so even saying”oh, she dropped my class and I don’t know anything more” tells the person that the student is in fact somewhere at the school",
            "title_similarity": "0.7129708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3f9ti3",
            "score": 1,
            "text": "Pfft, garbage.\n\nIf the request was for something useful, beneficial, innocent, you could have helped.\n\nIf the request was from some hypothetical stalker-murderer, he would be determined enough to find the schedule anyway.",
            "title_similarity": "0.36914438",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h3f9v36",
            "score": 1,
            "text": "This should be common sense everywhere. No one is asking this who actually knows them socially unless it's someone checking up on them, and in that case you really don't want to be informing.",
            "title_similarity": "0.62383795",
            "sentiment_compound": -0.402
        },
        {
            "id": "h3fa2dg",
            "score": 1,
            "text": "Tried that. Got court martialed.",
            "title_similarity": "0.28878975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fa933",
            "score": 1,
            "text": "The only people who get that info from me are regular customers who I know get along with/are favorites of my other coworkers. \n\n\"No Sarah tonight?\" \"Nope, had the night off, she'll be here tomorrow though.\" \"Oh, good, I was worried something had happened!\" \n\nBut we know these customers names, they're at the store nearly every day... if I dont recognize a person I just say \"Nope, sorry, and i dont know their schedule.\" Even if i do.",
            "title_similarity": "0.6208943",
            "sentiment_compound": 0.4357
        },
        {
            "id": "h3fafln",
            "score": 1,
            "text": "Lol can't tell that to someone trying to serve you. You are legally obligated to tell them or you can get in trouble for evading them.",
            "title_similarity": "0.57768095",
            "sentiment_compound": 0.128
        },
        {
            "id": "h3fakv3",
            "score": 1,
            "text": "LPT is just common sense",
            "title_similarity": "0.12908447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3faoye",
            "score": 1,
            "text": "_Especially_ if said person claims to be a close relative (they would have been told already if they had a good relationship).\n\nOh and be prepared for an excuse that sounds very reasonable, don't fall for it.",
            "title_similarity": "0.394387",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3fax1h",
            "score": 1,
            "text": "Nah. My boss is lazy and takes the day off for stupid reasons or leaves early all the time. I throw them under the bus every chance I get.\n\nYou don't want to be here, just go already.",
            "title_similarity": "0.5498697",
            "sentiment_compound": -0.6728
        },
        {
            "id": "h3fb7wc",
            "score": 1,
            "text": "That's the reason my photo in WhatsApp business is just an anthro dragon with a helpdesk headset",
            "title_similarity": "0.19870193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fbymq",
            "score": 1,
            "text": "This sub really needs to be renamed to \"Life tips for dummies\". If you are not really basic, 99% of everything on here is just common sense.",
            "title_similarity": "0.17657828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fc4k3",
            "score": 1,
            "text": "Isn't this a standard privacy policy all businesses have though?",
            "title_similarity": "0.33194757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fc6a3",
            "score": 1,
            "text": "I think it's illegal in alot of European countries to share that information with someone, since the GDPR is in place.",
            "title_similarity": "0.5288682",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3fd3bo",
            "score": 1,
            "text": "unless you hope something bad happens to your co-worker.\n\nsaved me money for hiring a hit man.",
            "title_similarity": "0.45465547",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3fd8ud",
            "score": 1,
            "text": "In my business this wouldn't work. If a customer comes in to ask about work being done to their PC an employee that isn't working on it wouldn't know anything about it as I don't assign more than 1 employee to a customer to avoid confusion. So in that case if the employee isn't there and they had a question we'd tell them when they could come back so they can get accurate answers to their questions.",
            "title_similarity": "0.79090536",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h3fdske",
            "score": 1,
            "text": "Umm... Yeah...\n\nSo yesterday this lady walked in with a man that was obviously deaf, and she asked to speak with my boss. There was no way I was going to be a massive dick and not help them.",
            "title_similarity": "0.5609538",
            "sentiment_compound": -0.6765
        },
        {
            "id": "h3fdwte",
            "score": 1,
            "text": "Even if they ask for the person that sits right in front of me I tell them that I try to connect them. Before we connect I speak with the person and tell them who from where and for what reason is on the phone and then they say I can connect or to tell them that he is not in the office office today but I am happy to help.",
            "title_similarity": "0.5803995",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h3fdz9k",
            "score": 1,
            "text": "I remember back in high school working at Jimmy John's, a sheriff walked in and asked for my manager by name. My manager was the chillest dude ever and just happened to be sitting in the back, we collectively decided he wasn't working that day and turned him away. Turns out it was something minor like unpaid parking tickets or something.",
            "title_similarity": "0.496824",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3fdzvj",
            "score": 1,
            "text": "\"I'm sorry, we don't take sales calls\"",
            "title_similarity": "0.62914073",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3fe5h9",
            "score": 1,
            "text": "Physical security is massive, socially engineering people is so easy because you can push the boundaries of the unwritten social contract without much effort.\n\nOne of my old chief security officers likes to tell the story of how he challenged the president of a company he worked at on his third day because he wasn't wearing his pass card / photo ID. (He didn't know who the guy was.)",
            "title_similarity": "0.4836133",
            "sentiment_compound": 0.8733
        },
        {
            "id": "h3fe6qn",
            "score": 1,
            "text": "Hi, uhhh, will you be walking to your car alone later?",
            "title_similarity": "0.45935765",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3feczg",
            "score": 1,
            "text": "I strongly believe this sub should be renamed r\\commonsense",
            "title_similarity": "0.10801351",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3fejyx",
            "score": 1,
            "text": "I had an old man at my old bakery job come in looking for me all the time. I was 21 then. He would ask the cashiers if I was there, ask for my phone number and when I get off work. One of the cashiers was fed up with him, and after him saying \"Im not a very good flirt\", she told him point blank that I was really young and it's gross that he would look at me that way.\n\nI wish I could say it stopped there, but at least management let me work in back of house when he was there. Honestly wish they would have banned him from the store, but regular customers matter more to corporate than your employees feeling safe at work. :/",
            "title_similarity": "0.58194244",
            "sentiment_compound": 0.5979
        },
        {
            "id": "h3ff9qj",
            "score": 1,
            "text": "Don't badge anyone you don't recognize in either",
            "title_similarity": "0.6641022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ffcr1",
            "score": 1,
            "text": "Well duh... \n\n&#x200B;\n\nHere is another LPT... don't give out anyone's personal details to strangers.",
            "title_similarity": "0.57728374",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h3ffrjq",
            "score": 1,
            "text": "For the US Navy we have very strict procedures on how this is handled. First off only certain people have access to the list of contacts for members of a command known as the Alpha Roster. Even then we only give info to a few people at the command. To add an extra layer to it, we will hang up and call back the person they are claiming to be using the roster to confirm the identify. If they are not authorized access to the information then as stated here we take a message and pass it on. You can also be surprised how well our network of contacts can go. This is all handled by someone who has been in the service for a number of years and can handle themselves. This can be a very good system that managers should consider given the teenager might not know who the boss is above their own. It insures noones personal information is given out that can endanger them.",
            "title_similarity": "0.51176924",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h3ffrnd",
            "score": 1,
            "text": "Me: “Hi, thanks for calling, how may I help you!”\n\nCaller: “Hi, I’m Steve, is coworker available?”\n\nMe:  “…no”\n\nIs this what the LPT suggests?  Because wayyy more likely this person has been working with my coworker on a quote, a project, maybe it’s a sales call, maybe a customer, maybe a vendor calling back, maybe another coworker whose voice I don’t recognize, a friend or relative…\n\nThere are dozens of reasons this person might be calling before it’s a stalker or abusive partner.  \n\nIf that coworker fears for their lives to the point where someone shouldn’t know their whereabouts ever, that coworker should probably be proactive in telling people “if so and so calls, please don’t share any information.”  Or “if someone calls asking for me, please write their info down and give it to me to call.”\n\nOtherwise, it’s completely a unnecessary thing to do because 98% of people aren’t concerned with this.",
            "title_similarity": "0.5901689",
            "sentiment_compound": 0.8842
        },
        {
            "id": "h3ffxty",
            "score": 1,
            "text": "LPT: This doesn’t apply everywhere. For instance, hair salons or barber shops.",
            "title_similarity": "0.5693533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fg5jw",
            "score": 1,
            "text": "I've had the reverse of this happen where a guy asked me where his coworker was but I was just walking home from school.",
            "title_similarity": "0.5568804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fget2",
            "score": 1,
            "text": "This sounds paranoid as fuck.",
            "title_similarity": "0.36200523",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h3fgfrk",
            "score": 1,
            "text": "This is true whether it’s work, family, anything. Even if you know both of those people, even if you seen them talking to one another. Even cousins, to be frank. “Give me your contact information, and I’ll have them get a hold of you.”",
            "title_similarity": "0.33578897",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3fgk3v",
            "score": 1,
            "text": "Lmao I went to my friends work to surprise her and say hi, and when i asked her coworker for her i could tell the coworker seemed cautios of me, when my friend showed up i kinda wanted to say \"i told you you couldn't hide from me!\" With acrazy smile on but i didn't wanna freak out her coworker too much. Also I've had friends ask for me at my work and i come up and act all friendly with them, then i turn to my co-worker and jokingly tell them to call the cops with a scared look.",
            "title_similarity": "0.5439725",
            "sentiment_compound": 0.9447
        },
        {
            "id": "h3fguv4",
            "score": 1,
            "text": "I had this happen once. Luckily I work in a big store where not all the employees know each other so I just played dumb and pretended I didn't know",
            "title_similarity": "0.65825534",
            "sentiment_compound": 0.3947
        },
        {
            "id": "h3fgwts",
            "score": 1,
            "text": "I had a stalker that caused me to move(start of 2020), she would also harass me at work. I learned either one or more of my coworkers were giving her any info she asked for except for my cell number (apparently giving that out wasn't ok but giving out my home address was fine?!)\n\nIt stopped when 2020 happened because we closed shop for a bit. But she came right back once we opened up again. I saw her before she saw me and I just had enough. Called the cops, she got trespassed, all employees were slapped with \"If you give out schedule info or coworker info you're getting fired,\" and she hasn't been back.",
            "title_similarity": "0.5499394",
            "sentiment_compound": -0.8355
        },
        {
            "id": "h3fgxj3",
            "score": 1,
            "text": "Yes, and also please don’t give your colleague’s contact to them, especially personal numbers (this makes me really piss when my colleagues do that)",
            "title_similarity": "0.70400757",
            "sentiment_compound": 0.2516
        },
        {
            "id": "h3fh5ix",
            "score": 2,
            "text": "Especially if he is a tall white bald man who doesn't smile.",
            "title_similarity": "0.27314073",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h3fhgji",
            "score": 1,
            "text": "Once, after I left an office position as receptionist, a guy who used to come in a lot asked where I was to the other receptionist. She assumed we were friends so gave the guy my personal email (I had moved from the city so had a new cell phone number that she didn’t know - thank goodness). The guy then proceeds to email me, a lot…. With some pretty intense sexual harassment. I had to call my old office manager to get her to ask that my personal email or any contact info isn’t given out to random people who come in asking where I went. \nAccording to this creep I had a nice smile and he will miss staring at my rack ( tamest things he said in his many emails to me)",
            "title_similarity": "0.552464",
            "sentiment_compound": 0.9118
        },
        {
            "id": "h3fhk7a",
            "score": 1,
            "text": "I was the second shift supervisor at an electrical component factory. Two of my team were having an affair. Her husband found out by calling the desk and sweet talking the clerk about them. \n\nAnd lay in wait in the street with his scopes deer rifle to kill his rival. And probably his wife as well. \n\nWe called the cops, and got the couple out of danger the back way. Hillbilly hubby got arrested. She moved away. \n\nI spent a half hour explaining in great detail to the clerk about never ever telling anything about employees to random callers. He was very regretful and crying. He thought he was being helpful.",
            "title_similarity": "0.43221617",
            "sentiment_compound": -0.7755
        },
        {
            "id": "h3fhk9x",
            "score": 1,
            "text": "Worked at a pizza place when I was much younger and was in the back taking a smoke break. Two guys came up asking for a coworker. When he wasn’t there asked where he lived.  Told them I wasn’t sure exactly but his house was on the next block over. Turned out my coworker got fronted a bunch of blotter acid and got busted with it at his high school. Someone still wanted their money. The kid ended up moving to his dad’s house in another state. Oops...",
            "title_similarity": "0.4715677",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h3fhn0b",
            "score": 1,
            "text": "LPT: Don't answer any questions you don't want to.",
            "title_similarity": "0.5806509",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h3fhtie",
            "score": 1,
            "text": "I had a co-worker do that, and the next thing I know I had a big angry ex-landlord show up at 8 p.m. at the radio station where I worked, alone, demanding the rent my friend hadn't paid. \n\nIt was a little tense.",
            "title_similarity": "0.5938814",
            "sentiment_compound": -0.6258
        },
        {
            "id": "h3fhzxn",
            "score": 1,
            "text": "Are people like 15 years old here to need this “tip”? You’re not allowed to share company information nor employee information to people outside the company, and you signed the contract for it. How is this a “tip”? This sub is making me puke",
            "title_similarity": "0.57009166",
            "sentiment_compound": -0.485
        },
        {
            "id": "h3fidqi",
            "score": 1,
            "text": "This is such a common sense thing, but ONLY when you are made aware of it, most companies negligently dismiss the security risk, that giving this information out creates",
            "title_similarity": "0.4972906",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h3fiepu",
            "score": 1,
            "text": "This is especially important if you work reception.",
            "title_similarity": "0.34904325",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h3fip89",
            "score": 1,
            "text": "Work as a skip tracer for years. You'd be surprised how often people will just give info to strangers, especially if they dont like the person you're calling about.",
            "title_similarity": "0.56505835",
            "sentiment_compound": -0.0541
        },
        {
            "id": "h3fj86c",
            "score": 1,
            "text": "In my retail job, we more than once had to hide people (it was a craft store, vast majority of the staff were women) in the back, not just from pushy customers but also like…stalker like people. \n\nA coworker started freaking out and asking me about the location of the guy carrying foam. Turns out it was the ex husband who had put her in the hospital and found out where she was working these days.",
            "title_similarity": "0.55351573",
            "sentiment_compound": -0.101
        },
        {
            "id": "h3fjb1h",
            "score": 1,
            "text": "Someone once called the restaurant to see if one of the cooks was working.  I didn't think anything was suspicious about that, so I said yes, thinking it was a family member who planned on stopping in.  \n\nThey ended up breaking into his house while he was at work.",
            "title_similarity": "0.5802002",
            "sentiment_compound": -0.0352
        },
        {
            "id": "h3fjel1",
            "score": 1,
            "text": "Yeah that’s usually policy when you are hired. Everywhere I’ve worked I was specifically trained never to give coworkers information out.",
            "title_similarity": "0.6072154",
            "sentiment_compound": 0.296
        },
        {
            "id": "h3fkdr8",
            "score": 1,
            "text": "I had to give my now ex husband’s mug shot and a copy of the injunction against him to the front desk of the school I taught at.",
            "title_similarity": "0.3653652",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fkg3a",
            "score": 1,
            "text": "unless it's your boss. Fuck that guy",
            "title_similarity": "0.62932336",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3fkhcz",
            "score": 1,
            "text": "Same with contact information. Take their name and number and relay it to the coworker. Never give out coworker's info.",
            "title_similarity": "0.5796503",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3fkp3u",
            "score": 1,
            "text": "Actually saying you don't know is better than just not answering their questions. If they're violent, they might try to harm you if they perceive you as uncooperative.",
            "title_similarity": "0.5184399",
            "sentiment_compound": -0.8691
        },
        {
            "id": "h3fl3ce",
            "score": 1,
            "text": "This is so important.\n\nWhen I was teaching at a school. Creepy guy had been trying to chat me up online and I had blocked him everywhere. He found my workplace from somewhere and came looking for me saying he's a close friend. The receptionist told him that she doesn't have my schedule and if he wants to see me he can call my cellphone. He didn't have my number so he left.",
            "title_similarity": "0.62476444",
            "sentiment_compound": 0.5014
        },
        {
            "id": "h3fl44k",
            "score": 1,
            "text": "“Let me go check and see if they’re in the back” is my favorite line when customers ask for coworkers. Get their name first and then relay the message",
            "title_similarity": "0.43074358",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3fl752",
            "score": 1,
            "text": "I generally try not to confirm or deny someone's employment.\n\n\"I'll ask if someone with that name works here. Can I get your info in case the call drops?\"\n\n\"Hey, someone with this name and number is asking about you.\"\n\nThen they can decide if they want to talk now, call them later, text, or pretend they don't exist.\n\nAlso, even if it's the police, same thing. There are various ways of contacting someone, and if this is how they've chosen to do so, the person has a right to choose whether or not they want to respond.",
            "title_similarity": "0.57070214",
            "sentiment_compound": -0.3447
        },
        {
            "id": "h3fm4od",
            "score": 1,
            "text": "This was written by a manager after speaking with yet another Karen",
            "title_similarity": "0.5289167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fm8e2",
            "score": 1,
            "text": "Who needed to be told this? Show yourself.",
            "title_similarity": "0.36238006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fmd8a",
            "score": 1,
            "text": "You really shouldn’t be allowed to give out anyone’s information/schedule/phone number at all. That direction should be standard info given at orientation.",
            "title_similarity": "0.58467644",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3fmgas",
            "score": 1,
            "text": "I was always told not to disclose that information. I used to answer the phone/take to go orders and people would often call asking “Is Sheila scheduled to work today?” or “What time does Bob get in today?” Even before I was explicitly told not to do it, I never did. It just didn’t feel right.",
            "title_similarity": "0.67368364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fmjol",
            "score": 1,
            "text": "When I was 15 I had a drunk guy come up and ask if I was ‘name’ I pointed to my name badge and told the drunk he had the wrong guy and sorry but  ‘name’ quit last week \n\nTurns out the drunk knew ‘names’ girlfriend and had beef with him possibly ex? for whatever reason and was later caught in the carpark near our storeroom with a knife in his jacket by security",
            "title_similarity": "0.4037519",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h3fmmnt",
            "score": 1,
            "text": "“I would like to know when Wendy will end her shift.”\n\n“She does not work here. It **is** a Wendy’s sir”",
            "title_similarity": "0.6967155",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3fmt5b",
            "score": 1,
            "text": "Amen ! In general, never give any information away about your coworker to management.\n\nI had a coworker sending screen capture of a conversation we had about an intervention I've done. My manager cut the end of the conversation so it would look like I was rude and not answering the question. He tried to write me a blame based on this.\n\nI know my coworker didn't mean no harm, but he unwillingly helped the manager to mess with me.",
            "title_similarity": "0.6680306",
            "sentiment_compound": -0.7735
        },
        {
            "id": "h3fmv4z",
            "score": 1,
            "text": "100% this. Lots of my employees are younger and lack....comment sense? Street smarts? I had to have a few conversations with folks about not handing out schedules of coworkers to randoes..you never know if they are a crazy person.",
            "title_similarity": "0.5940956",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h3fmvx8",
            "score": 1,
            "text": "LPT: This subs lost its fucking mind",
            "title_similarity": "0.44745332",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h3fmxvw",
            "score": 1,
            "text": "If you don’t like your co-workers though, go for it.",
            "title_similarity": "0.50924945",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3fn0yq",
            "score": 1,
            "text": "This is especially true if you work from home.",
            "title_similarity": "0.2991163",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h3fn5l7",
            "score": 1,
            "text": "my response to anyone asking that would be:\n\n\"i'm not at liberty to discuss that with anyone.\"",
            "title_similarity": "0.55356693",
            "sentiment_compound": -0.4168
        },
        {
            "id": "h3fngm0",
            "score": 1,
            "text": "I know this might not be common knowledge for most people, but as a retail manager and having to explain privacy policies to all employees this is one of the things I made sure to always always over explain to the point of nauseum. Its very much a part of retail to be helpful and its easy to forget to not just answer the questions when asked of you if you knew.",
            "title_similarity": "0.51915425",
            "sentiment_compound": 0.8462
        },
        {
            "id": "h3fnk5z",
            "score": 1,
            "text": "You know it, I know it, and betty Lou down the street knows the schedule is posted, but you don't know how to read it. Just don't answer the damn questions.\n\n\"Whens mmp working next?\"\n\"What time do they get off\"\n\nThese questions literally were asked by the rapist before he came in on her shift. \n\nDon't answer any fucking questions. The customer can tell you if you need to send them a text if it's an emergency, and thats it. Nothing else",
            "title_similarity": "0.65523666",
            "sentiment_compound": -0.8542
        },
        {
            "id": "h3fnky9",
            "score": 1,
            "text": "You would think this would be a given",
            "title_similarity": "0.14094767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fnrox",
            "score": 1,
            "text": "Where I work, we are told we can only verify that the person works for us and then transfer that caller/person to their work phone. \n\nIf there are harassment issues, those go right up to HR. We have had one worker who had a stalker. The police got involved.",
            "title_similarity": "0.5971199",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3fo03l",
            "score": 1,
            "text": "Same thing my wife gets when she asks when I'm gonna be done. ??? Hopefully soon.",
            "title_similarity": "0.3723993",
            "sentiment_compound": 0.5007
        },
        {
            "id": "h3fo3ap",
            "score": 1,
            "text": "Unless you really don't like that person.",
            "title_similarity": "0.47996673",
            "sentiment_compound": -0.3374
        },
        {
            "id": "h3fo79x",
            "score": 1,
            "text": "I work for a large company, and have security duties as another “hat” I wear. Twice, I’ve had coworkers ask me to help with a random caller trying to get contact info for another employee. Which is against policy. I’m not HR, I’m not even allowed to confirm that someone by that name works for us. \n\nBoth times I’ve explained that policy prevents me from confirming or denying employment and offered to take the caller’s name and phone number, the name of the person they’re trying to reach, and “see if I can pass that information along.”  Both callers hung up on me.",
            "title_similarity": "0.6886772",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h3foqqr",
            "score": 1,
            "text": "\" Kindly write your name and contact info on this post-it and I'll pass it on to our HR dept\" - don't ask \"would you or could you\" as that gives them an out. Have a pen and pad near front of workplace/desk for such needs too.\n\n(always be suspicious/skeptical of anyone asking about employees. Could be harmless, like old friend in the area but doubtful since most have cellphones/email to reach out. LE will clearly show ID if something bad has happened. But best practice is to play dumb and have them leave their info. )",
            "title_similarity": "0.6077663",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h3fosub",
            "score": 1,
            "text": "This is so obvious why is this posted as LPT",
            "title_similarity": "0.04376657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fou40",
            "score": 1,
            "text": "This crazy lady used to come to my store all the time because an employee would give her all sorts of deals and all this other BS. I wasn’t aware of the situation so I went a little above and beyond for her one time and she proceeded to call the store multiple times a day looking for me, asking if they could print out a copy of my schedule for her to take home, wanted my personal info like my cell phone number. Eventually one day the store director threw her out and she never came back.",
            "title_similarity": "0.5227684",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h3fp3tx",
            "score": 1,
            "text": "how is this lifepro? yall stupid lol",
            "title_similarity": "0.44609028",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h3fpnph",
            "score": 2,
            "text": "I had a roommate who was rushed to the ER after being stabbed a few years back. He had been hanging out with a girl who worked at a local Starbucks.\n\nI had no idea what was going on so I called her work to try to locate her and find our what had happened. Even though I knew she worked there and had been to that Starbucks before, they acted like they'd never heard of anyone by that name. \n\nTurns out my roommate and her both had been stabbed by her ex husband and he had killed her. After finding that out, I had huge respect for her coworkers protecting her like that. \n\nIt's not 100% relative to this post, but it's always stuck with me.",
            "title_similarity": "0.48313868",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h3fpxbk",
            "score": 1,
            "text": "If you print out your coworkers schedule and keep copies on you then you can just hand those out",
            "title_similarity": "0.47442508",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3fqbq6",
            "score": 1,
            "text": "I just give out the information idgaf",
            "title_similarity": "0.14743099",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fqcpj",
            "score": 1,
            "text": "I think this very much matters on the job. Like an office job i think this would be less frowned upon than a more public service job like target/walmart",
            "title_similarity": "0.47371072",
            "sentiment_compound": 0.6573
        },
        {
            "id": "h3fql8l",
            "score": 1,
            "text": "who in their right mind would answer ?",
            "title_similarity": "0.3266871",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fqo22",
            "score": 1,
            "text": "I want to say that this is common knowledge buy it's just that way to me, there are so many folks that need reminding and need to learn this for the first time. Thanks for posting. Tha is for the reminder, and thanks for teaching folks that didnt know.",
            "title_similarity": "0.33292344",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h3fqs1s",
            "score": 1,
            "text": "Did you not hear me? [We can't give out no intfortmation](https://www.youtube.com/watch?v=_WLA81q9ok0).",
            "title_similarity": "0.5013735",
            "sentiment_compound": 0.3067
        },
        {
            "id": "h3fqtyp",
            "score": 1,
            "text": "\"I'm sorry, the person you are requesting is not available, how can I help you today?\"  Repeat as needed.",
            "title_similarity": "0.6867498",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3fr6r2",
            "score": 1,
            "text": "If I'm at work and some stranger suddenly asks me anything, in-person, imma ask how the fuck did they got past security and found my desk.",
            "title_similarity": "0.63678515",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h3frdae",
            "score": 1,
            "text": "Only time I say it is if it’s a regular customer that everyone likes",
            "title_similarity": "0.35581288",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3frhyt",
            "score": 1,
            "text": "Except if you dont like said co worker.  I love to give details and phone numbers or my dearest collegues. Jk if you reading this HR i'd never do this ofc. *wink*",
            "title_similarity": "0.52742434",
            "sentiment_compound": 0.822
        },
        {
            "id": "h3frwd3",
            "score": 1,
            "text": "Once I worked on an ice cream truck with a very ignorant girl. She was homeschooled and very sheltered. Anyway, this guy came up asking for a ride and he was clearly on drugs and being very creepy. He kept asking what my name was and the girl thought she was being nice and told him my first and last name and where I was from before I could tell her not to. Nothing happening but it pissed me off. When I explained it to her that what did did was shitty, she got too scared to work and quit that week lol.",
            "title_similarity": "0.506259",
            "sentiment_compound": -0.8956
        },
        {
            "id": "h3fs1jy",
            "score": 1,
            "text": "Tell that to secretarys and receptionists",
            "title_similarity": "0.34417427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fsbxv",
            "score": 1,
            "text": "I hope managers are telling their employees this rather than them learning via Reddit.",
            "title_similarity": "0.64091504",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h3fsg3o",
            "score": 1,
            "text": "Yes! I had a coworker telling me how a man came in asking when another one of our coworkers would be in or where she was and she told him. All because he wanted her number. So unsafe.",
            "title_similarity": "0.6112879",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h3fsm1t",
            "score": 1,
            "text": "Please never do it. Once had a customer who threatened me personally on the phone and via email. He was a shoe seller and told me that he would „stab me with a stiletto in front of HQ as soon as he knows when my shift ends.“\n\n\nI told him good luck with that, because I do not work at HQ, but a daughter company and informed legal department about his threats.",
            "title_similarity": "0.50821126",
            "sentiment_compound": -0.09
        },
        {
            "id": "h3fsmib",
            "score": 1,
            "text": "I think this is applicable to some work environments but not others.",
            "title_similarity": "0.4925507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3ftf0m",
            "score": 1,
            "text": "“Hi I want to buy my car from Bill, he sold me my last one. Do you know when he’ll be—“\n\n“Gtfo criminal!”",
            "title_similarity": "0.28649604",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h3ftlqg",
            "score": 1,
            "text": "I really hate this sub, can I remove it from my popular feed?\nEvery post is just common sense",
            "title_similarity": "0.40996587",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h3fttlw",
            "score": 1,
            "text": "I almost was assaulted because of something like this. Switched jobs because abusive ex knew where I worked. I went back to visit my old job location to see some coworkers that I had become close to. Updated them on where I was working, etc, because they wanted to know I was ok and working.\nShortly after, abusive ex shows up at old job, asking for me (he used to come visit me, so this wasn't abnormal). Old coworkers who I was close to wouldn't tell him a thing, but a coworker that I never really worked with much over heard, and had been there when I visited. \"Oh, yeah, she doesn't work here anymore, she works  at x, and works x shift\". My other coworkers could have killed her for it. Needless to say, ex then knew where to find me",
            "title_similarity": "0.6476338",
            "sentiment_compound": -0.8541
        },
        {
            "id": "h3fu5pu",
            "score": 1,
            "text": "Rando: What time does this person get off from work?\n\nMe: umm what for? I usually don't tell...\n\nRando: Ive been trying to reach him about his cars extended warranty and I wanted to let him know this was his final notice.\n\nMe: He gets off at 8pm, his address is blahh (laughing on the inside!)",
            "title_similarity": "0.4973688",
            "sentiment_compound": 0.6062
        },
        {
            "id": "h3fuvlt",
            "score": 1,
            "text": "even if someone comes in that I knew was someone’s husband or something bringing lunch i’d always say “let me see if they’re working” then go and let them know who it is. I’ve seen too many domestic disputes at work, I really don’t want to see any more or any one getting hurt.",
            "title_similarity": "0.59541476",
            "sentiment_compound": -0.6022
        },
        {
            "id": "h3fv3qm",
            "score": 1,
            "text": "My old boss used to work at the job centre and he said they’d get this a lot and give fake details and always find them waiting in the car park because one time someone called and was actually given the right details of a woman who worked they and he battered her in the car park after work",
            "title_similarity": "0.47086096",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h3fv88u",
            "score": 1,
            "text": "About a week after my now-ex-fiancé broke up with me she called my office and asked for my schedule for the work. My coworker (who had her own experiences with nightmare exes) promptly told her no and to not call back again. No good can come from that kind of thing",
            "title_similarity": "0.6057823",
            "sentiment_compound": -0.7511
        },
        {
            "id": "h3fv93o",
            "score": 1,
            "text": "My mom used to come into my work and ask my coworkers for my schedule ( I don't talk to her). \nSomeone gave it to her once I was not impressed.\nShe would come in making a sob story as how I have to come back while I was working it was humiliating. \nSomeone else told her to ask me for it if she really wanted to know. She never did ask me herself.",
            "title_similarity": "0.69017696",
            "sentiment_compound": -0.696
        },
        {
            "id": "h3fv9gv",
            "score": 1,
            "text": "I had a guy stalking me in college and he would call my workplace (retail) and ask about my schedule, fortunately my supervisors knew of the situation and did not give him any info. Then he got sneaky, and he'd pretend to be a customer calling for me and say I had been working with him on an order or had recommended something to him and he had a follow up question for me specifically, and he would try to disguise his voice.  He used to work there too, and was friendly with people there before he became obsessed/stalkerish so he used that to his advantage when trying to get info, because he was still chummy with some of the employees and they didn't all know the situation.  Fortunately they usually recognized his voice when he'd call as a \"customer.\"",
            "title_similarity": "0.64034414",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h3fv9ke",
            "score": 1,
            "text": "This is it. This is the post that finally makes me unsub from this godawful subreddit. Its not a damn LPT, this is common sense for the 10000th time this week. No one cares about your anecdotes. Whoever upvotes this clearly has had no job ever and/or has the same amount of social skills as a rotting banana.",
            "title_similarity": "0.45210835",
            "sentiment_compound": -0.1273
        },
        {
            "id": "h3fv9s9",
            "score": 1,
            "text": "Lpt: this one time this thing happened and I feel bad.",
            "title_similarity": "0.44325194",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3fvge4",
            "score": 1,
            "text": "my stalker kept calling my work asking for me. i had to inform everyone to not give anyone any information about me, over the phone or even in person. if i want someone to know what my schedule is or if im there, they can text my phone.\n\nthe people that i want to know about when i work are the people that are able to contact me directly",
            "title_similarity": "0.61648524",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h3fw0qp",
            "score": 1,
            "text": "It's kind of unavoidable when your business relies on scheduling appointments for employees. Most of our customers are working closely with specific employees on specific projects. I don't understand how this LPT would be practical.",
            "title_similarity": "0.72755545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fwrwq",
            "score": 2,
            "text": "Case in point; my cousin worked at a gas station and a man came in asking for \"so and so\". She went and grabbed him from the back and the guy came around the counter and stabbed him to death.",
            "title_similarity": "0.32438064",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h3fx90w",
            "score": 1,
            "text": "Hell, I used to have one or two guys from my high school track me down at my retail job to ask me for my sisters phone number... Dude, if she won't give the number to you what makes you think I will.",
            "title_similarity": "0.5205922",
            "sentiment_compound": -0.6728
        },
        {
            "id": "h3fxa1g",
            "score": 1,
            "text": "Holy shit I never even thought about this. What if they are an abusive ex, or stalker?",
            "title_similarity": "0.6024379",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h3fy2e9",
            "score": 1,
            "text": "One time we had an ex wife of a coworker come in and demand to know what her ex husband’s schedule was because he wouldn’t respond to her messages. We told her we could not give out that information because of company policy but we would pass it along to him that she wanted to have a chat. She waited until we all left the backroom and somehow found the schedule clipboard. She showed up at the start of his shift then started a scene and we had to call the cops to escort her out.",
            "title_similarity": "0.6392549",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h3fythk",
            "score": 1,
            "text": "You could shorten this to “treat everyone with grave suspicion at all times in all situations and be done with it.”",
            "title_similarity": "0.22129473",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h3fz36x",
            "score": 1,
            "text": "Ask them who they are and where their employee badge is.  Ask them how they got past the gate and the alligators.",
            "title_similarity": "0.45251435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3fz6u9",
            "score": 1,
            "text": "Wait, this is no pro tip. One of your co-workers just acted like a dick, and your ex then keyed your car in the parking lot.",
            "title_similarity": "0.5701779",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h3fzktx",
            "score": 2,
            "text": "This doesnt just apply to jobs. I had someone come to my door saying they were with a church and wanted to know if there were any children living nearby. I noped the fuck out of there and told him no.",
            "title_similarity": "0.64618254",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h3g03gc",
            "score": 1,
            "text": "If they ask for them specifically your response depends heavily on what you do for a living. If you’re commission sales you better be giving the customer over to your coworker. Same with a few other industries and professions. Asking for a schedule is about the same as that. Taking a message and sending it to your coworker is usually decorum in any professional environment I’ve worked in.",
            "title_similarity": "0.5819596",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h3g0d1x",
            "score": 1,
            "text": "We had scripts for that on my first call centre. There were a few male customers who showed up to speak with some of the female CSRs, and it was creepy. But more importantly, there was someone who had a restraining order against a former partner - which was inferred by the wording of some emails.",
            "title_similarity": "0.50307864",
            "sentiment_compound": 0.5251
        },
        {
            "id": "h3g0dys",
            "score": 1,
            "text": "I never ever do that before it actually came to true about the warnings. \n\nI used to work with a very nice and girl, she was in a relationship an abusive boyfriend who came in asking for when she works where she’s been so that kind of stuff and luckily she confided in some of us but she didn’t talk to me about it at the time but luckily I had common sense to tell him I didn’t know who she was or what he was talking about. The second he left the manger watched the whole thing on the cameras (he was getting rowdy after the third or fourth question) and came down and thanked me. So yes this pro tip is definitely useful. \n\nTldr; Life pro tip true.",
            "title_similarity": "0.5620246",
            "sentiment_compound": 0.9783
        },
        {
            "id": "h3g0ez5",
            "score": 1,
            "text": "Same thing goes with potential colleagues asking to hold the   door. \nThey should have their own Access Card/token/Key.",
            "title_similarity": "0.41342318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g0rat",
            "score": 1,
            "text": "Wasn’t this exact post, word for word, trending here a few weeks ago?",
            "title_similarity": "0.2596519",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g0u6z",
            "score": 1,
            "text": "This happened to me. Gelato bar. Ice cream shoppe.\n\nCo workers told someone seemingly harmless when my last shift was...\n\nShe came in as i was mopping up and i told her the tills were closed. I hadn't met her but I would have served her.\n\nShe started all cutesy like a shy anime girl saying it was sad that i wasn't going to work there anymore. I was a bit suss that she knew it was my last shift so i was a bit staunch and said something dismissive and repeated that i was closing up. \n\nTHEN she went a bit pale and still and  stared at ceiling almost rolling her eyes into the back of her head.. she told me she saw me  in a dream but I was SO ANGRY and there was a dragon coming out of me. Was really creepy. \n\nand so i kicked her out of the shop and chewed out my colleague for giving out me deets",
            "title_similarity": "0.5053775",
            "sentiment_compound": -0.5804
        },
        {
            "id": "h3g18dr",
            "score": 1,
            "text": "Yeah…in high school, once I was working at Starbucks, and a couple people came by asking for one of my co-workers… they were friends with him—and I knew these people cuz they went to my school…but even though I knew them, all I could say is “sorry, he isn’t here right now”. They asked when he was working next…I just said “I have no idea”. It was the truth…I was busy, and I wasn’t about to run in the back and check the schedule for them. Luckily they understood and left.",
            "title_similarity": "0.57166976",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3g18qu",
            "score": 1,
            "text": "Asking for a coworker is fine. For example I always ask for a certain nurse at a blood clinic because they are great at their job.",
            "title_similarity": "0.28640574",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h3g19h7",
            "score": 1,
            "text": "If you're in a commission based environment, you'll want to let them know if the customer is theirs to begin with.",
            "title_similarity": "0.42362267",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h3g1jir",
            "score": 1,
            "text": "And please for the love of god, do not give out coworkers names (especially full name.) The customer really doesn't need to know the name of the person they spoke with 2 days ago that they are now unhappy with.",
            "title_similarity": "0.71314377",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h3g1pgh",
            "score": 1,
            "text": "I knew the hiring manager was avoiding me!",
            "title_similarity": "0.63050187",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h3g1r0h",
            "score": 1,
            "text": "This is true but sometimes your co-worker may be a douche nugget. Allow me to offer a true story to clarify. TLDR at end. \n\nMany years ago, before the rise of the great Apple, in the age of desktop dinosaurs. Touch screen phones were just starting to come out but they hadn’t yet fully developed and/or made standard secure access like pin codes and certainly no biometric or Face ID. \n\nSo, mid 2000s my wife and I had gone to a restaurant in the next town over from where we live. When we got to the parking lot to leave I realized I’d left my phone on the table. I get back inside and the table Hs been cleared already. No cell phone there. I asked the waitress. She didn’t know. I asked for the manager. He said it hadn’t been turned in. I told him to check with the bus boy that cleared the table. Bus boy said he didn’t see one. I told the manager someone had it. Someone was lying. There was no Find My Phone back then so I tried calling it. Straight to voicemail. It had been turned off. Manager says his people wouldn’t steal it. Maybe I left it somewhere else or maybe another customer saw it and took it. It was a slow day. There may have been 3 other tables in the whole place. Anyway, lost cause. Unhelpful manager. Phone gone. I left. When I got home I called my carrier and canceled the service. \n\nA day or two later my wife gets a call on her cellphone in the middle of the night from an unrecognized, but not blocked number. The person on the other end of the line, probably drunk, but calls my wife by here name. On her cell phone. And she doesn’t know the number. \n\nWe boot up the desktop Dino and do a yahoo search for reverse phone lookup. It’s a landline. White pages gives us the name of the person who owns the line and their address. Let’s call him Johnny. Johnny lives right behind the restaurant. \n\nThe next day I called the restaurant and asked for Johnny. The nice young lady who answered the phone said he’d be in for the dinner shift. I didn’t wait. I drove straight there. Johnny was the busboy. Johnny had my phone. \n\nI laid that all out for the manager who had defended Johnny a few days prior. Johnny would take my phone, he had said then. Johnny was an honest guy. He couldn’t defend Johnny anymore. The idiot had drunk dialed my wife while going through my contacts and playing. He couldn’t use my phone to do it because the service was cut off. So he just did it from his own phone. The only way he could have known her cell phone and name together was to see it in the stolen phone. Manager calls Johnny and tells him what I’ve said. Manager tells me he will be right back as he leaves to walk next door to Johnny’s house. Manager comes back with my phone. \n\nMoral of the story, sometime when people call looking or asking for your co-worker it might not be a friend, might not be a scammer, might not be a telemarketer, but your co-worker may be a douche nugget who needs flushed out. \n\nHave a great day!\n\nTLDR; Phone was stole by an employee of a restaurant. I found out who and called the business to ask about him. I used the info to get my phone back.",
            "title_similarity": "0.4273473",
            "sentiment_compound": -0.4581
        },
        {
            "id": "h3g1v4c",
            "score": 1,
            "text": "Idk how this isn't common sense. I see men asking my female coworkers how much we get paid and what time we get off and they blindly answer",
            "title_similarity": "0.6138423",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h3g226r",
            "score": 1,
            "text": "I won't even answer that if they *do* work there.",
            "title_similarity": "0.6898827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g2930",
            "score": 1,
            "text": "Yo I feel like should be common knowledge people really don’t know this???",
            "title_similarity": "0.3864035",
            "sentiment_compound": 0.466
        },
        {
            "id": "h3g2dc1",
            "score": 1,
            "text": "People have gotten so fucking mad at me for avoiding that question. I try not to outright say \"I'm not giving you that information because you might be a weirdo\", I'll just play dumb like I don't know, and the way some people insist, like \"well can you check? Can you ask someone else?\" yeah, now I think you might be a weirdo.",
            "title_similarity": "0.58581424",
            "sentiment_compound": -0.7762
        },
        {
            "id": "h3g2dwf",
            "score": 1,
            "text": "I think a more important response would be \n\n\"I can neither confirm or deny if said person works here. Sorry.\"\n\nBy saying you will pass the information along, you confirm that person works there.",
            "title_similarity": "0.5263662",
            "sentiment_compound": 0.427
        },
        {
            "id": "h3g2ev7",
            "score": 1,
            "text": "This is not a LPT. This is policy at any job, and in some places, it's the law.",
            "title_similarity": "0.4355044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g2j4k",
            "score": 1,
            "text": "Amateur life tip\n\nDoes anyone not know this",
            "title_similarity": "0.57887775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g2lsh",
            "score": 1,
            "text": "Not just schedules at work, but anything at any time.\n\n\"I'm sorry, but even if I knew that information, it still wouldn't be my place to give it out. Unfortunately, I don't know if that person works/lives/volunteers/studies here, but if you would like to leave a message, I'll try to find out and pass your details along to them if I can.\"\n\nIf you are at work (or similar) and the person is persistent (\"You don't even know if he WORKS there? Come on!\"), offer to put them in touch with the HR department. If it's in a private situation, just keep repeating that you're not comfortable talking about it. No-one has the right to make you tell them anything outside of a court of law.",
            "title_similarity": "0.7754308",
            "sentiment_compound": -0.6646
        },
        {
            "id": "h3g2ogc",
            "score": 1,
            "text": "Is this not basic common sense? Like no you don’t give out the personal info of your coworkers to anyone who asks, that would be incredibly stupid. Who makes this shit up?",
            "title_similarity": "0.6900463",
            "sentiment_compound": -0.8403
        },
        {
            "id": "h3g3ed0",
            "score": 1,
            "text": "All it takes is giving away your name. I live in Las Vegas and some very creepy men asked me to join “them” for a night on the town. I politely declined but when they were heading out one of them asked my coworker for my name. The next day I received 3 text messages, a voicemail, and finally an email asking me to join them. I couldn’t figure out how this guy got my information. So I googled my name and my LinkedIn account popped up. I didn’t understand the website apparently as all of my information was public. Phone number, town I live, email…all of it. Moral of the story is know what information companies are taking from you and what they’re sharing. And don’t be the person to share any information about someone else without their permission please.",
            "title_similarity": "0.49314892",
            "sentiment_compound": 0.8627
        },
        {
            "id": "h3g3v0i",
            "score": 1,
            "text": "In reality, you shouldn’t even acknowledge that the person works there. \n\n“I’m sorry who? There are a lot of people who work here and I don’t know them all. You probably should ask them.”",
            "title_similarity": "0.7389777",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h3g4dyz",
            "score": 1,
            "text": "An employee of mine gave my personal cell number out to a customer who said they were my family member and wanted to talk to me about my dad. Yes, it was indeed said family member, but they did not have my new number for a reason as we had a falling out and he proceeded to threaten to come up to my job and bash my face in. Then the employee tried acting like it was MY fault because they didn't know I had this stuff going on. My staff got a very strongly worded memo the very same day. Just because someone doesn't talk about their personal life at work doesn't mean they don't have issues going on, and personal information should remain safe regardless",
            "title_similarity": "0.6549299",
            "sentiment_compound": 0.5844
        },
        {
            "id": "h3g4hsh",
            "score": 1,
            "text": "Especially if they're the police!",
            "title_similarity": "0.25315407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g4swv",
            "score": 1,
            "text": "Nah, its prolly somebody looking to fight one of y'all for talking trash on the internet. Who would I be if I came between it?",
            "title_similarity": "0.43356463",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h3g4uth",
            "score": 1,
            "text": "This isnt a pro tip. Its common sense AND company policy.",
            "title_similarity": "0.5813385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g5u1v",
            "score": 1,
            "text": "I wouldn't call this a pro tip as much as common sense.",
            "title_similarity": "0.3981769",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g6eg0",
            "score": 1,
            "text": "I might know them and their intentions, but I definitely don’t know you or your intentions.",
            "title_similarity": "0.59149784",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h3g6nq7",
            "score": 1,
            "text": "I was the customer in this position once and didn't even think about how it could be a weird thing to ask. A buddy of mine is a mechanic and he NEVER responds or texts or answers the phone, I have a better chance of contacting him by texting his girlfriend. Usually I just run by his store if I ever need to talk to him, he wasn't there one day. I asked another mechanic when his next shift was, he told me, and I came back the next day to see him. Guess I'll refrain from this behavior in the future.",
            "title_similarity": "0.6789199",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h3g6qg3",
            "score": 1,
            "text": "Or give out a colleagues last name for that matter. My wife-to-be got more than one really creepy text messages from dudes trying to pick her up while she worked in retail some years ago. Most likely well meant efforts, but still creepy as fuck on the receiving side.",
            "title_similarity": "0.48295894",
            "sentiment_compound": -0.6138
        },
        {
            "id": "h3g6stu",
            "score": 1,
            "text": "Isn't this common sense? Why anyone would give out anyone's personal details without permission is beyond me.",
            "title_similarity": "0.5073759",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g6yjp",
            "score": 1,
            "text": "Guess it depends on how much I dislike that coworker...\n\nLOOKING AT YOU RANDY!",
            "title_similarity": "0.55031526",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h3g7ct0",
            "score": 1,
            "text": "Where does he work?",
            "title_similarity": "0.52496606",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g7dpc",
            "score": 1,
            "text": "This is just common fucking sense.",
            "title_similarity": "0.07001686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3g8f3a",
            "score": 1,
            "text": "Every time I did this it was either someone’s elderly grandmother, wife, or other family member. Always stuck to it though. Usually just said they aren’t here today. Then told said coworker/boss.",
            "title_similarity": "0.55920994",
            "sentiment_compound": -0.25
        },
        {
            "id": "h3g97am",
            "score": 1,
            "text": "Wow not sure this is an LPT, more like common sense",
            "title_similarity": "0.31781828",
            "sentiment_compound": 0.6839
        },
        {
            "id": "h3gadhf",
            "score": 1,
            "text": "As I recruiter I regularly make reference checks and get ahold of managers by doing this.",
            "title_similarity": "0.41172367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3gahle",
            "score": 1,
            "text": "Oh I usually just give them their number, home address, work schedule and an envelope filled with individual letters that I cut out of magazines",
            "title_similarity": "0.29281002",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h3gcctz",
            "score": 2,
            "text": "As a friend who likes to say hi, this makes me sad :(\n\nI'll probably just say \"hey is so and so working? Let em know waffle-man wants to say hi!\" Instead\n\nEdit: I spelled my username wrong. Smh",
            "title_similarity": "0.44514662",
            "sentiment_compound": -0.69
        },
        {
            "id": "h3gew1n",
            "score": 1,
            "text": "I worked at a high security chemical plant back in the day. We made all sorts of dangerous chemicals. Anyway, once you were inside you were cut off from the world and anyone answering phones couldn’t even acknowledge your existence, let alone you working at the facility, and especially not if you were there.",
            "title_similarity": "0.5420639",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h3gf1wu",
            "score": 1,
            "text": "Got a crush on a cashier. Thought about asking her coworkers when her shifts are so that I would come there every time she’s on her shifts. But then I felt like a creep and never did ask about the shifts. Although I do come regularly just to see her during lunch time to take the stress off of work.",
            "title_similarity": "0.6233238",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h3gf4wi",
            "score": 1,
            "text": "God dammit, don't spoil the tactics I use to give out presents to special people.",
            "title_similarity": "0.43801653",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h3gi7kq",
            "score": 1,
            "text": "I've personally had this happen before. ALWAYS ask management first, and if they're not aware of this person or their situation, never give the info. My previous coworker at a grocery store once did this and happily gave the info of a coworker to, who they did not know was, that other coworker's stalker. Thankfully nothing serious came of it, but it could have been a much worse situation.",
            "title_similarity": "0.61875975",
            "sentiment_compound": -0.2117
        },
        {
            "id": "h3gjgr8",
            "score": 2,
            "text": "This is stalker behavior 101. If their intentions were honest and good they would have the persons phone number and be able to get in touch with them without harassing strangers for information. How is it that they know where they work but don't know how to get in touch with the person? Doesn't make any sense and it's predatory behavior. I don't care if it's an old lady claiming to be so and so's grandmother, I would never.",
            "title_similarity": "0.57623494",
            "sentiment_compound": 0.186
        },
        {
            "id": "h3gl3yy",
            "score": 1,
            "text": "Might be worth explaining what the danger is here: it opens them up to spearphishing attacks. That means the attacker sends them a message personally addressing them, perhaps even referring to you, all to make the message appear more legitimate, to more likely trick the target into doing something they shouldn't.",
            "title_similarity": "0.36155653",
            "sentiment_compound": -0.8617
        },
        {
            "id": "h3glz1f",
            "score": 1,
            "text": "Jokes on you I don't even know",
            "title_similarity": "0.4464751",
            "sentiment_compound": 0.25
        },
        {
            "id": "h3gnjpp",
            "score": 1,
            "text": "Also depending on where you work, you're not allowed to. Most places would even fire you over it.",
            "title_similarity": "0.64292353",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3goyq2",
            "score": 1,
            "text": "I love how life pro tips are common sense.",
            "title_similarity": "0.09271462",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h3gqn59",
            "score": 1,
            "text": "Ya I learned this from Terminator 2",
            "title_similarity": "0.18050574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3gsmnk",
            "score": 1,
            "text": "A co-worker gave my home number (1998) to my ex-wife who was in town and wanted to say hi. My fiancée was not amused to get her call.",
            "title_similarity": "0.5271022",
            "sentiment_compound": -0.2575
        },
        {
            "id": "h3guqsm",
            "score": 1,
            "text": "I have a question about this. I worked at the front desk of a Hollywood production studio. Clients would call all the time to get a hold of employees. However, it was impossible for me to remember the names of every client (it could be 100s of people for 1 movie, we typically had 3-4 projects in the works). Most would get very annoyed when asked to identify which project they were working because they believed we should just know them (\"dont you know who I am!\" ... Uh no dude, youve acted in a couple indie movies, you're not freaking Leonardo DiCaprio). Due to this mentality being so common I was told not to ask for any more information and to just pass them along. \n\nIn a situation like this, how do you do your job without giving out information on co-workers. If they were calling for someone not in office I had to say \"I'm sorry but they're not in right now, I can pass a message along if you would like\". \n\nFortunately this was only over the phone. In person they could not get past my desk unless they had their contract/ID card proving that they are working on a project there and that project was scheduled for that day. Gotta watch a dude get tackled and dragged out because he thought he would be an exception because \"I'M THE DIRECTOR\". Nope dude, you forgot your ID card. That was a fun day.",
            "title_similarity": "0.58515036",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h3gy0ma",
            "score": 1,
            "text": "I had a customer come in asking for my coworker. He was an old guy, at least 60-70, and seemed harmless. I said She wasn’t there, and took down his name and number but didn’t tell him anything. \n\nWhen I delivered the info to her, she told me he had been harassing her non stop. He wanted to have a threesome with her and his wife. He’d been sending flowers and chocolates despite her saying no.",
            "title_similarity": "0.54199624",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h3gz4fe",
            "score": 1,
            "text": "When I was a store manager I made it a policy not to give out information to anyone.",
            "title_similarity": "0.640577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3h1voe",
            "score": 1,
            "text": "What if you don’t like the coworker?",
            "title_similarity": "0.65217644",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h3h3wba",
            "score": 1,
            "text": "Yes as a manager I play close attention to this",
            "title_similarity": "0.2996192",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h3hijsm",
            "score": 1,
            "text": "As a skip tracer, we often call employers, former employers, etc. We legally can't (and ethically shouldn't) tell a third party that someone owes money, has a lien on their vehicle, or anything like that. We also can't identify ourselves as a collection or investigation agency to a third party, but we do have to identify ourselves and our company. That said, many debt collectors and investigators just don't care about those laws and will not identify themselves at all, or lie about their identity.  \n\nA debt collector, process server, or someone along those lines is not a great person to talk to, but there are also malicious people out there that use the same tactics.  \n\nDo not verify whether or not a person is still employed somewhere. I'm okay with giving out tips that make my job harder, because there are *bad people* out there that do the things I do as well.",
            "title_similarity": "0.6839213",
            "sentiment_compound": -0.8549
        },
        {
            "id": "h3hl92v",
            "score": 1,
            "text": "I worked in a town once with a certain drive through I would frequent and one particular worker made the best sandwiches I had ever had from said place consistently and the others did not I would be interested in knowing when whoever the fuck that person worked just so i could plan my lunches accordingly",
            "title_similarity": "0.3427918",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h3hopao",
            "score": 1,
            "text": "Or be polite and answer. It’s most likely a friend who’s asking.",
            "title_similarity": "0.33745205",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h3hoy42",
            "score": 1,
            "text": "Yup, I was taught early on to never give out info and never transfer.\n\n*I am sorry but I can't give out colleagues information as it is against company policy, I can transfer you to reception who may be able to help - if I loose your call please phone xxxxxx for reception.* \n\n*I can't transfer you to another person, I can only transfer you back to reception as per company policy.*\n\n*I am sorry but the best thing would be to phone reception on xxxxxx or email reception@xxxxxxx and they will direct your enquiry to the right person or group.*",
            "title_similarity": "0.5934119",
            "sentiment_compound": 0.8674
        },
        {
            "id": "h3hrep8",
            "score": 1,
            "text": "Found the Hooter girl.",
            "title_similarity": "0.13168299",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3hrqxe",
            "score": 1,
            "text": "Unless they’re in sales lol",
            "title_similarity": "0.45967913",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h3hrvs9",
            "score": 1,
            "text": "I don’t and customers get annoyed but I tell them I am happy to schedule an appt with said employee. So yeah, I guess I do tell them 😳",
            "title_similarity": "0.5184408",
            "sentiment_compound": 0.8422
        },
        {
            "id": "h3hs9o4",
            "score": 1,
            "text": "My friend's ex was following them for a while and was trying to get information about her schedule this way. It was really scary. I honestly can't think of any benign reasons someone would ask for this information second hand like that.",
            "title_similarity": "0.6525339",
            "sentiment_compound": 0.7764
        },
        {
            "id": "h3hszpc",
            "score": 1,
            "text": "I wish someone told me this when I was working my first job ever. A really nice sounding lady was on the phone asking for a coworkers phone number since it was “important” and couldn’t be written down (some nonsense) me being naive did just that; my coworker the next day was talking to me about some crazy lady who kept leaving him voicemails…yeah I felt awful and learned from that mistake fast..",
            "title_similarity": "0.50793946",
            "sentiment_compound": -0.6712
        },
        {
            "id": "h3huv3n",
            "score": 1,
            "text": "Obviously? Hahah. Trying to not spread hate in these troubling times, but huh? No sht?",
            "title_similarity": "0.5584551",
            "sentiment_compound": -0.556
        },
        {
            "id": "h3icy6j",
            "score": 1,
            "text": "\"Unfortunately (not really), that's proprietary and on a need to know basis.\"",
            "title_similarity": "0.42885518",
            "sentiment_compound": -0.34
        },
        {
            "id": "h3k17sq",
            "score": 1,
            "text": "tell me you took out a restraining order without telling me....",
            "title_similarity": "0.5072027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3kdt95",
            "score": 1,
            "text": "file this one under obvious",
            "title_similarity": "0.05176517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3uxon3",
            "score": 1,
            "text": "\"Sorry, I cant share that information due to the privacy act\". This takes the personal aspect out of the social engagement",
            "title_similarity": "0.56063116",
            "sentiment_compound": 0.2052
        },
        {
            "id": "h44cl3d",
            "score": 2,
            "text": "Same goes for questions like \" what time do you close?\" and \"do you have any specials?\"",
            "title_similarity": "0.4249924",
            "sentiment_compound": 0.4329
        }
    ]
}