{
    "LPT: Children can understand a lot more than you realize. Discuss large and significant topics with them in everyday, simple language. They'll have many questions so always try to answer them as good as you can. Let them learn new things and expand their vocabulary - it will make them feel special.\n": [
        {
            "id": "h4t9il2",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.534709",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h4tp7o6",
            "score": 1,
            "text": "Unsubstantiated AND anecdotal! Well done, OP. A textbook violation.",
            "title_similarity": "0.2349655",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h4tzzfg",
            "score": -2,
            "text": "I respectfully disagree. Children are emotional sponges. If you do this you run the risk of instilling crippling anxiety in them. Children do not need to know there is a world of problems. They will find out on their own, however, i'm not opposed to really taking things down several notches to illustrate generic concepts of right and wrong. My point is that children should never be treated like adults. Even though we may think we're helping them we're not taking directly into account their stage of brain development. You could end up inadvertently doing more harm than good, even though your heart is in the right place.",
            "title_similarity": "0.5119394",
            "sentiment_compound": -0.5005
        },
        {
            "id": "h4tsznq",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.06368443"
        },
        {
            "id": "h4txk0m",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "-0.060024958"
        },
        {
            "id": "h4tmjq7",
            "score": 5,
            "text": "#1Answer  them as WELL as you can✅😘",
            "title_similarity": "0.2809814",
            "sentiment_compound": 0.6841
        },
        {
            "id": "h4ti1q3",
            "score": 3,
            "text": "Children is extremely vague. Age matters\n\nAnd it definitely depends on the kid",
            "title_similarity": "0.33512983",
            "sentiment_compound": 0.3336
        },
        {
            "id": "h4u1qug",
            "score": -3,
            "text": "Be prepared, if you raise a kid like this, they will be the smart ass who uses big language and wants proof of everything they are told. \n\nWhen my son was 2 he saw fireworks for the first time. He literally said \"that was colorful and impressive.\" We mentioned how other cities did firework shows too and he demanded proof. Then ask us where those places were and wanted us to show him where on a map compared to where we live. As if he can even comprehend the size of the world yet.\n\nBut he is also so innocent. I asked him if he wanted to catch and eat the rabbit in our yard and he said we dont eat animals. Kid lives on chicken nuggets. I asked him what chicken nuggets are made of and he said \"food\". Yup. Absolutely right. Not ruining your innocence on that one yet.",
            "title_similarity": "0.5860967",
            "sentiment_compound": 0.7509
        },
        {
            "id": "h4tqcvk",
            "score": 9,
            "text": "Reddit needed this.  \n\n\nThe amount of 'your kid is a fucking idiot that won't remember shit' posts is stupid. It's always a commenter bringing the light, but now we have a light-filled post.   \n\nNext step, acknowledging that telling your own kids that santa isn't real is a good thing. It allows them to appreciate the effort the parents put into the event and helps them from being a spoilt brat. To all you parents out there going \"but they are happy\", yes they are. Happy little rats that were lied to for the enjoyment of their carers.",
            "title_similarity": "0.55013776",
            "sentiment_compound": 0.9786
        },
        {
            "id": "h4tfabh",
            "score": -3,
            "text": "You mean send them school at 2? I approve.",
            "title_similarity": "0.41985434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uhl4r",
            "score": 3,
            "text": ">Let them learn new things and expand their vocabulary. It will make them feel special.\n\nThis subreddit is garbage",
            "title_similarity": "0.68679273",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4trt8m",
            "score": 12,
            "text": "\"Hi son. Listen, your mother and I have been discussing having group sex with some swingers we met on craigslist. She thinks it will jeopardize our marriage but I feel like we need to explore our sexual fantasies. What are your thoughts?\"",
            "title_similarity": "0.4249201",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h4twcwx",
            "score": 3,
            "text": "I do this all the time with my son. He’s 8 now and loves learning new things. Always fascinated by everything. In fact yesterday he asked how ocean waves are formed. So I grabbed a piece of paper and drew it out for him. He understood it so well and his look of satisfaction of him being able to understand it was amazing.\n\nI love that if I tell him that we are going to a museum or battle ground… he lights up with joy rather than a roll of the eyes and looks of boredom.",
            "title_similarity": "0.6560999",
            "sentiment_compound": 0.9654
        },
        {
            "id": "h4tf1go",
            "score": 16,
            "text": "There are windmills across the bay at my parents house. When my daughter was 7yrs old I told her they had discovered the island was drifting away from the mainland so they strapped windmills on the island to correct the situation. Her teacher was not happy with me. 😂🤣👍",
            "title_similarity": "0.31277207",
            "sentiment_compound": 0.477
        },
        {
            "id": "h4txvn2",
            "score": -3,
            "text": "i always felt like people who use big words are just being pretentious or doctors. doctors need big words and maybe engineers too.",
            "title_similarity": "0.5754535",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4ty183",
            "score": 0,
            "text": "There's a reason the dude said you need the mind of a child to hack into heaven. \n\nKeep it simple stupid.",
            "title_similarity": "0.4349562",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h4v1loj",
            "score": 0,
            "text": "Except large and significant topics are kinda.. not the thing to share with kids, regardless of if they might understand them or not\n\nThe whole point seems to be to shelter your kids to give them \"a childhood\" and not burden them with adult shit..\n\nDon't worry, they will grow old and learn to resent the world, be pissed off about taxes, break people's hearts, work their life away etc...  There's really no rush to introduce large, adult concepts to them, they will get there in their own time.. just let them be a kid for a while longer\n\nWhen a child has questions, answer them, sure... But to sit one down and lay on some heavy concept.. seems irresponsible as a carer",
            "title_similarity": "0.6081871",
            "sentiment_compound": -0.4837
        },
        {
            "id": "h4v2wwn",
            "score": 0,
            "text": "I have a 17 month old and on a daily basis, I am blown away by what he can understand even though he is just starting to try forming words himself. We are putting a big emphasis on working through his tantrums in a positive way by validating his feelings and he seems to respond much better when we explain things to him even if he can’t articulate much yet. The “terrible twos” are really an amazing time of growth for them.",
            "title_similarity": "0.7071446",
            "sentiment_compound": 0.9198
        },
        {
            "id": "h4tn81x",
            "score": 1,
            "text": "They can also accomplish SO much more than we give them credit for as long as they have someone willing to/able to coach them along the way.",
            "title_similarity": "0.6706116",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h4trpgv",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.060024958"
        },
        {
            "id": "h4ts27q",
            "score": 1,
            "text": "That was always my philosophy too. And honest, too. If they've matured enough to be aware of the subject and question it, better to hear it from me straight up.",
            "title_similarity": "0.6823925",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h4tttsi",
            "score": 1,
            "text": "One of the few things my dad did right, even if a decent portion of what he talked to me about was religious bs or conservative talking points/conspiracy theories. He'd even let me question those to a point so at least i figured out they were bs fairly quick",
            "title_similarity": "0.50671923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ty1vl",
            "score": -1,
            "text": "the real LPT is always...",
            "title_similarity": "0.45228904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ukvt7",
            "score": 1,
            "text": "I am always surprised by my son's ability to reason through topics most adults I encounter having issues with. Being open about what I feel he can emotionally handle allows him grow.",
            "title_similarity": "0.7345066",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h4tsolf",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "-0.060024958"
        },
        {
            "id": "h4u2sim",
            "score": 3,
            "text": "This thread makes me feel better about my writing. I have a webcomic about a 7-year-old girl and her father, and there were some times in it where I hit heavy subjects.\n\nNeedless to say, it's kind of hard to write about a child learning that their mother died giving birth to her, and her father never said anything because he blamed her at first.",
            "title_similarity": "0.43434012",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h4tc1rm",
            "score": 120,
            "text": "This. \n\nWe have 6 nieces and nephews and I find the way my family “protects” them so cringeworthy.",
            "title_similarity": "0.42265263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tpmll",
            "score": 3,
            "text": "If you're not sure what the line between too simple or too complex for their age is, err on the side of too complex. They'll learn.",
            "title_similarity": "0.6051021",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h4tre19",
            "score": 7,
            "text": "> it will make them ~~feel special~~ functioning members of society\n\nftfy",
            "title_similarity": "0.54664373",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h4u2tus",
            "score": 6,
            "text": "*as well as you can",
            "title_similarity": "0.25827092",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4tuocn",
            "score": 8,
            "text": "*As well as you can",
            "title_similarity": "0.25827092",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4tfigs",
            "score": 155,
            "text": "For instance, the use of good vs well.",
            "title_similarity": "0.17445627",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4tkfoj",
            "score": 19,
            "text": "Yes.       \n       \nChildren are also people and though they may not comprehend deeper or more complex ideas, people should still talk to them and let them talk as well.",
            "title_similarity": "0.6843433",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h4tye92",
            "score": 19,
            "text": "This LPT is something very “normal” in French upbringing. It’s like bringing your kid to a café and letting them be part of the conversation. Instead of staring at an iPhone or iPad, they learn new things and practice speaking and socializing.",
            "title_similarity": "0.6041483",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4ti3m5",
            "score": 327,
            "text": "I never baby talked with my kids no matter how young they were. I never water down my vocabulary either. If they don't know a word, they should ask me, look it up, or use context clues.",
            "title_similarity": "0.3865484",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h4tji2b",
            "score": 364,
            "text": "My uncle had a nice way to instill my curiosity: when I asked a question he wouldn't answer it right away, instead he would point me to a specific book or encyclopedia to look up the answer myself. After I read it he would discuss the answer with me. Now that I'm a scientist of a sort it helps me a lot to know how to look up answers and figure things out on my own.",
            "title_similarity": "0.5970936",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h4u18rs",
            "score": 38,
            "text": "“As *well* as you can” is more gooder",
            "title_similarity": "0.41575378",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4tc10i",
            "score": 161,
            "text": "I don’t remember what stirred the question my son asked, but he was like 6 at the time and the conversation went into cellular structure. So I explained the best I could, and next thing you know he’s talking in class about it and the teacher was surprised enough to send us a note.\n\nIt was surprising how much he comprehended about that conversation.",
            "title_similarity": "0.5259887",
            "sentiment_compound": 0.9331
        },
        {
            "id": "h4tl0kf",
            "score": 45,
            "text": "I like to talk a lot and comment what I'm doing. My son, 4, is used to ask if he doesn't get it. So I repeat and replace my every day adult talk with simpler words here and there. Kids are like a sponge absorbing everything you tell them.\n\nKneel down on eye level when explaining stuff; they'll listen more concentrated and focused. Kneel down and listen to their stories, they'll make an extra effort.\n\nAdmit that you don't know everything and promise to look it up, or ask someone who knows - do that together.\n\nAdmit that you have been wrong on something or apologize for snappy comments during a busy day.",
            "title_similarity": "0.75960314",
            "sentiment_compound": 0.8428
        },
        {
            "id": "h4u0n3c",
            "score": 55,
            "text": "My 13 year old cousin has a TON of questions about the world but her parents always shut her down or tell her to \"not talk about those kinds of things\" which I think is super sad. I've never liked kids much but now that she's older I've started taking her out for cousin days so she has a safe person to talk to who she knows will give her answers and be accepting of her curiosity.",
            "title_similarity": "0.48178893",
            "sentiment_compound": 0.7545
        },
        {
            "id": "h4tgann",
            "score": 121,
            "text": "Mr. Rogers did this really well. I don't know if they have old episodes available, but that might be a good resource if they do.",
            "title_similarity": "0.49544424",
            "sentiment_compound": 0.6753
        },
        {
            "id": "h4thao9",
            "score": 1361,
            "text": "My parents embraced this approach. I became the kind of annoying kid who read the papers and wrote letters to the editor at age 8.\n\nBut my grades were excellent and I became an educator when I grew up, so they swear it was worth it.",
            "title_similarity": "0.6363559",
            "sentiment_compound": 0.6894
        },
        {
            "id": "h4tt04r",
            "score": 67,
            "text": "People often comment on the large words my kids use. They always seem dumbfounded when I point out that if you use complex words when speaking with your kids they will use them too.",
            "title_similarity": "0.75214136",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h4tkyum",
            "score": 266,
            "text": "This all fucking day.  My parents hid so much from my brother and me that when the real shit of the world hit me, I couldn’t cope.\n\nI spent years wondering why my life wasn’t perfect like I was told it would be.  I dealt with depression and anxiety.  Checked with my parents, “Oh yeah, we have that in our family.”  WTF?!?  “You we’re too young to know about all that.”\n\nI have two kids now, and my wife and I are VERY open and honest about the difficulties of life.  We are appropriate, and certainly hold back some things that are not age appropriate (though at 12 and 16 years old, there’s not much that isn’t appropriate anymore).\n\nMy kids know I take anxiety meds.  They know I go see a therapist.  They know how difficult our jobs are (public education) and are learning how to better choose professions for themselves.\n\nKids already *know* these things by feeling.  Let them know by knowing.",
            "title_similarity": "0.49876797",
            "sentiment_compound": -0.374
        },
        {
            "id": "h4tk810",
            "score": 92,
            "text": "I agree. What children lack is a large knowledgebase; often their reasoning ability is quite good and for clever kids it can surpass an adult's.\n\nSo tell them what's happening and why.",
            "title_similarity": "0.74392986",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h4tijix",
            "score": 384,
            "text": "They may not understand at all. But our answers will keep them curious and there are two benefits: they appreciate our effort to give explanation and they learn more vocabulary.\n\nMy kid is mainly the latter one. He kept asking random trivial questions that sometimes I am too tired to answer. But I tried to explain most of it using the best words I can choose",
            "title_similarity": "0.7766751",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h4tqlco",
            "score": 325,
            "text": "Parents need to realize they’re raising adults, not children. You plant seeds, you *grow* flowers.",
            "title_similarity": "0.41702628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tcge2",
            "score": 1297,
            "text": "I remember explaining car insurance to my stepdaughter when she was really young. Her only question was \"so if you never wreck your car when you die all the money you paid like goes to your family?\"",
            "title_similarity": "0.3395911",
            "sentiment_compound": 0.0015
        },
        {
            "id": "h4teim1",
            "score": 4340,
            "text": "\"When a child asks you something, answer him, for goodness' sake. But don't make a production of it. Children are children, but they can spot an evasion quicker than adults...\" Atticus Finch",
            "title_similarity": "0.5907209",
            "sentiment_compound": 0.25
        },
        {
            "id": "h4tk3aj",
            "score": 2068,
            "text": "I remember complaining about my 3rd grade teacher and my Dad said: “that’s because she’s a bitch.” \n\nI totally understood what he was getting at and proceeded to tell her that to her face. Needless to say dad made a visit to school that day.",
            "title_similarity": "0.46519494",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h4tsyzy",
            "score": 311,
            "text": "never be embarassed to tell them 'you know what? I don't know' and then find out together.",
            "title_similarity": "0.3673373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tlk1t",
            "score": 330,
            "text": "I would also add to not allow your bias to enter the situation. Teaching children that the world is not black and white is hard to do when you show them only your view.",
            "title_similarity": "0.5183109",
            "sentiment_compound": -0.195
        },
        {
            "id": "h4tkvs4",
            "score": 3860,
            "text": "Once I got laid off.  I told my 6 year old that this had happened, and I would be around the house until I found another job.\n\nKid: \"Why did they lay you off?\"\n\nMe: \"Because they didn't need me to do my work anymore.\"\n\nKid: \"Oh, so what does that mean?\"\n\nMe: \"I guess I have to find another job.\"\n\nKid: \"Is that hard?\"\n\nMe: \"I don't think so, it might take a few months.\"\n\nKid: \"So, you just get another one?\"\n\nMe: \"Yeah, sometime after Christmas.\"\n\nKid: \"Oh, okay.\"\n\nLet him know it was an okay subject for conversation.  Let him know what to expect, and how this change impacts his life.  Put his mind at ease, let him know it's not something I'm worried about.\n\nI think it also demonstrates that I respect him enough to ensure he understands the change, and that I respect and care about how this impacts him.",
            "title_similarity": "0.38104343",
            "sentiment_compound": 0.9635
        },
        {
            "id": "h4tm9i4",
            "score": 924,
            "text": "Agreed. Two grown kids and two teenagers have confirmed that this works. \n\nNot only do your kids grow up knowing the things they need to about their world, they also know you're not afraid to tackle intense subjects honestly. They're far more likely to come to you with questions they need answering, or problems with friends. They'll feel important knowing you trusted them with pivotal data. \n\nEach child is ready for certain subjects at different times, and only you and they can figure that out, but don't be afraid to speak about them... just make sure to clearly define your opinions from facts, so they know the difference, and can imitate that delineation later on. \n\nAs far as vocabulary, I gave each of our kids a thesaurus and a dictionary when they were in grammar school and told them that if they were going to insult their siblings, to use these. Worked like a charm and Reading Comprehension scores were through the roof.",
            "title_similarity": "0.8645022",
            "sentiment_compound": 0.9382
        },
        {
            "id": "h4th1x0",
            "score": 8,
            "text": "Yeah treating kids as if they can't comprehend or at least have a basic understanding of something and letting them figure it out on their own because they will won't help either, especially in this age where the internet is so accessible.",
            "title_similarity": "0.5075174",
            "sentiment_compound": -0.015
        },
        {
            "id": "h4tnm1o",
            "score": 4,
            "text": "As a parent of, I have learned that children are wonderful observers but terrible interpreters.",
            "title_similarity": "0.5831892",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h4toez6",
            "score": 1,
            "text": "Feel special. Not quite Bright,but special. I don't like that word.",
            "title_similarity": "0.23953651",
            "sentiment_compound": -0.2201
        },
        {
            "id": "h4tq850",
            "score": 1,
            "text": "My sister and her husband have three brilliant kids and I know that immersing them in knowledge at an early age was what facilitated their extraordinary intellectual achievement. The thing is, it takes patience and their parent were all about that, explaining things and not getting irritated at their question.",
            "title_similarity": "0.6845758",
            "sentiment_compound": 0.8618
        },
        {
            "id": "h4tr06q",
            "score": 1,
            "text": "My wife and I made a point to stop talking in \"baby talk\" to our daughter as soon as possible. We transitioned to asking her simple questions and when something new we explain it as best as possible for a 1-2 year old. Now she is 2.5 and speaks in semi full sentences, can choose between simple things like what to eat, or tells us what she wants to be happy. Every once in awhile she will use words or phrases we didn't teach her but she picked up from others or a TV show.",
            "title_similarity": "0.60104537",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h4trock",
            "score": 1,
            "text": "I have two nieces (11 and 7 years old) and the questions they ask me always get me. Like:\n\n“What’s the worst curse word you’ve ever said?” \n“What is it like to get a period?”\n“Is it okay to tell your friends you love them?”\nAnd *many* times they’ve asked me “Does God exist?”",
            "title_similarity": "0.52969885",
            "sentiment_compound": 0.8253
        },
        {
            "id": "h4trvnr",
            "score": 35,
            "text": "[deleted]",
            "title_similarity": "-0.060024958"
        },
        {
            "id": "h4ts47n",
            "score": 1,
            "text": "this especially with sex education. My parents were upfront and honest and preferred clinical explanations and anatomy books over euphemisms or metaphors.",
            "title_similarity": "0.5594645",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h4tt2vq",
            "score": 2,
            "text": "Yes! As a child, I was always interested in learning new things and was always reading up and researching various topics, and this habit has followed me into my adulthood. Encourage your kids to be inquisitive.",
            "title_similarity": "0.8095838",
            "sentiment_compound": 0.8655
        },
        {
            "id": "h4ttkvc",
            "score": 12,
            "text": "People dont do this because they are too lazy to answer the questions. Because they are too selfish to feel uncomfortable when the questions get real or personal.",
            "title_similarity": "0.3654914",
            "sentiment_compound": -0.802
        },
        {
            "id": "h4ttoa4",
            "score": 4,
            "text": "LPT and ELI5, what is this, a crossover episode??",
            "title_similarity": "0.15170118",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ttrer",
            "score": 31,
            "text": "My 4-year-old's teacher was impressed that he'd explained (the basics of) brain surgery to her. It wasn't that he was clever; just that I'd recently told him about how Mum came to be in a wheelchair.",
            "title_similarity": "0.535803",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h4tv3jw",
            "score": 1,
            "text": "This is so true! I work in a kindergarten and I absolutely love when kids ask me stuff. I love taking about things and explaining to then to the best of my ability!",
            "title_similarity": "0.8003149",
            "sentiment_compound": 0.9657
        },
        {
            "id": "h4tv7f9",
            "score": 4,
            "text": "When my nieces and nephews were young I was always a favorite with them. The reason was simple. I spoke to them in a normal conversational tone…like they were actual people. Sure I would simplify things for them, but I never gave them sing-song baby talk.",
            "title_similarity": "0.5887477",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h4tv8p0",
            "score": 1,
            "text": "yesssss I'm so sad to see people treating kids as if they are dumb. They might not know a lot of stuff but they only will be dumb if people teach them bullshit for being afraid to tell them the truth or because it's \"cute\" to play with their ignorance. Tip: it's not, and it's going to have an impact on their lives later.",
            "title_similarity": "0.44955292",
            "sentiment_compound": -0.8174
        },
        {
            "id": "h4tvmnx",
            "score": 1,
            "text": "I feel like my neighbors wouldn't like this, having no children of my own.",
            "title_similarity": "0.19724266",
            "sentiment_compound": -0.2047
        },
        {
            "id": "h4tvr6q",
            "score": 2,
            "text": "My dad didn't make a difference in speaking to me VS the others. If I saw something that I liked, he'd speak to me about it and if we shared interests, he'd speak to me with the lingo. We like synths and keyboards and he'd bring magazines where they were seen with all the specs. My mom was in the more practical side of things when answering. That's why people always said \"oh this kid speaks to clearly\".",
            "title_similarity": "0.62225354",
            "sentiment_compound": 0.886
        },
        {
            "id": "h4tvtch",
            "score": 2,
            "text": "\"as **well** as you can\"",
            "title_similarity": "0.24317648",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4tvw6y",
            "score": 2,
            "text": "In my opinion if a kid has genuine curiosity about a subject, they aren't old enough to at least grasp on what it's about. Of course there are stuff that should be explained in a kid friendly way but it should still be the truth that's being told. We may be caught up in surprise but it's unfair to hide them information that they need to learn in order to navigate the world.",
            "title_similarity": "0.5804524",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h4tvwqj",
            "score": 1,
            "text": "Also:\n\nIf you cannot answer a kids question, be honest and tell them. Do not start to invent stuff only to be the person who has always an answer.\n\nJust say you have to look into this topic and can tell them later.",
            "title_similarity": "0.6139784",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h4tvxhk",
            "score": 2,
            "text": "Always remember you’re not raising them to be children, you’re raising them to be adults.",
            "title_similarity": "0.4028163",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tw4sg",
            "score": 68,
            "text": "Don't hysterically overreact in certain situations. Falling and skinning your knee? It's pretty common for a kid. Or when a kid accidentally sees a horror scene. Calmly examine the situation and explain what it means. (Little wound, will heal fine, horror scene, you know it's all fake right? ..) \n\nInstead you have these screaming parents traumatizing the situation or slapping their hands in their kids' face hoping they didn't see anything. (They did, But are now also traumatized by a hysterical parent)",
            "title_similarity": "0.51366806",
            "sentiment_compound": -0.8312
        },
        {
            "id": "h4tw5pb",
            "score": 2,
            "text": "Little fuckers are sponges.",
            "title_similarity": "0.21434425",
            "sentiment_compound": -0.5584
        },
        {
            "id": "h4twdv1",
            "score": 2,
            "text": "Instead of bedtime stories, my daughter likes to pick a topic and ask me questions about. It usually starts with something like \"how many stars are there in the universe?\" (for example) and she will think of questions branching from my explanation (\"what kind of star is the sun?\" \"do other stars have planets too?\" \"do those planets have moons?\" and so on).\n\nMy husband has to come check in after a while, though, because she and I can go on for hours haha.",
            "title_similarity": "0.5334885",
            "sentiment_compound": 0.8504
        },
        {
            "id": "h4twend",
            "score": 2,
            "text": "Superman does good...you know in a post about expanding kids vocab lol",
            "title_similarity": "0.5931777",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h4twqaz",
            "score": 1,
            "text": "Starting what age?",
            "title_similarity": "0.09798685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4twry9",
            "score": 1,
            "text": "My sister and I were discussing the notion of 'coming out of a recession' yesterday while in the car, and my 6 year old nephew said \"what's coming out of a recession mean\". I'm thinking whoa, that's a tough one. My sister turned to him and said, \"it's when people have more money so they feel better about buying expensive things\". He had a lot of follow up questions but it's amazing how it's possible to explain complicated and abstract ideas to kids and they can kind of get it",
            "title_similarity": "0.5423455",
            "sentiment_compound": 0.6407
        },
        {
            "id": "h4txlna",
            "score": 21,
            "text": "I'll take this one step further. Start this with your infant. Talk to them. Alot. Talk about the food you are feeding them, talk about what's going on, talk about what's next. Give them simple choices; Do you want an apple or banana? Both? In the beginning you make the decision for them but you are modelling future behavior. They start understanding long before they have the ability speak and you can start with non-verbal communication for responses. Nodding yes or no, elementary sign language \"More vs. All done\". Even eye contact. \n\nI don't have the scientific literature to back it up but my anecdotal experience (3 kids) is they have less anxiety, more confidence and less frustration when they understand a little of what is going on around them and start finding ways to non-verbally communicate their desires earlier.",
            "title_similarity": "0.6028738",
            "sentiment_compound": 0.8011
        },
        {
            "id": "h4txmxa",
            "score": 1,
            "text": "And don’t be afraid to say “I don’t know”. My two year old asks questions that I don’t know the answer to a lot. So I’ll tell her “I don’t know. Let’s see if we can find out”. My thought is that teaches her that it’s okay to not know the answer and how to find out.",
            "title_similarity": "0.5844398",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h4tyatp",
            "score": 2,
            "text": "Seriously though, malleable sponge brains. It's a big responsibility to make sure a kid understands empathy in my opinion, as early on as possible.",
            "title_similarity": "0.7128494",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h4tyd5h",
            "score": 2,
            "text": "Kids are so much more perceptive than we give them credit for. They can also say some very profound things.",
            "title_similarity": "0.724017",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h4tyec5",
            "score": 2,
            "text": "I think this (the fact children understand a lot more than adults realize) can also go for trauma-- children can be stressed and have problems too, same as adults, and it significantly affects them. If it isn't addressed it can lead to lifelong problems throughout development. Kids know lot more than they let on, but are also overlooked just because they're kids. Talk with your kids about anything and everything!",
            "title_similarity": "0.7714723",
            "sentiment_compound": -0.6948
        },
        {
            "id": "h4tyek0",
            "score": 2,
            "text": "I try to talk to kids like this, like they’re any other person my age. I love seeing the look on their faces, they’re not used to adults talking to them in that way.",
            "title_similarity": "0.74498796",
            "sentiment_compound": 0.8616
        },
        {
            "id": "h4tyjuy",
            "score": 2,
            "text": "We always talked to our kids like they were adults. It confuses kids to have people baby-talk them. They are trying to learn a language, they need parents to demonstrate correct language. \n\nAlso, sheltering your kids from the world does nothing to prepare them for it.",
            "title_similarity": "0.636942",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h4tyk0p",
            "score": 1,
            "text": "Seems more like r/showerthoughts to me",
            "title_similarity": "0.20614874",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h4tylz1",
            "score": 1,
            "text": "https://www.azquotes.com/quote/1070806\n\nIf you can't explain something to a first year student, then you haven't really understood.\n\n--Richard P. Feynman",
            "title_similarity": "0.3902438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4typ8y",
            "score": 1,
            "text": "Does absolutely no one remember what their thought process was or just how it was to be a kid? Fuckin eh",
            "title_similarity": "0.25858822",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h4tytu3",
            "score": 2,
            "text": "[...] as *well* as you can.",
            "title_similarity": "0.26529133",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4tyzt4",
            "score": 12,
            "text": "Don’t underestimate your children. You’ll be surprised what they are capable of.",
            "title_similarity": "0.529529",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h4tz1ab",
            "score": 3,
            "text": "I discussed perspective with my 2.5yo twins today. Not everyone will see things the way you do and that’s ok etc. Good talk.",
            "title_similarity": "0.61328423",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h4tzdr1",
            "score": 2,
            "text": "Is there a wiki but written to explain things to a 4-5 year old?",
            "title_similarity": "0.33395875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4tzhmp",
            "score": 2,
            "text": "Depending on their age and the advent of the internet, each time they hear or see a word they don’t know tell them to look up the definition on dictionary.com\n\nThis is the only reason my vocab is so good. Was born in 1995 so it really helped once I had access to a phone/computer because this happens all the time to me even nowadays. Books are good too because they give context to that word/phrase \n\nThe reason I suggest dictionary.com is because all you gotta do is click thesaurus and it gives you plenty of synonyms to provide context and connect how those words relate to the given word you’re trying to understand the meaning of.\n\nThis is a different idea than this LPT but still.",
            "title_similarity": "0.68358004",
            "sentiment_compound": 0.514
        },
        {
            "id": "h4tzn1s",
            "score": 1,
            "text": "I wish I could but my 10 year old sister continues to just randomly say cheetoh anytime I talk to her.",
            "title_similarity": "0.4756136",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h4tzp4o",
            "score": 3,
            "text": "I don't have kids myself, but I do this whenever I visit my friends with kids. I never baby talk them and I always answer as completely as I can, as if I were speaking directly to my friends",
            "title_similarity": "0.4864615",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h4tzru8",
            "score": 3,
            "text": "Also, when you don’t know the answer, it is completely ok to say I don’t know or I’m not sure. You can even go as far as saying, I can try to find out!",
            "title_similarity": "0.49078476",
            "sentiment_compound": 0.2079
        },
        {
            "id": "h4u0cmn",
            "score": 2,
            "text": "I’m doing that. No problem there. Now, tell me how to get her to sleep more than 4 hours at night.",
            "title_similarity": "0.35606316",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h4u0fq7",
            "score": 1,
            "text": "Is this a tip or telling us wtf to do",
            "title_similarity": "0.2597412",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h4u0om7",
            "score": 3,
            "text": "Thanks Mr Rodgers. Literally how he ran his show.",
            "title_similarity": "0.42800915",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4u0t6q",
            "score": 2,
            "text": "This is how you raise a kid that will skip school years and get a degree at 18 years old",
            "title_similarity": "0.28489769",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u0ulu",
            "score": 2,
            "text": "And while on topic, if you \"hate\" kids, please please please don't be mean to them or just try and avoid them politely. The day my nephew's eyes turned from joyful to pure fear *because of me* is something I will never forget.",
            "title_similarity": "0.46648413",
            "sentiment_compound": 0.3326
        },
        {
            "id": "h4u0win",
            "score": 3,
            "text": "This is easily my #1, go-to advice when a new parent asks me for any tips about raising kids.",
            "title_similarity": "0.62325346",
            "sentiment_compound": 0.34
        },
        {
            "id": "h4u138y",
            "score": 4,
            "text": "I’ve always spoken to my niece and nephew relatively like they are adults, I feel like they deserve that until they don’t listen then I treat them like children.",
            "title_similarity": "0.66259384",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h4u13qd",
            "score": 3,
            "text": "My kid is 1.5. We were talking about what board books to bring on vacation. He went and got the 5 Little Pumpkin books we were talking about and handed them to me for reading.",
            "title_similarity": "0.39618364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u1b6b",
            "score": 3,
            "text": "I've always been of the mind that they are humans so talk to them like a human. I'm pretty sure this is what lead to my child being so advanced in reading and English. Great LPT!",
            "title_similarity": "0.79660404",
            "sentiment_compound": 0.9326
        },
        {
            "id": "h4u1bk9",
            "score": 2,
            "text": "Always try to answer them as well as you can...",
            "title_similarity": "0.632405",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4u1dfm",
            "score": 4,
            "text": "This is known as background knowledge in the education setting. It is one of the top 5 essential elements for children to do well in school. What happens is, they are exposed to concepts they don’t fully understand, but it provides the foundation to gain further knowledge as they grow. For example, when a parent cooks with a toddler they learn about food, nutrition, measurement, safety, etc. As they get older they  build on the knowledge so they can cook on their own.",
            "title_similarity": "0.6267061",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h4u1hex",
            "score": 2,
            "text": "Where is /r/childfree in this thread? They usually come out whenever you bring up kids",
            "title_similarity": "0.6452608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u1ly3",
            "score": 3,
            "text": "I thought it said chicken....",
            "title_similarity": "0.19038582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u1q31",
            "score": 3,
            "text": "Like what I've seen with a few people and their kids in regard to lgbt stuff. Like its not hard for a kid to understand that a guy is with another guy or Dave is Debbie now, if anything it's more the parents putting their own prejudices on the kid. Just explain it to them as if you would explain it to an adult, sure maybe simplify some aspects but be honest and open with them, kids aren't dumb.",
            "title_similarity": "0.5826818",
            "sentiment_compound": 0.886
        },
        {
            "id": "h4u1sb8",
            "score": 3,
            "text": "This will do a fuckton more than just make them feel special. This can save the world. So quit treating your children like they’re fuckin stupid",
            "title_similarity": "0.5352944",
            "sentiment_compound": 0.5729
        },
        {
            "id": "h4u1x4f",
            "score": 2,
            "text": "I have always treated my kids as adults.",
            "title_similarity": "0.46104696",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u1xz5",
            "score": 10,
            "text": "My niece asked why she couldn’t play in the street. I told her it was because drivers can’t see little girls and might hit them with their car and hurt them. \n\nShe asked, “What about little boys? Can they see them?”",
            "title_similarity": "0.34908074",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h4u273v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.06368443"
        },
        {
            "id": "h4u279j",
            "score": 2,
            "text": "Can attest that while it can be painful or awkward sometimes, children are far more capable of understanding even very complex things when you make it a habit to talk to them about it. Also, it’s really important when you’re sharing information that might be scary or sad, that you acknowledge and accept their feelings about it. Obviously “validate their emotions” can be a bad blanket statement if you don’t make a clear distinction between “feelings” and “behavior”. It is okay to be angry about something terrible that happened in the world. It is not okay to express that anger by being hurtful to others. But making sure they are free to feel how they need to feel about this stuff helps to build crucial emotional intelligence and self-compassion, alongside their critical thinking and knowledge.",
            "title_similarity": "0.64209664",
            "sentiment_compound": 0.7657
        },
        {
            "id": "h4u27og",
            "score": 1,
            "text": "My kid is one, and I have never baby talked to her. Just talked to her normal, if she babbles I continue the conversation with my own convo. It amazes me to see her grow and understand simple task as to pick up this, wait, sit, go there, come here.",
            "title_similarity": "0.60526055",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h4u2tne",
            "score": 2,
            "text": "They *are* special. Children are bad ass!",
            "title_similarity": "0.3596331",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h4u2zen",
            "score": 1,
            "text": "Please teach your children consent, your children should not be forced to hug people or kiss them. Teaching kids what others can and can not do to them is extremely helpful and allows them to create boundaries for themselves YOUNG. Also teach your sons and daughters about periods, it shouldn’t be a taboo subject if a 11 year old girl has to deal with bleeding once a month her brother should be able to understand the concept as well.",
            "title_similarity": "0.6167438",
            "sentiment_compound": 0.9507
        },
        {
            "id": "h4u2zqr",
            "score": 1,
            "text": "Agreed and that's exactly what our school system does. It's a 5 day a week thing for 6 hours, works pretty good.",
            "title_similarity": "0.40613106",
            "sentiment_compound": 0.802
        },
        {
            "id": "h4u31de",
            "score": 8,
            "text": "Yes and No. Children often require a TON of explanation, many times, and still tend to recite answers rather than fully understand them. There are many topics that require an enormous amount of supporting information to give them context, like \"what is racism\" and \"why is it bad.\" I still talk with my 6 yo about this stuff but I don't expect her to understand it the same way I do. And hearing her talk about it to someone else would be interesting, because children pick up on some information but not other information and you never know what they get.",
            "title_similarity": "0.71896225",
            "sentiment_compound": 0.5318
        },
        {
            "id": "h4u3408",
            "score": 2,
            "text": "Now realizing that many parents who said their child is “curious” probably just never did this and only explained when asked.",
            "title_similarity": "0.46452385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u34bw",
            "score": 3,
            "text": "I love talking to kids about complex subjects and explaining how things work to them. I don't get how anyone can just ignore them. Being a child is the time when you want to learn and you learn quick. And of course same understanding applies to reverse situations. You can't expect them to know how to do everything. My grandma would get angry at me for not knowing how to clean dishes when no one showed me how to do it. One can't be born with that knowledge, you gotta show them.",
            "title_similarity": "0.6972661",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h4u36fr",
            "score": 2,
            "text": "“Answer then as good as you can”\n\n“Expand their vocabulary”",
            "title_similarity": "0.6607863",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4u37n4",
            "score": 3,
            "text": "It also teaches you about the subject. You never really know a subject until you try and explain it to someone else, especially a curious kid that will ask you “Why?” until you get down to first principles.",
            "title_similarity": "0.54534054",
            "sentiment_compound": 0.3774
        },
        {
            "id": "h4u3bo8",
            "score": 3,
            "text": "There is a distinct difference between comprehension and communicating comprehension. Many people think kids can't understand them when the real problem is the kid struggles to find the words to talk about their understanding, but gets it just fine.",
            "title_similarity": "0.5769619",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h4u3e1k",
            "score": 1,
            "text": "Fucking lmao\n\nOur daughter won't even let us read to her. She's 4.",
            "title_similarity": "0.19842991",
            "sentiment_compound": 0.6361
        },
        {
            "id": "h4u3pa2",
            "score": 3,
            "text": "I intentionally use big words around my son because he'll always ask the definition if he doesn't know the word. He then absorbs those words into his own vocabulary and uses them correctly all the time.\n\nAlso, always correct their grammar if appropriate. I learned with our older kids that uncorrected grammar is much harder for them adjust as they age. My teen still instinctually uses words like \"mostest\" because we always thought it was cute and didn't correct her.",
            "title_similarity": "0.7236829",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h4u3shy",
            "score": 2,
            "text": "I'm done arguing this to parents and other people. Facepalm",
            "title_similarity": "0.3579298",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h4u3tn6",
            "score": 3,
            "text": "As a child I was super observant and I asked many questions. Unfortunately the adults (parents, uncles,...) never took the questions seriously, let alone take the time to answer them properly. Yet the question in mind would still remain and disappointment would loom. It felt refreshing the odd time when someone actually did listen and took my question seriously not treating me like an imbecile.",
            "title_similarity": "0.61596596",
            "sentiment_compound": -0.9137
        },
        {
            "id": "h4u3tp9",
            "score": 2,
            "text": "My grand daughter of three talks a lot. Her dad was writing on a For Sale sign, and she was like “do you need to concentrate?” Or talks about other things and we wonder where she even gets it, because no one talks about the stuff she says with her.",
            "title_similarity": "0.43583158",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h4u3vv4",
            "score": 3,
            "text": "I read a book about this when my kids were very young and started implementing it right away. Basically, when they had questions, I answered them right then, with age friendly language - no shame, no \"we'll talk about this later.\"\n\nThe biggest benefit to all of this is that now, with my kids in high school and middle school, they'll come to me with questions and problems that most teens would never discuss with their parents. \n\nBTW,  car rides are great times to talk with your kids. Side-by-side communication makes things less awkward than face-to-face. Just ask how things are going and let them talk, but don't force it.",
            "title_similarity": "0.7173186",
            "sentiment_compound": 0.7066
        },
        {
            "id": "h4u40qj",
            "score": 3,
            "text": "My dad is a physics teacher and ever since I was a child he answered my questions as completely as possible. Not overly complicating it, but also not over simplificating it. I always cherish that and credit this a little bit for the reason I study engineering and teach physics",
            "title_similarity": "0.5816287",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h4u43fu",
            "score": 1,
            "text": "Not a life pro tip at all, just some stupid parenting suggestion.",
            "title_similarity": "0.18384787",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h4u46sk",
            "score": 3,
            "text": "My pap pap let me read Art of War when I was really little cause it was the book I picked out. He would answer any question i had in detail and the utmost patience. I can remember not understanding the lesson about “always make sure your enemy has a way to retreat.” It made no sense to me and I can imagine a lot of people would shrug off a kid asking something like that, but he took the time to explain it to me. \n\nI miss that man a lot!",
            "title_similarity": "0.57363284",
            "sentiment_compound": -0.5411
        },
        {
            "id": "h4u4dq3",
            "score": 3,
            "text": "Kids may not be the best at verbalizing, but they absolutely understand a lot more than most people realize.",
            "title_similarity": "0.7248198",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h4u4efu",
            "score": 3,
            "text": "This [reminds me of Mr. Rogers](https://www.biography.com/news/mister-rogers-september-11-2001).",
            "title_similarity": "0.23415104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u4hsd",
            "score": 1,
            "text": "If you do not know the answer, tell them. It allows for you both to discover the answer together.  This allows them to be given an example of being inquisitive and open to the possibilities of life rather than feel shut down and closed off for not knowing \n\nLet them grow up with a sense of wonder and a knowing that they can fulfill the wonder and create magic in the world.\n\nIts okay to not know everything and it shows that we never stop learning by being the example when you, the adult, doesnt know th answer.\n\nI love looking up information with my son. We first make a guess and then research together.  \n\nKnowledge is power.\n\nEmpower children.\n\n\"Read more learn more change the globe \" NaS",
            "title_similarity": "0.72791696",
            "sentiment_compound": 0.9134
        },
        {
            "id": "h4u4oyt",
            "score": 3,
            "text": "And it will benefit the parents as well....kids will ask a lot of questions you don't have an answer for.  It will keep you on your toes.",
            "title_similarity": "0.8257239",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4u4vej",
            "score": 1,
            "text": "100% agreed. It really makes me sad when I used to meet the parents of my students, and see how their parents would underestimate and condescend them.",
            "title_similarity": "0.50639683",
            "sentiment_compound": -0.5367
        },
        {
            "id": "h4u4w7b",
            "score": 5,
            "text": "When my father died I told my 5 year old. \n\nMe: grandpa died\n\nHim: why?\n\nMe: he was very sick\n\nHim: oh when will we see him again?\n\nMe: we won’t but we will always see him in our memories and we can talk about him anytime we want\n\nHim: oh okay I’m sad\n\nMe:me too\n\nNo nonsense about angels and heaven and ghosts",
            "title_similarity": "0.33605212",
            "sentiment_compound": 0.1155
        },
        {
            "id": "h4u50yw",
            "score": 2,
            "text": "I try to talk to my kids as if they were adults. Sometimes it's hard not to do like the cute or baby talk when they're really young, but as they get older I stop restricting the words I use (we do avoid swearing) and the way that I talk and just talk to them like they're regular people. My son might not be able to read yet, but he's got a decent vocabulary for someone who's only four!\n\n'Course, he also knows some words I've slipped I'd rather he didn't know... During one of my cringe moments I shouted \"stupid asshole\" at a driver who changed lanes into my bumper on the freeway and almost hit us, and he just. Will. Not. Forget. It. He says it all the time. He thinks it's the funniest phrase in the world. I'm honestly surprised we've never gotten an email from his teacher about him saying it in school. I've actually made some progress though in telling him, \"if you HAVE to say it, say 'stupid butthole' instead, but now I have a son who runs around *sometimes* saying \"stupid butthole\" instead of \"stupid asshole\". To be honest it's a *little* funny and cute when he says it in private but also mortifying that he learned it from me. Not one of my prouder mistakes lol. \n\nTL;DR; Don't forget to watch your [language](https://youtu.be/qBOoYPV_nSU), their little minds are like a sponge.",
            "title_similarity": "0.6686793",
            "sentiment_compound": 0.9043
        },
        {
            "id": "h4u514k",
            "score": 2,
            "text": "We explained the January 6th riot to our 4 year old, and after mulling it over for a while, so understood what happened.",
            "title_similarity": "0.46231058",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h4u5346",
            "score": 3,
            "text": "I have a 13 year old foster kid, at home and while driving I listen to NPR. He'll ask me about what is being said. I always give him the honest truth about what is being discussed. We've been such at home for so long, he is missing out on a lot of the outside world.",
            "title_similarity": "0.44338575",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h4u5c9x",
            "score": 2,
            "text": "Great comment, if I may also add to it, if you don't know an answer to a question be honest and say you don't know. Do not add your own spin of interpretation on subjects that may contribute biased dogma.",
            "title_similarity": "0.35631356",
            "sentiment_compound": 0.743
        },
        {
            "id": "h4u5dhn",
            "score": 2,
            "text": "Do this all the time. My niece and I FaceTime because she moved and I talk to her about everything while making sure that the topics are age appropriate. I often have to explain some words and simple things but I don’t mind. She’s a smart cookie. Love that she has so many questions. I have a lot of questions too and sometimes hers are really good.",
            "title_similarity": "0.82809424",
            "sentiment_compound": 0.9459
        },
        {
            "id": "h4u5ebw",
            "score": 4,
            "text": "Ever since all 3 of my kids were babies I've talked to them in my normal voice and like they are a little adult. I even got my wife to do the same. I also answer every question they have or say I don't know and we'll look it up if possible. They all have benefited in their vocabulary and critical thinking (I'll try to get them to figure out their questions first).",
            "title_similarity": "0.71110016",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h4u5gu8",
            "score": 3,
            "text": "I’ve been doing this with my youngest sister since I met her. I treat her as an equal and I have taught her many things. She has a big interest in baking so I’ve taught her a bunch of recipes.",
            "title_similarity": "0.5944332",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h4u5isv",
            "score": 43,
            "text": "I've always done this, and I end up having deep conversations with the kids in my family. I always get picked to babysit or watch the kids for a few minutes etc because I'm \"so good with kids\".\n\nI just engage with them, talk to them properly, answer their questions properly and treat them like adults on conversation (within reason obviously).\n\nOne of my favourite conversations ever was with my sister, who was 5 at the time. We were sat in the garden at night, me with a beer and her with her juice, and she just randomly asked me \"Who lives on the other Earth?\". I said \"What? What other Earth?\" And she just pointed at the Moon and said \"Up there\". I was taken aback by the fact a 5 year old had just asked this, but I explained to her how it's not another Earth and it's the Moon, which is different. She asked me how is it different? So we talked for quite a while about space and planets/moons etc. Her seemingly taking it all in and asking more questions. The wonder of a child is a beautiful thing.",
            "title_similarity": "0.62109214",
            "sentiment_compound": 0.9111
        },
        {
            "id": "h4u5lg7",
            "score": 2,
            "text": "Yes my brother recent graduated 4th grade and I’m a couple years in high school. He seems like he wouldn’t understand a ton of topics but when I was in 4th I felt the same way I feel now",
            "title_similarity": "0.36869735",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h4u5nhc",
            "score": 3,
            "text": "My husband and I always tell our kids they can ask us about anything or talk to us about anything, they just need to bring it up and we'll try our best to explain or understand. If we don't know how to answer something, we tell them we can't give an answer now, but will look into it and get back to them. \n\nIt's honestly hilarious to me though to hear my 4yo or 6yo explaining condensation or how a rainbow works. Both of my kids have a decent growing vocabulary as well. They learned \"pity\" last night....and \"bitch\" on accident thanks to me. \n\nI've learned to question things more because of them. I was always fine just existing with concepts and everyday things, but now that they're constantly inquiring how everything works, I'm interested in finding out too.",
            "title_similarity": "0.7541201",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h4u5nwm",
            "score": 9,
            "text": "I forget who said this but it’s like “if they’re old enough to ask, they’re old enough to know” though that’s kind of hard to abide by.",
            "title_similarity": "0.4547578",
            "sentiment_compound": 0.1927
        },
        {
            "id": "h4u5qmb",
            "score": 14,
            "text": "Yes.  Especially with family drama.  It’s okay to just tell children things aren’t okay, but the grownups are working on it, and it will be okay.  \n\nMy dad left us suddenly when us kids were elementary-aged.  We were not told anything about where he was, why he left, if we would ever see him again, and not allowed to even ask about it.  So we kids assumed it was our fault.  The trauma from that still lingers….so yeah ma, telling us nothing really “saved us”.",
            "title_similarity": "0.46238744",
            "sentiment_compound": -0.09
        },
        {
            "id": "h4u5r6d",
            "score": 1,
            "text": "*tries to think of everyday simple language*",
            "title_similarity": "0.49233192",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u5uhy",
            "score": 1,
            "text": "Also, if you don’t know; say so.",
            "title_similarity": "0.19067329",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u5yj2",
            "score": 2,
            "text": "And they get really good at quizzes",
            "title_similarity": "0.6268892",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h4u60f7",
            "score": 1,
            "text": "Knew a couple many years ago, in their mid 20s, very poor in the rural south, only had basic education, etc. Good people overall, and not in the rural south \"good people\" dog whistle kind of way, just decent people.\n\nTheir son was around four years old and could talk to you like a teenager or adult. He could have entire conversations with you and let you know what he thought about things, what he wanted and liked/disliked, etc. All in teen/adult type language and sentences, not toddler talk. The parents said it was because they simply talked with him and assumed he could understand as long as they broke things down for him, and they focused on always having conversations _with_ him and didn't patronize or talk _down to_ or _at_ him.\n\nIt was pretty remarkable to see. I was a teenager then but wish I could rewind and tell them they were being awesome parents.",
            "title_similarity": "0.44443703",
            "sentiment_compound": 0.9437
        },
        {
            "id": "h4u65s4",
            "score": 1,
            "text": "I agree with this statement 110%, it’s the same reason Mr. Rogers was so popular with many of us. He believed in talking to children about some tough topics like when Kennedy was assassinated, but he did it in a way that they understood on their level. I would add that, Its always a great idea to follow up the conversation with a question or two just to make sure they understood because sometimes we may think they understood but they may have picked up something we didn’t know we were putting down.",
            "title_similarity": "0.71608543",
            "sentiment_compound": 0.921
        },
        {
            "id": "h4u6djs",
            "score": 1,
            "text": "I’ve been doing this with my niece since she was born and now I’m the “weird Uncle” because I would discuss complicated subjects with her when she would have to ask the meaning of every other word or acronym. She’s a beautiful, brilliant young woman now being 17 and maybe it helped, who knows. \n\nI’d def recommend conducting yourself around young ones with this in mind as it’s better than the alternative. I see how advanced and sophisticated in the 1800s we use to write and know we are capable of so much more if just pushed and influenced towards intelligence vs. ignorance which is easier to succumb to and revel in. \n\nI’m gonna butcher this quote, and I believe it’s a 13th century poet “The beast is free because of ignorance, the Angel is free because of knowledge and in between lies the struggles of man.”",
            "title_similarity": "0.7013558",
            "sentiment_compound": 0.9735
        },
        {
            "id": "h4u6nhr",
            "score": 1,
            "text": "*as well as you can.",
            "title_similarity": "0.2699217",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4u6nsi",
            "score": 1,
            "text": "You should start the School For Kids Who Don't Read Good and Wanna Do Other Stuff Good Too",
            "title_similarity": "0.646006",
            "sentiment_compound": 0.1265
        },
        {
            "id": "h4u6uz2",
            "score": 1,
            "text": "As good as you can?\n\nLol.. as well as you can.\n\nMaybe next time discuss grammar with your child, actually.. Don't. Let them learn at school lmao",
            "title_similarity": "0.6273453",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h4u6zuv",
            "score": 1,
            "text": "I do this with both my kid and my dog. The dog also, surprisingly, seems to understand a lot. I will say things like “You have to wait for dad to come home.” So he will sit by the garage door and then beg dad for whatever he wanted (usually a treat or a walk). My cousin was recently over and while we were talking we got on the subject of dogs and she said “I don’t care for them because I hate barking.” My dog gets up and barks right in her face then goes back to his shady tree to watch us.",
            "title_similarity": "0.45355573",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h4u74kg",
            "score": 1,
            "text": "Teachers are now being expected to use complicated language during instruction in grades as low and kindergarten. Complicated language as in mathematical, linguistic, literary, and scientific terminology that students wouldn't necessarily use until later years. The kids eat it up and understand the words and some of the advanced mathematical and scientific concepts, it's fascinating to see.",
            "title_similarity": "0.7312585",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h4u7imq",
            "score": 1,
            "text": "The only thing kids don’t need to know about in my opinion is money situations. I have extreme money anxiety and probably will my entire life. I’m not sure the best way to go around it but I felt like my family being poor was somehow my fault for a long time",
            "title_similarity": "0.41434228",
            "sentiment_compound": -0.8227
        },
        {
            "id": "h4u7j8j",
            "score": 1,
            "text": "Just talk in general and teach them simple topics like addition subtraction noun verb etc. My brother did this to me and it gave me a huge head start throughout all off school, though its starting to wear off in highschool now lol.",
            "title_similarity": "0.7004962",
            "sentiment_compound": 0.765
        },
        {
            "id": "h4u7kwd",
            "score": 1,
            "text": "I recently told a friend that my parents and I decided to move to Canada when I was 6 years old.\nMy friend laughed and said, “well, your parents decided, you just came along”.\nAnd that made me realize that my parents always made me feel it was a JOINT decision, I even remember them asking if I wanted to move and me agreeing. I hope to make my kids feel that important too, like they’re a valuable family member whose opinions are considered in important family decisions.",
            "title_similarity": "0.5313714",
            "sentiment_compound": 0.9678
        },
        {
            "id": "h4u7ts9",
            "score": 1,
            "text": "How can I incorporate this into my daily routine? My daughter is nearly 3 years old.",
            "title_similarity": "0.3696398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u802h",
            "score": 1,
            "text": "I’ve always done this with my kids. It really works well.",
            "title_similarity": "0.6599182",
            "sentiment_compound": 0.3353
        },
        {
            "id": "h4u81vi",
            "score": 1,
            "text": "They're not more stupid, they just know less, so you need to start at the beginning when you explain stuff. Anything that doesn't require prerequisite knowledge can be explained to them.\n\nI find too many adults lie to kids or avoid explaining things because they think they won't understand and then children have this misrepresentation of reality.",
            "title_similarity": "0.58169734",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h4u86gg",
            "score": 1,
            "text": "That's always been my attitude with my kids. When it came to The Big Sex Talk, there never was one. Anytime sex related things came up (usually prompted by books and media), we would just have a casual, age appropriate talk. No big deal. My kids already knew a fair bit about sex before the dreaded school sex Ed classes.\n\nTo the same degree, we've talked about other heavy topics as well. Some parents don't realize that THEY are the ones making a big deal out of everything, not the kids. Kids don't know - they take their cues from us.\n\nBack to the sex talks, I think the closest we came to big sit-down talks was over STIs. That is a topic that needs to be covered in depth. Also, possibly with my younger son that it's okay to be uninterested in dating. I felt he was feeling like an outsider amongst his peers. Boy, that look of relief on his face was priceless.\n\nBe decent to your kids. Treat them with respect and like they're intelligent beings, folks.",
            "title_similarity": "0.55904055",
            "sentiment_compound": 0.9485
        },
        {
            "id": "h4u8n4m",
            "score": 1,
            "text": "I’m definitely not the best parent in the world. Made some pretty poor decisions while raising my son. He currently has a gpa of 4.1 and is an outstanding person. I partially attribute it to me treating him with respect since he was a baby. I tried to take my time to respond to all of his questions and worries. By doing this, hopefully, I have had a lasting impact on how he goes about problem solving. All you gotta do is answer them with the truth and not blow off their concerns.",
            "title_similarity": "0.5775554",
            "sentiment_compound": 0.8341
        },
        {
            "id": "h4u8taj",
            "score": 1,
            "text": "And that is how my 3yo can explain crane stabilizers to anyone, in detail.",
            "title_similarity": "0.49951833",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u8tit",
            "score": 1,
            "text": "And if you don't have an answer to one of their questions don't bs one, admit it and included them in finding one.",
            "title_similarity": "0.54521054",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h4u8tvp",
            "score": 1,
            "text": "\"Dad, why do I have to pay for ice cream? Even though it is tasty and fun?\"\n\n\"Well son, sit down this is gonna be a long story, but it started with the industrial revolution and its consequences to the human race...\"",
            "title_similarity": "0.509611",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h4u8u5f",
            "score": 1,
            "text": "Preach Reddit bro! 🙌🏼\n\n-From someone who has been a kid before and remembers knowing way more than they thought I did.",
            "title_similarity": "0.62425005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u8vl4",
            "score": 1,
            "text": "My mum took the opposite approach to this, and it was horrible. I knew what was happening, but she wouldn’t discuss anything with me or try to even have me understand. I’d just end up looking like some weird kid asking what divorce was in grade 2",
            "title_similarity": "0.32654518",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h4u8w6t",
            "score": 1,
            "text": "Can personally vouch for this. Have a conversation with a child on equal terms - theirs, not yours - give them space to ask questions and use simple language, topped with technical or unusual words, and you will have a great conversation.\n\nChildren are usually genuine in their interest, even if short spanned, and will demand from you information. And by having to process it for them, it usually helps in helping you further your understanding about the subject.\n\nHowever, be prepared to face adults criticizing this approach. Many just think that a child is by definition stupid and more complex subjects are simply off limits. Some adults will go to great lengths to shelter their children, thinking they are doing them a service.\n\nDon't be discouraged. It's worth it.",
            "title_similarity": "0.79091716",
            "sentiment_compound": 0.9282
        },
        {
            "id": "h4u8ypt",
            "score": 1,
            "text": "Not trying to mock/take away from the tip, but I do this with my kitties. I engage them in real conversations and ask questions and all that. it makes them happy, they give kitty blink kisses, purr heavier and sometimes talk back to me... Lol, I feel a little silly doing it but it feels good for me and I think they enjoy it.",
            "title_similarity": "0.6942948",
            "sentiment_compound": 0.978
        },
        {
            "id": "h4u91e5",
            "score": 1,
            "text": ">Careful the things you say\n\n>Children will listen\n\n>Careful the things you do\n\n>Children will see and learn\n\n>Children may not obey, but children will listen\n\n>Children will look to you for which way to turn\n\n>To learn what to be\n\n>Careful before you say \"Listen to me\"\n\n>Children will listen\n\n-Into the Woods",
            "title_similarity": "0.6147785",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4u92v2",
            "score": 1,
            "text": "And here I am in front of Italie vs. England trying to explain the offside rule to my 8 y.o. Does that count?",
            "title_similarity": "0.29942453",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u95jo",
            "score": 1,
            "text": "> it will make them feel special\n\nThat’s not exactly what I thought your goal was here…",
            "title_similarity": "0.39838052",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h4u9d2y",
            "score": 1,
            "text": "I had a good conversation with my kid about concentration camps after watching the scenes in Shrek where all the fairy tale creatures get rounded up.",
            "title_similarity": "0.54378617",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4u9dyj",
            "score": 1,
            "text": "If you have the time and knowledge, don’t use simple language. Kids love asking a chain of “why” questions and will literally Socrates themselves into learning things. It’s even fun if you have the patience and interest in the topic too",
            "title_similarity": "0.82510364",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h4u9e49",
            "score": 1,
            "text": "!remindme 15 years",
            "title_similarity": "0.19857192",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4u9sz2",
            "score": 1,
            "text": "Therapists and attys say: you're not allowed to over share, just lie to them that everything is going to be ok 😒\n\nWhile expert teachers who study children say they're capable of understand if you take the time to explain things. Also the science proves this though self concept. Who to believe???",
            "title_similarity": "0.5364014",
            "sentiment_compound": 0.7608
        },
        {
            "id": "h4u9tg3",
            "score": 1,
            "text": "I once broke down the organic chemistry of how soap works and made it digestible to kindergarteners.",
            "title_similarity": "0.38049036",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h4u9u2y",
            "score": 1,
            "text": "\"Welcome to parenting advice from people who don't have children. Well be here all week.\"",
            "title_similarity": "0.5266776",
            "sentiment_compound": 0.2928
        },
        {
            "id": "h4u9zf0",
            "score": 2,
            "text": "I tutored kids for a little bit and if something came up that was ever just a little bit higher of a level but I thought it was interesting I would try to tell them. \n\nI though maybe just maybe connecting  something to the larger world would make them remember that original thing just a little better.",
            "title_similarity": "0.709235",
            "sentiment_compound": 0.8723
        },
        {
            "id": "h4u9zn5",
            "score": 1,
            "text": "No shit sherlock",
            "title_similarity": "-0.020527221",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h4u9zs4",
            "score": 1,
            "text": "Ghlizine maxwell had a Reddit account and was a known pedophile",
            "title_similarity": "0.2954484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ua3u9",
            "score": 1,
            "text": "Children really are competent.",
            "title_similarity": "0.48556352",
            "sentiment_compound": 0.3774
        },
        {
            "id": "h4uah9e",
            "score": 1,
            "text": "I love doing this with my 5 year old son! His curiosity, wonder, and understanding always makes me proud.",
            "title_similarity": "0.55333275",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h4uahwe",
            "score": 1,
            "text": "This is something that I learned to do with my nieces and nephew. Kids are endlessly curious, and at about five years old, they can start discussing serious things in small bites.",
            "title_similarity": "0.6122289",
            "sentiment_compound": 0.25
        },
        {
            "id": "h4uaj8s",
            "score": 1,
            "text": "My younger brother remembers NOTHING before she 6.\n\n\nThere's a limit to your LPT",
            "title_similarity": "0.23569",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uajtz",
            "score": 1,
            "text": "Of course they can, kids are incredibly intelligent and with great potential. It's the parents that are 95% of the time some unprepared dumb fucks that don't know shit about any topic and don't know what they're doing.",
            "title_similarity": "0.6272977",
            "sentiment_compound": 0.6016
        },
        {
            "id": "h4ualqn",
            "score": 1,
            "text": "Dad can I go outside?\n\nNo it’s raining.\n\nWhy?\n\nBecause the clouds are full of water and it’s falling back to earth.\n\nWhy?\n\nBecause of gravity\n\nWhy?\n\nBecause gravity is a force that pulls things towards it.\n\nWhy?\n\nWell, rain evaporates into a gas that rises into the clouds before falling back to earth. It’s a cycle.\n\nWhy?\n\nWell if it didn’t happen, there would be no clean water and life could not exist.\n\nWhy?\n\nBecause we need water to live.\n\nWhy?\n\nThat is all i know.\n\nWhy?\n\nBecause I didn’t pay attention in high school okay?\n\nWhy?\n\nBecause i thought science was for nerds and i wanted to spend my time chasing girls and playing sports.\n\nWhy?\n\nBecause i was seeking to replace my absent father’s love with honor from winning and acceptance from attractive members of the opposite sex.\n\nWhy?\n\nBecause i need external validation to feel secure in loving myself.\n\nWhy?\n\nHow about you go play outside in the rain?",
            "title_similarity": "0.3023566",
            "sentiment_compound": 0.9781
        },
        {
            "id": "h4uambi",
            "score": 1,
            "text": "Not only can they understand much bigger issues than we realize,they often have an amazingly simple common sense idea about dealing with it that we've overlooked.",
            "title_similarity": "0.67322516",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h4uamwx",
            "score": 1,
            "text": "As good as you can, huh?",
            "title_similarity": "0.3408781",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4uaonk",
            "score": 1,
            "text": "Mr. Rogers proved this when he confronted topics others would avoid with children",
            "title_similarity": "0.5087129",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h4uaqdp",
            "score": 1,
            "text": "Yes! I have always felt this way. No need to hid things from kids. Just have to find a way to discuss it at their level.",
            "title_similarity": "0.62122595",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h4uaqzc",
            "score": 1,
            "text": "Teach them the proper time to use “well” instead of “good”",
            "title_similarity": "0.5020014",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uawlm",
            "score": 1,
            "text": "I’m going to expand your grammar…as well* as you can",
            "title_similarity": "0.72287405",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h4uaxjt",
            "score": 1,
            "text": "My cousins continue to baffle me every time I see them. Their vernacular and diction mimics that of old scholars",
            "title_similarity": "0.62141085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uay30",
            "score": 1,
            "text": "And smarter in the long run",
            "title_similarity": "0.484124",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4ub1fh",
            "score": 1,
            "text": "I’m gonna say no to this. They still don’t understand “don’t harass the dog.”",
            "title_similarity": "0.19436309",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h4ub1zz",
            "score": 1,
            "text": "Oh talk to them like a person ? Like if they were a person?",
            "title_similarity": "0.40552366",
            "sentiment_compound": 0.6553
        },
        {
            "id": "h4ub2j4",
            "score": 1,
            "text": "I'm certainly thankful my parents shared their financial management wisdom and a number of topics like credit cards, saving, retirement, investing etc with me before I started thinking a credit card was some magical way to acquire things for free",
            "title_similarity": "0.5583553",
            "sentiment_compound": 0.969
        },
        {
            "id": "h4ub3rv",
            "score": 1,
            "text": "In my old church, lots of the adults were surprised by how much the younger kids liked me. I was 17 and routinely left alone for a few hours at a time with groups of 3rd graders. My mom commented on it one day and I just kind of shrugged and said \"yah. Of course they like me. I don't talk to them like thier idiots. I respect them enough to speak to them like they are people capable of rational thought. They notice that.\"\nShe was baffled and kind of angry at the notion that her and the other adults shouldn't assume that younger meant lesser.",
            "title_similarity": "0.50465566",
            "sentiment_compound": 0.8836
        },
        {
            "id": "h4ub5fh",
            "score": 1,
            "text": "As a teacher and parent, fuck yes.",
            "title_similarity": "0.4039987",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h4ub60c",
            "score": 1,
            "text": "I can confirm, as a kid I loved when adults would listen to my opinions on larger matters and wouldn't make it weird. It really helped me think of myself as my own person.",
            "title_similarity": "0.7509456",
            "sentiment_compound": 0.6724
        },
        {
            "id": "h4ubb4y",
            "score": 1,
            "text": "Back when I was still a kid I used to ask the weirdest questions to my parents, I was already a little thinker back then. \"Mom, how fast does the a rain drop fall?\" Of course over the years as I grew older I became incredibly jaded with my curiosity, because I'd get a negative response more and more often from others and bullied for being a know-it-all or smart ass, and then my parents stopped being around to answer questions too.\n\nNot repeating that mistake with my kid(s), I'll make a walking wikipedia out of them if I they ask it of me.",
            "title_similarity": "0.5370046",
            "sentiment_compound": -0.9367
        },
        {
            "id": "h4ubcgn",
            "score": 1,
            "text": "Talk to your kids about finances and consumerism. Make them understand that there are entire industries dedicated to making them think they will be unhappy unless they own the newest *whatever*. There are people working day and night to make them feel insecure with themselves to turn them into cash registers. Make then understand that everything in this world is a trade-off except for the lucky few. Everything sold has a price but also has a cost.",
            "title_similarity": "0.6050619",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h4ubfbb",
            "score": 1,
            "text": "I teach year 6 (10 and 11) and every week we have an ‘adult’ debate about topics from drug use, suicide, death and sexuality. They really engage with it and always surprise me with their perceptions and opinions. Great little people they are!",
            "title_similarity": "0.6221465",
            "sentiment_compound": -0.202
        },
        {
            "id": "h4ubhqq",
            "score": 1,
            "text": "Or have 3 kids like me and ignore them religiously until they’re literally on fire.",
            "title_similarity": "0.3480108",
            "sentiment_compound": -0.34
        },
        {
            "id": "h4ubjvi",
            "score": 1,
            "text": "And this it what I always do. No baby talk here. Talk to them like an adult and the understanding follows",
            "title_similarity": "0.4846759",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h4ubl6t",
            "score": 2,
            "text": "Answer them as *well* as you can.",
            "title_similarity": "0.41314802",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4ublid",
            "score": 1,
            "text": "\"and so you see, son, quantitative easing is actually debasing currency, which is often conflated with actual wealth, but you must remember, paper money is fiat, and fiat is never going to hold on to wealth in any meaningful way over a prolonged period of time.\"",
            "title_similarity": "0.2708645",
            "sentiment_compound": 0.8705
        },
        {
            "id": "h4ubo4r",
            "score": 1,
            "text": "This is the way. Their innocence and naivety also allow them to observe from a POV that is completely foreign to adults, which can also give you a new appreciation as you respond to their (many, oh so many) questions.",
            "title_similarity": "0.66492486",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h4ubp1k",
            "score": 1,
            "text": "Unexpectedly related pro tip: this also expands the topics around which they have background knowledge and vocabulary and helps improve comprehension when reading",
            "title_similarity": "0.7667797",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h4ubpum",
            "score": 1,
            "text": "Eventually, my daughter asked me to stop creating so many teachable moments and just spank her instead.\n\nI’m not sure when I should bring that up. Her wedding probably wouldn’t be the right time.",
            "title_similarity": "0.42694002",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h4ubyhh",
            "score": 1,
            "text": "Just had a kid myself and everyone keeps saying they're cute now but wait until they start asking questions, then it's annoying. Are you kidding me? I can't wait to indulge their curiosity about the silliest stuff. Wanna talk about dinosaurs for three hours? Fuck yeah. Wanna ask \"Why?\" Until we start getting into abstract concepts? Hell yeah kiddo! I honestly think they'll get tired of talking shit before I do.",
            "title_similarity": "0.5697186",
            "sentiment_compound": -0.936
        },
        {
            "id": "h4ucb0m",
            "score": 1,
            "text": "Yes! This is what my parents did. \n\nBut a word of caution. Please very careful about your language when it comes to money! My parents were not, and made it very very clear in the times we were struggling how little money we had. Which in turn made 6 year old me extremely stressed about being homeless. This had a ripple effect of for year I would not tell my parents when I needed things. I wouldn’t tell them when my clothes and shoes were waaay to small. Because my brain kept that “anything besides food and house bills will make us homeless. “ \n\nI’ve since learned we weren’t actually ever that close to being homeless. But my parents just stressed about money, and because they were very open about everything now I still stress about money. \n\nBut big events, death, social things, science and whatever else a kid asks about answer them! It will teach them to always wonder, and help them learn so much more.",
            "title_similarity": "0.42452443",
            "sentiment_compound": -0.8084
        },
        {
            "id": "h4uccih",
            "score": 1,
            "text": "Alright Timmy, today we’re going to talk about Israel and Palestine. You must pick a side and stick with that choice no matter what happens. You must have a very detailed and concrete opinion on the issue and that opinion must be a core part of your identity. Good luck!",
            "title_similarity": "0.5670128",
            "sentiment_compound": 0.7974
        },
        {
            "id": "h4uceno",
            "score": 1,
            "text": "So true, i wish my mom explained to me more of her problems so i can find some way to help her (cooking or whatever) or explain some problem with me so i can fix it, but she insists she will tell her problem when im 18 so i understand, i can understand it just fine now.",
            "title_similarity": "0.5864591",
            "sentiment_compound": -0.0781
        },
        {
            "id": "h4ucngq",
            "score": 1,
            "text": "This! Man I wish my parents did this to me as a kid I feel like they just thought I was dumb the whole time. My sister did this with my nephew, he’s so freaking smart and down to earth now it’s incredible.",
            "title_similarity": "0.4891414",
            "sentiment_compound": 0.1416
        },
        {
            "id": "h4ucrnk",
            "score": 1,
            "text": "My parents often said \"we are your parents not your friends\"\n\n\nOr \"we dont have to explain, we are your parents\"\n\n\nPlease dont treat your kids like that",
            "title_similarity": "0.34073737",
            "sentiment_compound": -0.0031
        },
        {
            "id": "h4ucush",
            "score": 1,
            "text": "Always use regular vocabulary. Don’t dumb down your speech to kids",
            "title_similarity": "0.621481",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h4ucv5f",
            "score": 1,
            "text": "I keep a list of topics to discuss with the kids as part of their development. It’s amazing how much is missing from the K-12 education system in the US. Maybe it’s better elsewhere.",
            "title_similarity": "0.7430573",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h4ud06u",
            "score": 1,
            "text": "I watch my sisters kids all the time and didn’t realize how often I complain about my other sister not paying her part of the rent until my 7 yo niece told me “you’re such a good aunt, you always pay your rent on time” I’ve since vowed to be a lot more careful with what I say around them",
            "title_similarity": "0.58758414",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h4ud2nj",
            "score": 1,
            "text": "And don't be afraid to tell them you don't know the answer and will look it up together.\n\nThis is extremely valuable for a kid to see and encourages healthy discussions and how to learn about new topics.",
            "title_similarity": "0.79500204",
            "sentiment_compound": 0.8399
        },
        {
            "id": "h4ud5pb",
            "score": 1,
            "text": "Also a good reason not to talk about your children to others like they aren’t right there.",
            "title_similarity": "0.4412444",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h4udctf",
            "score": 1,
            "text": "This also checks your knowledge. If you can’t explain it simply, you don’t know it well enough. My daughter and I have journeyed down a few knowledge rabbit holes with this. She’s about to turn five and is stunningly knowledgeable. Every time I reach an “I don’t know” we both get excited to find out, so she’s always trying to catch me up.",
            "title_similarity": "0.6750104",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h4udi4x",
            "score": 1,
            "text": "I was 8 years old and in third grade when 9/11 happened. The next day, my teacher did this and did her ABSOLUTE best under the circumstances to answer our questions. I still commend her for that to this day. As an adult I can't imagine trying to explain one of the saddest and scariest things to happen to the USA to a classroom of children who didn't really understand the human capacity for evil just yet.",
            "title_similarity": "0.558347",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h4udia1",
            "score": 1,
            "text": "Wow what an amazing life professional tip. Surely many lives will be changed by this amazing tip.",
            "title_similarity": "0.62923306",
            "sentiment_compound": 0.9432
        },
        {
            "id": "h4udndh",
            "score": 1,
            "text": "It’ll also help them become more curious and develop healthy learning habits which can help a lot in life.",
            "title_similarity": "0.7253804",
            "sentiment_compound": 0.8655
        },
        {
            "id": "h4udtp0",
            "score": 1,
            "text": "I love explaining things to my 4yr old like an adult.  His eyes open up as he absorbs everything, stares in wonder.  Then pretends he understands 😆",
            "title_similarity": "0.72423136",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h4udwk2",
            "score": 1,
            "text": "My two year old used to watch “Blaze and the Monster Machines” on Nickelodeon all the time. They talk about physics and science things a lot. We recently did an addition on our house and had to run conduit for the electrical. He asked what it was and I told him it was a wire to help give us power in the new part of the house. He said oh yeah that’s electricity, like Watts (Watts is the name of one of the monster trucks).",
            "title_similarity": "0.43407068",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h4ue9b5",
            "score": 1,
            "text": "No, i want my kid to be ignorant like the boomers before me",
            "title_similarity": "0.37222165",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h4uek3j",
            "score": 1,
            "text": "religious people are fuming",
            "title_similarity": "0.3290205",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h4uepdu",
            "score": 1,
            "text": "My parents always included me in their finances, income, taxes, mortgage, 401k, car maintenance , house repairs, diy projects, and such since I was 10. Now, I have a very deep knowledge on all of these topics as a teen.",
            "title_similarity": "0.58361214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ueqey",
            "score": 1,
            "text": "We’ve always done this with our kids. The only downside of it that I can see is that they seem to be more aware and mature than most kids their age which can feel lonely at times. But they do a great job of educating their friends!",
            "title_similarity": "0.8013115",
            "sentiment_compound": 0.8973
        },
        {
            "id": "h4uez18",
            "score": 1,
            "text": "As we all know, but many will not recognise: children are people and humans too.",
            "title_similarity": "0.5496376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uf5u8",
            "score": 1,
            "text": "Just remember that if you're telling children about very adult problems, you should make sure they understand it's not their job to fix your problems.",
            "title_similarity": "0.47442156",
            "sentiment_compound": -0.5233
        },
        {
            "id": "h4uffrt",
            "score": 1,
            "text": "Kids are ignorant, not stupid.  There’s a huge difference.",
            "title_similarity": "0.5786596",
            "sentiment_compound": 0.4545
        },
        {
            "id": "h4ufi2z",
            "score": 1,
            "text": "My wife and I always discuss partial physics and quantum mechanics the same with our children as we would with each other.",
            "title_similarity": "0.5951485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ufk3d",
            "score": 1,
            "text": "I feel like this is clear to people who remember being a kid and not as obvious to people who forget.  No shade just some people preserve childhood memories well.  Until my 30s I remembered a huge amount of childhood memories as though they happened yesterday including many times adults thought I would miss what was being talked about but I didn’t.   Even at 35 while they aren’t quite as vivid I still remember a lot.",
            "title_similarity": "0.64186",
            "sentiment_compound": 0.34
        },
        {
            "id": "h4uflu2",
            "score": 1,
            "text": "I have seen a 2 y.o child able to purchase app on ipad.",
            "title_similarity": "0.3874386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ufq32",
            "score": 1,
            "text": "Yes, I make sure to be open about things with my 6-year-old. She's asked about topics that might make other people uncomfortable like \"Why are a bunch of people flying rainbow flags?\" and \"This YouTube video is talking about Black Lives Matter. What does that mean?\" And, we try to inform her the best we can in a neutral way so that she can come to her own conclusions. \n\nWe're also open about death and divorce, but sex is something I'm not quite ready for. My husband is always making lewd comments to me in front of her, and I get embarrassed because I know she picks up on things more than he realizes. It's bad enough that she whistles when I'm getting dressed (something she picked up from him).",
            "title_similarity": "0.53283685",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h4ufuow",
            "score": 1,
            "text": "\"as well as you can.\" Ftfy",
            "title_similarity": "0.36043423",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4ufy3z",
            "score": 1,
            "text": "And make you smarter.",
            "title_similarity": "0.44142514",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4ufy9u",
            "score": 1,
            "text": "Why isn't this the standard view.",
            "title_similarity": "0.13775298",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ufyhh",
            "score": 1,
            "text": "This isn't a large & significant topic, but I was one of the first people in my niece's life to fully explain to her why she shouldn't jump on the couch/chairs/bed. Her parents & my parents would just say \"don't do it; you're not supposed to,\" but I took the time to explain the consequences to her.\n\nIf I saw her doing it, I would say \"hey dude let's not jump on the couch. If you keep doing that, you'll fall and hit your head or something. That probably would hurt, would it? You also may cry if you're hurt, and you don't wanna feel hurt and sad do you?\" Eventually it would turn into \"well you wouldn't want to break your arm and go to the hospital would you?\" when she started watching Doc McStuffins\n\nI did this in other parts of her life; ex. \"why did mom take away my toy?\" \"well you didn't listen to her when she asked you to pick up your plate. Maybe if you pick it up and say sorry maybe she will give it back?\" \n\nI know that when I was also a small, I hated to follow my parents' rules without an explanation. She didn't put two and two together or realize that consequences have potentially bad actions. When her younger brother was the same age & would jump on the couch, she would tell him no then explain to him that he would hurt and cry. And honestly that warms my heart knowing that she's looking out for him & had effectively learned what I had taught her",
            "title_similarity": "0.4367375",
            "sentiment_compound": -0.9622
        },
        {
            "id": "h4ug0zs",
            "score": 1,
            "text": "Just because a child has the intellectual capacity to understand something doesn't mean they have the emotional capacity to do it.\n\nA rather extreme example - a child has the intellectual capacity to understand what hunting is and that we get some of our food that way. They may lack the emotional capacity to clean their first kill, especially if done too early.",
            "title_similarity": "0.5212101",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h4ug4d8",
            "score": 1,
            "text": "I think this is so important. I remember asking my mom for something when I was really young but my mom said no. I got upset and later after dinner she had a paper, she showed us her pay stub, monthly expenses, and where all the money went. I immediately understood to not question when she said no to something and had zero issues with being told no for material things after that.",
            "title_similarity": "0.44118333",
            "sentiment_compound": -0.8367
        },
        {
            "id": "h4ug9du",
            "score": 1,
            "text": "I’ve had some of my 10-11 year old students discuss gay, women’s, trans, children’s etc rights to me like they’ve been activists for decades\n\nI sit and nod because like, I’m just amazed and astounded",
            "title_similarity": "0.6088313",
            "sentiment_compound": 0.875
        },
        {
            "id": "h4ugbnw",
            "score": 1,
            "text": "I've always been an advocate to being able to talk to children like an adults. That includes the tone of voice but with vocabulary they can understand.\n\n Like always thought there's an time and moment for that. Since kids also like to be silly and won't always take it as serious in certain occasions. But when they are curious that's an opening to bring certain topics that. Like everyone each child has different interests of curiosity and levels of attention span which all require patience. But with many other things in life, anything worth fighting for always requires effort an patience.",
            "title_similarity": "0.8080076",
            "sentiment_compound": 0.9587
        },
        {
            "id": "h4ugc1g",
            "score": 1,
            "text": "I read « chicken » and I was like wtf. \n\nOk I’m tired and I need to go to bed.",
            "title_similarity": "0.32789332",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h4uggyb",
            "score": 1,
            "text": "This is the key to raising intelligent kids, anything mentally stimulating; be it the way you converse with them, or the books they read, etc. will result in them being good thinkers/reasoners, creative, and curious.",
            "title_similarity": "0.8093367",
            "sentiment_compound": 0.9186
        },
        {
            "id": "h4ugo11",
            "score": 1,
            "text": "Everything on this sub lately is obvious, nonspecific crap. How tf is \"teach your kid things\" a LPT?",
            "title_similarity": "0.5398146",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h4ugsia",
            "score": 1,
            "text": "But NEVER take away their childhood.  You can discuss topics, let them be a kid but don’t give them adult level anxiety by doing it.",
            "title_similarity": "0.52531534",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h4ugwk0",
            "score": 1,
            "text": "It will make them smarter the more they get involved in critical thinking discussions.\n\n\"Now little Johnny, we'll have to make a major decision. Do we stay with your abusive father for the money or do we leave him but live a life of poverty? What do you think is the best thing for us to do?\"\n\nTough question, but the kid has the right to give an input in this situation since Little Johnny will also be affected by whatever happens.",
            "title_similarity": "0.6073045",
            "sentiment_compound": -0.4606
        },
        {
            "id": "h4uh2h8",
            "score": 1,
            "text": "Many people write off the emotional needs of children after trauma, labeling them \"resilient\". This is not true. I've just read \"The Boy who was Raised by a Dog\" by Bruce Perry, a psych who works with traumatized children. He talks about physiological changes to the brain resulting from childhood trauma and describes case studies and his approach to working with these children. A really interesting read if you're into that sorry of thing.",
            "title_similarity": "0.4828338",
            "sentiment_compound": -0.746
        },
        {
            "id": "h4uh8sf",
            "score": 1,
            "text": "My husband and I recently experienced a miscarriage. Although we were devastated, we made sure to tell our nieces and nephews what happened (age appropriately) if they had questions. My 14 year old niece wants to be a doula, so I was more than happy to share specifics. My 4 year old niece just asked why I wasn't getting bigger, so we kept it at a simple, \"There wasnt enough room in my belly for the baby, so he's in heaven with grandpa now.\" That was good enough for her, and she continued playing. If they're old enough to ask, they're old enough to get an answer.",
            "title_similarity": "0.544782",
            "sentiment_compound": 0.8943
        },
        {
            "id": "h4uhc8g",
            "score": 1,
            "text": "My mother always answered my questions in the age appropriate language and I don’t know if it’s connected but now I am always curious and always want to learn more.",
            "title_similarity": "0.77172065",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h4uhh35",
            "score": 1,
            "text": "As a kid that grew up on Jerry Springer by the time I was 10 I  had seen some shit man..",
            "title_similarity": "0.3799137",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h4uhhj8",
            "score": 1,
            "text": "I was 12 when i wanted to stab my father. I knew exactly what i wanted to do and  consequencesit has.",
            "title_similarity": "0.4619661",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h4ui6dy",
            "score": 1,
            "text": "My mom always laughed at my DH and I when we had long thoughtful conversations with our kids, even as young as 2yrs, to teach them lessons and vocabulary at the same time.\n\n\n\nOur kids are not perfect but man do they have a great vocabulary.",
            "title_similarity": "0.76349413",
            "sentiment_compound": 0.8152
        },
        {
            "id": "h4ui6w7",
            "score": 1,
            "text": "If my daughter asks me about something, I'll always try to answer even if it's embarrassing or adult.\n\nI never, ever say no. I will say it's complicated or difficult or there isn't a definitive answer.\n\nI'll never give her an answer she can't reject or disagree with. I will say something is only my opinion and explain how I arrived it.\n\nShe's eleven. In the last few weeks she's asked about strange matter formation in neutron stars, how she and I will die, how to drive my car, how much I earn, how gay people have children and what my favorite video game was as a child. Among other things.\n\nAlways answer honestly. If you don't know, say so, but find out together.\n\nAnd it was *Head Over Heels* on the zx spectrum.",
            "title_similarity": "0.4624751",
            "sentiment_compound": -0.0333
        },
        {
            "id": "h4uikdm",
            "score": 1,
            "text": "And teach them how to look up answers they don't know",
            "title_similarity": "0.5182395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uimny",
            "score": 1,
            "text": "We made a point of speaking to our children in calm tones but using proper words, even when they were infants. We used words like \"bottle\" rather than \"ba-ba.\"\n\nFolks need to remember that children aren't stupid but inexperienced. And a kid won't learn to speak a language if they don't hear it.",
            "title_similarity": "0.5882355",
            "sentiment_compound": 0.8207
        },
        {
            "id": "h4uio78",
            "score": 1,
            "text": "ELI5 is your friend for explaining complex topics in easy to use language…. Most of the time. Sometimes they get a little complex that’s beyond a 5 year old understanding",
            "title_similarity": "0.68745124",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h4uit3b",
            "score": 1,
            "text": "Watch Bluey, if you make your kids watch any cartoon it’s Bluey.  Bluey is the most perfect child show for children and adults. There’s an episode about fucking evolution and heaven. WATCH BLUEY!!!",
            "title_similarity": "0.558084",
            "sentiment_compound": 0.8567
        },
        {
            "id": "h4uiz49",
            "score": 1,
            "text": "This is also how racism is passed on",
            "title_similarity": "0.17598352",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h4uj7cc",
            "score": 1,
            "text": "BIG YES! Part of a reason I’m so fucked",
            "title_similarity": "0.31432256",
            "sentiment_compound": -0.5385
        },
        {
            "id": "h4ujlik",
            "score": 1,
            "text": "Also realize - kids don't really care all that much for detail.  If they ask, give a short answer.  If they ask for more detail, then give them more details.\n\nThey really don't want to hear a parent emotionally dump or vent on them for 5 minutes.  Keep it to 5 seconds.",
            "title_similarity": "0.4738681",
            "sentiment_compound": -0.7136
        },
        {
            "id": "h4ujrci",
            "score": 1,
            "text": "Source? /u/Ewaldd",
            "title_similarity": "0.14437056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ujuq0",
            "score": 1,
            "text": "Especially when young, right? I’ve only heard younger kids are like a sponge to information.",
            "title_similarity": "0.5483932",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4ujzht",
            "score": 1,
            "text": "Just be careful not to overshare adult things with them. It creates stress on them when we say things to them we should have said to a friend or partner.\n\nThe parent is obligated to fulfill their role as the adult in the relationship. Be open but maintain boundaries.",
            "title_similarity": "0.53364015",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4ukfg0",
            "score": 1,
            "text": "A lot of adults are probably incapable of discussing big topics in simple words. Me for example.",
            "title_similarity": "0.3073877",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h4uksdy",
            "score": 1,
            "text": "Another note, don't forget that kids are kids. Treating children like human people is an excellent place to start when learning to work with kids, but once you have that down you have to go back and remember that these are little people with young minds, and adjust your expectations accordingly. Even if your kid talks a bunch about nature, poetry, and organic foods a lot-- they probably think that nerf guns, video games, or other things of the sort are SUPREMELY cool.\n\nIf you are a parent and you chose to limit kids access to these things, don't pretend that your kid should automatically agree that certain things are bad for development and should not be allowed. If your kid quotes that as a reason then you need to take a step back and think about how your kid is learning to cope with their own identity and likes/dislikes.\n\nSource: I work with a lot of upper middle class kids and a lot of them heartbreakingly have anxiety issues because their friends are allowed things that their parents say will ruin them.",
            "title_similarity": "0.6823355",
            "sentiment_compound": 0.8088
        },
        {
            "id": "h4ukwv7",
            "score": 1,
            "text": "I always consider what's going to be remembered when I talk to my nieces and nephews. They ask questions that they probably haven't thought to ask before sometimes. It's important to be a good resource for information that's truthful and gentle. Kids understand way more complex emotions than they are given credit for, but when they don't understand it's not exactly the end of the world. They'll carry those words with them and understand what they mean later on in their life. They'll learn from what you have say, even if they don't understand it until 10 years later.",
            "title_similarity": "0.76563764",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h4ul49e",
            "score": 1,
            "text": "my sister is a mother who doesn't have conversations like that with her son. I sat down and had a couple real conversations with him. he said he trusts me more than his mom who doesn't talk to him. she yells a lot and doesn't make a lot of sense he says. makes me feel bad for him.",
            "title_similarity": "0.4755147",
            "sentiment_compound": -0.3632
        },
        {
            "id": "h4ulaf8",
            "score": 1,
            "text": "“Why do we keep voting for these people if all they do is nothing or things that hurt us ?” \n\nMe - ………",
            "title_similarity": "0.42125434",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h4uliad",
            "score": 1,
            "text": "Every time I try to explain the pandemic to my now 4 year old, she counters with \"well we didn't get sick\" (though we all had a horrendous flu in December 2019)",
            "title_similarity": "0.45287624",
            "sentiment_compound": -0.3814
        },
        {
            "id": "h4ulnjk",
            "score": 2,
            "text": "You’ve got to get them in on the existential dread early.",
            "title_similarity": "0.4673676",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h4um5qx",
            "score": 1,
            "text": "I don’t speak to children any differently than I would speak to an adult (other than profanity or sexually charged language).\n\nI can’t stand when people insist on speaking to children in a slow, high-pitched voice like they’re deaf or disabled.",
            "title_similarity": "0.48719734",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h4uma4h",
            "score": 1,
            "text": "this reminds me of me trying to explain to my bf’s son how vaccines work, i think he kinda understood, I’m not sure haha",
            "title_similarity": "0.52930343",
            "sentiment_compound": -0.5334
        },
        {
            "id": "h4umajn",
            "score": 1,
            "text": "Has anyone else seen that video that gets reposted on here often where a kid thats like, 3-4 years old is making fun of his dads accident? He asks his dad to repeat a very specific sentence and then proceeds to make a stab at his dad while he's laughing and repeats it in the same manner as his dad did?  \n\n\nThat one really sticks out to me. That's a pretty complex web of jokes from the set up to the punchline for a kid that little. When kids are that little we make them laugh through cheap tricks like peek-a-boo or pretending to fall. In a way, that's got to contribute negatively to the long term growth of your child.   \n\n\nBy opting into cheap jokes and cheesy laughs all day, you're never giving that time to your child to help them develop critical humor. The kind of humor that will become an asset to your childs personality in the future. Something that will help them get the jobs they want, make good friends, and meet the right partners.   \n\n\nThis extends to every facet of raising a child. We are so used to the idea that we are all \"useless\" when we're in diapers that we forget where we came from in the first place. I for one would have appreciated my parents challenging me more as a baby. I would much rather have shit imprinted onto me than have to go back as a full grown adult out on my own and try to figure out how to develop a worthwhile personality.   \n\n\nWe are inadvertently contributing to the growth of a boring human with a stunted maturity if we interact with them in the same way we do the family dog.",
            "title_similarity": "0.48112297",
            "sentiment_compound": 0.9858
        },
        {
            "id": "h4umd8g",
            "score": 1,
            "text": "A corollary - children also understand a lot less than you might realize and carry around a huge number of misconceptions. They are especially bad about things like idioms, and the entirely of adult existence that they have yet to experience,  a great way to avoid confusion is to ask what they know already and work from there.",
            "title_similarity": "0.6085888",
            "sentiment_compound": 0.2516
        },
        {
            "id": "h4umxmy",
            "score": 1,
            "text": "Also, don't use pet names to describe genitalia. My wife's a teacher and one day a student said that her uncle licked her cookie. She didn't think about it immediately, but later found out that that's what she knew as the vagina because that's what people called it around her. People might never realize sexual abuse is happening if children use arbitrary names for their genitals. Just call it a penis or a vagina. Don't make it taboo.",
            "title_similarity": "0.4237103",
            "sentiment_compound": 0.6759
        },
        {
            "id": "h4un3b8",
            "score": 1,
            "text": "One great thing to discuss: grammar. Do as good as you can.",
            "title_similarity": "0.61452657",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h4un6tz",
            "score": 1,
            "text": "And don't be afraid to say \"I don't know\"",
            "title_similarity": "0.2717911",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4un9ek",
            "score": 1,
            "text": "Explaining mixed emotions to children early on can help tremendously.\n\nKids often feel big emotions and its hard for them to describe them. Because they are \"happy mom is here/sad that they have to stop playing\" and letting them know that it's OK to feel both and it's hard to explain. As we get older we experience more and more emotions and learning to identify and how to cope with mixed emotions helps out in the long run.\n\nThere's a book called \"im happy-sad today\" and it's great! It even has a section for parents/educators/etc to help explain what's going on and how to help. Its colorful and easy for them to understand and start a discussion",
            "title_similarity": "0.7754867",
            "sentiment_compound": 0.9699
        },
        {
            "id": "h4ungjb",
            "score": 1,
            "text": "My 5 year old was throwing questions at me the other day when he hits me with, where does wind come from?  I straight had to look that shit up.",
            "title_similarity": "0.29788348",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h4unmc7",
            "score": 1,
            "text": "Excellent tip.  In addition to what you said, this gives children confidence and helps them acquire the tools necessary to find answers to hard questions in life.",
            "title_similarity": "0.7765764",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h4uo4hk",
            "score": 1,
            "text": "My dad did this with me. Never talked down, just used words for my age range. He never left me out of a conversation either. If he was talking to another adult and I didn’t understand, he’d explain It to me. Even if that adult became annoyed bc It was taking awhile. And trust me, I was one of those “why? Why? Why??” kids. It took forever.",
            "title_similarity": "0.61638045",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h4uo4l9",
            "score": 1,
            "text": "*as well as you can.",
            "title_similarity": "0.2699217",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4uo5jb",
            "score": 1,
            "text": "I misread this at first and thought it said \"Chickens\" instead of \"Children\" and boy oh boy was I confused.",
            "title_similarity": "0.30789724",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h4uo82k",
            "score": 1,
            "text": "My mom did this to all of her children because she remembered feeling angry that adults would 'talk down to her' when she was young.\n\nThis helped all of us in school and beyond to the point where my younger brother got a 0 on a grade school paper because \"He didn't write this. This isn't a 7th graders vocabulary.\" He in fact did write it, and he learned all the \"big\" words through his life with our parents just talking to us normally and explaining what any words meant when we didn't know.",
            "title_similarity": "0.5513666",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h4uouiu",
            "score": 1,
            "text": "As someone who grew up around “you’ll get it when you get it” and never getting the answer to my questions from any and all parents, albeit simple questions too, I dare say that even in the face of being *the shittiest* parent, telling your kids the truth truth of the matter (“I was too lazy to actually pick you up from school on time, sorry”) will make them appreciate you A LOT more, even if you’re mean to them. Subjectively speaking, your kids could have every physical need met and still feel like you aren’t their parent vs. being honest about not everything being put together and they’ll feel like they’re having a weird day with a friend that just gets it",
            "title_similarity": "0.6440258",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h4up088",
            "score": 1,
            "text": "I hate that people on the internet constantly think children are braindead little monsters. They just see things differently and use a lot of imagination, but are still highly intelligent and especially insanely patient.",
            "title_similarity": "0.547188",
            "sentiment_compound": 0.4748
        },
        {
            "id": "h4upd7r",
            "score": 1,
            "text": "Brain broken. Read that as \"chicken can understand\" twice in a row and was soo confused",
            "title_similarity": "0.3424803",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h4uqevh",
            "score": 1,
            "text": "Lazy advice.    There is a big difference between a 3 year old and a 17 year old.    LPT Any advice for parents about their kids ought to have an age range than just say kids.",
            "title_similarity": "0.43413943",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h4uqf30",
            "score": 1,
            "text": "As well as you can",
            "title_similarity": "0.2395043",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4uqiuq",
            "score": 1,
            "text": "I think it is also really important for people to realize how much babies can understand. Even before they can speak, they understand lots of words, and very complex social interactions.  \n\nThis goes both ways: Make sure you are talking to your baby and engaging with them in a thoughtful manner, they will learn so much! But also be aware that baby is going to run the show if you let them.  I have seen so many parents not be able to tell the difference between a fake \"I want attention\" cry, and a real \"I am hurt or scared\" cry.",
            "title_similarity": "0.7737361",
            "sentiment_compound": -0.9586
        },
        {
            "id": "h4uqnlu",
            "score": 1,
            "text": "Answer them as WELL as you can. /s (in the voice of a pedantic/ correcting type parent)",
            "title_similarity": "0.593238",
            "sentiment_compound": 0.4278
        },
        {
            "id": "h4uqqnf",
            "score": 1,
            "text": "My toddler is like this. Big topics. Complicated topics. We talk it out. He doesn’t understand most of it, but occasionally he will hit back later out of the blue with something I never thought he could comprehend and apply.",
            "title_similarity": "0.6195029",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h4urolo",
            "score": 1,
            "text": "I misread this as chicken and was very confused.",
            "title_similarity": "0.2728865",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h4us3yj",
            "score": 1,
            "text": "And stop talking about other people in front of them. Some of my relatives do this and their kids have picked up on it and now notice & comment on people’s appearance etc. It’s a gross habit for kids to absorb.",
            "title_similarity": "0.6016105",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h4usi7j",
            "score": 1,
            "text": "dont make things up either, its ok to not know things. it teaches children that no one person has all the answers. look up the answer with them",
            "title_similarity": "0.48361397",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4usjdt",
            "score": 1,
            "text": "r/kidsarefuckingstupid",
            "title_similarity": "0.35997465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4usx12",
            "score": 1,
            "text": "This goes for what they overhear also.",
            "title_similarity": "0.49934822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4usyck",
            "score": 1,
            "text": "I teach art to students of all ages in non-traditional settings. I've had supervisors tell me to 'simplify it' for the little ones because 'it's not really important' that they learn concepts and vocabulary. I always have to remind them this exact point, kids are usually so much more capable than we give them credit for. 'Teaching up' helps kids by showing respect to their abilities and complex cognitive functions that they are developing and building upon. \n\nMaybe the depth of the lessons changes with  developmental milestones but the breadth shouldn't be altered just because they're young. This certainly can be applied to humans at any age really.",
            "title_similarity": "0.7750492",
            "sentiment_compound": 0.8573
        },
        {
            "id": "h4uszea",
            "score": 1,
            "text": "Along the same lines of understanding more than we think--kids watch how we treat ourselves and others. If they hear us use negative self talk and point out everything we think is wrong about ourselves, they'll remember that. Kids don't think of themselves as anything less than perfect as they are until they learn from us that in our society, hating yourself is 'normal' and expected. In my mind, the longer we can push off the next generation learning self-hatred, the better off we'll all be.",
            "title_similarity": "0.6012944",
            "sentiment_compound": -0.2682
        },
        {
            "id": "h4ut5bm",
            "score": 1,
            "text": "You should do that with adults too",
            "title_similarity": "0.36486864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4utajc",
            "score": 1,
            "text": "My 3 year old grand daughter floored me the other day when we were talking about toys and she told us they are made cheap so they break and we have to keep buying more and polluting the planet. She listens and understands so much more than I did at her age.",
            "title_similarity": "0.5286715",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4utl34",
            "score": 1,
            "text": "I do explain complex things, but I use college level words to describe them. I may have the only 4 year old who knows what mediocrity, serendipity are, among other words. When you use them in context you can expand a child's vocabulary.",
            "title_similarity": "0.5925144",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4uun9e",
            "score": 1,
            "text": "My mom did this with me and I have been filled with triple anxiety since I was like 13 - if you’re poor, please don’t tell your kids how broke you are that you don’t know how the rent and utilities will get paid and how will you get gas money if you have to make extra trips everyday so your kids will take the bus so you’ll have enough gas to get to work. After hearing/witnessing how much money my Granma throws at my ungrateful and shitty aunt and the fact my mom bought my alcoholic little sister 2 cars after she got out of rehab and relapsed, I don’t care how much shit costs when someone else is paying. The decade plus of anxiety about being homeless and on the streets is gone and I don’t give a fuck.",
            "title_similarity": "0.3585561",
            "sentiment_compound": -0.9325
        },
        {
            "id": "h4uux2m",
            "score": 1,
            "text": "My daughter is 2.  I try to talk in complete sentences and explain the details of what is happening.  Even if she is only getting 10% of what Im saying I feel its worth it",
            "title_similarity": "0.6481658",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4uuxdn",
            "score": 1,
            "text": "how tf is this a life pro tip?? r/lostredditor",
            "title_similarity": "0.2600602",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4uvef9",
            "score": 1,
            "text": "It will also make them more knowledgeable and make them smarter.",
            "title_similarity": "0.58350253",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4uvf1q",
            "score": 1,
            "text": "My brother literally says “ I don’t care it’s boring” lol so this won’t always work as intended and I don’t want to explain to my brother again, he just doesn’t care about how the wifi works.",
            "title_similarity": "0.31764907",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h4uvhte",
            "score": 1,
            "text": "This LPT won't help stupid parents at all and smart parents already know it!!",
            "title_similarity": "0.31725255",
            "sentiment_compound": 0.5862
        },
        {
            "id": "h4uvjs4",
            "score": 1,
            "text": "I read “Children” as “Chicken” and my reality collapsed around me at once.",
            "title_similarity": "0.3901507",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h4uvolu",
            "score": 3,
            "text": "I work with children a lot in my job. I'm a martial arts instructor. I had told them the value of using polite and formal phrases with adults (using manners), and the surprise and respect they get from them in return.\n\nBut what I came to realize is that children may be equally surprised if you talk to them like they're actual people as well. If you avoid softening your voice and actually speak with them on the same level, you can see in their eyes that you don't have to be an adult to have a conversation with one.\n\nThis doesn't mean you should lay the burdens of the world and other adult themes on them. Their childhood should still be bright and wondrous, and they can slowly come to terms with adulthood as they grow. Mary Poppins said it best: \"A spoonful of sugar helps the medicine go down.\"\n\nI'll clear up one more thing since some people might not see the martial arts world the same as I do: it's not all serious, at least where I train/teach. I arrange games, obstacle courses, and prizes for the kiddos, and try to keep them smiling, sweating, and learning. It's just that when it comes to talking, they're humans too. With the unique social structure of the martial arts world, I couldn't care less how old you are as long as you're doing good work and having a good time. We have ranks but we avoid being all '80s martial arts movie about it.",
            "title_similarity": "0.699617",
            "sentiment_compound": 0.9841
        },
        {
            "id": "h4uvy67",
            "score": 1,
            "text": "It's also important that when they ask you questions you are comfortable saying \"I don't know.\"  That will show them that it's ok to be uncertain, and that's a life lesson a lot of people never seem to learn.  It also opens the door for you to show them how and where to find information when they don't know something.  Which is another skill too many people never seem to develop.",
            "title_similarity": "0.619909",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h4uwaz8",
            "score": 1,
            "text": "Also if they ask you something you dont know.. its ok not to know but they need to learn how to get the answers.",
            "title_similarity": "0.4973976",
            "sentiment_compound": -0.1139
        },
        {
            "id": "h4uwl6v",
            "score": 1,
            "text": "Yes!!!  Don’t baby talk to them, don’t talk down to them, just treat them like an adult and explain more as you go. Understand they’re children but that just means people lacking experience, not idiots (until they’re teenagers).",
            "title_similarity": "0.54040843",
            "sentiment_compound": 0.6515
        },
        {
            "id": "h4uwwq8",
            "score": 1,
            "text": "For example, when to use good vs well. 😐",
            "title_similarity": "0.240884",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4ux5fv",
            "score": 2,
            "text": "My parents used to do this with me, and I’m pretty sure it’s the reason I’ve had depression for 14 years. Growing up they’d push me in everything too, and life was really unrewarding. Then I went off the rails a bit and had lots of counselling. \n\nKnowing too much isn’t always a good thing for a young brain.",
            "title_similarity": "0.45984095",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h4uxd91",
            "score": 1,
            "text": "I am SO looking forward to the \"questions\" phase. I've always had an insatiable desire and excitement for knowledge, and I'm hoping I can do exactly this to pass that on to my daughter.",
            "title_similarity": "0.72597605",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h4uxsuf",
            "score": 1,
            "text": "God, this so much. I get so tired of my dad saying, \"You gotta let 'em be kids,\" in psuedo defense of his overbearing baby talk. Like, yeah, cool, let the kid play and laugh and have fun, but also remember that kid will be an adult one day and you don't want them to forever be a baby.",
            "title_similarity": "0.610754",
            "sentiment_compound": 0.7388
        },
        {
            "id": "h4uy98y",
            "score": 1,
            "text": "When I was a kid, my parents and I would watch the nightly news during dinner and they’d answer any questions I had while we did the dishes. Consequently, they’ve raised a news hound who hates overly-messy kitchens. Wouldn’t have it any other way",
            "title_similarity": "0.48166674",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h4uy9r3",
            "score": 1,
            "text": "That is exactly how I grew up. The consequence is that you get to be more level headed and rational than the rest and that hurt my ability to socialise until I grew to be 18.\n\nPeople pamper you for being the way a perfect sibling, son/daughter or nephew/niece would actually be. I was approachable by adults(ton of perks with that), but felt and still feel disconnected from kids my age.",
            "title_similarity": "0.6116816",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h4uybvr",
            "score": 1,
            "text": "I'm not having a go here but it's \"as best you can.\". And I wholeheartedly agree with you.",
            "title_similarity": "0.38924104",
            "sentiment_compound": 0.8765
        },
        {
            "id": "h4uykab",
            "score": 1,
            "text": "And freely admit it when you don't know the answer! People need to learn that it's okay to just say \"I don't know\". And it gives an opportunity to find the answer together.",
            "title_similarity": "0.59925175",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h4uyp28",
            "score": 1,
            "text": "Also, don't be afraid to admit when you're wrong, or when you don't know the answer.\n\nI had several teachers who would sometimes say: \"I don't know the answer to that, but I'm going to write this down and try to look it up later.\" And then they did. I try to do the same thing with the kids in my life, when I dont have time to look up something on the spot.",
            "title_similarity": "0.6394584",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h4uyupc",
            "score": 1,
            "text": "I like doing this to my little cousins because sometimes they will just accept what I’m saying (not really understanding it) because they think they look smart if they don’t question it too much.",
            "title_similarity": "0.67603326",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h4uyw18",
            "score": 1,
            "text": "No wonder Ron de Santis tells his kids “make America great again”, and read trumps books to them. 🙄",
            "title_similarity": "0.65085506",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4uz8or",
            "score": 1,
            "text": "Put more simply teaching children to be curious is far more valuable than making them believe everything is as it is \"just because\". Teaching children to prioritize memorization over curiosity will only make them be obedient servants.",
            "title_similarity": "0.6662649",
            "sentiment_compound": 0.6901
        },
        {
            "id": "h4uznfz",
            "score": 1,
            "text": "My niece understood the basics of photosynthesis before she was 5.  It was because both of her parents were academics (Master’s and PhD by that point) and taught her the straight scoop.",
            "title_similarity": "0.47665158",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h4uzoz5",
            "score": 1,
            "text": "This a thousand times. My parents always talked down to me or didn’t talk to me at all, and I now have zero understanding of how the world works. I’ve had to spend the past few years of my life (am 18 now) learning what the real world is like because I wasn’t really taught that much growing up. Please, for the love of god, talk to your children as equals. It will seriously help their development and there’re few things you can do to better prepare them for life than treating them how you would treat your spouse or another loved one",
            "title_similarity": "0.53056747",
            "sentiment_compound": 0.9694
        },
        {
            "id": "h4uzrp6",
            "score": 1,
            "text": "Thank you for sharing this. I was literally just speaking to a disgruntled parent about her hatred for LGBTQ teachings being added to a school curriculum. It took forever for me to get her to comprehend, kids already see and hear and understand the things you're hiding from them. You ignoring the subject only means they'll find answers elsewhere and sometimes those answers aren't good.",
            "title_similarity": "0.5652971",
            "sentiment_compound": -0.7356
        },
        {
            "id": "h4uztxk",
            "score": 1,
            "text": "\n\nLifeProGetLecturedByTeenagers\n\nFinally blocking this garbage sub.",
            "title_similarity": "0.28702384",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h4uzz34",
            "score": 1,
            "text": "It will help them not be bullied or sexually assaulted: though nothing is perfect",
            "title_similarity": "0.3547933",
            "sentiment_compound": -0.1037
        },
        {
            "id": "h4uzzm1",
            "score": 1,
            "text": "Explain and teach but dont put your bias and beliefs on them..those are yours from your own life experiences. Allow them to create their own based on their life experiences.",
            "title_similarity": "0.45183364",
            "sentiment_compound": 0.6645
        },
        {
            "id": "h4v04ko",
            "score": 1,
            "text": "Answer questions as good as you can. \n\n.... such as sentence fragmentation.",
            "title_similarity": "0.6092284",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h4v099a",
            "score": 1,
            "text": "Hey, Billy. I just want you to know that we will all become dust in the end. It is inevitable, and all we do before hand matters not. Our lives are just meaningless specks in a universe created through random chance. Everything we love will eventually rot away and be forgotten.",
            "title_similarity": "0.3413697",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h4v1650",
            "score": 1,
            "text": "Most people can’t even answer simple questions, why would they be able to dumb it down if they need it dumbed down?",
            "title_similarity": "0.3893261",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h4v1if9",
            "score": 3,
            "text": "Children always come out with something that will make you think, laugh or cry… or maybe all three. I remember my husband was adamant my daughter (3 at the time) was too young to be told about a family friend passing. But she asked why granny was so sad, so I told her that granny’s best friend had gone to heaven.\n\n3yo: I like it Heaven. It’s got rides.\n\nMe: … okay… but you can’t come back. When you go to Heaven you have to stay.\n\n3yo: Yeah you can! In Nana’s car! \n\nSo I learned that Heaven is a theme park and my mother in law is the grim reaper.",
            "title_similarity": "0.50557065",
            "sentiment_compound": 0.9824
        },
        {
            "id": "h4v1r3p",
            "score": 2,
            "text": "Sorry, it's, \"... answer them as *well* as you can.\"\n\nMight as well teach them proper grammar while you're at it.",
            "title_similarity": "0.6410637",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4v1rl5",
            "score": 1,
            "text": "\"...and that children, is why the many worlds interpretation of quantum mechanics is by many considered superior to the Copenhagen interpretation\"\n\nA reddit parent tonight after reading this post. Probably.",
            "title_similarity": "0.5487444",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h4v29w6",
            "score": 1,
            "text": "I'll be in the pool swimming with my friend's 3 year old and I always tell her about the lifecycle of stars.\n\nShe just Looks at me like \"I have no idea wtf you're talking about 🤔\"",
            "title_similarity": "0.39761823",
            "sentiment_compound": 0.5223
        },
        {
            "id": "h4v2k83",
            "score": 1,
            "text": "i’m constantly amazed at how well my son digests things ive shielded him from.  really forces me to re-examine my thought process",
            "title_similarity": "0.6678651",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h4v2ql7",
            "score": 1,
            "text": "On the topic of children understanding more than most people understand, I know a couple that calls their 2yr old son autistic as a joking insult :(",
            "title_similarity": "0.5314697",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h4v2v80",
            "score": 1,
            "text": "My 7 year old hates Donald trump. Lol. They for sure understand and hear everything.",
            "title_similarity": "0.42986268",
            "sentiment_compound": 0.296
        },
        {
            "id": "h4v2weh",
            "score": 1,
            "text": "I remember asking a lot of questions when I was a child and being really frustrated often when people would just brush me off and say \"you wouldn't understand\".\n\nLike, how do you know I won't understand? I'm asking you a question so you can help me understand! Maybe I would understand if you'd actually answer my questions and give me the knowledge I need to understand, asshole.",
            "title_similarity": "0.61738193",
            "sentiment_compound": -0.4821
        },
        {
            "id": "h4v32bf",
            "score": 1,
            "text": "Finna talk about string theory with my 3 year old",
            "title_similarity": "0.3627258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v3a88",
            "score": 1,
            "text": "As well as you can",
            "title_similarity": "0.2395043",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4v3mqc",
            "score": 1,
            "text": "This is very true! I had a discussion with my 6-year old son today about organ donation, what happens to the body when it dies, and climate change.",
            "title_similarity": "0.34299085",
            "sentiment_compound": 0.5244
        },
        {
            "id": "h4v4axg",
            "score": 1,
            "text": "If you struggle to answer the question, tell them “I’ll need to research/ask somebody that knows more” then post the question on ELI5",
            "title_similarity": "0.49841052",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h4v4bl7",
            "score": 1,
            "text": "Kids are super sponges. You can teach them about things calmly and in a way that helps them. They’ll soak it up like it’s nothing, and it’ll stick pretty well.",
            "title_similarity": "0.7088218",
            "sentiment_compound": 0.9393
        },
        {
            "id": "h4v4j3r",
            "score": 1,
            "text": "Oh yeah. I have been showing my girls how rough other kids threw out the world have it. Shit I have honestly learned a lot with them. You tube has so many good educational documentaries. Living in the United States we are spoiled as far as being able to go grocery shopping and filling up our carts. In Cuba ppl wait hours on end to get one or two items at their grocery stores that bare for the most part. The only meat they have sometimes is hotdogs. So that documentary lead to explaining communism. Not bad for a 7 and 8 yr old to understand.",
            "title_similarity": "0.5054669",
            "sentiment_compound": 0.8566
        },
        {
            "id": "h4v4nk5",
            "score": 1,
            "text": "What are some large significant topics to bring up to my child?",
            "title_similarity": "0.56320596",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h4v4rh6",
            "score": 1,
            "text": "Why do titles like this always seem to forget we were once kids?  As if we wouldn’t have 1st hand experience in this area?",
            "title_similarity": "0.45330086",
            "sentiment_compound": 0.6322
        },
        {
            "id": "h4v5127",
            "score": 1,
            "text": "Even is they dont quite understand it’s ok to not dumb down topics for them",
            "title_similarity": "0.39086166",
            "sentiment_compound": 0.6329
        },
        {
            "id": "h4v51hy",
            "score": 1,
            "text": "I changed my brake pads last week, and my niece came out to see what I was up to. So I showed her the old pads and the new, and explained how the pads squeeze the rotor to stop the truck. She was so into it! She had lots of questions and listened very closely to each answer. Made my day.",
            "title_similarity": "0.5677688",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h4v55zc",
            "score": 1,
            "text": "Looking forward to having kids someday!",
            "title_similarity": "0.47880572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v5an6",
            "score": 1,
            "text": "Also i guess i can say this for personal experience. when i was young i read books way over my reading level and it taught me to look words up in the thesaurus and stuff. i mean now a days its a google search but still helps expand thought.",
            "title_similarity": "0.64908314",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h4v6c1b",
            "score": 1,
            "text": "I talked to my 7 year old cousin about personal finance recently. I kept expecting him to get bored, but he had a ton of questions",
            "title_similarity": "0.40222034",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h4v6dgo",
            "score": 1,
            "text": "Kids are as dumb as stumps.",
            "title_similarity": "0.190517",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h4v6nt0",
            "score": 1,
            "text": "Within reason treat children like sensible mature adults, because after all isn’t that you are training them to become?",
            "title_similarity": "0.6240457",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h4v6y44",
            "score": 1,
            "text": "My wife and I do this with our daughter. She's currently 2 and her speech is incredible! She asks lots of questions and we answer them as best as we can. A lot of times I will also show her a video that explains her the topic too to help her better understand!",
            "title_similarity": "0.71030843",
            "sentiment_compound": 0.8856
        },
        {
            "id": "h4v70uc",
            "score": 1,
            "text": "This is what made Mr. Rogers so great.  He talked to us like we were adults but remembered we were kids.",
            "title_similarity": "0.6499472",
            "sentiment_compound": 0.5955
        },
        {
            "id": "h4v75l8",
            "score": 1,
            "text": "i got the sex talk when I was 6, does that count?",
            "title_similarity": "0.29932448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v7d3i",
            "score": 1,
            "text": "Answer them as GOOD AS YOU CAN",
            "title_similarity": "0.51762426",
            "sentiment_compound": 0.5622
        },
        {
            "id": "h4v7wca",
            "score": 1,
            "text": "My 4yo understand the concept of planets revolving around the sun and the moon revolving around the earth and also understand the day and night cycle. I told her the basics, she then started questionning what I told her, making observation and learning in the process.",
            "title_similarity": "0.4593825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v8a3j",
            "score": 1,
            "text": "As a new dad I look forward to these conversations",
            "title_similarity": "0.6323081",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4v8jdm",
            "score": 1,
            "text": "The whole family kept commenting how my nephew responded so well to me. I told them it was because I spoke to him as a person, not an idiot. I pointed out I directed my voice to him and spoke clearly, whereas everyone else bobbled their head about and spoke like a baby, I don’t understand what you are saying, how do you expect him to.",
            "title_similarity": "0.682595",
            "sentiment_compound": 0.8639
        },
        {
            "id": "h4v8wpu",
            "score": 1,
            "text": "My stepmom used to teach me a new word every week, and I would always feel so smart and special when I incorporated it into everyday language",
            "title_similarity": "0.7056912",
            "sentiment_compound": 0.7547
        },
        {
            "id": "h4v9c43",
            "score": 1,
            "text": "Talking with my four year old sister about what living things are was a fun topic",
            "title_similarity": "0.55365074",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h4v9et7",
            "score": 1,
            "text": "This is exactly why I treat kids like little adults.",
            "title_similarity": "0.63677317",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h4vaczd",
            "score": 2,
            "text": "We've been speaking to our kids as adults ever since they've been born. I feel this helps with better cognition and speech development. It eventually turned our world upsidedown when my MIL committed suicide and we had to explain to them that they wouldn't be seeing their Gigi any longer. \n\nThis in turn lead to my wife's and my deconstruction process of our whole religion and belief system. It felt like lying to our kids that they'd see their Gigi again in some afterlife. We took a hard look at all our beliefs and decided to not teach our kids anything that wasn't based in fact and had backup proof of science.\n\nNeedless to say leaving my childhood religion has had a  massive effect on all the relationships I once had and it was interesting to see who stayed in my life and who left because of I no longer believed in what they believed. \n\nI want my kids to trust that I will always tell them the truth. Even being real about Santa Claus and the tooth fairy. Kids really do understand and comprehend so much more than most people give them credit for.",
            "title_similarity": "0.4485736",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h4vahgu",
            "score": 1,
            "text": "well since we're on the topic of learning.. its: as well as you can, not \"as good as you can.\"",
            "title_similarity": "0.4275036",
            "sentiment_compound": 0.2008
        },
        {
            "id": "h4vavgz",
            "score": 1,
            "text": "I initially read this as chicken instead of children and promptly imagine discussing the musings of socrates while they happily peck away.",
            "title_similarity": "0.4769132",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h4vaw9e",
            "score": 1,
            "text": "If they're old enough to ask, they're old enough to know.",
            "title_similarity": "0.46258724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vawt4",
            "score": 1,
            "text": "My son always asks random questions about things. Sometimes really deep and very big questions. So I’m very quick to say that I don’t know if I don’t but we will take time to research the answer.  Today was “what is toilets made of?” So we looked into porcelain and what porcelain is.",
            "title_similarity": "0.63623947",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vaxry",
            "score": 1,
            "text": "In the conservative household children are kept in the dark well into adulthood",
            "title_similarity": "0.22266097",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4vbhgi",
            "score": 1,
            "text": "We’re very open with our kids about world events. My seven-year-old is a bit of an old soul and has great views on Theology, racism, Black Lives Matter and the legacy of Residential Schools in Canada. It’s been so rewarding seeing that he understands Truth & Reconciliation better then most adults.",
            "title_similarity": "0.6390205",
            "sentiment_compound": 0.8647
        },
        {
            "id": "h4vbj1v",
            "score": 1,
            "text": "Sounds good, but difficult to work, because sometimes we just don't have the intellectual or emotional capacity to discuss large and significant topics meaningfully in everyday, simple language to our peers, much less our children.",
            "title_similarity": "0.5446373",
            "sentiment_compound": -0.4124
        },
        {
            "id": "h4vbmmn",
            "score": 1,
            "text": "Why bother with simple language?  We just use normal language.  Is matriculate harder for them to learn than graduate?  Homonyms, synonyms, symbiotic, parasitic, etc.  It’s all just new words to them.  The concepts of simple vs complex don’t really apply when you’re learning your first language?",
            "title_similarity": "0.6042353",
            "sentiment_compound": -0.4479
        },
        {
            "id": "h4vchxa",
            "score": 1,
            "text": "I'm an aunt and all of my nieces and nephews love me and I'm \"the cool aunt\" in my family. I'm 100% sure it's because I treat them like little people and not little kids. I talk to them like equals but I also expect them to act like equals to the best of their age ability. For example when I'm around, I ask them to help me with age appropriate tasks and give them responsibilities that make them realize they're important and helpful and not \"just kids.\" The kiddos also rarely misbehave around me and even though there's the occasional crying or kid related drama, it never really blows up. They have \"a moment\" and I talk to them about it and we get past it using words, which I also think they appreciate. Treat a kid like they're smart and important and they'll rise to every opportunity you give them.",
            "title_similarity": "0.68104625",
            "sentiment_compound": 0.9935
        },
        {
            "id": "h4vd4fc",
            "score": 1,
            "text": "Adults speaking to them is what dumbs them down lol. They are born knowing everything 🤔",
            "title_similarity": "0.5154408",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h4vd8q4",
            "score": 1,
            "text": "You mean to tell me that involving your children in major decisions that will affect their lives is a novel concept?\n\nReally. Who would've thought?",
            "title_similarity": "0.47578952",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h4vdkmv",
            "score": 1,
            "text": "I did this. \n\nIt works well.",
            "title_similarity": "0.3790218",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4vefey",
            "score": 1,
            "text": "It also kills a lot of the time on the way to the orphanage. Can't have awkward silence when dropping off junior",
            "title_similarity": "0.40803605",
            "sentiment_compound": -0.4689
        },
        {
            "id": "h4vepqg",
            "score": 1,
            "text": "Read *World Peace and Other 4th Grade Achievements* by John Hunter.  It’s will blow your mind to see the mind of children working on world issues!",
            "title_similarity": "0.5987723",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h4vevfn",
            "score": 1,
            "text": "Yo no offense but I'm not taking vocabulary expansion advice form the guy who uses \"good\" incorrectly",
            "title_similarity": "0.19343099",
            "sentiment_compound": 0.6393
        },
        {
            "id": "h4vf3xj",
            "score": 1,
            "text": "Most adults cant even grasp basic shit, i call bullshit😂",
            "title_similarity": "0.22373681",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h4vf82a",
            "score": 1,
            "text": "This is how not to raise an idiot.",
            "title_similarity": "0.24782431",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h4vfaw7",
            "score": 1,
            "text": "Some call it Home Schooling but in my family we call it Home Education. Parental involvement is a great indicator of children's success as any educator worth their salt will attest.",
            "title_similarity": "0.65358883",
            "sentiment_compound": 0.9331
        },
        {
            "id": "h4vfqhj",
            "score": 1,
            "text": "r/wokekids is trembling",
            "title_similarity": "0.2287178",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h4vfvbc",
            "score": 1,
            "text": "My husband and I try really hard to not have arguments in front of the kids. Sometimes we mess up. We always let them see us working it out and we always talk to them later and explain that adults have big feelings too sometimes but we need to try harder to talk about things and also that the one feeling that doesn't change is how much we love eachother and them. I don't know if  I'm getting it all right but I'm trying.",
            "title_similarity": "0.7326138",
            "sentiment_compound": 0.7954
        },
        {
            "id": "h4vgc1c",
            "score": 1,
            "text": "I learned this from a man named George R Kaiser.  He had a 15 minute conversation with my 1 year old daughter about building a portfolio.  I thought he was crazy .",
            "title_similarity": "0.364654",
            "sentiment_compound": -0.34
        },
        {
            "id": "h4vghwy",
            "score": 1,
            "text": "Plus they won’t talk like fucking babies when they are like 7. I can’t stand that.",
            "title_similarity": "0.2051895",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4vgr2t",
            "score": 1,
            "text": "I love this.\n\nI'm not typically a kid person, but I think that's why they tend to gravitate towards me - I'll talk to them like the real person they are. And you always get the best responses out of them! Some of my best interactions in life are with kids under 12, lol.\n\n My wife got talking about wanting kids and it made me think of what would happen when they (or my potential future nieces/nephews) get to the age of always asking \"why?\". I would answer every one. And when you hit the end of your knowledge rope on the subject, either guide them to a resource to learn more, or, even better, look it up with them! That way you both learn a little bit :)",
            "title_similarity": "0.7706907",
            "sentiment_compound": 0.9856
        },
        {
            "id": "h4vgzkh",
            "score": 1,
            "text": "Nah, let ‘em be kids and discuss ice cream and their favorite color, you fuggin nerds.",
            "title_similarity": "0.5670595",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h4vh80a",
            "score": 1,
            "text": "My father gave me the full out sex talk when I was four. I still vaguely remember it and he started by stating that I would like to get curious about this stuff and that I should know the truth now instead of silly confusing lies like cabbage patches.\n\nHe gave me the drug talk when I was 11, which I found kind of funny at the time as he assumed I was already experimenting with weed, acid, mushrooms, etc. He made a point of telling me to stay away from crack and meth and that I could always come to him if I was curious about anything or was having a bad trip. I had not even tried smoking weed or cigarettes yet so it all seemed a little extreme to me, but it was too nice to know I wouldn't get in trouble if I wanted to try something and could be honest about it.\n\nI'm curious where my mom stood on the sex talk back then, and I know she was very angry years later when she found out about the drug talk. I would ask her now about the sex talk but I can't trust that her response would actually reflect how she felt at the time - it's far more likely she would deny the whole thing ever happened.",
            "title_similarity": "0.4461839",
            "sentiment_compound": 0.6307
        },
        {
            "id": "h4vhfbp",
            "score": 1,
            "text": "My 5 year old daughter drew two hearts today. Inside both hearts were small circles. I asked her what they were and she responded “towns of destruction”\n……….ok.",
            "title_similarity": "0.3840574",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h4vhgym",
            "score": 1,
            "text": "I’m having trouble understanding why this is a LPT. This is the job description of Parent. We are all just different measures of better or worse at it from day to day.",
            "title_similarity": "0.3942898",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h4vhkga",
            "score": 1,
            "text": "And if you are truly trying to keep things from them, assume they are behind every door, they have the ears of a fruit bat, and are capable of reasoning at least 3 years beyond what you would initially assume (though they'll often come to the most distressing possible conclusion).",
            "title_similarity": "0.51942325",
            "sentiment_compound": 0.3626
        },
        {
            "id": "h4vi4rn",
            "score": 1,
            "text": "\"So the Supreme Court won't allow Daddy to issue subprime mortgages. That means you're going to the cheaper private school...\"",
            "title_similarity": "0.26641175",
            "sentiment_compound": 0.4468
        },
        {
            "id": "h4vibux",
            "score": 1,
            "text": "My kid was 5 and I took him to the doctor. I was explaining to him how you had to pay to see a doctor and get treated (America). And I explained that we were very blessed to have insurance. I then went on to explain healthcare insurance to him and how some people don’t actually have it because they can’t afford it. And thereby people don’t go to the doctor when they should and get more sick. He started to feel sad but then understood more gratitude for those in the world. He still brings it up. \n\nThe nurse overheard me talking to him and came in and told me how grateful she was that I was explaining something like to someone such a young age.",
            "title_similarity": "0.4532524",
            "sentiment_compound": 0.904
        },
        {
            "id": "h4vijrr",
            "score": 1,
            "text": "Yes!! I’ve taken this approach with my kids and they hold conversations with adults so much better than I did at their age. They’re curious and learn even when they’re not being taught, always surprising me with something new and I like to think that explaining anything I can has helped.\n\nMy son is mathematically-minded and enjoys charts and graphs so I’ve shown him my budget and how it helps me plan out our money. And my daughter found a coin she didn’t recognize so we looked it up and now she wants to read more about South Korea and visit one day.",
            "title_similarity": "0.716093",
            "sentiment_compound": 0.9536
        },
        {
            "id": "h4vinuj",
            "score": 1,
            "text": "What's the source on this? It doesn't sound true to me and I have no idea how this statement could possibly be supported with real evidence.",
            "title_similarity": "0.1489776",
            "sentiment_compound": -0.3031
        },
        {
            "id": "h4vio8e",
            "score": 1,
            "text": "Can confirm. My daughter is six and everybody is always shocked at how well-spoken and thoughtful she is. We just never \"babied\" her.\n\nThere are some things that aren't age appropriate, if course, so when those topics come up we just tell her that we'll talk more about it when she's older, and for now she just needs to know x/y/z.\n\nShe is bright, sociable, and kind, and none of that comes from my awkward-ass genetics (the ADD, though... that's totally on me). She received high praise from her teachers all year. She plays well with others. All of this, I believe, is based on this approach of talking to her like any other person (maybe with a touch less swearing). If she asks a question, we answer it. And we always emphasize love and kindness. \n\nShe's still a 6yo. She still gets angry or frustrated or sassy. She makes mistakes. But she's patient with herself and others most days. \n\nAnyhow, I'm not here to brag about how awesome my kid is, just to reinforce this approach for new or soon-to-be parents looking for advice. This approach works SO well. It just takes a bit of patience and creativity at times.\n\nSo if anybody is browsing this and taking notes, I'm pretty confident that the other parents here reinforcing this style of parenting, and myself, would be more than happy to give you tips, share stories, etc.\n\nGood luck, and thanks to OP for sharing this LPT!",
            "title_similarity": "0.57745945",
            "sentiment_compound": 0.9949
        },
        {
            "id": "h4viwry",
            "score": 1,
            "text": "I do this with my 4yr old daughter all the time! She asks a LOT of medical related stuff since I'm going to college for Paramedic. I LOVE explaining simply to her what a bruise is, or how many bones are in her tiny hands. She always looks so fascinated when I tell her these things, and it never fails to brighten my entire world.",
            "title_similarity": "0.6408788",
            "sentiment_compound": 0.8791
        },
        {
            "id": "h4vj9ps",
            "score": 1,
            "text": "But don’t mention you did so online or you’ll end up on the front page of /r/thathappened",
            "title_similarity": "0.33118412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vjw0b",
            "score": 2,
            "text": "My dad did this with me when I was really young. He never dumbed anything down (if he used a word I didn't understand, then he would define it for me), and he answered all my questions as thoroughly as he could. If I ever asked him something he didn't have the answer to, he made a big deal out of admitting when you don't know something, and then he would teach me how to find the answer in an encyclopedia or at the library.\n\nHe got me to be passionate about learning before I was 6 years old. The crazy thing is he never graduated from high school. He dropped out freshmen year and got his GED when he was 16. He's pretty well off working as a systems architect now, but he never went to college. He taught me to always accept free training from whatever job you're working, no matter how useless it may seem at the time - not just because it can help you further your career, but because knowledge is intrinsically valuable. That's how he climbed the ladder to where he is today.",
            "title_similarity": "0.54823637",
            "sentiment_compound": 0.9469
        },
        {
            "id": "h4vk6xe",
            "score": 1,
            "text": "The flip side of this is having too serious of conversations with children and it traumatizes them and effects their lives forever (until hopefully reprocessed in therapy).",
            "title_similarity": "0.58487177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vk8ox",
            "score": 1,
            "text": "Seriously. People think kids are dummy thicc dense and dumb and cant understand shit but really they understand a lot more than you think, esp teens. They prob already know a good bit of what youre gonna tell them in fact.",
            "title_similarity": "0.63453084",
            "sentiment_compound": 0.5126
        },
        {
            "id": "h4vkd7v",
            "score": 1,
            "text": "Time to teach my future kids calculus while there a child.",
            "title_similarity": "0.50626767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vkew2",
            "score": 1,
            "text": "\"...always try to answer them as good as you can.\"\n\nHmm... irony.",
            "title_similarity": "0.6518518",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h4vkmwp",
            "score": 1,
            "text": "But please please shield them from your problems or problems that adults only can face. My mother used each of her children as shock absorbers of her frustrations and we all turned out extremely broken inside and having anxiety through the roof",
            "title_similarity": "0.46055928",
            "sentiment_compound": -0.9454
        },
        {
            "id": "h4vktpy",
            "score": 1,
            "text": "One of the most valuable pieces of advice from my mom was “kids are never too young to learn”. She introduced me to death when our first dog died and I coped and also the sex talk at about 10. She helped me immensely on these difficult situations and I notice it’s a huge difference between my friends that had parents that sheltered them from death and sex.",
            "title_similarity": "0.5503706",
            "sentiment_compound": -0.7275
        },
        {
            "id": "h4vlh1z",
            "score": 1,
            "text": "My dad did this with me every summer I'd visit with him. Looking back, it was the one thing that greatly developed my intelligence and made me who I am today. \n\nThanks, dad.",
            "title_similarity": "0.53084403",
            "sentiment_compound": 0.7402
        },
        {
            "id": "h4vlo4v",
            "score": 1,
            "text": "Who knows, might need this in 20 years",
            "title_similarity": "0.18608604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vm0nh",
            "score": 1,
            "text": "answer them as well* as you can",
            "title_similarity": "0.46089873",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4vn1pw",
            "score": 1,
            "text": "I talk to my kids about adult things all the time....\n\nNow my son questions the liability aspect of a pool or trampoline from an attractive nuisance and insurance premium angle....",
            "title_similarity": "0.5915015",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4vnlfa",
            "score": 1,
            "text": "bonus:  if you don't know the answers, find them together.",
            "title_similarity": "0.45743614",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h4voacn",
            "score": 1,
            "text": "Agreed, children are often underestimated.",
            "title_similarity": "0.37305507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4voe01",
            "score": 1,
            "text": "I have very vivid memories of being a young child (8 and younger) and knowing that the adults around me thought I either wasn’t paying attention or that I didn’t understand what they were talking about.  It always made me uncomfortable and a little angry.  I try so hard to not to do that to my daughter.  If it’s not a topic for her to know about yet, it won’t be talked about in front of her.  And if it is something she should know, it will be discussed openly (in age appropriate ways, of course).",
            "title_similarity": "0.5948698",
            "sentiment_compound": -0.4354
        },
        {
            "id": "h4vpfeh",
            "score": 1,
            "text": "Using everyday simple language will expand their vocabulary?",
            "title_similarity": "0.71643937",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h4vqdie",
            "score": 3,
            "text": "I work with kids and has an interesting moment the other day. \n\nI'm colouring with three girls. One of them is colouring a rainbow and she tells me she's gonna put only \"girl colours\" in her rainbow. I ask her what are girl colours to her - she tells me pink and purple, for example. I was about to tell her that boys can also like and wear those colours but one of the two other girls tells her that all colours are for both girls and boys. The other one adds that her brother has a friend who's favorite colour is purple and he's a boy. \n\nThe girl who was colouring a rainbow thinks for a few seconds and then admits that they were right. I was very proud of them for having this conversation. They were all so nice about it!",
            "title_similarity": "0.51371616",
            "sentiment_compound": 0.9764
        },
        {
            "id": "h4vr6c3",
            "score": 1,
            "text": "Probably to discuss with my kid why would Southgate decide to sub in 2 cold-feet players who barely played any minutes to take penalty and let a 19-year-old to take the 5th penalty as well",
            "title_similarity": "0.35270435",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h4vrdjc",
            "score": 1,
            "text": "'Treat your child respectfully and with consideration.' - got it.",
            "title_similarity": "0.44305092",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h4vs203",
            "score": 1,
            "text": "My mom didn't much care for the house we lived in when I was around  6. I figured out how much a house we would want would cost and then tried calculating my Dad's salary (which he didn't tell me, probably for company policy) with how much time he'd been working. The number I got was wrong, but not entirely unrealistic thinking back.\n\nI might feel different when I have kids but there are lots of thing people dont explain to their kids that I just dont understand why. Why would you rather lie to your kid or tell them a fairy tale rather than just explaining things and making them smarter in the process?",
            "title_similarity": "0.39512318",
            "sentiment_compound": 0.3476
        },
        {
            "id": "h4vsb1d",
            "score": 1,
            "text": "To add to this, when they inevitably ask you for information you don't know, look it up on a phone/computer and explain to then the steps you are taking to learn the answer.",
            "title_similarity": "0.537689",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vsbqz",
            "score": 1,
            "text": "My dad taught driver's ed for years.\n\nIt was a family tradition for him to bring one of the kids and have them absolutely crush the test. If a kid can pass the written portion what excuse do you have?\n\nAlso part of this was to have us read and explain parts of the Maine state traffic code.\n\nWe'd usually do this between the ages of 5 and 10. We all passed the test the first try, and none of us were ever stumped explaining even the most complex legal jargon from the traffic code. There was 5 of us.\n\nOur family is pretty smart, but by no means incredible. Kids are just as smart as you let them be.",
            "title_similarity": "0.48307818",
            "sentiment_compound": 0.5849
        },
        {
            "id": "h4vscrx",
            "score": 1,
            "text": "I don’t understand why adults forget this. Like some people bank on the notion that kids are dense and oblivious even. There were definitely things I encountered that I could have really benefited having an adult attempt to sort them out rather than hope I was dumb and would simply ignore it?",
            "title_similarity": "0.5449846",
            "sentiment_compound": 0.1962
        },
        {
            "id": "h4vstla",
            "score": 1,
            "text": "I have an issue with single parents telling a child that when the other parent is not part of their life “ your parent didn’t want you.”  \n\nRecently encountering that. Nice telling her 4 year old son, and explaining he use of “your dad doesn’t want you” for him not being around as she doesn’t want to sugar coat the truth. I wish I could say, well let’s be honest, the real reason your son’s dad isn’t around has nothing to do with him really, he wasn’t even born yet, before the father decided “it was you that he didn’t want In his life and want’s nothing to do with. “.  \n\nBut let’s not sugar coat the truth right— okay let’s not.. the father isn’t in your child’s life not because the dad is a horrible person, but because of your choices also—- when a single parent doesn’t admit that, aren’t they sugarcoating the truth about themself though?  People can still use child language to explain such, but nope some parents “your other parent didn’t want you, wants nothing to do with you” is age appropriate for children at any age? \n\nI’m not a parent, just an educator, so who I am to tell a young parent that maybe she should explain why her child’s dad isn’t around with honesty but not be so harsh about it, and accept some responsibility in what the father isn’t around… her child’s dad didn’t want anything to do with her either. That would not be sugar coaching the truth.",
            "title_similarity": "0.38809884",
            "sentiment_compound": 0.946
        },
        {
            "id": "h4vsx36",
            "score": 1,
            "text": "This is why Blippi is so popular!",
            "title_similarity": "0.516479",
            "sentiment_compound": 0.6005
        },
        {
            "id": "h4vsxg8",
            "score": 1,
            "text": "I'll add to that, maybe you will learn something about yourself through their questions.",
            "title_similarity": "0.50332165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vsxsp",
            "score": 1,
            "text": "Show them multiple view points, don't just indoctrinate them to believe the things you believe.",
            "title_similarity": "0.37949517",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h4vt61m",
            "score": 1,
            "text": "I thought this said chickens instead of children I was so confused",
            "title_similarity": "0.2619089",
            "sentiment_compound": -0.4572
        },
        {
            "id": "h4vt66j",
            "score": 1,
            "text": "Also some kids are assholes and ask questions but tell you you're wrong. :)\n\nOr is that just my 9 yo niece?",
            "title_similarity": "0.46000195",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h4vtatl",
            "score": 1,
            "text": "Maybe, if you answer them as *well* as you can, their vocabulary may improve.",
            "title_similarity": "0.5429863",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h4vv4w2",
            "score": 1,
            "text": "Kids are hilarious! I have 2 step kids one 12 and one 9. I've been apart of their life for 6 years and its been crazy watching them grow. Now I'm a pretty verbal guy and I have a fairly wide vocabulary. I told my kids that if I use a word they don't understand to please interrupt me and I will clarify. So a couple of weeks back my 9 year old used the term \"superfluous\" in a sentence and I was kind of taken off guard by it. She had used it properly, but I decided to ask if she knew what it meant and she gave a reasonable definition. She told me she's been experimenting with words she's heard me and her mom say and putting together meanings from context. I couldn't be more proud of her. Kids can absolutely understand complex/ serious subjects.",
            "title_similarity": "0.5398282",
            "sentiment_compound": -0.6783
        },
        {
            "id": "h4vvewc",
            "score": 1,
            "text": "This.\n\nI don't believe in talking down to kids, mainly because I hated it so much when I was a kid. My mom always answered my \"Why?\", or taught me how to find out for myself. \n\nWhen I had kids, I used my normal vocabulary. I'm neurodivergent, and read books almost constantly, so I use a variety of words. \n\nLittle kids can pick these up too. \n\nAnd \"why\" is literally THE question to answer",
            "title_similarity": "0.591506",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h4vvikw",
            "score": 1,
            "text": "This assumes the parent knows fu*k all about ‘significant topics’.",
            "title_similarity": "0.5267251",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vvqh6",
            "score": 1,
            "text": "This, but also don't try and explain something you don't knlw about as well. Just say you don't know and that you'll find out.",
            "title_similarity": "0.2902608",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h4vvtsm",
            "score": 1,
            "text": "Answer as well as you can",
            "title_similarity": "0.38699996",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4vvyli",
            "score": 1,
            "text": "Don’t ever tell them opinions as facts.",
            "title_similarity": "0.110651456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vw04n",
            "score": 1,
            "text": "My 4y DD has been asking about church lately because her friends go and talk about it a lot. We live in a state with a large percentage of the people are in a dominant religion. My partner and I were both raised in this church but have left for many reasons besides it’s a cult. Last time she asked why we don’t go to church I did my best to give her a simple explanation that I will expand on over the years. I only hope I’m doing this right, but I don’t want the subject to be off limits now and then 1 day just let it all out and overwhelm her.",
            "title_similarity": "0.5211456",
            "sentiment_compound": 0.9331
        },
        {
            "id": "h4vw2kf",
            "score": 1,
            "text": "IMO, while there is obviously a lower-limit, or cutoff, kids are more intelligent than we give credit for with regards to understanding issues, and it is absolutely possible to bring up issues (particularly real world issues in politics, and the world around them).  For example, look at the Nickelodeon show Nick News, which was able to bring real world issues to kids - and lasted from 1992 all the way until 2015... 23 years!",
            "title_similarity": "0.65931404",
            "sentiment_compound": 0.7339
        },
        {
            "id": "h4vwsdz",
            "score": 1,
            "text": "I try to answer their questions as evil as I can",
            "title_similarity": "0.43182224",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h4vx9cc",
            "score": 1,
            "text": "Won’t teaching them that they’re not special be better?\n\nIMO the world would be better if most people accept that they’re not special and don’t crave the attention to be special. Parents praising their kids to be unique make those kids grow up to seek those high being an attention seeker as an adult.\n\nUnless you don’t mind your kids to grow up and become YouTuber / onlyfans / tiktok",
            "title_similarity": "0.67328364",
            "sentiment_compound": 0.7233
        },
        {
            "id": "h4vy08d",
            "score": 1,
            "text": "Yup... I read Children as Chicken and went \"What the heck\" for a moment.",
            "title_similarity": "0.40107268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vyed2",
            "score": 1,
            "text": "This will likely get lost but another big thing is admitting when you don't know something and looking up the answer. They need to know adults don't know everything about every subject and it's okay to find more information about it.",
            "title_similarity": "0.5740824",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h4vyps4",
            "score": 1,
            "text": "[Kid's Questions](https://www.youtube.com/watch?v=Tf17rFDjMZw)",
            "title_similarity": "0.43642208",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4vz6xg",
            "score": 1,
            "text": "Love this. I recently got to spend a couple weeks on vacation with my kids, shortly after breaking up with my live in girlfriend of the last few years. The openness with them and the talks we had were amazing, and even my youngest (11) had some great perspectives that would have never come out without my being open to her.",
            "title_similarity": "0.5116579",
            "sentiment_compound": 0.9382
        },
        {
            "id": "h4w0ylq",
            "score": 1,
            "text": "This is the thing I'm proudest of doing for my sons. Never babified my answers with made up stories/reasons for questions they had. I gave them the PG version, but the real explanation as well as I could for everything. \n\nAnd the confidence they walk around with knowing that their parents will give them the truth about the world and they don't need to search for other people to give them answers is a beautiful thing to see. The fear of the world influencing my son is at a minimal.",
            "title_similarity": "0.5961628",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h4w134z",
            "score": 1,
            "text": "Yup.  I homeschooled my kids upto 9th grade.   Doctor told me I should get some  nature show for my kids \"for when they are older.\". I smiled and agreed.   My kids were watching PBS shows like Nature, Nova, American Experience and Secrets of the Dead since they were old enough to stay up that late, around age 4.   No, they didn't understand everything....but they did understand more than my adult girlfriend who watched Cartoon Network with her kids exclusively.",
            "title_similarity": "0.5112274",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h4w1is5",
            "score": 1,
            "text": "‘Try to answer them as “good” as you can’… and then proceeds to give emotionally intense life advice, all while unable to mastering their own proper grammar…. okkkkay…",
            "title_similarity": "0.62734205",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h4w1mep",
            "score": 1,
            "text": "True story! Just the other day I was on the phone via Bluetooth in my vehicle talking to my mom about Raccoons that they have living under their deck, and how my dad was trying to get them out. I said \"mom you need to just call... the ah... Umm (drawing a complete blank in my head)...\" My 5 year old, who's always listening to EVERYTHING chimes in \"Animal Control dad..\" yes... No idea how she knew this...",
            "title_similarity": "0.383466",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h4w43zw",
            "score": 1,
            "text": "I was always considered mature for my age and I think it's largely because I had teachers at a young age who understood this. I had a teacher that discussed bones and where they are and their names with me in kindergarten (5 and 6 year olds) when my parents were late and that started me on the track of realizing that if I ask the right people questions they will give me actual answers and teach me more than just what I learn in class. I loved science and talked all the time to any teacher I could get to answer my weird questions so by the time I hit 6th grade I largely knew what I was going to learn already. Answer kids questions. It'll make them more likely to ask them which ends up making them smarter",
            "title_similarity": "0.7042439",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h4w4s3w",
            "score": 1,
            "text": "**HOW TO TALK TO A KID: (about important stuff)**  \n\n\nKids have an attention span of about 15 seconds, seriously.  Think of your dialogue like a wall of text. Do you really want to read all that crap? That's why *we* have TLDR, so think of anything you say to a kid as a TLDR.  \n\n\n**Lecturing is** ***pointless*****.** Droning on and on and on and on just bores them silly, and after 10 seconds they start staring out the window & fidgeting, so keep any information & message short and on point.\n\n**Keep it entertaining.** If you're trying to get a point across about 'stranger danger' for example, ask them what they already know, have they talked about this in school or with their friends. Ask them what they think about it, and *LISTEN*. Don't interrupt, do ask them simple questions, 'have you ever been scared?' Let them talk. Don't accept grunts and one word answers.  \n\n\n**Actually talk** ***with*** **your kids, NOT AT them.** Engage the conversation & ask questions and listen to their answers and never ever ever criticize them or call them stupid.\n\n&#x200B;\n\n**Never call your kid names and**  ***don't let them call each other names*****.** If Big Brother is calling Little Sister 'stupid', nip that in the bud. I know they get it from the unwashed heathens at school, but don't allow that shit in your house.    \n\n\nAn important point to make with siblings, especially with older ones picking on little ones, is to say \"she's not stupid, she knows just as much as you did when she was your age. Were you stupid when you were 7?\"  \n\n\n**Name calling is just not allowed, ever.** It's a bad lifelong habit.\n\n&#x200B;\n\nIf your kid does indeed do something stupid, because, we all do, don't call the kid \"stupid\". Instead, call the action \"stupid\".  \n\n\nOh fuck, little Leroy just dented the new garage door with his basketball. The little shit. \n\n&#x200B;\n\n\"Leroy, why in *hell* did you do a stupid thing like that????? Just wait 'til your other mother gets home, she's gonna kill you.\"\n\n&#x200B;\n\nCriticize the action without calling the kid names. It's easy and sets a neutral psychological frame, instead of denigrating the child.",
            "title_similarity": "0.6466299",
            "sentiment_compound": -0.994
        },
        {
            "id": "h4w4uxb",
            "score": 1,
            "text": "Literally the opposite of suffer now enjoy later I'm 17 now and my parents are old asf my mother give birth at age 37 but right now my father is 63 and my mother is 52 and feels like I'm disconnected to my parents they don't have the energy or interest at all to interact and do shit and guide me they are too much protective and close minded the communication feels bland. I feel immature and undeveloped once in life I never recall something that really guide me and feel special the only option I can think of is just move forward and hope for my self to be independent and have fortitude. I always think to my self once I become a parents I will always give them the attention and guide to maturity and move them forward sometimes helping teens to be ahead of others in real life skills is a good gift that my parents don't do at all because they dont have the energy and it sucks to be in that situation.",
            "title_similarity": "0.39775777",
            "sentiment_compound": 0.9247
        },
        {
            "id": "h4w50fg",
            "score": 1,
            "text": "This is one of the essential truths that Mister Rogers taught.",
            "title_similarity": "0.45412627",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h4w61jp",
            "score": 1,
            "text": "That ain't the problem, chief.  The problem is I don't know shit either",
            "title_similarity": "0.1493946",
            "sentiment_compound": 0.3574
        },
        {
            "id": "h4w65zf",
            "score": 1,
            "text": "I work with kids every day. This is very true. Put hard concepts in simple vocab and speak slowly and clearly. This is how people learn! Unless they aren't paying attention, haha that happens sometimes",
            "title_similarity": "0.8116001",
            "sentiment_compound": 0.4481
        },
        {
            "id": "h4w76y8",
            "score": 1,
            "text": "I love how you think I can discuss large significant topics.",
            "title_similarity": "0.68463725",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h4w7qvw",
            "score": 1,
            "text": "Additionally, remember to explain the grey areas and why grey areas exist.  I've said this before but it's worth repeating. My very young, super hero loving son saw a group of prisoners doing work along the road. He asked if they were bad guys and I realized that he sees the world in good guys (us) and bad guys (other and inherently evil.) I explained that in real life there are not good guys and bad guys.  Everyone starts out the same, and the bad guys are just people who made bad choices and got caught. From this he's gained the understanding that other is not bad, bad is not other, and his choices will determine if he's a good guy or bad guy. As he's aged it's allowed us to also discuss religious differences, racial issues, political differences, and treating everyone with respect no matter our differences.  It also shows him what can happen if he decides to make bad choices.  He's not inherently a good guy.",
            "title_similarity": "0.4992553",
            "sentiment_compound": -0.8851
        },
        {
            "id": "h4w97tr",
            "score": 1,
            "text": "*as well as you can\n\nWe’re talking about educating children - let’s give them decent command of language too. Love the post and fully agree with it",
            "title_similarity": "0.7664596",
            "sentiment_compound": 0.8439
        },
        {
            "id": "h4w9oze",
            "score": 1,
            "text": "Kids are smart and stupid at the same time, like normal people but extreme. I had a 30 minute conversation about type advantage in Pokémon with my 4 year old nephew, who's first language isn't English. Then when we go for a walk he puts his socks over its shoes and it takes 15 minutes to explain why they shouldn't be on his shoes.",
            "title_similarity": "0.4904797",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h4warh7",
            "score": 1,
            "text": "Mommy holds her asshole open for me. \n\n“Why don’t I have a little brother?”",
            "title_similarity": "0.3779484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4wbp9u",
            "score": 1,
            "text": "As a maths teacher, I can confirm this. It's us who turn them dumb by assuming they are not ready to understand some things. They are VERY capable if they have the curiosity (which they naturally have) and the support. They just know they can learn or do anything (which is mostly true) until we stop them on their tracks with our rating system. How sad.",
            "title_similarity": "0.6519437",
            "sentiment_compound": -0.1491
        },
        {
            "id": "h4wbqqk",
            "score": 1,
            "text": "Let them know who really won the 2020 election!",
            "title_similarity": "0.36336562",
            "sentiment_compound": 0.6468
        },
        {
            "id": "h4wbska",
            "score": 1,
            "text": "And to talk about their emotions.",
            "title_similarity": "0.36807153",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4wcaml",
            "score": 1,
            "text": "\"...As well* as they can.\"",
            "title_similarity": "0.2948208",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4wdt6b",
            "score": 1,
            "text": "Who would have thought that the key to raising smart children was to not treat them like idiots?",
            "title_similarity": "0.43360472",
            "sentiment_compound": -0.17
        },
        {
            "id": "h4wg0i1",
            "score": 1,
            "text": "This. I can still remember exact conversations when I was a child where adults included me, and most of those conversations sparked an interest in topics or hobbies that I’m still involved in.",
            "title_similarity": "0.6891183",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h4wgw3i",
            "score": 1,
            "text": ">They'll have many questions so always try to answer them as good as you can. Let them learn new things and expand their vocabulary\n\nOk. It's as well as you can. Superman and charities do good. People do things well.",
            "title_similarity": "0.895339",
            "sentiment_compound": 0.926
        },
        {
            "id": "h4wjk5m",
            "score": 1,
            "text": "If I ever have kids I’m gonna chat to them like they’re one of my mates, obviously filtering what I say for younger ears but more the approach to conversation, kids learn to speak through hearing other people talk so by only ever using adult words and phrases around them you basically speedrun their conversational skills \n\nEveryone I know who refused to baby talk their kids and had actual conversations with them ended up with surprisingly well spoken kids from a pretty young age",
            "title_similarity": "0.75805485",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h4wk6fg",
            "score": 1,
            "text": "As a child I always resented adults not including me in the conversations on subjects I actually knew quite a lot about simple because I was a child. And of course a child cant know stuff. \n\nAs an adult, when I've spoken to these same people they don't have a clue what I'm on about as they, well to put simply, are too dumb. Not that I'm any genius or anything.",
            "title_similarity": "0.45602566",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h4wkgke",
            "score": 1,
            "text": "God damn, I try to explain this shit to people. They act like I'm somehow the idiot. Further encapsulates my feelings that most people are... well... We'll save that comment for another day.",
            "title_similarity": "0.51716137",
            "sentiment_compound": -0.2701
        },
        {
            "id": "h4wla12",
            "score": 1,
            "text": "Also, if you don't know the answer to something, it's OK to say, \"I don't know.\" Then you can look it up together and find the answer. You don't have to appear infallible or omniscient to your kids. Some parents have a habit of pretending or assuming they know stuff and just end up making shit up or having an educated (but still wrong) guess. Then those kids grow up thinking they have some solid info that can embarrassingly corrected as an adult. Totally not speaking from experience here...",
            "title_similarity": "0.61540115",
            "sentiment_compound": -0.7866
        },
        {
            "id": "h4wmwrj",
            "score": 1,
            "text": "From about 1 year ago, anytime my son (now 4) asks why. I will explain it like I would an adult. I don't give a fuck if you don't understand boy, you asked so you're going to get a 5 minute lecture on why eating 6 bananas is a bad idea, with references to poop texture.",
            "title_similarity": "0.4236162",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h4wn3qr",
            "score": 1,
            "text": "Also, teach them the correct usage of adjectives and adverbs. \"... so always try to answer them as well as you can.\"",
            "title_similarity": "0.7267108",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h4wnjmj",
            "score": 1,
            "text": "> ...so always try to answer them as good as you can.  \n\nConsidering how highbrow I am spoken to be of, I humbly apologize for the pedantic comment, but I had to chuckle at the irony.",
            "title_similarity": "0.6043538",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h4wvnm2",
            "score": 1,
            "text": "100%\n\nWhen my parents where honest to me about things going on it made me feel respected. When things where hard to share but they told me anyway, made me respect them.\n\nKids can pick up a lot (even if they don't immediately realise what is wrong), keeping them clued in even if not in detail will go a long way",
            "title_similarity": "0.79503983",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h4x3hfv",
            "score": 1,
            "text": "Absolutely. Children are often underestimated.",
            "title_similarity": "0.3721534",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h4x9d80",
            "score": 1,
            "text": "and avoid using phrases like \"as good as you can\" or the kids will learn to speak poor English.",
            "title_similarity": "0.3733852",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h4xeri8",
            "score": 1,
            "text": "I was spending time with my cousins once and one of the younger ones  (maybe 7 or so) had asked something about beaches or sand I don't remember exactly what, but they had never heard of a desert. I spent a good while showing them pictures and explaining to them what it is, plus they loved the pyramids. kids like to learn when it's presented in a way they can take it in",
            "title_similarity": "0.4887802",
            "sentiment_compound": 0.9253
        },
        {
            "id": "h4zxz7f",
            "score": 1,
            "text": "I wholeheartedly support this. I’ve taken this approach with my toddler and preschooler. My preschooler asked where babies come from at age 3. So I told him- the daddy has swimmers and the mommy has an egg. The mommy and daddy have a special hug that allows the swimmers to find the egg and grow the baby.\n\nIt all started because we were watching shark week. I said something about how their babies are born the size of me. He said “wait? How can sharks have babies? They don’t wear shirts so they can’t have bellies.” It was cute. So then he began to ask more and I was honest with him. My mother gave me shit about it but I’d much rather be honest with him and make sure he knows he can always ask his mom, judgment free and safely.",
            "title_similarity": "0.43885392",
            "sentiment_compound": 0.9723
        },
        {
            "id": "h528our",
            "score": 1,
            "text": "I love this. \n\nI used to work an after school program. It was then I realized just how much children pick up. It was about 2 months before the Clinton VS Trump election. The election was of course the topic of conversation at mealtimes. I had 4th graders (9 to 10yo) (90% Latino), telling me they were afraid and worried about their relatives being jailed, deported or beaten if Trump won. Of being put into foster care or even detention. Teachers reported even the kindergareners were exhibiting anxiety.\nKids arent dumb folks",
            "title_similarity": "0.48998836",
            "sentiment_compound": 0.5271
        },
        {
            "id": "h53csft",
            "score": 1,
            "text": "Can agree - that's how I didnt know there was a word for the feelings I had. \nDepression everyone *clap clap*",
            "title_similarity": "0.37756497",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5ktwr4",
            "score": 1,
            "text": "I still can't believe some people don't treat their kids like humans with brains.",
            "title_similarity": "0.41262686",
            "sentiment_compound": 0.0624
        },
        {
            "id": "h5ts1wu",
            "score": 1,
            "text": "My mom did this with me growing up!!",
            "title_similarity": "0.44490167",
            "sentiment_compound": 0.3147
        },
        {
            "id": "h5xwn5v",
            "score": 1,
            "text": "Children… are adults. Minus, list of things to be afraid of. That, they don’t know, so the heads up about the stove and the electric plug in the wall is appreciated. How to get food? Also learned/taught survival skill. \n\nBut the depth of emotional complexity doesn’t change, it’s simply the case that some (most? Many) adults avoid depth their whole life until some crisis when they turn and go “Why in Heaven’s name is our society so incapable of discussing the basics of emotions?!?” Or perhaps a more subtle “I never asked myself these questions before! I didn’t think I’d have to, but now it’s changed,” which can be said with excitement or dread depending. \n\nEspecially when you’re around kids who were talked to always, as “if” adults and always when they’re in the room (never the caretaker going “so-and-so is this-and-that,” as if the child weren’t there, but instead saying “so-and-so, do you want to tell them about this-and-that?” because they’re not on the other side of some Seen And Not Heard attention-neglectful wall that the kid then needs to climb over to enter the conversation like “hey! Hey!” Not even thinking it’s an option to speak for themselves about themselves, let alone in their own way. A lot of us were trained to recite a script and leave quietly. Which is fine, until you’re an adult and you still don’t know what you need or want to say in most situations, like many of us).\n\nKids need people to talk to, freely, as themselves, no judgment. That’s the most important work we can do to heal the world.\n\nTL;DR Putting my 2 cents out there that depth doesn’t increase over your life, it’s just environment that invites, encourages, or discourages more often the awareness of this depth and ability to express it. \n\nBonus 2 cents — I think overly fascist colonizer cultures intend to squeeze as much sensitive/emotional awareness out of daily life possible, with fear and paranoia and strictness and invisible walls between people, so emotional depth is non existent BUT FOR the profound depth natural in young people.",
            "title_similarity": "0.4906643",
            "sentiment_compound": 0.7823
        },
        {
            "id": "h732k86",
            "score": 1,
            "text": "Anecdote: Baby-talk hinders a child's development *significantly*. Speak to newborns, infants, toddlers and young kids just like you would speak to adults. Use proper English(or your language) and speak clearly. Maybe speak just a little bit more slowly, but do not ever perform baby talk.",
            "title_similarity": "0.54200125",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hc2zzhc",
            "score": 1,
            "text": "I see that someone learned from Mr. Rogers.",
            "title_similarity": "0.33047014",
            "sentiment_compound": 0.0
        }
    ]
}