{
    "LPT: Job descriptions are usually written to sound more complicated and high profile than the jobs really are. Don’t let the way it is written intimidate or deter you from applying to a job you think you can do.\n": [
        {
            "id": "h559f6w",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.5989879",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h55o6q2",
            "score": 3,
            "text": "Are you a hiring manager with first hand knowledge of this?  Obviously, this is the case at times, but I'm a hiring manager and there is no way I'd write a job description to be overly complicated or high profile.   I put in the job description my requirements, no more.  If you don't meet those requirements, your resume goes in the trash.",
            "title_similarity": "0.7205059",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h55fnky",
            "score": 6,
            "text": "This is true. The hiring manager needs to make the job sound important so they can get the role approved in the first place. It’s mostly BS.",
            "title_similarity": "0.67099935",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h55sf3u",
            "score": 3,
            "text": "Say you can do it then learn how to like everyone else.",
            "title_similarity": "0.32834172",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h562ek0",
            "score": 5,
            "text": "Holy fuck is the job market abysmal right now. So many companies have asked me if i can come in for an interview an hour in advance...and half of them have wages that are below minimum in my area. I even saw a $200 signing bonus the other day....bro just play your employees more wtf. All this shit has me filtering out so many places to apply to, at this point if you give any sign of bullshit in your description I’m moving on. I don’t have time to fill out your stupid fucking 10 minute quiz",
            "title_similarity": "0.5634581",
            "sentiment_compound": -0.9259
        },
        {
            "id": "h56jfjk",
            "score": 0,
            "text": "That need to peacock i never understood....think I have only ever submitted a resume 2 times in my life for a job...have my own LLC now and got a career. \n\nEven those times I didn't dress shit up. Just explained it and still got the job, always just got to know someone and got the recommendation from them.",
            "title_similarity": "0.40633827",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h570fum",
            "score": 0,
            "text": "Second LPT - apply for the job even if you’re not sure if you can do it. Say you’re willing to take any training they require.\n\nJob postings don’t guarantee perfect candidates, or even good candidates. Even if you have big holes in your skill set but have the attitude to learn - you may be the best person who has applied.",
            "title_similarity": "0.74807024",
            "sentiment_compound": 0.8784
        },
        {
            "id": "h56j9e9",
            "score": 1,
            "text": "Another tip. Prepare to lie through your teeth on a resume. \n\nPrevious experience? List companies that have gone out of business, or have a friend be your 'manager'. Job gap? Never missed a single day of work in a decade. Position? A little artistic liberty of what you actually did vs what the company said you were supposed to be doing. Skills? Bullshit your way through until it works.\n\nCompanies get to lie about how awesome it is to work for them all the time. It's only fair that we get to lie about how qualified we are for a position in return.",
            "title_similarity": "0.6343876",
            "sentiment_compound": 0.895
        },
        {
            "id": "h5705xp",
            "score": 1,
            "text": "This LPT is especially relevant for women. Studies show that women are less likely to apply for jobs if they don't fit all the qualifications. Men are more likely to overconfidently try to work their way into a job. It's one of the reasons given for fewer female executives out there.",
            "title_similarity": "0.6884702",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h55t6yn",
            "score": 11,
            "text": "Also if you can do about 70% of what's written then you can learn the other 30%",
            "title_similarity": "0.29138666",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55pszq",
            "score": -3,
            "text": "It's an EEOC violation to interview an applicant who does not meet the minimum qualifications listed in the job description, preferred qualifications are obviously optional, the primary goal of these regulations is eliminate favoritism/nepotism in the hiring process, so if you don't meet the min. quals. your wasting your time and mine by applying.",
            "title_similarity": "0.75049186",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h55t352",
            "score": 36,
            "text": "I’ve applied at 6 places the last couple months and I’ve received one email back. It’s sad and I’m having a really hard time. My grandmother just passed yesterday and I decided today to apply for unemployment. I don’t know what I’m really doing at this point anymore.",
            "title_similarity": "0.4102202",
            "sentiment_compound": -0.7713
        },
        {
            "id": "h55c8wd",
            "score": 90,
            "text": "I see this with a lot of servers who wish to get into a more corporate type job or sales maybe.  It's about how you spin your resume.  Match it to the description.\n\nExample: you didn't serve tables... You upsold your clients bringing your average table cost from $40 to $75\n\nOr something along those lines",
            "title_similarity": "0.5544374",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h55wr40",
            "score": 13,
            "text": "Its the exact same as the \"entry level position requiring 7 years experience in a software thats only 4 years old.\"  \n  \nYou are not expected to meet those qualifications.  You are just supposed to meet more of them than the other applicants.",
            "title_similarity": "0.48504016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55csrz",
            "score": 16,
            "text": "Why is this the case?",
            "title_similarity": "0.2697675",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55vogq",
            "score": 16,
            "text": "If I’m interested in a job, I always go on linked in and see if I can find others already in that role at that company.  Looking at their experience and educational background can give you an idea of who they have actually hired for that job in the past.  You also might find someone with a connection to a friend that you can talk to about it.",
            "title_similarity": "0.49142957",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h55sub7",
            "score": 18,
            "text": "Job descriptions are typically written by lawyers and HR workers who have never actually contributed to an organization's operations.",
            "title_similarity": "0.53559947",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56235g",
            "score": 17,
            "text": "The truth is:\n\nIf you fulfill all requirements of a job description: Don't do it. You will be bored and you likely won't learn anything new.\n\nIf you fulfill 60-70% of things they want: Totally apply. It'll be a great challenge and you will learn plenty of new stuff. \n\nEmployers handle their job descriptions like their wishlist. The stuff they ask for in the job description is the best possible end result they would like to have. Like a maxed out version of you, after some time in the job. \n\n**To describe it in D&D terms:** What they wish for, is you with aquired sub-class at level 20.  \nBut of course they know, that every adventurer starts the campaign with a lower level and that he/she/they need to aquire many skills needed for the quest along the way. And for you to grow, there need to be challenges and mentors.",
            "title_similarity": "0.73455095",
            "sentiment_compound": 0.9186
        },
        {
            "id": "h55ypzi",
            "score": 21,
            "text": "It’s also a good way to figure out how to word your resume. You worked as a cashier? Go look up cashier jobs, read the description, and bam, you didn’t check people out, you assisted customers during the check-out process. You didn’t just put out merchandise, you worked to maintain attractive customer service displays and supported the regional customer service vision. For reference, I literally just googled cashier job and picked a few phrases from the first one I saw.",
            "title_similarity": "0.51176727",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h55w1em",
            "score": 51,
            "text": "A good rule of thumb I once heard was \"If you feel like you are 60-70% qualified for the job description, then go ahead and apply.\"\n\nI followed this rule once and applied for what I thought was a total longshot (software dev) gig -- got the job and doubled my salary. The work was difficult, but I definitely didn't feel less prepared than my co-workers. A couple jobs later, I'm still making way more than 5 yrs ago me would have dreamed.",
            "title_similarity": "0.5637887",
            "sentiment_compound": 0.5895
        },
        {
            "id": "h55ut52",
            "score": 30,
            "text": "100%. If it sounds like something you could learn or do if shown how, go for it. I've worked for 2 major international corporate banks and I don't understand half the language that's on these job positions. \n\nOnce you get into the job, your skills and knowledge will take over and you'll be just fine\nEspecially if you learn quickly.\n\n If you know Excel you can pretty much work for corporate anywhere.",
            "title_similarity": "0.5333958",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h55jyyv",
            "score": 37,
            "text": "And the same is said about resumes.",
            "title_similarity": "0.20295534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55w23l",
            "score": 35,
            "text": "They're written that way to get people to self exclude and make it easier for the people hiring. Thing is, the people with less confidence about whether or not they have the qualifications but are probably close to, if not definitely qualified, would probably do better work.",
            "title_similarity": "0.73087513",
            "sentiment_compound": 0.5294
        },
        {
            "id": "h55w4sz",
            "score": 34,
            "text": "Think about how you word your resume like you’re a thesaurus. \n\nThey simply do the same thing. \n\nDon’t let them intimidate you. That ad was written by some shy girl named Natalie.",
            "title_similarity": "0.47599795",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h55ptu6",
            "score": 90,
            "text": "Along the same lines the job \"requirements\" tend to be more of an employer wishlist than actual necessary qualifications. If you think you can do the job apply, regardless of how many of the specifics you actually have. The worst thing that can happen is they just don't offer you the position.",
            "title_similarity": "0.813406",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h560noe",
            "score": 40,
            "text": "My job is literally talking to hiring managers and figuring out what is most important to them in a candidate.\n\nI usually tell them you can pick 3 things that are most important to you and we will go from there.\n\nLike more than half of the time I end up have ng to tell them they are looking for a mansion in San Diego  with an ocean view with a budget of $500,000.\n\nWhat is most important to you? The view? The location? The size?\n\nI tell them I can get them the land and size in Montana, but they are going to have to give up the ocean view, or I can get them a small house in San Diego that is like 15 mins away from the beach.\n\nWe usually end up slashing like 75% of the job description.",
            "title_similarity": "0.4685586",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h55x67z",
            "score": 49,
            "text": "As someone who writes these as a 'Head of' \\[Insert IT Infrastructure Technical Function here\\], the JD is a wish list of the ideal candidate, who almost certainly does not exist. If you tick 75% of the boxes, you're almost certainly in the top 3 candidates. Most people I run though the interview process hit 50-75%.\n\nPro Tip: Attitude trumps pretty much everything (apart from the obvious need for some skills in the area that the role is for). If you are enthusiastic, articulate and honest in the interview, almost everything else can be trained up. As OP says, if you like the look/sound of the role, go for it. Good managers (ahem) want people who have room to grow and who want to.",
            "title_similarity": "0.59616804",
            "sentiment_compound": 0.9772
        },
        {
            "id": "h55dga4",
            "score": 219,
            "text": "If you can comfortably do at least 50% of the things listed in that job description, you should apply for that job.",
            "title_similarity": "0.2724603",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h55u2mv",
            "score": 97,
            "text": "Underwater Ceramics Technician? Yes I can totally wash dishes.",
            "title_similarity": "0.16782042",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h561pw7",
            "score": 100,
            "text": "\"...fast paced work environment...\"\n\n\nWe are consciously understaffing the company to save money and need to know you can do the work of two employees for the pay of one.",
            "title_similarity": "0.67120516",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h55vcjy",
            "score": 104,
            "text": "Don't be afraid to apply because the listings are usually department wide boilerplate, but don't lie during your interview about skills you don't have.\n\nWhen I got hired for my first big-kid job they started another guy the same day as me. I was honest about my inexperience at the time. The other guy claimed to have had 6 months experience essentially doing this exact job.\n\nThey fired him by email after 2 weeks.\n\nHis actual lab skills weren't that much worse, and they probably would have worked with him of he'd been honest but everyone hates a liar.",
            "title_similarity": "0.58636564",
            "sentiment_compound": -0.2427
        },
        {
            "id": "h55jead",
            "score": 724,
            "text": "We (my boss/Team) are currently re-writing our job description and on the rough draft I said I wouldnt apply to my own job by how \"involved\" it sounded. Really, anyone who understands a computer and basic excel functions can do my job with some added training.",
            "title_similarity": "0.64581287",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h55j7pl",
            "score": 469,
            "text": "Companies advertise roles for the skills they want to be brought in. Candidates can satisfy them by merely having a comprehension of them and having the confidence to assist in bringing them in.",
            "title_similarity": "0.52228093",
            "sentiment_compound": 0.765
        },
        {
            "id": "h55ebsm",
            "score": 1499,
            "text": "Always scroll past the description with its fluffed upness and go to the person spec. The essential and desirable criteria at the bottom. If you cover each point there you'll most likely get an interview. People have written paragraphs full of stuff to fit in with the fluffed up description yet have missed out on interviews with us becuase they didn't hit the essential/desirable stuff",
            "title_similarity": "0.7237816",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h55s0px",
            "score": 970,
            "text": "So true. I quit my jobs couple months ago. They opened a job position for my exact position and I knew they were ok with accepting a junior(im senior). Looking at the job description, I can easily say that I dont fulfill half of the requirements lol.",
            "title_similarity": "0.40898225",
            "sentiment_compound": 0.8653
        },
        {
            "id": "h55s6cg",
            "score": 427,
            "text": "i would always tell new hires for one of my previous jobs when i was tasked with hiring people that they weren't hired because they *already* knew how to do the job. they were hired because we felt they *could* do the job. personally i think it's something to be aware of when applying and interviewing. without previously working there, how can you know how to work on their tools and applications? how can you know what their processes are? so how can they hire you expecting you to already know those things? you have to change your strategy by demonstrating how you *can* learn to do those because of your experience, your aptitude, and your motivation.",
            "title_similarity": "0.72483945",
            "sentiment_compound": 0.4479
        },
        {
            "id": "h55rfs8",
            "score": 7096,
            "text": "LPT: After I quit my last job from a major oil company the position was heavily advertised online. I copied the \"complicated high profile job description\" they posted and pasted the job responsibilities into my resume and LinkedIn profile.",
            "title_similarity": "0.49502718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55jr1f",
            "score": 40,
            "text": "Most aviation job post lists the same canned job descriptions from 40 years ago.  Very little of it actually relates to the daily job.",
            "title_similarity": "0.3528564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55sgm0",
            "score": 6,
            "text": "Also the qualifications are usually a wish list of sorts…",
            "title_similarity": "0.40413556",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h55st89",
            "score": 68,
            "text": "Work experience, education, etc are almost always desirables, not absolute requirements, no matter how they are listed. If you have done something similar, but not exactly identical, that's probably good.\n\nAge (18+ or 21+), certifications, etc are more likely to be required, but... Almost anything is flexible if they think you can do the job.",
            "title_similarity": "0.6739031",
            "sentiment_compound": 0.6973
        },
        {
            "id": "h55tjx3",
            "score": 8,
            "text": "This is really nice to know. Im close to graduating college and a lot of these junior level positions im seeing look really intimidating",
            "title_similarity": "0.54220814",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h55tov0",
            "score": 3,
            "text": "Ah yes, a “competitive environment” where we are all treated like family. Unpaid overwork you mean, while guilt tripping.",
            "title_similarity": "0.48459184",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h55ugqv",
            "score": 4,
            "text": "Shit. It's weird how much I needed to read this right now. Crazy.",
            "title_similarity": "0.61750376",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h55ukrf",
            "score": 2,
            "text": "Usually they are copy and pasted from the previous opening so a few of the required skills aren’t actually required but whoever did the copying and pasting just forgot to change it.  Also interview questions are often just from Google, “good interview questions”",
            "title_similarity": "0.5441628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55umv7",
            "score": 2,
            "text": "If it is, then it’s a bad job description. Obviously some are bad, but “usually” I feel is overstating it.\n\nSource: Did a LOT of hires over the years.",
            "title_similarity": "0.6345687",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h55vajh",
            "score": 1,
            "text": "This is actually good advice, job hunters, take this on board!",
            "title_similarity": "0.4432235",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h55vcn8",
            "score": 20,
            "text": "Actual cashier job search description I once saw for a new store opening in my city, \n\n“Looking for someone to handle day to day finances while being at the front of consumer relations and tasks associated with the future growth of the business.”",
            "title_similarity": "0.4254064",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h55vtrw",
            "score": 2,
            "text": "Conversely, don't think a job is interesting or exciting based on how they write it up.. try to look for the core substance of the role",
            "title_similarity": "0.7106449",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h55w4y1",
            "score": 5,
            "text": "I'm still waiting for y'all to join the strike, I've been going strong for well over a year now.",
            "title_similarity": "0.3245721",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h55wh1p",
            "score": 4,
            "text": "Mom always told me to apply for everything. Screw the requirements!",
            "title_similarity": "0.4341845",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h55wk8z",
            "score": 2,
            "text": "This needs to be here more often, in the tech industry if you have some experience you can get interviews with 40% of the job requirements",
            "title_similarity": "0.55616534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55wz1y",
            "score": 39,
            "text": "Apply to whatever you want regardless of anything in the job description. Don’t self-select yourself out of the process, that’s the hiring team’s jobs.",
            "title_similarity": "0.5733202",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h55xnlk",
            "score": 1,
            "text": "Nothing but facts.",
            "title_similarity": "0.14042218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55xwrb",
            "score": 4,
            "text": "“I just got a job as an Executive Sanitation Specialist” \n“Dude you’re a janitor…”",
            "title_similarity": "0.38335288",
            "sentiment_compound": 0.0
        },
        {
            "id": "h55ycdq",
            "score": 29,
            "text": "Oh Lord, THIS. I work in a furniture store, and the job sounded incredibly technical and fast paced. Yesterday I moved one piece of furniture and declared a different one as broken. Aside from that, I relaxed all day.",
            "title_similarity": "0.48941326",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h55yixv",
            "score": 1,
            "text": "Yeah that's what I did and now I regret it",
            "title_similarity": "0.3469563",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h55ym75",
            "score": 1,
            "text": "Is there some downside from appliing to jobs you Are not qualified?",
            "title_similarity": "0.64781576",
            "sentiment_compound": -0.25
        },
        {
            "id": "h55ypi8",
            "score": 5,
            "text": "My career advisor told me 1-2 years is entry level, 3-5 you need some kind of experience (even if you have to twist it a little), and HR puts whatever management wants on the job application, even if it doesn’t make sense because management doesn’t know what they actually want\n\nAlso context: I’m a business major fwiw",
            "title_similarity": "0.6636585",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h55ypy6",
            "score": 2,
            "text": "Unless it's my job description, then I wrote it to what I wanted to do :D   \n\n\nBut, all the tech specs are sadly not fluff lol.",
            "title_similarity": "0.5339774",
            "sentiment_compound": -0.6348
        },
        {
            "id": "h55z6hm",
            "score": 2,
            "text": "A sorta corollary - \n\nIt can be tempting to fluff up your resume by making your tasks and title sound more flashy than they really are, but it can backfire. HR will either recognize that you're trying to bullshit them, or not have a clear idea of what kind of work you actually did.\n\nIf you helped people fill out insurance forms, say that, don't say you did front-line customer documentation interfacing or whatever. It sounds dumb and fake. They'll see right through it. \n\nThey may actually want someone who helped people fill out forms, and if your job description makes that unclear, you're just shooting yourself in the foot.",
            "title_similarity": "0.7967826",
            "sentiment_compound": -0.9619
        },
        {
            "id": "h55z8w5",
            "score": 2,
            "text": "My background is computer science and I once interviewed for a position to help a company's non-technical HR department screen technical candidates. The golden nuggets I got from that interview is that 1) no candidate ever meets 100% of the qualifications and 2) the people hired usually only meet around 2/3 off the qualifications. Job descriptions are for the \"perfect\" candidate that no one really expects to find.",
            "title_similarity": "0.5548214",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h55zgb8",
            "score": 2,
            "text": "LTP: Most job descriptions are written by people who have no idea what a job actually requires",
            "title_similarity": "0.61689913",
            "sentiment_compound": -0.296
        },
        {
            "id": "h55zi3w",
            "score": 1,
            "text": "You sound like Jo from Little Women haha",
            "title_similarity": "0.2527361",
            "sentiment_compound": 0.6395
        },
        {
            "id": "h55zote",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.14092538"
        },
        {
            "id": "h55zwd0",
            "score": 3,
            "text": "As an explanation to why.  \n\nIf I'm trying to get a pay increase for any of my people I have to justify it to HR, a team that doesn't understand the job (I don't understand theirs either), so part of that is showing an increased responsibility.  \n\nThis inevitably means adding BS to the Job description to impress HR, which is there when advertising a position when vacant.",
            "title_similarity": "0.7355625",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h55zy17",
            "score": 2,
            "text": "Brb, gonna apply to be a doctor, wish me luck!",
            "title_similarity": "0.32877827",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h5608u3",
            "score": 4,
            "text": "I realised this after reading the job description for my current job.",
            "title_similarity": "0.35842478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h560enb",
            "score": 2,
            "text": "Often flat out bullshit too. I've noticed that \"quality\" never means what they think it means.\n\nI've seen many \"quality\" positions that are, infact quality assurance... in so far as you take a fraction of a second to look at the thing... while you pick it up and pack it in a box.",
            "title_similarity": "0.56150293",
            "sentiment_compound": -0.34
        },
        {
            "id": "h560rmq",
            "score": 9,
            "text": "This is me right now.  I’m looking to jump ship and everything I see I think looks too hard.",
            "title_similarity": "0.6199901",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h560ucz",
            "score": 2,
            "text": "This. The job I am currently working for had a such an intricate description. Turns out you don't even need a college degree to work here. I am just a glorified data entry personnel.",
            "title_similarity": "0.5346275",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h560wtf",
            "score": 3,
            "text": "The sad and stupid part is sometimes you read job and no clue what you'll be doing as some are written like you need tons of degrees and experience\n\nYet in reality you only need primary school degree and half days training to be eligible to perform it.\n\nI'd guess skills asked and if someone having those applies in most cases when ppl find out real duties required and they will do results in such ppl leaving or not even starting the job.",
            "title_similarity": "0.6668284",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h560x7e",
            "score": 9,
            "text": "And then I end up applying anyways and get an email back saying \"Thank you for your application, however we have found someone more suited for this position\". ;(",
            "title_similarity": "0.49005774",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5613j3",
            "score": 3,
            "text": "Yes but when you get into the job make sure you use said description / contract to stop employers from screwing you over.",
            "title_similarity": "0.6637982",
            "sentiment_compound": -0.09
        },
        {
            "id": "h5619mc",
            "score": 2,
            "text": "The flip side is don't apply for something you are nowhere near qualified for because that will end up on reddit.",
            "title_similarity": "0.5653446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5619y9",
            "score": 3,
            "text": "Honestly, at some point in life, one has to just apply for anything, you'll get something by luck.",
            "title_similarity": "0.40370336",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h561k77",
            "score": 2,
            "text": "\"Auxilliary percussion relocation assistant\" = you haul the band's drums around at gigs.",
            "title_similarity": "0.32863912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h561mw9",
            "score": 4,
            "text": "I read the job posting when we were hiring more people to my department. I was like “wowww, I do all that?” lol. They made us sound like some super serious people.",
            "title_similarity": "0.64560276",
            "sentiment_compound": 0.886
        },
        {
            "id": "h561n42",
            "score": 14,
            "text": "Just like resumes are written to sound more impressive than they should be.  Why can't everyone just be real and stop the whole song and dance ritual?",
            "title_similarity": "0.6915586",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h561tac",
            "score": 16,
            "text": "I have an interview today for a job that Is a large jump up but seemed out of reach because the skills list looked intimidating and long. This post gives me confidence!",
            "title_similarity": "0.788076",
            "sentiment_compound": 0.2598
        },
        {
            "id": "h561w50",
            "score": 1,
            "text": "In my country the number one thing you should always do, is call the person they put as a contact for the job posting and ask them about the requirements they put. Which of them are important, and which are less so? Also literally just talking to that person can put you way ahead on it's own, provided you do it right (like, actually have real questions you want to ask, don't just call and be like \"Hey... uh... you're hiring, huh?\").  \n\n\nI called in to ask whether as Master's degree was really required for a job, as I only have a bachelor's degree (they had put examples of Master's degrees they would expect could apply for the job) and I was told \"oh, no a Bachelor's is fine, don't worry\". Had a few other questions, sent in the application, and got a call from them inviting me to an interview literally 10 minutes after the application was sent.",
            "title_similarity": "0.6766036",
            "sentiment_compound": 0.8769
        },
        {
            "id": "h561w7q",
            "score": 36,
            "text": "Whenever I come across the job description for MY OWN JOB, I think, “Dang that sounds too complicated for me.”",
            "title_similarity": "0.79401827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h561wxf",
            "score": 8,
            "text": "I was just thinking this yesterday!  I started a new job 3 weeks ago (40% pay increase), I just went back and read the description again and realized that the 3 paragraphs of things I didn't know how to do I learned in the first week, super easy stuff apparently.  They love me here already and today is payday, my net is almost double what I made in my last stressful job and this one is so much easier!",
            "title_similarity": "0.4140067",
            "sentiment_compound": 0.9226
        },
        {
            "id": "h5623ab",
            "score": 2,
            "text": "Apply for everything and bring a willingness to learn and adapt. I’d be more willing to hire someone with little experience and a great attitude than I would someone who checks all the boxes and brings the personality of a walrus. Being eager and confident about doing the things you know and learning the things you don’t are going to stand out a lot more. Often times your inexperience works to your advantage too with the pay scale for the position.",
            "title_similarity": "0.7084006",
            "sentiment_compound": 0.91
        },
        {
            "id": "h562676",
            "score": 3,
            "text": "I beg to differ some times if they’re too simple In the description the job is 1000x more hard then they describe.",
            "title_similarity": "0.69537926",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h562a63",
            "score": 3,
            "text": "Also, keep a copy of the job description if you apply and get the job, so that you can list those job responsibilities on your resume",
            "title_similarity": "0.47214952",
            "sentiment_compound": 0.0
        },
        {
            "id": "h562luj",
            "score": 2,
            "text": "also if it mentions marketing run for the hills, unless that what you want to do.",
            "title_similarity": "0.5132351",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h562n9w",
            "score": 1,
            "text": "Needed this today. Thank you.",
            "title_similarity": "0.31899303",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h562nhg",
            "score": 2,
            "text": "You think the job description sounds “high profile?” \n\nYou should see my resume!",
            "title_similarity": "0.6163988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h562vll",
            "score": 3,
            "text": "I interviewed for an office assistant-type job and they spent the whole time talking about how I'd be running around and ordering this and cleaning that. \n\nI've sat in a copy room for 3 weeks now.",
            "title_similarity": "0.2979625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h562yxz",
            "score": 2,
            "text": "I read a job description for a position I had two promotions prior and I thought, damn, that sounds really complicated and I’m not sure if I’m qualified. Had to take a step back and realize that I did all that and the posting just made it sound really complicated.",
            "title_similarity": "0.6853976",
            "sentiment_compound": -0.5664
        },
        {
            "id": "h5637wr",
            "score": 3,
            "text": "They do such things to make it sounds more complicated than it is so they can be pickier about who they hire.  If they can do so there then do so on your resume.\n\nOn mine it says, \"Qualified Landscape machine operator\" as well as, \"Material Management and Supply Line Operations\".\n\nJust fancy ways of saying I can drive a lawnmower and that I was a stockboy once.  If they can bullshit me then I can bullshit them.  And you know what, it works.",
            "title_similarity": "0.6214962",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h563fp0",
            "score": 7,
            "text": "My mantra while applying to jobs is \"don't disqualify yourself because you're not a perfect match. Let them disqualify you\"",
            "title_similarity": "0.75549185",
            "sentiment_compound": -0.4585
        },
        {
            "id": "h563fw0",
            "score": 1,
            "text": "Think? Know you can do?",
            "title_similarity": "0.19228637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h563hia",
            "score": 1,
            "text": "Also, most descriptions are templates, so requirements saying college degree required aren't always required.",
            "title_similarity": "0.4888549",
            "sentiment_compound": 0.0
        },
        {
            "id": "h563jzn",
            "score": 1,
            "text": "Also; don’t let things like “X,Y,Z degree preferred” or “10 years experience required” intimidate you when you have done the job successfully. Submit the resume! They may or may not interview you but without applying you’ll never get the job!",
            "title_similarity": "0.732907",
            "sentiment_compound": 0.465
        },
        {
            "id": "h563r13",
            "score": 1,
            "text": "They write the job descriptions the same way we write our resumes. It's all just a bunch of bullshit and both sides know it but pretend neither do. Pretty irritating process if you ask me.",
            "title_similarity": "0.7321913",
            "sentiment_compound": -0.4976
        },
        {
            "id": "h564705",
            "score": 1,
            "text": "People pad their resumes and companies pad their job listings, it goes both ways.  If you think you are qualified for the job, but just aren't a \"perfect fit\", always apply.",
            "title_similarity": "0.7437788",
            "sentiment_compound": -0.7692
        },
        {
            "id": "h5647c6",
            "score": 1,
            "text": "One of the things i enjoy about what i do is i can explain it to people in one word: carpenter",
            "title_similarity": "0.42004478",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h564c8d",
            "score": 6,
            "text": "*Masters degree and 2 years experience required*  \n  \n*Paying $14.25/hr*",
            "title_similarity": "0.36887467",
            "sentiment_compound": 0.0
        },
        {
            "id": "h564cdm",
            "score": 1,
            "text": "In a similar vein, it's fine to apply to jobs where you don't meet all the requirements (degrees, years of experience, etc). But do not lie about having them if you don't!",
            "title_similarity": "0.7285785",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h564ciy",
            "score": 2,
            "text": "*or to make it sound way more special than it actually is*",
            "title_similarity": "0.52987766",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h564o6n",
            "score": 1,
            "text": "Experienced this, the description sounded like something I could be taught to do and was still in my field so I took a shot. Even in the interview my now boss made things sound super technical and fast paced. It did take some getting used to the software we used, but now that I’m trained my job is super easy and not that complicated. Ended up being the easiest job I’ve ever had.",
            "title_similarity": "0.59281987",
            "sentiment_compound": 0.9524
        },
        {
            "id": "h564pu8",
            "score": 2,
            "text": "Just apply for everything. Who cares if you can do it?   Worst case if you actually scam them into hiring you, they still have to pay you for the time it takes them to realize you're dangerously unqualified.",
            "title_similarity": "0.73793477",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h564rfu",
            "score": 2,
            "text": "I work as a Ux Designer and something that puts me off is every single job asks for User Research capabilities. I can do UR but really don’t enjoy it, and feel like User Research is and should be it’s own job role. Are there any other Uxers here that fancy sharing their thoughts on this? And if there are any ways around it?",
            "title_similarity": "0.73287284",
            "sentiment_compound": 0.919
        },
        {
            "id": "h564rsc",
            "score": 1,
            "text": "This is so true. I applied for my current job where I didn't understand what the description was asking for at all. I just knew the job title was loosely what I did. To my surprise I got a call back and hired! This was my \"long shot\" application and it worked out. Just apply! There's nothing for you to lose.",
            "title_similarity": "0.61127895",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h564t5t",
            "score": 1,
            "text": "This is generally bad advice, or poorly written at least. I'm a hiring manager, and if I put something in a job description it's because I expect the role to do it.\n\nI think something that is more common, or a better way to put it is: job descriptions are sometimes unrealistic, and hiring managers may overlook some missing qualifications if you have other important factors.\n\nI generally care much more about someone's personality and values than I do about what's on their resume or their specific qualifications.\n\nMost things in most job descriptions can be taught. But you can't teach a grown adult to be a person they're not.\n\nAlso, be honest in interviews and be yourself. If the person they hire isn't the person they interviewed, then nobody will enjoy you being employed there, including yourself.",
            "title_similarity": "0.8243003",
            "sentiment_compound": 0.4934
        },
        {
            "id": "h564t88",
            "score": 2,
            "text": "It's not the way it's written, it's the stupid bullshit of having to input your resume after you've uploaded it",
            "title_similarity": "0.6302707",
            "sentiment_compound": -0.802
        },
        {
            "id": "h564umr",
            "score": 1,
            "text": "We have a separate problem: candidates copy either their replacement's job description or our own, passing it off like they can do everything on there.\n\nTechnical interviews kill them in twenty minutes or less.\n\nThe real solution though is to keep the job description vague, with a hidden list of what we're looking for. Anyone that actually has experience will inevitably ping this hidden list.",
            "title_similarity": "0.6762881",
            "sentiment_compound": -0.6444
        },
        {
            "id": "h564vk8",
            "score": 4,
            "text": "Lol I have tons of experience I’m just terrible at writing about myself, I have no idea how to portray that I’m one of those people that you can throw into LITERALLY any position and give me a day or two to get the hang of how things are ran and I’ll fit into that spot like I’ve been there 15 years",
            "title_similarity": "0.5610429",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h564wml",
            "score": 1,
            "text": "I give my highest honour/award *saved*",
            "title_similarity": "0.24272633",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h56561q",
            "score": 1,
            "text": "Now hiring: Traveling regional print-media distribution engineer.",
            "title_similarity": "0.37495285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5657bs",
            "score": 2,
            "text": "Also reverse, don’t get sucked into a job that’s fancied up just because you THINK it’s saying more than it actually is.",
            "title_similarity": "0.74622023",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h565a99",
            "score": 2,
            "text": "just read the job description for any job you've worked in for a while. it could be revealing how much it diverges from reality.",
            "title_similarity": "0.5134406",
            "sentiment_compound": 0.0
        },
        {
            "id": "h565c9h",
            "score": 1,
            "text": "What usually deters me is the mandatory five years of experience for an entry level job.",
            "title_similarity": "0.42857426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h565dcq",
            "score": 1,
            "text": "Job reqs use the same bullshit purple prose that you’re expected to use on your resume.",
            "title_similarity": "0.5379789",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h565h9q",
            "score": 1,
            "text": "They're often old too, so the requirements have changed as they've been searching for weeks or months, yet they didn't update the job description.  They're also often written by HR through chinese whispers with the manager ultimately doing the decision on who to hire and needs someone new.\n\nI haven't once got a job where I met all the requirements.  Hell I got a job using SAP and confessed I didn't know what SAP was.  They said don't worry we'll train you.\n\nNever ever ever skip an application because you missed some of the requirements in the description.\n\nYou never know the situation in the company, or how well a recruitment agency can sell you.",
            "title_similarity": "0.58444786",
            "sentiment_compound": -0.5096
        },
        {
            "id": "h565nqr",
            "score": 1,
            "text": "Read the requirements and follow application directions.  That's the first bar people must meet and hot damn most fail, and it ain't hard.  \n\nBut if you cant be arsed to figure out how to research and retrieve requested documents that you should have... then you wont be able to do a job which consists of doing a lot of that.",
            "title_similarity": "0.72137845",
            "sentiment_compound": -0.4764
        },
        {
            "id": "h565rh9",
            "score": 2,
            "text": "Literally this, I didn't want to apply for a job cause I felt it was too much so I applied for the jr role but in the interview they told me I was overqualified and gave me the sr position I didnt want to apply in the first place, just started training for said job and believe me it's not remotely as hard as it was described",
            "title_similarity": "0.693864",
            "sentiment_compound": -0.0
        },
        {
            "id": "h565v4n",
            "score": 2,
            "text": "By the same token, job descriptions are the best way to market what you did previously on a resume. Look up the job description where you used to work, and use that on your resume so that it sounds far more complicated and high profile, making you look much better.",
            "title_similarity": "0.7472899",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h565xvp",
            "score": 1,
            "text": "Not sure why they do this, but now I go into interviews confidently regardless of what the position is.",
            "title_similarity": "0.57010806",
            "sentiment_compound": 0.5674
        },
        {
            "id": "h565xzg",
            "score": 1,
            "text": "Just don’t work and you won’t have to worry about this",
            "title_similarity": "0.32290915",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5663kj",
            "score": 1,
            "text": "That's how I went from driving a trash truck to head brain surgeon at Hopkins.",
            "title_similarity": "0.24672845",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56676d",
            "score": 1,
            "text": "I typically just apply to everything.  My resume lists my skills as i stay very honest in my resume. So if i get an interview for a job, then that means they are happy with my skill level. Let them do the filtering",
            "title_similarity": "0.43958202",
            "sentiment_compound": 0.807
        },
        {
            "id": "h566ekv",
            "score": 1,
            "text": "LPT: Copy difficult job description and post it into your CV Resume. Get hired....",
            "title_similarity": "0.6004623",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h566frr",
            "score": 1,
            "text": "The flip side of this usually gets reported as a form of gender discrimination, in that women are less likely to apply for jobs they don’t feel qualified for according to the job description/requirements, whereas men will eagerly apply for things they aren’t qualified for according to the job description/requirements.\n\nI mean, I’ve always known this, and I’ve never let it stop me. And I feel like most of my male peers know this as well. Now, it could be a symptom of how we are teaching men and women differently, but the fact that men and women approach job qualifications differently is not an overt signal of discrimination, in my opinion.",
            "title_similarity": "0.74134386",
            "sentiment_compound": 0.549
        },
        {
            "id": "h566hf4",
            "score": 1,
            "text": "Hence why my resume reads like this:\n\nJo: \"Coordinated and implemented receipt storage and delivery of over 2.5 billion units of inventory.\" 2.5 billion, Darryl? 2.5 billion units of what?\nDarryl: Paper material, ma'am.\nJo: Paper material?\nDarryl: [softly] Pieces of paper.",
            "title_similarity": "0.30292457",
            "sentiment_compound": 0.466
        },
        {
            "id": "h566j8t",
            "score": 2,
            "text": "Yes, it is a big problem, especially for the disabled community.\n\nI have raised it with the police, the councils and the NHS in the UK to point out that complex language and descriptions can deter disabled people from applying, especially if they have only a basic level of English due to their disability (i.e. Deaf.) - Btw, these people are capable of doing the job quite well. \n\nThe problem is, although the people in suits seem happy to take on board that feedback, and they'll offer support for people to apply, they won't actually change their method of writing the descriptions etc.",
            "title_similarity": "0.7089329",
            "sentiment_compound": 0.8141
        },
        {
            "id": "h566jae",
            "score": 1,
            "text": "Another tip: 99% of the time the recruiter and the department that needs to fill the role don’t really have a clear description of the role in place so the advert is basically a best guess.",
            "title_similarity": "0.65769196",
            "sentiment_compound": 0.7943
        },
        {
            "id": "h566jhn",
            "score": 1,
            "text": "Also, in a lot of instances, very few, if any, applicants will completely check off all of the boxes in the job description.  If you think you'd be a good fit, even if you don't check every single box, apply.  It's their job to weed out the less than ideal candidates; you don't need to try to do that for them.",
            "title_similarity": "0.6480566",
            "sentiment_compound": 0.8187
        },
        {
            "id": "h566uti",
            "score": 1,
            "text": "Can't say this enough. I've done industrial electrical/mechanical maintenance in operating manufacturing facilities for about 15 years, and I came into it with an associate's degree in industrial technologies. I was recently applying to a new job. Just by reading job descriptions, I was thinking: shit, I can't do some of this stuff, shit sounds real elite level technicians. The thing is I know a few people who work there, if anything I'm probably above their level. \n\nTL;DR: just read the headline, they said it all",
            "title_similarity": "0.42154536",
            "sentiment_compound": -0.802
        },
        {
            "id": "h566wjp",
            "score": 1,
            "text": "Literally everyone is a technician or specialist or some other fancy title.",
            "title_similarity": "0.4095583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5673lm",
            "score": 1,
            "text": "As someone doing a lot of hiring lately, the truth is a job description and requirements are the ideal candidate, which we know doesn't exist. If you fall short on some of the items, that's expected.",
            "title_similarity": "0.73295623",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h56751y",
            "score": 1,
            "text": "This. I worked in a lab and the first week I got so overwhelmed thinking “is this really for me?” I spent 3 years there and it was one of the easiest jobs I’ve had lol.",
            "title_similarity": "0.3132683",
            "sentiment_compound": 0.7365
        },
        {
            "id": "h56772i",
            "score": 1,
            "text": "In the US “manufacturing specialist” means “sweatshop worker”.",
            "title_similarity": "0.3811934",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56787y",
            "score": 1,
            "text": "And remember that you don’t have to be the most qualified for the job. You just have to be the most qualified that applies.",
            "title_similarity": "0.72413933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5678di",
            "score": 1,
            "text": "Sales associate = person who stands and rearranges things. 😂",
            "title_similarity": "0.39974993",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h567cms",
            "score": 2,
            "text": "I really needed to hear this today.",
            "title_similarity": "0.4296815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h567gj2",
            "score": 1,
            "text": "Every job out of college I’ve had I was under qualified (according to the job description). Applied anyways. Fake it till you make it.",
            "title_similarity": "0.5393343",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h567mhu",
            "score": 1,
            "text": "“We are looking for a seasoned key account sales representative to cultivate thriving relationships with prospective clients” might equal cold calls from a call center selling car insurance.\n\nAgree with what others have said as well- use this type of language to your advantage when building your resume and applying.",
            "title_similarity": "0.53394556",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h567ncy",
            "score": 1,
            "text": "100% true!\n\nI used to have to write up job descriptions and responsibilities for posting in a lab\n\nDefinitely made it sound incredibly more complicated than it really was",
            "title_similarity": "0.7256548",
            "sentiment_compound": 0.6996
        },
        {
            "id": "h567r3y",
            "score": 1,
            "text": "We should do a series surrounding the unethical practices of HR.",
            "title_similarity": "0.58966714",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h567wky",
            "score": 1,
            "text": "Many times the Experience needed is more of a guideline…as in, if you don’t have exactly what they’re asking, it doesn’t mean you’re not qualified…at worst, they can train you the way they want to",
            "title_similarity": "0.74106467",
            "sentiment_compound": 0.5565
        },
        {
            "id": "h5684gz",
            "score": 2,
            "text": "I saw the best job advert recently. On first reading it sounded like a fairly decent low salary job, nice hours, just what I was looking for, something officey that requires a little brain power for while my little girl is at school that means I can be there for pick up and drop off. \n\nIt was for a dinner lady.",
            "title_similarity": "0.4031372",
            "sentiment_compound": 0.743
        },
        {
            "id": "h5684l0",
            "score": 3,
            "text": "Don't know if this is still true but recruiters used to list ridiculous requirements for IT jobs so they could claim they tried to find Americans for the position and couldn't find any qualified applicants so that gave them the opportunity to bring in people from India at a much lower hourly rate.",
            "title_similarity": "0.65811443",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h5686t1",
            "score": 1,
            "text": "This used to always deter me. \nBut once you start working you see that it's just for show.",
            "title_similarity": "0.62370086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5687xr",
            "score": 1,
            "text": "This is a contributor to the gender wage gap. Women tend not to apply for jobs unless the meet most or all of the requirements. Men are more likely to apply if they just meet some of the requirements.",
            "title_similarity": "0.7368127",
            "sentiment_compound": 0.0
        },
        {
            "id": "h568c39",
            "score": 1,
            "text": "Lol, so is my resume.",
            "title_similarity": "0.19731715",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h568irs",
            "score": 1,
            "text": "If something seems above your skill level, you can also just learn how to do it. I’ve never taken a new job and knew how to do everything on day 1.",
            "title_similarity": "0.39679042",
            "sentiment_compound": 0.0
        },
        {
            "id": "h568kup",
            "score": 1,
            "text": "JUST TELL ME WHO I NEED TO SHAKE HANDS WITH TO GET A SHIFT",
            "title_similarity": "0.34552842",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h5694h5",
            "score": 1,
            "text": "oh I remember some recruiter was asking if I had 10 yrs experience in Hadoop. I told its been 2 yrs. since the technology was out!",
            "title_similarity": "0.30671543",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5698qm",
            "score": 1,
            "text": "As a devops person the JD has always been less complicated than the job itself tbh.",
            "title_similarity": "0.49258414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h569ji9",
            "score": 2,
            "text": "I'm pretty sure i could do must jobs short of open heart surgery with a few weeks of on the job training, but instead I need 8 certifications and 10 years of schooling that are hardly ever relevant to the day to day.",
            "title_similarity": "0.53384006",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h569l4p",
            "score": 1,
            "text": "I find it to be the opposite. In retail at least there is no such thing as only working one position, they want you to always be busy so they make you do other tasks that you never expected",
            "title_similarity": "0.68433344",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h569n4u",
            "score": 1,
            "text": "Oh it doesn’t. I already know I’m not qualified for anything, but I keep getting promoted",
            "title_similarity": "0.61217475",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h569r6a",
            "score": 1,
            "text": "Reminds me of this dilbert\n\nhttps://dilbert.com/strip/2003-07-08",
            "title_similarity": "0.16476777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h569yn1",
            "score": 1,
            "text": "I usually get deterred by the reject letter from the HR rep that took this advice",
            "title_similarity": "0.6027063",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h56a4zg",
            "score": 5,
            "text": "As an addendum: Don't get hung up on the \"requirements\".  If you meet a some but not all requirements and are interested you should apply.\n\nThe requirement lists aren't requirements.  They aren't even really always desires, but rather Search Engine Optimization checkboxes.  Employers want to cast a wide net, so when you say \"I know C++\" and they list \"C++, C, Python, and Java\" They wanted to make sure you see their job.",
            "title_similarity": "0.6648523",
            "sentiment_compound": 0.8847
        },
        {
            "id": "h56a7of",
            "score": 1,
            "text": "Can confirm. My job asked for 3-5 years experience in SQL and I only had one year of college courses. Printed out literally every coding assignment and brought it to the interview and demonstrated what I knew. Got the job!!",
            "title_similarity": "0.22707728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56a7zz",
            "score": 1,
            "text": "It all works out since my resume is equally embellished",
            "title_similarity": "0.3219459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56acqb",
            "score": 1,
            "text": "It’s amazing how many job descriptions really aren’t accurate either",
            "title_similarity": "0.64706254",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h56ad93",
            "score": 1,
            "text": "100%.\n\nAll i do is answer a phone \nPull up an account and tell you what vaccines your pet has\nAnd email them.\n\nVerbal and email.\n\nThats is.\n\nEasiest shit i ever done in my life.\n\nAnd yet that Job Description \"Premier Customer Service\"\nHas more details and descriptions \nThan say Targets applications \n\n\nEven if its crazy hard and you cant do it-   \n\nYou'll still get 2 weeks ofpa id training before taking a single call.",
            "title_similarity": "0.43631306",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h56ag3f",
            "score": 1,
            "text": "I always apply to shit on the off chance that the reviewer accidentally approves. Same reason I applied to Harvard, you never know!",
            "title_similarity": "0.52287775",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h56agt3",
            "score": 1,
            "text": "This. A friend and I recently completed an outsourcing position where knowledge of a certain system was called for.\n\nThere is one person on the entire planet who knows that system and the end customer were proposing to retire him off (euphemism).",
            "title_similarity": "0.38657212",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h56agzj",
            "score": 1,
            "text": "Also: don't feel like you can't apply to a job just because you don't fit EVERY requirement (especially if there's a long list). Often times, companies create job descriptions for the 'ideal candidate' and will let go of some qualities that might not be as important depending on the rest of what you bring to the table and how many applicants they have. Now don't go overboard and apply for something you're wildly unqualified for, but also don't limit your search more than you need to.",
            "title_similarity": "0.8128718",
            "sentiment_compound": 0.0885
        },
        {
            "id": "h56aqg0",
            "score": 1,
            "text": "On a similar note, don't let a fancy or complicated job resume trick you into a crappy job. It's very easy to make something like a janitor or secretary seem important when you'd be mostly cleaning toilets or fetching coffee.",
            "title_similarity": "0.58893496",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h56ax7d",
            "score": 8,
            "text": "Applying to jobs is a lot like asking someone out on a date. Let them decide if they wanna smash. Don't decide for them that they're out of your league.",
            "title_similarity": "0.6147578",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h56aydm",
            "score": 1,
            "text": "I applied for a case management job. The job description was specific to case management, I am qualified for case management.  Get to the 2nd interview and find out they're really looking for volunteer coordinator. Wasted so much of my time but that's non profits for you.",
            "title_similarity": "0.54202586",
            "sentiment_compound": 0.4118
        },
        {
            "id": "h56ayqi",
            "score": 1,
            "text": "I applied for a job a few years back that required a degree and experience. I had none of it. They told me at the interview that it was only for college grads but was given the job because no college grads had applied. Just know 99% of the time a business doesn't need you to have a degree to work. It's just a sign that you're capable of working large work loads.",
            "title_similarity": "0.49167508",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h56b49d",
            "score": 1,
            "text": "Unless you are in IT. If you think you can do it you are overqualified. Only those who feel they are imposters are in the right position.",
            "title_similarity": "0.65482277",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56b4y2",
            "score": 1,
            "text": "\"I make this job seem harder than it really is.\"",
            "title_similarity": "0.7078968",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56bafb",
            "score": 1,
            "text": "That's how I become the best porn actor and fireman of all San Marino.",
            "title_similarity": "0.36937448",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h56bahm",
            "score": 1,
            "text": "The other way around is the real problem. If the actual job is more complicated than the description.",
            "title_similarity": "0.79375494",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h56bgja",
            "score": 1,
            "text": "Hahaha this is so true",
            "title_similarity": "0.10914922",
            "sentiment_compound": 0.8029
        },
        {
            "id": "h56bn2e",
            "score": 1,
            "text": "*applies for the CEO position at amazon* \n\n😤😤",
            "title_similarity": "0.19968362",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h56c3lv",
            "score": 1,
            "text": "Applied dor Sap basis administrator. Was not ready.",
            "title_similarity": "0.34848696",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h56cb82",
            "score": 1,
            "text": "A job was requiring a geological engineering degree. My brother applied only because he had to for unemployment. Go the job. Has been working there for years now",
            "title_similarity": "0.49473938",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h56cbah",
            "score": 1,
            "text": "Another LPT:\n\nSave those job descriptions, and use it as verbiage in your resume when you apply to a new job",
            "title_similarity": "0.4551906",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h56cgq4",
            "score": 1,
            "text": "When I eventually leave my current job, I'm stealing the job listing for my resume. The managers really played it up lol.",
            "title_similarity": "0.6531631",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h56ci06",
            "score": 1,
            "text": "Thank You for this. I have been trying to leave my position as a fast food shift manager to get into the IT field, which I got my degree in 2 years ago, but i have been too scared because I think that I won't be good enough.\n\nHaving my mother as my superior and \"guilt tripping\" me hasn't help me trying to leave either.",
            "title_similarity": "0.55645305",
            "sentiment_compound": -0.7503
        },
        {
            "id": "h56clpc",
            "score": 1,
            "text": "My resume makes my skills and experience sound more complicated and high-profile than they really are.",
            "title_similarity": "0.84782434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56csjn",
            "score": 1,
            "text": "I have the opposite problem: \"wow this job sounds interesting AAAAND it's data input\".",
            "title_similarity": "0.5939243",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h56cwwb",
            "score": 1,
            "text": "I always tell people to let the hiring people decide if you sent right for the job…don’t make that decision for them. \n\nObviously don’t waste everyone’s time if you are clearly not a match for need. Hell my last job I had no idea how to do the thing they hired me to do but they couldn’t find anyone with that skill and I had many other skills they wanted. so I got hired and they just put me through training",
            "title_similarity": "0.6898631",
            "sentiment_compound": -0.5346
        },
        {
            "id": "h56cxl2",
            "score": 1,
            "text": "Job descriptions are a wishlist. Most are not requirements. Show an interest, show them you can learn and are willing, and it can go far.",
            "title_similarity": "0.49558377",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h56cydd",
            "score": 1,
            "text": "I just put out a job posting on indeed! \n\nLPT: if you don't match the criteria, you're not going to show up very high on the list. If the employer has a trait listed as a deal breaker, your application might not even show up in front of the interviewer.",
            "title_similarity": "0.74813527",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56d0j9",
            "score": 1,
            "text": "A small town convenience store near me presently has an exciting opportunity in a fast paced environment for a mature, motivated person who. Must be available evenings, weekendsand holidays.",
            "title_similarity": "0.4576915",
            "sentiment_compound": 0.9246
        },
        {
            "id": "h56d1bu",
            "score": 1,
            "text": "Got a promotion yesterday. Because I was told I'm good at computers.\n\n\nThis job involves imputing information into a fixed panel\n\nIt's not rocket since",
            "title_similarity": "0.47692892",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h56d4h0",
            "score": 1,
            "text": "I really needed to see this. Thank you.",
            "title_similarity": "0.3289863",
            "sentiment_compound": 0.4357
        },
        {
            "id": "h56d538",
            "score": 1,
            "text": "\"Member Experience Liason Associate\"\n\nYou mean receptionist.\n\n\"Environmental Service Aide\"\n\nYou mean housekeeper.",
            "title_similarity": "0.2621838",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56d6d9",
            "score": 3,
            "text": "I worked at a church that cut my hours in half so I had to find a new job. No big deal I hated that job. When I saw what the church had posted for my job description I laughed. I didn't do 90% what was listed. They wanted someone who would do twice the work in half the time with half the pay. No big surprise really, because the Pastor, who wrote the job description,  didn't know even what I did. He flat out refused to learn anything about my job. I was his secretary!",
            "title_similarity": "0.5469326",
            "sentiment_compound": -0.8861
        },
        {
            "id": "h56d7bf",
            "score": 1,
            "text": "Do you mean to tell me I don’t need 4 years at an accredited art school to be a “Sandwich Artist” for Subway?",
            "title_similarity": "0.2751325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56d9ee",
            "score": 1,
            "text": "Yup. Use to be a floor tech. ( Floor Sweeper)",
            "title_similarity": "0.28146315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56dar7",
            "score": 1,
            "text": "This is true. I applied at my current job and got it cuz nobody else wanted to show up to the interview cuz it sounded super hard. I legit just play on canva all day and post on FB and sometimes answer phone calls",
            "title_similarity": "0.58653444",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h56dxbp",
            "score": 1,
            "text": "Didn’t know my resume was actually a job description",
            "title_similarity": "0.5161097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56dzjt",
            "score": 1,
            "text": "Very true. I don't know how to do half the stuff in my job description, nor do I need to for my daily work. No member of my team knows everything, yet we operate successfully.",
            "title_similarity": "0.55927193",
            "sentiment_compound": 0.624
        },
        {
            "id": "h56eget",
            "score": 1,
            "text": "Who's writing them?",
            "title_similarity": "0.28319907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56ermm",
            "score": 1,
            "text": "This can work the other way around though, and you can end up doing far more work and more complicated work than you signed up for, so be cautious",
            "title_similarity": "0.828808",
            "sentiment_compound": -0.1725
        },
        {
            "id": "h56f4wy",
            "score": 1,
            "text": "The comments in this post helped me a lot. Thank you guys. Im someone who gets really discouraged applying to jobs, because i always think that i need to be able to do the job perfectly from the beginning or that im unqualified",
            "title_similarity": "0.7016908",
            "sentiment_compound": 0.5729
        },
        {
            "id": "h56f9iq",
            "score": 1,
            "text": "\"apply anyway!  They don't expect you to know\"\n\nThis is the millennial version of the boomer \"just talk to the manager, shake his hand really hard, and tell him you're ready to work for him.  Do this everyday until he gets impressed\"\n\n\nWhat happens in real life: the ATS program rejects your resume.",
            "title_similarity": "0.6163596",
            "sentiment_compound": 0.5422
        },
        {
            "id": "h56fbq7",
            "score": 1,
            "text": "I was leaving a company once and they started advertising for my replacement and I remember looking at the advert and thinking wow we don't do half of that stuff!",
            "title_similarity": "0.45709953",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h56fcdw",
            "score": 1,
            "text": "Really good advice and timely for me. I’ve been on a temporary promotion the last year and my job came out permanent. When I looked at the job description I thought I was applying for a different job.",
            "title_similarity": "0.46530342",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h56fecc",
            "score": 1,
            "text": "They can also often be vague or be written to cover a wide variety of potential situations. I.e. That office job doesn't require lifting but juuuuuust in casseeee they ever want you to move a box of paper the description says \"must be able to lift 15 lbs\".\n\nI also had a prior director who tried to get a little too liberal with the \"and other duties as assigned\" phrase that was in our job description and contracts.",
            "title_similarity": "0.63325846",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h56ferv",
            "score": 1,
            "text": "Hydro porcelain engineer = Dishwasher",
            "title_similarity": "0.20627557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56fgta",
            "score": 1,
            "text": "When applying for jobs, you should view the descriptions as wish lists.",
            "title_similarity": "0.42723596",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h56fk1b",
            "score": 1,
            "text": "There usually totally unrealistic wish lists",
            "title_similarity": "0.5495573",
            "sentiment_compound": 0.4549
        },
        {
            "id": "h56fpqj",
            "score": 1,
            "text": "I'm sorry if I waste a recruiters time but I say: shoot for the moon.\n\nDo not ever disqualify yourself. Give it your all and let them make their decision.\n\nThis applies to jobs, relationships, etc.",
            "title_similarity": "0.4640705",
            "sentiment_compound": -0.631
        },
        {
            "id": "h56fsa6",
            "score": 1,
            "text": "The proper way to view a job description is as a wish list.",
            "title_similarity": "0.42449793",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h56fv4g",
            "score": 1,
            "text": "The worst that will happen is they'll say \"no\" or just ghost you. However, whether or not you think you're qualified, don't try to predict what employers will say, make them make that determination. Just as long as you're applying for positions within reason (i.e. don't apply for senior positions right out of college).",
            "title_similarity": "0.665638",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h56fxb1",
            "score": 1,
            "text": "Nice, I wrote a very similar front page post to this a few years ago about not being discouraged from job applications that sound impossible to meet. Mods deleted it because apparently it was just an 'opinion' and not a 'tip'.",
            "title_similarity": "0.5402578",
            "sentiment_compound": 0.6197
        },
        {
            "id": "h56g0e2",
            "score": 1,
            "text": "I really needed to hear this today.",
            "title_similarity": "0.4296815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56g0mu",
            "score": 1,
            "text": "Usually repeating the job ad back to them is effective.\n\nSeeking candidates with experience X, Y, Z.\n\nYes, I am a person with skills relating to X, Y, Z...\n\nMost of the time you don't need to have done/learned exactly the thing you will be doing, only that you can demonstrate your ability to learn and be proficient at something like it.\n\nRestaurant POS, call center CRM, and bank industry dashboards are more or less the same things with different colored buttons.",
            "title_similarity": "0.6163327",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h56g6xn",
            "score": 1,
            "text": "It’s like they go out of their way to make the job sound like the hardest thing in the world. As a writer, some of the over-the-top language is hilarious.",
            "title_similarity": "0.8073692",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h56ge4z",
            "score": 1,
            "text": "I read somewhere that you should apply for a variety of jobs even if you don’t think you’re 100% qualified because you could be a perfect fit for them.",
            "title_similarity": "0.6478306",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h56gkgl",
            "score": 1,
            "text": "Also apply for jobs you aren’t qualified for. \n\nWhen I was 18 I had only worked at sonic as a car hop and applied to a position for VP at a local company. I dunno why but they called me and we did a phone interview lol. I did not get the job tho.",
            "title_similarity": "0.4320475",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h56gtp3",
            "score": 3,
            "text": "What most people don’t realize is that if you accurately describe your abilities in your resume, you should apply for everything that you would be willing to do regardless of skill requirements. If the company hires you based on your resume, you are qualified as long as the company doesn’t suck.\n\nI’ve been doing this for a month, I set LinkedIn to show all remote jobs posted most recently making >60k and apply to anywhere from 40-60 jobs per day. The interviews are rolling in and I don’t have THAT many marketable skills.\n\nThe market is crazy right now, especially for recruiters.",
            "title_similarity": "0.64162874",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h56h50u",
            "score": 1,
            "text": "I work in IT and this definitely holds. It's even pretty common to ask for X years of experience in a technology that hasn't even existed for that long.",
            "title_similarity": "0.45442563",
            "sentiment_compound": 0.745
        },
        {
            "id": "h56h6hg",
            "score": 1,
            "text": "Ghost of Tsushima is amazing. To be fair a lot of attention more than a hundred years ago) I'd definitely think that was “Nearly Dying” the way he feels. He’s brought it on himself. Campaigning to get his feet wet.",
            "title_similarity": "0.49120274",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h56hcp9",
            "score": 1,
            "text": "Hey what’s the worst that can happen? You don’t get the job?",
            "title_similarity": "0.51960766",
            "sentiment_compound": -0.6662
        },
        {
            "id": "h56hm0m",
            "score": 1,
            "text": "Same goes with resumes. The wording can be way more articulate than what they actually did.",
            "title_similarity": "0.5548948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56hz82",
            "score": 1,
            "text": "Also save the description to make your cv sound fancy.",
            "title_similarity": "0.42163354",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h56i1fx",
            "score": 1,
            "text": "One time I went back to go read the description of the job I was *currently doing* and excelling at, and it put me in a cold sweat.",
            "title_similarity": "0.5467862",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h56i3ye",
            "score": 1,
            "text": "Thanks, I needed to hear this today",
            "title_similarity": "0.37515074",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h56i95b",
            "score": 2,
            "text": "So, 2 promotions and a job change later I'm finally at the role I thought I applied for 4 years ago.",
            "title_similarity": "0.30478063",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56iisc",
            "score": 2,
            "text": "I’m a senior working at one of the biggest professional services companies in the world. I looked at my job posting the other day and I still dont think I qualify for what they advertised on it",
            "title_similarity": "0.5878814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56j2nx",
            "score": 1,
            "text": "Manage KPI´s = making sure shit is done correctly",
            "title_similarity": "0.47198588",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h56j3y6",
            "score": 1,
            "text": "Sanitation engineer must have degree in garbology",
            "title_similarity": "0.3904223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56jvg5",
            "score": 1,
            "text": "Additionally, the list of requirements is usually not a definite list of requirements - more like a wishlist. Apply anyway if you don't match a few of these requirements; chances are you're still most qualified.",
            "title_similarity": "0.66711354",
            "sentiment_compound": 0.4174
        },
        {
            "id": "h56k4ni",
            "score": 2,
            "text": "It can be annoying when they ask experience in a proprietary internal system that no other company uses",
            "title_similarity": "0.6749854",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h56kc0r",
            "score": 2,
            "text": "a variation on this:\n\nJob descriptions are usually written to sound more complicated and high profile than they actually are. \n\nso you look for a job in a field that you have years of experience with, and find several matches that sound great. \n\nthen you go to the interview and ask questions and find out its literally the same job you're already doing and the pay is worse.",
            "title_similarity": "0.8400668",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h56kerz",
            "score": 1,
            "text": "This all day and a years worth of Saturdays",
            "title_similarity": "0.19946179",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h56kg06",
            "score": 1,
            "text": "It's like some of the reddit posts I've seen of job postings that require more years of experience than a framework has existed.",
            "title_similarity": "0.58830404",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h56kp3n",
            "score": 2,
            "text": "I was in my 40s before I realized this and that all my successful friends were inflating their skillset and abilities as well.\n\nImposter syndrome combined with naive honesty is a bitch.",
            "title_similarity": "0.6062546",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h56krdv",
            "score": 2,
            "text": "It is the vague skills that get me. Attention to detail? Nope, my brain reads english as it is supposed to be so spelling errors are often missed. Self starter? Nope! I need you to tell me what you want me to to do, you pay me for tasks and if coming up with tasks is my job then you are hiring too many people.",
            "title_similarity": "0.69461083",
            "sentiment_compound": -0.721
        },
        {
            "id": "h56l1i5",
            "score": 1,
            "text": "how do you know that? studies link?",
            "title_similarity": "0.21594149",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56l42o",
            "score": 2,
            "text": "And that is because some jerk managers try to prove to upper management that how important job they supervise.",
            "title_similarity": "0.6789923",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h56l67f",
            "score": 1,
            "text": "On the flip side of this, I’m currently trying to recruit someone for my team doing a fairly complicated job, and the amount of total chancers I’ve had apply or that I’ve interviewed who don’t wouldn’t actually have a clue what to do day to day if they got the job is astounding.",
            "title_similarity": "0.7657967",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h56l87j",
            "score": 3,
            "text": "I applied for a job, got an interview, submitted a presentation for it then backed out of the interview because the job description was so terrifying. They called me at the time the interview was supposed to be happening and told me I was exactly what they were looking for and my presentation looked great. Super awkward!",
            "title_similarity": "0.6394446",
            "sentiment_compound": 0.4679
        },
        {
            "id": "h56ln7q",
            "score": 2,
            "text": "I honestly think it's very uncool of employers when they do that, because it really discourages people.",
            "title_similarity": "0.60464406",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h56loxr",
            "score": 2,
            "text": "Most of the posts I’ve seen have “desired” and “required” qualifications listed as bullets towards the bottom. They also usually have years in parenthesis.\n\nI always figure that there’s some wiggle room for number of years because e.g. doing it well for 1-2 yrs is preferable to skating by for 4-5.\n\nOther than that, no. Please don’t encourage people to apply for positions they’re wildly unqualified for. There’s no shortage of that as is, and it makes the job hunt harder for the rest of us.",
            "title_similarity": "0.6712848",
            "sentiment_compound": 0.829
        },
        {
            "id": "h56lpjf",
            "score": 1,
            "text": "I just giga spam everything that falls in my specialty. Still no job tho qq",
            "title_similarity": "0.45361495",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h56ltw0",
            "score": 2,
            "text": "We needed to hire a new person so my current company had faceless HR hit us up to confirm a revised job description as ours was a bit dated. I compared it to the older one and it went from a recognizable job to a job that I myself wouldn't apply for. I hit my boss up and of course got tasked with \"helping\" HR. \n\nI wanted to ask so badly where they got the inspiration for doing it themselves as I thought Directors would send in a list and HR would tune it up - not the other way around! \n\nNote: I asked a few questions in the group interview if the candidate was (line X from crappy description) and it popped everyone including the candidate.",
            "title_similarity": "0.7208588",
            "sentiment_compound": -0.5079
        },
        {
            "id": "h56maoj",
            "score": 1,
            "text": "It's the \"essential criteria\" that gets me every time. So I've been stuck in a minimum wage dead end job, literal dead end zero chance of progression. Since 2002, got bills to pay and kids to feed. Don't work for the NHS kids.",
            "title_similarity": "0.44828856",
            "sentiment_compound": -0.8824
        },
        {
            "id": "h56mbs2",
            "score": 1,
            "text": "They're also often written by people who literally do not understand the job they're posting or sometimes even interviewing for (read: someone in HR). \n\nIf you go into an interview and the only person interviewing you is someone from HR, I would consider that a big red flag because they are hiring people with no understanding of the actual roles they hire people for. This can result in a real shitshow sometimes, especially for more advanced jobs.\n\nThere should be *at least* 1 person directly involved with what you will be doing (ideally, your boss and even a panel of interviewers).",
            "title_similarity": "0.80223083",
            "sentiment_compound": 0.4865
        },
        {
            "id": "h56mbwt",
            "score": 1,
            "text": "I worked at a call center…. Most of the jobs there choose not to mention you’ll be in customer service or in an in-bound call center. They’d make every job sound like it was back office, professional, and not customer facing because turnover was high and no one was applying for the stressful, low paying, dead end jobs.",
            "title_similarity": "0.6033006",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h56mchs",
            "score": 1,
            "text": "Too bad they rarely attract those high profile professionals lol",
            "title_similarity": "0.69087696",
            "sentiment_compound": -0.4234
        },
        {
            "id": "h56o2ff",
            "score": 1,
            "text": "To play devil’s advocate, if you have no qualifications whatsoever related to the requirements of the job description please don’t apply. \n\nSincerely,\nThe recruitment team",
            "title_similarity": "0.5871854",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h56o75s",
            "score": 2,
            "text": "This is going to be buried, but also want to point out that job requirements usually aren’t strict requirements. \n\nI’ve been a software developer professionally for about 1.5 years, but have been approached by so many recruiters wanting to fill positions asking for 3+ years of experience, using technologies I’ve never touched.",
            "title_similarity": "0.53468686",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h56oah0",
            "score": 1,
            "text": "If a retail job advert says \"you will be working in a fast-paced, ever-evolving environment whilst liasing with customers daily\"\n\nIt just means you're gonna be serving customers in a sometimes busy store with idiots making planograms that don't make sense.\n\nOnly very few jobs are actually as complicated as they say that they are. You got this!\n\nAPPLY YO",
            "title_similarity": "0.6911243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56oeuq",
            "score": 1,
            "text": "Up until HR goes through your CV/resume and does a word matching exercise. Really grinds my gears when people who know sweet F A about anything outside of their own profession gatekeep the role.",
            "title_similarity": "0.64693534",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h56oi89",
            "score": 1,
            "text": "Yeah but a smart person would take those over complicated descriptions of their job and paste it on their resume",
            "title_similarity": "0.6193174",
            "sentiment_compound": 0.631
        },
        {
            "id": "h56omyx",
            "score": 1,
            "text": "I’m looking at corporate positions in my industry and it’s wild how they try to make it seem like you need to be an intellectual to accomplish the responsibilities.  I fully intend to rewrite my resume with this nonsense jargon to make my current and previous responsibilities sound like I was writing treaties between nations.\n\nYou have to play this stupid game to get ahead and I’m ready to play.  Too long I’ve been modest on paper.",
            "title_similarity": "0.7305218",
            "sentiment_compound": 0.851
        },
        {
            "id": "h56onlr",
            "score": 1,
            "text": "**Never** take yourself out of contention by not applying for a job because of its description or set of preferred qualifications. Make the would-be employer tell you *no*.",
            "title_similarity": "0.6142635",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56p41v",
            "score": 1,
            "text": "It’s the “experience required” bit that makes me turn away.",
            "title_similarity": "0.57469124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56p9mc",
            "score": 1,
            "text": "Job descriptions are set up the same way as your resume usually. Inflated. And for this reason, employers go by what you say in the interview rather than your credentials. Nowadays everything is automated anyway so you'll score an interview with keywords in your resume that match those listed in the job description. \n\nBut in all seriousness. Do not apply for a job if you don't understand any of the words listed in the job description. Do not say you know Python, if you just know what it is.",
            "title_similarity": "0.72478426",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h56pe1o",
            "score": 2,
            "text": "Cashier\nJob description: Applying and facilitating mercantalism through the transference of legal tender in exchange for capital materiel, services, or consumer goods. \n\nQualifications: Must have 11 years of pre-graduation education and proven mastery of archimedian notation and operators.",
            "title_similarity": "0.4044069",
            "sentiment_compound": 0.128
        },
        {
            "id": "h56pera",
            "score": 1,
            "text": "Oh man, I work in a fairly niche field with pretty modern technology.\n\nThe number of times i've seen jobs advertised that require 5 years of experience on a product that was only released 2 years ago.\n\nTL;DR - Recruitment agencies have no idea on the roles they're being asked to fill",
            "title_similarity": "0.42621246",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h56pl5m",
            "score": 1,
            "text": "You can do the same thing too:\n\nKid's Rockwall Belayer ---> Challenge Course Operator and Specialist\n\nNow I'm a superninja",
            "title_similarity": "0.3735735",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h56pqdc",
            "score": 2,
            "text": "Counterpoint: maybe companies should just ask for what they actually need?",
            "title_similarity": "0.5329209",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56pt99",
            "score": 2,
            "text": "Was in the same position 3 years ago, worked as a technician in field service for very specific product, and wanted to get off the road. I then found a job offer at a local company user helpdesk, and at first i was to afraid that I couldn't do it. I applied nonetheless, and after 1 year i got promoted to  the team of administrators. Never again will I shy away from an opportunity job wise.",
            "title_similarity": "0.49377882",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h56q7fe",
            "score": 1,
            "text": "This. I have been applying to jobs the last couple weeks and I just had a similar thought this morning. One was so cleverly worded that I got almost all the way through the listing before I realized the job was for a fast food attendant, not a mid management customer relations type role. Talk about overboard, not to mention a waste of time, wading through hundreds of these.",
            "title_similarity": "0.46477157",
            "sentiment_compound": 0.3488
        },
        {
            "id": "h56q896",
            "score": 1,
            "text": "Could not agree more. Most jobs vastly overstate the needed requirements. The only reason my friend got his job was because the posting accidentally listed 2-3 years experience instead of 5-7. He's doing just fine.",
            "title_similarity": "0.5689288",
            "sentiment_compound": 0.1255
        },
        {
            "id": "h56qg8i",
            "score": 1,
            "text": "So what do I do in this situation\n\n\"We are looking for new graduates with 10 years of experience!\"",
            "title_similarity": "0.39939803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56qw1m",
            "score": 1,
            "text": "They just decided to rewrite all of our job descriptions where I work.  What they wrote mine up as isn't *wrong*, but it probably would have scared me off if I was applying. OP is spot on.",
            "title_similarity": "0.6814044",
            "sentiment_compound": -0.4719
        },
        {
            "id": "h56qwc7",
            "score": 1,
            "text": "Thanks. I needed to see this today.",
            "title_similarity": "0.34103537",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h56qwiv",
            "score": 1,
            "text": "Got damn is this ever true. I work for the government in Parks, and they make it seem like you need to be a godsend to work there.\nALWAYS APPLY.  Even if you think you're underqualified, and you managed to get an interview, it's a great experience knowing the exact kind of questions they will ask so you can be more prepared for future job interviews.",
            "title_similarity": "0.6083032",
            "sentiment_compound": 0.9134
        },
        {
            "id": "h56qybs",
            "score": 1,
            "text": "I needed to see this today. Thank you.",
            "title_similarity": "0.3387647",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h56r1kt",
            "score": 2,
            "text": "Why can't the world just be an honnest place to live in?",
            "title_similarity": "0.4789637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56rhij",
            "score": 1,
            "text": "Definitely a good tip. Also: Think about doing that job and if you can see yourself having fun or being bored by it. I almost went back into IT because I'm good at technical stuff. But I remembered how much I didn't care about that certain subject. It's not worth it if you can't even bother to learn it.",
            "title_similarity": "0.7029482",
            "sentiment_compound": 0.6265
        },
        {
            "id": "h56ri3r",
            "score": 2,
            "text": "Another point that interviewers don’t want mentioned is that it gives them an out. They add a bunch of qualifications to the description so that if you creep them out, they can use the qualification as an excuse to not hire you.",
            "title_similarity": "0.6925825",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h56rucv",
            "score": 1,
            "text": "In my experience, this is straight up wrong. Mine was written more muted and less demanding than it actually was",
            "title_similarity": "0.5661274",
            "sentiment_compound": -0.4228
        },
        {
            "id": "h56rx19",
            "score": 1,
            "text": "I’m at the “fuck it, lying to myself got me this far maybe these assholes will believe it too…” phase of job applications.",
            "title_similarity": "0.6486882",
            "sentiment_compound": -0.802
        },
        {
            "id": "h56s7kv",
            "score": 1,
            "text": "Also, the qualifications are a wish list or combination of the histories of everybody that has held the job in the past.  If you think you can do it, apply.",
            "title_similarity": "0.44647866",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h56slir",
            "score": 1,
            "text": "The jobs I hire for are not high level but I specifically make it sound as complicated as possible so I can justify a better wage to HR.",
            "title_similarity": "0.81396586",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h56spai",
            "score": 2,
            "text": "prime example:\n\nunderwater ceramic technician \n=\ndishwasher",
            "title_similarity": "0.22495082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56sq1t",
            "score": 1,
            "text": "There’s no harm in applying for a job you ‘think’ is above you. The worst that can happen is they say no. If you see a job you like the look of and you can meet the essential criteria (sometimes even that has a bit of a leeway, like “ x certificate in xyz required” but you have 5 years experience in xyz, rather than a formal qualification) just go for it.",
            "title_similarity": "0.5953665",
            "sentiment_compound": 0.2204
        },
        {
            "id": "h56sr1i",
            "score": 1,
            "text": "In Web Dev jobs this is 100% accurate.",
            "title_similarity": "0.2659495",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56srvw",
            "score": 2,
            "text": "Had a friend try to get me into a job role he felt confident I could do it. I don’t have much IT support background so I psyched myself out and never applied. I finally humored the application. Got offered, got paid more than my old job I was burnt out on. And honestly this job is a pure cake walk. Definitely regret not hopping in a year or two ago.",
            "title_similarity": "0.5831554",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h56st8f",
            "score": 1,
            "text": "Been in my new role for 2mo at the company I've been with for 8yrs. They paid for 100+ college credits and I was scrolling through job openings. Saw one posted for entry level finance and said fuck it, alls they can say is no. Even though the job description was really intimidating this shit is super easy at my level.",
            "title_similarity": "0.4423799",
            "sentiment_compound": -0.4539
        },
        {
            "id": "h56szag",
            "score": 1,
            "text": "STOP REQUIRING MULTIPLE YEARS OF EXPERIENCE AND A GOD DAMN BACHELORS DEGREE FOR SO CALLED ENTRY LEVEL POSITIONS!!",
            "title_similarity": "0.4758827",
            "sentiment_compound": -0.5242
        },
        {
            "id": "h56t93t",
            "score": 1,
            "text": "After I got into it with my new manager last year he put up my job online description online thinking it would go unnoticed. I had people message me saying hey, isn't that what you do? I copied it down for my resume and just rolled with it. After having the job posted for a month with no inquiries that I know of.. They took it down. Then at the end of the year he gave me a raise. I'll never regret standing up for myself to new management. They wanna look so good and don't take the time to understand the process.",
            "title_similarity": "0.5124639",
            "sentiment_compound": 0.5958
        },
        {
            "id": "h56thj2",
            "score": 2,
            "text": "Lol. My job description sounds complicated and high profile. While the stuff on the job description actually fits that bill rather accurately, the amount of things I do that aren't on that list and are equivalently high profile and complex would fill 10 pages, single space. \n\nLPTs like this are for people with low end jobs that are billed as high end jobs. People with actually high end jobs are unfamiliar with what you're talking about.",
            "title_similarity": "0.755162",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h56tj2w",
            "score": 1,
            "text": "Great advice. I applied for a job that sounded way above my league but did it anyways. Got an interview and eventually the job. Aftey the first week, I actually felt over-qualified.",
            "title_similarity": "0.6012817",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h56tjdj",
            "score": 2,
            "text": "I have the easiest job in the world and the job description is severely convoluted.",
            "title_similarity": "0.5115746",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h56tx43",
            "score": 1,
            "text": "This is a difficult one for me. I write my job descriptions to sound this way to weed out the shite. However, I don't include unnecessary skills and qualifications. There's kind of an art to changing \"must be competent at talking to people\" to \"proficient in discussing significant matters with high-level stakeholders\".\n\nChances are they aren't going to be speaking to the CEO on a daily basis, but on the off chance I don't want some bumbling idiot making me and my team look bad. To be fair we do a fair amount of supplier management so it's not really that much of a stretch. Big words scare away chancers more often than not.\n\nOP is right though. If you understand the words and you feel like you're confident in doing the job apply for it!",
            "title_similarity": "0.7481854",
            "sentiment_compound": 0.2867
        },
        {
            "id": "h56tyrc",
            "score": 1,
            "text": "This is definitely a topic that grinds my gears....say, for example, you're a 60-something with lots of previous office experience looking for a basic clerical job to supplement your Social Security or whatever. Every employment ad is such a mish-mash of Corporate Speak...! The company is basically looking for someone who can answer the phone in a professional manner, who can sort and file documents and who has basic computer skills (usually Word and Excel are enough for a \"secretary\" - even in jobs that specified \"fluency in Power Point\" was necessary, the boss who is doing the hiring rarely if ever makes slide show presentations or even knows what Power Point is. But try and read through all that jibber-jabber about \"throughput velocity\" and \"core competencies\" that will help to \"maximize our revenue stream\". Oh, for heaven's sake - so you're saying the company wants to make money, OK, I'll answer phones, type letters/invoices/whatever and file them and keep track of your daily calendar. Can't you just explain those typical job requirements for an administrative assistant/secretary in plain English?",
            "title_similarity": "0.61238766",
            "sentiment_compound": 0.8122
        },
        {
            "id": "h56uc63",
            "score": 1,
            "text": "Go through the description line by line and justify why you think you can do each thing. It’s the best way to know if you truly are experienced enough for a job and it is excellent interview prep. If you can’t even be bothered to do this level of prep before applying, then save everyone’s time and don’t apply.",
            "title_similarity": "0.67784804",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h56ucau",
            "score": 2,
            "text": "Usually LPT are biased and forcing an interpretation of events, sometimes it's also straight up bad advices, even if they are quite appealing to read, but this one, it's so freaking true.\n\nThese days, every time you apply to a job, you need to know how to do numerous things no one ever heard about, and when you get in, no on ever mention those things, it's just there to scare people not being confident enough, also, legal issues.\n\nI wish syndicalists would look into this mess, that and how companies are making super elaborated job description that no one could ever fit in, so that they still get the benefits of doing it, but still just hiring their homies, and not taking a single job application seriously.\n\nThis shit is super confusing at time, and the only way to get through it, is by applying to a dozen a day, until they call back, and accept that some people will make fun of you, and your resume.",
            "title_similarity": "0.8453857",
            "sentiment_compound": -0.2231
        },
        {
            "id": "h56uvy1",
            "score": 1,
            "text": "I need to keep this in mind\n\nI need to keep this in mind\n\nI need to keep this in mind",
            "title_similarity": "0.3071838",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56uxfa",
            "score": 2,
            "text": "I got promoted and had to hire 2 people for my original position, I saw the job description on out web page and I still think I can't do half the shit they name on there! I wouldn't hire me to do that!",
            "title_similarity": "0.58540756",
            "sentiment_compound": 0.8652
        },
        {
            "id": "h56vh9v",
            "score": 1,
            "text": "The descriptions are also often written by people with no real understanding of what the job actually entails. All you need to do is bullshit your way through the door then impress the hiring manager who usually does know what they're after.\n\nMy best tip for interviews is always answer their questions without hesitation. Never \"umm\" about it or say you don't know or can't think of anything. \n\nAs a fun anecdote, I once gave an in-depth description about organising and leading 40-man raids in WoW for examples of my abilities with problem solving, decision-making and leadership.  The interviewer had no idea about WoW but was fascinated and kept asking more questions. I left thinking that was the dumbest thing I'd ever done. They called the next day and offered me the job.\n\nFor what it's worth, organising and leading 40-man raids in WoW back in the day was absolutely more challenging than any office management tasks I've ever had to do. Don't ever believe job description hype.",
            "title_similarity": "0.736604",
            "sentiment_compound": 0.949
        },
        {
            "id": "h56vl4w",
            "score": 1,
            "text": "Yep. This is true for mine 100%. They ask for a masters degree and all of these high profile skills. You literally just drive around making sure stuff looks normal lmao",
            "title_similarity": "0.4402046",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h56vs37",
            "score": 1,
            "text": "I have applied to so MANY CEO positions",
            "title_similarity": "0.325615",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56vt7y",
            "score": 1,
            "text": "Sometimes the job description is needed though",
            "title_similarity": "0.5327128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56vw5e",
            "score": 1,
            "text": "Save that posting to update your resume!!",
            "title_similarity": "0.33110946",
            "sentiment_compound": 0.5837
        },
        {
            "id": "h56vzn8",
            "score": 1,
            "text": "Also, rephrase the things from their job postings into your previous job description.",
            "title_similarity": "0.42484668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56w2zt",
            "score": 1,
            "text": "LPT: if you are hiring and you do this with your job description, fuck you.  \nJust say what the job is and what it does.",
            "title_similarity": "0.61799955",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h56w6pm",
            "score": 1,
            "text": "I applied for a job that seemed out of my reach. I interviewed and apparently \"knocked it out of the park.\" Got the job which is a nice step up.",
            "title_similarity": "0.59164685",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h56werw",
            "score": 2,
            "text": "No shit sherlock. Welcome to r/recruitinghell .  I dont even read those fuckers. I just click apply and past resume as fast as I can. Also fuck any application that wont let you just upload a resume.",
            "title_similarity": "0.57208574",
            "sentiment_compound": -0.3561
        },
        {
            "id": "h56wfu0",
            "score": 1,
            "text": "Also, don't let it deter you if a position indicates it is for mid or senior level. Lower level positions are often backfilled with a candidate who may not be senior or mid level, but applied anyway. Let HR be the one to decide if you are fit, don't judge yourself.",
            "title_similarity": "0.6937827",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h56wp4v",
            "score": 1,
            "text": "I get this when applying for jobs, I read the description and it sounds intimidating!!",
            "title_similarity": "0.6735227",
            "sentiment_compound": -0.5399
        },
        {
            "id": "h56x63x",
            "score": 1,
            "text": "Finally someone said it.",
            "title_similarity": "0.15506908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56xasv",
            "score": 1,
            "text": "Yes! We write them to sound smarter too, just like resume and cover letters. I had a marketer fight with me to require college education for my sales hires recs. I don't think I agreed, but his argument was that the right aggressive hustler will compel us anyway, and ignore the requirement.",
            "title_similarity": "0.6645936",
            "sentiment_compound": -0.743
        },
        {
            "id": "h56xbei",
            "score": 1,
            "text": "ALWAYS apply up. I never apply for a job I already 100% know everything about because not every job has \"upward mobility,\" so there's a chance I would never learn or grow or get better if I was already at that exact job level.",
            "title_similarity": "0.6009346",
            "sentiment_compound": 0.6326
        },
        {
            "id": "h56xh57",
            "score": 1,
            "text": "Also keep in mind a lot of jobs are terrible at training.",
            "title_similarity": "0.63942915",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h56xmbm",
            "score": 2,
            "text": "As someone who is on Indeed a lot, I am just tired.in general over the employer holding all the power in these scenarios. \n\nThey want 10 years of work history, background info, the names, addresses, and contact info of your three closest references, your social security number, bank and routing information, and even though you might be applying for Dollar General they want you to take an online psychological test that can literally be hundreds of questions wrong...\n\n..but they wont post any real information about the job or what it entails. Its ludacris, how about you tell me what the job IS first?",
            "title_similarity": "0.6882009",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h56xr3l",
            "score": 1,
            "text": "Part of this in corporate is getting the job internally graded to the level you need it. E.g a certain compensation or a particular title. All the buzz words and responsibilities need to get past the grading exercises.",
            "title_similarity": "0.6248909",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h56yilb",
            "score": 2,
            "text": "My resumes are written to make me sound way more qualified than I am. It's a word game both ways, and confidence is the key to winning that game. If you have a hard time putting mundane tasks into fancy words, spend a little cash and have it written for you.and don't be afraid to add stupid things to it. \n\nFor example, In the army. A private could add cutting grass as a primary responsibility, which could be worded as \"specialist in care of area maintenance\" or as an NCO, \"supervised team responsible for maintaining a professional appearance\" or some shit like that (sorry I'm drunk so I can't come up with more off the top of my head) but it's all in how you word it, but also understanding the position for whixh you are applying and understanding what it means. Don't be intimidated by big words. \n\nIf nothing else, you really have nothing to lose by trying. You either lose something you never had, or gain something you didn't think you could gain.",
            "title_similarity": "0.70360535",
            "sentiment_compound": 0.7153
        },
        {
            "id": "h56ykjt",
            "score": 2,
            "text": "I read an article stating men are more likely to apply for jobs that they aren’t qualified for based on the description than women. I decided that I wouldn’t let lack of experience or the “wrong” degree stop me. Within reason of course- not applying to he a surgeon or airplane pilot lol",
            "title_similarity": "0.75884074",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h56yth6",
            "score": 1,
            "text": "I work in regulatory compliance  and my whole life is spent trying to stop people from sounding like lawyers. Just write down what the person does. Just simply and clearly and in plain English. The more grandiose you make it sound, the harder the audit is going to be",
            "title_similarity": "0.7364919",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h56z7es",
            "score": 1,
            "text": "Most companies will let you wing it too.",
            "title_similarity": "0.27791387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h56zpy6",
            "score": 2,
            "text": "If you enjoy playing with language take a job description and use the thesaurus function in Word to find the simplest way to express each of the buzzwords or phrases that companies tend to use. You can dumb it down and get a laugh.",
            "title_similarity": "0.57037485",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h570tii",
            "score": 2,
            "text": "what about requirements like degrees and such? do big firms high ball because they have the choice and small firms take slightly less qualified because they dont?",
            "title_similarity": "0.727187",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h5712mi",
            "score": 3,
            "text": "Also don't be put off by higher salaries. \n\nI read a post by somebody who worked in recruitment for a company and they observed that when they advertised a position with a higher salary they got fewer applicants and those applicants weren't any more experienced. People were obviously just put off by the perceived increase in responsibility and required skill. I saw an advert for a job advertising a salary very high for my industry and 25% more than I was currently earning. I thought what the hell nothing to lose and applied. I got the job and it's no more demanding than the previous two jobs i had. And what's more when I started the outgoing incumbent told me they'd had no other applications!",
            "title_similarity": "0.6364895",
            "sentiment_compound": -0.3767
        },
        {
            "id": "h5731my",
            "score": 1,
            "text": "The only thing deterring me from applying for any job is the shit salary they offer",
            "title_similarity": "0.6846796",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5733x2",
            "score": 1,
            "text": "The way I look at it is to picture someone making their linked-in profile. That's EXACTLY how they would word their position.",
            "title_similarity": "0.30250183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h573gon",
            "score": 1,
            "text": "I recently got a job offer where the description said 8+ years of experience required. I just have 4 years of experience.",
            "title_similarity": "0.30011475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h573nx4",
            "score": 1,
            "text": "Some companies write them to be super broad and cover a big range of jobs. Looking at you UHG",
            "title_similarity": "0.60042083",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h573yky",
            "score": 1,
            "text": "I really needed to hear this today.",
            "title_similarity": "0.4296815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57481r",
            "score": 1,
            "text": "On the flip side they are also written to look a lot less complicated to draw people in.",
            "title_similarity": "0.5796312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h574jxv",
            "score": 3,
            "text": "It depends. The job descriptions that I write is exactly what we need, and if there's anything less, that means the unfulfilled duties goes back to the rest of the team. I don't want to say it negates the hire, but we need the people to come in and help us fill the gaps that we have.\n\nAnd yes, we pay well, and we also treat our employees well.\n\nI think the better LPT would be to apply for jobs even if you don't fulfill every job requirement or have every necessary skills that they list. Let them rule you out; don't rule yourself out of the position. They may find that they are fine with what you bring and have enough work power to handle the rest. (Or they may not want that, which again, let them decide, not you!)",
            "title_similarity": "0.7659745",
            "sentiment_compound": 0.9454
        },
        {
            "id": "h575231",
            "score": 1,
            "text": "Very true! This was me with my last job. Also, use the buzzwords they do: sometimes they auto-filter your resume by keywords.",
            "title_similarity": "0.4555825",
            "sentiment_compound": 0.5244
        },
        {
            "id": "h5754rp",
            "score": 2,
            "text": "Why do they do that?  To attract the best?  \n\nWhat about when a job claims to be entry level but requires 1-2 years of experience?  To me, that says that they want someone who is new to the field but knows the job so they don't have to be taught from scratch.  And when I see that I get disheartened because it feels out of reach for me, who just has a degree and no experience.",
            "title_similarity": "0.7157842",
            "sentiment_compound": -0.5705
        },
        {
            "id": "h575xz2",
            "score": 2,
            "text": "Awesome, now I’m going to apply for the neuro surgeons job that I’ve been eyeing for a while, sounds complicated but how hard could it really be right?!",
            "title_similarity": "0.619235",
            "sentiment_compound": 0.3054
        },
        {
            "id": "h576sub",
            "score": 1,
            "text": "I will argue the aerospace engineering jobs are a bit out of my league though.",
            "title_similarity": "0.6790493",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5771fs",
            "score": 1,
            "text": "Yeah, I've seen this especially in the auto industry, job listings that sound really cool but when you read in between the lines it's an oil change job.",
            "title_similarity": "0.46199688",
            "sentiment_compound": 0.3392
        },
        {
            "id": "h5771iz",
            "score": 1,
            "text": "Even the requirements tend not to be hard and fast rules. I applied for a job with 2 years exp when they were asking for 5 and landed it. Apply for a job you want and be excited about the job in the interview",
            "title_similarity": "0.43974978",
            "sentiment_compound": 0.4581
        },
        {
            "id": "h577fl9",
            "score": 2,
            "text": "And if there is corporate lingo in there that you don't understand, don't worry. Simply ask someone who knows it to translate it to regular speak. \n\nCorporate lingo often serves as gatekeeping: it is its own language (sometimes very specific to the corp) and looks complicated, but the concepts are usually pretty mainstream and explainable. Some terms will be important to the eventual job, but some really aren't because they only matter to that specific place, they have a  equivalents, and you will learn them eventually. This is especially true for projectmanagement and the organizational fads of the day (\"we do holocracy\" \"we are self-steering\" et cetera).\n\nKnowing the lingo beforehand is often less important than it seems - like any language, it can be learned. And you will learn it once there.",
            "title_similarity": "0.790977",
            "sentiment_compound": 0.9358
        },
        {
            "id": "h577pnf",
            "score": 1,
            "text": "Yup, my official job title is “fabric operative/escort” fancy way of saying I do light maintenance work, light diy, and escort contractors around site",
            "title_similarity": "0.347474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h577yf8",
            "score": 1,
            "text": "So basically like a Resumè",
            "title_similarity": "0.23560083",
            "sentiment_compound": 0.4173
        },
        {
            "id": "h57995c",
            "score": 2,
            "text": "A company I worked for had a crap legacy system where the requirements would have been a short list of 15  year old technologies. So instead they had requirements that vaguely looked like the list if you were to entirely rewrite the system using new tech.\n\nExcept there were no plans to replace it ever.",
            "title_similarity": "0.45680493",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h579afe",
            "score": 2,
            "text": "Do not let it deter you because once you get the job, they’ll add responsibilities that weren’t in the description anyways",
            "title_similarity": "0.7532967",
            "sentiment_compound": 0.0
        },
        {
            "id": "h579eyc",
            "score": 1,
            "text": "So it is basically to filter out people who have low-self esteem on their experience or is it the chance to negotiate a higher pay?",
            "title_similarity": "0.63606554",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h579f3i",
            "score": 4,
            "text": "\"Must be able to work in a fast-paced environment with tight deadlines\" - every job ad ever.",
            "title_similarity": "0.6754855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57a1sp",
            "score": 2,
            "text": "That’s good because usually my resume is also written to sound more high profile than it actually is.",
            "title_similarity": "0.76217186",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h57a2s4",
            "score": 1,
            "text": "In my experience about half the stuff in the job description either won’t be part of the job or will be so minor that technical qualifications won’t matter.\n\nFor example, “Experienced with MySQL database” with no further explanation generally means you’ve worked on a product that uses MySQL, not that you can install, configure, design, and program MySQL.",
            "title_similarity": "0.5356489",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h57a4t6",
            "score": 1,
            "text": "yeah my job read like i needed to know absolutely everything before i even thought about signing up, turns out i didnt and theyre training me on  everything",
            "title_similarity": "0.58463264",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h57ay5t",
            "score": 1,
            "text": "[That's why this meme exists.](https://i.kym-cdn.com/photos/images/newsfeed/002/143/319/79c.png)",
            "title_similarity": "0.32523096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57bbjs",
            "score": 1,
            "text": "And most of the procedure is \"do as I say, not as I do\".",
            "title_similarity": "0.47708872",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57bmna",
            "score": 1,
            "text": "A job description is somebody’s wish list. If you can cover a good bit of it, you’re likely fine.",
            "title_similarity": "0.44955805",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h57btre",
            "score": 1,
            "text": "More importantly,  you don't know who your competition is.  It could be Joe from accounting.   Fuck that guy.",
            "title_similarity": "0.48213106",
            "sentiment_compound": -0.228
        },
        {
            "id": "h57cizd",
            "score": 1,
            "text": "Shoot your shot, your majesty.",
            "title_similarity": "0.23252529",
            "sentiment_compound": -0.34
        },
        {
            "id": "h57cuhq",
            "score": 1,
            "text": "But what if I don’t think I can do the job described? How do i know what the company actually wants if they overstate the job duties?",
            "title_similarity": "0.67367136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57djan",
            "score": 1,
            "text": "100% true lol my job ain’t too difficult but the description was insanely long including a lot of stuff I never have been asked to do lol",
            "title_similarity": "0.5558251",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h57djgn",
            "score": 1,
            "text": "Is this actually true? I’m entering college this fall and I want to start looking for jobs",
            "title_similarity": "0.35365045",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h57dkd3",
            "score": 1,
            "text": "In Business everything is possible. \nDon’t let your mind block your ways.",
            "title_similarity": "0.44459412",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h57dmze",
            "score": 1,
            "text": "I’ve written job descriptions that were unrecognizable once they got back from HR. Also remember that these descriptions are a wish list, or more cover a range of positions. When I have had multiple positions open the first one to fill may be strong in one area and weak in another. We’ll try to compensate when we fill the second. \n\nAlso personality and attitude beat skills any day.  I can rent expertise pretty easy. When I’m hiring I’m looking for someone that fits the team or fills a void.  If you show me you are willing to learn and have a good attitude I’ll hire you over a master in the field who is a jackass any day.",
            "title_similarity": "0.67589986",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h57fnep",
            "score": 1,
            "text": "Generally yes -- and then sometimes it's the opposite! I applied for a job once as the assistant to the sheriff's public information officer...and job description be damned, they interviewed me as if I were applying for the PIO job itself. In retrospect it makes sense -- they need someone who could sub right in if the PIO has laryngitis the day some kid shoots up a school or something -- but it was unexpected, and I was not at all prepared for that.",
            "title_similarity": "0.58545816",
            "sentiment_compound": -0.3051
        },
        {
            "id": "h57g667",
            "score": 1,
            "text": "https://www.reddit.com/r/Glitch_in_the_Matrix/comments/8qck6s/elevators_freak_me_out_the_first_time_my_mom/?utm_medium=android_app&utm_source=share\n\nI think I'm still waiting for my Job news whether I got offer or not. Bbls are so obvious.",
            "title_similarity": "0.49899256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57glbe",
            "score": 1,
            "text": "I’ve always heard that if you are 100% qualified for a job, you are overqualified for that job.",
            "title_similarity": "0.57153714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57gsc4",
            "score": 2,
            "text": "I've read the job description for the job I've had for the last 20+ years.  I definitely don't qualify.",
            "title_similarity": "0.36352983",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h57hbit",
            "score": 1,
            "text": "I have an important (for me) job interview in two days, thank you for this haha I’m quite nervous and it made me feel a bit better.",
            "title_similarity": "0.576452",
            "sentiment_compound": 0.8078
        },
        {
            "id": "h57hi1z",
            "score": 2,
            "text": "Not this. I put a job for a network tech on Indeed. It's $10 per person that applies. 99% of applicants had fast food experience. A couple could use office. They had to check the boxes that they had at least 5 years of network experience, and just lied.",
            "title_similarity": "0.42124742",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h57hk7h",
            "score": 1,
            "text": "Also, focus on the jobs you'd LIKE to do and not only on those you CAN do.",
            "title_similarity": "0.59941673",
            "sentiment_compound": 0.4995
        },
        {
            "id": "h57hvn8",
            "score": 3,
            "text": "This reminds me of my friend. On his CV he said he was a \"World News Distributor\" whose responsibility was \"using his vehicle to visit various clients and keep them up to date with current events, financial information, stock market etc\"\n\nHe was a paperboy",
            "title_similarity": "0.40925404",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h57i6rj",
            "score": 1,
            "text": "Thank you. I really needed to hear this because that's exactly what I've been doing. I know I can DO the jobs I want to apply for, but I don't have every skillset they're looking for. So I skip over those ones. I'm going to apply to them anyways!  What have I got to lose?",
            "title_similarity": "0.7087384",
            "sentiment_compound": -0.4482
        },
        {
            "id": "h57inra",
            "score": 1,
            "text": "I was on a few hiring committees at a previous job. We laboriously wrote job descriptions, hiring criteria, scoring charts for CVs and interviews... and then hired the blondes with great figures.\n\nAfter complaining to HR, I was released from participation in future hiring committees.",
            "title_similarity": "0.4836485",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h57iop9",
            "score": 1,
            "text": "And when you do apply, copy and paste the description at the base of the cover letter, turn the text white and the font size to 5, then save as a pdf ;)",
            "title_similarity": "0.18508312",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h57j45u",
            "score": 1,
            "text": "Apply if you have 40% of the things they're looking for",
            "title_similarity": "0.34732276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57j4gz",
            "score": 1,
            "text": "It’s on them to determine if your qualified or not. Apply for EVERY job that interests you.",
            "title_similarity": "0.5103034",
            "sentiment_compound": 0.25
        },
        {
            "id": "h57jtop",
            "score": 1,
            "text": "I've never met the requirements for any job I've gotten and have been able to do them all.",
            "title_similarity": "0.39803427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57k5li",
            "score": 2,
            "text": "And don't think that because you're unqualified at one place that you might not be fully qualified at another.\n\nI got interviewed and was offered the position of Accounant at a logistics company. The bank I worked for at the time offered to match pay and bump my title from accounting analyst to senior accounting analyst, but would absolutely not make my title Accountant. \n\nWorkplace BS is weird, yo.",
            "title_similarity": "0.63034225",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h57kg9v",
            "score": 1,
            "text": "The shit pay is what’s intimidating",
            "title_similarity": "0.6508614",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h57l23b",
            "score": 1,
            "text": "You go to school and write the truth you get a C. \n\nYou go to school and write the truth with a fuck load of bullshit and time wasting thrown in you get an A. \n\nSociety follows this rule unfortunately",
            "title_similarity": "0.5352179",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h57m5uh",
            "score": 1,
            "text": "Also don’t expect to get an interview either.",
            "title_similarity": "0.41384715",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57masj",
            "score": 1,
            "text": "Thank you. This was what I was needing today.",
            "title_similarity": "0.30104035",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h57ml7k",
            "score": 3,
            "text": "You do not have to be the most qualified for the position.  You just have to be the most qualified that applies.\n\nAlso, you can be the least qualified but have the best interview and still get the spot.  Practice at interviews and you can get jobs you might not otherwise ever get.",
            "title_similarity": "0.7249936",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h57mzp1",
            "score": 1,
            "text": "This is true even in the trades. I’m a welder. Sometimes I’m browsing through indeed and these guys are asking for welders with tickets for every process known to man. Some that are way too technical for the type of job it is. Some processes that are just straight up no longer used anywhere other than in a hobby shop or something. \n\nThe best part is the part they offer.",
            "title_similarity": "0.64374495",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h57n2ol",
            "score": 1,
            "text": "Applying for jobs today and was highly discouraged bc of the job descriptions, so this was nice",
            "title_similarity": "0.6708765",
            "sentiment_compound": 0.0183
        },
        {
            "id": "h57ng7e",
            "score": 1,
            "text": "There's a meme out there somewhere, I think it's a cartoon, that shows two books side-by-side at a workplace. One is thick and is entitled something to the effect of \"Official Manual of Rules & Regulations\", and the other is thin and the title is more along the lines of, \"How Things Are *Actually* Done.\"",
            "title_similarity": "0.42939395",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h57nijj",
            "score": 2,
            "text": "Personally, I treat it like a dating site. When they write who they're looking for, they're looking for their *ideal* candidate, not what they'll settle for, if you will lol. \n\n\nOftentimes, a silver tongue, a knowledge of what they want, the ability to settle the important demands, and not being insufferable to be around most days is more than enough to seal the deal.",
            "title_similarity": "0.68408394",
            "sentiment_compound": 0.93
        },
        {
            "id": "h57nml5",
            "score": 1,
            "text": "Also apply even if you don’t meet the qualifications. You might be the right person at the right time.",
            "title_similarity": "0.5646627",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57nokj",
            "score": 1,
            "text": "So when they say 10+ years of experience, but I have 0, I should still apply?",
            "title_similarity": "0.3372935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57o4pi",
            "score": 2,
            "text": "In direct response to this trend, my resume is overly competent and all of my prior positions sounds more complicated and high profile than they really were.",
            "title_similarity": "0.7614176",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h57ob0l",
            "score": 1,
            "text": "For real. The job description for my current position has a lot of IT jargon. Turns out they need an AV person(which is what I do) and the IT stuff would have just been a nice quality to have. So now I hang out with a bunch of people who say things like JAMF and TLS, and I’m like “I’m just going to add a compressor and a parametric EQ.”",
            "title_similarity": "0.5858369",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h57og00",
            "score": 3,
            "text": "They do the same thing we do with our resumes.\n\nYou know, where \"*Identified and facilitated the repurposing of redundant resources\"* means I threw things in the garbage.",
            "title_similarity": "0.42150137",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57okty",
            "score": 1,
            "text": "Agree! My current job's description said it needed these 3 programmes. I applied despite never hearing of 2 of them and just said I've never used them but I can learn. I. Almost 6 months into the job and still never had to use them. No idea what they put it in for lol.",
            "title_similarity": "0.34894317",
            "sentiment_compound": 0.4482
        },
        {
            "id": "h57ooly",
            "score": 2,
            "text": "Statistically, women will apply for a role if they think they fit 100% of the requirement. Men will apply if they fit 60%. No matter your pronoun, just apply for the role it's interesting and let the company decide if it's a good fit.  Source: work in recruitment systems.",
            "title_similarity": "0.51783156",
            "sentiment_compound": 0.9006
        },
        {
            "id": "h57op9p",
            "score": 2,
            "text": "Apllied to a job for a sound technician's assistant that starts in August, even though I don't start studying audio engineering til October, but I applied anyways, mentioning this in my email. Here's hoping for the best!",
            "title_similarity": "0.35947084",
            "sentiment_compound": 0.8955
        },
        {
            "id": "h57opsk",
            "score": 2,
            "text": "No, it's usually the lack of a reply that puts me off.",
            "title_similarity": "0.4847451",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h57pbvz",
            "score": 4,
            "text": "And if you're overwhelmed by the job duties, keep in mind those will get spread out over months and years. You won't be expected to do it all the first week.",
            "title_similarity": "0.5763428",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h57qf8w",
            "score": 1,
            "text": "I do technical screenings for my team; I'm basically the guy who determines whether you have the skills to move forward with the interview. A few of the really important things to note about the way we write our job listings is that we list pretty much everything you might ever be expected to do. So if you can do any of the things in our listing, that's great news. I've yet to interview a candidate who could competently do *everything* on the list at the time of the interview, but if they can do a handful of them, and seem capable of learning the other things without complaining about them, I'll generally suggest we move forward and see what else they have to offer.\n\nTL;DR: Don't worry about being able to do everything on the job listing. If you can do some of it and the rest doesn't sound crazy or horrible to you, give it a shot.",
            "title_similarity": "0.64993805",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h57riwe",
            "score": 1,
            "text": "The description of a job I applied to gave the impression of sliding data tapes down metal chutes into thick-walled high security metal vaults.  When I got there?  No vaults, just bookshelves.  High security?  No, just regular doors to rooms that you needed your work badge to unlock.",
            "title_similarity": "0.5271051",
            "sentiment_compound": 0.594
        },
        {
            "id": "h57sang",
            "score": 1,
            "text": "I like to use it as an advantage and just repeat the impressive nonsense on my resume.",
            "title_similarity": "0.5791974",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h57saov",
            "score": 1,
            "text": "Seriously. I got headhunted by a company based on my LinkedIn for a role that paid double what I was making, in an entirely different industry. When I opened up the job description and read through it I thought “why the fuck would they try to poach me based on my LinkedIn in comparison to what they say they’re looking for here.”  \n\nDid the interview. Got the offer immediately. They taught me what I needed to know. Most of the crap in the job description is just mumbo jumbo because they can’t list what they’re really looking for which was “Must have good track record of employment. Give some indication you might be smart. Know how to work a computer. Basic social skills and likability are a plus.”  \n\nMany companies will take well-rounded, responsible, likable employees over super highly skilled jerks that think they’re hot shit.  \n\nYou can teach someone a job skill, job role, even the ins and outs of an entire industry. You can’t teach someone how to be a decent human that will bring positivity and healthy work ethic to the table. I always tell people that if they’re having trouble getting offers, make sure they’re not just focusing on improving the skill set for the job they’re looking for. Improving your charisma, conversation ability, and social skills will give you just as much edge if not more. Because whether they do it intentionally or not, interviewers are basing a lot of decision making around whether they’re gonna want you sitting next to them for 8 hours every day. I’ve seen interviewers toss applications saying “no yeah I mean he’s super qualified, but god no I don’t wanna hire that guy. He was insufferable”",
            "title_similarity": "0.70706075",
            "sentiment_compound": 0.8262
        },
        {
            "id": "h57sbjy",
            "score": 1,
            "text": "Yeah no joke, applied for a job I was pretty sure I was underqualified for (masters degree preferred, and I was no master), was even very lazy and sent in and old draft of my resume that had errors and was poorly written. Not even kidding, I applied for the job because the initials of the title is FAP\n\nGot an interview, been here 10 months",
            "title_similarity": "0.56329614",
            "sentiment_compound": -0.2208
        },
        {
            "id": "h57sc7n",
            "score": 2,
            "text": "Most job descriptions are written by hr folks that have no skills in the area they are hiring for and bear no resemblance to the actual job duties.",
            "title_similarity": "0.57317615",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h57stpt",
            "score": 1,
            "text": "Needed this today thanks",
            "title_similarity": "0.35161084",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h57tvhx",
            "score": 1,
            "text": "What about the jobs that I'm overqualified for but they email me a week later saying they're moving on with other candidates?",
            "title_similarity": "0.49795938",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57u0zq",
            "score": 1,
            "text": "Thank you for this. I needed it today.",
            "title_similarity": "0.37102568",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h57uedc",
            "score": 1,
            "text": "Every job I have ever gotten was like. Wow that was a high bar to get in. I was 1 out of 200 applicants this place must be super excellent.\n\nAfter 1 week.\n\nHoly shit a handful of labradoodles could run this place better. How are you all employed?",
            "title_similarity": "0.37782454",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h57vd0s",
            "score": 1,
            "text": "My first job was at subway. I was a \"sandwich artist\" . Im with you OP",
            "title_similarity": "0.16471352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57w0kc",
            "score": 1,
            "text": "This is not.an issue as the job experience portion of my resume is written in the same manner.",
            "title_similarity": "0.40490478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57wo8c",
            "score": 2,
            "text": "That doesn't...being listed as entry level, bottom tier, but requiring 14 years experience, plus full stack knowledge, with 8 languages, multi certified, and a masters, paying $12 an hour is what fucking deters me -.-",
            "title_similarity": "0.5804655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57xdgx",
            "score": 2,
            "text": "This is really reassuring as someone in college who browses job listings",
            "title_similarity": "0.30856097",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h57xsiq",
            "score": 1,
            "text": "\"Regular use of heavy machinery to relocate high value, fragile, and dangerous materials for storage or shipment while managing workflow and inventory control.\"\n\nHurr Durr forklift go brrrrr.",
            "title_similarity": "0.56740004",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h57xy8c",
            "score": 1,
            "text": "Does that also apply with experience or education?",
            "title_similarity": "0.27839953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57yclf",
            "score": 1,
            "text": "Or the other way around. Some jobs are made to sound easy when there’s so much more to them. Remember to interview the interviewer!",
            "title_similarity": "0.5950794",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h57zocl",
            "score": 2,
            "text": "Legit good advice. I did this and went from $20/Hr part time to $34/Hr full time.",
            "title_similarity": "0.30046642",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h580bwz",
            "score": 1,
            "text": "Unlike the last job I applied for which they contacted me letting me know I likely was unqualified, in which I explained, none of those requirements are captured on your posting.",
            "title_similarity": "0.5170748",
            "sentiment_compound": 0.0
        },
        {
            "id": "h580hch",
            "score": 1,
            "text": "I saw my own job posted recently. 80% of what’s on the list, we never do.",
            "title_similarity": "0.34036547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h580q3d",
            "score": 2,
            "text": "This is exactly why many resume companies edit your resume to seem like it is more qualified for the positions that you are applying for than you are actually qualified to fulfill. Free market wins every time, regardless of how much you try to stack the deck",
            "title_similarity": "0.68124413",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h581kqw",
            "score": 1,
            "text": "95% of perceived job performance is trust. Do you seem competent enough to do whatever tasks without doing more harm than good, at a reasonable price, and without making everyone look bad for hiring you. If you can meet these objectives, you’ll forever be hire-able and promotable. This is why “who you know” is actually a thing. People trust people they already know or someone they trust does.",
            "title_similarity": "0.580639",
            "sentiment_compound": 0.9317
        },
        {
            "id": "h582q5w",
            "score": 1,
            "text": "Men are statistically more likely to apply for a job with missing requirements than a woman.\n\nIf you're female and you tick 60% of the boxes, go for it!",
            "title_similarity": "0.54711044",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h5842vz",
            "score": 1,
            "text": "In order to get an interview match the terms they use on your resume.  Sometimes even if they say it wrong put it on your resume.  Then when you get an interview it's all whether or not they like you or not.  Be yourself is the best advice.  If they like the fake you, it isn't going to work out anyways.",
            "title_similarity": "0.7342704",
            "sentiment_compound": -0.1556
        },
        {
            "id": "h584i2o",
            "score": 1,
            "text": "100% true, I always thought the excessively wordy writeups sounded silly.",
            "title_similarity": "0.598723",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h587rzw",
            "score": 2,
            "text": "A guide to translating the bullshit speak into regular terms would be both handy and hilarious.",
            "title_similarity": "0.5313811",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5887s5",
            "score": 1,
            "text": "I’ve been doing a lot of job hunting the last year and that’s what I’m slowly coming to realize. Also a lot of the requirements are inflated.\n\nIt’s become a meme but requiring a ridiculous amount of experience for an entry level position is just mind boggling.",
            "title_similarity": "0.66846573",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h588ux1",
            "score": 1,
            "text": "*sales representative*",
            "title_similarity": "0.24016042",
            "sentiment_compound": 0.0
        },
        {
            "id": "h589ioy",
            "score": 2,
            "text": "It’s like companies are insecure and try to compensate, when in reality; yes you sound extremely stupid advertising for a position I know everything about in a way that the job is never done.",
            "title_similarity": "0.7537892",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h58a214",
            "score": 1,
            "text": "can confirm, after having written some myself",
            "title_similarity": "0.26017326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58c2f8",
            "score": 1,
            "text": "What if I have crippling imposter syndrome and don’t think I can actually do what I’m qualified to do, despite my degree as proof?",
            "title_similarity": "0.6380872",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58dsuq",
            "score": 4,
            "text": "This is so relatable. I recently applied for a job I lacked experience for. I'm talking about not having 75% of it. Applied anyway because I thought it was weird they asked for this many years of experience for this position (bartender). Got an interview and learned that they were choosy because they are an upscale country club where politicians go to ply golf. But they wanted me badly, and I mean badly! Despite me not having enough years of experience I had relevant experience working in country clubs before. Which apparently they don't see on resumes very often. I took the job, gave my conditions (set days off), and now I'm gonna make more money than I ever have. I'm so glad I didn't get deterred by their high demands. I wanted a job in a country club and it was the only one available in the area.",
            "title_similarity": "0.5374191",
            "sentiment_compound": -0.5636
        },
        {
            "id": "h58e2ew",
            "score": 1,
            "text": "Just because I'm an hvac technician doesn't mean I shouldn't apply for that head chef position at a 7 star restaurant in Dubai.. Ima go for it!",
            "title_similarity": "0.45582038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58if3z",
            "score": 1,
            "text": "JDs and actual tasks and work performance never same for every employee. Because everyone has his/her own skill sets, ways to handle the same situations, and perform the tasks.",
            "title_similarity": "0.55925083",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58krdq",
            "score": 1,
            "text": "I've had to create resumes from our existing staff for RFPs and sometimes our JD just don't cut it so I google and copy/paste some text to make the job seem more interesting than it is and to make the employee appear more knowledgeable than they are. I also google for job descriptions as an HR Specialist. Why recreate the wheel?",
            "title_similarity": "0.65862906",
            "sentiment_compound": 0.7102
        },
        {
            "id": "h58lw3x",
            "score": 2,
            "text": "Former IT recruiter. Job descriptions are (mostly) generated from generic requirements dictated by HR (years of experience, tools/technologies, degrees, etc) or made up out of thin air by the hiring manager looking for their unicorn. Always, always, always read the job description and include every relevant skill or technology listed in the job description in your resume. Doubly so if you’re applying for a big company. Recruiting platforms will let recruiters do key word searches and then just fan through resumes looking for a bunch of highlighted words and that will dictate someone having their resume read or just skipped over. NEVER think your qualifications are “obvious”. Recruiters can look through 400+ resumes a day for 30+ different jobs. Dumb it down",
            "title_similarity": "0.6386528",
            "sentiment_compound": -0.25
        },
        {
            "id": "h58m5om",
            "score": 2,
            "text": "Ive been at my job 3 years and I cant do half of whats in the job description.",
            "title_similarity": "0.27945486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58nuz6",
            "score": 2,
            "text": "They are also written to not give an actual description of the job from what I’ve seen",
            "title_similarity": "0.6313362",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58nxe1",
            "score": 2,
            "text": "Well, a lot of job descriptions are written by folks who don't know how to write job descriptions, may often be rather to highly unfamiliar with the actual job, and/or can't even write well.  So, typically take them with a grain of salt ... sometimes up to cow salt lick block sized grain.",
            "title_similarity": "0.6253672",
            "sentiment_compound": -0.3847
        },
        {
            "id": "h58ovix",
            "score": 2,
            "text": "If you like the look of a job and fit around 65% of the qualities they’re looking for, I recommend applying.  The absolute worst thing they can say is “no”—and they might say “yes”!",
            "title_similarity": "0.56485903",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h58puq8",
            "score": 1,
            "text": "Data indicates that if you meet half of the (top) criteria - apply. It works.",
            "title_similarity": "0.30704594",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h58rsrt",
            "score": 1,
            "text": "Yes we want someone who uses angular AND react, rdbms and nosqls.  Also this is n entry level position that requires 7 years of experience.",
            "title_similarity": "0.35246235",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h58sc5n",
            "score": 1,
            "text": "Content editor? Nah, I wrote product nutrition facts into excel.\n\nProduct photographer? Nah, I shoved items in a light box and used a decade old camera to take photos.\n\nPhoto editor? Nah, I threw the pics into photoshop and clicked one command.",
            "title_similarity": "0.32011282",
            "sentiment_compound": 0.327
        },
        {
            "id": "h58t5xx",
            "score": 1,
            "text": "I literally just got home from a job interview, im a semi driver. They carried on like its an executive job at BHP or Google. \n\n\"What can you bring to the company?\"\n\nA guy that drives trucks. Thats it, that's all i can bring. Hmu.",
            "title_similarity": "0.3557486",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h58tm0m",
            "score": 1,
            "text": "I don't think there is a job I could do.",
            "title_similarity": "0.31787223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58u24o",
            "score": 1,
            "text": "Recently applied for a job at a growing company. The role was new to them but I’m basically in that role at a fortune 100 company. During the interview I told the controller that the description sounded a little light and there were other responsibilities that should come with this role. She agreed so much that she passed on me because she wanted more experienced candidates, she then updated the job posting to include my suggestions and a completely unreasonable level of experience expected.",
            "title_similarity": "0.6721177",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h58ukeh",
            "score": 1,
            "text": "Ask good ol Donny T. He’ll tell ya to apply for the job you aren’t qualified for.",
            "title_similarity": "0.62956685",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h58ut8e",
            "score": 1,
            "text": "I find the complicated and fancy (mostly made up) roles more frustrating.\n\nSenior Marketing Executive - it is an ENTRY position? I am sorry, I may be of the old corporate lingo but when I see an \"executive\" in the title, I don't fucking think entry level with shitty pay.",
            "title_similarity": "0.7882838",
            "sentiment_compound": -0.8292
        },
        {
            "id": "h58wh5w",
            "score": 1,
            "text": "that doesnt mean i get a higher chance to get the job.",
            "title_similarity": "0.6046352",
            "sentiment_compound": 0.25
        },
        {
            "id": "h58y2vw",
            "score": 1,
            "text": "In my experience, job descriptions have been written by desperate employers who are looking to fill multiple positions with a single hire.",
            "title_similarity": "0.6682342",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h58y5my",
            "score": 2,
            "text": "Kinda finding this on LinkedIn; 2 degrees x years as a snr dev and some of the requirements are basically as the memes say a full IT section.\n\nThe last recruiter I spoke to listed 18 different products / stacks you might need to know for a technical interview.",
            "title_similarity": "0.35422632",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58yucc",
            "score": 2,
            "text": "I needed to hear this. Well, in this case - read this. I’ve been struggling with insecurity looking at jobs and their descriptions of the position. Not to mention the requirements",
            "title_similarity": "0.7079598",
            "sentiment_compound": -0.4981
        },
        {
            "id": "h58zd8l",
            "score": 1,
            "text": "I generally avoid applying for jobs like this, it provides an insight into a pretentious workplace and encourages people to blow out their skills.",
            "title_similarity": "0.67788917",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5916j6",
            "score": 1,
            "text": "In the requirements section, just read the first 5-7 words of each bullet point to get the general idea.\n  - collaborate with other teams to blah blah blah\n  -  organize and own the project blah blah blah\n  -  conduct audits on the project to blah blah blah\n  -  generate deliverables that clearly explain blah blah blah\n  -  Cummunicate regularly with clients to blah blah blah\n\nIts pretty much the same with all of em.",
            "title_similarity": "0.3894316",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h591ve5",
            "score": 2,
            "text": "Been trying to tell people this for years.\n\nAlso its typically includes a list of skills for an ideal candidate given to HR and then listed by those idiots as \"essential\"dont let that deter you either aim for about 60%\n\nIf you send a solid cover letter explaining why you would be a good fit for the company and they still dont get back to you dont worry about it. You either got lost in the storm which is real bad luck or they're assholes with unrealistic expectations.\n\nObviously this doesnt always apply but generally you can tell their intentions by the pay rate. Unless they dont give it. In which case fuck those people.",
            "title_similarity": "0.6913366",
            "sentiment_compound": -0.5785
        },
        {
            "id": "h592fct",
            "score": 1,
            "text": "Also if you got connections on LinkedIn that do the job that you want to do, don't be afraid to look at their profiles and inspire yourself for your one. You don't have to copy, but reading what other people have written definitely helps.",
            "title_similarity": "0.5554322",
            "sentiment_compound": 0.8573
        },
        {
            "id": "h592k06",
            "score": 1,
            "text": "Some general job-seeking advice from a friend who worked in HR that I've never forgotten: \n\nYou don't have to be the best qualified candidate. You have to be the best qualified candidate who applied.",
            "title_similarity": "0.64780873",
            "sentiment_compound": 0.9226
        },
        {
            "id": "h592zuw",
            "score": 1,
            "text": "Humans think they're the almighty smart superior species on the planet, when in fact were dumb asf. The only species not interested in self-preservation when we actually know better. Wtf.",
            "title_similarity": "0.5342404",
            "sentiment_compound": -0.0665
        },
        {
            "id": "h593f2b",
            "score": 1,
            "text": "Unfortunately applications have to be written in the same ridiculous recruitmentese, and something about the process massively inflames my anxiety and esteem issues, instantly exhausts me like I haven't slept for three days, and makes my IQ drop 40 points.",
            "title_similarity": "0.6492933",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5943vs",
            "score": 1,
            "text": "Needed to hear this!! Thanks",
            "title_similarity": "0.33001477",
            "sentiment_compound": 0.6071
        },
        {
            "id": "h594dar",
            "score": 2,
            "text": "LPT: don't lie about your skills. If you don't have 5 years of experience don't say you do. You'll waste everyone time and your own",
            "title_similarity": "0.567777",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5988z8",
            "score": 1,
            "text": "Not every job is written so nobody can do it.",
            "title_similarity": "0.5344498",
            "sentiment_compound": 0.0
        },
        {
            "id": "h598t88",
            "score": 1,
            "text": "Thank you my man/lady. I learnt this the hard way a couple of months ago. Definitely something I will share with my friends for a long time",
            "title_similarity": "0.40088522",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h599jsc",
            "score": 2,
            "text": "Yeah. My friend was terrifying about front-end job for major corporation. Description sounded like they are building space shuttle or something.\n\nSo I told her: listen, backend developer will give you a data and you will build nice looking HTML page that display this data. Or you will modify existing page. And when they will need some data you will build a form. So entire job is just building forms and displaying data. If you are nervous, just practice building forms.\n\nSo she did. And that's what exactly what job was about.\n\nI also say same thing to backend developers.\n\nMost of the time you will receive data from a form and you will put it to database. And another thing will be querying databse for data and sending it to template to display it. Today it's usually done via API but princes are the same.\n\nAnd only complication is that there is business logic you have to check before inserting data like when someone want to put product in a basket, before putting product in a basket you have to check if there is product in storage.",
            "title_similarity": "0.5573549",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h59coez",
            "score": 1,
            "text": "Especially true in programming!!",
            "title_similarity": "0.25537297",
            "sentiment_compound": 0.5686
        },
        {
            "id": "h59hyts",
            "score": 1,
            "text": "Searched for entry level project management jobs and they all say you need 6 years of project management experience. It is quite a determent to me ha",
            "title_similarity": "0.45936906",
            "sentiment_compound": 0.34
        },
        {
            "id": "h59mz0z",
            "score": 1,
            "text": "They make the job descriptions more complex so that they have a higher probability of finding someone more qualified.",
            "title_similarity": "0.7732054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59rssc",
            "score": 1,
            "text": "Except for engineering jobs. You need correct qualifications fir those jobs.",
            "title_similarity": "0.57101387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5acx12",
            "score": 1,
            "text": "In other words,  “It’s easier done than said.”",
            "title_similarity": "0.39571047",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5dv40e",
            "score": 1,
            "text": "Thanks for the word of encouragement.. just graduated and had a panic recently because of job hunt.. can't shake off the feeling of being incompetent.",
            "title_similarity": "0.61320233",
            "sentiment_compound": 0.0818
        },
        {
            "id": "h5kewvn",
            "score": 1,
            "text": "Software jobs be like : \n\n> We need someone that is able to quickly adapt to the ever changing environment of software development and that is able to do fullstack as well as platform specific languages. \n\n> The future employee should also be able to get his hands on a linux environment, using multiple docker and automatic deployment with Jenkins. \n\n> The employee should also be able to get the feedback from the client as well as his needs and clarify it to create a concise plan for future and fast agile deployments on production.\n\n6 months later : \"Aye change this label and color lmao\"",
            "title_similarity": "0.5246508",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h7ue8ei",
            "score": 1,
            "text": "To add onto this...   \n\nWhen you are looking for a job and wondering what the pay is, pay no attention to the title, pay attention to the duties. You will almost always get paid like your duties and not your title. Especially when you are in Information Technology.",
            "title_similarity": "0.7147361",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7uvec3",
            "score": 1,
            "text": "Honestly at this point as much as I've already done I don't see why I couldn't cuz now my head feels a lot better it really does",
            "title_similarity": "0.49850377",
            "sentiment_compound": 0.7096
        }
    ]
}