{
    "LPT: If you are doing something and a young child asks to help, don't say \"no\" or \"you're too little.\" Find a way to have them help, even if it's a distraction unrelated to your task, and thank them for helping. This develops positive self-esteem, mindfulness, collaboration, and gratitude.\n": [
        {
            "id": "h6f7m3b",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.70954794",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h6fymax",
            "score": 9,
            "text": "It also makes them think they're more special than they really are. Fuck this advice. Be honest with them. Don't be a millennial ego inflater. (I'm a millennial)",
            "title_similarity": "0.53619695",
            "sentiment_compound": 0.3642
        },
        {
            "id": "h6frr5b",
            "score": 2,
            "text": "Nah...you tell that little bastard to go play Xbox.",
            "title_similarity": "0.15107854",
            "sentiment_compound": -0.204
        },
        {
            "id": "h6f9836",
            "score": 10,
            "text": "So use common sense. Got it.",
            "title_similarity": "0.40698448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ftpc0",
            "score": 9,
            "text": "So I see where extending participation trophies to toddlers now. The real life pro tip is not to tell kids they’re a special little snowflake who can do whatever they want so when life kick’s their ass and deliver’s the actual truth to them it’s less of a shock.",
            "title_similarity": "0.616328",
            "sentiment_compound": -0.1372
        },
        {
            "id": "h6fqggr",
            "score": 7,
            "text": "Don't say 'no' too a small child as it creates a negative vibes, and will make them sad.",
            "title_similarity": "0.52495825",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h6fw53p",
            "score": 6,
            "text": "It also causes people to feel rewarded for doing nothing, totally mindless tasks that everyone resents because they're so fucking useless.  A great ideal, but let's just leave it at idyllic instead of pretending like this is some sort of godsend, do-better-humanity advice.",
            "title_similarity": "0.66048896",
            "sentiment_compound": 0.9234
        },
        {
            "id": "h6fkkj9",
            "score": 26,
            "text": "This is dumb. I need to tell my kids they can’t help because it’s dangerous. That is an important part of helping that they need to understand. You can’t help me weed whack because you are little and it might kick rocks in your eye. This is why we wear x y z protective gear.",
            "title_similarity": "0.54713875",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6fnvm8",
            "score": -7,
            "text": "My son and daughter will help, when asked. They're not too keen.  My daughter helps because now she gets the car and gas.  My son helps because he's male.  Regardless, they are both more capable and knowledgeable about maintaining a house and a car. They see it's not something you need to hire people to do, even though they keep telling me to hire someone. My daughter will profess she has no clue, but she knows framing and basic electrics.  My son can do it all, but is a reluctant helper now.  But he thanks me in birthday cards for teaching him stuff they don't do at school and that none of his friends can do",
            "title_similarity": "0.64431125",
            "sentiment_compound": 0.6554
        },
        {
            "id": "h6g3kp1",
            "score": 2,
            "text": "What if I’m masturbating?",
            "title_similarity": "0.2906009",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6flowl",
            "score": 33,
            "text": "Children need to be taught “no”.",
            "title_similarity": "0.5299541",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ft9ru",
            "score": -2,
            "text": "\"Yes, you can help me by... BUGGING OFF!.\" Little cumb wad",
            "title_similarity": "0.563025",
            "sentiment_compound": 0.69
        },
        {
            "id": "h6fvcxx",
            "score": 12,
            "text": "Counter LPT, tell them no because the world doesn't revolve around them. Sometimes they gotta know when to quit and back up.",
            "title_similarity": "0.4487196",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6fw9lv",
            "score": 2,
            "text": "Child: Get off my mommy!\nMe: Fine, you can help... Stupid lpt post...",
            "title_similarity": "0.45997834",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h6fur8w",
            "score": 5,
            "text": "Nah. Fuck them kids.",
            "title_similarity": "0.23687357",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6fr5ud",
            "score": 2,
            "text": "*me chopping a tree down with a chainsaw*\n\"Yeah here kid, hold this, go nuts\"",
            "title_similarity": "0.07823983",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6fwsit",
            "score": 2,
            "text": "Any tips on what to do in this situation if I don't like kids?",
            "title_similarity": "0.61526513",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h6fg6s6",
            "score": -1,
            "text": "Wish my stepdad did that",
            "title_similarity": "0.47577608",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6ftjcw",
            "score": 1,
            "text": "That explains why she gave you the fake phone number when you asked her out.",
            "title_similarity": "0.40739584",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6fzlbq",
            "score": 1,
            "text": "Yeah what am I gonna do, let a little kid help me run NASA or the FBI, I don't think so this is a stupid LPT dude",
            "title_similarity": "0.33254465",
            "sentiment_compound": 0.0571
        },
        {
            "id": "h6frpxd",
            "score": 3,
            "text": "I'm not gonna let a kid handle a damn table saw.",
            "title_similarity": "0.22004864",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6fwel0",
            "score": 12,
            "text": "No.\n\nSometimes, in life, there are situations where pressing for help is wrong because the person can't do this.\n\nExplore the same principles with kids asks let them understand that not everyone can be helped.",
            "title_similarity": "0.6904838",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h6ftf1j",
            "score": 6,
            "text": "This isn't a life protip. What if I don't care about the young child?",
            "title_similarity": "0.51182795",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h6fx9az",
            "score": -3,
            "text": "YESSSSSS!!! I love this so much. My mom always did the opposite of this. Always did everything for us, never let us feel helpful or capable of doing things on our own. I’m now 24 years old, and until recently I struggled with this so much. I was afraid of doing simple tasks on my own because I literally felt useless ( her verbal abuse about me being a “good for nothing” also did not help). Anyway, I think I’m breaking out of that cycle of helplessness. I hope one day I raise my children to be more independent and confident.",
            "title_similarity": "0.49297065",
            "sentiment_compound": 0.4734
        },
        {
            "id": "h6fsg0u",
            "score": 5,
            "text": "Okay guys here’s the “definitely not at LPT” life pro tip of the month!",
            "title_similarity": "0.2417168",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h6ftv39",
            "score": 6,
            "text": "How about this child fucks off and finds its parents",
            "title_similarity": "0.41474092",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6fqukk",
            "score": 3,
            "text": "Please someone get this kid away from the operating table! Should I get a 2 year old to help me drive too?",
            "title_similarity": "0.24622488",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h6fm6u3",
            "score": 4,
            "text": "I have my young kiddo help with the Christmas tree every year. I’m doing 100% of the lifting but he really thinks he’s helping. Dance around accomplished",
            "title_similarity": "0.38731292",
            "sentiment_compound": 0.8358
        },
        {
            "id": "h6g60o1",
            "score": 0,
            "text": "Man, I generally try to have this kind of approach with my three year old but now I’m thinking of the times where I was being too tunnel visioned on something and told him “sorry buddy I think I’m gonna do this on my own.” The kinds of things that eat away at you as a parent :(",
            "title_similarity": "0.4554499",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h6gwe06",
            "score": 0,
            "text": "This is cute and stuff but sometimes kids need to be told no. It's not going to hurt them or make them have poor self esteem. If it's something they can safely help with or uts not going to make the task take a lot longer, then yeah let them help but it's OK to also tell them no. Even if they can help and you just don't want them to because you're over it and want to get things done without having to turn on your mommy/daddy persona, that's ok too. Kids will have plenty of opportunities to learn how to help",
            "title_similarity": "0.81266475",
            "sentiment_compound": 0.9862
        },
        {
            "id": "h6h8j7m",
            "score": 0,
            "text": "Why would I want little brats bothering me? Go away.",
            "title_similarity": "0.43734217",
            "sentiment_compound": -0.2551
        },
        {
            "id": "h6hfmej",
            "score": 0,
            "text": "Where do I get a young child?",
            "title_similarity": "0.42768723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ft0kf",
            "score": 6,
            "text": "Having kids has made me a better person in so many ways. Damn, I love them.",
            "title_similarity": "0.6228779",
            "sentiment_compound": 0.6293
        },
        {
            "id": "h6fzvfl",
            "score": -1,
            "text": "except if you are an angry asshole that gets angry for everything and your bitter mind is unable to understand \"little kids\" in that case be away from children you POS",
            "title_similarity": "0.3277235",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h6gkdrt",
            "score": 1,
            "text": "It also teaches a little shit head kid to never mind his business with others, too.",
            "title_similarity": "0.5939182",
            "sentiment_compound": -0.5118
        },
        {
            "id": "h6hufd6",
            "score": 1,
            "text": "Our present generation was raised in a world of participation trophies and a focus on their little self esteem. Now they're struggling with unrealistic expectations, self discipline, resiliency, entitlement and commitment. Society needs you to focus less on mindfulness and more on teaching little Bonnie and Howard that they can't do everything and that they need to accept being told \"No\" gracefully instead of seeing it as a personal affront to their self-worth.",
            "title_similarity": "0.58931434",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h6fxeek",
            "score": 8,
            "text": "Dumbass advice kids don't need to be doing everything you're doing.",
            "title_similarity": "0.6948085",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h6flgt2",
            "score": 8,
            "text": "I say no another child develops boundaries.",
            "title_similarity": "0.33256364",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6ftto3",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.10944641"
        },
        {
            "id": "h6fw1k7",
            "score": 2,
            "text": "r/potentiallysexoffenderprotips",
            "title_similarity": "0.25883842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fubou",
            "score": 11,
            "text": "If a child comes up to me and asks for help, there are bigger issues here than the child’s social development. \n\nHow did this child get into my house? Who’s child is this?",
            "title_similarity": "0.4580608",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h6fxnz7",
            "score": 2,
            "text": "It’s the best. If the current task is for big people only, then I’ll let them know they’re a crucial part in the next step and track them down to help me if they wander off.\n\nI always prepare things as if they’re going to help, because you never know. Gotta enjoy these moments while I can, because they’ll be gone before I know it.",
            "title_similarity": "0.5269574",
            "sentiment_compound": 0.7889
        },
        {
            "id": "h6fykhx",
            "score": -4,
            "text": "Thanks for posting this.\n\nThe key to activating maturation is to take care of the attachment needs of the child.\n\n - To foster independance we must first invite dependance;\n - to promote individuation we must provide a sense of belonging and unity;\n - to help the child separate we must assume the responsibility for keeping the child close.\n - We help a child let go by providing more contact and connection than he himself is seeking.\n - When he asks for a hug, we give him a warmer one than he is giving us.\n - We liberate children not by making them work for our love but by letting them rest in it.\n - We help a child face the separation involved in going to sleep or going to school by satisfying his need for closeness. By Gordon Neufeld & Gabor Mate (Book: **Hold On to Your Kids: Why Parents Need to Matter More Than Peers**)\n\n[How to Not Screw Your Kids. Dr. Gabor Mate. London Real. YTube](https://youtu.be/gX4EFwv76Vg)",
            "title_similarity": "0.785021",
            "sentiment_compound": 0.9703
        },
        {
            "id": "h6fqqdh",
            "score": 16,
            "text": "I think it depends on the situation. It also isn't a bad thing to teach children about boundaries, not only for themselves but to respect boundaries for others.",
            "title_similarity": "0.81480294",
            "sentiment_compound": 0.7248
        },
        {
            "id": "h6fxbsw",
            "score": 5,
            "text": "Yes. My 2y/o was born inbetween us building the house. He doesn't even play, he just does tool related stuff.\n\nWhole lotta stories: Since we moved in 6months ago, whenever I go to the basement it's: 'are you going screwing' ?\n\nI once fell asleep in his room and he went down to sort my tools.\n\nWe outside? He finds his little broom and cleans something.\n\nThem being outside in kindergarden? He took the little wheelbarrow and pulled out all the grass inbetween the pavements.\n\nKid's a miracle",
            "title_similarity": "0.18235262",
            "sentiment_compound": 0.6254
        },
        {
            "id": "h6fp6er",
            "score": 37,
            "text": "Plot twist. It's ok to say no to things clearly beyond the comprehension or safety level attainable by a child.",
            "title_similarity": "0.5703237",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h6fplwo",
            "score": 6,
            "text": "\"Hey young man, thanks for hiding that body. No, I don't know where your mother is.\"",
            "title_similarity": "0.43047506",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h6ft6hh",
            "score": 6,
            "text": "Serious reply - how do I find the patience for monitoring a menial “helping” task when I have limited time to get all the things done?",
            "title_similarity": "0.5292853",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6g9gfw",
            "score": 7,
            "text": "I'm guessing this is a LPT by someone who doesn't have kids. Sure it's nice to get the kids involved with everything but sometimes they just can't as I need total concentration on what I'm doing and/or it's just too dangerous for them. It's also important for kids to learn boundaries and that they know their limitations.",
            "title_similarity": "0.70191854",
            "sentiment_compound": -0.3676
        },
        {
            "id": "h6fwh0f",
            "score": 11,
            "text": "Today my 4 year old begged me to let her help drive the car. Sorry kid. You’re too little.",
            "title_similarity": "0.341945",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6fnsgn",
            "score": 34,
            "text": "...unless you're using a blowtorch or a circular saw.",
            "title_similarity": "0.169718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fn7om",
            "score": 55,
            "text": "LPT, always let kids help you with stuff, cause one day you gonna have that nut or bolt deep inside a recess and your adult hand won't fit, but theirs will lol.",
            "title_similarity": "0.57697713",
            "sentiment_compound": 0.7265
        },
        {
            "id": "h6fp0dl",
            "score": 82,
            "text": "When we’re cutting vegetables and my 2 year old wants to help, we give her a butter knife and have her cut bananas. I’m sure she feels great just knowing she’s helping!",
            "title_similarity": "0.46774003",
            "sentiment_compound": 0.8398
        },
        {
            "id": "h6fqb26",
            "score": 102,
            "text": "Kids are awesome. You can make anything sound cool or interesting with the right attitude. \n\nI was removing a stump using an ax and loppers (primitive I know) when my friend brought her son over. I told him I needed to cut the roots because the stump is “stuck to the ground and we need to get this big boy out. Can you help me find the roots?” And he was so stoked that I asked for his help, he was running all around it pointing at random spots telling me to try here. I love it.\n\nEdit: thank you for the silver!! [Here’s a picture of the uprooted stump and it’s root pile, made possible by lil Nicky and all his help :)](https://imgur.com/gallery/tzzczy6)",
            "title_similarity": "0.4505471",
            "sentiment_compound": 0.9766
        },
        {
            "id": "h6fn42l",
            "score": 59,
            "text": "Plus, they have tiny fingers, and hands, better eyes, and best of all, they can open your childproof meds for you too. That looks like wins all around.",
            "title_similarity": "0.62722886",
            "sentiment_compound": 0.9231
        },
        {
            "id": "h6fknpe",
            "score": 59,
            "text": "I do this regularly on the farm with the bosses kids. He keeps blaming me for ruining his retirement plans to live on the rent of his land tobsomeone else instead of giving it to his kids (jokingly). The kids always enjoy it, ask plenty of questions and always get dirty but they always thank me for letting them help. Yeah the job goes a little slower but no one cares if the kid had fun!",
            "title_similarity": "0.44841132",
            "sentiment_compound": 0.8388
        },
        {
            "id": "h6fs1hh",
            "score": 177,
            "text": "My 20 month old helps cook his breakfast. Does he actually help? No. He stirs a pot of cold water with a wooden spoon. But he feels included and he eats more after.",
            "title_similarity": "0.27721602",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h6fejxm",
            "score": 477,
            "text": "“Sure hold this” then answer any questions they ask to engage the brain. Done, they have a purpose and you have a flashlight/screwdriver/pen holder!",
            "title_similarity": "0.50811905",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h6fejvl",
            "score": 1230,
            "text": "Do this for your adult friends too.",
            "title_similarity": "0.41883388",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h6fnw1r",
            "score": 761,
            "text": "It's the Law of Constant Helpfulness. The less help kids are, the more they want to help. The more able they are, the less willing.",
            "title_similarity": "0.651134",
            "sentiment_compound": 0.8218
        },
        {
            "id": "h6fmg79",
            "score": 4286,
            "text": "When my mom and I got into an elevator with a lady and her son (probably 3 or 4 years old), he was holding the tiniest little plastic bag while his mom was holding the rest of the shopping, and he had the biggest grin on his face while his mom complimented him on being \"so helpful!\" My mom joined in and said, \"look at you helping your mom! That looks heavy!\" or something along those lines, and he beamed even brighter.\n\nWhen we got out of the elevator, my mom turned to me and said, \"kids love to help out, no matter how small the things they can do really are,\" and we smiled about it, because she had 4 kids so she must know.\n\nI'd forgotten about this moment, so thank you for reminding me!",
            "title_similarity": "0.51710427",
            "sentiment_compound": 0.9784
        },
        {
            "id": "h6f879h",
            "score": 294,
            "text": "Also allow children to explore the world and try things themselves. \n\nTrying to tie their shoes? That's amazing. Allow them to try, don't be so quick to offer help or even worse, just take over. Of course, only when it's safe to let them do things on their own, given their age and understanding.",
            "title_similarity": "0.7103118",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h6fn1qa",
            "score": 2622,
            "text": "Related: don’t help a child who’s still trying to do something.  Let them work it out until they get frustrated or give up, and then jump in.",
            "title_similarity": "0.65437704",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6fnosg",
            "score": 18,
            "text": "Everyone is big enough to help with something!",
            "title_similarity": "0.2674614",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h6fp12g",
            "score": 253,
            "text": "My daughter only has the motor skills to spill stuff and loves flipping cups. She helps me feed the dog in the morning. I fill the cup with dog food and she spills it out onto the bowl. \n\nP.S. - Love the username, Typhus :)",
            "title_similarity": "0.34874946",
            "sentiment_compound": 0.9295
        },
        {
            "id": "h6fpgeu",
            "score": 7,
            "text": "I was that brother that always gave the little brother the unplugged Xbox controller",
            "title_similarity": "0.2709943",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fpou0",
            "score": 1,
            "text": "\"hold this flashlight\"",
            "title_similarity": "0.20529214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fpstj",
            "score": 47,
            "text": "I started having my godson help me to make gingerbread cookies. I have him read me the ingredients and instructions, and I mix everything since it’s a bit messy. However, I have him roll the dough with a rolling pin, cut out the gingerbread men shapes, and decorate the baked cookies. So much fun for both of us!",
            "title_similarity": "0.3553869",
            "sentiment_compound": 0.4534
        },
        {
            "id": "h6fq2pl",
            "score": 1,
            "text": "Groundbreaking advice",
            "title_similarity": "0.42713106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fqe7i",
            "score": 15,
            "text": "Best of all is that you’ll either actually benefit from what they do or at least feel as if someone else cares about you.  This is good advice.",
            "title_similarity": "0.75692415",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h6fqrng",
            "score": 1,
            "text": "Eh, I’ll leave the parenting to the parents. Fuck off little kid I’m busy 😂",
            "title_similarity": "0.4724532",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6fr066",
            "score": 82,
            "text": "I really wish my parents had known/done this. I was always criticized for my “bad” help.",
            "title_similarity": "0.4129805",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h6frnal",
            "score": 14,
            "text": "Modern kids learn this skill young, from having to give a sibling an unplugged PS2 controller while playing lmao..",
            "title_similarity": "0.45709962",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h6fs1h6",
            "score": 15,
            "text": "This is a principal to live by. One of you greatest powers is to teach. \nI've taught all my nieces and nephews to cook the basics and keep a small stepping stool for the really small ones. So they can step up to counter level",
            "title_similarity": "0.42656487",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6fshpl",
            "score": 7,
            "text": "And be okay with it not being perfect. It helps them to learn new skills and gives them confidence to keep trying!",
            "title_similarity": "0.7629022",
            "sentiment_compound": 0.6242
        },
        {
            "id": "h6fsv7v",
            "score": 3,
            "text": "This works for adults too",
            "title_similarity": "0.33169582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ftbcb",
            "score": 1,
            "text": "This also applies to girlfriends/boyfriends. I like to just be of assistance no matter what it is and it was the same with my ex she loved to help me with things even when I didn’t need help",
            "title_similarity": "0.71011114",
            "sentiment_compound": 0.894
        },
        {
            "id": "h6fti8f",
            "score": 8,
            "text": "Great technique.\n\nOne time I was trying to do a 12 lead ECG on a patient and her 4 year old wandered up, all curious and evidently about to mess up the wires. Thinking quickly I said \"great, help me put these on\" and gave him a handful of electrodes to stick on her at random. Worked like a charm!",
            "title_similarity": "0.39558253",
            "sentiment_compound": 0.945
        },
        {
            "id": "h6ftmox",
            "score": 7,
            "text": "True story OP. I had to work on my car and my 10 y/o nephew wanted to hang out and help, I just showed him what I was doing, let him do some of the basic tasks, tried to explain things, I'd drill him on later to repeat back,  it was his favorite part of the visit, \"working\" on car.",
            "title_similarity": "0.46945685",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h6ftuof",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10944641"
        },
        {
            "id": "h6ftx39",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10944641"
        },
        {
            "id": "h6fu300",
            "score": 11,
            "text": "Yup. Just bought my son ‘work gloves’ (he’s three) to wear when I wear mine.",
            "title_similarity": "0.35666093",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fubto",
            "score": 2,
            "text": "Depending on their age if you Tell them that you need help figuring out a letter or a number and they need somebody who's really good at the alphabet or counting They are going to light up because that is their specialty.",
            "title_similarity": "0.60394156",
            "sentiment_compound": 0.7346
        },
        {
            "id": "h6fufm4",
            "score": 2,
            "text": "Yup, when I was little and I wanted to help but got the No, I hated it. Now when my nephews ask to help,even if they could barely help ,I would encourage them. The smile I get ,plus the encouragement helps a lot. My nephews selfsteem grows much faster,plus I can see how their brain gets rewire just by saying yes.",
            "title_similarity": "0.6758485",
            "sentiment_compound": 0.9478
        },
        {
            "id": "h6futih",
            "score": 1,
            "text": "I've been doing this for years. The downside is they may see you as low value if you are the only adult that includes them. They treat you as low status from then out.",
            "title_similarity": "0.39474082",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6fuvhr",
            "score": 1,
            "text": "Spoken like someone who hasn’t tried to fix an overflowing toilet before.",
            "title_similarity": "0.39499372",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6fv6r0",
            "score": 1,
            "text": "This is why I follow this subreddit. Awesome post!",
            "title_similarity": "0.4580208",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h6fvklh",
            "score": 1,
            "text": "Yuuup. I held a lot of flashlights when I was a kid.",
            "title_similarity": "0.26052827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fvod0",
            "score": 1,
            "text": "My 4 year old keeps asking to help carry our newborn over to Mom when it's time to feed, and I have to tell her \"yeah, you can help me hold her hand while I hold her body.\"",
            "title_similarity": "0.37638718",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h6fvp89",
            "score": 1,
            "text": "It develops those things in yourself too.",
            "title_similarity": "0.37433314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fvqbl",
            "score": 2,
            "text": "I used to be a nanny for 3 kids who often wanted to help in the kitchen. They would get the biggest kick out of something as simple as grabbing something from the fridge, pushing the buttons on the microwave, or pouring and mixing ingredients.  \n\nIt not only makes them feel happy and important, but (depending on the task) it can also be an opportunity to teach them life skills.",
            "title_similarity": "0.527725",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h6fvrvi",
            "score": 1,
            "text": "I taught my oldest this. When his youngest sibling is bugging him, he knows to GIVE HER A JOB. Stir this. Go find the thing we need. Write a sign to hang up. Unwrap this. Put that in the fridge. \n\nThe best jobs take a while, don't require supervision, and are interesting to the kid. If they're actually helpful, that's a bonus.",
            "title_similarity": "0.62662905",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h6fvt5w",
            "score": 1,
            "text": "My niece helped me make cheese curds, helped me keep track of which ones had been double battered, taught her dry hand/wet hand, how the deep fryer works ect.  After we where all done and ready to eat she said “no thank you, I don’t like cheese curds”.  So ya sometimes (usually :p) it’s about spending time :)",
            "title_similarity": "0.43840128",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h6fvt84",
            "score": 1,
            "text": "My four year old sister loves washing dishes with me. She's got her own stool to stand on and everything! She always feels proud when she washes our grandmother's favorite coffee cup and she has to run over and show it to her.",
            "title_similarity": "0.32925344",
            "sentiment_compound": 0.8777
        },
        {
            "id": "h6fvtff",
            "score": 1,
            "text": "If I have to run by work for something, my boss likes to throw screws on the floor so my son can help by running around with the rolley magnet.",
            "title_similarity": "0.32149404",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6fvv0t",
            "score": 1,
            "text": "Great tip! I was too small to help with pruning shrubs and trees and the roses fought me, but I was shown how to *look* at a tree and see which branches needed to come off. I felt included and consulted as a soon-to-be expert.",
            "title_similarity": "0.505458",
            "sentiment_compound": 0.4664
        },
        {
            "id": "h6fvzcy",
            "score": 1,
            "text": "My son got a small tool belt when he turned 2 now at 3.5 he helps me around the house on all kinds of things. It’s a great feeling!",
            "title_similarity": "0.41564995",
            "sentiment_compound": 0.8172
        },
        {
            "id": "h6fw8vp",
            "score": 1,
            "text": "I was doing exactly as you said, but when the kids dad saw what we were doing he got hella pissed. Almost got my ass kicked. Apparently drawing boobies on the bathroom walls is frowned upon.",
            "title_similarity": "0.37575293",
            "sentiment_compound": -0.9117
        },
        {
            "id": "h6fwfml",
            "score": 19,
            "text": "I do this for every kid that comes to their foster kitten's checkup appointment. I have them pick out canned food, or put the medication label on the bag, put the syringes in the bags, or hand me things, explaining as I go everything I'm doing. Half the stuff I know they don't understand, but seeing their pride, their eyes glitter, the gears turning in there as they process the information, makes me smile every time. They are always so happy to come visit the nice ladies in the office, even if it can be sad sometimes when we can't save their kitty friends, they know they can trust us because we have shown we trust them to help. \n\nI won't ever have kids of my own, but damn do I love being an Auntie to kids. I just love inspiring them and giving them encouragement, when I had so little growing up. Makes up for everything I lacked you know, puts a little good back into the world. They are a loud and exhausting bunch, so glad when their appointments are over with, but still I look forward to seeing them again and all their questions.",
            "title_similarity": "0.512089",
            "sentiment_compound": 0.9953
        },
        {
            "id": "h6fwg7i",
            "score": 1,
            "text": "I was making drinks at a friends house and I put his kids to work scooping ice into the glasses.  It was a good partnership until their bedtime.",
            "title_similarity": "0.39604616",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h6fwhvf",
            "score": 1,
            "text": "I went to my mother's house last weekend to hang out and make a fancy dinner. I got there and my brother was there with my niece, helping to do some maintenance tasks. My niece asked to help with the cooking, so we made the whole dinner together. Was she slower than I would have been? Yes. BUT she actually was super helpful and I kept her busy measuring ingredients by weight while I messed with the more complex stuff. We had a fabulous dinner of homemade bao and I got to bond with my niece in a super meaningful way. It was a win for all of us.",
            "title_similarity": "0.32862043",
            "sentiment_compound": 0.9839
        },
        {
            "id": "h6fwlyh",
            "score": 1,
            "text": "“Yeah kid go get me that wrench over there”\n\n*throws wrench*",
            "title_similarity": "0.29405263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fwxcu",
            "score": 1,
            "text": "Just press this button here when the machine says “shock advised”!",
            "title_similarity": "0.2829114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fx79p",
            "score": 5,
            "text": "Here toddler, take this wood and cut it into 5 pieces using that auto-saw machine there. Let me turn it on for you and put you on the table so you won't have difficulty climbing up.",
            "title_similarity": "0.31206208",
            "sentiment_compound": -0.0165
        },
        {
            "id": "h6fxdb1",
            "score": 19,
            "text": "When I was like 4, my mom painted my grandma's kitchen and I asked to help\n\n\nMy mom told me I could supervise. I got really excited and sat and waited for her to tell me to do something. After about 30 minutes I asked \"what's a supervisor do?\" And my mom told me \"they sit around and watch.\"\n\nKid me was like \"Ok, sweet, my job is to sit here and watch\"\n\n\nAdult me knows that is probably the funniest and most accurate description of a supervisor",
            "title_similarity": "0.35474494",
            "sentiment_compound": 0.9432
        },
        {
            "id": "h6fxgk9",
            "score": 1,
            "text": "Actually had my four year old step kid help with building an ikea table today.  Surprisingly helpful. That kid got most of the screws all the way in and probably saved me a thumb blister.",
            "title_similarity": "0.39811832",
            "sentiment_compound": 0.804
        },
        {
            "id": "h6fxmon",
            "score": 1,
            "text": "I let my 2 year old nephew help me peel an orange today. Does that count?",
            "title_similarity": "0.35175776",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6fxrtb",
            "score": 1,
            "text": "I love doing this! Even if it's just tasking them with helping me stay on task or counting; and purposefully making mistakes to keep them engaged.",
            "title_similarity": "0.71165025",
            "sentiment_compound": 0.784
        },
        {
            "id": "h6fxzul",
            "score": 1,
            "text": "I still remember the first time my parents let me pour the milk from the just opened 2 litre bottle at breakfast time. I was 4 years old, and didn’t want to spill any. Such a small thing, but I felt like they trusted me.",
            "title_similarity": "0.45917785",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h6fy2o0",
            "score": 1,
            "text": "“Not at the moment, but I’ll get you when I do”",
            "title_similarity": "0.4396031",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fy2zg",
            "score": 8,
            "text": "Whenever I vaccinate litters of puppies for families with young kids, they invariably want to help.  Too many parents try to dismiss them, but I usually get them involved in the process by getting them to peel the stickers off the vaccination vials to apply to the certificates, rub the puppies after vaccinating to ease the itch (if they can do so gently), and other such things.  It keeps them engaged and happy.",
            "title_similarity": "0.5530906",
            "sentiment_compound": 0.9645
        },
        {
            "id": "h6fy4up",
            "score": 1,
            "text": "Also promotes them to wanting to be involved in things",
            "title_similarity": "0.50971687",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6fyh0f",
            "score": 1,
            "text": "That's why I like gardening with the kiddo. Always peas to pick, bugs to investigate, weeds to pull. Sometimes there are snakes! They love picking berries also.",
            "title_similarity": "0.41262507",
            "sentiment_compound": 0.7901
        },
        {
            "id": "h6fyumy",
            "score": 1,
            "text": "I wish my mother did this. When I did help I would always be in the way and it didn’t teach me how to do basic tasks such as cleaning a litter box or cleaning my room, so I procrastinate a lot and don’t see the importance of doing this stuff.",
            "title_similarity": "0.52604926",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h6fyv2z",
            "score": 1,
            "text": "Nah. Leave them to fend for themselves",
            "title_similarity": "0.28376615",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6fz74e",
            "score": 1,
            "text": "Wish my parents knew about this one.",
            "title_similarity": "0.474527",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6fz94d",
            "score": 1,
            "text": "Me: *moves bag with dead body inside*\n\nChild: Can I help?\n\nMe: *remembers random dipshit on Reddit telling me I should find a way to let the child help*\n\nMe: Sure, grab the other end.",
            "title_similarity": "0.45280138",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6fzc5b",
            "score": 1,
            "text": "Got it. Find a way to let children help me hide dead bodies.",
            "title_similarity": "0.42980453",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6fzcc1",
            "score": 1,
            "text": "The local grocery store I go to always gives my kids something to carry. Then the cashier chimes in with \"oh wow you've become so big now\". They love it.",
            "title_similarity": "0.410779",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h6fzdgj",
            "score": 3,
            "text": "Reminds me of this story I read on npr about kids in Mexico- let the toddlers help, even if they slow you down, and then one day you'll have actual helpful young kids.\n\n\"The moms see it as an investment, Mejia-Arauz says: Encourage the messy, incompetent toddler who really wants to do the dishes now, and over time, he'll turn into the competent 7-year-old who still wants to help.\"\n\nhttps://www.npr.org/sections/goatsandsoda/2018/06/09/616928895/how-to-get-your-kids-to-do-chores-without-resenting-it",
            "title_similarity": "0.5897925",
            "sentiment_compound": 0.802
        },
        {
            "id": "h6fzhev",
            "score": 1,
            "text": "I worked at an inflatable rental company for a few weeks, and the more veteran employees told me how kids loved to help out. Sure enough, one Saturday I went out with one of them and he managed to recruit a small army of 5 children to help stomp out the air from the inflatable. They were all having a blast running up and down it, asking what else they could do to help. Truly an incredible experience.",
            "title_similarity": "0.375471",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h6fzw5u",
            "score": 1,
            "text": "Are there any other types of children other than young?",
            "title_similarity": "0.36853775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6fzy6q",
            "score": 1,
            "text": "I fucked up on this one time recently and I will never forget the mistake I made. Fatherhood is a rollercoaster of highs and lows.",
            "title_similarity": "0.29310372",
            "sentiment_compound": -0.542
        },
        {
            "id": "h6g04hk",
            "score": 2,
            "text": "Additionally, my grandpa said to never say no to a child trying to share. He used the example of his little sister when he was a kid trying to offer him a cupcake that she had her gross hands all over and he said no. His dad taught him this lesson that day. Make them feel good for wanting to share instead of rejected! That's how you create a generous adult.\n\nThis goes for any good behaviors from children. Make them feel good about it and encourage them to do it more. Kids are so impressionable and teaching them good habits and values well young goes a long way in the future.",
            "title_similarity": "0.62094593",
            "sentiment_compound": 0.9716
        },
        {
            "id": "h6g0551",
            "score": 1,
            "text": "Unless you are sharpening a knife. Don’t let toddlers play with knives",
            "title_similarity": "0.3405646",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6g05dc",
            "score": 2,
            "text": "This really should say a young child **you know**. I work in a grocery store kitchen and if I let the 6 ish year old kid that ran into the kitchen that one time and try to use the fryer keep going I'm pretty sure that kid would have had a bad time.\n\nWatch your fucking kids. Parents showed up after we had to page for them.",
            "title_similarity": "0.3131562",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6g06fm",
            "score": 1,
            "text": "I have a serious question. I am about to be a father and I think this is a great idea.\n\nBut, how do you do this without the kid “getting in the way”? I often find it very annoying for my cousins or other small family members to wedge themselves into things task we are trying to complete either just to have attention or to actually wanna help but it delays the task.",
            "title_similarity": "0.60687333",
            "sentiment_compound": 0.2407
        },
        {
            "id": "h6g0blg",
            "score": 1,
            "text": "When my dad did shit, I hid. If he saw me while he was doing something, he would make me come over and help him. I had no clue what I was doing most of the time and managed to mess something up every time. 9/16” Snap-on combo wrench to the head isn’t fun.",
            "title_similarity": "0.38946536",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6g0f52",
            "score": 1,
            "text": "Most un-pro tip ever.",
            "title_similarity": "0.19746453",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g0k6m",
            "score": 1,
            "text": "I remember barely being able to see over the counter, standing on my tippy-toes on a footstool “helping” my mom in the kitchen. I also would “help” my dad fix things by handing him the tools. Mom even had me help fold clothes…even when that just meant pairing up socks. \n\nBy age 11, I was a wiz in the kitchen, could change a tire, check the oil (and change it), use a gun, track an animal, and chop wood. I’m the eldest of 3 girls and 1 boy, and this is true of all of us. My parents taught us all the same skills regardless of gender.",
            "title_similarity": "0.29699588",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h6g0oix",
            "score": 1,
            "text": "TIL my boyfriend is a child.",
            "title_similarity": "0.39402047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g0r6f",
            "score": 1,
            "text": "This. This. This. This.",
            "title_similarity": "0.11587016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g0ths",
            "score": 1,
            "text": "When I painted the basement. My 4 year son helped paint. He had a tiny roller, and massive drop cloths. The wall was where an armoire would go. Not the best paint job, even after I tidied it up. But it was a fun afternoon.",
            "title_similarity": "0.3989613",
            "sentiment_compound": 0.4051
        },
        {
            "id": "h6g0z37",
            "score": 1,
            "text": "i feel like this is good... when i was like 4 or 5 and i asked how i could help my dad and grandpa, they told me i could help by staying out of the way",
            "title_similarity": "0.5960398",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h6g16ou",
            "score": 1,
            "text": "I installed surveillance cameras on my house this past week and my 10 year old daughter asked to help.\n\nI said yes, absolutely.\n\nI explained what we were doing step by step, and why we were doing it the way we were. She helped run the CAT5 all around the house, through conduit, and into the house. She also helped do some drilling/screwing and \n\nI own a business that does VOIP installs so I have all the fancy termination and qualifying equipment and she was very curious about how it all worked and I showed her. She wasnt strong enough to squeeze the crimper to terminate the male ends on the cables that the cameras connected to, but the fact she wanted to try just made me smile.\n\nKids are very capable and I feel like she learned some stuff. Every day I'm finding she's more and more like me when I was little. She's very curious about technology and I plan to try and teach her all that I can.",
            "title_similarity": "0.26435995",
            "sentiment_compound": 0.9641
        },
        {
            "id": "h6g16x0",
            "score": 1,
            "text": "Yeah kids are just little people, and most people just want to be included in things and to feel like they're not a waste of space.",
            "title_similarity": "0.74447125",
            "sentiment_compound": 0.7647
        },
        {
            "id": "h6g17k8",
            "score": 1,
            "text": "This applies to adults as well. We all want to feel needed. If we ask if you need help, we genuinely want to help and waiving us off eventually makes us stop asking for help. I’ve asked how I could help, only to be told I’m not needed and although it’s not much, I just don’t feel needed so I stop asking if they need help.",
            "title_similarity": "0.68538976",
            "sentiment_compound": 0.8891
        },
        {
            "id": "h6g1mhm",
            "score": 1,
            "text": "Fax. No one did this with my brother, now he pretends to be bad at doing things so people will get frustrated and do it themselves.",
            "title_similarity": "0.43107414",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h6g1n7j",
            "score": 1,
            "text": "This is a great tip to have some parent come running up and accusing you of being a pedo.  Great job there OP.",
            "title_similarity": "0.5663503",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h6g1ott",
            "score": 1,
            "text": "When I was little and my dad was working on his truck he would ask me to go pump on the brakes a few times. It wasn’t until I got older that I realized that he was just changing the oil. I freaking crack up about this today but it felt so cool at the time that he was trusting me behind the wheel to push on the breaks.",
            "title_similarity": "0.37152869",
            "sentiment_compound": 0.7675
        },
        {
            "id": "h6g1sfk",
            "score": 1,
            "text": "LPT if a kid tells you they want something listen to Nancy Reagan and just say no.",
            "title_similarity": "0.43440178",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6g20mt",
            "score": 1,
            "text": "\"Your mom doesn't think I should let you help drag out the dead body, but I don't want you growing up with low self esteem, so grab those feet son!\"",
            "title_similarity": "0.43426472",
            "sentiment_compound": -0.7432
        },
        {
            "id": "h6g23s4",
            "score": 1,
            "text": "\n“Get out of here kid, you’re bothering me” - WC Fields",
            "title_similarity": "0.23269951",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6g253x",
            "score": 1,
            "text": "I've had my scouts all help out with the cooking and cleaning when we are on trips,  i make sure they all have something to do til the whole \"team\" is finished every time. \n\nThey wash places that really are already clean, they stir boiling pasta, meassure out spises i usually just eyeball.  But it works, they all have a sense of acomplishment and teamwork.",
            "title_similarity": "0.40717763",
            "sentiment_compound": 0.5395
        },
        {
            "id": "h6g2b2y",
            "score": 1,
            "text": "You can hold the camera while mommy and daddy wrestle, okay Timmy?",
            "title_similarity": "0.47339624",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h6g2b4g",
            "score": 1,
            "text": "In short , be a good person",
            "title_similarity": "0.6167468",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6g2oxl",
            "score": 1,
            "text": "My kiddo is like this, always wanting to help and do things *for* someone. She’s 4 going on 20. She opens doors, helps carry on groceries… she fills a good portion of her day jumping in to help. She is a perfect little human, and my wife and I don’t know where it comes from. If she’s 50/50 from each of us then we have no explanation for how she is so totally awesome.",
            "title_similarity": "0.4869957",
            "sentiment_compound": 0.9616
        },
        {
            "id": "h6g33f4",
            "score": 1,
            "text": "This + if your cooking let the kid help he will learn how to make food like I make the best pancakes in existence",
            "title_similarity": "0.42126593",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h6g340e",
            "score": 1,
            "text": "Great! It sounds really logical. I'm curious though, has this ever been studied? Do you have a source for your claim or is it from your own experience?",
            "title_similarity": "0.5077933",
            "sentiment_compound": 0.8082
        },
        {
            "id": "h6g3l8a",
            "score": 1,
            "text": "I used to ask my mother all the time if I could help her cook and she always said no and that I'd just be in the way. I'm now 35 years old and can hardly cook and don't enjoy mean planning at all. That shit sticks with you.",
            "title_similarity": "0.28624904",
            "sentiment_compound": -0.6935
        },
        {
            "id": "h6g3ovn",
            "score": 1,
            "text": "as a dumb ass little kid i would always do this and i got shot down a couple times by some assholes but more often than not i was received and it really taught me humanity on a critical level that is often missed nowadays.",
            "title_similarity": "0.47412184",
            "sentiment_compound": -0.8898
        },
        {
            "id": "h6g3vkv",
            "score": 1,
            "text": "My husband's and my roommates have twin toddlers, and they love helping my husband bake and they like helping me make scrambled eggs. Letting them help is fun for everyone.",
            "title_similarity": "0.4920597",
            "sentiment_compound": 0.9442
        },
        {
            "id": "h6g462k",
            "score": 1,
            "text": "TIL: Use child labor when available",
            "title_similarity": "0.49927446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g4994",
            "score": 1,
            "text": "Codependents in training",
            "title_similarity": "0.37135124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g4e92",
            "score": 1,
            "text": "Thanks! I'll get Lil Jimmy's help with taking down the oppressive regime that holds captive over our land. Think a child could handle an AK47, or should I just go with a 1911?",
            "title_similarity": "0.3808505",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h6g4h5u",
            "score": 1,
            "text": "I will have lil cans of titty milk ready for them to shotgun.",
            "title_similarity": "0.25478092",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6g4pkb",
            "score": 1,
            "text": "Sometimes my 4 year old wants to help me cook so instead of teaching him knives I ask him to bring me cheese or help stir koolaid.",
            "title_similarity": "0.3695448",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6g4q6d",
            "score": 1,
            "text": "That’s why you make people that Need to be gone during childbirth boil water.",
            "title_similarity": "0.30495206",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g4tx1",
            "score": 1,
            "text": "If a child asks me anything I'm going to push them down and laugh at them until they cry.",
            "title_similarity": "0.3878079",
            "sentiment_compound": 0.128
        },
        {
            "id": "h6g53k9",
            "score": 4,
            "text": "No.  You're too little.",
            "title_similarity": "0.33381256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g59xb",
            "score": 1,
            "text": "I was fixing a fence when two of the boys who lived next door came over to \"help.\" They are 3ish and 5ish. The 3 year old started telling me everyone's name (in his family) and the 5 year old started translating. I had the little one hold the box of nails and the big one hold the hammer in between using it. \n\nWhen we were finished, I told their mom, \"the boys are done fixing the fence now!\"\n\nThe two boys giggled like you can't believe.",
            "title_similarity": "0.37364545",
            "sentiment_compound": 0.7901
        },
        {
            "id": "h6g5enc",
            "score": 1,
            "text": "Parents with littles who always want to help make dinner, but aren't quite ready yet. Give them a size appropriate jar with heavy cream and a couple clean marbles or maybe  gi joes. Something small and non absorbent. Tightly close the lid and tell them you need help making butter for the meal and they need to shake it.",
            "title_similarity": "0.4505495",
            "sentiment_compound": 0.6199
        },
        {
            "id": "h6g5eoj",
            "score": 1,
            "text": "Nah, I think I'll just tell the child to fuck off, thanks.  I'm not its parent, I use birth control.  Not my problem.",
            "title_similarity": "0.5011457",
            "sentiment_compound": 0.0665
        },
        {
            "id": "h6g5fcs",
            "score": 1,
            "text": "And whatever you do, don't undo what they did and redo it right in front of them.  Took me some therapy to get over that.  Thanks, Mom, would it have killed you to not have the towels be folded exactly \"your way\"?\n\n(IDGAF how the towels are folded.  Are they in the linen closet and folded somehow?  Yes?  We good.  I'm breaking that cycle.)",
            "title_similarity": "0.46071976",
            "sentiment_compound": 0.5484
        },
        {
            "id": "h6g5fks",
            "score": 1,
            "text": "Even better if you can throw in a safety tip related to the project.",
            "title_similarity": "0.5884813",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h6g652g",
            "score": 1,
            "text": "My mum still prefers doing everything herself instead of trying to explain it.\n\nI'm 30+, I can handle some pretty complicated tasks, really.",
            "title_similarity": "0.47964925",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6g67jt",
            "score": 1,
            "text": "Long ago, most families ran a small farm, or a small shop, or something similar. There was always something meaningfully helpful for even a small child to do. “Take this over there.”  “Go find that person and tell them this.”  Now, Mom and/or Dad go off to work and there is nothing a child can do to contribute to the family. I believe that children are aware of this, and it is not good for them.",
            "title_similarity": "0.49794644",
            "sentiment_compound": 0.1012
        },
        {
            "id": "h6g79kw",
            "score": 1,
            "text": "Great LPT! I was just building a cabinet from scratch, which is very precise work, and my 6 year old kept asking for to help and I kept telling him no but thank you. I won’t make that mistake again.",
            "title_similarity": "0.54231304",
            "sentiment_compound": -0.5035
        },
        {
            "id": "h6g7d0d",
            "score": 1,
            "text": "Blue flowers with red thorns",
            "title_similarity": "0.12196949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g7fr5",
            "score": 1,
            "text": "While I agree with the sentiment, I don't think OP has had kids. You can't take this as a blanket statement.  There's a point in your kids life when they want to help with anything and everything. \n\n\"Daddy, can I help you wipe your butt?\"\n\"...No. you're not big enough and I'm not old enough.\"",
            "title_similarity": "0.58876586",
            "sentiment_compound": 0.802
        },
        {
            "id": "h6g7td5",
            "score": 1,
            "text": "True. I remember i was very young when dad was woodworking and he gave me a plank, a small hammer and some nails \"to help him\". I was very proud when he hanged one of those planks on the wall, to be used as a rudimental coat hanger in the barn. We threw it away when we renovated the barn, after more than 20 years.",
            "title_similarity": "0.21614784",
            "sentiment_compound": 0.8357
        },
        {
            "id": "h6g7uiq",
            "score": 1,
            "text": "unless they are a piece of shit, in which case it's ok to just tell them to fuck off",
            "title_similarity": "0.43633324",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h6g7v04",
            "score": 1,
            "text": "That’s nice to do occasionally but the mental energy it takes to do constantly is too much. It’s why babysitters are so beloved. They only do it for a few hours and go home. The split focus is a lot.",
            "title_similarity": "0.5172147",
            "sentiment_compound": 0.8863
        },
        {
            "id": "h6g7wto",
            "score": 1,
            "text": "Yes Johnny, can you help me hold my steering wheel, I have a text to reply to😂",
            "title_similarity": "0.38636476",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h6g8dzm",
            "score": 1,
            "text": "My ex-husband's a college professor & when our daughter was in preschool & kindergarten she loved to sit at the table with him & \"grade\" papers. He would give her a paper that he'd graded awhile ago that a student didn't pick up & a red pen & side by side they'd grade papers. She was so serious with than pen in her hand, marking her little heart out!",
            "title_similarity": "0.4391856",
            "sentiment_compound": 0.89
        },
        {
            "id": "h6g902e",
            "score": 1,
            "text": "In general: Don't push kids around or assume they can't do anything. They will never learn new and cool things that way.",
            "title_similarity": "0.47955394",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6g96tz",
            "score": 1,
            "text": "Me when I was little :”yay I don’t have to help!”",
            "title_similarity": "0.615185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6g9c3y",
            "score": 1,
            "text": "My Mom used to do this with me and my siblings and I am planning to do it with my daughter:\n\nWhen hanging wet laundry, my mom would always ask me for a peg in a specific colour. Kept me busy and made me feel useful (and practiced my colour coordination)",
            "title_similarity": "0.4675188",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6g9ikb",
            "score": 1,
            "text": "Counterpoint- their parents can find something for them to help with, I got shit that needs doing and a limited amount of hours in the day. I have deliberately chosen not to have children, please do not inflict child-rearing on me.\n\nIf I need a kid for something (those tiny hands and compact frames have their uses) I will go borrow one in exchange for a six pack like I would an angle grinder.",
            "title_similarity": "0.5592893",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6g9uig",
            "score": 1,
            "text": "I was helping a neighbor out with something when I was probably 8-10, and I distinctly remember proudly telling my parents I was his “hired help” when they asked what I was up to\n\nThey pulled me aside and told me not to use that term because then he might feel obligated to pay me…which, I had no idea what “hired help” meant, just sort of knew the context around it…I was just helping out because I was bored\n\nregardless, I was pretty embarrassed and it has obviously stuck with me…as much as I love my parents, as I get older, the more I can see the roots of my anxiety coming from things they said/did",
            "title_similarity": "0.5110692",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h6g9y57",
            "score": 1,
            "text": "Ok kid, I'll dig while you look if police is coming",
            "title_similarity": "0.41853097",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6ga0z1",
            "score": 1,
            "text": "I wish my parents would know this. Always worried that I will fuck up and thus would better do it themselves.",
            "title_similarity": "0.4666748",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6gaylu",
            "score": 1,
            "text": "This is a universal constant for kids and adults alike. Imagine the dinner with friends where you are simply served versus the one where you as a guest are standing with a borrowed kitchen apron and a chopping block dicing vegetables and drinking wine - helping out. I much prefer the latter, and it's especially great if there are new people joining, easier to break the ice and have a project together.\n(On the other end I have heard tales of older folks inviting younger relatives to large parties or dinners, and then explaining that they are expected to wait and serve only. That is on the diametric opposite of being nice and allowing someone to help...)",
            "title_similarity": "0.34840032",
            "sentiment_compound": 0.9589
        },
        {
            "id": "h6gb6xu",
            "score": 1,
            "text": "So true! My li'l one (3 yo) wants to do everything himself. When we get home from an outing, I make it a point to back away from the car door as far as possible so he knows he's opening and shutting it on his own. He loves being useful and independent.",
            "title_similarity": "0.5646223",
            "sentiment_compound": 0.8746
        },
        {
            "id": "h6gb987",
            "score": 1,
            "text": "“Sure, hold this colt .45”",
            "title_similarity": "0.13767713",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gbc1e",
            "score": 1,
            "text": "Id rather have them do everything and hope that they succeed so i domt have to do it.",
            "title_similarity": "0.5423994",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h6gbhxz",
            "score": 76,
            "text": "Kids are people pleasers until they realize you don't appreciate them. If you encourage the helpfulness and teach them the proper way to do thinks from get go, kids can really do just about anything. My 3yo is an amazing helper who unloads the dishwasher, loads his own laundry into the wash (I set it and run it) moves it to the dryer. Puts away his own laundry. Helps with fokding towels. Helps cook and clean. He particularly likes using the swiffer and handheld vacuums. He sets the table. Cleans up all his toys every day. Dresses himself. Can brush his own teeth properly. Can shower solo. \n\nKids think they are just little people. They see no difference between themselves and adults other than size. We find ways to help him be as independent as we can. He feels respected and respects us more when we say something isnt possible for him to do just yet, because he knows we arent just trying to boss him around.",
            "title_similarity": "0.50710833",
            "sentiment_compound": 0.9799
        },
        {
            "id": "h6gbt9y",
            "score": 1,
            "text": "Great comment! Also, if they ask the same thing over and over answer with humour. Some ideas are really hard to understand. In the Western world we are conditioned to get angry if people ask too many times or test our patience. Why? If you weren’t talking to that child you’d just be on your phone or talking about something else with them. Children learn “ people get annoyed if I ask too many times so I won’t ask.” \n\nIf you unlearn that conditioning and remember you love that little person then give them the gift of a calm cheerful parent who is interested even if they do ask the same question or not “get” ideas immediately.",
            "title_similarity": "0.67316",
            "sentiment_compound": 0.9477
        },
        {
            "id": "h6gc7vu",
            "score": 2,
            "text": "Go point this screw driver at the mailbox please.",
            "title_similarity": "0.14045587",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6gcogd",
            "score": 3,
            "text": "what is mindfulness?",
            "title_similarity": "0.36188915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gd48x",
            "score": 3,
            "text": "Devils advocate: so not only do I have to do what I was doing but now I gotta come up something a small child can do to make them feel useful?",
            "title_similarity": "0.70124745",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6gdn3i",
            "score": 2,
            "text": "My daughter cleans the fridge when I’m cleaning the kitchen. It’s really just on old dish sponge and some water in a spray bottle 🤷🏻‍♀️",
            "title_similarity": "0.24388245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gdt07",
            "score": 2,
            "text": "my dad always had me \"Help\" him with diy stuff by straightening old nails with a hammer.",
            "title_similarity": "0.2555579",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6gdu88",
            "score": 2,
            "text": "When my mom was cooking she would sometimes let me help.\n\nShe'd fill up the kitchen sink with water and let me make a soup in it. She gave me the waste of whatever she was preparing + some herbs and salt/pepper. I still miss her so much after 10,5 years (me 30).\n\nI forgot about this untill I read some of the replies here, thanks for reminder me!",
            "title_similarity": "0.32804126",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h6gebi3",
            "score": 2,
            "text": "go get me another beer son",
            "title_similarity": "0.25496882",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gefth",
            "score": 2,
            "text": "Same thing with old people-- they just want to feel useful. Don't think you're doing them a favor by telling them to sit down and let you do everything for them. Keep them engaged by giving them tasks and letting them help.",
            "title_similarity": "0.7348727",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h6gf1jo",
            "score": 1,
            "text": "One thing kids like is to be tricked. For instance, I was going to take my little nephew to Disneyland, but instead I drove him to an old burned-out warehouse. \"Oh, no,\" I said, \"Disneyland burned down.\" He cried and cried, but I think that, deep down, he thought it was a pretty good joke. I started to drive over to the real Disneyland, but it was getting late.",
            "title_similarity": "0.34031883",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h6gf5rv",
            "score": 12,
            "text": "Fully agree with this, but there is more that can be added. Think of it as a larger project. I was cooking mussels in a butter wine sauce with seared scallops as an appetizer for my wife as a surprise. Each kids had a task, and they both realized the importance of their specific jobs - ages 4 and 6.  \n\n* Age 4 - Get mom whatever she needs (beverage, etc.), keep guard, and above all, keep her out of the kitchen.  \n* Age 6 - Some prep work on veggies, making sure the dog doesn't get underfoot, and the very VERY important job of yelling...   \n\n> **Daughter:** THEY'RE RAW YOU STUPID DONKEY!  \n\n\n... at the appropriate time. We were all big fans of Hell's Kitchen and watched it on a regular basis.",
            "title_similarity": "0.44401488",
            "sentiment_compound": 0.8174
        },
        {
            "id": "h6gf9dq",
            "score": 1,
            "text": "They told me \"no\" one time i wanted to help when i was 4 years, that resulted in me getting a chunk of my leg being cut from me... because what they were doing was installing barbed wire in the outer fences of my house and i lifted one up without noticing a part of it was near my leg.",
            "title_similarity": "0.2559263",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6gfwod",
            "score": 2,
            "text": "this is gonna work well until their first day in school 🤣",
            "title_similarity": "0.52443826",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6gfxp3",
            "score": 2,
            "text": "This is why my mom let me sit in a bowl of water and pretend to rinse clothes while she washed them. Man... that made me feel on top of the world!",
            "title_similarity": "0.42289305",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h6gg6hp",
            "score": 1,
            "text": "I'm gonna go ask my kid to help me find miget porn",
            "title_similarity": "0.42949015",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6gg919",
            "score": 1,
            "text": "„Mindfulness“ wtf is that even?",
            "title_similarity": "0.34191346",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6ggjuy",
            "score": 1,
            "text": "Or just ignore some dumb ass random kid.",
            "title_similarity": "0.44087866",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h6ggx6p",
            "score": 1,
            "text": "I’ve learned to do this with my 2.5 year old son. He wants to help me with EVERYTHING.   The other day I was filling up a patio umbrella base with sand with some funnels.  I could have been done in 1/4 the time, but he wanted to spoon in the sand about 2 tablespoons at a time. We took turns with me pouring from the bag an him using his little spoon. He was so proud to be helpful.  Sure he missed and spilled some too, but he had a blast and the project still got done.",
            "title_similarity": "0.41857022",
            "sentiment_compound": 0.9079
        },
        {
            "id": "h6ghtlh",
            "score": 1,
            "text": "Yeah, at all age sports bars. Fuck this.",
            "title_similarity": "-0.0017236499",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6ghtuf",
            "score": 1,
            "text": "Welp my parents just told me i m the most useless being on this planet, then dumped a bucket of water into my bed at 2 am for like 15 yrs. Certainly didnt improve my self esteem ):",
            "title_similarity": "0.16437936",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h6gim6y",
            "score": 2,
            "text": "Absolutely love this!",
            "title_similarity": "0.40450707",
            "sentiment_compound": 0.6989
        },
        {
            "id": "h6givf3",
            "score": 1,
            "text": "When I was a kid I used to get triggered by men in tool belts standing around step ladders with their hands on their hips and large expanses of undressed timber because any time my dad was doing that kind of shit he'd two me to fuck off.\n\nAs a consequence he has all these practical skills I never learned because whenever he was messing around with power tools I'd avoid it like the plague.\n\nLately I've been pulling out weeds and doing yardwork and asking my six year old son to help without telling him what I re require so he collects up some of his toys as equipment and cones up with stupid plans for how he can involve himself.\n\nInstead of saying it's pointless or he's getting in the way I thank him and tell him he's doing a good job.",
            "title_similarity": "0.34787622",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h6gizmq",
            "score": 2,
            "text": ":( timely reminder I didn’t follow this advice today, expediency and efficiency are not sound traits for a parent as children usually don’t get included in things. But good reminder for next time.",
            "title_similarity": "0.6436327",
            "sentiment_compound": 0.5647
        },
        {
            "id": "h6gjbyz",
            "score": 2,
            "text": "A friend brought their child sailing with us this weekend, so I had them holding various lines and moving from side to side as we tacked “to balance the weight”, watching the telltales to let us know if the sails needed trim, etc., they loved it. Great educational opportunity too.",
            "title_similarity": "0.5066033",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h6gjbzz",
            "score": 2,
            "text": "The classic unplugged controller.",
            "title_similarity": "0.23522335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gjlur",
            "score": 2,
            "text": "When I'm doing something my Niece or Nephew really can't help with, like wood-working or tinkering/cleaning my firearms, I'll explain what I'm doing, why, and how it works. I don't want a ten year old handing me a circular saw, but that doesn't mean they can't learn at least a little bit about a useful skill before it's time to actually do it.",
            "title_similarity": "0.5078306",
            "sentiment_compound": 0.3433
        },
        {
            "id": "h6gjs38",
            "score": 13,
            "text": "The other day my 10-yr old asked for my husband, so he could tighten a loose screw on her dresser handle.\n\nInstead I told her to look at the screw type, explained flat had vs Phillips head screw drivers.  Marched her out to the garage and selected the appropriate tool.  Told her about Righty-tighty, lefty-loosy and called it a job well done.\n\nI'm hoping those 10 minutes taught her to have a little more confidence in her abilities.",
            "title_similarity": "0.3407538",
            "sentiment_compound": 0.6922
        },
        {
            "id": "h6gk1y3",
            "score": 2,
            "text": "Or even if you don't want them all up in your business, tell them to hang around and explain what you're doing as you do it.  They'll learn some shit and as they get old enough to actually be of help they'd have had a good primer on what goes into the task.",
            "title_similarity": "0.62814724",
            "sentiment_compound": 0.1969
        },
        {
            "id": "h6gkgpn",
            "score": 2,
            "text": "What if I want to make children unhappy and watch the world decay into scorn and hatred",
            "title_similarity": "0.2337864",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h6gkkez",
            "score": 4,
            "text": "I did that as a kid once and my dad saw it as a way to make me do the work all the time. Even to this day when I ask for help I assume it will be my responsibility for the foreseeable future. \n\nIf my kid or anyone else offers help then I will let them help me but I will not aks them for help unless I am struggling to do it on my own.",
            "title_similarity": "0.5950155",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h6gkljq",
            "score": 3,
            "text": "My 6 year old has had to isolate for the last two weeks due to someone in his class getting covid. I have been slowly working on prepping our back yard to be turfed and relaying the felt roof on our shed. \n\nObviously there's been a lot of Minecraft, Roblox and YouTube, but I also got him to search the ground for rocks and sticks; keep an eye on my ladder; and today, he'll be picking up the old roof tacks I pull out and putting them in the wheelbarrow. All really trivial tasks, but he feels like he's helping and I get him away from screens for a bit.",
            "title_similarity": "0.30057988",
            "sentiment_compound": 0.62
        },
        {
            "id": "h6gkmdh",
            "score": 2,
            "text": "Nah I'm telling that little fucker to go piss off, especially as I don't have any kids so where to have they even come from??",
            "title_similarity": "0.31438905",
            "sentiment_compound": -0.816
        },
        {
            "id": "h6glb7b",
            "score": 3,
            "text": "It helps sometimes not to talk down to children. If they look like they don't understand, encourage them to ask questions. Ideally, you can lead then to asking informed questions, because that is a wholly undervalued life skill that needs to be cultivated from a young age. And the best part is that in the process, you can learn something too. Nothing taxes your ability to quickly take in and process information into a functional understanding of the topic than the feeling you get when you can help a child understand something in a meaningful way. It definitely sheds some light on why people are willing to put up with all the bullshit the job entails to be an educator. It's so fulfilling to watch their understanding grow.",
            "title_similarity": "0.82629216",
            "sentiment_compound": 0.8965
        },
        {
            "id": "h6glo25",
            "score": 2,
            "text": "My dad: \"okay but if I do that the child is just going to want to spend more time around me. I think I'll pass on all that thanks.\"\n\nUpdate, I have terrible self esteem, mindfulness, collaboration, and gratitude.",
            "title_similarity": "0.6796874",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h6gmb40",
            "score": 1,
            "text": "This is how I learned to work on cars. I would see my Dad outside doing mechanic work to our vehicles when I was younger. He would say \"come here\" then show me what is what and why/how he was fixing it. \n\nSame with how I learned to drive a manual. Dad would have me shift with my left hand (I was on the passenger seat as a child) and him holding my hand to row me through the various gears. Also listening to the engine for when to shift as well. I love driving manuals to this day!",
            "title_similarity": "0.33497357",
            "sentiment_compound": 0.9184
        },
        {
            "id": "h6gmtsw",
            "score": 1,
            "text": "Oh ye of little faith",
            "title_similarity": "0.3077833",
            "sentiment_compound": 0.3626
        },
        {
            "id": "h6gn6cc",
            "score": 1,
            "text": "Extra tip, here’s a list of scenarios and tasks for really little kids (1-3)\n- if you’re doing the dishes (and they are mostly plastic, and you put away all the knives and dangerous objects beforehand) they can hand them to you for you to put away\n- if you’re cleaning up random misplaced junk, assign a “stuff box” and have the kid put everything that you hand them in that box. This will help you too.\n- if you’re sweeping up, tell them to help you pick up the random too-big to sweep junk off the floor.\n- if you’re cleaning up pillows that have fallen off the couch, have the kid fetch them for you.\n- if you’re cleaning the outside of the fridge/oven/dishwasher, give them a clean cloth and have them wipe it off with you. If they accidentally do it properly, your fridge may end up polished in that little area.\n\n\nOut of all chores, really young kids are most helpful with “put this item in this box” tasks. For any clutter that you’re cleaning up, just tell the kid to put it in the one box that you have assigned that task, only one because more than one will create confusion.\nKids can be legitimately helpful if you’re just a little creative.",
            "title_similarity": "0.49095047",
            "sentiment_compound": 0.9313
        },
        {
            "id": "h6go4hs",
            "score": 1,
            "text": "I don’t have children so I’m not sure who would be asking. That said, I’m probably still saying no, following up with “where are your parents”.",
            "title_similarity": "0.38519737",
            "sentiment_compound": -0.3017
        },
        {
            "id": "h6gozvm",
            "score": 1,
            "text": "I let my kids start helping me cook at 3 years old.  We just start with one stick of celery and a paring knife.  \n\nI have 8 kids and we’ve only had maybe two small cuts requiring band-aids.\n\nThey start stirring things even younger than that.  They just want to be near you and to feel a part of the activity.",
            "title_similarity": "0.36677623",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6gpg56",
            "score": 1,
            "text": "Love this. My 4yo helps me make dinner pretty much every night, even if its just moving some veggies to a plate, salt and peppering things, stirring things or fetching ingredients. He takes such pride in serving food he helped make and usually eats all of his portion!",
            "title_similarity": "0.29670572",
            "sentiment_compound": 0.9134
        },
        {
            "id": "h6gq2om",
            "score": 1,
            "text": "Mindfulness? Gonna need a citation on that.",
            "title_similarity": "0.39807075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gq34t",
            "score": 1,
            "text": "I'll just stare down the parents",
            "title_similarity": "0.24403751",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gqeyz",
            "score": 1,
            "text": "Not my spawn, not my responsibility.",
            "title_similarity": "0.3611604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gqlrk",
            "score": 1,
            "text": "What if you are plowing their mum at the time?",
            "title_similarity": "0.24755116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gqnpa",
            "score": 1,
            "text": "Yeah. You can have them be lookout or maybe have them holding the stash.",
            "title_similarity": "0.45934707",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6gqter",
            "score": 1,
            "text": "I was 7 or 8 at a wrestling tournament and saw Coach Gibbs of Washington Redskins. I was a huge Redskins fan bc within 50 mile radius of DC, everyone was….walked up to him and asked for an autograph, and he just cussed and flipped out like I was mugging him. “Don’t tell anyone else I’m here!”\nMany decades later I remember this day.",
            "title_similarity": "0.0639497",
            "sentiment_compound": 0.75
        },
        {
            "id": "h6grbzs",
            "score": 1,
            "text": "Counterpoint; I'm not responsible for raising your kids or teaching them any of that stuff.",
            "title_similarity": "0.3563657",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h6grk0l",
            "score": 1,
            "text": "I am an aunt and my little kid says \"I wanna help\" all the time. More mess than help honestly. But I do enjoy giving them compliments. \"good jobl\" \"Thanks a lot\". I feel bad for being frustrated with them when they make a mess. But they're so enthusiastic it's hard not to feel the warm fuzzies.",
            "title_similarity": "0.6649507",
            "sentiment_compound": 0.9434
        },
        {
            "id": "h6gs8yz",
            "score": 1,
            "text": "Welcome to LifeProTips, where teenagers tell adults how to raise kids.\n\nFinally blocking this garbage sub.",
            "title_similarity": "0.4011497",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6gsntt",
            "score": 2,
            "text": "Plus, it keeps them busy /out of trouble and teaches them to want to help more as they get old enough to do so properly!\nI have a 1.5 year old who regularly hands me laundry to fold from the dryer, feeds the dog, carries groceries, hands me things to put away, etc..\nThis makes every task take SO MUCH LONGER, and often I catch myself wishing that he would just go play so I get stuff done - but ultimately I know that he is giving me precious memories, and him invaluable training for being a productive person as he grows.",
            "title_similarity": "0.57256067",
            "sentiment_compound": 0.8943
        },
        {
            "id": "h6gso8j",
            "score": 1,
            "text": "I know children who were raised like this and they're spoiled rotten but maybe other factors came into play.",
            "title_similarity": "0.56477374",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6gsxp6",
            "score": 2,
            "text": "Thank you for this",
            "title_similarity": "0.5422096",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6gszyy",
            "score": 2,
            "text": "Maybe this is why I have low self esteem and lack gratitude 🤔",
            "title_similarity": "0.41435343",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6gt1mc",
            "score": 2,
            "text": "This!  My 5 yr old is the best “helper” and is actually becoming quite proficient for his young age but his favourite is tidying his room, he gets super proud of himself when he does that",
            "title_similarity": "0.50118935",
            "sentiment_compound": 0.9245
        },
        {
            "id": "h6gtej2",
            "score": 2,
            "text": "I remember when my little brother was like 12 years old and asked our dad if he could teach him how to weld. (Our father was a welder when he was in his 20s). Dad dismissed the question with \"you can't just go out and \"do some welding\" it's a trade that takes years.\" then went back to watching cable on the couch. I was around 15 and still remember the disappointment I had for our dad. Meanwhile my neighbour, who was kind of a grumpy old geezer in every other way would always have us kids hold stuff if we came over when he was working. He'd be washing his bike and we'd be standing there with a wrench being really important helpers! My brother went on to do his apprenticeship in Afghanistan with the armed forces and is now a mechanic for a Mercedes dealership. No thanks to our old man..",
            "title_similarity": "0.29391974",
            "sentiment_compound": 0.0756
        },
        {
            "id": "h6gufvv",
            "score": 1,
            "text": "Well i saw someone on the news who gave the wrong task to a child. So there were floodings and they were filling up bags with sand but they let a child use the shovel to put the sand in the bag but ofcourse the child wasn't strong enough so it was taking a lot of time to fill up a bag. I thougt by my self that that was just not the right task for child because there was a lot of water damage and people died.",
            "title_similarity": "0.3520897",
            "sentiment_compound": -0.9355
        },
        {
            "id": "h6guqki",
            "score": 2,
            "text": "Man, I'm 23 and my family still think I'm the kid that can't help with anything, or that they only let help to indulge me. I think I'll have youngest child syndrome for my entire life.",
            "title_similarity": "0.4276955",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h6guv09",
            "score": 1,
            "text": "Depending on the task, it's also a great way to help them figure out what they do and do not enjoy doing. Which can help them figure out what they want to do do with their life long term when the time comes. And even for mundane tasks it can help them learn important or useful skills and he ahead in life.\n\nIn general, I think treating kids as equals is very helpful, while still recognizing and taking into account things like their education level. And obviously keep your interactions PG even if you wouldn't with your adult buddies.",
            "title_similarity": "0.7616689",
            "sentiment_compound": 0.9593
        },
        {
            "id": "h6guyig",
            "score": 1,
            "text": "“Yeah you can help” “Here hold the flashlight so I can Ugga dugga this bolt”",
            "title_similarity": "0.3687126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gv1c2",
            "score": 2,
            "text": "i had a kid, 8 yo neighbor who plays with my grandchildren, hanging out with me the other day while i was resting from hard yard work in the hot sun.  he kept asking lots of questions, and i tried not to be short with him, but kept answering briefly rather than the explanations i usually give.  i stopped and told him, \"you sure ask a lot of questions.  some people will tell you to stop and to shut up.  don't listen to them.  you are smart as hell and that's the way you learn things.\"  his face lit up when i said that.  even though i was on the verge of saying the same thing, i held my tongue and made his day.  it isn't hard to be nice, you just have to want to.",
            "title_similarity": "0.5397657",
            "sentiment_compound": -0.0402
        },
        {
            "id": "h6gvobi",
            "score": 2,
            "text": "So much this \nMy two daughters I let help with anything from age three \nPower drills , power screw drivers, mi I paint rollers - they were adept very fast \n“Daddy I do it” is still a joke around our house \nAnd on any girls trip they are the ones that know how to rebuild the toilet tank kit, shut off a water line if the water heater leaks\n\n It most of all  - learn to deal with anything from getting a lease signed to all the details of being an adult",
            "title_similarity": "0.34937593",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6gvzea",
            "score": 1,
            "text": "How does this develop mindfulness?",
            "title_similarity": "0.43593606",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gw1th",
            "score": 1,
            "text": "I usually just tell them \"I'd love to but I am legally obligated at this time to inform you that I am........\"",
            "title_similarity": "0.41638863",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6gwgqg",
            "score": 1,
            "text": "**Mindfulness**?! Did you just throw a few buzz words together? How *on Earth* could that pertain to *mindfulness*?",
            "title_similarity": "0.4565847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gx22u",
            "score": 2,
            "text": "ALSO, teach children no adult actually NEEDS help. That is one way predators lure children.",
            "title_similarity": "0.5852629",
            "sentiment_compound": 0.128
        },
        {
            "id": "h6gx5pb",
            "score": 2,
            "text": "Works with grown up too!!",
            "title_similarity": "0.4016719",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gxa7x",
            "score": 2,
            "text": "If you're trying to get something done, it's better to have the kid occupied where you can see them.  \n\nHelp me? Sure.  It's better than stopping every eight seconds to see what they're getting into.",
            "title_similarity": "0.7079891",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h6gxpmp",
            "score": 2,
            "text": "Made waffles with my son this morning after reading this. ❤️",
            "title_similarity": "0.34744745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6gxqu9",
            "score": 1,
            "text": "Be careful what you wish for. I’ve met these “high self esteem” kids as adults… they’re the worst. ;)",
            "title_similarity": "0.49740067",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6gylju",
            "score": 1,
            "text": "Paint brush and a bucket of water. “Can you paint the wall/fence/path for me?” My daughter and I have spent many a happy Saturday in the garden doing chores.",
            "title_similarity": "0.34405607",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h6gyyt1",
            "score": 1,
            "text": "Remember when this sub used to have actual tips and tricks to make life easier - Like how to separate an egg yolk from the white with a plastic bottle, or how to improvise a phone cradle with an old credit card, or how to pack efficiently? Now it's just how to fake being a normal human.",
            "title_similarity": "0.5554919",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h6gzeu3",
            "score": 2,
            "text": "Also important because it establishes a habit of helping out and doing chores, which is important when they get older and are able to do more things.",
            "title_similarity": "0.5420151",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6gzhis",
            "score": 2,
            "text": "Reminds me when my cousin was like 10 and came to visit me at work with our aunt. He came to me and asked \"can I help?\" and I was like \"uh sure! Help me measure the cords ok?\" and I just laid them flat and ask him to tell me how long they are.\n\nReally heart warming memory in my heart.",
            "title_similarity": "0.41982126",
            "sentiment_compound": 0.9717
        },
        {
            "id": "h6gzs44",
            "score": 2,
            "text": "This is so true! I lead a Mom and Me class with babies and toddlers. They (if they’re old enough to) help me do everything in the class. They get so excited to help me pick up toys and materials after each activity and their faces light up when I comment on how helpful they are",
            "title_similarity": "0.5604949",
            "sentiment_compound": 0.9381
        },
        {
            "id": "h6h01s1",
            "score": 1,
            "text": "That’s a nice thought until it becomes an 18 hour a day habit of the child and their siblings and friends who all want to join the adult that acquiesces club",
            "title_similarity": "0.36689678",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h6h0ce3",
            "score": 2,
            "text": "Now I know why I don’t have any of that as an adult. Thanks family for never letting me help with anything! I vividly remember my grandma chasing me out of the kitchen and me sneaking back in to steal some of the pie crust. Or my grandpa pushing me out of his garden so he could pick the tomatoes…",
            "title_similarity": "0.2758023",
            "sentiment_compound": -0.431
        },
        {
            "id": "h6h0f2j",
            "score": 1,
            "text": "Great point OP.\n\nThe other day I remarked to my 4 year old that there was a muddy mess on the outside door and she confirmed she had made the mess. I asked her what that means and she practically screamed and jumped up and down, shouting \"I get to clean it up!\"\n\nSo yeah, let kids help.",
            "title_similarity": "0.37504536",
            "sentiment_compound": 0.7475
        },
        {
            "id": "h6h0s9i",
            "score": 1,
            "text": "I do this with my aging parents. I recently moved and my parents really wanted to help. They’re both in their late 60s and I was worried about them hurting themselves while moving around boxes and stuff. Instead, I set up my mom to make my bed all mom-like with the sheets tucked in tight and I sent my dad to get groceries. They both felt really good about helping and it got them out of the way so I can deal with the movers.",
            "title_similarity": "0.37899336",
            "sentiment_compound": 0.5748
        },
        {
            "id": "h6h1giw",
            "score": 1,
            "text": "This is just common sense good parenting. Not really a pro tip.  Unless you're a shitty parent and need to be told this kind of stuff...",
            "title_similarity": "0.6650846",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6h251j",
            "score": 2,
            "text": "I merchandise a furniture store. Sometimes I ask rambunctious kids if they’d like to help me clean up and I let them fluff the pillows. It’s harmless if they make a mess with those. And pillow fluffing can be pretty fun, you get to beat them up. \n\nFor context, furniture shopping isn’t like Walmart, it can take awhile depending on the customer’s disposition and how much help they want. It’s very boring for children so sometimes they start acting out. Usually the parents are grateful because they’re just trying to get paperwork done.",
            "title_similarity": "0.60547256",
            "sentiment_compound": 0.9572
        },
        {
            "id": "h6h2s6z",
            "score": 2,
            "text": "Wow!! This just rushed back a bunch of memories of me helping my dad and uncle in the garage. I just realized how useless I was but how patient and cool they were about it. It made my day and definitely gave me confidence. It really is nice to see things full circle. Thanks friend!",
            "title_similarity": "0.62478864",
            "sentiment_compound": 0.9802
        },
        {
            "id": "h6h2wsf",
            "score": 1,
            "text": "My 1 year old likes to clean things with a cloth like I do, they spent quite some time “cleaning” our cat the other day. He loved the extra “pats” haha.",
            "title_similarity": "0.46131715",
            "sentiment_compound": 0.9313
        },
        {
            "id": "h6h33ca",
            "score": 2,
            "text": "Whenever my dad did this, I knew that I was being played",
            "title_similarity": "0.38944298",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6h3a21",
            "score": 1,
            "text": "Don't fully agree\nWhat if he notices that he isn't really helping?\nIts probably even worse when he feels his desire to help is getting tricked by you 🤔",
            "title_similarity": "0.504254",
            "sentiment_compound": -0.4082
        },
        {
            "id": "h6h3duq",
            "score": 1,
            "text": "Nah, fuck yo kids.",
            "title_similarity": "0.29663655",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6h3v0q",
            "score": 2,
            "text": "Just last weekend my cousin and I were building a sandcastle together and our 3 year old cousin wanted to help. So we gave her tools and set her up next to us and she made and broke her own sandcastle while we build ours. We all had loads of fun and the little one was super happy to have helped",
            "title_similarity": "0.34405136",
            "sentiment_compound": 0.8894
        },
        {
            "id": "h6h47zs",
            "score": 2,
            "text": "Flashbacks to when I’d ask my dad and older sister if I could help them and they said no and I’d be like “oh” and go cry silent tears about being left out and never the “favorite” and internalizing feeling that I’m inferior and deserve rejection :)))) \n\nOh, I mean… word.",
            "title_similarity": "0.3678195",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h6h4rie",
            "score": 1,
            "text": "Nope. People need to teach their kids to stop talking to strangers.  I don’t have time for that crap.",
            "title_similarity": "0.50110185",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6h4s31",
            "score": 1,
            "text": "Wow this really blew up thanks for the  awards! To add a few things based on comments.\n\nObviously age appropriate matters, like you don't give a 3 year old a chain saw (unless you're making a crazy horror movie).\n\nAlso I didn't mean saying a blanket \"no\" to a kid and that's it, if I could rewrite I'd say \"try not to deny their request to help\" instead of typing no. \nOften we qualify with them because they're young, so we might say things like \"don't worry, I got it, you keep playing\" or \"this is a really big job for mommy's and daddy's\" etc.\n\nI would agree this is common sense, but it's often not put into practice as such. I am guilty myself of the \"daddy just wants to get this done as quickly possible\" response / mindset. Nothing is 100%, but I find myself wishing I found a way to integrate them.\n\nThe \"mindfulness, collaboration, gratitude\" I know is cheesy, but in discussion about this those were the things that came up. \n\nMindful that others need help and the child CAN help. If their requests to help are repeatedly denied, they'll stop requesting.  \n\nBeing grateful to others for helping is an underrepresented attribute these days. Self esteem kind of speaks for itself but accomplishment + recognition = feeling good, (reference the great comment of the boy in the elevator carrying the small bag). \n\nI know nothing about psychology but that all lines up to me.",
            "title_similarity": "0.5309256",
            "sentiment_compound": 0.9879
        },
        {
            "id": "h6h6b92",
            "score": 2,
            "text": "Being a parent is hard",
            "title_similarity": "0.36546355",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h6h6h4v",
            "score": 2,
            "text": "My kids only become insistent on helping when I'm doing something dangerous. Never fails.\nDad's taking out the trash? Ah hes got it. Dad's working under a suspended load? This needs a 7yr old assistance. Lol",
            "title_similarity": "0.48635554",
            "sentiment_compound": 0.126
        },
        {
            "id": "h6h6klk",
            "score": 1,
            "text": "I do residential IT work and a few weeks ago this little boy (I dunno how old but about waist height) kept asking me questions about *everything* I was doing. So I asked him if he wanted to help and of course he said yes, so I was having him grab tools for me out of my tool bag. \n\nWell anyways his mom comes down and sees him handing me my [DeWalt Screwdriver](https://www.dewalt.com/products/power-tools/screwdrivers-and-screwguns/8v-max-gyroscopic-inline-screwdriver/dcf682n1) (with a Philips bit mind you) and she went absolute ballistic on me. Yelling about how I was putting her kid in danger and I was being irresponsible and how she didn't want me doing work in her house anymore",
            "title_similarity": "0.32095534",
            "sentiment_compound": -0.0085
        },
        {
            "id": "h6h7ka4",
            "score": 1,
            "text": "Is this why I have low self esteem cous all my child hood memories are of being told no to helping for some reason. My parents are really nice though.",
            "title_similarity": "0.61204624",
            "sentiment_compound": -0.2721
        },
        {
            "id": "h6h7rpd",
            "score": 1,
            "text": "This is so true. Being willing to include a child in a task says you care about them. Skill & language development are so much fun to watch in a child anyway… It is very good for a child to be a part of a functioning household, and not just a receiver of one. However, some basic knowledge of child development in both the mental & physical aspects is needed to assure the child is not rushed or injured by helping or doing chores. Plastic knives before real ones should be common sense, but…",
            "title_similarity": "0.7922561",
            "sentiment_compound": 0.9609
        },
        {
            "id": "h6h88d2",
            "score": 1,
            "text": "My in-laws omg. They have me get a load of gravel. This is not easy stuff to move. It's a 90 degree day. I'm like this can wait but they want to do it and it's like I am done employee.\n\nSo then im in the truck and shoveling and keep having to stop because my 5 year old niece is in the way. She has a at shovel and is helping....\n\nI come from a family if construction workers. This is a family of office workers. I tell the kid what I have heard my entire life.\n\n\"Get out of my way or you might get hurt\".\n\nI am given a lecture. She is just a kid and to let her help.\n\nScrew that. She isn't helping, she is in the way. Nope, overridden.\n\nI almost left, then they take the kid inside. I didn't want that, she could help, as long as she didn't stand between my shovel and the wheelbarrow. She needed to understand how to help.",
            "title_similarity": "0.24243455",
            "sentiment_compound": 0.7416
        },
        {
            "id": "h6h8yrt",
            "score": 2,
            "text": "Slightly related story: I work as a nanny for a family with, at the time, two young kids and two cats. I stayed after my shift one day to help out putting together a piece of IKEA furniture. Of course, both kids wanted to help (2.5 and 5 at the time) and both cats wanted my lap. Ended up with a bolts-and-screws sorting assistant, a rubber malleter to double check that I'd really fastened the screws in all the way, a feline lap impediment, and a feline box inspector in a snit that he couldn't also be a lap impediment. Fun times.",
            "title_similarity": "0.3193793",
            "sentiment_compound": 0.7533
        },
        {
            "id": "h6h9p0w",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10944641"
        },
        {
            "id": "h6h9z35",
            "score": 1,
            "text": "I have to disagree. \n\nIf you always say yes, kids don't develop boundaries. If they offer their help, it's fine to turn down that help if help at that moment won't work. You can always come back later and find a task to do together. \n\nThat's not to say a parent should always reject help, being too controlling has consequences.",
            "title_similarity": "0.67196274",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h6ha2mp",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10944641"
        },
        {
            "id": "h6ha6ny",
            "score": 2,
            "text": "Maybe having 1 child, you'll be able to find the time to come up with things for them to help with. Having more than 1 child myself, I can say chores or dinner would come to a stand still if I had to come up with projects for them to feel mindful or grateful. Instead I try to find activities that we can do together, ask politely if they would help, then tell them sincerely how they helped. Good luck to all parents on making their kid(s) responsible, altruistic adults.",
            "title_similarity": "0.7265687",
            "sentiment_compound": 0.9565
        },
        {
            "id": "h6hbo2i",
            "score": 2,
            "text": "Never turn down an opportunity to have a little one help out, Cause there will come a time that they stop asking.",
            "title_similarity": "0.560053",
            "sentiment_compound": 0.4627
        },
        {
            "id": "h6hdd1c",
            "score": 1,
            "text": "****kid walks in on parents shaggin****: can I help?\n\nParents: ****sigh**** ok, hold the camera...\n\n>! too edgy?",
            "title_similarity": "0.47833693",
            "sentiment_compound": 0.5349
        },
        {
            "id": "h6heyk4",
            "score": 2,
            "text": "This makes me question the nature of all work. Are we all just holding the flashlight while an omnipotent entity fixes the car?",
            "title_similarity": "0.2832402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6hfdus",
            "score": 2,
            "text": "They’ll also learn, the easy way or the hard way, how to hold the flashlight",
            "title_similarity": "0.5081606",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6hfp4c",
            "score": 2,
            "text": "This whole comment section would thrive in /r/kidsarefuckingstupid",
            "title_similarity": "0.55681425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6hgfqd",
            "score": 2,
            "text": "Thank you for this tip… as a parent i often fail at this because i generally prefer to work alone.",
            "title_similarity": "0.55734265",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6hgnw4",
            "score": 2,
            "text": "I have had more than a few partners and while there is some common ground there are a lot of subtle differences. Asking someone “how do you like “x” ? Is totally normal. Open communication is key.",
            "title_similarity": "0.50142",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6hhx9i",
            "score": 2,
            "text": "Unless it is dangerous, I always let my kids help if they want. And, if it’s too dangerous, then I tell them it is and I don’t want them to get hurt but they can watch. I remember the feeling of my dad telling me no, it sucked.",
            "title_similarity": "0.65223086",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h6hl8i6",
            "score": 3,
            "text": "If you are doing something and a random young person asks to help, say “where are your parents?”",
            "title_similarity": "0.5693308",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6hm4vm",
            "score": 2,
            "text": "Making me real sad my parents didn't do this for me bro",
            "title_similarity": "0.39177644",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6hnunt",
            "score": 2,
            "text": "I did this all the time as a summer camp leader. Even if the kiddo only carries cups, it's a great opportunity for them and hey they think it's fun. I once had like 5 kids in a line outside the kitchen because they all wanted to help! I miss that job...",
            "title_similarity": "0.5242788",
            "sentiment_compound": 0.9336
        },
        {
            "id": "h6hoeoq",
            "score": 2,
            "text": "Give the kids simple tasks. Like beating eggs, creaming butter, sweeping the floor, wiping the trim with a damp rag so you dont have to bend over or get on your knees.",
            "title_similarity": "0.5320207",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6hohes",
            "score": 2,
            "text": "Yes indeed! My confidence was destroyed by my father's refusing to let me help him. However the real problem was that I was truly old enough and capable of learning from him, but he dismissed me because he didn't want to take the time, and likely had some prejudice against me because I was a girl.",
            "title_similarity": "0.48731703",
            "sentiment_compound": -0.5065
        },
        {
            "id": "h6hq96o",
            "score": 2,
            "text": "I prefer, \"You indigent swine!  You're not worthy of this task!\"",
            "title_similarity": "0.34595805",
            "sentiment_compound": -0.457
        },
        {
            "id": "h6hrfu8",
            "score": 2,
            "text": "I wish my parents did this, now this bites me in the ass when they complain about me not helping or working hard",
            "title_similarity": "0.4867963",
            "sentiment_compound": -0.6796
        },
        {
            "id": "h6hromv",
            "score": 2,
            "text": "My son was proud to be “line guy” because he drew cut lines on our bench project. So cute.",
            "title_similarity": "0.52055264",
            "sentiment_compound": 0.7065
        },
        {
            "id": "h6hsdwe",
            "score": 2,
            "text": "until your kid wants to help with every single thing",
            "title_similarity": "0.563743",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6huk12",
            "score": 2,
            "text": "Kids don't want to help. They want you to pay attention to them instead of your task",
            "title_similarity": "0.55749416",
            "sentiment_compound": -0.3777
        },
        {
            "id": "h6hw0zv",
            "score": 2,
            "text": "The amount of times I see people getting more and more irrate at a child because they are tired or stressed, I always think to myself it uses a lot less energy on your part to turn the situation around than it does for you to shout/ argue or cuss them out.",
            "title_similarity": "0.5161747",
            "sentiment_compound": -0.7089
        },
        {
            "id": "h6hw29p",
            "score": 2,
            "text": "No. Young people have way too much self esteem these days. We need to take that down a notch. Next kid who asks to help me I'm telling him to fuck off bc he'll just screw it up.",
            "title_similarity": "0.41785508",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6hw9f7",
            "score": 2,
            "text": "But sometimes you still have to say no. Kids do need to learn that they are not always needed to help. And that sometimes people want to be left alone to do things.",
            "title_similarity": "0.69518244",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6hxmad",
            "score": 2,
            "text": "Can confirm. I used to “cook” with my grandma since I was 4, now I realise I was just bothering lol, but it definitely developed my self-esteem, gratitude and confidence",
            "title_similarity": "0.48712912",
            "sentiment_compound": 0.9267
        },
        {
            "id": "h6hyiit",
            "score": 2,
            "text": "I just say \"Sorry I don't talk to strangers\"",
            "title_similarity": "0.44221035",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h6hyllh",
            "score": 2,
            "text": "My eldest (just turned 5) always wants to help but often his \"help\" creates more work for me or makes the job take longer etc. I let him help though because I figure if I don't let him \"help\" now then he won't want to help me later.",
            "title_similarity": "0.6089059",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h6hzzve",
            "score": 2,
            "text": "This works with drunk people too",
            "title_similarity": "0.30866227",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6i0q3g",
            "score": 2,
            "text": "Child:  “Can i help you prepare your income taxes daddy?”\n\nDad: “Sure!”\n\nGives child a copy of 26 U.S. Code Subtitle A— Income Taxes.",
            "title_similarity": "0.39324287",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h6i270n",
            "score": 2,
            "text": "Lol, no? It's not my job to humor a crotchfruit?",
            "title_similarity": "0.45100796",
            "sentiment_compound": 0.644
        },
        {
            "id": "h6i2ndu",
            "score": 2,
            "text": "My dad always said “You can help by staying out of the way.”",
            "title_similarity": "0.5587076",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6i5sqo",
            "score": 2,
            "text": "I love this, perfectly stated.",
            "title_similarity": "0.41814297",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h6i67is",
            "score": 2,
            "text": "So you're saying my brother calling me bad luck and shooing me from the room might have contributed to my crippling self esteem?",
            "title_similarity": "0.37300318",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6i90n7",
            "score": 2,
            "text": "I was chopping food and a little kid came up and \"I wanna chop to\". I said \"excellent idea, step right up\"! Her dads eyes opened wide. I pinched the tip of the chefs knife with my fingers and let her lift the handle up and down, chopping away till she had enough. She was proud of her work and so was her dad.",
            "title_similarity": "0.3713193",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h6ia0fb",
            "score": 2,
            "text": "Thank you for this!",
            "title_similarity": "0.5424093",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h6ijsd0",
            "score": 2,
            "text": "I built a kitchen helper tower thing for my daughter. She climbs up to watch me cook and a lot of times I will have her stir things, or put the paper cups into the muffin pan, that sort of thing. I also let her smell ingredients, so she knows how cinnamon and vanilla smell. She really gets a kick out of it.",
            "title_similarity": "0.35494137",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6iju2z",
            "score": 2,
            "text": "Yes I agree even if you have to re-mop tge floor do something else while they're busy you in they're faces the feel accomplishment",
            "title_similarity": "0.5717489",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6it2e2",
            "score": 2,
            "text": "i used to “help” my grandpa build stuff and i was absolutely in his way but he never told me not to and he even bought me my own little miniature tool belt that i still have the hammer from",
            "title_similarity": "0.40522155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6j2hef",
            "score": 2,
            "text": "When I was really young my dad and older brother would always tell me to go away or that I couldn't help and I honestly feel like it made me less willing to engage with or initiate certain tasks or even offer to help with stuff. I made conscious effort and have moved past that but it really does mess with a kid's head.",
            "title_similarity": "0.47565717",
            "sentiment_compound": 0.1082
        },
        {
            "id": "h6j6y09",
            "score": 2,
            "text": "While forcing child labor on children, make sure to take away rations and use a whip sparingly...",
            "title_similarity": "0.33226424",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6j7b6l",
            "score": 2,
            "text": "When I was a child, I asked the father of a friend if I could help him painting his wall. I did not even want it super badly, but I wanted to help him. He gave me a brush and he used a roller. I was disappointed about having only a brush but did my very best.\nLater he used his damn paint roller and painted over my fresh painted part of the wall. I was super sad. He did the same work in 1 minute I had done in 15. And in better quality. \nBut the reason I still remember this is, realizing he just gave me the brush to keep me busy was a big disappointment for me.\nSo even if this is a solid pro tip, please don't disappoint the little kids like that.",
            "title_similarity": "0.47534764",
            "sentiment_compound": 0.9609
        },
        {
            "id": "h6rtyu0",
            "score": 2,
            "text": "The next time I'm welding or running the metal lathe I'll remember this for sure!\n\nNever too young to start working with heavy machinery.",
            "title_similarity": "0.37859702",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h71dneg",
            "score": 2,
            "text": "I'm 16 now, and my parents always used this strategy. It always made me feel better about myself, and I can attest to the fact that this works. I'm (and I'm not trying to sound like a douche) living proof",
            "title_similarity": "0.63457274",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h78xzw1",
            "score": 2,
            "text": "Wait, you guys have kids that try to be helpful sometimes? Where do I get one of those?",
            "title_similarity": "0.74791795",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h7uv4nr",
            "score": 1,
            "text": "Now see all this judgemental against me how many you actually know me I guarantee you not one she was supposed to know me better than anyone and she didn't do a good job of that but I don't go around judging y'all I said it's going to be in it I had nothing against. Yeah my problem was with her but here we are",
            "title_similarity": "0.51661426",
            "sentiment_compound": -0.6292
        },
        {
            "id": "h8mis2x",
            "score": 1,
            "text": "Advice like this leads to child soldiers.",
            "title_similarity": "0.5444666",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha0fqfn",
            "score": 2,
            "text": "That's beautiful and so important 😍",
            "title_similarity": "0.403127",
            "sentiment_compound": 0.8508
        }
    ]
}