{
    "LPT - One of the most important questions you can ask in a debate/argument is, “What proof or evidence would it take to change your mind/opinion?” If they can’t give you an answer or if they refuse to accept the evidence that they asked for, then quit wasting your time arguing with that person.\nInspired by Neil deGrasse Tyson": [
        {
            "id": "h92escl",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.6718668",
            "sentiment_compound": 0.9615
        },
        {
            "id": "h92uvlq",
            "score": 10,
            "text": "THIS!!!  I’m not anti-vaccine, I just want to see the long term studies. How will an mRNA vaccine affect us?",
            "title_similarity": "0.64266795",
            "sentiment_compound": 0.2905
        },
        {
            "id": "h92mvkw",
            "score": 4,
            "text": "I was recently debating the benefits of taking the covid vaccine when that person finally said she NEVER received a single vaccine. Of any kind, and her kids were not going to take any vaccines. \nSo I just asked, \"are you an anti vaxer?\" She replied with yes.\nThen we have nothing to discuss. Good luck!",
            "title_similarity": "0.4827962",
            "sentiment_compound": 0.8067
        },
        {
            "id": "h92unv9",
            "score": 3,
            "text": "If anyone's argument boils down to \"this is how it's always been done,\" or \"because God wants it this way\" or anything that basically absolves them of any blame, they have no real argument and should be ignored.\n\nIf things never changed or we always honored tradition, then we'd still have slavery worldwide, no one would have any say in government, there would be human sacrifices every day, and so on.",
            "title_similarity": "0.6503473",
            "sentiment_compound": -0.7261
        },
        {
            "id": "h92zlcx",
            "score": 9,
            "text": "You know Neil is a pompous dumbass who doesn't talk to people outside his field right? Like this logic ONLY applies when you're both well versed.  \"What woukd make you believe abortion shoukd be illegal\"  HOW THE FUCK AM I SUPPOSED TO KNOW!?  Fuck it. If I found out aborted babies open up a rift between dimensions which consume people like you sbd me out of existence to feed them till adulthood\"  that's not realistic!\n\nNO FUCKING SHIT.  Its YOUR job to give me realistic arguments to convince me.  YOU show ME your view points abd why I should believe them.  Why the fuck would I know your arguments against my view point if we're gonna argue about them?  If I did what purpose would the argument have?",
            "title_similarity": "0.73814684",
            "sentiment_compound": -0.9438
        },
        {
            "id": "h92xawv",
            "score": 6,
            "text": "There's no evidence that could convince me that black people are inferior, or that women shouldn't vote, or that gay people should be persecuted.",
            "title_similarity": "0.54162264",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h938cb0",
            "score": -1,
            "text": "You can thank the epistemological holocaust this cursed site and leftists in general put the world through",
            "title_similarity": "0.4791561",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h93wl2v",
            "score": 2,
            "text": "My thoughts to pro 2nd amendment people. If Sandy hook or Vegas didn't convince you, what level of violence/tragedy would?",
            "title_similarity": "0.6860729",
            "sentiment_compound": -0.1877
        },
        {
            "id": "h94bvnx",
            "score": 0,
            "text": "What evidence would you need to see to believe there was voter fraud in the 2020 election?",
            "title_similarity": "0.54424596",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h92w3lr",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.198361"
        },
        {
            "id": "h932zqx",
            "score": -10,
            "text": "Exactly why anti-vaxxers shouldn’t receive any aid or sympathy.",
            "title_similarity": "0.6309329",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h93dtdi",
            "score": 1,
            "text": "Dont bother debating morons. Laugh at them from a distance and lead by example. Once they see you succeeding they will change their tune in private and pretend they always agreed with you.",
            "title_similarity": "0.54765344",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h93zn10",
            "score": 1,
            "text": "LPT - Skip \n\n#\n\n>~~One of the most important questions you can ask in a debate/argument is, “What proof or evidence would it take to change your mind/opinion?” If they can’t give you an answer or if they refuse to accept the evidence that they asked for, then~~\n\n#\n\nand start here instead\n\n#\n\n>quit wasting your time arguing with that person.",
            "title_similarity": "0.9433999",
            "sentiment_compound": -0.4951
        },
        {
            "id": "h9301n7",
            "score": 12,
            "text": "The \"I can't build a convincing argument, therefore you're wrong\" technique, flawless.",
            "title_similarity": "0.55011195",
            "sentiment_compound": -0.5511
        },
        {
            "id": "h933uwl",
            "score": -8,
            "text": "The real LPT is point and laugh at these people, then move on with your life.\n\nDebate is dead. I don't know why we pretend it's not",
            "title_similarity": "0.6262446",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9355ha",
            "score": 2,
            "text": "Yeah I do this. Several results will happen\n1. They will give me a specific level of evidence, often I can provide this and surprisingly often they seem to reconsider their opinion.\n2. They will ask for an impossible standard of evidence, to which my question becomes, did you require that level of evidence to come to your current position? This rarely works because you can't reason someone out of an unreasonable position.\n3. I ask \" what evidence would change your mind?\" They answer \"nothing\" I say \"interesting, even if I can show you are wrong, you won't change\" then you must drop the argument and leave them in the wake of that thought. These people will still not change their position, but they may be more thoughtful in their discussions in the future.",
            "title_similarity": "0.79643613",
            "sentiment_compound": 0.3227
        },
        {
            "id": "h939hpr",
            "score": 1,
            "text": "I can hear the flath-earthers and the leftists scream in cognitive dissonance.",
            "title_similarity": "0.4811355",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h948auo",
            "score": -2,
            "text": "Yeah right !!!!\n\nTry that on the dumbed down Umercan trailer trash on reddit.\n\nNo amount of reason, intelligence, rationality or science can break through their media fed egos, well trained in doing the heavy lifting for their corporate overlords, while they cower in fear from obvious fake bIG sCarY viRuS fears, repeat endlessly FAILing false #cnntapes narratives from years ago like \"fine people\" russia russia, photo op, no wuhan leak, jabs safe and effective ..., (i could go on) and pretend bUt tHerE iS nO eVideNcE in the face of 50,000 afadavits, an uncollected 5 million bucks for proving Lindell's PCAPS do not prove China owns your ass.\n\nYou can't fix stupid and reddit stupid is globally famous.\n\nIt is where we go to laugh AT the dumb Umercan bewildered herd  consoling each other that the #Actblue funded Indian troll farms dominating every thread is tHe mAjoRitY.\n\n\nHahahahahaha\n\nMeanwhile, In Real Life - globally - no intelligent people have taken  the corporate serum #clotshot, billions are in the street as the Great Awakening destroys the ghey corporatist gReAt rEsET and realize the most stupid amongst us rushed to get the jab, winning the 2021 darwin awards, suiciding themselves for a mere moment of virtue signalling on their socialist media that literally NoOne cared about.\n\nHilarious, bit tragic at the same time.",
            "title_similarity": "0.61456376",
            "sentiment_compound": 0.5409
        },
        {
            "id": "h92yk3o",
            "score": 0,
            "text": "I like this thought processes and it can help you determine if it is would the mental would it would take to have a real discussion. \n\nIf someone is so solidified in their opinion that nothing could change it, sometimes it is best to cut your losses and move on. The sooner the better.",
            "title_similarity": "0.5981842",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h930kzz",
            "score": 0,
            "text": "This seems simple enough\n\nI'm not sure why it's presented as a revelation",
            "title_similarity": "0.22290395",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h9322zz",
            "score": 0,
            "text": "Love this.  What's the actual quote from Neil deGrasse I wonder?",
            "title_similarity": "0.5083405",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h93b1vk",
            "score": 4,
            "text": "This is the basis of all scientific thought.  It let's you know if the other person is interested in the truth or not.",
            "title_similarity": "0.5846658",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h93zhg4",
            "score": 0,
            "text": "Also, online debates with trolls aren’t worth a damn. Use the nifty block feature",
            "title_similarity": "0.63057286",
            "sentiment_compound": -0.25
        },
        {
            "id": "h953q4l",
            "score": 0,
            "text": "Eh... Isn't that the same as asking; \"what question should I ask to win this debate?\"",
            "title_similarity": "0.71701413",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h95iega",
            "score": 0,
            "text": "\"What proof or evidence would it take to change your mind?\"\n\nActually says,  \"do my side of the argument please \"\n\nDumb LPT that no one in earth will be able to do.",
            "title_similarity": "0.7360937",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h95qr94",
            "score": 0,
            "text": "You want me to make up imaginary evidence to argue with  myself",
            "title_similarity": "0.6780215",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h92jfyn",
            "score": 12,
            "text": "It depends.  If you asked me what proof it would take for me to believe in god my answer is idk, but I don't think I'm being closed minded.",
            "title_similarity": "0.64646643",
            "sentiment_compound": 0.09
        },
        {
            "id": "h930vf0",
            "score": 1,
            "text": "Just don't ask Tyson about gravity haha",
            "title_similarity": "0.33570465",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h932b8f",
            "score": 1,
            "text": "“It's hard to win an argument with a smart person, but it's damn near impossible to win an argument with a stupid person.” – Bill Murray",
            "title_similarity": "0.67285633",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h93mazw",
            "score": 1,
            "text": "Damn where was this tip last year?",
            "title_similarity": "0.22980988",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h94c3uf",
            "score": 1,
            "text": "Or better yet, never engage in any form of debate. The concept of debating is asinine.",
            "title_similarity": "0.4323391",
            "sentiment_compound": 0.2177
        },
        {
            "id": "h95bmo1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.20588729"
        },
        {
            "id": "h937yi2",
            "score": 2,
            "text": "A black friend of mine is huge into astrology... To the point of annoying people with it's nonsense.\n\nSo one day I asked him what evidence I could give to get him to knock it off or at least relax a bit. He said, \"if you can find me one black scientist that can disprove it or make a valid case against it I'll stop believing in it.\"\n\nSo I pulled up a 9 min vid of Neil Tyson tearing it to shreds.\n \nTo which he replied, \"I don't care, I'm still going to believe it.\"\n\nSo I've just stopped doing anything other than providing evidence and not caring of they accept it.",
            "title_similarity": "0.66082764",
            "sentiment_compound": -0.4624
        },
        {
            "id": "h93hyfu",
            "score": -2,
            "text": "Agree with the sentiment although I don’t like Neil deGrasse Tyson’s bad faith arguments. IMO he know e truth and is a PR man trying to convince the world of globe earth and so on, hired by the people behind it all.",
            "title_similarity": "0.7236185",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h94av0i",
            "score": 2,
            "text": "I don't think I've ever seen a life pro tip that wasn't fucking stupid",
            "title_similarity": "0.37232298",
            "sentiment_compound": 0.4575
        },
        {
            "id": "h93f6wd",
            "score": 4,
            "text": "Your Internet argument change my mind\n\n– said no one ever",
            "title_similarity": "0.48015755",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h94c6km",
            "score": 3,
            "text": "Most naive LPT ever",
            "title_similarity": "0.21650991",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h92o58a",
            "score": 12,
            "text": "Ask yourself the same question though.",
            "title_similarity": "0.39821714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9379zh",
            "score": 14,
            "text": "You need to show me this proof.\n\n*shows proof*\n\nBut not from that source, show me from another. (Repeat x100)",
            "title_similarity": "0.62979245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93m70o",
            "score": -5,
            "text": "I lost a friend over this very topic! He made a post on kids in cages and had pictures from the Obama administration and I simply pointed out he should check his facts and stop blaming Trump for everything before you check your facts. He is kicking himself now as he is a huge Biden supporter.",
            "title_similarity": "0.6608748",
            "sentiment_compound": -0.1007
        },
        {
            "id": "h93dng4",
            "score": 5,
            "text": "There are many debates that are not on a basis of proof. For example, philosophy or morality. These are subjective, and can therefore have unreasonable burdens of proof.",
            "title_similarity": "0.6705103",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h92uvp5",
            "score": 8,
            "text": "This is 9/10 depositions I take of insurance adjusters.\n\n“Why didn’t you pay?”\n\n“I didn’t have the proof I needed.”\n\n“You agree your have A, B, and C in support of the claim?”\n\n“Yes.”\n\n“And nothing contradicting it?”\n\n“Yes.”\n\n“Then why didn’t you pay?”\n\n“Because it’s not enough proof.”\n\n“What else do you need?”\n\n“I don’t know. I’ll know it when I see it.”",
            "title_similarity": "0.6736982",
            "sentiment_compound": 0.7976
        },
        {
            "id": "h93onwc",
            "score": 7,
            "text": "This is not good advice it's only a way to make yourself feel superior to whoever you're debating. The reason is that most of the time a debate happens is because there is no decent ultimate truth that is either self evident, or proven by empirical reasoning.",
            "title_similarity": "0.7524235",
            "sentiment_compound": 0.2946
        },
        {
            "id": "h9369ig",
            "score": 9,
            "text": "I'm not sure how I feel about this. I think this is important if it's an argument on a personal level about things in life that affect both people, but when it comes down to a casual debate about opinions, there are many situations where your aim should not be to change someone's mind. \n\nExample: \"I think God is real.\"\n\n\"God isn't real - what proof or evidence would it take to change your mind/opinion?\"\n\n\"That's my belief and I can't think of what it would take to change my mind.\"\n\n\"This conversation is over with.\"\n\nDoesn't that seem so shitty? Some opinions you shouldn't be out to change, just discuss.",
            "title_similarity": "0.7862371",
            "sentiment_compound": -0.4793
        },
        {
            "id": "h92mw5e",
            "score": 66,
            "text": "This is expecting an answer to a question a person obviously doesn't know. If I knew what kind of compelling evidence it would take for me to fully believe something, I would then know about that subject enough to derive a different conclusion. My flat earther neighbor couldn't tell me what it would take to convince him that the earth wasnt flat. I had to figure out the holes in his knowledge to build a picture for him....he couldn't know what he didn't know.",
            "title_similarity": "0.77322924",
            "sentiment_compound": 0.3832
        },
        {
            "id": "h92rqo7",
            "score": 15,
            "text": "There's also the middle-ground approach.\n\nWhen you can find middle-ground, something you both agree upon, you can always go back to that foundation to soothe nerves. It's getting harder to do these days, as is providing proof for arguments. Too much fakery out there these days.",
            "title_similarity": "0.73548245",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h92z1m1",
            "score": 14,
            "text": "You know, you can also try to understand each other better knowing that neither of you will change his mind...",
            "title_similarity": "0.4473037",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h92fy29",
            "score": 492,
            "text": "Sometimes we don't know what would convince us, until we see it",
            "title_similarity": "0.5633377",
            "sentiment_compound": 0.25
        },
        {
            "id": "h92garx",
            "score": 1497,
            "text": "To be fair... If I was aware of what proof I needed to demonstrate I was wrong I would have checked for it already... Frequently an argument requires walking the other down an avenue of thought that does not occur to them... The evidence at the end was not something they could have thought of needing.",
            "title_similarity": "0.7034472",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h930dlh",
            "score": 407,
            "text": "As a person who formally debates on a regular basis, this advice and line of questioning seems smart only on paper, it does not work in reality.",
            "title_similarity": "0.5864674",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h92l52y",
            "score": 156,
            "text": "What proof of evidence would make you take back statement from the title?",
            "title_similarity": "0.60079503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h92vqlt",
            "score": 30,
            "text": "It's actually kind of a useless question because presumably the person asking it would *already* have presented their best evidence that should have changed the other person's mind. If it didn't, then it's most likely the case that either your best evidence isn't evidence at all or the person you're talking to can't be reasoned with anyway.",
            "title_similarity": "0.7499429",
            "sentiment_compound": 0.765
        },
        {
            "id": "h92ygvp",
            "score": 1135,
            "text": "This only applies if it's a private debate, in a debate with other people observing you are not solely trying to change the other person's mind, you are trying to change the minds of members of the audience who support them, keep fence-sitters from going over to their side, and provide stronger reasoning for audience members on your side of the issue. \n\nThere's also the issues that others have brought up, being that just because the person can't spit that information out right away doesn't mean they are arguing in bad faith or are unwilling to be convinced, and that it's a very broad question that doesn't apply to every topic of debate in the same level.",
            "title_similarity": "0.711969",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h931y85",
            "score": 42,
            "text": "This makes some sense, but this is more argumentative than a discussion needs to be. If it's at that level, then you are already wasting your time.  Honestly if somebody asked me this I would know they are too far into a winning mentality so would abandon the conversation myself.  \n\n\nI prefer to think of it this way.\n\n1. Know what you believe.    \nThis is actually a big one because people make broad generalizations sometimes, or maybe they've never thought about something past a specific point.  We have all done this.  So stop and define what you believe.  \n\n2. Know why you believe it.    \nWhen you think through something you will have a reason to believe what you believe.  That is your evidence.  Maybe it's totally irrational, but it's still your reasoning.\n\n3. Present that in your conversation to the other person.  I believe this, this is why.  At the very least now they can understand your position.  They might not agree with you and that's ok.    \nVice versa, ask them what they believe and then why.  Listen to them and understand.  You might not agree with them and that's ok, but you can see they have reasons.  \n\nIf anything in point 3 is off, you can have discussion points.  Maybe they didn't think about your points. Maybe you didn't think about theirs.  Maybe somebody didn't think about it and take it fully down the road to application.  Whatever.  It allows you and them to have open minds and consider things.  You/They can marinate on the ideas and maybe it'll make more sense as you go through life.    \n\n4. Don't expect change.  \nMaybe somebody will change their mind in that conversation, but I doubt it. I think change comes later as I said.    \nAlso consider that maybe you need to agree to disagree and there is no cut and dry right answer.  Not everything in this world is black and white, and sometimes you can have alternate perspectives on the exact same fact.",
            "title_similarity": "0.78580844",
            "sentiment_compound": -0.9498
        },
        {
            "id": "h931d6q",
            "score": 69,
            "text": "\"I don't know, but I'm open to hearing it\" is a perfectly acceptable answer.",
            "title_similarity": "0.37488732",
            "sentiment_compound": 0.8674
        },
        {
            "id": "h92j8qb",
            "score": 3104,
            "text": "Every Reddit argument; think twice before responding",
            "title_similarity": "0.46275944",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h92o8rx",
            "score": 2213,
            "text": "To change someone's mind on an issue, you have to show them your viewpoint aligns with their core beliefs. (And if it doesn't, they will never agree with you.)",
            "title_similarity": "0.7817284",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h92qm4i",
            "score": 1,
            "text": "But what am I going to do with all the time freed up after quitting reddit?",
            "title_similarity": "0.50489175",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h92v4l8",
            "score": 1,
            "text": "One of the most useful bumper stickers in this regard:\n\n*The Bible says it. I believe it. And that settles it.*",
            "title_similarity": "0.48459852",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h92yse9",
            "score": 8,
            "text": "The problem with this is that you can Google any proof you want even if it's utter bullshit.",
            "title_similarity": "0.62698746",
            "sentiment_compound": -0.7574
        },
        {
            "id": "h92yyhp",
            "score": 121,
            "text": "[deleted]",
            "title_similarity": "0.198361"
        },
        {
            "id": "h92z7ap",
            "score": 2,
            "text": "This simple question is why everyone should start out as a philosophy major. Philosophy offers 6 millennia of human thought and we continue to believe we have come up with a new discovery related to human development.",
            "title_similarity": "0.51157564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h92zui3",
            "score": 11,
            "text": "What evidence or proof do you have this works?",
            "title_similarity": "0.42174694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h930uxi",
            "score": 5,
            "text": "I kind of disagree. Ideas can be pervasive and change slowly over time. When someone disagrees with you, you still had an impact. They will still be thinking about what you said. There are plenty of folks who just can't handle being wrong, even when they know they are. They may still decide to change the way they think about something even if their response did not indicate a change of heart.",
            "title_similarity": "0.66547406",
            "sentiment_compound": 0.3738
        },
        {
            "id": "h930vi7",
            "score": 5,
            "text": "i disagree that asking \"what would it take to change your mind\" is a good question.  if they are able to answer then it's already failed to change their mind.  \n\nso what's the right approach?  depends.  if it's a vague statement like \"they're committing a crime!\" i'll ask who 'they' are and what crimes are being committed.  often it's something they don't like but it's not a crime, or the ones they're blaming aren't actually responsible\n\nor i'll ask for specifics.... they'll say \"they're taking my freedom\" and i'll ask which freedom and they have no idea\n\nsimply asking for evidence will often make for a short discussion.",
            "title_similarity": "0.6721653",
            "sentiment_compound": 0.7628
        },
        {
            "id": "h931kk6",
            "score": 2,
            "text": "These concepts are called Falsafiability and Verifiability.\n\nFor more on these techniques, see: [Street Epistemology](https://streetepistemology.com/)",
            "title_similarity": "0.3352548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h931zm2",
            "score": 10,
            "text": "LPT: In Debates/Arguments, you're not trying to convince your opponent.  You're trying to convince the audience.",
            "title_similarity": "0.6536201",
            "sentiment_compound": 0.067
        },
        {
            "id": "h932k6v",
            "score": 2,
            "text": "It's possible that it's a harder question to answer than it seems, to you it might be easy as it's something you've prepared but if it's something worth thinking about then you shouldn't consider it a victory just because you've put someone on the spot and they don't have an answer",
            "title_similarity": "0.70892966",
            "sentiment_compound": 0.5789
        },
        {
            "id": "h932u9n",
            "score": 5,
            "text": "From my limited expirience convincing people is more about how to manage other people emotion, because human are emotional creatures. You can't just \"attack\" their believe, they will get defensive, and you can't talk with defensive people, they will double down.\n\nPs I find neill socially awkward, so I find it kinda weird we take hid advice about handling people",
            "title_similarity": "0.7044139",
            "sentiment_compound": 0.3763
        },
        {
            "id": "h932uq5",
            "score": 1,
            "text": "Had an argument like two weeks ago where instead of asking this question I went on and mailed a scientist to ask for his opinion on how to deal with people who just don't seem to change their mind no matter how wrong they are, part of me expecting not to get a reply or to get a \"you just can't with some people\" at most.\n\nWas pleasantly surprised to receive a very detailed and formal \"good luck proving this ridiculous claim of yours!\".",
            "title_similarity": "0.6753582",
            "sentiment_compound": 0.7236
        },
        {
            "id": "h932uzx",
            "score": 3,
            "text": "I've actually found this to be an unproductive question.\n\n&#x200B;\n\nThe reason is because there may be many, many ways to go about proving something. I can't just list them all. And if I give you one thing that might convince me, and you say \"well I can't do that one, what else would convince you?\", then what?\n\n&#x200B;\n\nIt makes more sense to just provide the argument that convinced you, than to ask me to figure out a way to prove your claim is true. That's your job, not mine.\n\n&#x200B;\n\nI do get the point of it though, if there's nothing that would convince a person, then that's a waste of time. Totally.",
            "title_similarity": "0.82013595",
            "sentiment_compound": 0.602
        },
        {
            "id": "h933i3g",
            "score": 1,
            "text": "Idk. \n\nI’ve laid that out in arguments before, like\n\n“Show me x and I’ll change my mind”\n\nBut people just flat out ignore it. Either don’t respond or argue laterally. \n\nAnd this is usually in situations where the hivemind thinks I’m in the wrong.",
            "title_similarity": "0.7451595",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h933r5j",
            "score": 6,
            "text": "Honestly what do i awnser if that person asked me back that question\n\nLike if hes an antu vaxxer and asks me that question I would say yeah if my doctor would say so but yk some doctors are anti vaxxers too!",
            "title_similarity": "0.6727212",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h934ba0",
            "score": 1,
            "text": "Doesn't work for many theological beliefs.",
            "title_similarity": "0.38495764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h935g06",
            "score": 4,
            "text": "And to be aware that this advice applies to you too.\n\nIn order for a debate to truly be beneficial, both parties have to be open to the other sides evidence/facts/conclusions etc.",
            "title_similarity": "0.66649723",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h935rl8",
            "score": 2,
            "text": "Why debate at all in the first place? Why not just discuss? All I ever do is try to understand the other person's view as well as I can while explaining my own. I'm always seeking new points of view. Debates, in my experience, never seem to change anyone's mind. Making them competitive serves to incentivize bad faith arguments.",
            "title_similarity": "0.73786235",
            "sentiment_compound": -0.2406
        },
        {
            "id": "h9364zt",
            "score": 19,
            "text": "I hear that goes swimmingly in religious debates.",
            "title_similarity": "0.568045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h936fv6",
            "score": 2,
            "text": "Outside of debates about scientifically supported facts, you're not usually likely to get a positive answer, but there's still a world of difference between \"Hmm, I don't know\" and \"*nothing* could make me change my mind.\"",
            "title_similarity": "0.6462597",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h937bd0",
            "score": 1,
            "text": "Yes! I was just saying something like this to my friend the other day!",
            "title_similarity": "0.26318383",
            "sentiment_compound": 0.8395
        },
        {
            "id": "h937zw1",
            "score": 1,
            "text": "Love this.\nYou could even be the one in the wrong at the end of the day. \nBut like this you at least know they're open to a constructive discussion rather than talking to a brick wall.",
            "title_similarity": "0.52379495",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h93839e",
            "score": 1,
            "text": "Arguing with the actual intention of changing the other person's mind is also just, quite rare. Most of the time it's theatre for those watching.",
            "title_similarity": "0.51312864",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h938ar3",
            "score": 3,
            "text": "I'm more of a compare before contrast on that.\n\nWhere did you 'learn' this?\n\nContrast with 'where I learned else'.\n\nSources matter.\n\nSometimes neither is correct. \n\nOr you could have the shootout at the OK Corral if neither will budge.\n\nOr.... LPT: engage in logic convos with folks who are ok with such debate and don't get frisky if their beliefs are challenged (including yourself).",
            "title_similarity": "0.717258",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h938orz",
            "score": 1,
            "text": "You mean a qualifying question first? Go forbid people learn the first rule of sales.",
            "title_similarity": "0.651565",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h938tkh",
            "score": 1,
            "text": "5’s no proof that’s fingering to a new level",
            "title_similarity": "0.34139076",
            "sentiment_compound": -0.296
        },
        {
            "id": "h939ezq",
            "score": 1,
            "text": "The real point of debate is to convince somebody that people with whom they disagree can be worthy of respect. Mind-changing happens much later.",
            "title_similarity": "0.74212515",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h939ibd",
            "score": 4,
            "text": "I know Trump is an asshole. I also know there was a sunrise this morning. \n\nThose two things have about the same level of certainty to them. I can't imagine any amount of effort to persuade me otherwise would be successful.",
            "title_similarity": "0.5101955",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h939itn",
            "score": 1,
            "text": "See Popper and https://en.m.wikipedia.org/wiki/Falsifiability",
            "title_similarity": "0.3827724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h939lkx",
            "score": 1,
            "text": "I tried this with my mom. \"Is there anything trump could do that would cause you to rebuke him?\" \"Well... no I can't really think of anything\" and that was that. I realized it was a lost cause.",
            "title_similarity": "0.67130524",
            "sentiment_compound": -0.34
        },
        {
            "id": "h939lno",
            "score": 1,
            "text": ">LPT - One of the most important questions you can ask in a debate/argument is, **“What proof or evidence would it take to change your mind/opinion?”** If they can’t give you an answer or if they refuse to accept the evidence that they asked for, then quit wasting your time arguing with that person.\n\nEh.\n\n1. This only applies if the point of the conversation is to change the other person's mind and you have no intention of changing *your* mind at all;\n2. This **is** good advice if all you care about is changing their mind; BUT\n3. Even then, it's only good for that and not a sign of anything else (e.g. that you have a good argument), because you can imagine a flat-earther asking the same question and getting fuck all response too.",
            "title_similarity": "0.8808794",
            "sentiment_compound": 0.012
        },
        {
            "id": "h939nml",
            "score": 1,
            "text": "doesn't work on reddit, they just keep spamming forwards from Facebook as evidence",
            "title_similarity": "0.437038",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h939oqr",
            "score": 1,
            "text": "Stop making posts about my mom",
            "title_similarity": "0.47382647",
            "sentiment_compound": -0.296
        },
        {
            "id": "h939yn8",
            "score": 1,
            "text": "This doesn't work. People have different systems of beliefs/systems of value. The same fact can be interpreted differently depending on your ideology. For example: \"rich person gives money to charity: it's a good thing, this goes to show that capitalism works!\" VS \"rich person gives money to charity: more tax evasion or even fraud, they are trying to set themselves up as the good guys as if they were innocent in the class struggle\"",
            "title_similarity": "0.53983235",
            "sentiment_compound": 0.9485
        },
        {
            "id": "h93a0i6",
            "score": 1,
            "text": "Just don’t participate in debates or arguments.",
            "title_similarity": "0.30405194",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h93aal0",
            "score": 1,
            "text": "That's nonsense. I don't know what it would take to prove the rieman hypothesis. We can still have a discussion about maths",
            "title_similarity": "0.59313285",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h93aamn",
            "score": 2,
            "text": "After being raised in a right wing bubble and growing up to realize that everything I had been taught was wrong, I think one of the most important questions anyone can ever be asked is, \"If you were wrong, would you want to know?\"",
            "title_similarity": "0.7150928",
            "sentiment_compound": -0.4779
        },
        {
            "id": "h93aazz",
            "score": 1,
            "text": "“How to have impossible conversations”",
            "title_similarity": "0.5773226",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93ang9",
            "score": 1,
            "text": "That is fairly rich coming from NdGT, tbh",
            "title_similarity": "0.17345159",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h93aqm3",
            "score": 2,
            "text": "today i confronted a fellow employee who has been bad mouthing me and telling my other coworkers that i have been stealing from work and not to trust me. Obviously im not stealing and i am hurt because i always want to be the guy people look towards for help. Granted it escalated into a fight where each of us are shouting at eachother but after that fact i calmed approached her and asked what could i do to convince her that i was telling the truth and i only wanted to help and i wouldnt steal from my main bread and butter job. she wouldnt discuss it and in fact further decided to say that there isnt anything to change her mind and that she is set. This post told me everything i needed to know.",
            "title_similarity": "0.6346399",
            "sentiment_compound": 0.8883
        },
        {
            "id": "h93as1m",
            "score": 1,
            "text": "I would probably ask that question to myself as well. Or even in some cases \"why can't we both be right? Does it have to be one or the other?\".",
            "title_similarity": "0.65098715",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h93as5d",
            "score": 1,
            "text": "I almost agree with you.\n\nThe most important conversation is not about what's true, but rather about how we work out what's true. You're right that in those circumstances the person is likely to be incapable of reason, but it's important to try to talk to them about why their position with regard to evidence and reason is counterproductive and may be shielding them from the truth.\n\nIt's rare but it does work, I've done it repeatedly. And it's far more impactful than just convincing them to reconsider whatever you were disagreeing about in the first place.\n\nIt's generally a bad idea to take inspiration from NDT, he's not even remotely as open-minded as he likes to tell himself.",
            "title_similarity": "0.82134986",
            "sentiment_compound": 0.873
        },
        {
            "id": "h93aznh",
            "score": 1,
            "text": "I don’t agree with this - a lot of people are unaware of what they need to break their viewpoint. When it happens, then they know…not before.",
            "title_similarity": "0.6026136",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h93b6sm",
            "score": 1,
            "text": "No. Here why.\n\nMost debates argue without a result. Making it an argument. The question to ask a debater is \" what is your solution?\" Most don't have a clue, as many are trained in just sharing their opinions to facts, not share solutions to the problem.",
            "title_similarity": "0.69314015",
            "sentiment_compound": -0.6351
        },
        {
            "id": "h93bewj",
            "score": 1,
            "text": "This falls under the 'falsification' principle. If your \"theory\" is not falsifiable, then it's not a valid theory (and is a hypothesis at best). \n\nThis doesn't really work in soft sciences though as people can easily hold contradictory thoughts and views simultaneously.",
            "title_similarity": "0.6589569",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h93bij2",
            "score": 1,
            "text": "> “What proof or evidence would it take to change your mind/opinion?”\n\nAnd surely they will change their mind when you present that proof.\n\n#BWAAAAHAHAHAHA",
            "title_similarity": "0.7700628",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h93bris",
            "score": 1,
            "text": "What a stupid shit tip",
            "title_similarity": "0.4019855",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h93ch0o",
            "score": 2,
            "text": "Yesterday I had a  discussion with a coworker (CW):\n\nWe were talking about the Antivax Rally happening that day and I said how dumb those people are for not taking the vaccine. CW said that she wasn't going to take the vaccine either because it makes you infertile.. I check google right away and NO it does not make you infertile. \n\nApparently she told me that it was her friend's father who *aLwaYs wAtCheS* the news that told her and she never looked it up. When I told her it was fake, CW told me that *obviously the government is trying to hide it*... I asked her for proof and she was just telling me that she trusts her friend's father more than the news. \n\nI ended up actually asking her if friend's father took the vaccine, would you? She said no, then I asked her what would make her take the vaccine and behold she said nothing.... I couldn't believe her logic...\n\nI want to add that she never finished high school and she certainly doesn't seem to know how covid or the media works. She told me that all scientists work for the government...",
            "title_similarity": "0.56233364",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h93cixj",
            "score": 1,
            "text": "If you're arguing on the internet then you aren't arguing to change their opinion, you're arguing to validate your own.",
            "title_similarity": "0.7229733",
            "sentiment_compound": -0.2547
        },
        {
            "id": "h93cmg8",
            "score": 1,
            "text": "I see one problem with this: The question comes from the assumption that you are right, and the person you're debating is wrong. \n\nIf I was in a debate with someone trying to convince me that, say, the theory of evolution is wrong, and they asked me this question ... well, I'd be kinda stumped. Simply because the evidence in favor of evolution is massive that nothing you can say or present within the confines and time restraints of a debate is going to be enough to make me change my mind on the subject. The most you could possibly hope for would be to make me slightly less sure of my position. \n\nI think you need to ask this question of yourself as well — \"what proof would it take for **me** to change **my** opinion?\"\n\nAnd keep in mind that a failure to come up with an immediate answer isn't necessarily a sign of dogmatism or close-mindedness — it could just be that the evidence you're up against is massive.\n\nAnd debating someone isn't just about convincing the other party that you're right — if you're in the wrong and you end up learning something, that's hardly a waste of time. \n\nAnd finally, even when you're right, people seldom pick their convictions haphazardly — they probably believe they have ample evidence in support of their position, even when they're wrong. Don't expect anyone to be suddenly convinced of their wrongness by any proof you can provide. But if you can shake them just a little, and make them a little less sure of their fallacious belief — well, that's hardly a waste of time either.",
            "title_similarity": "0.8446368",
            "sentiment_compound": -0.4339
        },
        {
            "id": "h93cohg",
            "score": 1,
            "text": "Falsification Principle\n\nhttps://www.simplypsychology.org/Karl-Popper.html",
            "title_similarity": "0.48453546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93d2cx",
            "score": 1,
            "text": "The real LPT is that this is a technique used by bad-faith actors. They'll let you set the parameters to make you feel confident and then provide specious evidence that they can claim satisfies your parameters. Even if it doesn't meet the intent or spirit of your request, they'll then shift the argument to how unreasonable they've made you appear to be, scoring further rhetorical points and refocusing the discussion away from their lame-assed arguments.",
            "title_similarity": "0.7664616",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h93d9iz",
            "score": 1,
            "text": "I can't personally see this approach working for my at least. My focus is instead on just finding out why we're having the debate in the first place. If it's to genuinely understand the other side and keeping an open mind to changing their position, that's good enough.\n\nThe purpose for me isn't really you always change the other person's mind but at least give them something to think about and taking something for me to think about as well. Sometimes it takes time to process and really play with the points in your head before you change your mind.\n\nThat said, if the purpose of the debate/argument is to just prove themselves right or try to argue for the sake of it (because they're bored maybe) then I prefer to invest much energy or time to it.",
            "title_similarity": "0.7705328",
            "sentiment_compound": 0.6174
        },
        {
            "id": "h93dani",
            "score": 1,
            "text": "The most useless and time wasting arguments I ever participated in back in the day was 2 straight hours with a buddy about which is better, the original LoTR trilogy or The Hobbit trilogy.\n\nI was dumbfounded that they could prefer the hobbit over LoTR. Argument ended when they admitted to not watching the LoTR films. Holy shit man was I mif'd.\n\nThe other was after a friend's wedding. We just came back tired to our apartment trying to catch some Zz before our flight back home, and someone started talking about flat earth. We were 5 people, 3 round earthers and 2 flat earthers. \n\nEverything we could grab was a prop to demonstrate our points. End of the night, nothing was achieved. 5 hours straight man...",
            "title_similarity": "0.5027417",
            "sentiment_compound": -0.8932
        },
        {
            "id": "h93dfsm",
            "score": 1,
            "text": "Yeah I have worked with enough Trump supporters to know that they can go round and round for weeks and always think of a dumb reason not to believe any proof.",
            "title_similarity": "0.50181186",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h93dhkq",
            "score": 1,
            "text": "Not sure if this would help, but I would ask instead \"what concerns do you have about your belief?\" to be able to identify their own qualms about it. Or take a known value or belief they have and ask questions about it until you get to where they can see that their belief doesn't align with their value.",
            "title_similarity": "0.73185796",
            "sentiment_compound": 0.7628
        },
        {
            "id": "h93eejy",
            "score": 1,
            "text": "Terrible advice, you've accomplished nothing.",
            "title_similarity": "0.37362546",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h93eend",
            "score": 1,
            "text": "I have adopted a version of this when I sense vaccine resistance. \"Is there anything we can discuss that may change your mind?\" When they say no, I move on.",
            "title_similarity": "0.6481981",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93efxt",
            "score": 1,
            "text": "one of the main plays i have seen on message boards is the losing side in an argument trying to force moderator intervention in their favour which is not difficult since a lot moderators can't handle any thing that makes them think\n\ni have seen so many subs taken over by the people least suited to run them",
            "title_similarity": "0.71593773",
            "sentiment_compound": 0.2287
        },
        {
            "id": "h93epcm",
            "score": 1,
            "text": "I don't have an answer to that for a lot of claims, such as by religious people.\n\nWhat would it take to change my mind on any unprovable, unfalsifiable claim? \nI don't know.",
            "title_similarity": "0.6240065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93epxf",
            "score": 1,
            "text": "Every time I point out how awful of a president Trump was to my mother, uncle, father, father’s wife, mother in law…..",
            "title_similarity": "0.5869566",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h93er9a",
            "score": 5,
            "text": "This doesn’t work if the debate is a logical/philosophical one. My thoughts on deontology vs consequentialism have nothing to do with evidence but with reasoning. Many people care more about principles than outcomes.",
            "title_similarity": "0.6962851",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h93f3qz",
            "score": 3,
            "text": "This advice neglects the fact that people can be swayed by emotion and not solely logic and evidence.",
            "title_similarity": "0.5335783",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h93f4tp",
            "score": 3,
            "text": "If you are starting a debate with the intention of changing someone’s mind, in the greater scheme of things, you have already lost. Opinions, and more importantly beliefs, only change when the owners of those beliefs are open to the possibility of change. Truth must be sought if it is to be found.",
            "title_similarity": "0.8177327",
            "sentiment_compound": 0.624
        },
        {
            "id": "h93fji1",
            "score": 1,
            "text": "I think that a better idea is to do street epistemology. No one has an idea of what it would take to change their mind/stance.",
            "title_similarity": "0.53472495",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h93flyd",
            "score": 1,
            "text": "Asking someone how to prove a negative is not productive.",
            "title_similarity": "0.5687634",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h93g2yz",
            "score": 1,
            "text": "Most people that are disagreeable can't be changed by correct information.",
            "title_similarity": "0.43999904",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h93g9p7",
            "score": 1,
            "text": "A lot of times people acting stubborn/ignorant in an argument means they don't agree with it for reasons they would not like to admit. It becomes near impossible to convince them because they won't reveal the reasons why they believe in their side of the debate in the first place.",
            "title_similarity": "0.6957778",
            "sentiment_compound": -0.6499
        },
        {
            "id": "h93gk1e",
            "score": 1,
            "text": "even more important than this, think what evidence would it take for *me* to change *my* opinion.   without this piece, you just end up with a pompous ass who thinks he's there to enlighten his inferiors.",
            "title_similarity": "0.767408",
            "sentiment_compound": 0.101
        },
        {
            "id": "h93grrp",
            "score": 1,
            "text": "I actually got asked this in a job interview once. It was about teamwork and not agreeing on something. Really threw me off and I had to think about it.",
            "title_similarity": "0.682891",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h93gw2b",
            "score": 1,
            "text": "/asktrumpsuppoters the mental gymnastics should win a gold medal.\n\nEdit: I don’t know how to link it.",
            "title_similarity": "0.5176624",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h93gz1i",
            "score": 1,
            "text": "The flaw with this statement is that it assumes the point of the debate/argument is to win by changing the other persons mind/opinion. \n\nSome of the best arguments aren't about \"winning\" they are about exploring the reasoning behind both sides of the argument. I find my self debating someone I agree with in principal quite often just to explore both sides of the issue. \n\nThere are plenty of topics that come up daily that don't have a right or wrong answer just different potential answers depending on what things are valued/desired at any given time.",
            "title_similarity": "0.7529024",
            "sentiment_compound": 0.1088
        },
        {
            "id": "h93h0gn",
            "score": 1,
            "text": "Debates or arguments are waste of time in general.\nInstead of revolving around the truth, it's always about who's right. And \"winning\" the debate/argument",
            "title_similarity": "0.7075353",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h93h5qb",
            "score": 1,
            "text": "LPT this will not work on reddit.",
            "title_similarity": "0.45728868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93hc5z",
            "score": 1,
            "text": "That’s not always the point though. Making a solid argument may be able to convince other people reading it, not necessarily the person you are arguing with.",
            "title_similarity": "0.6150738",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h93hhwr",
            "score": 1,
            "text": "That is a very reddity idea. Not grounded in any kind of sense or logic at all.",
            "title_similarity": "0.37435213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93hiax",
            "score": 1,
            "text": "I learned this a few years ago. Saved me sooooo much time arguing.\nGmil~TheY prEforM abOrtiOns uP unTil 38 WeeKs...\nMe~okay, they don't, what would it take to show you they don't?\nGmil~I'm a nurse I know what I'm talking about\nMe~mkay",
            "title_similarity": "0.4993759",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h93hoeg",
            "score": 1,
            "text": "How about if only god were to know what evidence to provide to prove her existence?",
            "title_similarity": "0.49645382",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h93hqep",
            "score": 1,
            "text": "A lesson I learned a long time ago arguing with people online. Doesn't matter how good your case is if people aren't willing to change their mind. Now I just straight ask people if this is an issue they can be swayed on with the right evidence. Saves me a heck of a lot of time",
            "title_similarity": "0.7354492",
            "sentiment_compound": -0.5544
        },
        {
            "id": "h93ht5y",
            "score": 1,
            "text": "People have a real problem with admitting when they’re wrong these days, even when presented with new information; a great opportunity for them to admit that they’re wrong whilst keeping their head held high. As soon as they get emotional or cherry-pick random parts of my argument, and ignore fundamental counterpoints, it’s over. It’s best to stop wasting your time on people that are incapable of having an interesting discussion.",
            "title_similarity": "0.7914447",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h93hx9f",
            "score": 1,
            "text": "That’s dumb as shit?\n\nWhat would it take to change your mind? I have no idea. Prove it. Prove it to me otherwise and I will believe you and if you don’t end up changing my mind, bud, don’t worry about it.",
            "title_similarity": "0.7076005",
            "sentiment_compound": -0.9074
        },
        {
            "id": "h93ie08",
            "score": 2,
            "text": "Simple as that! Geniussssss Geniussssss",
            "title_similarity": "0.11620929",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93iftr",
            "score": 1,
            "text": "Sure. Except human reasoning and debating is way more complex than this. If you are debating with some one where one single piece of evidence is sufficient to make or break the argument its probably not worth debating about entirely. Maybe in some physical sciences it might be debatable. \n\nPeople spend their whole lives in academic disciplines accumulating evidence to support a worldview but everything is still debatable.",
            "title_similarity": "0.7373902",
            "sentiment_compound": 0.1071
        },
        {
            "id": "h93ipqv",
            "score": 1,
            "text": "If a point can be made with no facts or evidence then it can be rejected without facts.",
            "title_similarity": "0.53911066",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h93isqk",
            "score": 1,
            "text": "It's clever but we aren't always are of what will change our mind until we hear it.",
            "title_similarity": "0.5946592",
            "sentiment_compound": 0.25
        },
        {
            "id": "h93iuqc",
            "score": 1,
            "text": "You can’t convince someone to think like you even when evidence is provided or when they are at fault.",
            "title_similarity": "0.6189039",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h93ivgc",
            "score": 1,
            "text": "This way of approaching arguments assumes that everyone can determine the exact points where their beliefs are formed, everyone interprets what you perceive as \"evidence\" in the same way, and there is nothing to learn or teach from someone who doesn't fit this mold.\n\nI feel like a better \"one of the most important\" question to ask in the debate is where exactly to your believes diverge. Find your common ground, and find where your conclusions differ in the details, not just focusing on the overall thesis. When you do find differences, test hypotheticals. If you happened to take the counter argument as true, even if you presently believe it to be wrong, would you wind up with the same stance as the person you are talking too or visa versa? If yes then you can explore in more detail why you disagree at that point, if no then you can keep exploring. This comes after answering another important question which would be \"Am I willing to spend to time to know where the person I am talking to is coming from, instead of assuming from the start?\".",
            "title_similarity": "0.7156596",
            "sentiment_compound": -0.1967
        },
        {
            "id": "h93j0tx",
            "score": 1,
            "text": "I've started taking this stance when my friends are antivax. Not a single one of them has had an answer.  I ask them to set themselves a milestone / condition where it would be unreasonable not to take the vaccine. Haven't had any takers yet, but it sure shuts them up.",
            "title_similarity": "0.6687602",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h93j30a",
            "score": 1,
            "text": "What proof or evidence would it take to change your mind about this LPT?",
            "title_similarity": "0.6672876",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93j7dd",
            "score": 1,
            "text": "Actually, if you feel the person *wants* their view to be right instead of following evidence, just stop. It's a waste of time.",
            "title_similarity": "0.6313401",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h93j923",
            "score": 1,
            "text": "Had someone the other day, arguing about the Vaccine. They made some obviously inaccurate claims, so I grabbed my phone to look up accurate data. They stop me, saying \"you cant look it up online, you cant trust information from the internet.\"  Then where am I supposed to get information from to back up my argument? Where did you get your information from?",
            "title_similarity": "0.7296914",
            "sentiment_compound": -0.8677
        },
        {
            "id": "h93ja0e",
            "score": 1,
            "text": "This is the case for arguments in which your primary goal is to change the other person's opinion.  In modern social media times, most arguments are about convincing 3rd parties, not the other party to the argument.",
            "title_similarity": "0.6049321",
            "sentiment_compound": -0.6188
        },
        {
            "id": "h93jcns",
            "score": 1,
            "text": "I think more important is to constantly ask yourself this to stay intellectually honest.  For me, the more cocksure I am about my stance on something, the more red flags it raise about me to myself.  There are several pedagogical stances I have that I still keep seeking disconfirming evidence about.\n\nUnfortunately I don't think this LPT works well in reality on other people.  I think that logical people like the idea of this LPT, but also many of those people think they are more logical and wise than others and don't turn that skeptical eye inward enough.\n\nSacred cows are hard to let go of, but I think in many cases of internet style debate it's literally just both sides assuming they are in the right and they want to apply this LPT to the other person to \"win\" rather than specifically trying to apply it both ways. \n\nYeah, you might \"lose\" because the other person wasn't even arguing in good faith, but at least you might learn something along the way.\n\nI think it would help a ton with tribalism.  Be the change you want to see.",
            "title_similarity": "0.71268874",
            "sentiment_compound": 0.9849
        },
        {
            "id": "h93k0f5",
            "score": 2,
            "text": "What proof or evidence would it take to change your opinion that this is one of the most important questions you can ask in a debate?",
            "title_similarity": "0.82409704",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h93k1q0",
            "score": 1,
            "text": "This cannot be said enough and I should probably lead with this everytime. Haha",
            "title_similarity": "0.54682904",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h93kjdm",
            "score": 1,
            "text": "Sometimes its hard to know the exact evidence and rigor of evidence it would take to change your mind especially on complex things.",
            "title_similarity": "0.6444796",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h93km79",
            "score": 1,
            "text": "True LPT: start Fox News 2.0 and capitalize on it",
            "title_similarity": "0.4173993",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h93kpxp",
            "score": 3,
            "text": "I've often pondered what it would take for me to believe in God. The answer is I don't know. I feel like I would maybe know it when I experience it, but for something so intangible it's really hard to find a pulse on it. I don't *feel* like a dogmatic atheist, but reflecting on this question really makes me uneasy.",
            "title_similarity": "0.7169506",
            "sentiment_compound": -0.7352
        },
        {
            "id": "h93ksml",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.198361"
        },
        {
            "id": "h93kxrc",
            "score": 2,
            "text": "Trying to debate most people online is a waste of time. There are very few people who are knowledgeable enough to properly defend their opinions or emotionally mature enough to not get down in their feelings about things like politics, philosophy, or religion.",
            "title_similarity": "0.5781118",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h93l2mo",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.198361"
        },
        {
            "id": "h93lbfu",
            "score": 3,
            "text": "What if the question is to an atheist, what would prove that God exists to you?\n\nFor me, I'd say I don't know what would do it.\n\nIt's not disingenuous, I just don't know what would do it. But God should know right?",
            "title_similarity": "0.6610338",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h93lh28",
            "score": 1,
            "text": "I once argued with a MLM bro about how MLMs are scams and basically pyramid schemes. I sent him video proof, links to .gov reports, Forbes articles, documentaries, etc.\n\nAnd then I gave up and asked him what kind of proof he would accept and he basically said he won’t accept any kind of proof.",
            "title_similarity": "0.6777929",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h93lhn7",
            "score": 1,
            "text": "I use this method when discussing the 9/11 conspiracy with people. Sometimes faith trumps evidence.",
            "title_similarity": "0.5982636",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h93lrvr",
            "score": 1,
            "text": "I don’t know about debate but this is pretty much how scientific protocols and test procedures work. If your test passes that’s evidence for X. If the test fails either X is false or there was an issue with your test. Pass criteria must be determined beforehand.",
            "title_similarity": "0.679808",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h93lsz1",
            "score": 1,
            "text": "Real LPT: stop trying to change other people and focus on yourself.",
            "title_similarity": "0.506348",
            "sentiment_compound": -0.296
        },
        {
            "id": "h93ltys",
            "score": 1,
            "text": "I don't know how to answer that question and I've never met anybody else who would know how to answer that question.",
            "title_similarity": "0.3922494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93lvrv",
            "score": 1,
            "text": "I’ve been trying this exact thing but unfortunately all Republican “limits of evidence” are now a shiny set of portable goalposts.\n\nThere was a perfect example last year of a guy who asked what it would take to convince a person that Trump was a NeoNazi / white supremacist.\n\nThey went through words and phrases, rhetoric, social tactics, progression of turmoil, progression of aggression, economic tactics, behind the scenes manipulation, out and out fascist type tactics, gaslighting, the entire lugenpresse stuff, and the likelihood that Trump would openly try and steal the election (which he did), and finally the Republican moved the goalposts back to “you can’t call him a Nazi till he’s actually loading up trucks with the dead.”\n\nWell, hello coronavirus.",
            "title_similarity": "0.64450216",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h93lvxt",
            "score": 1,
            "text": "Hi, Mr. Nye! It's an honor to speak with you.",
            "title_similarity": "0.22191796",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h93m1c3",
            "score": 1,
            "text": "I wish it weren't a lie when they give an answer to this question, though. Most people will just deflect and call the proof biased or out right false.",
            "title_similarity": "0.7014433",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h93m6jl",
            "score": 3,
            "text": "\"Arguing with a fool proves there are two.\"",
            "title_similarity": "0.5434552",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h93m9cn",
            "score": 1,
            "text": "I often share what info it would take to change my mind early in my arguments.\n\nIf someone wants to convince me that being transgender isn't a mental illness, I need to know the scientific reason why the WHO said it's not, not simply because they said so witch is all I or the dozens of people I argue this with can find.",
            "title_similarity": "0.72302294",
            "sentiment_compound": -0.4373
        },
        {
            "id": "h93m9ou",
            "score": 1,
            "text": "Glad to hear some of the most brutal....",
            "title_similarity": "0.431356",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h93madl",
            "score": 1,
            "text": "Neil is an idiot who never straight up answers a question.  He's like most politicians.  He dances around questions.  He's also very entitled.",
            "title_similarity": "0.53739756",
            "sentiment_compound": -0.0188
        },
        {
            "id": "h93mry8",
            "score": 1,
            "text": "At one point in time, I would have told you that there was no argument or evidence that could have convinced me that god does not exist. As I am now an atheist, that was obviously not true.",
            "title_similarity": "0.58545375",
            "sentiment_compound": 0.5541
        },
        {
            "id": "h93mxsk",
            "score": 1,
            "text": "This is just a debate tactic to throw them off their train of thought and make yourself seem virtuous.",
            "title_similarity": "0.74392",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h93n16c",
            "score": 1,
            "text": "Also recognize that some things do not require a debate. And entertaining a debate of an undebateable topic will only land you in the weeds and you’ll lose because the side that’s fighting against logic will bring you into their world of facts and studies that mean nothing because it ignores common sense and reality.\n\nAlso never attack or mock their character. Stick to your arguments and that’s it. Sam Seder does this well. Watch his debate with Charlie Kirk at politicon for example.",
            "title_similarity": "0.7129289",
            "sentiment_compound": 0.4723
        },
        {
            "id": "h93n3qv",
            "score": 1,
            "text": "Based on my humble experience in argumenting long hours with my Mom, her go to question is: Are you stupid?!\n\nMy LPT: That's a trick question, don't make the same mistake like me and say yes or no...",
            "title_similarity": "0.6403799",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h93n88q",
            "score": 1,
            "text": "And be sure to loudly denounce them for being a hypocritical piece of shit. Assholes like that thrive on feeling like they got one over on someone else - deny them the satisfaction.",
            "title_similarity": "0.6452049",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h93nvzl",
            "score": 1,
            "text": "Once people are emotionally invested in an argument, they don't care about proof and evidence anymore. How many redditors give equal time to studying opposing viewpoints and really research statistics? It's about 0 - my old account was banned from most political forums for posting statistics.",
            "title_similarity": "0.6508042",
            "sentiment_compound": -0.798
        },
        {
            "id": "h93nybp",
            "score": 1,
            "text": "Literally science. Set the goal post ahead of time and LIVE WITH IT. Everyone else is the kind of person that flips a coin to make a decision and then changes their mind when they see the result.",
            "title_similarity": "0.6016835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93o60m",
            "score": 1,
            "text": "Trumptards won't like this.",
            "title_similarity": "0.56821966",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h93oj8q",
            "score": 1,
            "text": "Something I found helpful is to think if I'm arguing against someones intention or against the most convenient interpretation.",
            "title_similarity": "0.6073415",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h93onzh",
            "score": 1,
            "text": "Not all debates are about something verifiable or objective though.",
            "title_similarity": "0.41422984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93op8n",
            "score": 1,
            "text": "I wish I remembered this more often…",
            "title_similarity": "0.43835393",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h93p2ps",
            "score": 1,
            "text": "Asked an honest question as to why Gavin newsom should be recalled as governor. All i got was “have you seen the news? Are you serious ? Have you been in california the past year?@",
            "title_similarity": "0.34004304",
            "sentiment_compound": 0.5484
        },
        {
            "id": "h93pb02",
            "score": 1,
            "text": "Some issues are a matter of values and preferences. Facts won't have an impact on those specifically.",
            "title_similarity": "0.4696101",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h93phlt",
            "score": 1,
            "text": "Just want to throw it out that sometimes it's more important for the people watching to see your message than to change the opinion of the one you're talking too.",
            "title_similarity": "0.72213596",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h93pibw",
            "score": 1,
            "text": "I wonder if I were to cross post this to r/conservative how fast would it be taken down?",
            "title_similarity": "0.631147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93piwx",
            "score": 1,
            "text": "I've also tried asking hypothetical conditions to which they say that condition would never exist so it's not worth arguing about.\n\nDone with the conversation.",
            "title_similarity": "0.68286216",
            "sentiment_compound": 0.1407
        },
        {
            "id": "h93prq2",
            "score": 1,
            "text": "or “don’t argue with stupid people” for short",
            "title_similarity": "0.44641307",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h93pxyx",
            "score": 1,
            "text": "Are you trying to kill reddit?",
            "title_similarity": "0.52304125",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h93qinh",
            "score": 1,
            "text": "I've also found that trying to identify the shared base of facts you can build on, implicitly or explicitly, can save you a lot of time arguing with people who don't accept your fundamental premise.",
            "title_similarity": "0.7533827",
            "sentiment_compound": 0.1068
        },
        {
            "id": "h93qr9s",
            "score": 1,
            "text": "Depending on the forum. If you can debate well and provide sources in a public forum, you can sway others that are watching.",
            "title_similarity": "0.59297884",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h93qtqq",
            "score": 1,
            "text": "Not that easy, sometimes some mfer comes in and throws a random study to support his argument. A SINGLE ONE.\n\nSo I have to go dig up like 10 who say the contrary. And nothing is done.\n\n\"Evidence\" isn't that easy. Especially not in the mids of a replicability crisis in science.",
            "title_similarity": "0.6051469",
            "sentiment_compound": -0.7361
        },
        {
            "id": "h93qxas",
            "score": 1,
            "text": "Father in law… believes shit that has been disproven since the 70’s when he was in high school. Didn’t finish high school and thinks scientists and journalists are all liars. Doesn’t trust anyone except his own brain and what he already believes. Eventually you realize you’re arguing with an imbecile that resorts to personal insults, racism, sexism, yelling, and boomer humor if he doesn’t have a retort. \n\nWhat proof would it take to change his mind? Nothing. He already knows everything and he’s obviously always right. Show him any studies or articles you want, he’s never budging.",
            "title_similarity": "0.6804236",
            "sentiment_compound": -0.9371
        },
        {
            "id": "h93r5ol",
            "score": 1,
            "text": "What fact would change your mind.\n\nIf history was different",
            "title_similarity": "0.607252",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93rbdg",
            "score": 1,
            "text": "If i knew what would change my mind, i would have already done so...\n\nimo friendly debate is about offering perspective to others that they may not have encountered [and therefore could not have offered as a 'mind-changing piece of evidence'].",
            "title_similarity": "0.69751686",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h93rnms",
            "score": 1,
            "text": "this is dumb. if you quit, the other person wins",
            "title_similarity": "0.4806964",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h93rvx4",
            "score": 1,
            "text": "Recently read a book called \"Think Again\" that talks about this. A good read if you're interested",
            "title_similarity": "0.4380524",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h93rz8y",
            "score": 1,
            "text": "That's great as long as you can walk away from that person and never see them again. Doesn't work so well with colleagues and relatives.",
            "title_similarity": "0.5034621",
            "sentiment_compound": 0.7809
        },
        {
            "id": "h93s052",
            "score": 1,
            "text": "Also, people often don't seek knowledge but are seeking power or an ego boost.",
            "title_similarity": "0.51874256",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h93sjwb",
            "score": 1,
            "text": "Debate isn't about convincing your opponent, it's about convincing everyone else.",
            "title_similarity": "0.6147465",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h93so1l",
            "score": 1,
            "text": "But I like arguing!!!",
            "title_similarity": "0.50936985",
            "sentiment_compound": -0.3871
        },
        {
            "id": "h93sqkr",
            "score": 1,
            "text": "That's fine, but you should know the answer yourself as well. Lots of debates are on things that aren't completely black and white, after all. You just have a favorite side that you are familiar with. Take the arguments about whether certain behavior might be genetic or environmentally induced, nature or nurture. There are studies that can back either claim. How would you provide unequivocal evidence for your side that doesn't actually amount to lack of familiarity with the other side?",
            "title_similarity": "0.7628926",
            "sentiment_compound": 0.743
        },
        {
            "id": "h93syfm",
            "score": 1,
            "text": "What evidence would you need to see to change your mind that Biden is a mumbling buffoon?\n\n*[quietly loads up a clip of Biden speaking in public]*\n\nOkay, I’ve seen enough.",
            "title_similarity": "0.7104672",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h93th00",
            "score": 1,
            "text": "This only applies to extremely narrow informal conversation types, and definitely does not apply to a formal debate. There's no evidence that can change a person's mind if they're arguing something cut and dry. \"what evidence can convince you the earth isn't round?\" etc. And don't tell me this is an exception because you know people believe stupid shit like that and you know they'll try to convince you of it.",
            "title_similarity": "0.654534",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h93tsfn",
            "score": 1,
            "text": "I wish it were that easy though, lol. Evidence alone can be disputed in terms of credibility, wording, and legitimacy very often. Not only this though, also the timing and the context of the evidence.",
            "title_similarity": "0.6889589",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h93u5lv",
            "score": 1,
            "text": "As a wise man once said, don't argue with stupid people because they will beat you with experience",
            "title_similarity": "0.65093446",
            "sentiment_compound": 0.7853
        },
        {
            "id": "h93u8ji",
            "score": 3,
            "text": "This is a great way to completely shift the parameters of the debate into someone else’s advantage. Any smart person will make the new criteria either impossible to reach, or the smart thing would be for them to say “nothing”. Someone who doesn’t immediately play by your rules isn’t someone you need to stop debating with - in fact it’s more rewarding to continue debating with someone who can put up a good fight. More rewarding and maybe you learn something. A successful debater or negotiator will make sure they establish the grounds by which they can win or change minds.",
            "title_similarity": "0.7567916",
            "sentiment_compound": 0.9824
        },
        {
            "id": "h93uoud",
            "score": 1,
            "text": "Additionally, while you may not convince the person you are talking with, you may convince others with your sources.",
            "title_similarity": "0.4927975",
            "sentiment_compound": 0.067
        },
        {
            "id": "h93uqg2",
            "score": 1,
            "text": "Their response: “why should I have to do your arguing for you??”\n\nHard to come back from that",
            "title_similarity": "0.8184814",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h93uriz",
            "score": 1,
            "text": "What proof would it take to change your mind about whether it’s a waste of time to argue with a person who can’t accept your evidence?",
            "title_similarity": "0.7393499",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h93v0kf",
            "score": 1,
            "text": "This only works if they can't turn the question around on you. You need to be able to immediately answer the question if you ask and they say \"you tell me first\".",
            "title_similarity": "0.6848787",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93v8s1",
            "score": 1,
            "text": "I think an honest answer would probably be: being exposed to 3-5 times where a reputable source disconfirms my worldview.   Most people won't change their mind based on one piece of info, nor will they change their minds in real time.   Each example that calls someone's worldview into question is a slow burning buildup until one day, what seems like a single thing \"suddenly\" changes their mind.",
            "title_similarity": "0.5565895",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h93vot9",
            "score": 2,
            "text": "Or maybe the other person is right?... It's like me asking what sort of proof you'd need to accept that covid is a hoax. This doesn't work in practice.",
            "title_similarity": "0.69974595",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h93vwb0",
            "score": 1,
            "text": "\"Every time I argue with a fool I lose.\"\n-Imam Ali",
            "title_similarity": "0.6312642",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h93vwix",
            "score": 1,
            "text": "This sort of misses the point of arguing a lot of times. You're never going to change the mind of someone opinionated who you're in a debate with. You're winning the minds of the audience.",
            "title_similarity": "0.57189703",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h93w7a5",
            "score": 1,
            "text": "Omfg this!!!! THIS!!!!!!!!",
            "title_similarity": "0.27896538",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93whue",
            "score": 1,
            "text": "I'll make this easy for all these LPT makers. Most people are not worth the bother. It doesn't matter who it is. No offense OP.",
            "title_similarity": "0.43153554",
            "sentiment_compound": 0.6609
        },
        {
            "id": "h93wq9f",
            "score": 1,
            "text": "OP, what would it take to convince you that this isn’t true?",
            "title_similarity": "0.64665186",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h93wu08",
            "score": 1,
            "text": "What evidence do you have that that is the most important question?",
            "title_similarity": "0.62999535",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h93wvhi",
            "score": 1,
            "text": "The #1 problem with this is that people can lie. And they will lie, without even meaning to.\n\nThe response to this will almost always be something like “facts and evidence”. But people don’t ever really want that. They want affirmation of what they believe already. I know there are exceptions, but typically if you have to ask someone this question.. you’re going to end up arguing to a wall.",
            "title_similarity": "0.7812676",
            "sentiment_compound": -0.4138
        },
        {
            "id": "h93wwy7",
            "score": 1,
            "text": "Or, if they give you an evidence requirement specifically designed to be physically impossible too lol\n\n\"Prove to me the Earth is round by getting into an orbit, bet you can't do that!\"",
            "title_similarity": "0.61518097",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h93wyut",
            "score": 1,
            "text": "Oh, you've met my mother!",
            "title_similarity": "0.20105574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93x16s",
            "score": 1,
            "text": "What if I just don't know what evidence would convince me? What if I just need enough evidence to reasonably justify belief in the matter?",
            "title_similarity": "0.6613715",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h93xh9x",
            "score": 1,
            "text": "My favorite version of this is a series of two questions:\n\n1. If you were wrong, would you like to know?\n2. If so, how would you like to find out?",
            "title_similarity": "0.6623893",
            "sentiment_compound": 0.644
        },
        {
            "id": "h93xrqg",
            "score": 1,
            "text": "Every arguement with a liberal",
            "title_similarity": "0.3923475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93y9no",
            "score": 1,
            "text": "This makes me think of the Chappelle Show courtroom episode about R. Kelly",
            "title_similarity": "0.36967644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93yfgk",
            "score": 1,
            "text": "Also, what if you are wrong? Are you willing to except the consequences?\n\nPerfect example: Climate change. \n\nI believe in climate change so if I’m wrong we’re off fossil fuel and green renewable energy is king and sustainable living is the norm. \n\nIf you’re wrong you children are going to suffer and most costal cities will in 8 feet of water, food shortages, mass migration, riots, horrible summers and super storms.",
            "title_similarity": "0.62254775",
            "sentiment_compound": -0.9027
        },
        {
            "id": "h93ygrh",
            "score": 1,
            "text": "Maybe not in a debate setting but how about 'if you were wrong, would you want to know?'",
            "title_similarity": "0.63990897",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h93yh5k",
            "score": 1,
            "text": "tbh this only works if the assumption is one is actually trying to sway the other.\n\nif it's just an argumentative person, or someone like me who uses it as a way to waste time and likely would be one of those people you'd go \"well, fuck this discussion then, it's talking to a brick wall!\"\n\nisn't really that useful for them.\n\nedit: just used something as a reply, debate/arguments don't need to be a zero sum game, where one side wins and the other side loses. just because they might not concede their point doesn't mean the thing loses any and all value because there's no longer a 'win' condition for you.  \n\n\nedit 2: for this same reason, work well with degrasse tyson, because often as a specialist in a highly scientific field, he's not getting the usual sort of debates, he's getting people who believe weird shit essentially trying to shout him down, so this is less about sort of just utterly dismissing 'bad' discussions, this is about weeding out the kind of people who do want info and do want to learn potentially, and people that are there to just bash his points of view on something.\n\n&#x200B;\n\nthat's not usually the same sort of situation with two randos who both might not know what the fuck they're talking about, and neither actually knows any 'real' evidence that would convince the other... also, potentialy hard to know what info will sway someone, and what would sway you. and the info might not even be out there, really.",
            "title_similarity": "0.731693",
            "sentiment_compound": -0.9059
        },
        {
            "id": "h93yjsl",
            "score": 1,
            "text": "Sadly, I only came to this realization recently. Hopefully this helps me avoid furniture rounds with people who don’t like your answer, claim it’s not an answer, and are just there to quarrel. Time-wasters.",
            "title_similarity": "0.6685944",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h93yw56",
            "score": 1,
            "text": "I do not agree. People take multiple interactions with an opposing viewpoint to change their mind. Odds are you're not gonna be the straw that breaks the camel's back. Your goal is solely to present a solid argument for them to mull over consciously and subconsciously over the next period of time. You are not going to convince them in the present. If you can accept that and enjoy the process of debating with this mindset, you'll be more productive I think",
            "title_similarity": "0.7666608",
            "sentiment_compound": 0.2617
        },
        {
            "id": "h93z2wc",
            "score": 1,
            "text": "The answer to this is almost always personal experience or seeing stuff with your own eyes. That’s why it seem’s like theres such a huge disconnect between some political ideologies. \n\nHonestly 99% of discourse about topics that actually affect people irl on this site is in bad faith. I see a lot of “I didn’t care about your race/gender/identity until you tried shoving it down my throat” and I saw that mocked too. People on here would rather believe thats some made up strawmen than actually try to understand whatever underlying point their opposition is trying to make.\n\nHonestly the best question to ask is “Why do you think that” so you can decipher their values and how they look at the world and then continue from there. If someone believes the US is a meritocracy and systemic oppression doesn’t exist, the answer to the question you’d ask them would probably be “Laws that explicitly discriminate against race/sexuality/religion/gender”. And guess what, there aren’t a lot of explicitly xenophobic laws so your discussion kinda ended right there. By finding out their values you might be able to take it a step further in the debate.",
            "title_similarity": "0.7187033",
            "sentiment_compound": 0.9648
        },
        {
            "id": "h93zb9l",
            "score": 1,
            "text": "I prefer to just let myself get frustrated by their stupidity and let it evolve into straight malicious anger because i don't know how to handle my emotions at 32 years old and suffer from severe anger outburts but the anger kinda makes me feel good so idk what to think",
            "title_similarity": "0.6888789",
            "sentiment_compound": -0.9177
        },
        {
            "id": "h93zfws",
            "score": 1,
            "text": "Another is: \"what argument/proof against your case you find most compelling\". \nWhich you yourself can use to debate your case by starting to go through the strongest argument against your position and then debating it. Not only does it provide good chunk to debate but it also strengthens your position as you show how you have thought about counter arguments and step little bit towards them and their arguments. A gesture of offering bit of ground.",
            "title_similarity": "0.81055266",
            "sentiment_compound": -0.0909
        },
        {
            "id": "h93zna3",
            "score": 1,
            "text": "I'm going to frame a picture of this on my wall.",
            "title_similarity": "0.25260141",
            "sentiment_compound": 0.0
        },
        {
            "id": "h93zrr1",
            "score": 1,
            "text": "In a perfect world, yes, but people will often continue to move the goalposts after you've provided the proof they require.",
            "title_similarity": "0.48907092",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9402gg",
            "score": 1,
            "text": "I picture this debate.\n\n&#x200B;\n\nOne person says there side.\n\nThe other says, hey why don't you tell me what I need to say to get you to change to my side.\n\n&#x200B;\n\nDebate won!",
            "title_similarity": "0.75972223",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h940ei7",
            "score": 1,
            "text": "You should then ask yourself the same thing.\n\nTake the \"argument\" out of it, call it a discussion. Calling it an argument to me means that you are already not going to change your mind.",
            "title_similarity": "0.6521321",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h940tql",
            "score": 1,
            "text": "This assumes the other party is being honest and won’t change the goalposts on you. \n\nI’ve lost track how many times that happened to me. \n\nYou provide the exact evidence they ask for, they them dismiss it and find some other lame excuse.",
            "title_similarity": "0.59636724",
            "sentiment_compound": 0.296
        },
        {
            "id": "h940yny",
            "score": 1,
            "text": "Assuming that your use of the word \"arguing\" falls into the philosophical sense as opposed to the \"let's fight\" sense, then I disagree. A civil disagreement involving 2 or more people who respect one another can result in a healthy exchange of ideas, information, viewpoints, and so on. \n\nAnd while it's rare for one party to full change the mind of another, incremental steps are also quite meaningful. OP seems to believe that any disagreement is either valid or invalid, and I believe this to be a false dichotomy.\n\nInstead of Degrasse Tyson, I'm more inclined toward Dale Carnegie who wrote, \"You can't win an argument. You can't because if you lose it, you lose it; and if you win it, you lose it.\" His latter point means that, even if you \"win\" an argument against someone, you nonetheless lose because you have failed at convincing them of your point. All you've accomplished is making them resent you. This is legit advice. \n\nSo the best way to proceed is not to engage in a battle of wits or any other intellectual confrontation. Instead, gain the confidence of the person with whom you disagree, casually exlain to them why you believe what you believe, and hope that they'll join you. But don't presume that they will. Either way, don't let it upset you. Accept the fact that this world is full of people who will never agree with you, and that's fine.",
            "title_similarity": "0.6889907",
            "sentiment_compound": 0.8454
        },
        {
            "id": "h941b6j",
            "score": 1,
            "text": "100% agree. One little bit to add, finding a solid answer to this question makes someone have to actually think in a different mode. They might get an answer to you easily as you might expect. The purpose of any conversation/debate, in my opinion, is to negotiate an ideological compromise, thus patience is very helpful.",
            "title_similarity": "0.67999375",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h941cnq",
            "score": 1,
            "text": "What proof or evidence would you accept that this is a really bad argumentative tactic which dishonestly tries to trick the other person into making your argument for you and when they refuse allows you to falsely declare victory without actually having to argue or prove anything?",
            "title_similarity": "0.71847117",
            "sentiment_compound": -0.8826
        },
        {
            "id": "h941omz",
            "score": 1,
            "text": "At the end of the Ken Ham/Bill Nye debate in 2014, the moderator asked what, if anything, would change their minds. Ken Ham said “nothing” and Bill Nye said “evidence.”  To me, that was the greatest argument of the entire debate. What greater example of inherent bias can there be?",
            "title_similarity": "0.74851537",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h941pqy",
            "score": 1,
            "text": "I can't resist posting Matt Dillahunty's answer to this question. Slightly paraphrased, because I don't remember it word for word:\n\nThe existence of a god is such a *stupedously* extraordinary claim that I can't think of any evidence that would be strong enough to convince me of it. But! If there is a god, then *that god* knows what evidence would convince me and has chosen not to provide me with that evidence. Therefore, gods either don't exist or *don't want me to know* that they exist. Either way: not my problem.",
            "title_similarity": "0.70163107",
            "sentiment_compound": 0.916
        },
        {
            "id": "h9422vu",
            "score": 1,
            "text": "this is what i realized talking to my dad this weekend over issues i've had with this behavior since forever. he couldnt give me an answer as to what could change his mind and basically said its my problem to deal with the way he effected me since all my life since he is perfect so ye",
            "title_similarity": "0.5626141",
            "sentiment_compound": 0.25
        },
        {
            "id": "h942eaa",
            "score": 1,
            "text": "What proof could I give you so that you would believe you don’t exist? Conversation over",
            "title_similarity": "0.66490364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h942egb",
            "score": 1,
            "text": "never argue with anyone. Discussion should be a mutual exploration of ideas, if it's an argument, you've both already lost and are just wasting time and effort.",
            "title_similarity": "0.594507",
            "sentiment_compound": -0.552
        },
        {
            "id": "h942fw9",
            "score": 1,
            "text": "Also a very common sales tactic.\n\n“What would it take for you to accept this offer?”",
            "title_similarity": "0.5089736",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h942qth",
            "score": 1,
            "text": "That is a terrible question to ask in a debate, if you have evidence then present it if you don't have evidence it is not up to your interlocutor to provide it for you.",
            "title_similarity": "0.75251496",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h943c64",
            "score": 1,
            "text": "Fine, what proof would it take to change your mind on Trump being garbage?\n\nGo for it. Think of something. If you support him then just put yourself in someone else's shoes since you should learn to do that too.",
            "title_similarity": "0.75020957",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h943gkk",
            "score": 1,
            "text": "I'm an archaeologist and can confirm that even if you give people evidence, a lot of people just like their own narrative.",
            "title_similarity": "0.47023696",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h943jai",
            "score": 1,
            "text": "A few years ago I asked my step dad what could prove climate change to him and he said nothing. I should have stopped arguing with him and my mom after that, but I kept doing it, and recently quit after we had a huge fight January 6th. Good news is that after I stopped arguing, it’s been much nicer. In older age, I realized I don’t always have to be right.",
            "title_similarity": "0.5671031",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h943oju",
            "score": 1,
            "text": "A step before that, are you willing to be convinced?",
            "title_similarity": "0.48623094",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h943s98",
            "score": 1,
            "text": "You just described every religious person ever.",
            "title_similarity": "0.25969696",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9440cs",
            "score": 1,
            "text": "Learn to recognize when someone is arguing in bad faith. If they're just arguing to argue then there's no point in continuing. If they're attacking you personally then there's no need to continue. If they're not willing to listen then stop trying to convince them. I'm practicing this currently abd it has saved me a lot of frustration.\n\nAlso sometimes we all get too emotional in an argument and sometimes we all argue just because we want to argue. Recognize that and stop it.",
            "title_similarity": "0.77407384",
            "sentiment_compound": -0.9705
        },
        {
            "id": "h9441da",
            "score": 1,
            "text": "A good LPT which sadly can be turned on its head too easily. I know a lot of very stupid people who ask me this, and when I say, \"any credible evidence\" they point to their face-memes and OAN articles and say, well I gave you real evidence and you still won't change your mind so you're just crazy.",
            "title_similarity": "0.6686381",
            "sentiment_compound": -0.4131
        },
        {
            "id": "h944834",
            "score": 1,
            "text": "Easier said than done. I am borderline atheistic, and if someone asked me as to what evidence would make me believe in God, I am not sure if I could provide an earnest answer.",
            "title_similarity": "0.6649378",
            "sentiment_compound": 0.7382
        },
        {
            "id": "h944oni",
            "score": 1,
            "text": "Right, because everyone in an argument keeps a detailed list of exactly what things would change their mind.\n\nI swear to God, it's like none of you on this site have ever actually interacted with a human being before.",
            "title_similarity": "0.53332937",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h944wsp",
            "score": 1,
            "text": "Before you ask this, ask yourself the same question.",
            "title_similarity": "0.4670176",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9451vi",
            "score": 1,
            "text": "What proof would I need to be convinced there's a god?\n\nShit I honestly don't know. If a god appeared to me, I'd think I was losing my mind. If not, I still would have no way of knowing it's really what it says it is.",
            "title_similarity": "0.65210146",
            "sentiment_compound": 0.128
        },
        {
            "id": "h945h31",
            "score": 1,
            "text": "So true.. its a shame some people are impossible to argue with.",
            "title_similarity": "0.43243885",
            "sentiment_compound": -0.3415
        },
        {
            "id": "h945m1b",
            "score": 1,
            "text": "Thank you for this reminder. I've started informing family members they have two choices. Get vaccinated in preparation of the arrival of our baby OR be prepared to meet him when he's a bit older. I'm met with near-violence. No amount of information will make them be vaccinated.... And while I'm sad, I can only do what's within my power.",
            "title_similarity": "0.6501256",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h945r90",
            "score": 1,
            "text": "Also, \"from whom would you accept such evidence?\" If they're not going to at least listen to peer reviewed research, then don't waste your time.",
            "title_similarity": "0.68238974",
            "sentiment_compound": 0.6036
        },
        {
            "id": "h945xwq",
            "score": 1,
            "text": "You should quit a long time ago though. You will never convince anyone you’re right especially on the internet so why try? Seriously.",
            "title_similarity": "0.66870546",
            "sentiment_compound": -0.4027
        },
        {
            "id": "h946ghe",
            "score": 1,
            "text": "Silly. “What proof or evidence would it take to change your opinion that you are not a goat?”",
            "title_similarity": "0.5902812",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h946haa",
            "score": 1,
            "text": "Well isn't that a logical fallacy though? How are you supposed to know what evidence will change your mind? I also don't think any one piece of evidence should change someone's mind. The whole point of researching a topic is to weigh multiple pieces of evidence and come to a conclusion yourself.",
            "title_similarity": "0.7637391",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h946m1b",
            "score": 1,
            "text": "I don't agree with you. What kind of proof would it take to change your mind?",
            "title_similarity": "0.6956314",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h947h6z",
            "score": 1,
            "text": "This is principle of falsifiability in epistemology / philosophy of science",
            "title_similarity": "0.6039691",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9489wi",
            "score": 1,
            "text": "Also be careful, evidence that may be convincing to you, might not be for others.",
            "title_similarity": "0.5157231",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h948i2r",
            "score": 1,
            "text": "I'm of the opinion that you don't know what you don't know. How can I tell somebody what will convince me? If I had that information then my opinion would probably be swayed already.",
            "title_similarity": "0.72702193",
            "sentiment_compound": 0.25
        },
        {
            "id": "h948r48",
            "score": 1,
            "text": "What evidence can you put forward which indicates that all existence, down to the molecular and atomic arrangement, just happen to exist one day, without a maker? How the fabric of physics keep stable, and not just tear apart? How space works, time works, how mass bends space, how does all that just exist?\n\nIf you can explain how, then what about the Why of it?",
            "title_similarity": "0.43735582",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h949jlw",
            "score": 1,
            "text": "If I’m arguing that 2 + 2 = 4, and you ask me that question, I won’t be able to give you an answer. It’s going to be the same if I’m arguing climate change is real or the risk:benefit of vaccines is worth it or all sorts of things. \nI mean, you’re right. This is an accurate predictor that you’re wasting your time arguing with me - I won’t change my mind. I’m just saying, that’s not because I’m stubbornly wrong.",
            "title_similarity": "0.7167225",
            "sentiment_compound": -0.8971
        },
        {
            "id": "h94a1ul",
            "score": 1,
            "text": "It saves so much time, and it's a question you should be asking yourself all the time anyway. So many people don't even understand what they value, and even less understand why they value it in the first place.",
            "title_similarity": "0.65735024",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h94ab88",
            "score": 1,
            "text": "I don't think “What proof or evidence would it take to change your mind/opinion?” is the right question to ask. A better question would be \"Would you ever change your mind/opinion if you were shown sufficient evidence?\"\n\nIt's entirely possible that they don't know what kind of evidence would convince them. If they did, they would already be looking for it. As long as they're open to the possibility of evidence, they're still worth talking to.",
            "title_similarity": "0.7621622",
            "sentiment_compound": 0.7319
        },
        {
            "id": "h94agok",
            "score": 1,
            "text": "The only thing that will change many peoples minds is pain.  The problem is that we don’t allow society to inflict the pain.  \n\nFor instance, with covid those who go to the hospital after refusing a vaccine and if able to have the vaccine should be refused help.  Until they feel that pain and understand the consequences they will never learn.  \n\nThat’s not to say they everything has to be that strict but there is a point at which the rest of us shouldn’t continue to pay for the inability of some to act in the interest of society as a whole.",
            "title_similarity": "0.7258338",
            "sentiment_compound": -0.765
        },
        {
            "id": "h94ak9y",
            "score": 3,
            "text": "I don't really agree at all. People don't understand the purpose of debate. It's not to change the other person's mind. It's to present your understanding of something to someone who opposes it and defend your own position. In doing so you learn way more about the topic than you would otherwise. It's a shame people jsut don't seem to get it.",
            "title_similarity": "0.7347347",
            "sentiment_compound": -0.6627
        },
        {
            "id": "h94aotw",
            "score": 2,
            "text": "hmm... interesting, okay, let's try that. I'll take the position of someone that is arguing your post is wrong, and is not an important nor helpful question, so I want to convince you of the same, so I ask:\n\n“What proof or evidence would it take to change your mind/opinion?”\n\nWhat would your response be?",
            "title_similarity": "0.8368145",
            "sentiment_compound": -0.4949
        },
        {
            "id": "h94atqw",
            "score": 1,
            "text": "This LPT is so spot on truth it’s scary 👌",
            "title_similarity": "0.5064145",
            "sentiment_compound": 0.6701
        },
        {
            "id": "h94atzh",
            "score": 1,
            "text": "I have the theological debate constantly and when I'm asked what evidence would I accept to show a God exists. I always say \"I don't know, but if a God exists he absolutely knows what it would to take to change my mind and he's yet to do it.\"\n\nI honestly don't know what will change my mind, but if the evidence ever leads me there I'll follow it, I'd be compelled to.",
            "title_similarity": "0.7761239",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h94b0i6",
            "score": 1,
            "text": "What fucked up shit.",
            "title_similarity": "0.36416593",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h94b6u9",
            "score": 1,
            "text": "If your opponent doesn't give you the answer to what would defeat him, he's wrong and you should disregard him. Got it.",
            "title_similarity": "0.7446439",
            "sentiment_compound": -0.802
        },
        {
            "id": "h94bhv1",
            "score": 1,
            "text": "Another LPT - if you think you’re never wrong in arguments you might be as equally emotionally convinced of certain things as those you argue with.",
            "title_similarity": "0.5331676",
            "sentiment_compound": 0.7361
        },
        {
            "id": "h94bpo3",
            "score": 1,
            "text": "Debating people in public like on reddit isn't necessarily to change the opponent's mind, but to provide countering viewpoints to the observers which that are more of.",
            "title_similarity": "0.7028297",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h94ci6z",
            "score": 1,
            "text": "*sniff sniff* Smells like American politics",
            "title_similarity": "0.47212213",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h94efn6",
            "score": 1,
            "text": "Usually I'll straight up tell people what evidence it would take to convince me, because if I'm wrong, I wanna know!",
            "title_similarity": "0.78017473",
            "sentiment_compound": -0.126
        },
        {
            "id": "h94egiv",
            "score": 2,
            "text": "We all know what this is referring to. 😷🦠",
            "title_similarity": "0.16931963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94fc5l",
            "score": 1,
            "text": "Yep, this is one of my go to.\n\nThe usual response is \"I'll know it when I see it\"\n\nWhich allows me to check mate with \"great, get back to me when you see it, then you will know it and you can let me know and I can provide it for you...I can't do my job unless you do your job and you don't want me to do your job for you because you would consider that *socialism*\"",
            "title_similarity": "0.6334059",
            "sentiment_compound": 0.7251
        },
        {
            "id": "h94fqu0",
            "score": 1,
            "text": "\" I could agree with you, but then we'd both be wrong \"",
            "title_similarity": "0.5797281",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h94fzac",
            "score": 1,
            "text": "Reminds me of that Dave Chappell skit",
            "title_similarity": "0.3272578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94gtlg",
            "score": 1,
            "text": "I did this with someone yesterday (it was online) and they just said “I don’t believe you because you’re a liar”. I was the one who had evidence and they didn’t. I just told them that it looks like no matter what evidence I provide they’ll just keep ignoring everything and calling me a liar so I’ll no longer reply to them. Some people can be so immature.",
            "title_similarity": "0.64410144",
            "sentiment_compound": -0.7229
        },
        {
            "id": "h94h3fh",
            "score": 1,
            "text": "Never argue with stupid people; they don’t/won’t know when they’ve lost…",
            "title_similarity": "0.47915795",
            "sentiment_compound": 0.5875
        },
        {
            "id": "h94h8qr",
            "score": 1,
            "text": "I wish people would ask me this so they stop wasting my time with half baked arguments",
            "title_similarity": "0.6748539",
            "sentiment_compound": -0.6643
        },
        {
            "id": "h94hfkp",
            "score": 1,
            "text": "You mean Neil DeGrasse Tyson, the anti-vegan dogmatist?",
            "title_similarity": "0.62353855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94hmgl",
            "score": 1,
            "text": "Can't believe this got over 40k upvotes.  It's terrible.\n\nIt's up to you to come up with your own evidence.  This question abdicates that responsibility and attempts to make your interlocutor responsible for making your argument for you.  \n\nThe correct response to this is \"I'm not sure, what you got?\" and throw it back to you.",
            "title_similarity": "0.7722652",
            "sentiment_compound": -0.6442
        },
        {
            "id": "h94i9zy",
            "score": 2,
            "text": "Yea i get it but also had a flat earther ask me exactly this. I said id need to be launched into space.  He deflected and just started spewing random youtube “facts”",
            "title_similarity": "0.5081538",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h94il8v",
            "score": 2,
            "text": "What if they hit you with the same pro tip",
            "title_similarity": "0.4378174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94j2n2",
            "score": 1,
            "text": "Theyre being ignorants and its better if they live with their head shoved deep in their sorry ass, then trying to have discussion with idiots.\n\nEspeciALLY if its well known general truth, theyre just making themselves look INSANE for no reason!",
            "title_similarity": "0.68038535",
            "sentiment_compound": -0.4873
        },
        {
            "id": "h94j914",
            "score": 1,
            "text": "I understand the general idea of this, that somebody who wouldn’t change their mind isn’t worth debating with. That being said, this is stupid because it implies your intent of debate is to change somebody else’s opinion. The purpose of debate should be to understand others and come to a truth. If you ask this question you are also an a hole, an a hole pretending to be an intellectual.",
            "title_similarity": "0.8284129",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h94ju6u",
            "score": 1,
            "text": "I don’t argue for them. I argue for the undecided people watching.",
            "title_similarity": "0.56424284",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h94k3e7",
            "score": 1,
            "text": "It is half stupid. E.g. what kind of evidence will persuade you that 1 + 1 = 3.5 ?\nHave no idea, this is just wrong",
            "title_similarity": "0.6151447",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h94k91o",
            "score": 2,
            "text": "You should ask yourself this question too",
            "title_similarity": "0.51957595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94l4c2",
            "score": 2,
            "text": "Do this with the wife now. After 10+ years of trying to figure her out I got an idea. Just ask how to make something better. And when told I don't know, simply reply well when you know you can tell me",
            "title_similarity": "0.42506772",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h94l549",
            "score": 2,
            "text": "Trying to initiate self reflection is always the right way to proper change",
            "title_similarity": "0.4959281",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94lgby",
            "score": 1,
            "text": "This seems like really good advise.\n\nI’d try this when “debating” the covid vaccine with a friend of mine but I feel no matter what evidence I put in front of them it would make no difference to their view so yeah, I guess I’m wasting my time.",
            "title_similarity": "0.74909437",
            "sentiment_compound": 0.3149
        },
        {
            "id": "h94ljri",
            "score": 1,
            "text": "Best. Advice. Ever.",
            "title_similarity": "0.21093023",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h94lwdu",
            "score": 1,
            "text": "That's only of your goal is to \"win\", or change someone's mind. If you goals is to simply express your viewpoint and get to understand another's, an arguement or debate can be had in many ways",
            "title_similarity": "0.69603586",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h94mkv1",
            "score": 1,
            "text": "What would change my mind? Simple. If you got dwane \"the rock\" Johnson to come and sign my tits. Not sure what it would have to do with the debate, but it sure would make me like whatever you're trying to tell me",
            "title_similarity": "0.6679659",
            "sentiment_compound": 0.645
        },
        {
            "id": "h94mohm",
            "score": 1,
            "text": "Debates don't change people's minds. They're done for spectacle. It's just a dunk show for whoever's watching. More than 50% of the time you're just going to end up retrenching the other person in their beliefs.",
            "title_similarity": "0.37839222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94ndxk",
            "score": 1,
            "text": "Most of Reddit ignores this rule, refuses to acknowledge it or instantly moved the goal post after conditions have been met.",
            "title_similarity": "0.5151123",
            "sentiment_compound": -0.3321
        },
        {
            "id": "h94npev",
            "score": 1,
            "text": "Sounds good in theory doesn’t really work too well in many debates in practice.",
            "title_similarity": "0.5320897",
            "sentiment_compound": 0.6444
        },
        {
            "id": "h94oyll",
            "score": 1,
            "text": "It's not every debate's point to change the opinions of others",
            "title_similarity": "0.4111546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94p6zy",
            "score": 1,
            "text": "That seems like a foolish approach. People who have unsubstantiated opinions are highly reactive and defensive, so saying something directly like this has little chance of success. \n\nPlus, this approach begs the conclusion a bit as well. So, this works in terms of some social situations, and to determine the kinds of people who actually lack the capacity to 'think about their thinking'. \n\nI do find a lot of people claiming they are \"rational\" are not being rational at all, but claiming rationality as the basis for their unsubstantiated beliefs nearly as much as people with \"crazy ideas\" like flat-earthers, anti-vaxxers and the like. This LPT seems to be in that self-righteous category. \n\nFinally, nearly all representative realities break down in the face of a lot of evidence. Physical reality breaks down into a cloud of probabilities right at the moment it also becomes counter-intuitive. Much of what we demand as \"evidence\" is on the intuitive side of the picture, even when there are truths that cannot be proven. Failing to recognize the limits of rationality is also important, as much as it is to recognize the social approaches you're speaking about here.\n\nEven something as precise as math has substantial problems when you really examine its first principles.",
            "title_similarity": "0.72733855",
            "sentiment_compound": 0.924
        },
        {
            "id": "h94pgdh",
            "score": 1,
            "text": "Should at least credit Neal Tyson on this.",
            "title_similarity": "0.39624235",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h94ppws",
            "score": 1,
            "text": "Let’s see.. what evidence do I need to admit that we are not in a Matrix now?..",
            "title_similarity": "0.539369",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h94revz",
            "score": 1,
            "text": "Ask questions until their faulty logic falls in on itself.",
            "title_similarity": "0.62078863",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h94rugn",
            "score": 1,
            "text": "It's pretty easy to spot whenever someone lives their life based on misinformation or irrational fear.\n\nIt's easy to call them on their bullshit, but when they have their heels dug in, there's no fixing stupid.\n\nIt's not even worth debating at that point. If they want to choose to life in their uniformed paranoid bubble of a life, that's their choice. It's even worse when it's some BS anecdotal \"evidence\". \"It happened to me, I experienced it, therefore it's the norm.\" Not how reality works.\n\nIt's not my job to fix other people, and at the end of the day it's not worth giving them attention or spending any energy on it.",
            "title_similarity": "0.6757496",
            "sentiment_compound": -0.8803
        },
        {
            "id": "h94s4mf",
            "score": 1,
            "text": "??? \n\nif I already know what evidence will change my mind then I should have already tried to find it. \n\nPlease understand most of the time people dont know what they want, thats why changing mind is hard.",
            "title_similarity": "0.80567855",
            "sentiment_compound": 0.4098
        },
        {
            "id": "h94sdb8",
            "score": 2,
            "text": "I don't get why every discussion on the internet always starts with the goal of changing the other guys mind.\n\nWhy can't we talk about things and try to understand eachother instead of considering the other fella as your opponent and you must convert him at any cost necessary.\n\nWe need representation on both sides and it's fine to disagree.\n\nLike cmon bruh.",
            "title_similarity": "0.7575907",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h94uabx",
            "score": 1,
            "text": "Oh hi Popper. Long time no see!",
            "title_similarity": "0.30176646",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h94v3p1",
            "score": 1,
            "text": "The only correct answer to that question is \"none\". Otherwise the other party will go out of their way to bend statistics and find \"\"proof\"\" that fit the narrative they want to push. It does not sound like you want to help the person in question but rather gain some moral high ground over them.",
            "title_similarity": "0.742995",
            "sentiment_compound": 0.8314
        },
        {
            "id": "h94vek2",
            "score": 1,
            "text": "This came at just the right time as I just had a back & forth with an anti-vax/anti-mask proponent. Makes me so sad that some folks refuse to take the very least possible precautionary measures.",
            "title_similarity": "0.64480025",
            "sentiment_compound": -0.7344
        },
        {
            "id": "h94vit9",
            "score": 1,
            "text": "Wow that’s a solid advice",
            "title_similarity": "0.20884219",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h94vk7o",
            "score": 1,
            "text": "thats exactly what i do. leftists never have any evidence",
            "title_similarity": "0.33254072",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94vsh7",
            "score": 1,
            "text": "Why is Tyson held up as some pantheon of debate and intelligence? I'd love to know why, I'm not being facetious I just honestly don't get the hype. To me he's very ordinary, bland and enjoys the smugness of talking down to anyone he's with",
            "title_similarity": "0.5883223",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h94w3t6",
            "score": 1,
            "text": "If I knew what evidence would change my mind about a certain topic or opinion, I would've gone to search for it already and change my mind. It is up to the person sharing the opposing view to share their evidence and the other party to judge it. People who hold an opinion about something usually have tried searching for evidence for it, and found the contrary, or not found any evidence for it at all. Another side of the coin is people who just haven't thought about it at all and believe by default. Also, I don't think it is a waste of time to argue with someone who can't answer this question. Its always a good opportunity to share your own views and try to educate and share things with them.",
            "title_similarity": "0.73750985",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h94wc8b",
            "score": 1,
            "text": "manipulative and one sided question",
            "title_similarity": "0.46110278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94wcwq",
            "score": 1,
            "text": "That's a load of horse shit, if they knew what would change their position they wouldn't argue for it.",
            "title_similarity": "0.67675114",
            "sentiment_compound": -0.3744
        },
        {
            "id": "h94wimk",
            "score": 2,
            "text": "I always do this. So far the answer has always been *crickets*.",
            "title_similarity": "0.22589073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94wus3",
            "score": 1,
            "text": "What proof or evidence would it take to change your mind that your important question is not one of the most important?",
            "title_similarity": "0.689819",
            "sentiment_compound": 0.4391
        },
        {
            "id": "h94wyzs",
            "score": 1,
            "text": "Basically 100% of the discussions or arguments. There is nothing to be earned in convincing someone.",
            "title_similarity": "0.35091102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94xb14",
            "score": 1,
            "text": "Huh that's a good one",
            "title_similarity": "0.107866615",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h94xnk8",
            "score": 1,
            "text": "I've actually done this and let me tell you.....it fucking WORKS!",
            "title_similarity": "0.2355373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h94xv7g",
            "score": 1,
            "text": "If your goal is to change that person's mind, sure.  I don't know that I've ever changed anyone's mind through debate, but that's not why I do it.   Primarily, I debate to entertain myself, and to clarify my own thoughts on a subject.  \n\nIt has been said that the people observing the debate should be your target, rather than the person you're debating.  Some people thus debate to influence that audience, but that's not my style.",
            "title_similarity": "0.75825113",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h94xx6l",
            "score": 2,
            "text": "Youll never change someones opinion in one conversation. Instead, plant a seed of doubt. Dont force your viewpoint out, instead question theirs so you fully understand what they believe and why, then, question it. \n\nFor example; A:\"I believe all homeowners should be required by law to own at least 1 tree.\" B:\"why do you believe that exactly?\" A:\"the environment is at critical condition, trees can help reduce and slow down the emissions and as a collective all those trees together will have a big impact.\" B:\"okay, and if they dont own a tree what then?\" A:\"fines or prison time\" B:\"okay so you believe every household should be required by law to own at least 1 tree and if they dont they'll face legal action?\" A:\"yes.\" B:\"so how do you propose finding a solution to households that dont have gardens? Approximately 20% of households are flats meaning they have no outdoor space, and households living in large towns and cities likely wont have enough space to plant large trees - what solution do you propose to this problem?\"\n\nAfter the last response person A will likely try to improvise a solution, but more than likely the cogs in their head will be turning that will trigger the process of \"is this belief sustainable when you break it down to its core principles?\" Over the course of a few months or maybe even a few years, this thought will progress further and further and eventually they might end up changing their belief if they come to the conclusion that, after researching properly, their belief actually isnt as sustainable as they once thought it was. \n\nIf someone has a belief that is deeply ingrained into their core values, eg flat earthers, simply one conversation of you saying \"how can you believe that, its clearly wrong because of xyz\" will do nothing to change their opinion and actually could have the opposite effect and make them double down on their belief in order to protect it because they feel danger and threatened by your directness",
            "title_similarity": "0.5920806",
            "sentiment_compound": -0.478
        },
        {
            "id": "h94zdu8",
            "score": 1,
            "text": "Great point actually. Thanks :)",
            "title_similarity": "0.20589772",
            "sentiment_compound": 0.875
        },
        {
            "id": "h94zpkk",
            "score": 1,
            "text": "Using this against people who defend the vaccine more like they'd defend their kids",
            "title_similarity": "0.6730813",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h9506ga",
            "score": 1,
            "text": "What proof or evidence would make you think this isn’t a LPT?",
            "title_similarity": "0.53474927",
            "sentiment_compound": 0.0
        },
        {
            "id": "h950ds0",
            "score": 1,
            "text": "An **argument** can be resolved by making a measurement.\n\nA **debate** can not be resolved by making a measurement.\n\nNever confuse the two.  Never mix the two.",
            "title_similarity": "0.45592272",
            "sentiment_compound": -0.166
        },
        {
            "id": "h950v4e",
            "score": 1,
            "text": "This is true in a private debate, but in a public debate it's no longer about convincing you opponent, but about all the people who may witness it.",
            "title_similarity": "0.6282314",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h9518cx",
            "score": 1,
            "text": "I simply ask them to cite their source.  If it’s credible, I take them seriously and my mode of thinking changes.  If it’s some mommy blog or broken link, well.....",
            "title_similarity": "0.58467937",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h951d5t",
            "score": 1,
            "text": "This is the difference between an opinion and a belief.  An opinion is based on facts and evidence and is thus subject to change.  Beliefs tie our cognitive dissonances together so our worlds make sense to us.  Changing beliefs requires us to change our worldview.  \n\nOf course, people like to use the terms interchangeably, although the ides underneath them are very different. \n\nArguing with another persons beliefs is futile.",
            "title_similarity": "0.78109217",
            "sentiment_compound": -0.5688
        },
        {
            "id": "h951gxw",
            "score": 1,
            "text": "I disagree with this LTP simply because “proof of evidence” is something that can vary A LOT, specially these days",
            "title_similarity": "0.65955794",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h951y2e",
            "score": 1,
            "text": "You just saved me four hours of fighting THANK YOU SO MUCH",
            "title_similarity": "0.30564436",
            "sentiment_compound": 0.5473
        },
        {
            "id": "h9540ui",
            "score": 1,
            "text": "The first rule is to not argue with a fool.",
            "title_similarity": "0.49246818",
            "sentiment_compound": -0.2177
        },
        {
            "id": "h954zbj",
            "score": 2,
            "text": "One of my online hobbies for a few years was gently talking around Holocaust Deniers. Being very right wing, religious and not Jewish gave me a certain advantage as many Deniers are far right or islamists. I was not immediately treated with hostility or suspicion, shall we say. \n\nHonestly, the “Denial community” surprised me. Most of them were not particularly ideological and there wasn’t even much open antisemitism. They tended to be intelligent young men with inquiring minds, genuinely curious about history, who thought they’d stumbled upon something unique and transgressive but had got themselves caught up in erroneous thought. It’s been said that Flat Earthers would make excellent scientists. I think many Deniers would make excellent historians. Reasonable people can be convinced, and they were *nearly all reasonable people*. This is why I don’t believe in marginalising and censoring such people. Their ideas fall on their own merits if we let them. \n\nMy tactics depended on the flavour of Denier. Sometimes the discussions were detailed (deconstructing the finer points of the Leuchter Report, for example) and sometimes basic thought experiments or logical inference worked. \n\nMost of them simply wanted *proof*. Explaining that the historical method works on the balance of probabilities derived from imperfect sources was sometimes enough (my favourite examples were that, by their standards of evidence, we have no “proof” that Alexander the Great existed or that the Battle of Agincourt took place), but some persisted in this demand. Therefore:\n\n“What proof would convince you?”\n\n(Usually) “A written order from Hitler ordering the mass murder of the Jews by gassing and/or an autopsy report on a Jewish victim that confirms he died that way.”\n\n“You’ve dismissed every single existing document as forged, biased or misinterpreted, and you consider every historian except David Irving to be in on the act. Why would your suggested evidence convince you and who would you trust to authenticate it?”\n\nThis was a startlingly effective response that worked several times. When it worked, the conversation usually went into DMs, and the conversation became a series of lightbulb moments for the Denier, triggering a thirst for proper knowledge. One of them became a drinking buddy of mine in real life. It was awesome. \n\nMaybe I wasn’t a very efficient propagandist - I must have written millions of words on this topic over several years and maybe “converted” 20-25 people - but I enjoyed myself and I like to think it was time well spent. Likewise joy shall be in heaven, as the Book says.",
            "title_similarity": "0.5531746",
            "sentiment_compound": 0.9809
        },
        {
            "id": "h955a3f",
            "score": 1,
            "text": "Why the urge to change someones mind&opinion as if its your job?\nReal LPT: leave people alone",
            "title_similarity": "0.7092474",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9584gp",
            "score": 1,
            "text": "Socratic method is tried n tru for 10yrs.",
            "title_similarity": "0.19167963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9589j5",
            "score": 1,
            "text": "Back in the Ken Ham/Bill Nye debate I'm pretty sure early on Ken answered that question with basically \"nothing because the Bible is 100% accurate so I'd never be convinced of evolution\". That was the day I started to break away from my parents beliefs and looking into things myself.  (Christain school taught me a lot of straight up lies about the sibject)",
            "title_similarity": "0.5777464",
            "sentiment_compound": 0.3274
        },
        {
            "id": "h958k26",
            "score": 1,
            "text": "“Quit your time arguing and spend sometime trying to understand their perspective. It may not change your mind but it might change your opinion on some of the smaller details.",
            "title_similarity": "0.61715955",
            "sentiment_compound": -0.25
        },
        {
            "id": "h958z0s",
            "score": 1,
            "text": "How about if they are making up bs evidence on the fly? I see this a lot. I argue with horrible narrow minded people. I should stop doing that.",
            "title_similarity": "0.6773779",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h959ifv",
            "score": 1,
            "text": "TIL it's useless arguing with me on most things",
            "title_similarity": "0.43397814",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h95crjh",
            "score": 2,
            "text": "Right on.  This is a great point that many times I don’t consider.  I hope I keep this in the forefront of my mind when debating a topic.  It would save so much of my time and help preserve what’s left of my sanity.",
            "title_similarity": "0.64916545",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h95e6uz",
            "score": 2,
            "text": "Tend to find that most presentations of evidence are refused in arguments these days due to the refusal to believe the source can be trusted. Show a climate change denier a graph of accelerated temperatures over the last 100 years and it’ll be shot down as untrustworthy because of some hidden motive from the source.",
            "title_similarity": "0.6216788",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h95ewpn",
            "score": 1,
            "text": "My goal is never to change the mind of the other, but to understand it.",
            "title_similarity": "0.48268628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h95f48y",
            "score": 2,
            "text": "Sometimes I encounter someone who wants to discuss a controversial topic like one I'm already familiar with the logic/arguments for all sides, but I detect they're trying to persuade me to think like them rather than honestly exploring positions they haven't though about yet. \n\nThat's when I usually start out by saying something like, \"Now, if I present to you incontrovertible evidence that shows you are incorrect in your current position, will you change your position?\"\n\nIf not, there's no need to spend time discussing it.",
            "title_similarity": "0.7848128",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h95ftfa",
            "score": 1,
            "text": "\"I could ask you the same, what would it take for YOU to change YOUR mind?\"\n\n\"But I'M not wrong!\"",
            "title_similarity": "0.51961833",
            "sentiment_compound": 0.5608
        },
        {
            "id": "h95gmgf",
            "score": 1,
            "text": "I don’t like this.\n\nYou are presumptively winning via the question.\n\nyou should really ask yourself that question of the other persons argument and see if you will change your mind.\n\nIf not, leave them alone and stop arguing.",
            "title_similarity": "0.8066827",
            "sentiment_compound": 0.0227
        },
        {
            "id": "h95iq1r",
            "score": 1,
            "text": "This is great advice, i will try and implement it with my Q father",
            "title_similarity": "0.53221583",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h95k33i",
            "score": 1,
            "text": "Be cautious with this advice",
            "title_similarity": "0.39230597",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h95kb8w",
            "score": 2,
            "text": "What if let's say - a flatearther - told you this exact thing \"what piece of evidence would it take you to change your point of view\" (when you know that YOU are 100% right in this matter), does that make you the unworthy of discussing with?",
            "title_similarity": "0.62861246",
            "sentiment_compound": -0.4357
        },
        {
            "id": "h95kljj",
            "score": 1,
            "text": "I believe this should be attributed to Adam Grant more than NdGT. His book Think Again (?) covers this topic and great length.",
            "title_similarity": "0.5745544",
            "sentiment_compound": 0.765
        },
        {
            "id": "h95l980",
            "score": 2,
            "text": "A variation on the \"Shifting Goalposts\" fallacial argument strategy.\n\n\"I'm right because X.\"\n\n*\"I disprove X.\"*\n\n\"X doesn't matter!!\"",
            "title_similarity": "0.6150093",
            "sentiment_compound": -0.4867
        },
        {
            "id": "h95lxov",
            "score": 2,
            "text": "Me: let's debate\n\nFriend: ok\n\nMe: tell me how to win the debate\n\nFriend: isn't that like asking for the answers of a test?\n\nMe: Debate is over. You're wasting my time.",
            "title_similarity": "0.77568907",
            "sentiment_compound": 0.822
        },
        {
            "id": "h95ojlm",
            "score": 1,
            "text": "Yeah when you talk to most people about veganism. Waste of time",
            "title_similarity": "0.5637726",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h95ovkq",
            "score": 1,
            "text": "I've used this before, and the results were \"show me news article, video, etc from a reputable source.\" When I responded with about 15 links demonstrating my proof, I was told none were reputable sources. I started with Reuters and AP, so I just didn't know where to go from there.",
            "title_similarity": "0.51321536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h95pxhn",
            "score": 1,
            "text": "Here is a better LPT. Just don't argue with people.",
            "title_similarity": "0.44704622",
            "sentiment_compound": 0.6041
        },
        {
            "id": "h95qhyc",
            "score": 1,
            "text": "That's bad advice..",
            "title_similarity": "0.40549612",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h95qt1c",
            "score": 1,
            "text": "This is a good tip and works. However Tyson had nothing to do with it and 5 minutes listening to him debate anything leaves you annoyed and thoroughly uninspired.",
            "title_similarity": "0.43241948",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h95qupr",
            "score": 1,
            "text": "The problem is if it's a ban appeal. Then you don't have much of a choice",
            "title_similarity": "0.6031438",
            "sentiment_compound": -0.743
        },
        {
            "id": "h95s2lk",
            "score": 1,
            "text": "This issue we have lately is that we have people that when presented with objective fact willfully misinterpret those facts to fit their worldview.\n\nI cannot tell you how many times antivaxxers have linked me “proof” it ends up being the opposite that supports getting vaccinated. They just woefully misunderstood the data or straight up don’t read beyond the headline.",
            "title_similarity": "0.68280107",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h95sq12",
            "score": 1,
            "text": "This why we don’t argue with racist people - if they can’t see racism by now, they’ll never do it\nGun crazy people - same - if the evidence out there on how detrimental guns are doesn’t convince them \nHealthcare - same same -",
            "title_similarity": "0.6915252",
            "sentiment_compound": -0.8709
        },
        {
            "id": "h95tch9",
            "score": 1,
            "text": "I feel like that definitely wouldn’t work in a real argument but just make you sound like a bit of a dick",
            "title_similarity": "0.65693164",
            "sentiment_compound": -0.09
        },
        {
            "id": "h95ulxo",
            "score": 1,
            "text": "Wow this is actually a really good tip. You can't change the mind of someone who isn't willing too",
            "title_similarity": "0.42227823",
            "sentiment_compound": 0.7902
        },
        {
            "id": "h95v0wq",
            "score": 2,
            "text": "This question is really it. I have asked this question to my mother before, and she couldn't come up with any sort of answer.that didn't end up with: \"there won't be any evidence because I am right!\" It makes very clear if there's any point talking to this person, or if you're just wasting your time.\n\nI was wasting my time.",
            "title_similarity": "0.63966477",
            "sentiment_compound": -0.4213
        },
        {
            "id": "h95vmfw",
            "score": 2,
            "text": "I grew up mormon and had a faith crisis. During the heat of my faith crisis, I was trying to understand the disparity between the faithful and non-faithful beliefs and came up with this thought.\n\nFor example, I could readily list many ways that, if true, would convince me evolution would be false (i.e. we learn DNA/genes isn't linked to features on an organism, or something in the fossil record shows humans as being unique, scientific consensus on these new foundings, etc).\n\nBut if you ask a faithful member who doesn't believe in evolution what it would take to convince them its true, they'll constantly skirt around a real concrete answer. They'll usually walk it back to faith and \"the bible/prophets said so.\" Doesn't matter what educated people in the field say.\n\nThis is a good principle to apply to yourself. I did it, and ultimately left Mormonism, which is a big deal if you were in it as much as I was.",
            "title_similarity": "0.69033265",
            "sentiment_compound": 0.9614
        },
        {
            "id": "h95xnnx",
            "score": 1,
            "text": "I agree with this assessment.  People who take a stance or position on one side of an argument and refuse to change their position no matter what actual proof or fact or truth you provide them to try to help them understand that what they believe is not the truth, are simply stubborn and rigid, close minded people.\n\nI find that many of these people have an emotional attachment to their viewpoint.  As in, whatever the subject matter is, it is deeply embedded in their psyche as associated with a traumatic event, and even if that event happened decades ago, times have changed and things are simply no longer done the same way, they will still remain in this rigid position.\n\nI read somewhere that people who are traumatized stop growing emotionally at whatever age it is that the trauma happened to them.  Its really sad.  So, don't get frustrated with people like this, instead just say, I understand where you're coming from, or at least, I am trying to understand where you're coming from.  I hope one day you will feel differently.  \n\nThere is no point in getting frustrated over this because you haven't lost the argument, you've simply poked a wounded, broken person.  They sometimes react violently as the emotional response they had at the time will sometimes come back and manifest even more violently as the anger, trauma, shame, pain, etc., has festered for years.",
            "title_similarity": "0.7619535",
            "sentiment_compound": -0.9862
        },
        {
            "id": "h95zli3",
            "score": 1,
            "text": "Did this when arguing with mum earlier today. Still disappointed to be honest but hey.",
            "title_similarity": "0.602947",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h963u6u",
            "score": 2,
            "text": "Don't forget that \" I don't know \" is an appropriate answer and doesn't necessarily mean they'll completely reject your side .",
            "title_similarity": "0.5722419",
            "sentiment_compound": -0.3241
        },
        {
            "id": "h965exo",
            "score": 1,
            "text": "Tried this, presented proof, was called fake. My argument was the S&P has hit a new record high under every president since it's inception.",
            "title_similarity": "0.43204176",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h965oa9",
            "score": 1,
            "text": "But many differences are philosophical. Two arguing parties can agree on the evidence, but still disagree on what's more important.",
            "title_similarity": "0.6868447",
            "sentiment_compound": 0.2592
        },
        {
            "id": "h96c3e3",
            "score": 1,
            "text": "Bring me the body of an alien.",
            "title_similarity": "0.20930566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h96e6xd",
            "score": 1,
            "text": "This is exactly where my relationship ended with my partner. \n\"I don't know what to say or do to build confidence or address the problem, help me figure it out\"\nGets replied with no, it's not my responsibility to fix the relationship",
            "title_similarity": "0.58467233",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h96i1de",
            "score": 1,
            "text": "I actually did this the other day with an antivaccer. I decided to just leave it be and move on, we didn’t agree but I saved myself from a killer headache.",
            "title_similarity": "0.53451157",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h96rld0",
            "score": 2,
            "text": "when apple launched 'OSX' way back in time( 2001 I think), I had a debate with a coworker about whether it's said \"oh ess TEN\" or \"oh ess EX\". \n\nThe coworker said \"you find me a clip of Steve Jobs saying it your way and I'll never say it the other way again\". I found the keynote where it was launched and ah-ha! Mr. Jobs saying it my way. The co-worker changed his tune.",
            "title_similarity": "0.5000948",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h96ut0p",
            "score": 1,
            "text": "TLPT: Don't argue to teach, argue to learn. What other person thinks is irrelevant, the only thing that matters is what YOU get out of it. \n\nMost people \"argue\" when they should be \"discussing\", but they don't know the difference and use \"arguing\" as a blanket term because it sounds more aggressive. \n\nArguments are aggressive by nature, they're useful when you have limited resources, multiple decisions, and you're convinced you're right - they rely on you using all your tricks up your sleeve to win whether you are actually right or wrong and could care less about intellectual integrity - but then you'd be just bickering. \n\nDiscussions on the other hand have no external stakes, they're all about the internal motivation and benefit - they're a lot more indirect. By trying to cut corners in a discussion, you're only hindering yourself.\n\nIf discussions are the training, arguments are the competition. Don't bring your ego to the gym, but don't forget your ego in the ring.",
            "title_similarity": "0.77870524",
            "sentiment_compound": 0.8723
        },
        {
            "id": "h971pyc",
            "score": 1,
            "text": "You are so right. Unfortunately there is a certain kind of person who will tell you exactly what would change their mind, and then simply pretend like that proof is 'fake news.' I think the idea that everything that someone doesn't want to hear is easily dismissed as pretend really screwed the US. It's going to take decades, or longer, to recover from the damage.\n\nI do think that it's a helpful point in dealing with rational people, but for the rest it's better not to engage at all if you don't want to end up feeling like you are banging your head n a wall.",
            "title_similarity": "0.7736645",
            "sentiment_compound": 0.4795
        },
        {
            "id": "h976suf",
            "score": 2,
            "text": "Also, it’s okay to recognize certain pieces of evidence and still hold your original position. People are so quick to hold that 100%.",
            "title_similarity": "0.34007335",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9qg2ld",
            "score": 1,
            "text": "\"What evidence do I need to present to change your mind on the issue of \"is sadistic baby torture porn morally okay?\"\n\n\"That babies were okay with being in torture porn, I guess. But they're not. That's what makes it baby torture porn.\"\n\nYeah, sorry gang, guess I'm a narrow-minded idiot.",
            "title_similarity": "0.6379813",
            "sentiment_compound": -0.9091
        },
        {
            "id": "h9ret2s",
            "score": 1,
            "text": "That definitely would not meet NSDA rules. You'd be disqualified!",
            "title_similarity": "0.56000733",
            "sentiment_compound": -0.1007
        },
        {
            "id": "hbr7qtz",
            "score": 1,
            "text": "My goodness. You ppl have NO IDEA what you are spreading by pushing this nonsense. Wow! It’s truly incredible. Follow your news, listen to “your” government, and trust them? 😎🤦🏻",
            "title_similarity": "0.670213",
            "sentiment_compound": 0.8816
        },
        {
            "id": "hcjen3q",
            "score": 1,
            "text": "if they knew then they would have been convinced",
            "title_similarity": "0.37581593",
            "sentiment_compound": 0.4019
        }
    ]
}