{
    "LPT: Responding to everything with negativity is a terrible habit that's easy to fall into. Internet culture rewards us for pessimism, but during personal interactions it's a huge turn-off.\nI used to be an extremely negative person, and I still have a lot of trouble fighting my instinct to tear everything down. That's what gets the most attention in online spaces, complaining about or deconstructing something. This became doubly intense when I hit my angry atheist phase around 20. I actually remember alienating potential new friends by shitting on every movie/game/activity/belief system they brought up, and when they would stop texting me back I'd think \"I wish this person wasn't so boring.\" I wanted them to play the negativity game with me. \n\nA cool decade later, I've figured out that they weren't boring at all. I was. Everyone knew not to float an idea my way, because I'd predictably tear it apart. I now run into people who act like I used to act, and I feel so bad for them. I wish I could tell them \"hey, if you shoot down everything everyone says, nobody is going to want to say anything to you anymore.\"": [
        {
            "id": "hgcegjj",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.5293071",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hgcke45",
            "score": -7,
            "text": "\"LPT: Responding to everything with negativity is a terrible habit that's easy to fall into\"\n\nNo, it's not...\n\n\"hey, if you shoot down everything everyone says, nobody is going to want to say anything to you anymore.\"\n\nCool.  Problem solved.  (How's that for optimism?!)\n\nFact is, it's far more about finding people who match or tolerate your personality than changing your personality to fit in with the people who don't match or can't tolerate yours.\n\nYes, I'm being deliberately facetious here, but the truth is that those people for whom everything is sweetness and light bug the hell out of me.  I can present a false front, sure, but I'd rather not.  And if me saying something negative about your belief makes you go away, I worry how strongly held those beliefs are for you.  It kinds of works as an automatic filter, in fact.  If questioning something makes you go away, I think we just saved ourselves enormous amounts of time together.\n\nThe most interesting conversations I ever have are with people who don't present false fronts and who are pretty much open about the downfalls of their beliefs, choices, etc. themselves.  And they are usually of polar-opposite opinions to myself.  They present the best arguments, they engage, they counter assertions, etc. etc. without having to be on the defensive or battle with you.\n\nIt's people who take the smallest negativity to heart that I don't get on with.\n\nOf course, you can take it too far, but you can take it too far in BOTH directions.  And there are people who literally seek out and ask for, and then can't tolerate, even minor criticism of themselves or something they've done or believe.  Or even something that could be construed as that, such as questioning some minor part of a belief they have and expecting to get some kind of answer rather than a brush-off.\n\nI'm in my 40's.  I learned to accept that my personality is a filter.  Those people who don't want to engage or can't take criticism (even in jest) automatically bounce off the filter.  The ones who get through?  Yeah, they're the people I care about and who I can spend weeks of evenings just sitting talking (note:  not arguing) with them about their beliefs, choices, etc.",
            "title_similarity": "0.7676547",
            "sentiment_compound": 0.97
        },
        {
            "id": "hgctbmh",
            "score": 2,
            "text": "This makes the assumption that -\n\n1. I have personal interactions with people outside of the internet and\n2. I give a shit about those interactions",
            "title_similarity": "0.41482022",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hgcrvhh",
            "score": 4,
            "text": "Bruh, such a dumb LPT",
            "title_similarity": "0.3903445",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hgcsms8",
            "score": -4,
            "text": "\"Internet culture rewards us for pessimism\"????   \n???  \n??????????????????  \nwhat the f?  \nno",
            "title_similarity": "0.63669395",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hgd6hes",
            "score": -1,
            "text": ">A cool decade later, I've figured out that they weren't boring at all. I was.\n\nSo basically you were shit and you make that a life pro tip?\n\nWhat the fuck dude. You just sucked at life, this ain't a tip.",
            "title_similarity": "0.5969248",
            "sentiment_compound": -0.7807
        },
        {
            "id": "hgcrtq2",
            "score": 17,
            "text": "This is not a pro tip",
            "title_similarity": "0.26033637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgcwvuw",
            "score": 4,
            "text": "Nah.  Screw that.",
            "title_similarity": "0.1419009",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hgcx2qq",
            "score": 1,
            "text": ">\"hey, if you shoot down everything everyone says, nobody is going to want to say anything to you anymore.\"\n\nActually, why not just say that? If someone's being a jerk, might as well hit them with that and ignore them. They're the cause of their own problems, and it'll force them to either confront that issue or continue in their ways.",
            "title_similarity": "0.6896404",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hgczvi0",
            "score": 0,
            "text": "Your life is going to be worse if you will be looking for things that are bad and vice-versa.\n\nEdit: swapped 'bad' for 'worse'.",
            "title_similarity": "0.6315005",
            "sentiment_compound": -0.9217
        },
        {
            "id": "hgcm0ed",
            "score": 5,
            "text": "You can tell them that. I wish someone had told me that. and to avoid drugs. Drugs could have used more negativity in my life.",
            "title_similarity": "0.57178676",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hgcxo8e",
            "score": 1,
            "text": "Negativity and, even worse than that, cynicism. Some subs are worse than others, but in my city's sub you'll be categorically dismantled for expressing anything other than the least-optimistic, most dour view on humanity and the potential outcome for a given situation. I shouldn't let it, but some of the shit people have said to me on Reddit has, in turn, markedly depressed my view of other people.\n\nBut honestly, most aren't like this in person. Most people don't think fast enough to figure out what that bottom line negativity/cynicism is, and further, most go with the flow of what everyone else is doing. If it's a positive group, it's hard to go against that tide. The whole thing is mainly about acceptance.\n\nBeing aware of your impulses is the first step. I had to make this leap too - I used to be known for complaining. I'm now embarassed by that. If you can't be actively positive (which I do totally get), you can still be *interested.* Ask questions and express a genuine curiosity about other's views. Being negative when it's due, isn't the problem; the trick is to know when it's worth bringing up, vs. when it's a compulsion that doesn't do you or anyone else any favors.",
            "title_similarity": "0.8304337",
            "sentiment_compound": 0.3768
        },
        {
            "id": "hgcsnq9",
            "score": 3,
            "text": "It's frustrating that this is the way society is right now. Punching down, and overall negativity is everywhere.",
            "title_similarity": "0.6609766",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hgdake5",
            "score": 1,
            "text": "How the fuck is this a life pro tip? If you don't know this your social skills are probably garbage",
            "title_similarity": "0.600422",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgdl56q",
            "score": 3,
            "text": "The LPT Reddit needs lol",
            "title_similarity": "0.27563846",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgcuhg2",
            "score": 7,
            "text": "Not only that, you are training your brain to only see negativity when you are being negative all the time. Eventually you will only see the negative in the world, then actively seek it, and eventually, create it.\n\nIt runs in my family sadly, I realized that in my mid-20s.  It's a mixture of narzicissm, pessimism and xenophobia/conservatism, as far as I can tell, and I work to avoid those tendencies every single day. Not being around people who show this behaviour helps tremendously. Or, as they say, \"you become the people you associate with.\"",
            "title_similarity": "0.8237829",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hgcw8gc",
            "score": 0,
            "text": "Yes I'm 14 and I learned this very early on \nNow I just cosplay as sans the chill lazy dude on youtuber twitter WhatsApp and act like the chill guy never breaking character \n\nThat's my way of coping with negativity though if some one tries to get into and argument with me\nI boil them to the bone and waste their time \nAll they time making dusty jokes",
            "title_similarity": "0.75747955",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hgdes1t",
            "score": -5,
            "text": "Boy , I could a penny for every downvote When I said something something positive / ideas how to improve oneself financially. \n\nLol the future generation who rely on Reddit’s validation is doomed.\n\nEdit: and here we go again. Snowflakes.",
            "title_similarity": "0.62183",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgeiu1z",
            "score": 0,
            "text": "People who call movies “fun” in a negative way are horrible.   \n\nThe movies I like are just as good as the movies you like.  It’s all opinion.  “The dialogue is bad”. I think the dialogue is good because it speaks like me etc",
            "title_similarity": "0.70030046",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgcnzdw",
            "score": 9,
            "text": "Our daily LPT about essentially limiting online use :)",
            "title_similarity": "0.5527675",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgcvus5",
            "score": 40,
            "text": "Where's the actual tip? So the answer to broad pessimism is just 'Be better' ... ? \n\nLike, how did you change? What would you advise others to say to your former self?\n\nThis is basically the same thing as saying 'You're depressed all the time? LPT: Just don't be depressed.'",
            "title_similarity": "0.66073394",
            "sentiment_compound": 0.5043
        },
        {
            "id": "hgcqfwu",
            "score": 5,
            "text": "Any advice on how to break out of that mindset?",
            "title_similarity": "0.32705635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgcxcmv",
            "score": 7,
            "text": "Responding negatively is literally all of reddit in a nutshell",
            "title_similarity": "0.6518986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgcttlj",
            "score": 1,
            "text": "This kinda opened my eyes. Thank you",
            "title_similarity": "0.13412467",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgcwryx",
            "score": -1,
            "text": "Best LPT to come across here in a long time.",
            "title_similarity": "0.1931429",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hgcwva1",
            "score": 1,
            "text": "I have people in my life like this, where I just don't talk about shows or games in passionate about because they're only going to complain about it. They'll always say that they complain because they want it to be better, or because they also love it. But oh my God I hate it so much",
            "title_similarity": "0.7545408",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hgcwytc",
            "score": 1,
            "text": "I'm patient, kind, and funny. Almost everyone loves me, and the people who dislike me pretend to be my best friend when I'm in the room. My whole life is filled with love.",
            "title_similarity": "0.56106746",
            "sentiment_compound": 0.9602
        },
        {
            "id": "hgcxeuy",
            "score": 1,
            "text": "Perfect tip to hear this morning! Unfortunately I used to be the super optimistic person that brought light to other people and I drifted away from that. I'm currently working on going back to the old me in that respect. Never doubt the power of positive thinking!",
            "title_similarity": "0.5475525",
            "sentiment_compound": 0.9509
        },
        {
            "id": "hgd0nx8",
            "score": -1,
            "text": "The best LPT. I’m working on this as we speak. I feel like I’ve missed out on so much and held myself back because of negativity. I know I’ve ruined relationships and that hurts me the most. Anyway, it’s not an overnight change and little by little I’m regaining what I’ve lost. I’ve learned to have an open mind again. Instead of talking and giving my opinion (that no one wants!) I listen more and more. Moral of the story? Be Happy as best you can and always work to be better. This is all we got! Try to enjoy it!",
            "title_similarity": "0.77323353",
            "sentiment_compound": 0.8682
        },
        {
            "id": "hgd1gy8",
            "score": -1,
            "text": "I wish I could +10000 this post.",
            "title_similarity": "0.3654283",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hgd2swc",
            "score": -1,
            "text": "Critical Theory in a nutshell?",
            "title_similarity": "0.18923469",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hgd3ou3",
            "score": -1,
            "text": "Help me downvote this shit. Let's give this post the lowest, most negative karma ever",
            "title_similarity": "0.6223618",
            "sentiment_compound": -0.8459
        },
        {
            "id": "hgd8vsu",
            "score": -1,
            "text": "It is very true that internet culture rewards pessimism. I think there is a long standing cultural dynamic of optimism = naïveté and pessimism = savvy. Especially if you are pragmatically cynical, that is basically always rewarded because it has an inherent posture of superiority. Ultimately I find that pessimism is rarely rewarded in reality; the bad thing happening usually isn’t made less bad by the fact that you knew it would be bad in advance.",
            "title_similarity": "0.7447797",
            "sentiment_compound": -0.6177
        },
        {
            "id": "hgd96tq",
            "score": 1,
            "text": "Yeah you definitely grew up and got past your negative view of things....\n\n\nhttps://www.reddit.com/r/offmychest/comments/px5kxu/people_go_missingget_murdered_all_the_time_gabby/",
            "title_similarity": "0.7105926",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgdd2s5",
            "score": -1,
            "text": "But why is it a turn off?! We pessimists are usually right",
            "title_similarity": "0.5372793",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hgdf9qg",
            "score": 1,
            "text": "Probably the first LPT I've seen on here that is actually useful and true. If you are negative in social situations people won't want to be around you.",
            "title_similarity": "0.5477078",
            "sentiment_compound": 0.1969
        },
        {
            "id": "hgdgiay",
            "score": 1,
            "text": "I feel down and feel like the entire world should feel like I do. \n\nI’m trying to change, but for now everything sucks",
            "title_similarity": "0.6642008",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hgdgzpn",
            "score": 1,
            "text": "Being an asshole is bad, who would have thought",
            "title_similarity": "0.5443952",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgdi713",
            "score": -1,
            "text": "But I have my internet possie and that's all I need. If you don't use the rigth pronouns we'll do internet stuff against you and if your cis gendered we'll do internet stuff against and if you don't hate the people I hate we'll do internet stuff against you. /s\n\nWestern society at its finest.",
            "title_similarity": "0.73761",
            "sentiment_compound": -0.2624
        },
        {
            "id": "hgdmync",
            "score": -1,
            "text": "this is true and real but not something i would listen to when i was that way.",
            "title_similarity": "0.3458709",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hge5nmi",
            "score": 1,
            "text": "I don’t know who will read this but here goes. \n\nI’m a mod at r/numetal. We have completely changed that attitude of the subreddit as a positive, inclusive, and fun place to celebrate our favorite genre of music. Any attempt of baseless negativity or gatekeeping is instantly downvoted and ignored. Instead it’s support and embracing us as rejects of this music world and just enjoying each other’s company and conversation. It’s probably one of the only places in Reddit I frequent for that very reason.",
            "title_similarity": "0.7393437",
            "sentiment_compound": 0.9505
        },
        {
            "id": "hge8asx",
            "score": 1,
            "text": "Brave of you to post this on Reddit\n\nThis site is full of nihilistic, pessimistic, cynical losers who feed off each other’s toxicity and negativity. Being rational or positive isn’t welcome here lol",
            "title_similarity": "0.78978956",
            "sentiment_compound": 0.25
        },
        {
            "id": "hgei2x2",
            "score": 1,
            "text": "It’s a huge turn off online too, not just in person",
            "title_similarity": "0.58020586",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgeihi3",
            "score": -1,
            "text": "Negativity is awful for your physical health...\n\"negativity and health - Google Scholar\" https://scholar.google.com/scholar?q=negativity+and+health&hl=en&as_sdt=0&as_vis=1&oi=scholart\n\nIt even makes you fat!!\n\"negativity and obesity - Google Scholar\" https://scholar.google.com/scholar?q=negativity+and+obesity&hl=en&as_sdt=0&as_vis=1&oi=scholart#d=gs_qabs&u=%23p%3DEP0BrxKpm-IJ\n\nYou don't have to be saccharine to not be negative. Just being solution oriented also lends itself to being a skeptic which is by and large pessimistic. So if you're naturally skeptical and tend towards pessimism just try to find solutions and not reasons to not even get started.",
            "title_similarity": "0.68228865",
            "sentiment_compound": -0.9437
        },
        {
            "id": "hgem5h2",
            "score": -1,
            "text": "This is actually a genuinely good LPT that spawned from personal reflection and self-awareness. I feel like OP has grown as a person from reading this insight.",
            "title_similarity": "0.40620932",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hgf9nqg",
            "score": -1,
            "text": "This us a really good one. I also want to add that \"pessimism\" and \"optimism\" are misunderstood as terms. Optimism doesn't mean burying your head in the sand and pretending your problems don't exist. It means \"optimizing\" your situation - making the best of your situation - accepting the hand you were dealt and finding the best way to play your cards.",
            "title_similarity": "0.4823722",
            "sentiment_compound": 0.9747
        },
        {
            "id": "hgfa0f4",
            "score": -1,
            "text": "People on this website are reflexively cynical about everything and it is EXHAUSTING, especially since they're frequently cynical in ways that make no logical sense.",
            "title_similarity": "0.8111686",
            "sentiment_compound": -0.8636
        },
        {
            "id": "hgfujbw",
            "score": 1,
            "text": "Saving this to show my kids. I see a lot of negative hyperbole used by adolescents and teens and I’m certain internet usage is a factor.",
            "title_similarity": "0.7673813",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hgcodn1",
            "score": 58,
            "text": "I do this a lot and it has caused quite a few issues at my workplace (including a promotion one time). But my problem with trying to stay positive is that constructive criticism and feedback in this kind of environment tends to be seen as 'needless negativity'.\n\nBeing positive is great, but not at the expense of acknowledging the negatives and trying to find a solution for them. I've worked at our company for a few years, there were issues that I pointed out early on, gathered data, compiled and presented it. Nothing was changed. Multiple stakeholders, including the customers, still suffer because of this. It makes my job more stressful. So whenever I hear management or senior management puking rainbows about how great everything is, I can't help but to balance the mood out by pointing out the negatives that have yet to be addressed after years of feedback.",
            "title_similarity": "0.7359574",
            "sentiment_compound": -0.4636
        },
        {
            "id": "hgcu2er",
            "score": 13,
            "text": "This LPT sucks. \n\n\nJk, deleting our limiting sources of negativity is a huge life help.",
            "title_similarity": "0.6940236",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hgcetgr",
            "score": 564,
            "text": "I deleted Facebook, Instagram and Snapchat.  They're too toxic to the psyche.  I stopped watching the news on TV years ago and hardly ever turn the damn thing on regardless.  It's pushed me to lead a more productive and fulfilling life.  Social Media=Social Programming plain and simple.",
            "title_similarity": "0.773868",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hgcr7fy",
            "score": 17,
            "text": "Depends on the person. I like it when people are actually honest with me and don’t pretend that life is just sunshine and rainbows.",
            "title_similarity": "0.4350232",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hgctph7",
            "score": 2,
            "text": "My brother does this.  Its infuriating. \n\nI'll call him out on it...\n\nBrother: Bitch, bitch, bitch.\n\nMe: Brother, all you do is complain.   You have a new son.  Anything good going on??  \n\nBrother: Oh yeah....blah blah blah.\n\nMe:  \"cats in the cradle\" brother...",
            "title_similarity": "0.6877365",
            "sentiment_compound": -0.9482
        },
        {
            "id": "hgd0qss",
            "score": 2,
            "text": "Too late. I'm 25. Hate my job. Parents don't want to speak to me. No partner.",
            "title_similarity": "0.60442644",
            "sentiment_compound": -0.7288
        },
        {
            "id": "hgd0u2z",
            "score": 2,
            "text": "I encounter this all the time on this site. If there are any good news about anything there will always be people in the comments with an extremely negative view on the situation.\n\nMany people here just love to spread defeatism. The idea is to make people lose hope and stop taking action towards progress. The good thing is that it's not difficult to recognize who does this.",
            "title_similarity": "0.8268478",
            "sentiment_compound": 0.7661
        },
        {
            "id": "hgdpdid",
            "score": 2,
            "text": "ESPECIALLY in dating! It's so hard to talk to guys that are wet blankets and either belittle everything I'm into or they think being self-deprecating at literally all times is an appealing personality trait.",
            "title_similarity": "0.7502754",
            "sentiment_compound": -0.6197
        },
        {
            "id": "hge6wke",
            "score": 2,
            "text": "It also doesn't actually make you smart. Being negative is easy. I have a friend who spends his days on the Internet looking for negative things on certain subjects - and lo and behold, he finds them. You always will, if that's what you're looking for. If you look for positive things, you'll find those instead. But negative stuff gets bigger laughs.",
            "title_similarity": "0.7763159",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgeh3ms",
            "score": -2,
            "text": "Yeah, reddit is mostly the \"20 yo angry atheist/commie\" phase, so you're not going to get a lot of love here.",
            "title_similarity": "0.7736919",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hgf9qij",
            "score": 2,
            "text": "The internet is full of liars and cynicism is your only friend. Take it with you everywhere. Fuck this advice.",
            "title_similarity": "0.81577706",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hgcy5dm",
            "score": 10,
            "text": "What is even worse that in general conversation you cannot speak of positivity in your personal life; it is taken as bragging and society in general will wok its hardest to make certain it is not a good thing and never happens again.\n\n\nYou have to guard the positivity in your life with a wall.",
            "title_similarity": "0.656388",
            "sentiment_compound": -0.423
        },
        {
            "id": "hgcfipn",
            "score": 21,
            "text": "The way you've explained it makes me wonder if it's because those people never got the right attention from the right people so they become content with te wrong attention from the wrong people",
            "title_similarity": "0.71309197",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hgd17a3",
            "score": 3,
            "text": "Please tell me how to not be so negative about this dumpster fire of a planet we live on. \n\nWe are all truly doomed and everything we do is for nothing. It’s kinda hard to spin any positives out of that. \n\nOh I’m alive and should just be happy to be so lucky? Every fucking day is an enormous effort and it’s hard to get by, socially, financially, health wise etc etc. \n\nLick me eh?",
            "title_similarity": "0.79468423",
            "sentiment_compound": 0.8278
        },
        {
            "id": "hgd5nlb",
            "score": 3,
            "text": "I've found that being negative is a portrayal of knowledge and intellect so people fall into it. Think about it, when someone says something negative that person is usually trying to act smart, snarky, snide, or more knowledgeable. It's easily to see the bad than the good. Understanding the good that comes out of an event requires more reflection and maturity despite the obviously low hanging negative fruits that you'd love to dwell on.",
            "title_similarity": "0.69894344",
            "sentiment_compound": 0.6221
        },
        {
            "id": "hgdenkk",
            "score": 3,
            "text": "Vapid positivity is also just as gross. Take all of /r/wholesomememes for example. The internet rewards that bullshit too.",
            "title_similarity": "0.7581436",
            "sentiment_compound": -0.128
        },
        {
            "id": "hgfna4v",
            "score": 3,
            "text": "Habit, schmabit - if shit's bad, lying about it isn't going to make it better - and staying silent isn't going to spur people to improve it.",
            "title_similarity": "0.48460227",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hgct5rx",
            "score": 3,
            "text": "I just dumped someone because of this trait. It was unbearable.",
            "title_similarity": "0.7247248",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgdgviw",
            "score": 5,
            "text": "“Cynicism is the intellectualism of the mediocre” - George Will. Whatever you might think of him, he nailed that one.",
            "title_similarity": "0.6475618",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hgcz8g7",
            "score": 30,
            "text": "[deleted]",
            "title_similarity": "0.17286375"
        },
        {
            "id": "hgcxh3d",
            "score": 6,
            "text": "Hah!  I responded to everything negatively LONG before social media was a thing.  But then again, I'm an asshole.",
            "title_similarity": "0.79768395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd5np2",
            "score": 5,
            "text": "Yeah jesus christ. I have a coworker who responds to absolutely EVERYTHING negatively. Its fucking awful and it eroded into me gently countering her, which she took terribly. On the plus side, we no longer speak and its back to being great to work there! Silence is blissful.",
            "title_similarity": "0.7764956",
            "sentiment_compound": 0.6596
        },
        {
            "id": "hgcumxp",
            "score": 42,
            "text": "Reddit is a depression circlejerk. Just want to point that out",
            "title_similarity": "0.5846077",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hgckeo4",
            "score": 68,
            "text": "Bravo!  I got away from toxic social media and now reading more books.  Always practicing my chess game.   Life is much better and got away from all these chicken Little’s, the sky is falling people.  That is why I like Reddit, can customize feeds.",
            "title_similarity": "0.69039166",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hgcx806",
            "score": 29,
            "text": "This is my wife. Dammit do I love her for everything she is, but I could buy her a million dollar home and she would find something negative about it...\n\nEdit: I get that there are negatives about most things in life, my point is that when the positives heavily outweigh negative, why even bring them to light?",
            "title_similarity": "0.7396238",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hgcib1g",
            "score": 240,
            "text": "This is a super important point.   And timely too because with the pandemic and how social interactions have changed to be a bit less 'face to face' and more online/virtual,  it's easy to let some of this personal decency slip away.\n\nAnd for people in the USA,  there is a crazy amount of political outrage/hatred too.   I've seen this with my sister, who travelled across the country to visit me, and instead of having a friendly loving visit,  I find her sitting on the couch and just thinking about political issues that she was just outraged about, literally sitting there thinking to herself and shaking her fists in anger.   wtf.   (spoiler,  she was angry about immigrants, and that anger is 100% manufactured by the tv shows she watches).",
            "title_similarity": "0.81755936",
            "sentiment_compound": -0.73
        },
        {
            "id": "hgcnvwe",
            "score": 10,
            "text": "I find it hard to not be pessimistic online but when out with my friends in person I'm a lot more positive and optimistic around them. Is this common?",
            "title_similarity": "0.4945316",
            "sentiment_compound": 0.9348
        },
        {
            "id": "hgcz5l2",
            "score": 11,
            "text": "This is a great pro tip. Most people arent self aware enough to realize this",
            "title_similarity": "0.557853",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgd06of",
            "score": 13,
            "text": "Yes, and internet culture has encouraged more subtle forms of negativity, namely \"snarkiness\". It's cool to sneer at something and call it \"basic\" or mindlessly share memes to quietly mock things to show how cool or above it all the poster is. I must admit I fell into this  a few times myself, until I read this blogger who caught herself sneering at a woman who was skipping across the street.  She realized there was nothing wrong with someone just enjoying herself even if it might seem odd to others, but what bothered her was her automatic response to judge her. And there is a point here. It's fun to call people \"Karens\" and feel self satisfied that we are better than the people we put into boxes, but it is really toxic to ourselves more than the targets. Life is hard for all of us, and if people find joy in harmless activities who are we to judge them ?",
            "title_similarity": "0.8161782",
            "sentiment_compound": 0.9695
        },
        {
            "id": "hgcuoi4",
            "score": 88,
            "text": "My brother in law is pretty negative about everything. Everything is either \"hot garbage\" or \"meh, it was ok\". On calling him out that his constant land mine field of negativity makes it hard to relate to him and based on all the other conversations we've had, I feel barely tolerated when I visit, I get told \"I know you think I hate you, but I don't\". \n\nWhat am I supposed to think when do much of what he says is \"fuck what other people think\" and \"how other people feel is their business, I can't help that\".\n\nBeing a negative person actively choosing cynicism leaks into the people in your life thinking you don't like them, leads to the people in your life walking on eggshells so they don't do anything to piss you off. It's emotionally abusive and manipulative. \n\nBeing an asshole isn't a personality to be proud of, it's a general lack of creativity.",
            "title_similarity": "0.84451056",
            "sentiment_compound": -0.9794
        },
        {
            "id": "hgcsk10",
            "score": 60,
            "text": "I had a discussion with a friend like that, and he was really enthusiastic initially because we seemed to share some core beliefs (or rather lack thereof). I consider myself an agnostic nihilist, but when I explained to him that to me, nihilism means that nothing has an inherent, predefined meaning, so you're free to give your life whatever meaning you like. You can just be happy.\n\nHe was \"disappointed\" because that's \"soft\" and if you're going through life being happy, you're basically \"playing on easy mode\" (his words). It was evident that he was full of anger, cinicism and spite, who was actually afraid to be happy because negativity, anger and misery were more familiar.",
            "title_similarity": "0.6611028",
            "sentiment_compound": 0.6142
        },
        {
            "id": "hgcsslw",
            "score": 17,
            "text": "My friend is currently like this and I think she's addicted to it.",
            "title_similarity": "0.4917289",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hgcp9ci",
            "score": 212,
            "text": "I have a friend like that. As much as I want to hang out with her it just ruins the whole mood. I hesitate to ask her how she is because it’s always a “everything sucks” type of answer and if I ever try to comfort her she ALWAYS brushes it off or counters it with more negativity. Like ok I might as well not even ask",
            "title_similarity": "0.7719102",
            "sentiment_compound": 0.7391
        },
        {
            "id": "hgclh5d",
            "score": 728,
            "text": "I just spent a week hosting an incredibly toxic relative who does this. Everything out of her mouth is critical, negative, dismissive, sneering. She just spent two months visiting the US from overseas, a week here, a couple of weeks there, and none of the family could stand her company. \n\nMy best takeaway from a week of her unbearable company was that some people are lonely through every fault of their own, and that I want to be better and more positive, myself.",
            "title_similarity": "0.7791065",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hgcsrr6",
            "score": 58,
            "text": "Hey, seeing as you've been through this do you have any tips on how to break the habit?\n\nA lot of my jokes are \"dark humor\", which in and of itself can be funny. But it also makes it way easier to open up negative topics (like making a joke about the state of our town/country leading to an actual very depressing conversation about the literal state of our town/country). But lately I've noticed that I don't really STOP there. I have a lot of baggage I'm working on with my therapist which has helped a little, but I still feel like every conversation I bring to the table is either something negative or about my toddler. And even when I try to make a conscious effort not to bring up a negative subject and instead try to let the other person lead the conversation and bounce off whatever they bring up my brain still jumps to negative subjects because that's just where my brain first connects. I don't like being so negative. I WANT to be a positive person! I just don't know how to bust that immediate habit of negativity being the \"go to\" even when I'm consciously trying NOT to. So far I've only been able to bit my tongue and work on small chit chat that leads to little conversation; I'd love to just talk like it's a regular day than have conversation pitter out because I couldn't think of any connection that wasn't negative!\n\nI thankfully don't directly shoot people down or anything, but if they bring up their family my brain jumps to my toxic family- negative connection. If they talk about how their kid is struggling in school my brain jumps to piling on the negativity by talking about how horribly the school system is managed and how awfully teachers and students alike are treated. Which, should definitely be talked about, but not every gosh darn day!! Any ideas would be appreciated here :(",
            "title_similarity": "0.780057",
            "sentiment_compound": -0.9512
        },
        {
            "id": "hgcrbmm",
            "score": 201,
            "text": "I was Debbie Downer when I had depression issues, and yeah, it's a drag. My wife got to the point where she didn't want to talk to me because I would put a negative spin on everything. I think chronic negativity and life outlook go hand in hand, so if someone is like this, they probably need help (at least I did).",
            "title_similarity": "0.7595322",
            "sentiment_compound": -0.0057
        },
        {
            "id": "hgcv9lf",
            "score": 248,
            "text": "This is me but it wasn't the internet: I have realized how I embody my parents' negativity.\n\nProblem is, I don't know how to stop. It's not that I think badly of people or my life but that I just always have negativity come out, I think nice thoughts but mostly speak when there's an annoyance or something \"wrong.\"\n\nSo how do I stop? It's like breathing, my brain just picks up on and spreads negativity without me thinking. It's so *easy* for me to criticize, as if I was trained for it, but I was never trained to stop or to spread positivity. It's not an anger management thing, it's like a personality defect",
            "title_similarity": "0.7273476",
            "sentiment_compound": -0.9344
        },
        {
            "id": "hgcr0un",
            "score": 2418,
            "text": "Especially when it comes to stuff other people are saying they like, it's really important not to tear it down, because that just stops conversation and it can come off as attacking the other person and their taste.\n\nA better way to express the same thing is to say \"I could never really get into it.  What about it resonated for you?\"  Then you can even express those negative opinions in a productive way that doesn't shoot the other person down.  \"Oh yeah, I can imagine that if I were more into that worldbuilding I would have really liked that movie.  I had difficulty getting into it because there were way too many characters.\"",
            "title_similarity": "0.71818435",
            "sentiment_compound": 0.4805
        },
        {
            "id": "hgcnddn",
            "score": 1292,
            "text": "Took me a long time to break this habit personally. I complain sometimes still buts like 99% of things I don’t mention if it’s negative. No one likes that stuff.",
            "title_similarity": "0.69683146",
            "sentiment_compound": -0.8037
        },
        {
            "id": "hgcsrkb",
            "score": 2251,
            "text": "It's also a quick way to lose all your friends. No one wants to be around someone who shits all over everything all the time. It's like asking to have a bad time.",
            "title_similarity": "0.767158",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hgcr0nd",
            "score": 3,
            "text": "Good point, I'm also trying to be more positive when talking to people. \n\nI only realized this the day when during coffee break 2 work colleagues started singing something in the lines of \"what's going on?\" and \"don't worry be happy\". It felt very cringe and I have tried to improve, but it's hard.",
            "title_similarity": "0.62353444",
            "sentiment_compound": 0.5347
        },
        {
            "id": "hgctvkk",
            "score": 1,
            "text": "FWIW, I had to call out a parent about that once. Every thing you’d bring up would be met with a negative comment. Eventually got tired of starting conversations with them because of it.",
            "title_similarity": "0.7717061",
            "sentiment_compound": -0.765
        },
        {
            "id": "hgcul1b",
            "score": 1,
            "text": "Too true.  It also sets you up to both fail and be miserable in every area of your life.  Far better to find the path to happiness and head in that direction and reject negativity where possible or where unproductive.",
            "title_similarity": "0.67769694",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hgcwaao",
            "score": 1,
            "text": "People actin like their favorite snarky internet critic",
            "title_similarity": "0.6707672",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hgcwhcq",
            "score": 3,
            "text": "Learn to curate your social media. All social media sites (reddit included) are massive algorithms that reward engagement, which often comes from controversial topics. Find communities and people that you enjoy and that don't negatively affect you and you'll be good to go.",
            "title_similarity": "0.58384466",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hgcwkv6",
            "score": 1,
            "text": "I had a very similar experience in my late teens/20s and it took a while to recognize and stay out of these negative bouts.\n\nI still fall into those moments from time to time but I’ve adapted the ability to pinpoint the reason for any true negative feelings and stop them from poisoning every thought I have.",
            "title_similarity": "0.7087374",
            "sentiment_compound": -0.8674
        },
        {
            "id": "hgcwnev",
            "score": 1,
            "text": "I’m this way and want badly not to be. How do I legitimately make this change?",
            "title_similarity": "0.4327355",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hgcwpe1",
            "score": 1,
            "text": "That's why I quit Facebook years ago",
            "title_similarity": "0.44915146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgcxke3",
            "score": 3,
            "text": "i had a friend who used to attack everything i did or liked and thats how we ended our friendship. i wish that she was a bit more positive and nice about the things i liked",
            "title_similarity": "0.7617552",
            "sentiment_compound": 0.9535
        },
        {
            "id": "hgcxo8v",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.17286375"
        },
        {
            "id": "hgcxobk",
            "score": 1,
            "text": "I can’t agree it more, saying or expressing negative things does resonate with internet more but it’s toxic to your way of thinking",
            "title_similarity": "0.8115901",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hgcxrih",
            "score": 1,
            "text": "I grew up angry.  I was angry at nearly everything in my life and the world around me.  I was racially insensitive and motivated by the fear that people different than me were bad.  If something was popular, it was stupid.  I lauded popular music and movies and thought the only way to be unique was to find the things outside the main-stream.\n\nLooking back, I'm not surprised I had pretty much zero friends growing up and in high-school or that those friends I did have didn't stay friends with me post-graduation.  I'm not even friends with people I went to college with, which is a place a lot of people form life-long bonds with others at.\n\nGetting older sure changed a lot of that.  I just stopped caring what others thought and quit trying to always be different.  I also lost a lot of weight and my world views changed drastically.  I was no longer afraid of being out in the world and feeling judged by my size and so accepting the normal and popular things has gotten easier as I can just be another person in the crowd and I don't stand out.\n\nDon't be angry.  It's not fun.  It'll shorten your life and make living and experiencing things miserable.  I wish I was as wise at 16 as I am at 35.",
            "title_similarity": "0.8319371",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hgcxyjv",
            "score": 1,
            "text": "Take it a step further. Make it a habit to turn negatives into positives. It'll do wonders if you're looking to build relationships and even your career, and demonstrate more maturity and more control of any situation. \"That's a lot of work. It is a great opportunity to display my capabilities\". Or if I can't be positive, I try to at least not make it sound whiny. \"Thanks for trusting my capabilities, but I'll definitely need another hand to help me out with this.\"",
            "title_similarity": "0.54520494",
            "sentiment_compound": 0.9577
        },
        {
            "id": "hgcy3wl",
            "score": 1,
            "text": "I'll admit, this hit home with me.  I've become much more cynical since I started using Reddit, and I've been noticing it more and more.",
            "title_similarity": "0.70767796",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hgcy6dt",
            "score": 2,
            "text": "Ooof. That explains why talking about how the SCOTUS legalized child labor isn't popular at parties. Nestle won 8-1. Oh, the case was a bunch of African enslaved children [forced to apply herbicide to on chocolate farms with zero protection equipment] suing Nestle for knowingly profiting from their enslavement.",
            "title_similarity": "0.6473546",
            "sentiment_compound": -0.6237
        },
        {
            "id": "hgcydql",
            "score": 1,
            "text": "I try not to be negative about things. \n\nBut Delta and Destiny 2 are making it REALLY FUCKING HARD.",
            "title_similarity": "0.58375514",
            "sentiment_compound": -0.6909
        },
        {
            "id": "hgcyfzl",
            "score": 1,
            "text": "I have taken this inspiration from a few TV characters recently. You know who everybody loves to be around? Ella from Lucifer and Ted Lasso. It’s not like they have easy lives or nothing bad happens to them, they just try to make the best of every situation and other people can’t help but enjoy being around them.",
            "title_similarity": "0.6348888",
            "sentiment_compound": 0.9315
        },
        {
            "id": "hgcyiks",
            "score": 1,
            "text": "I went through a similar phase in my early 20's after life had given me a hard time. I was negative, angry, bitter and in incredible pain. I realise now that I pushed a lot of people away. I'm glad I'm slowly getting back on my feet, and I'm lucky that some of my closest friends never gave up on me.",
            "title_similarity": "0.7910988",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hgcyrgq",
            "score": 1,
            "text": "I have various friends and family who often respond to stuff in a negative way even if it's usually a joke. I get that it's a joke but the effect ends up still being the same as per OP's title.\n\nI think some people are just wired this way and it's impossible to be any different for them even if self aware about the issue.",
            "title_similarity": "0.6936081",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hgcz1rn",
            "score": 1,
            "text": "Also known as the 9gag syndrome",
            "title_similarity": "0.11351769",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgcz3xt",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.17286375"
        },
        {
            "id": "hgcz5mq",
            "score": 1,
            "text": "I don't think it's just an online thing either, something about the modern world rewards ironic detachment and derides things that are genuine or sincere, and it's a trend we should rail against more than we do I think.",
            "title_similarity": "0.67594266",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hgcz69v",
            "score": 2,
            "text": "So true.  It's easy to think that expressing negativity towards things, especially popular and well-liked things, makes you look discerning and worldly.  In reality it just makes you look jaded and overly critical.  \n\nIt's fine to not like things, but better to say \"it's not for me\" than \"that sucks.\"",
            "title_similarity": "0.6111632",
            "sentiment_compound": 0.2546
        },
        {
            "id": "hgczh8u",
            "score": 1,
            "text": "You forgive other not for them but for your own self! Freedom from the ego is the way to go!\n\nBtw just curious what is an angry atheist phase?",
            "title_similarity": "0.6470389",
            "sentiment_compound": 0.7531
        },
        {
            "id": "hgczid8",
            "score": 1,
            "text": "Adding to this, how about not being negative online for the sake of negativity/karma. Internet culture rewards us there, but it's not helping anyone or yourself.\n\nAlso, it helps pulling yourself away from the need to get the useless karma on reddit. Saves time, energy, and stress.",
            "title_similarity": "0.6483444",
            "sentiment_compound": -0.1613
        },
        {
            "id": "hgczj5s",
            "score": 1,
            "text": "These life pro tips are just common sense lol.",
            "title_similarity": "0.3605389",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgczlef",
            "score": 1,
            "text": "A long time ago in a group chat someone was like I can't make it tonight I got a date.  And I was like oooo look everyone soandso has a date! And that person was like so what? And I was like I'm an idiot I'm sorry I'm spending too much time on reddit.",
            "title_similarity": "0.7055955",
            "sentiment_compound": 0.69
        },
        {
            "id": "hgd019s",
            "score": 1,
            "text": "I was once ranting about how much I hated this TV show in high school a few years ago and this girl asked me \"is there anything you do like?\"\n\nAnd I desperately wanted to say \"yes but you'd make fun of me for it because it's not popular or \"totally grown up\" but i just responded with a few \"acceptable\" reality TV shows that i like\n\nPay attention to those people too",
            "title_similarity": "0.8000118",
            "sentiment_compound": 0.7393
        },
        {
            "id": "hgd09qa",
            "score": 1,
            "text": "Did I write this? Holy shit, this is me. Been trying to break the habit for a long time.",
            "title_similarity": "0.53467417",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hgd0ahh",
            "score": 2,
            "text": "You could tell them that.  They might not like it, but it might help them. \n\nI think negative people tend to be folks who are deep down optimists, but life kicked them in the balls a few times, and negativity is their defense mechanism.  Expect the worst, and maybe get pleasantly surprised but never disappointed again. I am like this, and I wish I were not.  Having a kid sort of forces me to NOT be like this. I have to hype my kid up. I have to tell her how amazing she is all the time. And for once, I know I won’t be disappointed…. Because whatever she becomes I will be her number one fan.  But in other things I still tend toward the negative, just less so now.",
            "title_similarity": "0.7732488",
            "sentiment_compound": 0.8182
        },
        {
            "id": "hgd0eiv",
            "score": 1,
            "text": "The quote from ‘The Big Lebowski’ applies here:\n\n“You’re not wrong Walter…you’re just an asshole”.\n\nPeople put far too much stock in being “realistic” and trying to show how clever they are. It’s not an enjoyable way to live your life when you’re too proud to accept that your opinions aren’t shared by everyone else.",
            "title_similarity": "0.76021945",
            "sentiment_compound": 0.882
        },
        {
            "id": "hgd0gcw",
            "score": 1,
            "text": "TLDR - Don’t be a dick.",
            "title_similarity": "0.16517162",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hgd0rhw",
            "score": 1,
            "text": "Just remember, hating on stuff is not the same thing as a personality. Define yourself by what you like, not by what you dislike. Liking stuff is risky, because you are putting yourself out there and opening yourself up for criticism. Hating on stuff is defensive, a way of not really taking a stand.",
            "title_similarity": "0.622242",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hgd0zqz",
            "score": 1,
            "text": "I have a good friend who thinks that he is talking about everything critically, and I really do think it’s important to question art and look at it critically, but it’s also such a downer when it’s the only way he wants to interact with the world.",
            "title_similarity": "0.6448581",
            "sentiment_compound": 0.5346
        },
        {
            "id": "hgd178h",
            "score": 1,
            "text": "It's literally a meme on Reddit for the top comment on anything in /r/mademesmile or some other sub like that to be \"Waiting on the comments to tell me how this actually sucks\".",
            "title_similarity": "0.78310287",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hgd18qw",
            "score": 1,
            "text": "I’ve been like this to varying extents my whole life. I (at almost 56 🤦‍♀️) finally figured out that I do this because a) it is the only model both of my narcissistic parents showed me and b) anger and disdain were the only emotions it was at all safe to show and in fact I got a LOT of positive reinforcement for it.  Now that I understand the why, changing my behavior is a bit less challenging, but DAMN those neural pathways are DEEP. I find that when I get stressed out, over tired, etc. I revert almost immediately.  It just feels safe and comfortable and I HATE IT.  I’m committed to fixing this, but wow I have so much shame around it. \n\nThanks for your post! It’s good to know it’s not just me!!",
            "title_similarity": "0.63430244",
            "sentiment_compound": 0.5512
        },
        {
            "id": "hgd1kl8",
            "score": 1,
            "text": "I was so guilty of this. One day I realized I was really tired or being around some people that complained about EVERYTHING, and fortunately was able to connect the dots that if I want to have friends I have to stop being one of those people. Even if you really are as witty as you think, constant sarcasm and criticism of everything is such a drag, and criticism without providing solutions is nearly useless in most cases.\n\nSarcasm is also a shield for our own insecurities. Life is way better when you show your genuine efforts and are okay getting constructive criticism so you can improve and accepting that you will need to. Life is also better when you realize someone else's success doesn't diminish your own and you should just be happy for them.\n\nBe easy to please and you'll spend far more of your time being pleased instead of annoyed, and people really appreciate it when you can find something good to say about what they're doing.",
            "title_similarity": "0.84980536",
            "sentiment_compound": 0.6311
        },
        {
            "id": "hgd1lsu",
            "score": 1,
            "text": "Tell them, it's the truth and it isn't hurtful either. It could change someone's whole life. Wish someone would have told me exactly that when I was younger, they just called me an asshole lol",
            "title_similarity": "0.6354264",
            "sentiment_compound": 0.8617
        },
        {
            "id": "hgd1r6k",
            "score": 1,
            "text": "I have this idea that “internet culture” has bled into peoples driving habits. It’s so easy to be rotten to one another on the internet, and when your in your car, it’s sort of the the same rotten attitude towards other drivers. You’re kinda anonymous In your car, especially cars with blacked out windows, so you can act a fool by being an asshole driver because most of the time, you get away with it. Just as you would being an asshole on the internet. \n\nOf course, it’s not everybody. But man, I feel like there’s been a huge uptick in terrible, asshole drivers over the past five or so years. I’m probably sounding like bad internet habits = bad drivers. I’d guess that there’s a correlation and not direct causation at best.",
            "title_similarity": "0.8125042",
            "sentiment_compound": -0.3137
        },
        {
            "id": "hgd1zru",
            "score": 1,
            "text": "As if doing a lpt post is going to do something....  \n\n\n/s  \n\n\nNo really how did you do? it's a real struggle to stop juging everything or anilizing searching every default in every litle thing. Everytime i am alone i think about it but with people it is not controlled what a pain it is to be like that.  \nIt is to a point even if i am admirative of somthing people will thing i am criticizing it though not at all. I feel like it comes from self esteem issues + being raised as if knowing all is a good trait, so you'd have to prove you're better and understand better everything, from the movies you watch to the pasta you eat. resulting in toxic behaviour, seeking validation by negative attitude.",
            "title_similarity": "0.7574862",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hgd26ok",
            "score": 1,
            "text": "My dad is this way and I don't know how to break him of it. 60 years of thinking the world is out to get you really takes its toll",
            "title_similarity": "0.63196486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd2d9j",
            "score": 1,
            "text": "Pro tip dealing with confused patients getting out of bed unassisted. Walk in the room and say; Hey!  how are you instead of why are you getting up.\n\nGreet anyone in any situation in a positive way, assess and work from there.",
            "title_similarity": "0.479949",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hgd2gqt",
            "score": 1,
            "text": "Advice in a similar vein, although less relevant now with isolation, is that you cannot continually deny invitations out. If your friends ask you to go somewhere and you routinely say no they will stop asking altogether.",
            "title_similarity": "0.55455506",
            "sentiment_compound": -0.2415
        },
        {
            "id": "hgd2ivh",
            "score": 1,
            "text": "If you run into an asshole at Starbucks on your way to work he’s prob an asshole, if you run into an asshole during your commute he’s prob an asshole, if you run into assholes all day long you’re prob an asshole",
            "title_similarity": "0.6406705",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hgd2q8t",
            "score": 1,
            "text": "Reddit has a wonderful feature that's labeled for me as disable inbox replies. So wonderful.",
            "title_similarity": "0.53871286",
            "sentiment_compound": 0.857
        },
        {
            "id": "hgd2vs2",
            "score": 1,
            "text": "sometimes negativity is a coping mechanism sort of like self deprecating humor",
            "title_similarity": "0.49531326",
            "sentiment_compound": 0.0018
        },
        {
            "id": "hgd2xk2",
            "score": 1,
            "text": "Didn't we just have a LPT on this last week?",
            "title_similarity": "0.24138996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd31wp",
            "score": 5,
            "text": "This is going to be 1 incredibly ironic and tone deaf controversial sort! I'm going in!",
            "title_similarity": "0.5916148",
            "sentiment_compound": -0.49
        },
        {
            "id": "hgd3224",
            "score": 1,
            "text": "I had a SGT tell me one time about stuff like this, except it was Army style. We were on some police call bullshit and I said it sucked. A lot. I wanted to be sleeping. My SGT took me to the side and told me to shut up, that 'everyone knew it sucked, but I was the only one saying anything. That shit is annoying.' Helped me realize to break this habit",
            "title_similarity": "0.7467241",
            "sentiment_compound": -0.9201
        },
        {
            "id": "hgd3bs4",
            "score": 1,
            "text": "What I hate is that someone gives me some random bullshit internet \"fact\" that they saw, without any context (they saw a headline or tweet and that is all they know about it) and I naturally ask about it and sound interested and skeptical, and they get pissed off because I called them out.",
            "title_similarity": "0.80774754",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hgd3obz",
            "score": 1,
            "text": "It's a huge turn-off on the internet too, especially when someone is expressing joy. \n\nLPT: Don't needlessly shit on people's happiness.",
            "title_similarity": "0.67803484",
            "sentiment_compound": 0.9122
        },
        {
            "id": "hgd3r0i",
            "score": 1,
            "text": "I think the big change comes when you go from critiquing things to creating things. At least in the creative fields people seem to start to understand the insane investment it takes to create and launch literally anything. This is what makes “cancel culture” so irritating.\n\nIf you invest any time and effort in creating a thing you’ll likely be a lot more understanding when others make mistakes, or perceived mistakes and won’t rush to hammer them.  \n\nI’ve worked on a Kickstarter over the past year and the  network of people I’ve met along the way have been incredibly supportive. There are people waiting in the wings trying to cancel everything but what you quickly realize is they are either terribly untalented or even worse, are afraid to share anything they’ve created at all.",
            "title_similarity": "0.74110574",
            "sentiment_compound": -0.764
        },
        {
            "id": "hgd3twf",
            "score": 1,
            "text": "Few men are wise enough to acknowledge when they need help. Fewer yet are those strong enough to get it. ~Dalinar Kholin",
            "title_similarity": "0.4715575",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hgd3wvy",
            "score": 1,
            "text": "Different strokes for different folks, people! Don't shut people and their interests down... It may not be tied up in your sense of self, but it may be for them.",
            "title_similarity": "0.43202183",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hgd469q",
            "score": 1,
            "text": "This was a hard thing for me to learn too. Once I started focusing on the good and living with gratitude, it’s been amazing how much my life has improved.",
            "title_similarity": "0.49936867",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hgd48av",
            "score": 1,
            "text": "Discovering this about myself and acting to change it was one of the best things I did for my own mental health. How do you tell others about this without coming off like a huge dbag?",
            "title_similarity": "0.5868645",
            "sentiment_compound": 0.6586
        },
        {
            "id": "hgd49wv",
            "score": 1,
            "text": "I was downvoted to death for telling someone to have some faith and to stop being a pessimist.",
            "title_similarity": "0.616277",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hgd4f4z",
            "score": 1,
            "text": "There is no bigger turn off than when you meet someone and they're negative about EVERYTHING. A lot of it is justified but when you immediately go on about how shitty this country is and the economy and blah blah blah I dont want to get to know you. It might work in their circle with people they already know but it's not worth it if i dont know you.",
            "title_similarity": "0.78682417",
            "sentiment_compound": -0.9028
        },
        {
            "id": "hgd4gkf",
            "score": 1,
            "text": "damn I am the same, just still very negative. I don't enjoy a lot of things, so it is difficult for me to find enjoyment in what others have.\n\nI still have certain things I enjoy a lot but they are kind of niche and specific.\n\nI noticed how my negativity affected my friendships\n\nWe used to be 4 very close friends with a lot of overlap in interests and hobbies. Had a band together and hung out every weekend and sometimes even more. Even went on trips together for vacation.\n\nEventually my friends tried out new stuff, like certain video games, tv shows and music.\n\nWe watched sitcoms together (the regular stuff at the time like how I met your mother, big bang theory, seinfeld and even alf) and I honestly hated it.\n\nThey started to watch TV hows like Breaking Bad and Game of Thrones. I watched a few episodes with them, but didn't like it at all.\n\nMeanwhile I started to get into anime and wanted my friends to watch some with me, but I had a hard time convincing them.\n\nOne of my friends started to listen to hip hop. I hate hip hop. and so we drifted more and more\n\nTheir taste in music and mine grew apart. They interest in movies and shows became kind of mainstream, while I kept to less popular stuff like anime (back then it was certainly a lot less popular) while completely shunning any real life action shows.\n\nthey played a variety of video games while I pretty much stuck to only one or two I enjoyed and didn't touch anything else.\n\nEventually we would meet less and less and then not at all anymore.\n\n5 Years later and I have lost all contact to them, though in 2019 one contacted me again and we play some MTG together. still my dislike of almost everything they brought up certainly killed off that friendship. however I just couldn't bring myself to enjoy the things others enjoyed. And to this day it is kind of the same, just more extreme. I lost all my interest in gaming with very minor exceptions and I never touched Netflix in my life.",
            "title_similarity": "0.77342975",
            "sentiment_compound": 0.9931
        },
        {
            "id": "hgd4ihp",
            "score": 1,
            "text": "Life itself tends to rewards you for pessimism. You tend to be more \"right\" then optimist both by unlikelyness of success and self fulfilling prophecy of thinking it'll fail.",
            "title_similarity": "0.5835582",
            "sentiment_compound": 0.6666
        },
        {
            "id": "hgd4j8h",
            "score": 1,
            "text": "My father was and still is this way, that’s where I got this habit. My best friend calls us both curmudgeons…  I’ve definitely gotten better about it but it’s a difficult habit to break, it essentially becomes a personality trait",
            "title_similarity": "0.7313742",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hgd4nru",
            "score": 1,
            "text": "Yup I agree. I actually had to stop talking with my father because of this very thing. I'm not sure if it's age or internet or both, but every statement he makes is full of doom, gloom, pessimism, and other negative concepts....it's hard to communicate with him anymore so I just gave up altogether because I can't be around people like that, family or not. Every day is the last day before Armageddon, the govt has been trying to kill him with food and vaccines, \"they\" are out to \"get us\" in every possible way....I've suspected he may be heavily schizotypal or something along those lines for some years now, and it seems to be getting worse.\n\nThe internet definitely is no help there for him and his echo chamber. All he does is search for confirmation bias, using only the batching craziest internet sites, then has the balls to call himself a \"researcher\", and when u try to ask him about SOURCES for his \"research\", you only get replies like \"blacklistednews\" and that's If your lucky, most of the time his \"sources\" he can't quite remember. It's sad really, and due to his level of non-education (of course it's not necessary for everyone, but in his case it really hinders him), or ability to at least think critically or look at all sides of an argument are just not there. Absolutely a lost cause. Thanks for letting me vent lol.",
            "title_similarity": "0.79625916",
            "sentiment_compound": -0.9762
        },
        {
            "id": "hgd4pju",
            "score": 1,
            "text": "I was raised in the 80s where whoever made the crowd laugh harder at the other person won... Or, whoever beat up whoever made the crowd laugh harder won.\n\nIt's a really difficult mentality to break out of, but it's worth the effort",
            "title_similarity": "0.7246034",
            "sentiment_compound": 0.8296
        },
        {
            "id": "hgd4tzc",
            "score": 1,
            "text": "Had a friend like this. He was a super contrarian as well. I remember I told him “hey man you being a contrarian and nit picking everything can really come off abrasive” and this mf (like a true contrarian) was like “yeah but I’ve really grown to like that about myself”",
            "title_similarity": "0.7385143",
            "sentiment_compound": 0.9169
        },
        {
            "id": "hgd596h",
            "score": 1,
            "text": "my mother is a very, VERY negative person and it fucked me up emotionally. I think she's better now that she realizes she's been shitting on my accomplishments and hobbies since I was a kid, but it's a little too late for that as I am now an adult. I'm 23 now and have to go to therapy to try and fix my self-esteem.",
            "title_similarity": "0.77458787",
            "sentiment_compound": -0.6861
        },
        {
            "id": "hgd5cv5",
            "score": 1,
            "text": "This is a big reason I can’t get along with anyone. Every Discord I join is an echo chamber of whining about everything and everyone rewarding the complainers. If I play games with anyone the conversation is always about how bad the game is, how shit the company making it is, etc.",
            "title_similarity": "0.8660858",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hgd5d1p",
            "score": 1,
            "text": "I don’t know if Abraham Lincoln actually said this, but it’s widely attributed to him “for the most part people are about as happy as they decide to be“",
            "title_similarity": "0.543587",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hgd5dvq",
            "score": 1,
            "text": "This makes me want to cry to hear someone else express this type of sentiment.",
            "title_similarity": "0.552238",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hgd5id6",
            "score": 1,
            "text": "How did you change?",
            "title_similarity": "0.08800353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd5ijd",
            "score": 1,
            "text": "I find optimism more off-putting than pessimism. I assume people who are overly-optimistic are just too dumb to know otherwise.",
            "title_similarity": "0.5222111",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hgd5ix1",
            "score": 1,
            "text": "I can related a lot to this, in my 20's me and the bulk of my friends were pretty much the same, we would constantly be talking shit about everything and everyone. Things got old, so nowadays when i say something and someone just craps on it because they still think its cool i just ignore, move along and feel sad for them cause they never moved past it.",
            "title_similarity": "0.7634625",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hgd5jt7",
            "score": 1,
            "text": "Pathological optimism is worse than pathological pessimism",
            "title_similarity": "0.433127",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hgd5uih",
            "score": 1,
            "text": "This is why I'm not friends with anyone I've ever met from the state of New York",
            "title_similarity": "0.4378429",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hgd5x14",
            "score": 1,
            "text": "I'd rather have a conversation with Rusty than with the Marty.",
            "title_similarity": "0.4815212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd64yq",
            "score": 1,
            "text": "When I was in High School I thought I was smarter than everyone and too cool for everything.  Luckily this was before the internet and I grew out of it but it is true that people hate hanging with people that are always negative.  I know I turned a lot of people off and lost potential friends.",
            "title_similarity": "0.78754246",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgd6622",
            "score": 1,
            "text": "Stay away from neo liberals or alt righters. The worst people on planet earth.",
            "title_similarity": "0.5970564",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hgd698h",
            "score": 1,
            "text": "My gf learnt this habit from her family. Everything is say needs to get shit on. It wasn’t until I overheard her tell an athlete of hers that she could be anything in the world and the WNBA was a sure thing for her, that i realized that the behaviour was isolated to me only.\n\nAny dream, idea, or thought I shared got shat on.",
            "title_similarity": "0.6459048",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgd6cmo",
            "score": 1,
            "text": "Honestly such a good tip and you either have to have good friends/family who will be upfront with you about it or you manage to gain some self awareness by noting how isolated thing got. Personally I realized I was acting this way. Luckily no one confronted me about it, but it got to a point where I would wonder why I said something slightly negative about what other people are just trying to connect and share with me.\n\nFor me, I’ve come to realize I was acting this way when I felt nothing was going right for me. Kinda a projection of how I was feeling. Not sure if it will work for everyone, but I think finding a hobby or something that YOU personally like and get enjoyment out of really changes things. Because then you are excited to share something and then can see how someone tearing that down would be hurtful.",
            "title_similarity": "0.6507178",
            "sentiment_compound": 0.8762
        },
        {
            "id": "hgd6d1d",
            "score": 1,
            "text": "Yup..  I try to limit my negativity towards shit that's intentionally harmful or bad.",
            "title_similarity": "0.46605048",
            "sentiment_compound": -0.886
        },
        {
            "id": "hgd6fpb",
            "score": 1,
            "text": "\"If you can't say anything nice, don't say anything at all.\"\n\n~Bambi",
            "title_similarity": "0.36626664",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hgd6hpn",
            "score": 1,
            "text": "\"Internet culture rewards us for pessimism\"  So damn true.  At times it feels like it's a race to see who can come up with the most cynical comments or find various ways to display how little they care about a particular topic.  Especially when it comes to gaming communities.  People that are optimistic or generally positive will always get push back.",
            "title_similarity": "0.8309109",
            "sentiment_compound": 0.8232
        },
        {
            "id": "hgd6ifg",
            "score": 1,
            "text": "That's exactly how I behave so I can be left the fuck alone. \n\nBut, why would you do this if you explicitly WANT to engage in relationships/conversations?! It's amazing how much common sense people lack TBH\n\nGlad to hear you figured it out eventually",
            "title_similarity": "0.6542277",
            "sentiment_compound": 0.8871
        },
        {
            "id": "hgd6k3s",
            "score": 1,
            "text": "I used to do this shit so much oh my god.  And I would always justify it by putting the blame on the other person too.  I \"told it like it is\" and always hid behind the rhetoric that if somebody took offense,  they were soft or didn't like the \"truth\".\n\nNo Guerrin you were just a shitbag who was insensitive.  I'm not sure what exactly woke me up to this and let me self analyze but I feel I'm a lot better for it now.",
            "title_similarity": "0.787717",
            "sentiment_compound": -0.3489
        },
        {
            "id": "hgd6sbz",
            "score": 1,
            "text": "I used to be a huge piece of shit myself. Slicked back hair and sloppy steaks at Truffoni's, yeah I used to be a real piece of shit. But people can change.",
            "title_similarity": "0.71031857",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hgd6utn",
            "score": 1,
            "text": "for the record you can totally tell them that. they might not listen immediately but to some it will plant the seed.",
            "title_similarity": "0.4583186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd73fj",
            "score": 1,
            "text": "I just wish new friends wouldn't talk about 'belief systems'   \nI'm perfectly fine listening to your interests I'm not interested in, playing games with you that maybe you like that I don't really care for.   \nBut I can't abide people who talk about vibes and energy. The second someone whips their daily horoscope out, everything out of their mouth to me just sounds like...... \"duhhhhhhhrrrrrrrrrrrrrrrrrrrr\"",
            "title_similarity": "0.7510822",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hgd79bh",
            "score": 1,
            "text": "Jokes on irl people\n\nI don't want to turn them on.  Less interactions is less chances for something to go wrong.",
            "title_similarity": "0.44886628",
            "sentiment_compound": -0.2059
        },
        {
            "id": "hgd7cdd",
            "score": 1,
            "text": "That's why I'm a dick online and nice in person. You gotta know your audience.",
            "title_similarity": "0.6577503",
            "sentiment_compound": -0.128
        },
        {
            "id": "hgd7dwg",
            "score": 1,
            "text": "Haha you could also phrase this as “responding positively to everything is a wonderful habit to build. Face-to-face interactions benefit especially from positivity and are a great place to practise”\n\nI had to write that out because I too am really trying to change my habits for the better. I used to think that positivity was kind of fake, but I’m starting to get better at just looking through a different lens :)",
            "title_similarity": "0.65581536",
            "sentiment_compound": 0.9645
        },
        {
            "id": "hgd7g9q",
            "score": 1,
            "text": "The internet is cult-like confirmed.",
            "title_similarity": "0.3625201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd7jbf",
            "score": 1,
            "text": "This is a super tough thing to sort out, major kudos to you, OP. I also want to acknowledge that sometimes this habit can be born out of tremendous trauma. It's a sad truth that some folks in the world have to deal with horrific circumstances, terrible choices by their parents/family, and more. To be able to recognize that the rationalization of negativity is a product of this is, imho, one sign of healing.\n\nThat said, I do think the ability to deconstruct or break down an idea without that inherent negativity is actually a really great skill both in interpersonal and intellectual/professional settings. The key of course is to have a different goal for the deconstruction, whether it is to reach a compromise or new understanding of an idea or to teach someone else.",
            "title_similarity": "0.7485406",
            "sentiment_compound": 0.2721
        },
        {
            "id": "hgd7m2i",
            "score": 1,
            "text": "This is much older than the internet lol",
            "title_similarity": "0.20288163",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgd7pdy",
            "score": 1,
            "text": "Been watching baseball with my dad this year and I've realized he is negative about everything. Game is going well, but they put in a pitcher he doesn't like? A batter he doesn't like comes to the plate? Immediately pessimistic and talking shit about OUR players... Like why? Especially with baseball where failing at the plate is the most common outcome. It's so tiresome to just be worried and assuming the worst will happen all the time, just have fun and be hopeful... At least with something as simple as a sport. \n\nCoincidentally my parents have been on Facebook an unprecedented amount in the last year or so, strange how I immediately notice the negativity. \n\nI know this isn't exactly what this is about but it came to mind",
            "title_similarity": "0.75796056",
            "sentiment_compound": -0.9727
        },
        {
            "id": "hgd7u7e",
            "score": 1,
            "text": "Fuel your social networks engagement with this one cool trick!",
            "title_similarity": "0.35267583",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hgd7v51",
            "score": 1,
            "text": "I've been watching Ted Lasso and while there's no way I could ever reach his level of positivity, I am working to at least not go immediately to the negative. \n\nJust in the first steps of it so it takes a great effort of will to do so, but hoping it will get easier as time passes.",
            "title_similarity": "0.628187",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hgd7xmd",
            "score": 1,
            "text": "Growing up, my father was clear that he *knew* almost all celebrated traditions were just people pretending to be cool or smarter than they were. That everybody at all times was just pretending to be good. There wasn't anything you could just naturally enjoy without putting on a performance of some kind. If you \"Cried\" looking at something, you were faking for attention. \n\nThis has affected me, it didn't used to, but it does now. I just can't bring myself to care about the things that people enjoy. There's no point. It's easy to pretend to care, when you're with people, but it's embarassing",
            "title_similarity": "0.71021235",
            "sentiment_compound": 0.972
        },
        {
            "id": "hgd7zck",
            "score": 1,
            "text": "Yeah I used to do that, and was the type that \"knew\" if I answered honestly to people who asked how I am doing they wouldn't care. I think I was still right, because i would have been a cringe lord. But I have actually had deep and honest conversations with strangers by framing my sentences in a less negative way.\n\nLike instead of \"I'm shitty and life sucks\"\n\nI'll be like \"hmm, kinda rough right now, but working through it\"",
            "title_similarity": "0.70352745",
            "sentiment_compound": -0.2778
        },
        {
            "id": "hgd8bmi",
            "score": 1,
            "text": "Some tips to stay away from negativity. Don't watch too much news or media in general, a lot of negative shit about the world. Avoid toxic and negative people. Don't get drunk on social media. don't play toxic video games. Cut some of your porn habits, its not great. \n\nSome things to do. Listen to happy music as well not just sad emo stuff. Play fun games. Have fun people around you that like to party. Play sports or go to the gym. I like the gym it's super great makes you feel better. \n\nHope these help",
            "title_similarity": "0.66991246",
            "sentiment_compound": 0.9641
        },
        {
            "id": "hgd8c6i",
            "score": 1,
            "text": "Haha this on reddit? Should be your target audience but far too dumb to understand",
            "title_similarity": "0.66860366",
            "sentiment_compound": -0.5346
        },
        {
            "id": "hgd8chq",
            "score": 1,
            "text": "My wife points out to me that I \"always focus on the negative\", where I basically do just that because I'm always looking for humor in irony. It's a bad habit of living on line for many years and I think I need to start looking for joy in things in general. You don't notice it yourself unless someone points it out sometimes.",
            "title_similarity": "0.8025746",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hgd8ewg",
            "score": 1,
            "text": "When you get destroyed in a video game, don’t think of it as the game shitting on you and the world sucking, think of it as you being off your game and needing a break. If that doesn’t work for you, practice. If that fails, then accept that you shouldn’t play too competitively. \n\nThe day i began playing games as fun and not caring about my stats or ratio was the day my life got better. Screaming into the party chat is fucking embarrassing and whining to those friends is sad. Laugh it off.",
            "title_similarity": "0.81770414",
            "sentiment_compound": 0.0555
        },
        {
            "id": "hgd8o5i",
            "score": 1,
            "text": "It's literally impossible to escape it living in England. It's either full blown  negativity, or negativity dressed up as humour. The UK related subs are the worst. A mixture of whinging about everything and entitled attitudes.",
            "title_similarity": "0.7140753",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hgd8rva",
            "score": 1,
            "text": "How did you break out of it? I feel like I’ve fallen into one as of late. I think it’s partially due to my worsening work life balance and stress at work.",
            "title_similarity": "0.6814594",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hgd8t64",
            "score": 1,
            "text": "I've been wondering on the evolutionary purpose of hate.\n\nWhy do we hate? What benefit does anger play in our lives?  Why is it so easy to hate?",
            "title_similarity": "0.6917994",
            "sentiment_compound": -0.8158
        },
        {
            "id": "hgd8xem",
            "score": 1,
            "text": "The very reason I came off Twitter. I'd find myself looking for people who'd done some slight wrong and enjoy watching people rip them apart.",
            "title_similarity": "0.7679266",
            "sentiment_compound": 0.0334
        },
        {
            "id": "hgd8xkg",
            "score": 1,
            "text": "Can we just go ahead and make this a full class in early life?  Maybe before high school in the US.  Or maybe it should be a PSA on TV every day.\n\nBut seriously....it changed my life and everyone should hear this often.",
            "title_similarity": "0.5801861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgd8xmf",
            "score": 1,
            "text": "I’ve caught myself getting into this habit recently. What are good steps to get yourself out of it?",
            "title_similarity": "0.509979",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgd8ymg",
            "score": 1,
            "text": "It's good you noticed it and acted on it! It takes a lot for some people to change, a 180 in personality if you will. I've been working on it myself for a while now and interactions have been night and day compared to before",
            "title_similarity": "0.5752788",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hgd906q",
            "score": 1,
            "text": "As addendum, if someone tells you you are “just negative,” reflect on it but don’t accept it as a valid counter-argument.",
            "title_similarity": "0.49618378",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hgd918e",
            "score": 1,
            "text": "Smile and the world smiles with you, cry and you cry alone",
            "title_similarity": "0.49990848",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hgd91c6",
            "score": 1,
            "text": "My turn-ons are long walks on the beach and cookies. You can be a bastard, as long as you got the cookies.",
            "title_similarity": "0.5772766",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgd94a2",
            "score": 1,
            "text": "Hey, good way to break this habit.\nEvery night before bed think about 3 great things that happened today.\n3 things you did that were positive.\n3 positive things you did for others.\n\n\n\nIt's hard at the start but gets easier and subtly changes your perspective.",
            "title_similarity": "0.5849393",
            "sentiment_compound": 0.891
        },
        {
            "id": "hgd95id",
            "score": 1,
            "text": "People on the internet are inherently defensive, hostile, and negative, even in the face of diplomacy and tact. I legitimately think that this will always be the case and that trying to change people in that regard is fruitless.",
            "title_similarity": "0.7869009",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hgd9b3z",
            "score": 1,
            "text": "Finally a great LPT that shares awareness and practicality instead of just trying to tell people how to think.",
            "title_similarity": "0.28796232",
            "sentiment_compound": 0.743
        },
        {
            "id": "hgd9ha5",
            "score": 1,
            "text": "I too was very negative in my younger years. My backstory isn't fun so I have plenty of stuff that isn't my fault but I have to deal with. Enter the bad vibes. Now I am a bit older and I have been through enough to keep me level headed and peppy when needed. \n\nI still don't like people but my professional decorum has greatly improved after it all. It is tough, takes effort and a follow through is needed to get you self centered and in a good mental space.",
            "title_similarity": "0.7773758",
            "sentiment_compound": -0.3493
        },
        {
            "id": "hgd9sii",
            "score": 1,
            "text": "Stop making yourself the butt of the joke, as well. You'd be surprised how much it changes your outlook on yourself.",
            "title_similarity": "0.6572798",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgd9zi9",
            "score": 1,
            "text": "This is great advice.   I think some people think of the negatives to prepare for themselves for the worst case scenario.   However, many times the worst case never comes and many times something better comes along.\n\nThe biggest thing I’ve learned about life is something is only impossible if you say it’s impossible.   Otherwise there is still a chance.",
            "title_similarity": "0.7386995",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgda0oh",
            "score": 1,
            "text": "But, what if your life is so clippingly crap and you litterally don't have anything good to talk about? \n\nBlindly handing out compliments and \"positive\" vibes for me atleast, was damaging to my mental state. As I felt I couldn't \"be myself\"",
            "title_similarity": "0.7423066",
            "sentiment_compound": -0.4454
        },
        {
            "id": "hgda3s8",
            "score": 1,
            "text": "I got a (thankfully) early-ish wake-up call to this:  in eighth grade I moved across the country (CA to VA) and wasn't handling it well. I was angry my life was uprooted,  and became spiteful, negative and generally obnoxious to be around.  I had managed to still somehow make a small group of friends.            \n           \nOne day I remember sitting with them talking,  and I had apparently gotten to be too much for one girl who,  after I said something negative, snapped \"Do you EVER stop complaining?\" I hadn't realized how bad I was til that moment. Can't say I flipped 180° from that day forward, but it helped me be more conscious of how I am to be around",
            "title_similarity": "0.7989291",
            "sentiment_compound": -0.7455
        },
        {
            "id": "hgda7b7",
            "score": 1,
            "text": "[South Park Episode ](https://youtu.be/zxRFQ_333_Y) highlights this phase/way of thinking/mentality and it's gold. We've all been through it or have been trapped within it multiple times. Good LPT to highlight in case we've wondered and lost our way again. Makes it easy to identify and do something about it. Some people tell themselves that they're not happy unless they're unhappy but I look at that as an excuse to stop working on yourself and how you are around others.",
            "title_similarity": "0.7292185",
            "sentiment_compound": -0.318
        },
        {
            "id": "hgda8e4",
            "score": 1,
            "text": "I’m in this post and I don’t like it!\n\nSeriously though, trying to do a better job of this.\n\nSome part of me sees providing criticism as a way to identify an area in which I can make something better, but sometimes it doesn’t come off as constructive as I intend it to. Could it be the way in which I offer said criticism?",
            "title_similarity": "0.6209836",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hgdah96",
            "score": 5,
            "text": "I think it’s the opposite.  Social media has given people bubbles they can run to where their ideas and opinions aren’t often challenged.  I see it on Reddit all the time - this idea that not liking something or having a negative critique of something especially when it comes to art and media is met with accusations of being “toxic.” People have gotten so used to having others in their online spaces pat them on the back that they immediately take offense to nuanced arguments or any critique that isn’t immediate praise.",
            "title_similarity": "0.8768836",
            "sentiment_compound": -0.8298
        },
        {
            "id": "hgdahi9",
            "score": 1,
            "text": "If I complain I at least try to make it funny.",
            "title_similarity": "0.38473144",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hgdaz2e",
            "score": 1,
            "text": "My job at work is a trouble shooter, non an efficiency helper. I'd rather think critically and be pleasantly surprised than think positively and and positively wrong.",
            "title_similarity": "0.689913",
            "sentiment_compound": 0.872
        },
        {
            "id": "hgdb1l2",
            "score": 1,
            "text": "“Think of how stupid the average person is, and realize half of them are stupider than that.”\n\nIf your concern in life is making these people happy then that's great. Your doing God's work. Carry on, cause your much stronger than me.",
            "title_similarity": "0.68901277",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hgdb6sa",
            "score": 1,
            "text": "I'm still fighting to break out of this negativity thing as well. I usually comes with mild depression.",
            "title_similarity": "0.64860344",
            "sentiment_compound": -0.8391
        },
        {
            "id": "hgdbcmj",
            "score": 1,
            "text": "I needed this advice, it's a good distinction to separate online from real and I didn't know I needed to see this until now, thank you so much.",
            "title_similarity": "0.57715946",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hgdbdms",
            "score": 1,
            "text": "Stupid question here: I have a friend who is the WORST case of negativity I've ever met. At first, I wanted to be a sounding board for him because I misjudged how bad off he was (I think I thought I could save him). I want to help him, but I suspect I can't. Should I start distancing myself?\n\nOne of my problems is when he gets so dark he starts wishing for death. Won't I be an evil person if I let him suffer alone?",
            "title_similarity": "0.7948229",
            "sentiment_compound": -0.9802
        },
        {
            "id": "hgdbiv8",
            "score": 1,
            "text": "The reason why my sisters and I avoided including my brother into certain conversations... No, i want to talk about how amazing XYZ is, not hear about how horrible and stupid it is (and by extension, why I'm horrible and stupid for liking it)",
            "title_similarity": "0.78185177",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hgdbj3k",
            "score": 1,
            "text": "I, too, used to be negative nelly. Someone I cared about told me to \"Judge less, be more\" \nIt took awhile for that to sink in. \n\nIt is easy to tear things apart, but the satisfaction of contributing to make a positive change is a higher level of living",
            "title_similarity": "0.6618638",
            "sentiment_compound": 0.882
        },
        {
            "id": "hgdbjov",
            "score": 1,
            "text": "The most insidious realization for me, is that even this message itself is negative!!!! I do the same, haha. Example, so you can pull the curtain back . . . a rewrite for contrast\n\n\"LPT: Respond to everything from a positive standpoint is an amazing habit that is hard to keep up! Internet culture does not recognize positivity, but during your personal interactions it is a huge turn on.\n\nI've come to positivity later in life, and it did not come without effort. <snip all negative>\"\n\nActually . . . in re reading . . . I'm not actually sure what the positives are. Could be a cool exercise, and a realization that this message is still within \"the complaining cycle\". Break free!\n\nAgain, Positives are \"towards an outcome\". What will happen if I do something. Negatives are \"away from a pain\". What I avoid by doing something. So . . . ironically this is still negative. But lets go further. Here are some positives. Some tools follow:\n\n1. \"Yes and\" is a great way to add on, vs saying yes but. So when someone says \"I think climate change is not real\". I say \"yes it is hard to measure, and while that may be the case we can still actually take charge of the environment to improve quality of life. So even if a person do not believe in climate change, it does not negate the fact that we can grow animal life and enhance the earth.\"\n2. A goal setting practice. I experience, every day, all the time, issues: Like today my friend was late. It bothered me. So I said \"Next time if we pick a specific time it will be faster and we get to hang out more.\" They responded \"totally\"\n3. Ideas. When someone shares an idea I don't agree with, I say \"Cool? And how do you incorporate this fact?\" They get curious, and suddenly we are learning together.\n\nBest of luck all!",
            "title_similarity": "0.8533795",
            "sentiment_compound": 0.9946
        },
        {
            "id": "hgdblfh",
            "score": 1,
            "text": "glad I caught this at a young age",
            "title_similarity": "0.17216702",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgdbsfu",
            "score": 1,
            "text": "At the same time, if you perpetually respond with positivity it leads to people walking all over you.   This post sucks",
            "title_similarity": "0.68824625",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hgdbsmb",
            "score": 1,
            "text": "I mean, I'm still extremely pessimistic but I don't shit on what other people enjoy because why would I ruin their good time?",
            "title_similarity": "0.65370435",
            "sentiment_compound": 0.7131
        },
        {
            "id": "hgdbtsl",
            "score": 1,
            "text": "Fr like that one girl in my class",
            "title_similarity": "0.30509374",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgdbu8q",
            "score": 1,
            "text": "A friend of mine in college does something like this. Anything I say, her instinctive response to it is \"no.\" \n\n\"Why don't you watch this series? It's brilliant.\" \n\nNo. \n\n\"Hey can you help me out with this problem?\"\n\nNo. \n\n\nI'm only just realising that what I face is rather toxic and problematic.",
            "title_similarity": "0.7426244",
            "sentiment_compound": 0.7604
        },
        {
            "id": "hgdbyzp",
            "score": 1,
            "text": "This is the Post of the day IMO.  If more of us could see this, the world would be far better for it.",
            "title_similarity": "0.4450454",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgdc8pc",
            "score": 1,
            "text": "ex mod of r/collapse?",
            "title_similarity": "0.28148544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdcbmr",
            "score": 1,
            "text": ">I actually remember alienating potential new friends by shitting on every movie/game/activity/belief system they brought up\n\nThat's being needlessly nasty, not being negative. You shouldn't confuse them. You can absolutely be non-receptive and uninterested without being a dick about it. Letting go of that behaviour is undeniably great, you should be proud of yourself for it and it's something I wish more people would pick up on. If it's made you more interested in people, then more power to you, but that honestly hasn't happened for me.\n\nI'm in my late 20s and most people are still boring in my eyes. Doesn't mean I won't be kind with everyone to the best of my ability, but that's as far as I'm able to go because I can't fake interest in other people or, say, keep a conversation about one of their hobbies going.",
            "title_similarity": "0.7850547",
            "sentiment_compound": 0.9519
        },
        {
            "id": "hgdcfph",
            "score": 1,
            "text": "My family has fallen into the negative trap and it drives me nuts and makes me not really want to be around them. It’s not totally unwarranted there’s some negative shit going on for sure but I really can’t spend what little free time I have rehashing the same shit over and over.  While I feel a little bad about it I’m most happy on weekends that I don’t have to be around them.",
            "title_similarity": "0.78437495",
            "sentiment_compound": -0.809
        },
        {
            "id": "hgdch8c",
            "score": 1,
            "text": "I find it a turnoff on the internet too. Am I old?",
            "title_similarity": "0.49741578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdchlx",
            "score": 1,
            "text": "One of my favorite sayings \"if you see one asshole a day then they're an asshole, if you see nothing but assholes all day then you're the asshole\"",
            "title_similarity": "0.69717693",
            "sentiment_compound": 0.7276
        },
        {
            "id": "hgdchw2",
            "score": 1,
            "text": "Yes, it's more frequent than ever.",
            "title_similarity": "0.22810256",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hgdcl13",
            "score": 1,
            "text": "I suffer from this soooooo much. I almost would rather just not talk at all. 😬",
            "title_similarity": "0.6730965",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hgdcs7w",
            "score": 1,
            "text": "Look into Active Constructive Responding (ACR). It helps you celebrate good news and deliver responses that build up your relationships.  \n\n“I got a promotion!”  \n\nShould be met with:  \n\n“Wow, i’m so happy for you!”  \n\nNot…  \n\n“Nice”…goes back to phone*  \n“Oh wow, Jane got promoted last week; she really deserved it”  \n“Won’t that increase your commute? What about the kids?”  \n\nAll of these deflate their victory by deflecting, stealing, or refusing attention.  \n\nIf you have concerns or tangentially related news, save it for later. The “now” is for them. Source; CAF, I’m a military life skills counselor.",
            "title_similarity": "0.68476313",
            "sentiment_compound": 0.9729
        },
        {
            "id": "hgdcvus",
            "score": 1,
            "text": "This is so true. My ex was like that and since we broke up I feel so free. Hating on stuff was our thing, when we started dating. But over time, I realized how terrible that was. Not just for others, but for myself. I had deprived myself from so much joy, because I was to busy spitting hate. Now it seems like a brand new world to me, full of beautiful experiences. Life is beautiful if you just let it in.",
            "title_similarity": "0.7996371",
            "sentiment_compound": 0.866
        },
        {
            "id": "hgdcwrv",
            "score": 1,
            "text": "I’m still working on it but what I do to combat it is to take a step back when anybody says something I want to respond negatively to and just ask why they feel that way about whatever it is they’re talking about and when they give an answer I just respond with “I never thought of it that way” even if I completely disagree with it and I just leave it at that. I always have to remind myself that not everything has to be an intellectual checkmate, and people don’t need or want to hear why they’re stupid and wrong. That’s another form of negativity I struggle with",
            "title_similarity": "0.6863271",
            "sentiment_compound": -0.9586
        },
        {
            "id": "hgdcxyp",
            "score": 1,
            "text": "avoiding popular (or reddit in general) helps a lot",
            "title_similarity": "0.5899234",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgdcz7p",
            "score": 1,
            "text": "I like to blame Reddit for doing this to me, but in truth, it was always just me. I just like Reddit cause it enables it.",
            "title_similarity": "0.71141464",
            "sentiment_compound": 0.7391
        },
        {
            "id": "hgdd0zf",
            "score": 1,
            "text": "I catch myself doing it but atnthis point its almost natural. One oppiniom that differs from the pack results on pm's witu death threats or others just shitting on you because they can spin there words well enough to get sheep to listen.",
            "title_similarity": "0.6374851",
            "sentiment_compound": -0.8515
        },
        {
            "id": "hgdd1o9",
            "score": 1,
            "text": "This happened to me too, during a football game I used to bring everybody down whenever our team did something good but were losing, I was like 'whatever, they'll fumble it now or something'. Eventually someone told me straight to my face that they didn't like watching football with me because of the negativity. So, I stopped doing it, even if they were down by 30 and did an interception I celebrated as if they were really turning the game around (they never did, but still).",
            "title_similarity": "0.78207994",
            "sentiment_compound": -0.0683
        },
        {
            "id": "hgddacd",
            "score": 1,
            "text": "most ppl on the net are miserable and ungrateful",
            "title_similarity": "0.67497694",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hgddagn",
            "score": 1,
            "text": "Good to hear you were able to move past the negative thinking. As some one who lives with that person, what do you think are some good strategies to bring up to help? I’d love to also find some good reading/ articles on this subject as well.",
            "title_similarity": "0.44384247",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hgddb4q",
            "score": 3,
            "text": "All this means is you're willing to throw away your beliefs and principles (even if they are correct) just so you have someone to talk to.",
            "title_similarity": "0.58780587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgddgfq",
            "score": 1,
            "text": ">A cool decade later, I've figured out that they weren't boring at all. I was.\n\nI think this every time somebody claims somebody else doesn't have a personality.",
            "title_similarity": "0.3997774",
            "sentiment_compound": 0.5043
        },
        {
            "id": "hgddi3y",
            "score": 1,
            "text": "The world is ending, talk however you want",
            "title_similarity": "0.34292924",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hgddniz",
            "score": 3,
            "text": "I have this issue, constantly bitching about something in my head.  I’m going to make an effort to be more optimistic and less bitchy thanks to this post.",
            "title_similarity": "0.627482",
            "sentiment_compound": 0.0278
        },
        {
            "id": "hgddrt5",
            "score": 1,
            "text": "To be fair, being a cynic in this day and age isn’t exactly a bad or unwise thing.",
            "title_similarity": "0.38993987",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hgddvcv",
            "score": 1,
            "text": "Amen to that one.",
            "title_similarity": "-0.02871865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgddwfn",
            "score": 1,
            "text": "Huh\n\n\nNeeded this today.",
            "title_similarity": "0.15033051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgddyiu",
            "score": 1,
            "text": "There's something closely related to this.\n\nI went through a period where I spent vast majorities of time online and in online communities. I saw the worst of the worst of people, and was immersed in it. \n\nIt led to developing severe social anxiety mostly because I expected the same kind of behavior in the real world so I shut myself in to avoid being subject to it face-to-face. Through a lot of therapy, I was constantly pleasantly surprised that people weren't ever as mean as I thought they'd be. In fact, more often than not, people were kind, largely for no real reason other than to be kind.\n\nPlease go outside and interact with the real world. Being on the internet all of your life can really fuck with you.",
            "title_similarity": "0.8605751",
            "sentiment_compound": -0.9148
        },
        {
            "id": "hgde12d",
            "score": 1,
            "text": "Yessss in the workplace as well.",
            "title_similarity": "0.09572532",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgde2ea",
            "score": 2,
            "text": "I mean u can be positive if you want to, but its compeltel delusion at this point. I'm just trying to maintain my own life and keep it as good as it can be. We fucked tho in the long run.",
            "title_similarity": "0.5758969",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hgde48g",
            "score": 1,
            "text": "Can confirm. My longtime friend/multiple year roommate is currently making me consider not being friends with him when I move out in the future. I've never met someone who gets so pissed about EVERYTHING (and more often than not it's over something trivial). I consider myself kinda pessimistic, but he's just on another level. I just can't understand how he thinks. It's like he lives in another world.",
            "title_similarity": "0.7548312",
            "sentiment_compound": -0.3321
        },
        {
            "id": "hgde4ev",
            "score": 1,
            "text": "I used to do this. Therapy and reframing things in my head before opening my giant mouth helped. \n\nI'm much better a person now for it and a much happier person now that I don't deal with constant negative thoughts trying to escape my head via my mouth.",
            "title_similarity": "0.5484174",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hgde5w4",
            "score": 1,
            "text": "This attitude has actually made me wary of sharing things I really love with people. Its so easy to shit on things these days, and some opinions stick in my mind more than others.",
            "title_similarity": "0.7089998",
            "sentiment_compound": 0.8004
        },
        {
            "id": "hgde64l",
            "score": 1,
            "text": "Great sub, and a really, really important message. Thanks.",
            "title_similarity": "0.27676696",
            "sentiment_compound": 0.8636
        },
        {
            "id": "hgde6v2",
            "score": 1,
            "text": "How can I get this point across to my dad? He’s so negative about everything. I don’t even want to talk to him. Not sure how to broach that convo tho …",
            "title_similarity": "0.62344223",
            "sentiment_compound": -0.7509
        },
        {
            "id": "hgdefip",
            "score": 1,
            "text": "This is the best LPT I've ever read. I can't stand negative people and it took me a while and work on myself to not be that person.",
            "title_similarity": "0.6405543",
            "sentiment_compound": 0.8019
        },
        {
            "id": "hgdehef",
            "score": 1,
            "text": "To short circuit my negativity I think of complaints as the cigarettes of communication… it’s everyone else’s “air” too; better to check that they don’t mind first and just abstain in tight spaces.",
            "title_similarity": "0.6318658",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hgdehm5",
            "score": 1,
            "text": "The biggest problem is that these sort of people think they're deconstructing argument or being critical thinkers when often they're just angry skeptics with options they think are right. It's a very self serving way to live. \"I'm right and this is why\" or \"you're stupid and this is why\" when they refer to anything.\n\nThey're narrow minded, short sighted cultists who have been indoctrinated into a very specific way of life and they normally don't get out much. They're insecure and see anything \"different\" as a threat. Probably vote conservative and value bullshit conservative ideals like a free-market economy and patriotism and things they pretend to care about because that's what they've been convinced is going to lead them to the promised land.",
            "title_similarity": "0.7965763",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hgdesiz",
            "score": 1,
            "text": "yes i’ve found myself doing this quite often and it’s really changed how i see myself. i’ve really been working on being more compassionate and not jumping the gun. \n\n\nit’s really difficult especially in this day and age, it’s so easy to be negative nowadays and i feel like it’s dimmed my spark",
            "title_similarity": "0.77178514",
            "sentiment_compound": 0.835
        },
        {
            "id": "hgdeu4r",
            "score": 1,
            "text": "My brother can be like this, and his language (physical and verbal) make it clear whatever it is, he not only dislikes but thinks you’re stupid for liking it. I’ve had to literally tell him “I’m not stupid or wrong for enjoying this”. \n\nHe can be very difficult to be around.",
            "title_similarity": "0.785208",
            "sentiment_compound": 0.876
        },
        {
            "id": "hgdevkt",
            "score": 1,
            "text": "Yes! And I think the internet sort of teaches us that the naysayers are the smarter ones who see what the average person doesn't.",
            "title_similarity": "0.6040964",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hgdewpn",
            "score": 1,
            "text": "Damn that’s stupid, but incredible. Well done",
            "title_similarity": "0.4325716",
            "sentiment_compound": 0.0102
        },
        {
            "id": "hgdf0iy",
            "score": 1,
            "text": "This is so stupid. You're stupid, the people who down vote this is stupid, everything is stupid. And quite frankly, this post is radiating stupidity. I. Can. Feel. The. Stupidity. In. my. Atoms. Stupid stupid negative negativity.",
            "title_similarity": "0.7463081",
            "sentiment_compound": -0.9877
        },
        {
            "id": "hgdf4e9",
            "score": 1,
            "text": "Man, I know people who do this and it completely turned me off my hobbies for a long time, stopped me enjoying because my experience with them left me with memories of the time with them.\n\nIt's so selfish, and I don't do anything with them and so I am happier.",
            "title_similarity": "0.77903306",
            "sentiment_compound": 0.2897
        },
        {
            "id": "hgdfayf",
            "score": 1,
            "text": "Hoooow, do you get someone close to you to stop this and stop engaging you to do it with them as fun times. To clarify it is fun to be judgy sometimes, but man has it leaked into a lot of other stuff, and wayyy to often. when I tell them to knock it off, or make them explain further to take the fun out of it, or flat out disagree, it causes an issue and does not work. They say I’ve changed my tune and ‘usually I love to shit on things’.  But I’m not having fun..",
            "title_similarity": "0.79270506",
            "sentiment_compound": -0.1909
        },
        {
            "id": "hgdfd29",
            "score": 1,
            "text": "The world is a negative place though. It's simply a fact and the reality of the situation. People are not educated and selfless enough to change the world for good.",
            "title_similarity": "0.5334435",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hgdffm7",
            "score": 1,
            "text": "Even on the internet, being nice and open-minded gets you a lot further if you actually want to discuss something than instantly trying to snarkily destroy someone's argument. There's a lot of anger in our culture around opposing opinions and it's satisfying to assert personal truths, but it's not very productive and usually just leaves everyone feeling worse",
            "title_similarity": "0.86711866",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hgdfl2b",
            "score": 1,
            "text": "I'm still like this, even at thirty.\n\nI'm less of an arsehole towards general interests I find dumb etc... but if there is an industry profiteering off of other people's stupidity, I will 100% continue to call it out. No, astrology is not real. No, psychics don't exist, and no, they are not talking to your dead relatives. I don't think I'll ever change, even if people think I'm just a negative person, or I'm not open-minded enough. Faking enthusiasm or encouraging these kinds of behaviour in people only serves to legitimise them, and prevents them dying out as quickly as they should be. I'll rarely bring up the topic, and I won't be too mean about them when I offer my rebuttals, but I will provide concrete evidence that what they believe is bullshit, even if it hurts their feelings. I don't want to be friends with morons. I want to surround myself with people I can learn from. Not people I will silently judge just so they like me.",
            "title_similarity": "0.7480072",
            "sentiment_compound": -0.8784
        },
        {
            "id": "hgdflad",
            "score": 1,
            "text": "Don't interact with people. Just do your own thing and be happy",
            "title_similarity": "0.24566865",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hgdfuw5",
            "score": 1,
            "text": "I've been there and I feel you. I have a lot of pessimism that I've been working on the last few years and you're completely right. It can be hard to be optimistic and positive if you are feeling negative yourself. Thanks for posting this LPT. I feel a little less alone in working on this. It's definitely not easy.",
            "title_similarity": "0.7653898",
            "sentiment_compound": 0.3747
        },
        {
            "id": "hgdfz16",
            "score": 1,
            "text": "I had a similar problem because I adopted complaining as some kind of fake humility.\n\nLike if I went on a trip I would say or exaggerate bad things about it when talking with others, even with others that went on the trip with me.\n\nWhich is really bad and I've been told that I complain too much even when I (internally) feel like I was having a lot of fun.\n\nSo now Im working on better expressing positively the things that I do find good.",
            "title_similarity": "0.8014117",
            "sentiment_compound": -0.1989
        },
        {
            "id": "hgdfzfq",
            "score": 1,
            "text": "How did you become self-aware of this? I have a friend that does this constantly. Anything you say to her is met with negativity. Sometimes I think she thinks the cynicism is funny, and it can be on occasion, but the constant negativity is exhausting. It boggles my mind because she makes comments about how negative her mom and cousin are yet doesn't seem to see it in herself. Sometimes I get mad at myself for even saying anything to her because the response is always negative and then I'm like, damn it, I fell into the negativity trap! I definitely feel myself distancing from her because it's just so toxic and I don't want it to rub off on me. I also don't feel comfortable telling her she's a downer all the time.",
            "title_similarity": "0.84030557",
            "sentiment_compound": -0.9866
        },
        {
            "id": "hgdgibj",
            "score": 1,
            "text": "On the other hand, faking positivity about stuff you don't like or aren't interested in isn't good either.\n\n  If you do fake interest in something just to fit in you're stuck having to do it whenever you're with those people.",
            "title_similarity": "0.66512287",
            "sentiment_compound": -0.1714
        },
        {
            "id": "hgdgimh",
            "score": 1,
            "text": "I always try and be super nice and positive wherever I can and it really makes for much better interactions",
            "title_similarity": "0.3880996",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hgdgnvx",
            "score": 1,
            "text": "I'm afraid I'm falling for some subtype of this. I have learned to try to default to pretty positive ways of saying my opinion and if I have some epic rebuttal, I try to frame it as a sincere question rather than any argument of my own. I think people are generally much more open to explaining their own views rather than listening to others explain things to them.\n\nBut still, I know many people who are close to me don't want to learn anything new with me or from me, so I'm thinking I'm still failing this somehow, even though I'm trying to not be a dick. And before you ask, yes, I've asked many about this, many who are 100% honest with me, and they don't really know why they dislike having me around when they're learning about something I passionately care about. It sounds like they just describe it as pressure and fear of failure, so clearly I'm still coming out as fairly judgmental, somehow.",
            "title_similarity": "0.68565905",
            "sentiment_compound": 0.9171
        },
        {
            "id": "hgdgod8",
            "score": 1,
            "text": "There's literally an episode of South Park dedicated to you.",
            "title_similarity": "0.25329822",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgdgpds",
            "score": 1,
            "text": "I’ve never really be good at social skills and emotional intelligence. To help, I’ve just taken notes and observations of various situations to see what’s the best outcome/response for years. While I still fully don’t understand why people do certain things, one of the biggest things that made interacting with people a more positive outcome is just listening to people. Usually I just listen to what they say, and pick one point from the conversation as a response to continue. Usually just listening to them rant about whatever topic makes people feel good.",
            "title_similarity": "0.7018328",
            "sentiment_compound": 0.938
        },
        {
            "id": "hgdgpmu",
            "score": 1,
            "text": "I had to break it off with a Guy I otherwise adore. He's smart, handsome in his own way and we have so much in common. But every time we hung out he was negative about everything. It was Impossible to have any king of positive or even neutral conversation.",
            "title_similarity": "0.786443",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgdgqz0",
            "score": 1,
            "text": "I have to catch myself when I do this. I have a few people around me like this so it's easy to get sucked in.",
            "title_similarity": "0.37736574",
            "sentiment_compound": 0.3976
        },
        {
            "id": "hgdgw9p",
            "score": 1,
            "text": "Amen man, the day I quit the negativity was the day it all changed.",
            "title_similarity": "0.54487944",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hgdgyhr",
            "score": 1,
            "text": "My reddit stalker could use this advice 👍",
            "title_similarity": "0.4493044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdh4cs",
            "score": 1,
            "text": "I don't intentionally tear things down. I'm just depressed and it's how I see the world. \nEverything is bad.\nI feel like Eeyore.\nI want to be more positive!\nI always fail at maintaining positivity for very long.",
            "title_similarity": "0.7780973",
            "sentiment_compound": -0.1528
        },
        {
            "id": "hgdh89m",
            "score": 1,
            "text": "It's a very good observation action that Internet culture rewards us for pessimism. Perhaps you could join the Ireland reddit and perk that bunch up a bit",
            "title_similarity": "0.6356507",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hgdheua",
            "score": 1,
            "text": "Whenever I play games if someone complimented someone or myself I would assume sarcasm etc and just think they are out to get me but now that I look back I was just a douchebag.",
            "title_similarity": "0.7981181",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hgdhhqg",
            "score": 1,
            "text": "What if a person has a tendency to completely ignore negative things and only pays attention to the positives?",
            "title_similarity": "0.41774637",
            "sentiment_compound": -0.5222
        },
        {
            "id": "hgdhm4h",
            "score": 1,
            "text": "I've got an ex friend who could learn this. Everything is shitty to him and he'll be sure to let you know it. If it's not one of his toy franchises, it's shitty. Yeah dude, every other person you come across is the problem. 🙄",
            "title_similarity": "0.802779",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hgdhnl3",
            "score": 1,
            "text": "Life pro tip for redditors, don't treat real life like the internet\n\nthis site man",
            "title_similarity": "0.65644425",
            "sentiment_compound": 0.0624
        },
        {
            "id": "hgdho92",
            "score": 1,
            "text": "ADDENDUM:\n\nIf you act like this at work, you will quickly become that guy that spends his entire \"career\" at that business in the same role, watching people receive promotions and pay increases while you stagnate.  No one wants to work with a pessimist.  Supervisors don't want to reward that kind of toxic thinking.",
            "title_similarity": "0.6363235",
            "sentiment_compound": -0.7022
        },
        {
            "id": "hgdhs8k",
            "score": 1,
            "text": "I found myself I was doing that a lot lately; had to make a conscious choice to stop it. It’s better now again, but I still catch myself every so often.",
            "title_similarity": "0.62423396",
            "sentiment_compound": 0.09
        },
        {
            "id": "hgdhvac",
            "score": 1,
            "text": "Exactly. My sister has the tendency to first point out all the negative things with anything anyone has done, instead of praising them for the positive things. There will be 9 things done right but one thing done wrong, and she will immediately focus on that one thing - not even offering a solution or a suggestion but just pointing out \"hey, look you made a mistake here, so what you did wasn't anything special\". It has made me realise I don't want to share any good news that makes me happy or any of my achievements with her because in my mind I'm prepared for her to point out something negative again and dampen my mood",
            "title_similarity": "0.71125823",
            "sentiment_compound": -0.5792
        },
        {
            "id": "hgdhwby",
            "score": 1,
            "text": "This is a great LPT. I think lots of people who grow up a little too online go through the same kind of awakening in their 20s, I know I did.",
            "title_similarity": "0.53220236",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgdi0bn",
            "score": 1,
            "text": "I took this stance with video games. I used to shit talk them but after I was convinced to play them I’d enjoy them. So I don’t hate anything until I try it now. I don’t hate many things.",
            "title_similarity": "0.66036284",
            "sentiment_compound": -0.4302
        },
        {
            "id": "hgdi61t",
            "score": 1,
            "text": "Yep. Like many others chiming on this thread I was a pretty miserable little shit in my early 20s. Know-it-all, cynical, dismissive, negative. And like so many other little shits, I went through life thinking there was no way *I* was the problem and *surely* it was because other people were just less interesting than me or whatever. When really, as you pointed out, that attitude is as boring as it gets. \n\nIt's a dead-end and it will bring about virtually nothing good in your life, pretty much ever. \n\nIt's a funny thing too because almost without fail, throughout my life the people I've met that I enjoyed and felt I got along with well, are always the people who weren't like me. The reality of it is always staring you in the face but it's very easy to turn away from. \n\nOne of the big traps that I had to learn to overcome was that feeling that cynicism and negativity are inherently 'real' and positivity is inherently 'fake' and that being 'real' is always better than being 'fake'. This is not true and not worth harboring. \n\nIn the spirit of LPTs, one simple tip to help get over yourself, particularly for movies/games/shows/etc is the simple shift of \"This sucks, here why\" to \"This wasn't for me\" \n\nThat little shift in mentality can go a long way toward not pushing you down that negative reward pathway",
            "title_similarity": "0.7749112",
            "sentiment_compound": -0.6647
        },
        {
            "id": "hgdi6wq",
            "score": 1,
            "text": "Yeah but pretending to be positive can be exhausting",
            "title_similarity": "0.41801858",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hgdifv1",
            "score": 1,
            "text": "I have a colleague at work and her favorite slogan is \"I hate people\", I mean I get it, you never developed around the age of 15. But it's cringy as fuck, everyone is awful in her mind. I keep telling her, she just needs to surrouns herself with the right people and it doesn't make sense to keep complaining about idiots because they will exist forever. \n\nBut there is no hope. Fuck people like her, it makes me wanna quit my job that I actually like.",
            "title_similarity": "0.82407165",
            "sentiment_compound": -0.629
        },
        {
            "id": "hgdilar",
            "score": 2,
            "text": "If you look for the light you will often find it, but if you look for the dark that is all you will ever see",
            "title_similarity": "0.46677983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdimil",
            "score": 1,
            "text": "If everyone around you is an asshole, chances are youre the asshole. OP learned it the hard way and now has no friends lmao.\n\nPro-tip: People think that being edgy, nihilist or pessimism is cool so they make that their personality. If you run into these people just ignore them and stay away. OPs friends had a ton of patience because I wouldnt be around people like him at all.",
            "title_similarity": "0.7882168",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgdiog5",
            "score": 1,
            "text": "I work a job that currently requires me to work long hours often and i have to be on standby to respond most of the time. I have friends who cruise along in a  regular 9-5 job and end work on time 95% of the time. I used to lowkey shit on them for complaining when they have to work past hours for a bit, but i realised this gets nobody nowhere. I still end uo feeling like shit and they do too. Nowadays i just try to hold my tongue and try not to spread the negativity.",
            "title_similarity": "0.68789065",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hgdityf",
            "score": 1,
            "text": "How about we all agree that toxic bullshit is just unwanted in general.",
            "title_similarity": "0.6124873",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hgdiuf1",
            "score": 1,
            "text": "\"Freedom is what happens in between cause and effect\" not my quote, but consider it a universal law",
            "title_similarity": "0.28652468",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hgdivjf",
            "score": 1,
            "text": "wish my girlfriend would read these post",
            "title_similarity": "0.5326425",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hgdiw3b",
            "score": 1,
            "text": "Everyone should watch Ted Lasso. The whole theme of the show is positivity.",
            "title_similarity": "0.43516082",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hgdiyjm",
            "score": 1,
            "text": "I get memories on Facebook from 10+ years ago when I was a teen, and some of the comments and status I posted make me cringe for this exact reason. I was so negative! And not just that but extremely defensive. \n\nI studied music at college and hadn't realised at the time just how defensive I was until one day my tutor told me that I was infront of the entire class.... I felt about an inch tall and immediately retorted with 'NO IM NOT'.... Ironic lol. \n\nTook me a good few years to mature out of that phase.",
            "title_similarity": "0.7766526",
            "sentiment_compound": 0.6449
        },
        {
            "id": "hgdj424",
            "score": 1,
            "text": "Cliche but, lead with kindness",
            "title_similarity": "0.15714787",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hgdjb3j",
            "score": 1,
            "text": "I've tried telling this to my daughter.  When she grows up-no one is going be able to tolerate constant negativity from her and she will lose out on friendships.  \n\nNo one thinks thinks cynicism is neat.  It's not a \"Character trait\".",
            "title_similarity": "0.5818191",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hgdjt6l",
            "score": 1,
            "text": "My boyfriend does this. I love him a lot, but he suffers from depression and very severe anxiety. He knows his first reaction to things is usually negative - it's a defense mechanism. He's been working on it.\n\nReading this thread is helpful. Has anyone successfully helped someone rewire their brain on this front?",
            "title_similarity": "0.740484",
            "sentiment_compound": -0.8809
        },
        {
            "id": "hgdjtyn",
            "score": 1,
            "text": "It was sarcasm for me.  I used to be super sarcastic about everyone and everything. Nearly everything out of my mouth was sarcastic. Then something clicked and I realized I was using sarcasm to cover how I really felt about things. So I stopped. It took a long time but I made a conscious effort to not reply sarcastically to everything.  It made me stop and think about what I was saying or going to say. It also made me become more aware of my feelings on things and question why I had the reactions I was having. \n\nNow I can control when I'm jokingly being sarcastic vs. Being a sarcastic jerk.",
            "title_similarity": "0.8435066",
            "sentiment_compound": -0.8663
        },
        {
            "id": "hgdk3wq",
            "score": 1,
            "text": "a bit of realistic pessimism disguised as sarcasm or dark sense of humour may help but constant negative bantering never works out most of the time",
            "title_similarity": "0.6792706",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hgdk698",
            "score": 1,
            "text": "I was never quite like that but I did have really strong opinions about music, mostly 'this popular thing is bad', that I was pretty vocal about.  A friend I trust started referring to me as a music snob and I turned that over in my head a lot.  I decided to not be that guy anymore.  That was about 20 years ago, and since then give bad music what it deserves - no space in my brain.  No opinion, no comment.  Just 'meh' and move on.  And if other people are into it?  Cool, go ahead.",
            "title_similarity": "0.8372662",
            "sentiment_compound": 0.8117
        },
        {
            "id": "hgdkcg7",
            "score": 1,
            "text": "Also: This doesn't apply just to media/Ideas.\n\nCareful with what you say.\n\nA very close family member is one of these people, and every single word that comes out of their mouth is a complain. We go out to eat? The place is too dirty. Someone has a new dress? it makes them look fat/ the color is ugly / God, what are kids wearing these days?. We seat at the table? The rice is too dry/ someone is slouching/ you are all being too loud, etc, etc, etc. I can give you an example of almost every situation imaginable.\n\n&#x200B;\n\nAnd it is exhausting for your loved ones. Trust me. It is just such an annoying and alienating habit to have, that it is better to just get used to only say nice things than to risk falling into it.\n\nIf you are not going to be kind, stfu <3",
            "title_similarity": "0.7364487",
            "sentiment_compound": 0.8053
        },
        {
            "id": "hgdkj0v",
            "score": 1,
            "text": "This will never work for me.",
            "title_similarity": "0.26175374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdkm94",
            "score": 1,
            "text": "I think this should also go towards not being overly critical of other people. If you are constantly criticizing someone else about not doing everything perfectly all of the time and assuming the worst intent from them, they're not going to want to be friends with you much longer.",
            "title_similarity": "0.6622872",
            "sentiment_compound": -0.7293
        },
        {
            "id": "hgdkqmh",
            "score": 1,
            "text": "I wish my ex could read this. Not only did he make me hate him, he made me hate me and I cannot forgive that and all the work it's taking to fix that damage.",
            "title_similarity": "0.7979857",
            "sentiment_compound": -0.8662
        },
        {
            "id": "hgdkyn8",
            "score": 1,
            "text": "My fiancée's sisters boyfriend is this way. He seems like a good dude, but damn everything out of his mouth is so negative and he's a square to the nth degree. Jesus will save him from covid because the vaccine will kill you worse, and pro choice is evil and women are murders, heaven forbid if you Jay walk in front of him... he's not very fun at parties.",
            "title_similarity": "0.8194026",
            "sentiment_compound": -0.9816
        },
        {
            "id": "hgdl67i",
            "score": 1,
            "text": "Wow the negativity, and we had good woods-sex. 😭",
            "title_similarity": "0.5653669",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hgdlcj0",
            "score": 1,
            "text": "Alleged criticality is cheap as water.  All it requires is flagging Unobserved information and scrutinizing the assumption or filter that allows it to pass unobserved and making a case for its relevances.  As cheap as water and domestic disputes.",
            "title_similarity": "0.38501495",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hgdlezo",
            "score": 1,
            "text": "I have a job where I have to be pessimistic. I get paid to be super critical of everything.  But you have to present the pessimistic portions in an objective manner and be constructive with the criticism.",
            "title_similarity": "0.7083175",
            "sentiment_compound": -0.7935
        },
        {
            "id": "hgdlglc",
            "score": 1,
            "text": "Internet culture is some good vibes only. \n\nBeing honest and truthful in this age of despair is right, but you can try and spin it as pessimism....",
            "title_similarity": "0.63536495",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgdljht",
            "score": 1,
            "text": "This might be the dumbest idea I’ve ever heard. \\s\n\nIn all seriousness, this might be the most important post on Reddit. Well said OP. I bet you really are dope at parties.",
            "title_similarity": "0.7843033",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hgdlqbu",
            "score": 1,
            "text": "Never forget that big data literally purposely tries to make you angry with thier \"algorithms\".",
            "title_similarity": "0.7992442",
            "sentiment_compound": -0.3887
        },
        {
            "id": "hgdlrjh",
            "score": 1,
            "text": "Agree with this. I tend to be extremely selective in my taste. I'm a music nerd, hate mainstream movies/CGI and am a craft/Belgian beer snob. In America, I was ok keeping with my small group of friends I found who share my tastes. I tended to make my opinions known quickly.\n\nThen I moved to Japan and realized I need to be a lot more openminded or I wouldn't have any friends at all. With my Japanese pretty solid but not perfect and my general lack of knowledge of Japanese pop culture references, I'm already causing enough of a bother making people have to go out of their way to explain a lot of stuff. Being judgmental would be like slapping them in the face for their kindness.\n\nWhen my buddies put on Backstreet Boys, 1990s easy listening Eric Clapton and annoyingly bland J-Pop, I don't make snide comments. When everyone drinks bland lagers, I drink one too. My girlfriend wants to go see the live action version of Aladdin or The Fast and Furious or some badly acted Japanese comedy? I don't complain. Karaoke used to be something I thought was cringe af...now I even occasionally participate and even enjoy.\n\nAnd you know what? I'm having the time of my life, making many new friends, some of whom have helped me in innumerous ways, and later I get the chance to introduce them to the stuff I like too.\n\nIf you shut people off at first chance for their \"uncool\" tastes and are negative all the time, you are really limiting your circle of friends and miss out on great relationships and potential lifelong friendships because of some meaningless b.s. Plus, really, most of that stuff isn't even really that bad enough to complain about in the first place.",
            "title_similarity": "0.82511926",
            "sentiment_compound": 0.8774
        },
        {
            "id": "hgdltf7",
            "score": 1,
            "text": "Thank for sharing this- wise words.",
            "title_similarity": "0.105968036",
            "sentiment_compound": 0.837
        },
        {
            "id": "hgdltwv",
            "score": 1,
            "text": "It's important to remember that ignoring the news is worse than being negative because you watch it. There are so many things that need to be done by the human race RIGHT NOW if we are going to prevent complete extinction of our species.",
            "title_similarity": "0.69760144",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hgdlvtr",
            "score": 1,
            "text": "I’m generally a positive person, but I definitely want someone to hear something that sucks about my day. This morning I thought I had to drive 3 hours out of my way to drop off something my daughter left in my car (she went back to college) and I mentioned that to my husband before he left. He worked overtime yesterday, so I hadn’t even seen him yesterday. Why did I have to waste the few moments we had together with that negativity?\nI want to change this. I think it will just bottle up inside me if I don’t say it. What have you done to fix this problem?",
            "title_similarity": "0.68895113",
            "sentiment_compound": -0.9161
        },
        {
            "id": "hgdlxk7",
            "score": 1,
            "text": "How does the internet reward us for pessimism?",
            "title_similarity": "0.6508672",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgdlzha",
            "score": 1,
            "text": "This should be a part of some birth kit you get for the modern world.  If you do most your social interactions online it's going to break you in the real world.  Like seriously I thought I was bad too.  But when I encounter most young people now it is really clear we have broken socially as a species.  I hope they realize it. My generation definitely didn't realize it would happen. With awareness maybe next generation can figure it out. I don't get that sense though unfortunately seems more like they are aggressively leaning into it.",
            "title_similarity": "0.8238399",
            "sentiment_compound": 0.5966
        },
        {
            "id": "hgdm603",
            "score": 1,
            "text": "I get that that, I almost turned out that way too. What I don't get are the ppl who are so oblivious to there own behavior they don't even realize what they are doing. Ppl really need to think first then speak, but you no how social media is, everyone spews out everything all of the time. We should start a trend were we normalize meditation and we just shut off all social media, don't speak and just actually be chill for 15 minutes a day.",
            "title_similarity": "0.75572413",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hgdm72f",
            "score": 1,
            "text": "I lost everyone ice ever cared about because of this. I've tried to do better, but the best Ive found I can do is internalize everything and just put on this facade of comedic relief, which I play the role as at work and around family. No friends anymore, sadly.",
            "title_similarity": "0.75141",
            "sentiment_compound": 0.9148
        },
        {
            "id": "hgdma02",
            "score": 1,
            "text": "Ughhhhhhhhhhhhhhhhhhhhhhhh this resonates with me so much!  My husband is like this but instead of getting better as he gets older it is getting worse.  He's like how come we don't have any friends... and I am like I have plenty of friends... how come you don't have any friends?  No self awareness either.",
            "title_similarity": "0.76715505",
            "sentiment_compound": 0.446
        },
        {
            "id": "hgdmapk",
            "score": 1,
            "text": "My buddy/roommate does this and it’s extremely draining. I like the guy, we’ve been friends since grade 10 but I honestly hate talking to him about anything I’m excited for.",
            "title_similarity": "0.76226723",
            "sentiment_compound": 0.61
        },
        {
            "id": "hgdmt14",
            "score": 1,
            "text": "I went through this phase too. Less because of the attention online and more because I had a huge chip on my shoulder. I was told by people I was stuck up, and I had no idea why. I read how to win friends and influence people and it helped me see how I was fucking up my own image to people by being so caustic about things they probably like. I learned how to think before I speak.",
            "title_similarity": "0.8350934",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hgdmxlb",
            "score": 1,
            "text": "“If it’s endurable, then endure it. Stop complaining. If it’s unendurable … then stop complaining. Your destruction will mean its end as well.\"\n\n- Marcus Aurelius",
            "title_similarity": "0.58170027",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hgdn1d3",
            "score": 1,
            "text": "god fucking- thank you. I've learned recently my friend group has helped me from a negative mind set and made rules against it in our group chat. my girlfriend joined the chat recently and her negativity that she's used to from her own friend group has been infuriating.",
            "title_similarity": "0.79517543",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hgdn988",
            "score": 1,
            "text": "I was trying to teach this to my 9yo son.  Especially around his neighborhood friends, all they do is shit on each other and now that is his new communication pattern.\nI think he gets it. But it is a hard habit to break.",
            "title_similarity": "0.7034327",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hgdnn1o",
            "score": 1,
            "text": "Positivity and negativity are a BS concept. Whether something is \"positive\" or \"negative' is completely subjective. If I am a member of the Crips gang killing a Blood is positive. If I am a Blood the killing is negative. If I am a cop being a Crip or a Blood gang member is negative and all unsanctioned homicide is negative. If I am a BLM activist then being a cop is negative. And this goes on and on. There is really no such thing as \"positive\" and \"negative\" beyond our own subjective perspective.\n\nRather than getting caught up in \"positive\" and \"negative\" it is more useful to focus on whether the behavior is PRODUCTIVE or COUNTER-PRODUCTIVE. Expressing an opposing opinion in a situation where there is no practical benefit to doing so- or where doing so poses more social harm than good- is counter-productive.\n\nI hope this was productive. I know some people will call it negative...but they are stupid so it doesn't matter because I only value the opinions of intelligent people. Stupid people are so negative...",
            "title_similarity": "0.64306736",
            "sentiment_compound": -0.9845
        },
        {
            "id": "hgdnvwp",
            "score": 1,
            "text": "I had to take a break from Twitter because of this. My feed was always full of negativity/pessimism and its so fucking toxic and destructive.",
            "title_similarity": "0.84948665",
            "sentiment_compound": -0.6444
        },
        {
            "id": "hgdo3bo",
            "score": 1,
            "text": "I have a friend who is currently like this, and I don't know how to tell him without alienating him by accident. He is very emotionally fragile and chronically depressed, any little thing can set him off. I recently had to convince him to not lock himself from our group chats, which he did because \"no one talked to him directly and he felt unwanted\" but i was able to bring him back by convincing him he's not unwanted, no one says he was unwanted or gave evidence to make him believe so, and no one in our chat directly names people, we just chat casually with each other and dip in and out of conversation as convenient. \n\nHowever, he is the exact type you described yourself to be and it *does* make it very difficult to chat with him, but I don't know how to bring that up without making him feel like he's unwanted",
            "title_similarity": "0.70451343",
            "sentiment_compound": 0.1758
        },
        {
            "id": "hgdo4wf",
            "score": 1,
            "text": "OP, congratulations on growing up.\n\nThe hard part now, personal growth aside, is going to be not hating yourself for the way you acted back then, or torturing yourself over the relationships you could have had, or how you were actually perceived by people you thought you were pwning.\n\nBig ups to you though OP :)",
            "title_similarity": "0.6175541",
            "sentiment_compound": 0.8177
        },
        {
            "id": "hgdodye",
            "score": 1,
            "text": "One of the greatest realizations of my life is this:\nEverything in your life, and everyone else’s lives, can be absolute shit and absolutely awesome at the same time.\n\nIt is our **choice** which one we want to live with. Yes, kids get cancer and it’s not fair. Yes, rich people get away with a lot including murder, and it’s not fair. Life is not fair, period. Not at all. We don’t live in a Disney movie, we live in earth and it’s messy. We die, some of us sooner than later.\n\nBut have you seen a smile on a dog? Have you held a baby kitten and felt it’s pure? Have you ever tasted something so delicious you got a little shot of adrenaline? Received a wonderful warm hug from a kind person?\n\nBad things happen constantly. Good things happen constantly. Accept both are true, and just enjoy life the best you can. Avoid negative people…or better yet, hug them and tell them you love them. We all crave love and attention. Positive attention is the best antidote to negativity. I’ve witnessed it many times.",
            "title_similarity": "0.78897643",
            "sentiment_compound": 0.9955
        },
        {
            "id": "hgdoew6",
            "score": 1,
            "text": "Thank you for saying this",
            "title_similarity": "0.04952867",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgdofqb",
            "score": 1,
            "text": "I have a friend who’s incapable of being upfront with his positive emotions, and it’s fucking annoying. We did something cool together and on the way back I went ”that was so much fun!” and he said ”no, it was shitty!” And it’s obviously a joke by the tone, but do you have any idea how fucking frustrating it is to do anything with a person who is only capable of turning everything into sarcasm? At some point, even if the shit coming out of your mouth is ”just a joke bruh”, it’s still *shit coming out of your mouth.*\n\nIf you recognise yourself in this type of person, stop it. You’re fucking draining to be around.",
            "title_similarity": "0.77252203",
            "sentiment_compound": 0.2018
        },
        {
            "id": "hgdop8k",
            "score": 1,
            "text": "are you an engineer? the corpos call this black hat thinking, and it's typified by engineers\n\nt. engineer who took a professional etiquette course",
            "title_similarity": "0.5097666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdoqfe",
            "score": 1,
            "text": "Thank you. I needed to hear this.",
            "title_similarity": "0.18106122",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgdowj5",
            "score": 1,
            "text": "Death is all around us",
            "title_similarity": "0.3075782",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hgdp6en",
            "score": 1,
            "text": "So how do you get people to see this in themselves? I took one friend to a local soccer game - paid for his ticket and drink - and all he did was complain that the general atmosphere wasn’t as hyped as last year and how disappointing it was.",
            "title_similarity": "0.6450633",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hgdp6zz",
            "score": 1,
            "text": "I don’t know if it’s counted as negative but whenever something bad happens i’ve started to just think “Well the universe hates me, that sucks” and then get over it because I know i can’t change it",
            "title_similarity": "0.7445485",
            "sentiment_compound": -0.899
        },
        {
            "id": "hgdpal1",
            "score": 1,
            "text": "I hear this quote attributed to Einstein: “Don’t come to an argument with your mind already made up.” or something like that. I hear you on the being open-minded. I think what I often run into is people who don’t quite know what negativity is. Being human means having to vent sometimes, and that’s what I always got called negative for. I mean, Covid sucks. For everyone. On every level. A lot of us are miserable, and that’s not being negative. That’s just being alive.",
            "title_similarity": "0.7751116",
            "sentiment_compound": -0.8108
        },
        {
            "id": "hgdpd6l",
            "score": 1,
            "text": "Could someone give me reasons to do this other than “people won’t like you” I had a friend group that didn’t like me because I didn’t play into their racism “because people won’t like you” is not an explanation as to why you shouldn’t do something. \n\nTo make matters worse I enjoy negativity and find conversations about what’s wrong about something infinitely more interesting than forcing positivity or pointing out positive things that are usually self explanatory.\n\nOr am I thinking about this wrong? Is life just about changing yourself for personal gain like widespread acceptance? Should I change other aspects of myself for personal gain? Should I litter to save time? People won’t like me if I litter but if no one finds out than I evade the only negative consequences right?\n\nI’ve found people also like me more if I subtly belittle others in order to myself appear better in comparison. Should I do that too? It’s really subtle so it never makes me look bad and I evade the only negative consequences, right?",
            "title_similarity": "0.7286072",
            "sentiment_compound": -0.7028
        },
        {
            "id": "hgdpk8t",
            "score": 1,
            "text": "This is my old friend in a nut shell, I don’t talk to him anymore because he’s so toxic. He was a good friend, but everyone’s boring and he’s above everyone. He loves to get angry over little stuff too which doesn’t help. Sad :/",
            "title_similarity": "0.83464324",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hgdppul",
            "score": 1,
            "text": "I am not being negative. I am French",
            "title_similarity": "0.10790914",
            "sentiment_compound": 0.4585
        },
        {
            "id": "hgdptyo",
            "score": 1,
            "text": "What did you do the change?",
            "title_similarity": "0.100021645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdqg9h",
            "score": 1,
            "text": "This is something I actually need to work on. For the past two years i’ve fallen into this rut of determining right or wrong and I bring it up in conversations, usually with a negative outlook in order to validate my perception on society. \n\nDon’t get me wrong, sometimes it’s important to determine right from wrong but there’s a time and place for everything.\n\nSometimes conversations are just casual interactions and when ideas, morals or concepts come up there’s no need to engage 100% of the time and make it into debates. Sometimes it’s OK to just go with the flow of a conversation instead of trying to deconstruct everything and determine what’s right and what’s wrong.\n\nNot everything needs to be a debate and this is something I need to work on. Thanks for this post.",
            "title_similarity": "0.7303834",
            "sentiment_compound": -0.0001
        },
        {
            "id": "hgdqmws",
            "score": 1,
            "text": "It's so true. My ex would always say that he \"loved movies\". But in the almost decade that we were together, I vividly remember him enjoying like 3 movies. Tops. Every movie night or movie date became fraught with anxiety, as I inevitably waited to hear how he hated it. I no longer enjoyed getting hype about upcoming movies, because it was just going to be an inevitable disappoinment for him. I was fine with my own opinions, but God it just fucking sucks for someone to find a complaint about every movie you enjoyed. Honestly, by the end, he'd tell a new acquaintance about how he \"loved movies\" and it took every part of my patience not to interject with \"but do you you really?\"\n\nIt was fucking exhausting.",
            "title_similarity": "0.81180984",
            "sentiment_compound": 0.9014
        },
        {
            "id": "hgdqn4r",
            "score": 1,
            "text": "I wish someone had told me this like 10 years ago",
            "title_similarity": "0.36237454",
            "sentiment_compound": 0.6783
        },
        {
            "id": "hgdqrb7",
            "score": 1,
            "text": "Another \"protip\" that's common sense lol.",
            "title_similarity": "0.18295905",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgdqw1q",
            "score": 1,
            "text": "I hate how so many on the internet confuse negativism with realism, and any time you argument something positive, they invalidate it as wishful thinking.",
            "title_similarity": "0.82204896",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgdqw8d",
            "score": 1,
            "text": "This is good. You also don't have to correct everyone all the time. Say 'well actually...' to everything during idle chat and you soon stop getting invited to things.",
            "title_similarity": "0.50150424",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgdr0u9",
            "score": 1,
            "text": "I'm trying to do this as well, life long habit, makes me seem like a prick most the time",
            "title_similarity": "0.7519077",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgdr1p3",
            "score": 1,
            "text": "Just a reminder that pessimism is shit and being an optimistic realist is a perfect mixture. You can be positive about things but still see through shit. Tho sometimes it feels like people misunderstand you for a pessimist. It's annoying when you meet full on optimistic people or people that misunderstand you. Sometimes you're not allowed to say anything negative and that's not something you should aim for. This extreme can go both ways. I do think OP knows this but I still wanted to write it because I think some optimists may slightly misunderstand this post.",
            "title_similarity": "0.68260366",
            "sentiment_compound": -0.9553
        },
        {
            "id": "hgdrchy",
            "score": 1,
            "text": "Especially politics. Nothing like being negative and giving up/not voting/not paying attn. to guarantee everything remains shit.",
            "title_similarity": "0.55595154",
            "sentiment_compound": 0.1089
        },
        {
            "id": "hgdrg2o",
            "score": 1,
            "text": "The shooting stuff down part is like what you said, something lots of people do in their early 20s, especially if they are not too bright socially. At least it's relatively easy to grow out of. You can only alienate so many people before finally getting an idea why nobody wants to be around you.\n\nThe other part is much thougher - bonding over things you hate. It's just as much a bonding experience as talking about something you love, but it also makes you seem tougher and more serious for no reason. It gives the conversation more urgency somehow. And then you're stuck with negative people and everyone is only used to being negative around each other. If you try to actually enjoy something, it looks like you're trying to break the group apart, and all that negativity suddenly gets a new target: you. So when that's how you found your friends, suddenly you have to decide if you want to be just miserable or miserable and alone. You literally have to leave your friends behind just to have a shot at happiness.\n\nI think I was already in my thirties when I consciously started avoiding these sorts of conversations. Life is too short for that.",
            "title_similarity": "0.77620053",
            "sentiment_compound": -0.903
        },
        {
            "id": "hgdrm59",
            "score": 1,
            "text": "goddammit, where were you 20 years ago? I'm 40 now and I can barely stand myself; let alone anybody else being able to stand me",
            "title_similarity": "0.5178232",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgds1n6",
            "score": 1,
            "text": "\"Tear it apart\" even the language you use still implies you believe you were *right*.  Replace \"tear it apart\" with \"shitting all over it for no reason\" it more aptly represents your behaviour",
            "title_similarity": "0.5488067",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hgdsk7z",
            "score": 1,
            "text": "If a support group develops out of this post, I need to be on that",
            "title_similarity": "0.16575362",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hgdsnfl",
            "score": 1,
            "text": "the reverse is just as bad, moderation is key. \n\nYOU SHOULD ABSOLUTELY DO THIS!\n\nreally, you think i should jump down 5 stories?",
            "title_similarity": "0.5430637",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hgdsv0z",
            "score": 2,
            "text": "Thanks for the advice. I have to fight paranoia and negative thoughs almost every day, and it's not an easy task dealing with them due to my mental issues, troubled past and a toxic relationship with one of my parents.\n\nHowever I believe someday I'll be free from all of this.",
            "title_similarity": "0.7566639",
            "sentiment_compound": -0.7584
        },
        {
            "id": "hgdsxof",
            "score": 1,
            "text": "I just simply imagine the worst case scenarios so that if they ever come to pass i might have better chances at getting through with it.",
            "title_similarity": "0.5731588",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hgdtfx1",
            "score": 1,
            "text": "Just don't fall into the other ditch and become chronically positive as well, that's even worse.\n\nJust.. be normal, man.",
            "title_similarity": "0.38032568",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hgdtjb1",
            "score": 1,
            "text": "I found it hard to differentiate between making a comment about a shitty situation and complaining. Like, “Oof my boss gave me a big deadline - I’m stressed” versus “omg I can’t believe this boss did this to me? He doesn’t realize how much I do for the company and why didn’t he give it to someone else?? It’s totally not fair to have to deal with this shit!”  \n\nMaybe this isn’t a perfect example, but I think there’s some validity to describe a negative situation in a rational way without breaking down into woe is me. You get a blister on a hike, you have a headache. You should be allowed to say that without being a complaining dick about it. Tried to explain this to those perky people who think any negative word out of your mouth means you’re a negative Nancy.",
            "title_similarity": "0.7349025",
            "sentiment_compound": -0.9791
        },
        {
            "id": "hgdto09",
            "score": 1,
            "text": ">That's what gets the most attention in online spaces, complaining about or deconstructing something. This became doubly intense when I hit my angry atheist phase around 20.\n\nreddit irl\n\n>I wish I could tell them \"hey, if you shoot down everything everyone says, nobody is going to want to say anything to you anymore.\"\n\nimo do it when you can! if it isn't too draining or inappropriate.",
            "title_similarity": "0.89610124",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hgdttve",
            "score": 1,
            "text": "Good one to always remember. It's easy hill to tumble from.\n\nI find this so prevalent on gaming subs specifically.",
            "title_similarity": "0.38107464",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hgdu187",
            "score": 1,
            "text": "Life is too short to be a contrarian.",
            "title_similarity": "0.28760836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdu3xf",
            "score": 1,
            "text": "I just want to say when I was 20 I could not have told you what any of my friends political beliefs were. Politics makes bad conversation and people",
            "title_similarity": "0.6981176",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hgdu687",
            "score": 1,
            "text": "Sounds like bullshit",
            "title_similarity": "0.26423705",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hgdui1t",
            "score": 1,
            "text": "Just pretend to agree with everyone and feel how you feel anyway lol.",
            "title_similarity": "0.35417894",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hgdus4b",
            "score": 1,
            "text": "This is a hard but well-learned lesson.",
            "title_similarity": "0.3655272",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgdv2im",
            "score": 1,
            "text": "Man I had this bad. I used to have a lot of unresolved issues and generally in a bad state. The negativity and pessimism I saw and absorved made me feel smart and validated because I was \"woke to how the world truly is and not living a lie like everyone\".\n\nSurprise surprise, that cycle didn't help me at all and I was living another lie I thought was the truth. I remember finding CinemaWins after watching a bunch of Everything Wrong With X and it helped me understand that for as many nitpicks and errors there are, there are cool moments and little details that make things better.\n\nI also remember TVTropes of all places helped me, two pages in particular: \"Silly Rabbit, Nihilism is for Losers\" and \"Anti-Nihilist\". They were pretty instrumental in breaking my cycle and worldview.\n\nI'm in a better place now and honestly, I feel pretty good about myself and that things will improve. Going away from the \"wise pessimism\" also helped me grow as a person since now I don't really attach myself to the groups and ideas that uses to define me amd I tried to fit.",
            "title_similarity": "0.8425013",
            "sentiment_compound": 0.9373
        },
        {
            "id": "hgdvay7",
            "score": 1,
            "text": "What if I don’t like anything and I’m mainly apathetic? I just like to stay home. I’m not crazy about socializing and I don’t want to go out and try new things.\n\nI don’t shit on stuff but I like staying home.",
            "title_similarity": "0.49527448",
            "sentiment_compound": 0.5451
        },
        {
            "id": "hgdvhem",
            "score": 1,
            "text": "Sooooo you had principles and now you don't...",
            "title_similarity": "0.2628141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgdw1lq",
            "score": 1,
            "text": "After reading this, I feel fortunate to have such a open mindset/ positive attitude toward new things and ideas.",
            "title_similarity": "0.2622298",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hgdw3a8",
            "score": 1,
            "text": "Reddit loves to argue and be pedantic. I'm also working on being less argumentative on reddit. Were here to support each other after all",
            "title_similarity": "0.6999882",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hgdw6tj",
            "score": 1,
            "text": "Honestly you should tell them! There are a lost of people lost in the sauce now a days who I think need a reminder. Even if they take it badly now they’ll probably still be thinking about it for awhile",
            "title_similarity": "0.65217483",
            "sentiment_compound": -0.6114
        },
        {
            "id": "hgdwse7",
            "score": 1,
            "text": "You're speaking about American culture specifically, I believe.\nWhere rabid optimism is to be applauded above all else.\nOther cultures, British for one, actually celebrate and reward a healthy sprinkling of pessimism and self deprecation now and then.\n\nJust different strokes for different folks is my message here, I guess..",
            "title_similarity": "0.62419295",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hgdwtwb",
            "score": 1,
            "text": "I wish I could react more positively on these so called \"life pro tips\", but they are all really terrible.",
            "title_similarity": "0.7756897",
            "sentiment_compound": -0.3384
        },
        {
            "id": "hgdwxhy",
            "score": 1,
            "text": ">Responding to everything with negativity \n\nSpending time on reddit is a great way to experience a wealth of positive outlook!",
            "title_similarity": "0.54790056",
            "sentiment_compound": 0.8356
        },
        {
            "id": "hgdwxs9",
            "score": 3,
            "text": "My sister told me “don’t yuck someone’s yum” and that has stuck with me",
            "title_similarity": "0.5026481",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgdxpb9",
            "score": 1,
            "text": "I think I am the opposite. I get too invested in something I disagree with just because I don't want to say how I really feel about it.",
            "title_similarity": "0.6004349",
            "sentiment_compound": -0.4257
        },
        {
            "id": "hgdy2aa",
            "score": 1,
            "text": "Still, I would say there is a difference between being a negative/pessimistic person, and a skeptical person. The latter is healthy, the former not so much,",
            "title_similarity": "0.4510487",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hgdz1xx",
            "score": 1,
            "text": "Lol your personal story reflects a large portion of Reddit, and an even larger portion over at r Atheism.",
            "title_similarity": "0.61400145",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgdz79n",
            "score": 1,
            "text": "This is something I learnt very early in my life: If you don't add value to people's life or if you start tearing people down, they are going to have very limited patience with you.\n\nA friend of mine is like this: always criticising people or trying to give them loads of advice. And he often wonders why people don't want to be his friend.",
            "title_similarity": "0.805272",
            "sentiment_compound": 0.4116
        },
        {
            "id": "hgdz86r",
            "score": 1,
            "text": "How’s it going?\n\nLiving the dream\n\nAnother day in paradise\n\nIf I was any better I’d be you \n\nThese are bad responses. Stop them. \n\nI like to go with “livin my life no time for no haters”",
            "title_similarity": "0.6458472",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgdzjd2",
            "score": 1,
            "text": "I mean, there's a benefit to taking everything apart. It's often called constructive criticism. The point is to try and not be a dick. Sometimes you'll be a dick because the other person cannot handle criticism, but usually it's in everyone's interest to have their shit torn apart to find the flaws.",
            "title_similarity": "0.7307874",
            "sentiment_compound": -0.449
        },
        {
            "id": "hgdznzz",
            "score": 1,
            "text": "You wish you could tell them? Why can’t you just tell them?",
            "title_similarity": "0.37523147",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hgdzptx",
            "score": 1,
            "text": "I'm cool with that. I don't like being around people who feel forced to act happy all the time and accept bad ideas regardless of the problems. When I \"tear apart\" someone's ideas, I often try my best to phrase it in a way that they understand, yes your idea will work, we just need to remove these barriers first. If they aren't willing to meet me halfway on overcoming those barriers, then I know they didn't have enough faith in their plan to begin with. I'm not going to work my butt off enacting a plan that even the one who created it doesn't believe in. I like real people, who accept that there's a problem and are willing to work with me to resolve those problems.",
            "title_similarity": "0.721277",
            "sentiment_compound": 0.7317
        },
        {
            "id": "hgdzzbe",
            "score": 1,
            "text": "pessimism != negativity",
            "title_similarity": "0.40037143",
            "sentiment_compound": -0.7263
        },
        {
            "id": "hge07tp",
            "score": 1,
            "text": "Life is so shit that everyday is a theatre. You must do the actor, smiling like an idiot while you're dead inside. Wow...I love to be here...uuuhh",
            "title_similarity": "0.6511539",
            "sentiment_compound": -0.5448
        },
        {
            "id": "hge0d2z",
            "score": 1,
            "text": "But depressive realism is real.\n\nJust keep it out of daily interactions.",
            "title_similarity": "0.42348623",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hge0lq8",
            "score": 1,
            "text": "That’s why my kids won’t have access to internet. It’s highly detrimental.",
            "title_similarity": "0.65890276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hge126z",
            "score": 1,
            "text": "Isn’t it insecurity…demonstrating power that no matter how irrational or pointless it satisfies their ego?",
            "title_similarity": "0.594172",
            "sentiment_compound": 0.0839
        },
        {
            "id": "hge13az",
            "score": 1,
            "text": "\"Really? You're not interested in discussing [horrible shit]? I just find it so... *interesting*.\"",
            "title_similarity": "0.51623344",
            "sentiment_compound": -0.8064
        },
        {
            "id": "hge1d7s",
            "score": 1,
            "text": "I'm disappointed that the comment section isn't just super negative deconstruction and unreasonable criticism",
            "title_similarity": "0.56983083",
            "sentiment_compound": -0.7309
        },
        {
            "id": "hge1dz0",
            "score": 1,
            "text": "Is there anything else do you use to get out of the negativity phase? I find it slowly snuck up on me and gets worse each year and I want to get rid of it. The pandemic doesn’t help but I need to focus on more positive aspects as this is getting draining.",
            "title_similarity": "0.7814642",
            "sentiment_compound": 0.6297
        },
        {
            "id": "hge25mb",
            "score": 1,
            "text": "I am working in professional services firm where we are all taught to approach things with a reasoned level of scepticism. 16 years in practice turned once all the time positive person into boring and dull one. I was lucky enough to realise it when it was not too late to change myself back to what I used to be. Now I am keeping a good control over not falling into same trap again.",
            "title_similarity": "0.65387034",
            "sentiment_compound": 0.3907
        },
        {
            "id": "hge26u8",
            "score": 1,
            "text": "I remember hearing someone talk about breaking out of the habit of 'listening to respond instead of listening to understand' and I think by listening to understand, you can negate your emotional response which could end up being negative and hostile.",
            "title_similarity": "0.60222334",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hge30rf",
            "score": 1,
            "text": "It's a huge turn-off for a lot of us on the internet too.",
            "title_similarity": "0.6082941",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hge36zn",
            "score": 1,
            "text": "On the other hand responding to everything with positivity is probably even worse and has a lot to do with complacency.",
            "title_similarity": "0.7214008",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hge3d59",
            "score": 4,
            "text": "Several years ago on Reddit, I saw someone describe themselves as a \"liker of things.\"  I decided that's what I wanted to be, and I've had so much joy from liking things ever since.",
            "title_similarity": "0.5017538",
            "sentiment_compound": 0.7769
        },
        {
            "id": "hge3gz9",
            "score": 1,
            "text": "You're absolutsly right. But I have noticed that posted  about an absolute lovey person or someone doing something absolutely lovey get a huge amount of upvotes. It givea me hope man.",
            "title_similarity": "0.49672025",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hge45gh",
            "score": 2,
            "text": "A lot of people do this, and I think the main cause of the negativity is a failure of an actual opinion on stuff.\n\nIt's easy to say something is bad, without actually saying WHAT makes it bad. I see it all the time online, but in person too.\n\nIf you do this, what you should do is ask yourself WHY you didn't like that thing. What made it bad, and how would YOU do it differently. Have an actual opinion.\n\nI find people don't want to agree nor share their opinions because they're afraid they will be made fun of. The source is insecurity. Target that and you'll learn to be more positive in general. You'll find what YOU like, and when you have to defend your opinion, you'll do more critical thinking in general.\n\nJust my two cents :)",
            "title_similarity": "0.820477",
            "sentiment_compound": -0.768
        },
        {
            "id": "hge4eii",
            "score": 1,
            "text": "You have shown remarkable self-awareness. This is a difficult thing to do and you should be proud of your growth.",
            "title_similarity": "0.42302752",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hge4pa7",
            "score": 1,
            "text": "I still am a bitter/cynical bastard, but not nearly as much as I used to be.  But it was/is completely my own making from being insecure and needing to \"prove\" myself by being \"smarter\" or by \"having better taste\", or whatever bullshit I concocted to stir myself up.  Even paying the slightest bit of attention to this shit made a huge difference in social interactions and me starting to feel comfortable with myself.",
            "title_similarity": "0.7859335",
            "sentiment_compound": -0.4166
        },
        {
            "id": "hge5hd7",
            "score": 1,
            "text": "Suggest amending title for Reddit users as follows. “Responding to the headlines of articles you haven’t read with negativity is a terrible habit that’s easy to fall into.”",
            "title_similarity": "0.8254974",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hge6lpa",
            "score": 1,
            "text": "In September I started to use an account on reddit I'd set up about two years ago. I was struck by the general negative attack mode of the platform.",
            "title_similarity": "0.7265787",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hge6sv4",
            "score": 1,
            "text": "Negative messaging about positive possibilities leads people to accepting that nothing good will happen. A society will become demotivated to do anything to change it for the better, turning expectation into reality.",
            "title_similarity": "0.6416259",
            "sentiment_compound": 0.4577
        },
        {
            "id": "hge75tl",
            "score": 1,
            "text": "This post is a prime example of what OP is talking about. \n\nLook at the number of awards it gets for being negative and telling us what not to do!! \n\n/s",
            "title_similarity": "0.74578583",
            "sentiment_compound": -0.2462
        },
        {
            "id": "hge7pq6",
            "score": 1,
            "text": "Yep this postmodernism nihilistic attitude towards life accomplishes nothing and makes everything worse. Sadly there are so many kids with this mentality",
            "title_similarity": "0.73264825",
            "sentiment_compound": -0.25
        },
        {
            "id": "hge8crw",
            "score": 1,
            "text": "I have a housemate like this. Never a good thing to say. Pissy all the time. I avoid her like the plague. She likes to stir up trouble and get the rest of us in trouble with the owner with her made up gripes.",
            "title_similarity": "0.82397836",
            "sentiment_compound": -0.2973
        },
        {
            "id": "hge8ha1",
            "score": 1,
            "text": "I actually just did an exercise in my college Public Speaking class where you had to state an opinion and not offend anyone.  One of the rules was you can not trash other's opinion of what you believe.  It was fascinating seeing a few students have to stop and re-write their prompt because they found they kept insulting or just listing negative things about people who have their counter opinion. \n\nBut yeah, if people ask you things and your respond with negativity or even curse words it sounds hostile to them.  Think of someone doing the same to you. \n\nThem:\"Hey what do you think of X?\" \n\nYou: \"Ohh I fucking hate X and people who like X are stupid.\"\n\nThem: \"Ohh I uhh like X alot...\" \n\nIt's a great conversation killer and easy way not to make friends.",
            "title_similarity": "0.6633972",
            "sentiment_compound": -0.9554
        },
        {
            "id": "hge8o84",
            "score": 1,
            "text": "Last week I had to gently let my coworker know that I would really appreciate if she would be open to different styles of getting the same tasks done and also that some people learn by experience not by being told. Luckily she was cool about it. I was getting tired of her shooting down every idea that the new person had because she did that to me when I was new too and I hated it.",
            "title_similarity": "0.7350328",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hge8tv9",
            "score": 1,
            "text": "It seems everybody online responds to anything with a negative attitude and I just don't get it. I could post a fact about something and someone would either try to prove me wrong, tell me why I'm wrong or be rude about it.",
            "title_similarity": "0.7972409",
            "sentiment_compound": -0.9169
        },
        {
            "id": "hge93r6",
            "score": 1,
            "text": "The irony of coming to a post about complaining to only complain about others who complain.\n\nY’all the best",
            "title_similarity": "0.5693226",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hge960u",
            "score": 1,
            "text": "Ugh, shitting on other people's interests is a quick way to alienate yourself and a huge turnoff. Nobody wants to be around negative people.",
            "title_similarity": "0.7224119",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hge9kyy",
            "score": 1,
            "text": "I have a friend who is not negative in a reactive way (she does not tear down other people or what they like), but every conversation seems to go back to either work problems or health problems. I know she has depression and other issues, but I feel it is hard to be supportive when every conversation always goes back to a family/health/work problem.\n\nAny advice in dealing with this?",
            "title_similarity": "0.57048357",
            "sentiment_compound": -0.8922
        },
        {
            "id": "hge9lu9",
            "score": 1,
            "text": "I keep telling myself this but I have a lot of trouble breaking habits associated with thinking negatively.\n\nI am mindful about negative thoughts — I acknowledge and dispose of them — but I’ve been having trouble removing negativity from interpersonal interactions. It’s just too easy to complain to make small talk, e.g.\n\nCould be I’m not a well enough practiced conversationalist, but anyone have any tips?",
            "title_similarity": "0.775969",
            "sentiment_compound": -0.9597
        },
        {
            "id": "hge9u29",
            "score": 1,
            "text": "Oh man, I’m so guilty of this! I’ve been actively trying to tone it down with the negativity and pessimism, it’s been a recent thing about 2-3 years or so, I’m still young and everything I read here makes sense!",
            "title_similarity": "0.6996538",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hge9vv4",
            "score": 1,
            "text": "This helps you waking up in the morning. The more you dread it the worse it is.",
            "title_similarity": "0.53273404",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hgead36",
            "score": 1,
            "text": "Except it's important to understand the problematic nature of most things. You can't just ignore racism, sexism, bigotry, or other hate. There are systematic problems that must be addressed. Those things all succeeded because people ignored them for so long.",
            "title_similarity": "0.74069846",
            "sentiment_compound": -0.381
        },
        {
            "id": "hgeak2n",
            "score": 1,
            "text": "This is my brother. He only talks about the stuff he hates. He rags on everything and everybody. We were driving once and a guy outside was running without a shirt on, just getting some exercise in, and it was like my brother thought the guy was giving a personal “fuck you” to him. Started saying stuff like “wow I bet that guy thinks he’s so cool”. He’s exhausting to be around, but he always wants to hang out because he has no friends and he also has stated that he’s not willing to change. Don’t be like my miserable, negative brother. Be nice and talk about stuff you love.",
            "title_similarity": "0.7702605",
            "sentiment_compound": 0.1122
        },
        {
            "id": "hgeavma",
            "score": 1,
            "text": "Cultural and personal problem\n\nNever met a person like that; maybe some kids in high school but they out grew that behavioral problem 'cos their peers pressured them to grow up or stfu\n\nEu is different from Usa i guess",
            "title_similarity": "0.6844913",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hgebng3",
            "score": 1,
            "text": "I believe this. I’m on my third Reddit account. I usually delete my account between 6 months to a year and take a break. I feel like I become a more negative person if I spend too much time on any social media.",
            "title_similarity": "0.69541025",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hgebov1",
            "score": 1,
            "text": "College did this for me.  Spent four years tearing shit apart.  Found it difficult later to embrace anything wholeheartedly.",
            "title_similarity": "0.6205935",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hgebq9c",
            "score": 1,
            "text": "I probably needed to hear that",
            "title_similarity": "0.16120064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgebw3c",
            "score": 1,
            "text": "Seems the reverse would also work. We could try to be less sensitive to criticism and instead engage with it, turning it into conversation fodder.\n\nPerpetually chipper people can also be a turn off for some.",
            "title_similarity": "0.5948833",
            "sentiment_compound": -0.0609
        },
        {
            "id": "hgec76n",
            "score": 1,
            "text": "I made a point to try not to post negative things here on Reddit some time ago. Probs 95% or so, and working on the remainder (politics is so hard to be positive a about). \n\nCertainly I don't try and upset anyone in my comments.\n\nAnd it's made me feel a lot better about the world frankly.\n\nAnd following a LPT here I try and empathize more, looking to those that might anger me and try and think what reason they have.\n\nFor example, someone cuts me up in traffic, maybe they're in a hurry to pick up their kid that's at a shopping centre alone having been abandoned by friends, or an aging relative has had a fall...\n\nThe time taken to think this diffuses the situation.\n\nAnd finally, I use pity over anger... Someone posts abuse to me, I pity them, they're clearly having a bad day, or are upset about something. That's not good for them.\n\nIt's all helped my mental state a great deal.",
            "title_similarity": "0.7202327",
            "sentiment_compound": -0.822
        },
        {
            "id": "hgecqt5",
            "score": 1,
            "text": "It’s funny all of you are on here complaining about people who complain too much lol\n\nIt’s not the internet there’s always been miserable people and instead of isolating them further because they bum you out and complaining about them, maybe you should try talking to them about negativity and how it breeds negativity.  I guarantee all of you were the miserable asshole before. Seems to me this whole post is a giant circle.  If negative people really bother you that much how is more negativity going to help?  \n\nI’ve been in some shitty situations in my life and fully understand how negativity breeds, and certainly that some people are just assholes.  But some of those assholes became my best friends as I literally couldn’t get away from them.  I learned this phrase “dude I love you but let’s talk about something positive this is bumming me out”\n\nMaybe some kindness and empathy would help.  Doesn’t mean you have to take peoples shit but if your goal is positivity you have to learn how to exude it as it is contagious.",
            "title_similarity": "0.87887496",
            "sentiment_compound": 0.8814
        },
        {
            "id": "hgect8m",
            "score": 1,
            "text": "I love games. Play then a bunch. Always have. They’ve been a decompressor, escape, and safe place for me through loads of bad times growing up and into adulthood. \n\nActively was as pessimistic as described here with things I both claimed to love and things I said I hated. There could be nothing good about anything in the long run, nothing was ever what I wanted it to be, any change was to spite me, I could never be happy for very long and blamed that everyone (the developers or players) were blind and were against me. \n\nThen I went to therapy, got some medication, made a lot of changes, and things are better. I still play games, many of the same ones, but I just stopped viewing things through a lens of ego centrism and hate, among other issues and qualities I had. Now I can’t stand most/any conversation places about the games I love because the negativity is absolutely overwhelming. I’ve recently gone to extreme lengths to actually keep myself from being able to interact with these places because I keep trying to stem the negativity and it keeps hitting me in the face. There’s no point when people want to play that game, just as there was no point for others engaging me when I did the same.",
            "title_similarity": "0.8533455",
            "sentiment_compound": -0.8374
        },
        {
            "id": "hged45z",
            "score": 1,
            "text": "I live for negativity. I befriended it at this point lmao it's who I am and I don't think I want help anymore anyways. I'll be negative if I want to be.",
            "title_similarity": "0.64842236",
            "sentiment_compound": -0.0829
        },
        {
            "id": "hgedf37",
            "score": 1,
            "text": "I have someone I work with who is just the same, she has always been bitched about because she always tries to avoid work. This is worsening my mental health by a long shot.",
            "title_similarity": "0.7973328",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hgedu25",
            "score": 1,
            "text": "Thanks for the reminder that is totally me. Always negative.",
            "title_similarity": "0.5788696",
            "sentiment_compound": -0.2648
        },
        {
            "id": "hgedy9m",
            "score": 1,
            "text": "That's not pessimism, that's cynicism.",
            "title_similarity": "0.24296731",
            "sentiment_compound": 0.5216
        },
        {
            "id": "hgefxne",
            "score": 1,
            "text": "I used to be friendly with someone like that. He would text constantly, freak out if I didn't reply in 5 minutes, never asked me what was up or how I was, complained about everything, shot down everything I said, and then complained that he had no friends. \n\nI stopped answering and felt bad about it because I think he just needed a friend but damn it was so exhausting. So one sided. So negative. And I am far from one of those good vibes only people; I have my complaints but this dude was another level.",
            "title_similarity": "0.7985632",
            "sentiment_compound": -0.9607
        },
        {
            "id": "hgeg3ja",
            "score": 1,
            "text": "Piss off with this garbage",
            "title_similarity": "0.48211694",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgeg5we",
            "score": 1,
            "text": "Its all about anonymity. Because in real life, you can get punched in the face for saying something offensive.",
            "title_similarity": "0.7056616",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hgegdyy",
            "score": 1,
            "text": "I have a housemate who uses problems to legitimize her behaviour. She can never say \"I just dont feel like it\" its always gotta be \"Today was so heavy, I just cant\" and that becomes real tiring when its about personal things. She suffers most from it ofc.",
            "title_similarity": "0.7378319",
            "sentiment_compound": -0.7851
        },
        {
            "id": "hgeglhu",
            "score": 1,
            "text": "OP, this is great advice.\n\nAlso:  You know what is a great habit that people generally love?\n\nSelf-awareness and a willingness to try to do better!\n\nCongrats on manifesting that shit, and sharing it.",
            "title_similarity": "0.49097174",
            "sentiment_compound": 0.9652
        },
        {
            "id": "hgegrgz",
            "score": 1,
            "text": "That being said, if you don't want certain people around you because you can't help but think about their negative traits, playing the negativity game is useful. Like \"ugh, I really hate...\" Insert everything until they get the message.",
            "title_similarity": "0.7129684",
            "sentiment_compound": -0.9265
        },
        {
            "id": "hgehjsr",
            "score": 1,
            "text": "I like a healthy cynical-ness in being able to joke about bad things but not to actively see everything as terrible and bad unconditionally. I think there is a fine line between coping humour and straight up negativity and putting others down. \n\nYou can have both positivity and negativity but some people make one or the other their entire personality and both can actually be bad for you.",
            "title_similarity": "0.7150947",
            "sentiment_compound": -0.9168
        },
        {
            "id": "hgehqhn",
            "score": 1,
            "text": "Awful PLT, negative emotions and trolling is all I know ;P",
            "title_similarity": "0.6558068",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hgei2c1",
            "score": 1,
            "text": "I find it fascinating how everything is always about one upping the other guy.\n\nSomeone tells a joke, the next guy alters that joke a bit, the next one adds some cringe FTFY twist to it, then the next one starts some comment chain about brians mom or some shit and then it just snowballs and nobody remembers what the original joke was.\n\nYou buy a new fancy pc that is super high end *to you* and all you get is \"oh I have that too, but mine does a cartwheel when I tell my Alexa to whizzle\" like bruh who asked? \n\nI recognize that I do that a lot too and sometimes try to get away from it, but it feels weird. Like trying to swim against the current when there's people coming at you with kayaks.",
            "title_similarity": "0.77681077",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hgeij1y",
            "score": 1,
            "text": "Terrible tip, 0/10, dumbest thing I’ve ever heard.\n\nBut seriously, this is totally a matter of preference.  Some people are positive, some people aren’t, and there’s nothing wrong with either.  Don’t insult people who have their fun in a different way than you just because you don’t like the way they express themselves.  Just find others who are compatible with your conversation style, or deal with it.",
            "title_similarity": "0.7053553",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hgej3yf",
            "score": 1,
            "text": "The same exact thing all over the Internet",
            "title_similarity": "0.17384721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgejbvo",
            "score": 1,
            "text": "I’m always in a constant battle with myself to not being overly pessimistic. Sometimes I wonder why people don’t talk to me that much, but then I remember that I really easily fall into that pessimistic mindset and realize that I’ve set the precedent, they’re just responding to it. Working on that, though.",
            "title_similarity": "0.7587196",
            "sentiment_compound": 0.0115
        },
        {
            "id": "hgejc92",
            "score": 3,
            "text": "The opposite phenomenon is a thing too, though: people who try to squeeze a positive perspective out of the worst thing. Like, someone has treated you really badly, repeatedly, and you know already when you tell the overly positive person about it, they can not respond differently then \"oh you know maybe they didn't mean it\". Some benefit of the doubt, and good faith is certainly required in order not to become a cynical asshole, but sometimes there are bad things and some people cannot bring themselves to even admit it, let alone consider doing something about it. Negativity and pessimism, in the right measure, have its purpose just as positivity and optimism do.",
            "title_similarity": "0.71469843",
            "sentiment_compound": 0.0138
        },
        {
            "id": "hgeju33",
            "score": 1,
            "text": "Lol! Thanks for the reminder. Hi-5! 🙏",
            "title_similarity": "0.2668764",
            "sentiment_compound": 0.7418
        },
        {
            "id": "hgekgmh",
            "score": 3,
            "text": "Bro internet culture does NOT reward pessimism lol.   The internet has made critics out to be assholes.  Plenty of platforms don’t even have an option to dislike.",
            "title_similarity": "0.7596195",
            "sentiment_compound": -0.8961
        },
        {
            "id": "hgekhby",
            "score": 1,
            "text": "Anyone have advice on how to get out of this habit?",
            "title_similarity": "0.28277695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgeks2a",
            "score": 1,
            "text": "I used to hang around a person like this in college. And predictably, I copied their mannerisms and became a cesspool of negativity myself. Turns out they were using me in the end. It didnt help that I grew up with parents who are very negative people (to this day). They dont see it, but everyone else can. \n\nI took a year to improve myself, see my harmful patterns and came out a positive person in the end. I try to improve myself everyday.",
            "title_similarity": "0.7364473",
            "sentiment_compound": 0.8772
        },
        {
            "id": "hgekztt",
            "score": 1,
            "text": "I put those negative people on the spot by asking them to tell me what's good when they finish saying something is bad. They just stop talking.\n\nI do like people who deliberate between good and bad and critique things. Saying everything is good is just as shallow and useless as saying everything is bad. But, just saying everything is bad is the same thing as saying nothing at all imo.",
            "title_similarity": "0.7234324",
            "sentiment_compound": -0.8674
        },
        {
            "id": "hgel5lc",
            "score": 1,
            "text": "Thank you. Thank you for your honesty and for being adult enough to look at yourself seriously. I was the same when I hit 24. Fortunately, before she dismissed me, a friend said \"if it seems like everyone else, maybe it is not them, maybe it is you.\" It took loosing a good friend to wake me up. You did it on your own. You are awesome!",
            "title_similarity": "0.5463888",
            "sentiment_compound": 0.9709
        },
        {
            "id": "hgempi2",
            "score": 1,
            "text": "This post is great, totally articulated my experience with someone in my uni that I didn't really understand. He would just mostly shit on a conversation if you brought up any subject or topic of discussion. \n\nHowever, he only did it with people lower than him and never to a professor or someone who was above him...",
            "title_similarity": "0.6511322",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hgemwcp",
            "score": 2,
            "text": "But the controversial comments is the only reason i go on reddit",
            "title_similarity": "0.68622255",
            "sentiment_compound": -0.296
        },
        {
            "id": "hgenkqp",
            "score": 1,
            "text": "As a complete cynic I would never tear anyone down, I’d just think it… later as I’m walking away… no need to be rude. People try to go for edgy deadpan and accidentally turn into contrarians…",
            "title_similarity": "0.64690673",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hgeoegk",
            "score": 1,
            "text": "Here's the tip since OP didn't include one:\n\nBe negative on Reddit with strangers, so that it's out of your system when it comes time with people you actually care about",
            "title_similarity": "0.660737",
            "sentiment_compound": -0.128
        },
        {
            "id": "hgeoqk1",
            "score": 1,
            "text": "Anytime I go on social media I get pretty upset. Reddit is starting to get the same way so I've tried limit it. I got rid of all the other Social media apps off of my phone. If I do on one I try to avoid the comments because that what really sets me off.",
            "title_similarity": "0.8389611",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hgep05a",
            "score": 1,
            "text": "I opened a business with a negative person. 2 years working together, and he almost dragged me.to.his black pit of blasé. I'm fighting really hard to come back to the cheering happy person I was before.",
            "title_similarity": "0.74801487",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgep4hs",
            "score": 1,
            "text": "LPT:  It's also a huge turnoff on the internet.\n\nYou're being programmed for negativity by ad agencies hired to make you feel powerless.  Don't be a muppet.",
            "title_similarity": "0.78214145",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hgepgr0",
            "score": 1,
            "text": "You do what you practice and people practice mean on a regular basis.",
            "title_similarity": "0.22072586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgepgso",
            "score": 1,
            "text": "Lie to yourself and to other people so you can fit in. Noted.",
            "title_similarity": "0.57310444",
            "sentiment_compound": 0.4144
        },
        {
            "id": "hgepj96",
            "score": 1,
            "text": "I try to share this whenever I can, so I want to make a comment about David Foster Wallace and the New Sincerity movement, because I feel like they are related to what you are getting at here. Specifically I wanted to share this quote, from Wallace’ essay titled E Unibus Pluram:\n\n>\tThe next real literary “rebels” in this country might well emerge as some weird bunch of anti-rebels, born oglers who dare somehow to back away from ironic watching, who have the childish gall actually to endorse and instantiate single-entendre principles. Who treat of plain old untrendy human troubles and emotions in U.S. life with reverence and conviction. Who eschew self-consciousness and hip fatigue. These anti-rebels would be outdated, of course, before they even started. Dead on the page. Too sincere. Clearly repressed. Backward, quaint, naive, anachronistic. Maybe that’ll be the point. Maybe that’s why they’ll be the next real rebels. Real rebels, as far as I can see, risk disapproval. The old postmodern insurgents risked the gasp and squeal: shock, disgust, outrage, censorship, accusations of socialism, anarchism, nihilism. Today’s risks are different. The new rebels might be artists willing to risk the yawn, the rolled eyes, the cool smile, the nudged ribs, the parody of gifted ironists, the “Oh how banal”. To risk accusations of sentimentality, melodrama. Of overcredulity. Of softness. Of willingness to be suckered by a world of lurkers and starers who fear gaze and ridicule above imprisonment without law. Who knows.\n\nThis quote almost single handedly changed my perspective on how our society currently uses irony in ways that end up being ultimately harmful. I used to very much be one of those who viewed most things through a frame of irony, and for who the act of attacking/deconstructing came naturally, but who relied on that rather than doing something that could offer alternative solutions. \n\nIt got me to look more into what the [New Sincerity](https://en.m.wikipedia.org/wiki/New_Sincerity) movement was about, and has made it so when I find myself dismissing something through an ironic lense, I take a step back and ask myself “is this really something that is harmful in any way?”, and if not, try to learn how I can appreciate it for what it is, even if it’s not something I would naturally appreciate.\n\nAnother quote about Wallace that I think further shows how it relates to your points:\n\n>The style is one in which a new sincerity will overturn the ironic detachment that hollowed out contemporary fiction towards the end of the 20th century. Wallace was trying to write an antidote to the cynicism that had pervaded and saddened so much of American culture in his lifetime. He was trying to create an entertainment that would get us talking again.",
            "title_similarity": "0.64845943",
            "sentiment_compound": -0.8182
        },
        {
            "id": "hgepulu",
            "score": 2,
            "text": "I just deleted everything besides reddit and I vastly limit my attention on here because the longer I'm on it the angrier I get reading comments.\n\nIts not just negativity to avoid its getting sucked into scrolling mindlessly or addiction to dopamine&attention.",
            "title_similarity": "0.84334093",
            "sentiment_compound": -0.7002
        },
        {
            "id": "hgeqf7m",
            "score": 1,
            "text": "I learned this lesson the hard way after explaining how pointless college and professional sports are to the friends I grew up going to football games with. That was the last time I was ever invited to go to a game or hype event with them. Somethings are worth keeping to yourself.",
            "title_similarity": "0.6463959",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hgeqih9",
            "score": 1,
            "text": "My wife is pessimistic when it comes to entrepreneurship. I started my own business some years ago. Her late-father did too at a young age. Her brother is about to open a bagel shop. \n\nFor her, at least we know where her pessimism comes from — she’s risk-adverse, desires clarity, and gravitates toward stability. (Also, her dad died in debts and disappointments that the family had to deal with although he started off well.) \n\nNothing wrong with her pessimistic view on starting a business — she’s a wonderful mother, highly intelligent at work, and everyone loves her for her joy and kindness. She sells her pessimism as practicality. But I explained that even in practicality, there’s a negative and positive position to take. \n\nTo me, if the conceptualised supply of a square peg doesn’t fit the demands of a round hole, we should either shave the peg or the hole to fit. That’s business practicality. For her, if it doesn’t fit, it will never work. I believe that there’s a solution to any problem and in entrepreneurship, problems are aplenty. \n\nI think it’s important to keep things separate and distinct, have a clarity of distance, and really understand where one’s negativity comes from if it affects you. I always thought that my wife doubted my entrepreneurship but in reality, she doubted her own. \n\nWhen I’m pessimistic or angry or triggered, it doesn’t show the other person’s character, it shows mine and, in turn, points to what I should work on.\n\nBut yeah, if I had long day at work and not in the mood to get shot down, I’ll refrain from sharing the journey of what I’m about to do and only share the destination of what’s done. Makes for a more pleasant dinner. Lol.\n\nEdit: words",
            "title_similarity": "0.6562158",
            "sentiment_compound": 0.9447
        },
        {
            "id": "hgerbvh",
            "score": 1,
            "text": "It's a huge turn-off online too.",
            "title_similarity": "0.4917081",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgerhbu",
            "score": 1,
            "text": "I'd say the internet is half for judging, shaming and making fun of people, and the other half is for celebrating acts of kindness, seeing cute animals and drooling over hot people. It's sensationalism. \n\nRecently I started scrolling through Reddit by new posts and it's just... less interesting (besides intermittent and unsolicited naked people). I guess what gets upvoted is what warrants reaction, and somebody having a radical, pessimistic view does that. People react and it gets more visibility\n\nNow imagine if this was true in real life where you were constantly coming across these extremes. I think I would go insane",
            "title_similarity": "0.8207749",
            "sentiment_compound": 0.9187
        },
        {
            "id": "hgerr5a",
            "score": 1,
            "text": ">\"hey, if you shoot down everything everyone says, nobody is going to want to say anything to you anymore.\"\n\nIf you're always putting out lights, can't be surprised about living in the dark.",
            "title_similarity": "0.5621606",
            "sentiment_compound": -0.4149
        },
        {
            "id": "hgerz12",
            "score": 1,
            "text": "I had a buddy...note the past tense. :) He would be excited as hell every time he got something he really wanted like a car, gun, PC, guitar, amplifier etc. I mean I was always really happy for the guy, because I also like these things.:)\n\nAnyhow, I noticed an odd pattern, whenever any one of us, (his buddies) would get something cool, it was always, \"oh yeah, they're/that's kind of a shitty version/model/type of item, or something like; \"Does he even know how to use it?\" etc etc.\n\nWithout fail this was his standard response. I'm not a big fan of flexing, but this was buddy stuff, you know. You expect your buds to be happy about something you're excited about. \n\nNo longer friends, but that has more to do with their life style I just cannot relate to.",
            "title_similarity": "0.6535053",
            "sentiment_compound": 0.731
        },
        {
            "id": "hgesaza",
            "score": 1,
            "text": "I agree, but what is called negativity of me is me being critical. Unfortunately I don't have an easy switch on or off button if being a critic. This has unpacked many unpleasant situations as I am not the one that thinks critique is negative, I see it as something positive that can prove honesty and really hine anything that is being criticised. Because I see it as a pro while others don't it is especially difficult for me switch of critique.",
            "title_similarity": "0.69442093",
            "sentiment_compound": -0.9716
        },
        {
            "id": "hgesc94",
            "score": 1,
            "text": "What did you do to become a more positive person?",
            "title_similarity": "0.14313325",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hgesjeu",
            "score": 1,
            "text": "Gold topic and discussion thread. I will try to be as positive and reasonable as I can during an interaction online or IRL. However, many things in the world can be frustrating, infuriating and even depressing to think or talk about. In that case, I will try my best to make a meme or joke out of it. Humor is the best medicine.",
            "title_similarity": "0.7351088",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hgeslgy",
            "score": 1,
            "text": "My dad is a good man but was always cynical/negative towards everything.  I never noticed until as a young adult that I was doing the same thing.  It is easy to do without even knowing it but fortunately it's also easy to turn around once you're aware of it.  Now I am trying to dad my dad (working so far!) into appreciating things for what they are instead of what they aren't",
            "title_similarity": "0.7208761",
            "sentiment_compound": 0.9347
        },
        {
            "id": "hgesmat",
            "score": 1,
            "text": "I love to tell other adults to stop whining",
            "title_similarity": "0.6411885",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgesmvn",
            "score": 2,
            "text": "It's so hard to break this habit, especially if you had a traumatic childhood in which you were modeled that behavior and/or you used negativity as a defense mechanism to prevent disappointment.",
            "title_similarity": "0.64457816",
            "sentiment_compound": -0.8858
        },
        {
            "id": "hget1zw",
            "score": 1,
            "text": "It’s a huge turn off online, too.",
            "title_similarity": "0.5823827",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hget4tk",
            "score": 1,
            "text": "It’s pretty much part of growing up I think although not everyone goes through it. It’s the phase where yoy really think you’re an adult cause you’re 23 but you actually still know jack shit about anything and you feel like your opinion is super based in reality and totally correct. Then you get older towards 30 like you said and look back and think sheeeeeesh oh boy yeh that was me.",
            "title_similarity": "0.59126925",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hget5rk",
            "score": 1,
            "text": "My gran is 101-years-old.  She told me when I was a kid that there is ALWAYS a silver lining.  ALWAYS.  Find it, she'd say, and you will always be happy.  Best advice anyone ever gave me.  Sometimes the silver lining is that the work day is finally over and there's chardonnay in the fridge.  But it's silver and it's a lining, so I'll take it!!",
            "title_similarity": "0.53138566",
            "sentiment_compound": 0.674
        },
        {
            "id": "hgeth3u",
            "score": 1,
            "text": "Transcend pessimism, embrace adhoc empathic flux.",
            "title_similarity": "0.17954631",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgetn51",
            "score": 1,
            "text": "[It's a condition called Being A Cynical Asshole.](https://youtu.be/IkQqs9X0qnc)",
            "title_similarity": "0.56214476",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hgeu0yk",
            "score": 1,
            "text": "you are totally right I am a full time optimist and shy away from pessimists",
            "title_similarity": "0.41872716",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hgeu4a8",
            "score": 1,
            "text": "I always feel sorry for people like this and take it as a sign that they cannot (or at least, do not feel as if they can) control their own lives and produce their own happiness and direction",
            "title_similarity": "0.7452447",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hgeu6dn",
            "score": 1,
            "text": "As a massage therapist, I can promise you negativity doesn't just affect your social life, but your physical well being as well. I have clients who are chronically negative and it \\*shows in their bodies. The tension they have in their bodies is tighter and more stubborn than my positive and gracious clients.",
            "title_similarity": "0.64988405",
            "sentiment_compound": 0.384
        },
        {
            "id": "hgeutqm",
            "score": 1,
            "text": "How do you tell a friend whose like this, to be more possible (or less negative)? I cant seem to find the words or timing or solution, and dont want to give up on them",
            "title_similarity": "0.48594528",
            "sentiment_compound": 0.5221
        },
        {
            "id": "hgevjck",
            "score": 1,
            "text": "I’m glad you were able to get out of that mindset.",
            "title_similarity": "0.34215337",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgew90z",
            "score": 1,
            "text": "Mt brother started dating this girl who is only capable of seeing the negative in the world. Over 6 years I've slowly lost the guy I knew as a brother turn into an insanely political party pooper. He doesn't work, neither does she but every single one of their financial issues gets blamed on the world at large instead of spending 5 minutes looking inward. I hope he wakes up one day but he's actively pushed my family so far away with his negativity and constant whining about how unfair the world is for our generation.",
            "title_similarity": "0.8081463",
            "sentiment_compound": -0.8641
        },
        {
            "id": "hgewrjn",
            "score": 1,
            "text": "Haters gotta hate!\n\nCheers and have a wonderful day!",
            "title_similarity": "0.5521702",
            "sentiment_compound": -0.1739
        },
        {
            "id": "hgexyhz",
            "score": 1,
            "text": "I love hating society",
            "title_similarity": "0.66775876",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hgeyzf0",
            "score": 1,
            "text": "i am pessimistic because i am severely fucking depressed. i try to just stay quiet but it doesn't always work.",
            "title_similarity": "0.6234321",
            "sentiment_compound": -0.6183
        },
        {
            "id": "hgf05fo",
            "score": 1,
            "text": "Bring a negative cynical asshole is the easiest, laziest way to feel smart. However, you are not",
            "title_similarity": "0.46955082",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hgf06kw",
            "score": 1,
            "text": "Could I send this to my roommate or is that too forward? Is there a good way to bring this up irl without coming across as a dick? My bro is too negative and he’s a big gamer, so far I’ve just been trying to spread positive vibes around him but it’s fruitless—always negative and always complaining. Anybody got advice?",
            "title_similarity": "0.83300817",
            "sentiment_compound": -0.8418
        },
        {
            "id": "hgf0oi4",
            "score": 1,
            "text": "Very articulate and a very good point reminds me of my friend Max who has serious anger management problems. It's a total roller coaster hanging out with him he stays in his room all day for the last 20 years coaches lacrosse here in there lives with his mom which is not a big deal but when you disagree with them on anyting casually or even like something that he dislikes like a radio show or a TV show. He then will a object and tear down anything you say or talk about the rest of the day until it's two point where are you have to go because he's just fishing for an argument",
            "title_similarity": "0.73564345",
            "sentiment_compound": -0.4221
        },
        {
            "id": "hgf10jb",
            "score": 1,
            "text": "Forced positivity just perpetuates the same mainstream ideas over and over, whether they have merit, or not. Strategic negativity is so necessary right now, its a shame that its portrayed as a bad trait.",
            "title_similarity": "0.635296",
            "sentiment_compound": -0.2018
        },
        {
            "id": "hgf125t",
            "score": 1,
            "text": "When I was that age, i was negative but towards myself. Like, \"thanks for playing with me, sorry i was so bad\" \"sorry i suck so much\" i dont even remember if i was fishing for compliments or what, but it took a while for me to realise how other people felt after i said something like that.",
            "title_similarity": "0.75865394",
            "sentiment_compound": 0.0889
        },
        {
            "id": "hgf12ky",
            "score": 1,
            "text": "Misery loves company. It's really a symptom of depression because people aren't happy they want other people to be unhappy",
            "title_similarity": "0.7459",
            "sentiment_compound": -0.8664
        },
        {
            "id": "hgf2hr6",
            "score": 1,
            "text": "That's honestly the most important PSA i've read this week.\n\nI observed a trend that people online in general are becoming just a statistic, just a cog in the machine, to drive engagement. To boost traffic to certain sites, videos, hashtags. Social influencers post \"provocative\" comments, and people eat it up every. time....  which drives up comments which drives up \"engagement\" \"metrics\". A lot of people are not even aware of the role they're playing in all this.\n\nI think people who spend a lot of time online, raise and educate each other. We educate each other how to act and how not to act. If there's a subculture that rewards angst, their members become... angsty. But in real life they become quiet and shy because they know they can't act sardonic and snarky like they do online. This is a really unpopular opinion, but if someone is lonely, they should count how many times they have been hostile or combative online in the past week.",
            "title_similarity": "0.7801348",
            "sentiment_compound": 0.5418
        },
        {
            "id": "hgf2xfp",
            "score": 1,
            "text": "Some entire subreddits could use that advice...",
            "title_similarity": "0.21201605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgf3htz",
            "score": 1,
            "text": "I don't think I'm negative in the way you are, I couldn't rip apart someone's interests or beliefs just because. But I do think I don't compliment people enough. I don't have the instinctual vocabulary to just, say something nice about someone. I say mean things to my close friends because it just naturally comes out, Im gunna work on that. Just small things like.. if someones looking nice, or did something theyre proud of. Just acknowledging that effort in a positive way. Being a suck up. But not a bad one. \n\nJust a little bit more, enough that people think \n\"yeah I really like him.\" \nNot just \n\"that's just how he is. It's his weird way of showing gratitude and appreciation.\" Which, to be fair, it is. But I think it's something I can work on.",
            "title_similarity": "0.596653",
            "sentiment_compound": 0.9913
        },
        {
            "id": "hgf3r5k",
            "score": 1,
            "text": "This is….actually really good advice. Especially if you’re someone who doesn’t get tons of irl socialization (I know from people’s comments here that this is common among redditors and I have periods where it applies to me occasionally)\n\nIt’s important to remember that irl socialization follows different rules. You can’t devil’s advocate/inappropriate joke/complain as freely irl or you’ll look like a complete ass.\n\nI think a lot of people without much irl practice assume that online convos are similar when most of the time they’re way different.\n\nBeing positive almost all the time can feel weird and fake but it’s honestly what you have to do, especially in the workplace and always with people you don’t know well yet.\n\nI used to be super negative and half the time it was just me not realizing that I needed to use sarcasm a lot more sparingly.",
            "title_similarity": "0.80071795",
            "sentiment_compound": 0.8078
        },
        {
            "id": "hgf40ny",
            "score": 1,
            "text": "Being a cynical asshole on Reddit will likely make you popular, but no one likes that guy IRL. Why do so many losers seem unable to understand this basic concept?",
            "title_similarity": "0.8194251",
            "sentiment_compound": -0.8937
        },
        {
            "id": "hgf4b5h",
            "score": 1,
            "text": "This is a big problem for me. It was ironically social media that made me realize it. I started to see that the only reason I would go to tweet something was if it was a gripe, complaint, joke-at-the-expense-of, just always some manner of negativity. I tried to stop doing that, and I basically stopped doing anything on social media. \n\nSince then, I notice it a lot in others. Particularly my best friend. You literally can't bring up any subject to him without getting a snap negative reaction. I'm trying to be better but it's hard. Like you said, it's a life long habit at this point.",
            "title_similarity": "0.83285534",
            "sentiment_compound": 0.1459
        },
        {
            "id": "hgf4jhc",
            "score": 1,
            "text": "Hear me out though... if we're talking about a project and 90% is awesome, then I'd rather focus on the 10% that needs improving. Because I'm short of time and so is everyone else! Yes, work would generally be more fun if we had more time is the simple answer! Moaning about routine stuff you can't change is sapping though",
            "title_similarity": "0.6294547",
            "sentiment_compound": 0.9243
        },
        {
            "id": "hgf4zcy",
            "score": 1,
            "text": "Awful bold of you to assume others listening to what you have to say is what gives what you have to say value.",
            "title_similarity": "0.4174642",
            "sentiment_compound": 0.25
        },
        {
            "id": "hgf5agg",
            "score": 1,
            "text": "I have been trying g yo work on getting better about not beingxdo negative.  Its difficult,  I struggle and my dearest friend calls me on it every time I pass a negative judgment.   \n\nI find now fibd I truly have to evaluate before saying something and end up biting my tongue more often than nit.",
            "title_similarity": "0.790509",
            "sentiment_compound": 0.7963
        },
        {
            "id": "hgf5jji",
            "score": 1,
            "text": "Nuh uh, no it isn’t, you shut up!",
            "title_similarity": "0.27485746",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hgf6ao2",
            "score": 1,
            "text": "This is a really vague tip. And it doesn't sound like you were \"too negative\"\n\n\n\n\nIt sounds like you were a jerk.\n\n\n\n\n\nBeware of toxic positivity.",
            "title_similarity": "0.5801785",
            "sentiment_compound": -0.4772
        },
        {
            "id": "hgf774x",
            "score": 1,
            "text": "My mom is like this. Every restaurant she has ever been to has been bad. Food is \"tough\" or tastes bad or the servers were bad. I can't stand to listen to her go on and on about how she got sooo sick from eating at a restaurant that I've eaten at plenty with zero issue. She never likes or trusts her doctors, she never feels good, she's always angry with someone. It's exhausting and sadly my sisters and I avoid talking to her to some extent because it's so frustrating.",
            "title_similarity": "0.76150745",
            "sentiment_compound": -0.9857
        },
        {
            "id": "hgf7b93",
            "score": 1,
            "text": "This is the truest thing ever. And u hope that everyone in the world reads this and it resonates with them",
            "title_similarity": "0.38540238",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hgf87x1",
            "score": 1,
            "text": "my girlfriend and dad are great at this. \n\n\nBe sad sucks, imho. I'd rather look on the bright side.",
            "title_similarity": "0.6507053",
            "sentiment_compound": 0.34
        },
        {
            "id": "hgf8856",
            "score": 1,
            "text": "You get farther pursuing the things you love than following things you hate",
            "title_similarity": "0.3079533",
            "sentiment_compound": 0.128
        },
        {
            "id": "hgf94gg",
            "score": 4,
            "text": "Too bad being a realist is conflated with being a pessimist.",
            "title_similarity": "0.5454093",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hgf9huy",
            "score": 1,
            "text": "I cannot emphasize enough how much this is directed at a friend of mine, the most relentlessly negative person I know.",
            "title_similarity": "0.71920264",
            "sentiment_compound": -0.197
        },
        {
            "id": "hgf9kyd",
            "score": 2,
            "text": "How does internet culture reward us for pessimism?",
            "title_similarity": "0.6535951",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgf9rkf",
            "score": 1,
            "text": "This is spot on with what I am\nCurrently going through, in my mid 30s, and it’s hard! Can anyone recommend any books or reading that might help?",
            "title_similarity": "0.5284395",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hgf9y20",
            "score": 1,
            "text": "I think I lost a friend after I told her that her and I wouldn't work out in dating because she is really negative. We use to text every other day and now it's been 2 weeks without talking. I would give her motivation to work out, that she got it, but she would always counter with negativity. \n\nI am not interested in her dating wise but cool person to talk to. It's just that her negativity is a killer.",
            "title_similarity": "0.78219366",
            "sentiment_compound": -0.9183
        },
        {
            "id": "hgfa7hu",
            "score": 1,
            "text": "I hope you all have a terrible week",
            "title_similarity": "0.60881317",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgfad1q",
            "score": 1,
            "text": "Internet culture is the embodiment of coping.",
            "title_similarity": "0.30555868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgfbo1n",
            "score": 1,
            "text": "Being the voice of dissent doesn’t make you more intelligent.",
            "title_similarity": "0.34184983",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hgfdv3j",
            "score": 1,
            "text": "This is good advice.  I'm still trying to relearn how not to treat everyone at work as a potential enemy after working many years in a toxic environment.\n\nThings go a lot better if you assume good intentions and try to be allies from the get go.",
            "title_similarity": "0.64842045",
            "sentiment_compound": 0.4482
        },
        {
            "id": "hgfefd7",
            "score": 1,
            "text": "Funnily enough,  I think this sums up why I think I would hate myself from 2+ years ago if I met them. Since then I think I've gone through a lot of character development and I'm a much more positive person and I'm now lucky enough to be completely surrounded by close friends :)",
            "title_similarity": "0.6823983",
            "sentiment_compound": 0.8999
        },
        {
            "id": "hgfg4c5",
            "score": 1,
            "text": "I try to keep a healthy mix. While being around someone who is constantly negative can be depressing and grating, being around someone who is constantly positive can be exhausting.",
            "title_similarity": "0.56181985",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hgfgd2d",
            "score": 1,
            "text": "I was this person. My nature tends to veer toward the negative side with anxiety and depression and a messed up childhood creating some bad coping mechanisms. I’ve been working really hard the last two years to break this habit and see the positive. I still have the intrusive thoughts and feel bad but I don’t drag everyone down with me as much. It’s a work in progress. Definitely a good tip though. Don’t be that asshole.",
            "title_similarity": "0.802472",
            "sentiment_compound": 0.4684
        },
        {
            "id": "hgfglgd",
            "score": 1,
            "text": "1000% this^ I know I can be pessimistic at times, but I usually catch myself when I know I’m going to get in a mood, and avoid people interaction until I’m a little less toxic. \n\nThat being said, it’s hard to avoid pessimistic people if they’re in your significant other’s family. My partners cousin, oldest brother, and second oldest brother and his wife are pretty judgmental people. It’s really nerve wracking being around them. They’re nice but at the same time one false move and they immediately start shitting on you.",
            "title_similarity": "0.8313947",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hgfguzg",
            "score": 1,
            "text": "My sister is always complaining about something every time I see her at work. So I have a hard time wanting to hang with her outside of work.",
            "title_similarity": "0.66783154",
            "sentiment_compound": -0.296
        },
        {
            "id": "hgficzc",
            "score": 1,
            "text": "Suffering from success.",
            "title_similarity": "0.16975813",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hgfjh09",
            "score": 1,
            "text": "Congrats, OP.  You've gained wisdom, insight and maturity.  Oftentimes people fall into the trap of thinking that being cynical and contrary makes them smarter than everyone and \"above it all\".  That attitude gets tiresome to be around real quick.",
            "title_similarity": "0.6701182",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hgfk3g1",
            "score": 1,
            "text": "If I could add a detail: my go to response used to just be *no* and unfortunately still is on occasion. Like, you don't even think about it, it's just *no*. I really try these days to consider what's being offered and whether or not I'm just feeling bummed out in the moment.",
            "title_similarity": "0.6770061",
            "sentiment_compound": -0.0695
        },
        {
            "id": "hgflclc",
            "score": 1,
            "text": "I noticed this very quickly in online dating. I would match someone very promising but would very quickly be turned away by constant negativity in the conversation.",
            "title_similarity": "0.7610284",
            "sentiment_compound": -0.5351
        },
        {
            "id": "hgflp21",
            "score": 1,
            "text": "Yes don't spread negativity, it's harmful for yourselves and for the world",
            "title_similarity": "0.5283999",
            "sentiment_compound": 0.6599
        },
        {
            "id": "hgfo154",
            "score": 1,
            "text": "Yeah but this leaves no room if you’re having a shit day and need to aire any grievance. If only life were full of only positive events…",
            "title_similarity": "0.56122094",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hgfo6jo",
            "score": 2,
            "text": "Yup, my motto ever since I turned 30 is \"there are enough negative people in the world\" to help remind me to never go back to that place again, I still fall back from time to time, 30 years of pessimism will do that... But ever since I decided to change, my social life is slowly improving.",
            "title_similarity": "0.7482641",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hgfoxno",
            "score": 1,
            "text": "how does one make a friend ×_×",
            "title_similarity": "0.26394483",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hgfpabh",
            "score": 2,
            "text": "It took me a long time to unlearn negativity and nihilism. It's easy not to give a fuck because whatever it is you care about never works out anyways. But I find a positive attitude influences more than just your day and finding the bright side of a shitty situation helps everyone involved. I get a lot of flak for being positive among my negative peers. But ill try not to let myself get as cynical as I used to be.",
            "title_similarity": "0.77321696",
            "sentiment_compound": -0.09
        },
        {
            "id": "hgfq5pv",
            "score": 1,
            "text": "Every time I say something like this I get trolled",
            "title_similarity": "0.6139011",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgfs7ha",
            "score": 3,
            "text": "I cannot tell a lie, though. If something is going to kill me, I'm not going to pretend I'm going to be OK.\n\nLPT should start with \"10% of life is 'what happens to you' - 90% is 'how you react to it.' \"",
            "title_similarity": "0.57346934",
            "sentiment_compound": -0.6602
        },
        {
            "id": "hgfsmwz",
            "score": 1,
            "text": "Agreed. I’ve met people that respond to everything with positivity and I just wanted to jump off a bridge. I think there is a healthy balance.",
            "title_similarity": "0.44972962",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hgfstdh",
            "score": 2,
            "text": "This is something I constantly try to articulate but you did a much better job than me. Thank you!",
            "title_similarity": "0.5230098",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hgfwvhv",
            "score": 1,
            "text": "I’ve heard the term “fashionable cynicism” used to describe how this can rub off on others trying to fit into the conversation. Just ends up taking down the moral of everyone.",
            "title_similarity": "0.75448644",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgfxha8",
            "score": 1,
            "text": "I feel the exact same way. I’m 32 now, and I wish I could save the young kids from wasting their best years with this type of philosophy.",
            "title_similarity": "0.5982208",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hgfxqri",
            "score": 1,
            "text": "This goes for complaining, too. I definitely tend towards pessimism, but I’m working on that. Complaining may feel good, but it sucks to constantly have to hear people complaining. I didn’t realize how true that was until I made a conscious decision to avoid complaining. Some of my coworkers are constantly complaining and it’s exhausting listening to them all day. The complain about coworkers, spouses, politicians, covid, masks… pick a topic, they’ll find a negative and discuss it all day.",
            "title_similarity": "0.82752955",
            "sentiment_compound": -0.9528
        },
        {
            "id": "hgfym4d",
            "score": 1,
            "text": "I’ve got a couple coworkers like this. Everyone is allowed to have ALL of their feelings, but these two would literally just bitch and bitch in the shittiest, whiniest, Karen-tone all the live long day. Nothing positive EVER leaves their mouth. I fear for the person who finds their personalities attractive.",
            "title_similarity": "0.7498158",
            "sentiment_compound": -0.9722
        },
        {
            "id": "hgfyv7s",
            "score": 1,
            "text": "RemindMe! Every 6 months.",
            "title_similarity": "0.14236166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgfzqgz",
            "score": 1,
            "text": "Gotta separate real life interactions your online interactions. Online you can be whoever you want real life you gotta deal actual repercussions",
            "title_similarity": "0.5566839",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hgg1o9g",
            "score": 1,
            "text": "I used to be the person who didn't comment everything negatively. I remember people complimenting my attitude, telling me \"Your personality makes people love to talk to you\".\n\nBut I don't know man, something went awry somewhere. I have started criticizing a lot of stuffs. I have started noticing my best friends don't share with me stuffs they would have otherwise done.\n\nThank you OP! This LPT really did open my eyes in some way. I wish you all the success.",
            "title_similarity": "0.7626093",
            "sentiment_compound": 0.9728
        },
        {
            "id": "hgg3r0n",
            "score": 1,
            "text": "Thank you for posting this, this brought to my attention how negative ive grown to be after recent years and now its clear that i should take action about it.",
            "title_similarity": "0.68012655",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hgg484o",
            "score": 1,
            "text": "One wonders why pessimistic belief so readily available to the young; reality so new, furnished with possibility and pregnant with opportunity, even still the pessimist says solemnly, “all is vanity.”\n\n\nCould it be the *truth*? Indeed, could the pure-hearted, light-spirited optimist owe their lightness to the lack of this weighty *truth*? Could reality itself have ready-made the material for pessimism?\n\nHow shall we trudge through Hell itself? How shall we cope? The answer is to acknowledge the *truth* and respond rightly to it. \n\n\nDo not be negative for negativity’s sake, and do not be positive for positivity’s sake; for one does not stand in the light for the light but to see, and one does not lie in the dark for the dark but to sleep.\n\nAct justly, poised with the neutrality of conscious; yea, to arrive at the *truth* one must have been neutral to its result, and to abide by this *truth* is to remain neutral still.\n\n\nA neutral conscious is not one that is passive or passing-by, it is not an ephemeral presence; rather, it judges things according to their nature and thereby it ACTS, and not to the affections on the consciousness, where thereby it RESTS.\n\nThough, neither does it deny itself its own affections, for this too is vanity. Instead, it holds fast to them as the spirit of its being; the vital bud which bursts forth as the spring flower: the well-spring of endurance and creativity, passion. \n\n\nThe nature of life is that it is a somber, pitiless, worthless, and vain affair; and that no less we abide still, for tomorrow we will eat, drink, and be merry.\n\nEdit: I suffer from severe mental illness.",
            "title_similarity": "0.6071673",
            "sentiment_compound": -0.4848
        },
        {
            "id": "hgg9al0",
            "score": 1,
            "text": "Does this still apply in Australia?  I feel like I need a hostility translator most of the time, talking to Aussies.",
            "title_similarity": "0.5463041",
            "sentiment_compound": -0.25
        },
        {
            "id": "hggalqk",
            "score": 1,
            "text": "Thank you for sharing this am currently going through this depressive nihilistic phase where all I do is complain about everything.",
            "title_similarity": "0.6767447",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hggfn9w",
            "score": 1,
            "text": "I'm an incredibly positive person and all of y'all complaining kills my *vibes*",
            "title_similarity": "0.557281",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hggmb8p",
            "score": 1,
            "text": "You can say that. Depending on the relationship situation. Like a co-worker would be a bad idea lol.",
            "title_similarity": "0.5514229",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hggnk3x",
            "score": 1,
            "text": "\"Nobody is going to say anything to you anymore\"\n\nPerfect",
            "title_similarity": "0.2104785",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hggp4gh",
            "score": 1,
            "text": "My sister does this quite often and when we bring it to her attention she just gets pissed off. So fucking annoying",
            "title_similarity": "0.7806971",
            "sentiment_compound": -0.8162
        },
        {
            "id": "hgguux2",
            "score": 1,
            "text": "Im a very nihilistic person but In a good way ig. My philosophy is that life has no meaning so why no do what makes u happy",
            "title_similarity": "0.64213",
            "sentiment_compound": 0.597
        },
        {
            "id": "hggwitt",
            "score": 1,
            "text": "Being positive is not always easy, but having first of all good habits really helps. personally, since I started exercising more regularly, eating healthier and slowly fixing bad habits, my mind started to be more clear and see things differently. Of course you can't change everything instantly: one thing at a time is more than good. This mental clarity make you more curious about life in general which helps learning more things, and that in turn makes you a better person and people consequently might perceive you as more interesting, so it's a win-win. There are always bad days, of course, but generally trying to care about ourselves as much as possible makes us also interact better with people and I guess make the world a better place.",
            "title_similarity": "0.6375847",
            "sentiment_compound": 0.9899
        },
        {
            "id": "hgh0xmi",
            "score": 1,
            "text": "Nice try. I'm downvoting this.",
            "title_similarity": "0.3050321",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgh2uu6",
            "score": 1,
            "text": "My husband does this to every restaurant  experience we have.  We don’t eat out often, but he manages to make everyone feel crummy afterwards by enumerating  even the most minor flaws.",
            "title_similarity": "0.72429955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgh76yr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.17286375"
        },
        {
            "id": "hgjpk62",
            "score": 1,
            "text": "On the other hand, the solution isn't to be overly optimistic or unrealistic about everything. I understand people don't like negativity, but unfortunately a lot of things in life are not positive.\n\nIf something is true but doesn't come from a place of positivity, people tend to be turned off by it. The simple truth about a lot of things are negative and a lot of people choose to ignore those things and not listen to criticism and instead engage in fantasy about a lot of things in life. \n\nNot saying that this analysis isn't correct,  But there are also a lot of people who stick their head in the sand and won't listen to anything if it's negative and would rather pretend that the world is also sunshine and rainbows. Which, in turn prevents us as human beings from from fixing things and working problems out. Can't fix a problem if you can't acknowledge the problem in the 1st place, and I find that to be even worse than a person who is overly negative. \n\nThe truth is important.  If more people accepted truth rather than retreat into a comfort zone, we would be able to solve a lot more problems on the earth.",
            "title_similarity": "0.6920594",
            "sentiment_compound": 0.8429
        },
        {
            "id": "hhglfnr",
            "score": 1,
            "text": "Splendid Splitting Compliments Tares CoEquiationalism at its Finest",
            "title_similarity": "0.28563493",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hi2gyyf",
            "score": 2,
            "text": "My daughter behaves like this. I'm trying to correct this behavior but her IDC about anything attitude is starting to get to me. I hope it's a phase she is going through. Do you have any advice?",
            "title_similarity": "0.5165447",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hiim5vy",
            "score": 1,
            "text": "Implying there's something positive in life.",
            "title_similarity": "0.031981677",
            "sentiment_compound": 0.5574
        }
    ]
}