{
    "LPT: If your workplace is in the process of firing you, and they ask you to write a letter apologizing to the company, DO NOT. This is an admission of guilt and will torpedo your unemployment case.\nMy friend worked at Wal-Mart for 7 years and when he came up for promotion they fired him officially for \"using the bathroom too much.\" The company asked him to write a letter apologizing for it and it caused him to lose his unemployment and a judge ordered him to pay back all the unemployment he'd already gotten.\n\nDo not say or write ANYTHING that can be construed as an admission of guilt.": [
        {
            "id": "hiwziej",
            "score": 0,
            "text": "WFF is wrong with the USA. 'Letter apologizing ti the company' lol",
            "title_similarity": "0.6704279",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hiwtf4w",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.15071146"
        },
        {
            "id": "hiwg9ix",
            "score": 1,
            "text": "This is a manager, not a company decision. Either way, never admit guilt",
            "title_similarity": "0.3988487",
            "sentiment_compound": 0.0572
        },
        {
            "id": "hiwsz2q",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.15071146"
        },
        {
            "id": "hiwhs8i",
            "score": 0,
            "text": "Wow this is so smart",
            "title_similarity": "-0.18037826",
            "sentiment_compound": 0.8069
        },
        {
            "id": "hiwud5h",
            "score": -2,
            "text": "I have to say...America is fucked up.",
            "title_similarity": "0.31472158",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hiwg7fr",
            "score": 17,
            "text": "LPT: literally become homeless before working for Walmart",
            "title_similarity": "0.6979014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiwrg6v",
            "score": 2,
            "text": "How fucking stupid of a person could you be to write an apology letter? Say nothing leave seek legal advice if you feel a fight is coming for your unemployment case",
            "title_similarity": "0.7449597",
            "sentiment_compound": -0.8487
        },
        {
            "id": "hixqtna",
            "score": 1,
            "text": "If your workplace is in the process of firing you, and they ask you to write a letter apologizing to the company, AND YOU THINK ABOUT DOING IT....STOP\n\nRe-examine your life in great detail.\n\nYou are an idiot and need help making decisions.",
            "title_similarity": "0.82218313",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hix6huj",
            "score": 7,
            "text": "I don't want to be all \"that didn't happen\", but maybe there was something lost in translation from what actually transpired to how your friend told you the story?\n\nIt seems really farfetched for a judge to read a letter that says \"Sorry I used the toilet too much\" and side with Walmart. That's the kind of shit that ends up in the news when it happens! I'd love to see what's actually in a letter like that. Probably more about taking frequent long breaks without notifying/getting permission or something? Or \"toilet breaks\" that weren't actually toilet breaks?\n\nThat being said, I don't see ANY reason to write a letter like this. If they want to write you a reprimand and put it in your file, that's one thing. Or if they want you to sign and acknowledge that you were informed about it. But write your own reprimand? ugh.",
            "title_similarity": "0.77381575",
            "sentiment_compound": 0.8021
        },
        {
            "id": "hix0pgh",
            "score": 4,
            "text": "*What* I never ever heard of this  happening",
            "title_similarity": "0.2610141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix2xw6",
            "score": 4,
            "text": "Your friend is fucking stupid",
            "title_similarity": "0.43851355",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hixbhag",
            "score": 4,
            "text": "Better LPT: don't work for Walmart.",
            "title_similarity": "0.4716864",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hixq1ne",
            "score": 5,
            "text": "This is the most bizarre, oddly specific thing I’ve read on this sub.\n\nIn no way would this apply to anyone else because nobody would write an apology letter after they’ve just been sacked, let alone for that BS reason.\n\nOP, your friend is an idiot.",
            "title_similarity": "0.7221707",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hiwmkhg",
            "score": 8,
            "text": "What the actual fuck??? Who would actually agree to this condescending bullshit?",
            "title_similarity": "0.39415482",
            "sentiment_compound": -0.7757
        },
        {
            "id": "hiwugyl",
            "score": 7,
            "text": "Why would you do anything for someone who was firing you?",
            "title_similarity": "0.5913165",
            "sentiment_compound": -0.34
        },
        {
            "id": "hiwxt15",
            "score": 4,
            "text": "This just sounds fake and made up.",
            "title_similarity": "0.18936345",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiwqf42",
            "score": 36,
            "text": "I was being harassed by a female employee. I was an experienced, professional employee. She was a relative to HR. She got away with so much but creating a toxic work environment. Gossiping and getting people let go or written up. I endured so much work place bullying and nothing was done. When it came down to a boil the manager and HR tried to get me to sign a form that I assaulted her. My heavy steele toe work boot accidentally tapped the work table she was at. I immediately apologized before telling her I wasn't going to give her the satisfaction of being fired. They tried to paint me in a negative light and I quit on the spot. Called unemployment and filed a harassment case. I was awarded unemployment under the circumstances and get a settlement for the discrimination. As a man, I'm happy she wasn't able to use her gender as leverage. Don't let your bosses over work you, ignore your grievances or endure any type of disrespect or harassment. You are the arbiter of your own destiny.",
            "title_similarity": "0.8427075",
            "sentiment_compound": -0.9909
        },
        {
            "id": "hixrfsq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10692595"
        },
        {
            "id": "hiy6scr",
            "score": -1,
            "text": "Learned this the hard way when I got fired many years ago.\n\nThey had me in a back office and asked for what I did in a certain situation.  I explained exactly what happened, and then they asked me to write it all down.\n\nSo I did.  \n\nAfter I wrote it down, and they read it to verify everything, they informed me they were firing me.\n\nIt was only once I got a little older that I understood why exactly they had me do that.",
            "title_similarity": "0.8008509",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hiyg15i",
            "score": 1,
            "text": "Lazy losers that get fired for cause shouldnt get unemployment.",
            "title_similarity": "0.67328286",
            "sentiment_compound": -0.796
        },
        {
            "id": "hiyvbxz",
            "score": -1,
            "text": "America, eh?  \n\n\nYou don't have the rights most other people are born with?",
            "title_similarity": "0.3322032",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz02jt",
            "score": 1,
            "text": "I've never heard of a compa y asking for me to write a letter of apologies.\n\nThink I'd tell em to go fuck themselves",
            "title_similarity": "0.6565416",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hiwi0c2",
            "score": 56,
            "text": "Why in the holy fuck would anyone AGREE to writing their own apology letter after being fired? Regardless of anything else, that's just dumb.",
            "title_similarity": "0.69668084",
            "sentiment_compound": -0.7886
        },
        {
            "id": "hiwlyi2",
            "score": 39,
            "text": "Wal-Mart is run by the biggest fucking assholes in the world. I know it's a tough competition with penis Mars rocket guy, self crashing car guy and the make America racist again buy.",
            "title_similarity": "0.6632163",
            "sentiment_compound": -0.8622
        },
        {
            "id": "hix06ec",
            "score": 7,
            "text": "I do not believe this story.",
            "title_similarity": "0.17923036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy3rq9",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.10692595"
        },
        {
            "id": "hix32kt",
            "score": 2,
            "text": "I don’t believe anything in this post in the slightest",
            "title_similarity": "0.21976396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixkfzf",
            "score": 2,
            "text": "Sometimes i’m really happy i don’t live in the us",
            "title_similarity": "0.40054494",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hiwg5j7",
            "score": 53,
            "text": "Wait, in America you can be ineligible for unemployment welfare? Wtf! What do you do at that point??",
            "title_similarity": "0.50972867",
            "sentiment_compound": -0.8192
        },
        {
            "id": "hixm42g",
            "score": 17,
            "text": "You can get fired for using the bathroom to much??\n\nAnd you say you're free!!\n\nYou guys really don't know what freedom is do you",
            "title_similarity": "0.6771854",
            "sentiment_compound": -0.682
        },
        {
            "id": "hiwfjz5",
            "score": 61,
            "text": "Never sign anything.",
            "title_similarity": "0.20726943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiwimq7",
            "score": 5,
            "text": "They were going to promote him and they fired him instead?  Or he was due for promotion and they just invented cause to fire him?",
            "title_similarity": "0.6446303",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hiwnjxo",
            "score": 5,
            "text": "I've never had this happen and I've worked in places that operated like sweatshops.   \n\n\nIf they wanted to eff with your unemployment...they just say they fired you for misconduct. They never have to provide proof of this.",
            "title_similarity": "0.76511717",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hiwx3kz",
            "score": 5,
            "text": "I got fired by a Warren Buffet owned company, long story but ended up getting my unemployment for a few months until I got another job - fuckers and pos",
            "title_similarity": "0.7720634",
            "sentiment_compound": -0.91
        },
        {
            "id": "hiwnzns",
            "score": 8,
            "text": "I’ve never seen this before. Sounds sketchy",
            "title_similarity": "0.19494203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiwpb55",
            "score": 8,
            "text": "Who would write a letter of apology when they are are being fired? Is this real?",
            "title_similarity": "0.66064996",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hiwnb94",
            "score": 10,
            "text": "Also, when you get in a car accident..",
            "title_similarity": "0.33549583",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiwp5nk",
            "score": 10,
            "text": "Letter of apology??? I'm in my mid-30's and I've never heard of this.\n\nIf I was asked to apologize and knew that I was being constructively dismissed, I'd write a constructive \"apology\" explaining how they could go fuck themselves.",
            "title_similarity": "0.7321067",
            "sentiment_compound": -0.5007
        },
        {
            "id": "hiwjs7l",
            "score": 403,
            "text": "Is this an US-thing? I never heard of something like this in the EU. Why would i write an Apologyletter to my company?",
            "title_similarity": "0.6154007",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hiws0xl",
            "score": 23,
            "text": "True. This happens in most cases and you should never write an apology anywhere. I still remember that in my college, a guy raised a case of corruption against a woman, she said that she was mentally harassed because of the case and then the management asked to guy to write a simple apology stating misunderstanding. He did that and then removed him from the college claiming that since he apologized, he is guilty !",
            "title_similarity": "0.8681073",
            "sentiment_compound": -0.6416
        },
        {
            "id": "hiwvsc1",
            "score": 56,
            "text": "My company has \"write-ups\" for when you mess up and either require you to sign or they will have someone else sign as a witness. They claim that it's just to prove that you were made aware of the problem and given guidance on what needs to change and that it is not an admittion of guilt, but I've always wondered if they could try to use it against you in court.",
            "title_similarity": "0.64794374",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hiwy0te",
            "score": 146,
            "text": "I'm honestly not surprised this works.  That said, I am surprised that this doesn't constitute coercion in the eyes of a court.  \n\ncoerce\n\n1: to make (someone) do something by using force or threats\n\n2: to get (something) by using force or threats\n\nThe \"threat\" here is \"write this letter or you will be fired\".  In law enforcement, if you did this to get a confession it'd be tossed in a heartbeat, along with your career.  \n\nYou're literally putting the employee into a stress response, known to inhibit higher level thought, asking them to provide you evidence to deny them unemployment, then firing them for taking what you presented as a way out of the crisis.  The psychology of this is precisely why coercion cannot legally be used in criminal cases.  It causes a stress response, and inhibits executive function significantly.  Which results in bad decisions, false statements, and other \"odd\" or \"atypical\" behaviors.",
            "title_similarity": "0.7234853",
            "sentiment_compound": -0.9897
        },
        {
            "id": "hiwi88c",
            "score": 169,
            "text": "Who the hell would actually write that letter AFTER they were terminated. Like, you're severing your relationship with me for whatever reason, I'm very likely never communicating with you again...certainly never apologizing for anything.",
            "title_similarity": "0.6373496",
            "sentiment_compound": -0.4363
        },
        {
            "id": "hix3ae8",
            "score": 29,
            "text": "Had this happen to me once, I got called into a meeting one day at an old job which looked more like an interrogation room than anything. \nI worked there for 4 years and in my last year there they changed the CEO who for some reason didn’t like me at all, and was waiting for any opportunity to fire me. \n\nI believe mine was, ‘you steal candy from peoples desks when they have it’. Stealing is fireable offence. But we will consider keeping you if you write an apology letter ok? \nThere and then in that room I told them: yeahhh… no I won’t be doing that. \nI got fired on the spot anyway. A week later I found out they were going bankrupt and were firing ppl they didn’t want to pay out. \n\n(Also the candy thing was literally from a colleague who always had a bowl on her desk and always offered people to take some when they walked past including employees, \nCome to think of it now, that might have been a trap)",
            "title_similarity": "0.86426914",
            "sentiment_compound": -0.967
        },
        {
            "id": "hixq9qc",
            "score": 98,
            "text": "I was an unemployment judge for a while. It doesn't torpedo your case, or at least not with most judges I know, but this is at the hearing level some months later, not the initial claim level. One of the things we looked at was the frequency of write-ups relative to the length of employment right before termination. If there is a sudden rush for relatively petty things, the employer is clearly stacking. Same goes for the absurdity of the documentation. A letter as described was generated not for the purpose of recording progressive discipline, but to get them to admit fault under threat of job loss. I would not use that against the employee and I was by no means overly pro-employee.",
            "title_similarity": "0.7391591",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hix5k07",
            "score": 50,
            "text": "Also never admit to anything unless they actually have proof. I had a manager claim they had me on camera doing something bad, I knew I didn't do anything and asked to see the tape.\n\nThey then had 3 managers there asking me again what happened that day and were going to play the tape at the end but if I wanted to add anything before we did that would help my cause. I literally said \"play the tape\" and she had the nerve to burst out laughing and said \"There is no tape, but we are going to suspend you for 3 days so you need to sign here\"(Again trying to get me to sign away guilt). I got up left the office and went immediately into our HR's office to file a grievance. Guess who ended up getting 3 days WITH PAY :)",
            "title_similarity": "0.77953315",
            "sentiment_compound": -0.0375
        },
        {
            "id": "hiwqocz",
            "score": 124,
            "text": "Be careful as to what paperwork that you’re told to sign. Read everything carefully and be sure you understand ALL of what’s being stated. You DO NOT have to sign anything you don’t agree with. If promised anything;get it in writing ,signed and dated by management. Company handbooks should be saved for reference purposes in case of litigation proceeding.",
            "title_similarity": "0.47098112",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hiwd88v",
            "score": 502,
            "text": "definitely avoid admitting anything further at that point.  IF they could have nailed you for anything else they would have already, and if you give them anything, they will nail you for that too.\n\n&#x200B;\n\nImagine your HR person giving you praise telling you how your hard work is being noticed.  Discuss moving you to a new position starting on monday and the very next week they are having a disciplinary meeting with you over your \"bad attitude\".\n\npeople are shady af",
            "title_similarity": "0.85152197",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hiwbulh",
            "score": 8996,
            "text": "Imagine writing a letter apologizing for using the bathroom. FOR WALMART. lmao.",
            "title_similarity": "0.6400027",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hiwhxo6",
            "score": 6324,
            "text": "I'm sorry, apologize to *who* for *what?* If I'm in the process of being fired and I'm asked to apologize to the company...I do believe that's tantamount to asking me to shit on the hood of your car on the way out.",
            "title_similarity": "0.7471669",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hiwtrl9",
            "score": 3869,
            "text": "[removed]",
            "title_similarity": "0.10692595"
        },
        {
            "id": "hiwnolb",
            "score": 373,
            "text": "I remember working for Sams Club and hearing a few people having to do this. Was the weirdest thing I’ve ever heard of and haven’t heard of anyone else doing it since. These places prey on the young or ignorant",
            "title_similarity": "0.61224276",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hiwptbu",
            "score": 1,
            "text": "My old coworker essentially stole money billing too many overtime hours and he apologized and they kept him hired at a chemical company. He was there 20 years though",
            "title_similarity": "0.83752245",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hiwq92e",
            "score": 12,
            "text": "I shit more than I worked when I was a walmart cart pusher in my teens.",
            "title_similarity": "0.57704157",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hiwstl8",
            "score": 1,
            "text": "Yep and ask for a written statement and why they're firing you. Might come in handy if you get a attorney.",
            "title_similarity": "0.5692569",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hiwt74a",
            "score": 2,
            "text": "At my old grocery job any time we had an occurrence they’d have us sign a sheet for it. They not giving any type of unemployment 😂😂",
            "title_similarity": "0.6761062",
            "sentiment_compound": 0.2177
        },
        {
            "id": "hiwulvt",
            "score": 1,
            "text": "I did not know I can still get unemployment but in my case, I quit on the spot when they told me to write 'my side of the story'.",
            "title_similarity": "0.73020786",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hiwuvdc",
            "score": 26,
            "text": "This is one more reason why Walmart is among the worst companies in the world. Thank the Walton family.",
            "title_similarity": "0.6960433",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hiwvv6s",
            "score": 1,
            "text": "Leave an upper decker on the way out...",
            "title_similarity": "0.18745172",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hiwvz34",
            "score": 4,
            "text": "Dear Walmart, You have already informed me that I am being terminated for using the bathroom too much.  I am sorry this job doesn't pay shit and apparently doesn't pay me to shit.  go Fuck yourselves.  Respectfully, Footjam.  amidoinitrite?",
            "title_similarity": "0.84495145",
            "sentiment_compound": 0.1068
        },
        {
            "id": "hiwwe8v",
            "score": 1,
            "text": "The only thing you should put in writing for a company firing you is a notarized photocopy of your middle finger.",
            "title_similarity": "0.6482162",
            "sentiment_compound": -0.34
        },
        {
            "id": "hiwwnih",
            "score": 4,
            "text": "Instead ask your doctor for a letter stating the bathroom usage was necessary. Worth at least asking. Likely there's nothing the employer could do at that point.\n\nAlso, being fired without warning seems sketch too.",
            "title_similarity": "0.74530435",
            "sentiment_compound": -0.169
        },
        {
            "id": "hiwwsf4",
            "score": 9,
            "text": "Seal the envelope and have the letter say \"Deez nuts\"",
            "title_similarity": "0.39026803",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hiwxbmg",
            "score": 2,
            "text": "What is this kindergarten? I've never heard of an employer asking for an apology letter, but I can't say I'm surprised to hear about this.",
            "title_similarity": "0.5238662",
            "sentiment_compound": -0.2261
        },
        {
            "id": "hiwxcu3",
            "score": 2,
            "text": "Even if you're disgustingly in the wrong you probably shouldn't write anything like that. Even if you're 200% guilty, don't just admit it like that.",
            "title_similarity": "0.61172605",
            "sentiment_compound": -0.8751
        },
        {
            "id": "hiwy355",
            "score": 11,
            "text": "Three words to remember: deny, deny, and deny.",
            "title_similarity": "0.19456223",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hiwyqrq",
            "score": 3,
            "text": "Also if you are quitting don’t give anything in writing. Some places will tell you it’s so you can get rehired but it’s really to help them deny your unemployment case.",
            "title_similarity": "0.7051383",
            "sentiment_compound": -0.4556
        },
        {
            "id": "hiwz152",
            "score": 1,
            "text": "What kinda employers have people experienced man. Apologies to the company?! Wtf. Is this an American thing?",
            "title_similarity": "0.6334753",
            "sentiment_compound": -0.6654
        },
        {
            "id": "hiwz6da",
            "score": 1,
            "text": "Walmart is such a shitty place to work. Can't believe I gave 2 1/2 years to that hellhole.",
            "title_similarity": "0.7775684",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hiwzkfx",
            "score": 1,
            "text": "Amazon does this. Fuck their TOT.",
            "title_similarity": "0.38164774",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hix0oi8",
            "score": 1,
            "text": "These kind of tactics reeks of the exact way the \"elite\" is taught life. You are always above someone and that someone shall kiss you shoe, and the ones above, you must envy their position.",
            "title_similarity": "0.47835252",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hix0vnt",
            "score": 2,
            "text": "When I worked in corporate management, it was part of our job to attend unemployment hearings to dispute them and save money. Corporate HR had all the documentation to show performance issues when anyone was fired. The write up process is used to show a pattern of behavior, and the more an employee resisted the documentation, the more strict it got. Ideally, the employee would quit after being singled out so we didn’t have to go through the dispute process. Otherwise, they already signed at least a verbal (only by name, since actually written) and a written warning admitting guilt to their behavior before they were placed on a final written warning and then fired.\n\nNo apology letter necessary",
            "title_similarity": "0.8141499",
            "sentiment_compound": -0.9387
        },
        {
            "id": "hix14uc",
            "score": 3,
            "text": "Twenty years ago in Sa Clemente Cali, my uncle got railroaded by Walmart. They had his under managers close the doors and conduct \"unpaid time\" if work wasn't done. When he became the GM and uncovered this unwritten rule... he ran it up corporate as a major labor issue they needed to get in front of immediately. They then hung it on him and destroyed his name.",
            "title_similarity": "0.8583433",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hix14y0",
            "score": 1,
            "text": "That is fucking crazy. I'm sorry, but who in their right mind would write an apology to a company firing them? Jesus fucking Christ guys, what?!",
            "title_similarity": "0.7411891",
            "sentiment_compound": -0.6788
        },
        {
            "id": "hix1drz",
            "score": 1,
            "text": "\"Im sorry for doing a no.2 at work... a tragic mistake on my part\"",
            "title_similarity": "0.6659976",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hix1f47",
            "score": 1,
            "text": "Are apology letters a thing? If I was in the process of getting expelled from school, would they expect me to stick around for detention too?",
            "title_similarity": "0.61984026",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hix2ng3",
            "score": 1,
            "text": "What if it’s one of those apologies like “I’m sorry that you didn’t like the way I was scanning the vegetables”",
            "title_similarity": "0.53805095",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hix2rtj",
            "score": 1,
            "text": "What're they gonna do if I don't? Fire me?",
            "title_similarity": "0.53620625",
            "sentiment_compound": 0.3391
        },
        {
            "id": "hix2vpp",
            "score": 1,
            "text": "Why would anyone ever do this to begin with? I'm not fucking apologizing are you kidding.",
            "title_similarity": "0.4109826",
            "sentiment_compound": 0.2117
        },
        {
            "id": "hix311b",
            "score": 1,
            "text": "People do shit like this?\n\nNaw fam, you fire me im just leaving. You can come collect your badge, key, gun, laptop, car, phone, and give me that last paycheck while you are at it.",
            "title_similarity": "0.6654882",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hix37k2",
            "score": 1,
            "text": "LPT - Stand up for yourself.",
            "title_similarity": "0.11213049",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix3aza",
            "score": 1,
            "text": "Why does this need saying?",
            "title_similarity": "-0.018132342",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix3kjs",
            "score": 1,
            "text": "What is this dystopian world we're living in?!?!",
            "title_similarity": "0.3121729",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix3rsb",
            "score": 1,
            "text": "Dear company. I'm sorry for not realising sooner you care only about extorting up to the last penny you can squeeze, at the cost of your employees.",
            "title_similarity": "0.73481524",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hix3ydm",
            "score": 1,
            "text": "My friend was almost caught in this sort thing beginning of pandemic. They all had year long contracts (good career jobs), and because Covid put their surgeries on pause, they wanted all the employees to sign this letter of understanding about Covid changing their business, and then some signe sit and turned it in, but then my friend had a lawyer look at it and said “this totally void your existing contract. You’re current contract gives 90 days full-pay severance; if you sign this it voids that, and also let’s them fire your without pay”. They were also told if they didn’t sign it they would be let go. So some did, some didn’t. Those who didn’t sign were let go with severance the following week.  \nOf those that DID sign, about half were let go within a  month for a myriad of reasons. The lawyer said it was a terribly stupid thing for the company because they had a dozen Covid relief options they could have done instead that would protect them, whereas this letter and ultimatum opened them up to lots of legal issues.  \n  \nAnyway, point is just agreeing with OP- don’t sign anything new from your work unless you fully understand it, and if not have a relevant professional look it over before signing, EVEN and especially if the company says they’ll fire you for not signing it.",
            "title_similarity": "0.8637553",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hix3yor",
            "score": 1,
            "text": "What could anyone stand to gain from writing such a letter? I'd have told them to fuck right off.",
            "title_similarity": "0.54425466",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hix40f6",
            "score": 1,
            "text": "I will sign nothing if fired. One employer threatened to hold my pay for not signing. Called my lawyer, had him call my boss, had my check in minutes, hand written without deductions. This was at Kmart in the 80s. I was in highschool, my lawyer was my uncle, a real lawyer.\n\n\n\n\n\nI've been a real pain in the ass for a lot of unscrupulous employers ever since.",
            "title_similarity": "0.84437513",
            "sentiment_compound": -0.6219
        },
        {
            "id": "hix4kls",
            "score": 1,
            "text": "Jesus you yanks suck up some shit. Im sorry but apologising to a job in a letter!?!? What the fuck is wrong with you all!?!?",
            "title_similarity": "0.6770217",
            "sentiment_compound": -0.9444
        },
        {
            "id": "hix4ssa",
            "score": 1,
            "text": "Also remember that they're firing you, your relationship is over. Do not help them with anything that isn't ordered by a court.",
            "title_similarity": "0.6980932",
            "sentiment_compound": -0.5659
        },
        {
            "id": "hix4vbm",
            "score": 1,
            "text": "TIL that apology letters are a thing.",
            "title_similarity": "0.17775315",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hix4z2z",
            "score": 1,
            "text": "About a decade ago I was being fired from a call center job(my kids’ daycare called and I went over on my break by 4 mins, only my second time being late from break, the first was when I won a Blu-ray player and I took it to my car on break and it took so long to get to my car and back I was a couple mins late.) My boss’s boss got word of the firing and had me stay to speak with him. He told me to write a resignation letter and I could be auto-rehired after 60 days. I did need to take a family/medical leave of absence so I agreed thinking this was a perfect opportunity to take care of personal matters. After the 60 days I reapplied and was immediately denied. That place was a mess anyway.",
            "title_similarity": "0.77588785",
            "sentiment_compound": 0.4728
        },
        {
            "id": "hix5b07",
            "score": 1,
            "text": "This is fucking dystopian",
            "title_similarity": "0.25918853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix5iw8",
            "score": 1,
            "text": "Never heard about stuff like this, is this an American thing to fuck with low wage Americans ?",
            "title_similarity": "0.58479285",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hix5qe6",
            "score": 1,
            "text": "Amerrrrriiiiiiicaaaaaa!\n\nFuck yeah!",
            "title_similarity": "0.192841",
            "sentiment_compound": -0.4374
        },
        {
            "id": "hix5qih",
            "score": 1,
            "text": "Does this type of nonsense, 1, really happen?? And, 2, ever work??",
            "title_similarity": "0.32183993",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hix5u97",
            "score": 1,
            "text": "Excuse my ignorance but just curious: does the company have to pay for unemployment?  I always thought it was a government benefit.  Otherwise, why do they care?",
            "title_similarity": "0.62515664",
            "sentiment_compound": 0.7622
        },
        {
            "id": "hix5yqc",
            "score": 1,
            "text": "Wait… this is a thing? Wtf???",
            "title_similarity": "0.012329102",
            "sentiment_compound": -0.6966
        },
        {
            "id": "hix61p7",
            "score": 1,
            "text": "Job is a job. If they ask you to anything outside of what you’re hired for, ain’t you’re goddamn fucking responsibility. ESPECIALLY when it comes to being fired",
            "title_similarity": "0.6158322",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hix639c",
            "score": 1,
            "text": "A letter apologising to the company? I didn't even realise this is a thing some do.",
            "title_similarity": "0.659022",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hix65eh",
            "score": 1,
            "text": "I work a bullshit office job that I hate. Anytime my boss pisses me off I just \"jokingly\" say you'll have to fire me before I leave cause I'm collecting that unemployment! She always gives me some bullshit about how that's not very becoming. I don't give a fuck. I'm here to do my dumbass job for 8 hours go home and do things I actually care about. You don't like it...fire me.",
            "title_similarity": "0.8844446",
            "sentiment_compound": -0.9593
        },
        {
            "id": "hix6am9",
            "score": 1,
            "text": "If your employer ever asks you to do anything not on the list of your responsibilities in the job listing, don't. Ever. For any reason.",
            "title_similarity": "0.540849",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix6fq6",
            "score": 1,
            "text": "And it doesn’t matter if HR recommends that you do it. Because HR doesn’t work to protect *you* — they work to protect the company. Always.",
            "title_similarity": "0.5560427",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hix6ryo",
            "score": 1,
            "text": "\"That's not part of my job description. If you'd like to pay me a one-off fee for a specific service, we can talk numbers, but it won't be a trivial fee as I have other pressing prioroties at the moment.\"",
            "title_similarity": "0.42479682",
            "sentiment_compound": 0.1682
        },
        {
            "id": "hix6tfm",
            "score": 28,
            "text": "I just realized this, me and some of my family have worked at Walmart at one time or another. One policy they have is when you accumulate to many write ups, you have a \"D-day(decision day)\" where you get a paid day off but are expected to write an essay of sorts for why you got the write ups and what you would do in the future to avoid any more. I never thought they could use that to screw you over if they fired you.",
            "title_similarity": "0.79282546",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hix6w7h",
            "score": 1,
            "text": "How'd he go from being up for promotion to fired? Sounds like a bs story to me.",
            "title_similarity": "0.61237824",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hix7gpv",
            "score": 3,
            "text": "<writes> “I was told to write a letter stating that I apologize for using the restroom during work at wal-mart. Perhaps I am confused as to state and federal law regarding use of a bathroom at work. Perhaps I am not understanding how use of a bathroom is an offense worth firing an employee over. Either way, I have surely put words on a piece of paper though I cannot say I agree with them.”\n\nUnsigned.",
            "title_similarity": "0.8075925",
            "sentiment_compound": -0.3839
        },
        {
            "id": "hix7jut",
            "score": 1,
            "text": "What the fuck. What. The. Fuck.",
            "title_similarity": "0.1230261",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hix7rv3",
            "score": 1,
            "text": "Wow, do companies really do this? If you're getting fired anyway, writing a letter to apologize won't do shit. What are they gonna do if you say no, fire you? lol",
            "title_similarity": "0.7767103",
            "sentiment_compound": 0.6467
        },
        {
            "id": "hix7zrx",
            "score": 1,
            "text": "Same thing applies if they try and make you do an exit interview.",
            "title_similarity": "0.40171278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix85ko",
            "score": 1,
            "text": "I had a boss, who literally banged on the port-a-potty on a construction jobsite and yelled at me \"YOU SHIT AT HOME\" in front of the whole crew.",
            "title_similarity": "0.7303091",
            "sentiment_compound": -0.6523
        },
        {
            "id": "hix8dws",
            "score": 1,
            "text": "The fuckery is real. Bartender says he was forced to repay thousands after being robbed at gunpoint\n\n\nhttps://www.reviewjournal.com/crime/robberies/bartender-says-he-was-forced-to-repay-thousands-after-being-robbed-at-gunpoint-2446567/",
            "title_similarity": "0.7201705",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hix8isy",
            "score": 1,
            "text": "Why would you ever do this in the first place?  If I'm gonna be canned, they can just can me.  There's no point in me writing a letter of apology for whatever fuck up they're canning me for.",
            "title_similarity": "0.650933",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hix8kwl",
            "score": 1,
            "text": "Can you fire someone for \"using the bathroom too much\"? WALMART? I don't know about the laws there but that't pretty much not a justifable reason to fire someone, the letter thing was to cover their backs for unjustified firing.",
            "title_similarity": "0.76567173",
            "sentiment_compound": -0.504
        },
        {
            "id": "hix9150",
            "score": 1,
            "text": "They ask you to write an apology letter? While firing you? Does this work on people?",
            "title_similarity": "0.66288257",
            "sentiment_compound": -0.4098
        },
        {
            "id": "hix917i",
            "score": 1,
            "text": "What kind of pussy would write a letter to the company who fired them?",
            "title_similarity": "0.77296084",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hix95e2",
            "score": 1,
            "text": "Huh? When is this LifeProTip actually relevant? Anybody dumb enough to apologize to their former-employer (on record), probably deserves to get fired.",
            "title_similarity": "0.7686017",
            "sentiment_compound": -0.782
        },
        {
            "id": "hix96bo",
            "score": 1,
            "text": "Never admit guilt. To no one. Unless it’s your wife, and she catches you in the process of said guilty activity.  Otherwise, shut up!",
            "title_similarity": "0.65257907",
            "sentiment_compound": -0.6212
        },
        {
            "id": "hix99k2",
            "score": 1,
            "text": "LPT: Don't do or say anything to or for anyone at your job if it's not directly related to your responsibilities at said job.",
            "title_similarity": "0.44479674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix9a6h",
            "score": 1,
            "text": "I think your friend has valid reasons to throw bricks with bags of flaming shit tied to them through the window of the store and how old bosses car.",
            "title_similarity": "0.5620569",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hix9jox",
            "score": 1,
            "text": "Why are you not allowed to use the bathroom as mu h as needed in the US?",
            "title_similarity": "0.5435927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hix9m84",
            "score": 1,
            "text": "/r/thathappened \n\nIt’s very illegal to fire someone for using the restroom especially making that public information.",
            "title_similarity": "0.553596",
            "sentiment_compound": -0.762
        },
        {
            "id": "hix9mh4",
            "score": 1,
            "text": "This is the most American thing I’ve ever heard. Who the fuck is writing an apology letter to a company that just fired them?",
            "title_similarity": "0.75621384",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hix9twd",
            "score": 1,
            "text": "But unemployment is paid by the state, and the is no \"case\" to be argued for it other than being unemployed and looking for work.",
            "title_similarity": "0.5661571",
            "sentiment_compound": -0.872
        },
        {
            "id": "hix9twp",
            "score": 1,
            "text": "Do not sign anything. Your job has very few things the can actually make you sign. Like at Dicks sporting goods they make you sign off on your absences and latenesses because when they fire you they’ll tell them you admitted to being a shitty worker.",
            "title_similarity": "0.81481755",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hixa332",
            "score": 1,
            "text": "A letter of apology? This is a thing?",
            "title_similarity": "0.20782438",
            "sentiment_compound": 0.1431
        },
        {
            "id": "hixa37n",
            "score": 1,
            "text": "lmao imagine doing this for any job ever. Who tf does that lmao, absolutely no one",
            "title_similarity": "0.3959083",
            "sentiment_compound": 0.7436
        },
        {
            "id": "hixa3jk",
            "score": 1,
            "text": "What i don't understand is how apologizing is seen as an admission of guilt in the US",
            "title_similarity": "0.4844845",
            "sentiment_compound": -0.34
        },
        {
            "id": "hixa6p6",
            "score": 1,
            "text": "This makes me feel bad. I wrote a letter apologizing for misusing a program at a POS system before getting fired from my first job. Technically, one of the leads told me and possibly a few others to do what we did, because I wasn't the only one to get fired. I even wrote a solid monetary amount down.... I never went on unemployment, but it was really strange for me. I absolutely hated it there, leads would try to \"motivate\" you by threatening to fire you, and the store manager felt like this really superior guy who was proud of making people break down into tears in his office. He was an A-hole when he let me go, and another lead was in there just silent while this guy sort of \"berated\" me. I felt bad for a while, but I came to some realizations and I've promised myself never to take shit like that from anybody ever again.",
            "title_similarity": "0.8943386",
            "sentiment_compound": -0.3183
        },
        {
            "id": "hixa7qy",
            "score": 1,
            "text": "In BC, there is legislation clarifying that an apology is not an admission of guilt.\n\nIf your employer tries to pull that shit on you here, lawyer up.",
            "title_similarity": "0.54963624",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hixaanq",
            "score": 1,
            "text": "They might, instead of an apology, ask you to write a thing about how you'll improve. This is a \"PIP\" or a performance improvement plan. Do not do this, either. Let them write it.",
            "title_similarity": "0.43323454",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hixabpi",
            "score": 1,
            "text": "What are you supposed to do instead? Just literally not write anything whatsoever?",
            "title_similarity": "0.2778596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixb1p2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15071146"
        },
        {
            "id": "hixbhuo",
            "score": 1,
            "text": "The real LPT for someone like me was that some companies will ask you to write an apology letter lol. Just knowing this, I can already start formulating how I would respond in that situation, and I promise none of the responses involve writing an apology letter haha.",
            "title_similarity": "0.6607485",
            "sentiment_compound": 0.875
        },
        {
            "id": "hixbl2y",
            "score": 1,
            "text": "Bro, if someone asks you to write a letter you should ask them what year they think it is...",
            "title_similarity": "0.34380212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixbz6p",
            "score": 1,
            "text": "How often was he using the restroom?",
            "title_similarity": "0.3201591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixbze3",
            "score": 1,
            "text": "I had a previous employer give me three prewritten letters with the reason I was quiting (I was not quitting) they asked me to sign which one best specified why I was leaving. Did not sign. \n\n\nIt was pretty low key and I'm sure it works most of the time. I was pretty certain they use it to fight unemployment cases.",
            "title_similarity": "0.6978692",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hixc1vu",
            "score": 1,
            "text": "I can’t for the life of me understand how it’s legal for them to fire you for using the bathroom",
            "title_similarity": "0.67164946",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hixc9u7",
            "score": 1,
            "text": "Most written apologies can be used as admission of guilt in a legal fight. This is probably why you see so many people failing to apologize for their past deeds. It’s sad.",
            "title_similarity": "0.6715347",
            "sentiment_compound": -0.8578
        },
        {
            "id": "hixca10",
            "score": 1,
            "text": "You usually have to do something pretty outrageous to get denied unemployment in an unemployment hearing.\n\nUnemployment hearings side with the terminated employee the vast majority of the time. That's if the company even bothers to fight it.",
            "title_similarity": "0.8127004",
            "sentiment_compound": -0.93
        },
        {
            "id": "hixceoy",
            "score": 1,
            "text": "You should appeal if you are denied UI for this reason. Your boss simply asked you to write a letter, so you did. If you don’t have an *actual contract* with your job responsibilities you are simply required to do what is asked of you, so you did.",
            "title_similarity": "0.6840079",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hixcgsi",
            "score": 1,
            "text": "never write an apology to a business, your company or otherwise, in writing unless ordered to do so by a judge in a court order",
            "title_similarity": "0.6163777",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hixctek",
            "score": 1,
            "text": "Why did he write the letter? Wtf compelled him? Since he was fired, they didn't have any power over him.",
            "title_similarity": "0.7316675",
            "sentiment_compound": -0.8205
        },
        {
            "id": "hixczkc",
            "score": 1,
            "text": "Wow, Murica, where personal freedom goes to die and people live in slavery of their employers.",
            "title_similarity": "0.5656874",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hixd27n",
            "score": 1,
            "text": "What the fuck is with this subs hard on for getting fired. Where do you people work where your constantly being manipulated and sabotaged?!",
            "title_similarity": "0.7187834",
            "sentiment_compound": -0.8858
        },
        {
            "id": "hixd2e3",
            "score": 3,
            "text": "Imagine how scummy you have to be to ask this of an employee you are firing.",
            "title_similarity": "0.6833079",
            "sentiment_compound": -0.34
        },
        {
            "id": "hixd8zw",
            "score": 1,
            "text": "Damn company did that on purpose.",
            "title_similarity": "0.32250786",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hixddwn",
            "score": 1,
            "text": "The thread screams ‘tell me you’re from America, without telling me you’re from America’  🙈",
            "title_similarity": "0.3085776",
            "sentiment_compound": -0.296
        },
        {
            "id": "hixdn0c",
            "score": 1,
            "text": "Actually, if ANYONE, ANYWHERE, AT ANY TIME asks you to write such a letter, never do it.  Call a lawyer, if you don't understand why.\n\n*Especially* if it's at a police station.  This will help educate you about what an 'apology' is for.\n\nhttps://www.youtube.com/watch?v=d-7o9xYp7eE&t=2679s\n\n(A great video to watch from the beginning.  Very entertaining and educational.)",
            "title_similarity": "0.59289443",
            "sentiment_compound": 0.8805
        },
        {
            "id": "hixdqc3",
            "score": 1,
            "text": "A company I worked for tried this with me. I criticized the new name for a product, in a professional way, and told them how the name could be misused one in the public. The VP who approved the name took major offense and I had to have a review to discuss my attitude. I told them it wasn't meant to offend, just to warn them that the name wasn't right. In the meeting I said I was sorry the VP got upset. The next week I was sent a pre written offense sheet with a baked in apology and told to sign it for my record. The letter they wrote had a lot in it that didn't actually happen. I corrected the letter and removed the apology and told them if we could agree on the language of the letter I would sign it. They said I HAD to sign it as it was written by them. I said no, I disagree with the events as they wrote them. I can't sign something I don't agree with. Signing is a contract. They hounded me for 2 weeks to sign it and I refused. A friend in H.R. told me she saw my dismissal paper work on her bosses computer and the file was created the day I got the letter the fist time. They were just waiting for me to sign the admission so they could fire me with cause. I ended up getting let go but I fought it and got a severance package and unemployment.",
            "title_similarity": "0.8573011",
            "sentiment_compound": -0.867
        },
        {
            "id": "hixdy0v",
            "score": 1,
            "text": "I'm really surprised that adisgruntled employee has not Timothy McVeighed or kill dozer one of these shit companies",
            "title_similarity": "0.69646496",
            "sentiment_compound": -0.7968
        },
        {
            "id": "hixdym2",
            "score": 1,
            "text": "This tracks. I worked at Wal Mart in the early 2000’s and was verbally warned about my bathroom breaks. Which feels really weird tbh. I was a teenaged girl, I felt weird enough if I had a period already and if ppl could tell. It’s so wildly personal a thing to be on about. Fuck Wal Mart.",
            "title_similarity": "0.736763",
            "sentiment_compound": -0.807
        },
        {
            "id": "hixe1m3",
            "score": 1,
            "text": "Why would anyone ever write an apology letter if they already know they are being fired?",
            "title_similarity": "0.7306963",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hixe61d",
            "score": 1,
            "text": "This happened years ago at a security company I worked for. I never understood until now. I seriously thought if I wrote it I could keep my job. Thank you for the info!",
            "title_similarity": "0.5700894",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hixeet9",
            "score": 1,
            "text": "I'm sorry but this sounds like one of the dumbest things I've ever seen why the hell would you write an apology, if they wanna fire you then let them fire you... can someone please explain to me the logic in writing a apology?",
            "title_similarity": "0.7181686",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hixemx2",
            "score": 1,
            "text": "Companies do all sorts of things, and say all sorts of things to get out of any obligation mandated by law. I was getting fired by this Tech support company, and they wanted me to write a letter of apology, and to formally quit. I had been told by my grandfather to never quit before being fired, as that's exactly what they want you to do. So, I didn't, I just let them fire me, and they threatened legal action, and all kinds of other BS. \n\nI kept copies of all the emails they sent me, and when I went to get unemployment, they decided to fight it in court so to speak. I sent all the emails, and even my copies of my evaluations they emailed me over the course of the 3 years I worked for them showing that I not only had a perfect attendance, but also that I was one of their top 5 technicians. The only reason I was being fired was because one of the owners didn't like me. I told him I wasn't going to recover files from an HDD that he got from a used department of defense PC he somehow got his hands on. \n\nAnyways, companies will do anything to make sure they don't fulfill their legal obligations if possible if it will save them money in the long run. Look at McDonalds, they strictly hire 90% part time employees who work less than 40 hours a week, so they don't have to pay overtime, or pay benefits to their employees. You can only get benefits after at or around 35-40 hours, and if you work overtime over those 40 hours, you can get overtime pay. Management makes certain it's less in most cases, and that they still somehow work you to the bone.",
            "title_similarity": "0.8632996",
            "sentiment_compound": 0.3215
        },
        {
            "id": "hixeovh",
            "score": 1,
            "text": "such a sharp judge",
            "title_similarity": "0.02121719",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixerky",
            "score": 1,
            "text": "I have IBS and something like firing me for bathroom breaks would be an instant lawsuit.",
            "title_similarity": "0.70681614",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hixeu8g",
            "score": 1,
            "text": "Why the hell would you ever do this, so weird",
            "title_similarity": "0.2524148",
            "sentiment_compound": -0.7809
        },
        {
            "id": "hixewuu",
            "score": 1,
            "text": "I worked at a job that wanted us to do safety violations almost every day. Double stack ladders on 40ft high roofs with no LOS spotters/no one footing the ladder. The guys that were there 6+years just put up with it. They had kids and mortgages and couldn’t just quit. \nThe company would not assign any jobs for those that resisted bc of safety violations, and those guys would quit bc of lack of work/low paycheck, or the company would fire them for “abandonment” after three days.",
            "title_similarity": "0.80202144",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hixf1r6",
            "score": 1,
            "text": "Never write an apology letter or sign any documents when you’re getting let go. Consult an employment lawyer.",
            "title_similarity": "0.60397506",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hixf4ol",
            "score": 1,
            "text": "I’ve literally never heard of a company asking someone to write an apology letter for being fired. What a scumbag practice.",
            "title_similarity": "0.75271475",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hixfcem",
            "score": 1,
            "text": "This is a trick used by police to get confessions, too. They tell you it's hypothetical, then lie about it as being authentic to the court.",
            "title_similarity": "0.52880824",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hixfckr",
            "score": 1,
            "text": "Dear Walmart,\n\nI apologize that my managers are pieces of shit who forced me to write this bullshit letter about me using the bathroom too much, because instead of running a supermarket properly, they apparently like to stalk employees who do their job in a way they fail to do.\n\nKind regards,\n\nAn employee who doesn't ever plan to work for this piece of shit company",
            "title_similarity": "0.86001897",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hixfdiy",
            "score": 1,
            "text": "Why would you do more work for the company by writing a letter once they fire you?",
            "title_similarity": "0.762608",
            "sentiment_compound": -0.34
        },
        {
            "id": "hixfeaa",
            "score": 1,
            "text": "Sarcastic apologies are ok though.\n\n\"I am deeply sorry that my boss is such a micromanaging control freak that they have a personal problem with being unable to also control their employees natural bodily functions.\n\nI am also sorry that this blatantly abusive behavior is being supported by the company.\n\nI would also like to apologize to my coworkers, who I am certain will not only become the next targets of this toxic behavior, but will also be forced to pick up the slack left by my assumed imminent departure from this workplace when <boss> finds it is hard to hire a replacement when prospective employees learn why this position has become vacant.\"",
            "title_similarity": "0.8086387",
            "sentiment_compound": -0.7541
        },
        {
            "id": "hixferw",
            "score": 1,
            "text": "USA. not even once",
            "title_similarity": "0.14770257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixfh8b",
            "score": 1,
            "text": "That’s terrible. What if your friend or anyone had IBS or Crohns? It’s not always someone’s choice to use the restroom frequently.",
            "title_similarity": "0.53582907",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hixfi98",
            "score": 1,
            "text": "The fuck, company’s do this?",
            "title_similarity": "0.28053242",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hixfioz",
            "score": 1,
            "text": "Wtf, why would anyone do that.",
            "title_similarity": "0.1626563",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hixfjoa",
            "score": 1,
            "text": "They'll just fabricate evidence to win anyway. It's a joke",
            "title_similarity": "0.33171475",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hixfmxk",
            "score": 1,
            "text": "Why would anyone write a letter of apology to a company that fired them?",
            "title_similarity": "0.7720274",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hixfq4c",
            "score": 1,
            "text": "Your friend was taken advantage of. Fuck Walmart",
            "title_similarity": "0.47901464",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hixft0g",
            "score": 1,
            "text": "Why the hell - would ANYONE thats being fired - write an \"i'm so sorry\" note when asked to?",
            "title_similarity": "0.7001745",
            "sentiment_compound": -0.8733
        },
        {
            "id": "hixfxhb",
            "score": 1,
            "text": "Jokes on them. I work on land",
            "title_similarity": "0.06393607",
            "sentiment_compound": 0.25
        },
        {
            "id": "hixg26n",
            "score": 1,
            "text": "Here is a life pro tip sign nothing without reading first and have a lawyer read it.",
            "title_similarity": "0.54584616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixg4zk",
            "score": 1,
            "text": "Dont sign anything either.  You dont have to do jack shit.  You just ask for the termination in writing and leave.\n\nThe only thing you need to sign is if they are offering you a severance package in exchange for something.  And then, you need to be careful.  A company is not going to offer you anything that doesnt benefit them.",
            "title_similarity": "0.6405889",
            "sentiment_compound": -0.6888
        },
        {
            "id": "hixgbdx",
            "score": 1,
            "text": "LPT: unionize your workplace.",
            "title_similarity": "0.39671832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixgdf7",
            "score": 1,
            "text": "I can't ever remember an employer apologizing to me for anything and for the simple fact of keeping the relationship balanced it would never occur to me to apologize to them for anything.  Relationships should be equal.\n\nThat being said, the liability of doing so is a far more important to never do so.",
            "title_similarity": "0.5996052",
            "sentiment_compound": 0.101
        },
        {
            "id": "hixggfb",
            "score": 1,
            "text": "You could take this a step further and refuse to sign disciplinary papers or basically anything that could negatively impact your unemployment case in the future.",
            "title_similarity": "0.5056539",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hixggyg",
            "score": 1,
            "text": "Lol if a company had the audacity to ask for an apology letter after firing me I'd tell them to get bent.",
            "title_similarity": "0.7354548",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hixgq3o",
            "score": 1,
            "text": "i worked at one in 2011, for about half a year  \n\n\nI tried to go back last month, they rejected me,  I was relieved.  the place looked more miserable than a decade ago.  Got a job a few days later in a field I actually want to work in,  for a privately owned business that I dont have to worry about killing my soul working in.",
            "title_similarity": "0.7435747",
            "sentiment_compound": -0.7837
        },
        {
            "id": "hixgqs6",
            "score": 1,
            "text": "What the heck is going on in America.... I'm asking from a shithole third world country that doesn't treat workers this badly.",
            "title_similarity": "0.50202805",
            "sentiment_compound": -0.6551
        },
        {
            "id": "hixgtjs",
            "score": 1,
            "text": "Wal-mart is notorious for this. They tried me like this and I told the store manager absolutely no and I was not signing anything without legal representation. They basically tried to scam me out of unemployment they owed me as it was deemed not a reason to have let me go. \n\nCompanies that are use to high turnover will do this all the time as they have to by law pay upfront for unemployment and they don’t want to pay you once terminating you for bs reasons.",
            "title_similarity": "0.84157866",
            "sentiment_compound": -0.9226
        },
        {
            "id": "hixgvv2",
            "score": 1,
            "text": "why tf would anyone do that??",
            "title_similarity": "0.13262044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixh388",
            "score": 1,
            "text": "Is...is this a thing?\n\nI have to figure anybody being asked to write an apology letter to the company they're being fired from just radiates doormat energy so the company takes advantage of that. I'd laugh so hard in their face if I was ever asked to write an apology letter, *especially* if it's for some shit tier job like a Walmart associate. Gtfoh.",
            "title_similarity": "0.82159615",
            "sentiment_compound": 0.1365
        },
        {
            "id": "hixh4nu",
            "score": 1,
            "text": "Who the fuck does this?  Some yes man in a last ditch effort to keep their job?",
            "title_similarity": "0.4647488",
            "sentiment_compound": -0.2869
        },
        {
            "id": "hixh5cg",
            "score": 1,
            "text": "I'm sorry, is this an American problem I'm too European to understand?",
            "title_similarity": "0.34864056",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hixhd3v",
            "score": 1,
            "text": "Yep. I learned this the hard way about 9 years ago.",
            "title_similarity": "0.35361493",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hixhg99",
            "score": 1,
            "text": "Yo friend a punk",
            "title_similarity": "0.31546038",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hixhlcw",
            "score": 1,
            "text": "Also, if you are required to give your 2 weeks in your employment contract and you give it, they might say, \"You've done such a good job, you can just go now. Take some time off between jobs.\" You are still owed 2 weeks pay whether they want you to work or not.",
            "title_similarity": "0.65521574",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hixhmbg",
            "score": 1,
            "text": "Letter of what\n\nWhat the fuck",
            "title_similarity": "0.14334594",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hixho0w",
            "score": 1,
            "text": "Don't apply to Walmart if I'm pregnant, got it!",
            "title_similarity": "0.5194146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixhqil",
            "score": 1,
            "text": "The reverse of this is get handed an admission of \"guilt/failure/demotion\" and sign it with a smile on your face and let them think you'll be compliant while applying for a new job. You then send a 4 week notice to the owner exemplifying the chance to grow in their business and thank them for allowing you the opportunity to progress. The next day you turn in your keys and ghost.\n\nTo be fair, this only works (in practice) if you say fuck all to the employment benefits and just want to wreck the schedule for a couple weeks because you know you're the only one that can fix the POS and you have admin access to the the Scheduling app and email.\nI had fun with them for approximately 6 months after.\nGo forth and sin.",
            "title_similarity": "0.75970244",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hixhsd9",
            "score": 1,
            "text": "I wish I had employers like this, I would love to be just a nightmare employee",
            "title_similarity": "0.5702499",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hixhu8l",
            "score": 1,
            "text": "This sound like a proper murican thing. Never heard of writing an apology like this before.",
            "title_similarity": "0.35470307",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hixhwiy",
            "score": 1,
            "text": "Wal-Mart like Dick Cheney after shooting someone.",
            "title_similarity": "0.63774645",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hixhypt",
            "score": 1,
            "text": "Dear Walmart folks:\n\nI'm sorry that you provide such a shitty work environment that employees are discouraged from meeting their basic human needs. \n\nSince I can't use the bathroom as needed, I'd like to invite each of you to suck a turd out of my ass which should reduce the frequency of my elimination. \n\nIn closing, I'm sorry that you suck so badly.\n\nV/r \n\nSam.",
            "title_similarity": "0.8323316",
            "sentiment_compound": -0.9381
        },
        {
            "id": "hixi092",
            "score": 1,
            "text": "Reading those stories makes me believe more and more that information can be more valuable than gold sometimes.",
            "title_similarity": "0.27390906",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hixi66n",
            "score": 1,
            "text": "I once dated a guy who got fired for showing up late ONE TIME after working there for years(also he had just begun working full time hours but hadn’t started receiving benefits yet), then Walmart called him the next day and asked if he’d like his job back for a cut in pay and hours",
            "title_similarity": "0.8611034",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hixi91i",
            "score": 1,
            "text": "In the same idea, if your employers ask you to sign something read it carefully. Could be a letter stating you are leaving, not them firing you.",
            "title_similarity": "0.57381946",
            "sentiment_compound": 0.3687
        },
        {
            "id": "hixiayn",
            "score": 1,
            "text": "When I was fired they asked me to sign a confession for murdering the CEO's wife. It seemed like the right move at the time, but in retrospect it was way more headache than it was worth.",
            "title_similarity": "0.7874423",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hixieo2",
            "score": 1,
            "text": "Who tf would write an apology letter for being fired lmao \n\nWhat a useless tip",
            "title_similarity": "0.74756044",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hixifoz",
            "score": 1,
            "text": "I used to work in unemployment appeals and I’m pretty sure this behavior by the employer wouldn’t fly, especially on appeal by the employee. At least in my state.",
            "title_similarity": "0.64680237",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hixigjn",
            "score": 1,
            "text": "TIL about mandatory apology letters.",
            "title_similarity": "0.29682642",
            "sentiment_compound": 0.128
        },
        {
            "id": "hixigq1",
            "score": 1,
            "text": "They made me sign something when I was terminated with a list of complaints against me. I signed it \"I am signing that I understand what is written. I'm not signing that I agree with what is written\". And took a photo of what I signed just in case. My boss at the time absolutely did not want to pay anyone unemployment and would usually try to make the job so unbearable you'd want to quit. Trying to make me sign that shit was probably another tactic she would have used.",
            "title_similarity": "0.81395066",
            "sentiment_compound": -0.745
        },
        {
            "id": "hixihsu",
            "score": 1,
            "text": "“We want an apology for using the bathroom too much”\n\nOh yes of course\n\n*pisses on a sheet of paper and mails it out*",
            "title_similarity": "0.7011299",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hixionx",
            "score": 1,
            "text": "When I started doing work on Walmarts (contractor, not employee) one of the things that shocked me was seeing actual posters up in offices specifically about getting unemployment claims denied.",
            "title_similarity": "0.72342527",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hixit8f",
            "score": 1,
            "text": "Are they ethnic Japanese? For them it would be a thing.",
            "title_similarity": "0.14585452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixitep",
            "score": 1,
            "text": "Must be in the USA. In Canada they have the apology act where apologizing does not constitute an admission of guilt. \n\nAlso why would you do anything an employer asks for after they fire you? They fired you they don’t own you anymore",
            "title_similarity": "0.73820984",
            "sentiment_compound": -0.802
        },
        {
            "id": "hixiv22",
            "score": 1,
            "text": "Umm that judge was in the pockets of Walmart.  Chances are on appeal it would get over turned. I also bet there is more to this story than using the bathroom to much.",
            "title_similarity": "0.56179464",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hixiy2b",
            "score": 1,
            "text": "My boss asked me for a letter of resignation when I quit and because I never sent it in she had to fire me which allowed me to gain those nice unemployment checks that helped me till I found a semi better job and pay.",
            "title_similarity": "0.8602891",
            "sentiment_compound": 0.296
        },
        {
            "id": "hixj1u5",
            "score": 1,
            "text": "jesus christ. if a workplace ever asked me to write an apology letter...\n\naside from not doing that.. obviously... there would be a literal firehose required to clean the defecation that would rain upon company cars... and they better keep the firetruck because i'm burning that place down as well",
            "title_similarity": "0.77077794",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hixj28h",
            "score": 1,
            "text": "All these LPT's are so American :')",
            "title_similarity": "0.14090502",
            "sentiment_compound": 0.5542
        },
        {
            "id": "hixj29q",
            "score": 1,
            "text": "Just came in here to say FUCK WALMART\n\nStop shopping there, please. For everyone's sake.",
            "title_similarity": "0.68518496",
            "sentiment_compound": -0.6289
        },
        {
            "id": "hixj2tv",
            "score": 1,
            "text": "If I was fired, why would I comply with my previous employers request...?",
            "title_similarity": "0.63873875",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hixj3qh",
            "score": 1,
            "text": "Yo America, what kind of social distopia to you guys live in? Writing a letter to a company to appologise? Who the fuck even asks for that.",
            "title_similarity": "0.72606474",
            "sentiment_compound": -0.594
        },
        {
            "id": "hixjaau",
            "score": 1,
            "text": ">asked him to write a letter apologizing\n\nWhat? This is actually a thing???\n\nWhy would anyone do that? What are they going to do? Fire you?",
            "title_similarity": "0.69514793",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hixjaiq",
            "score": 1,
            "text": "Daily reminder thr Waltons are scum",
            "title_similarity": "0.49924847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixjbtv",
            "score": 1,
            "text": "The real LPT here is if a company asks you do anything after they've let you go, don't. You don't work there anymore. You have no obligation to.",
            "title_similarity": "0.5932809",
            "sentiment_compound": -0.296
        },
        {
            "id": "hixjcsg",
            "score": 1,
            "text": "I don’t get this, why do they do that? Doesn’t the government pay for unemployment, or is it the company paying?",
            "title_similarity": "0.6184038",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hixjlmn",
            "score": 1,
            "text": "Never in my life ever heard of writing an apology letter to a COMPANY and (with peace and love) your friend is a dork for doing it!! Like why did he write it?? He didn’t think that was weird??",
            "title_similarity": "0.72854006",
            "sentiment_compound": 0.9193
        },
        {
            "id": "hixjnsq",
            "score": 1,
            "text": "This has to be a joke right? The only way I'd write a letter is if I was \"getting let go\" and I'd have to be on really really good terms with the boss. It would not be an apology. It would be a letter stating how bad ass I was and I would expect them to sign it.... This is so preposterous of a tip that I can't even fathom who needs to know this.",
            "title_similarity": "0.75738823",
            "sentiment_compound": 0.8599
        },
        {
            "id": "hixjnt8",
            "score": 1,
            "text": "Writing a letter to apologize to a company? I’ve never heard of that. That’s absolutely insane.",
            "title_similarity": "0.6866896",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hixjtb4",
            "score": 1,
            "text": "Why is this practice legal??? Oh, that's right (wal-mart), USA corporate overlords write our laws....",
            "title_similarity": "0.46077377",
            "sentiment_compound": 0.2593
        },
        {
            "id": "hixjtn0",
            "score": 1,
            "text": "Never, ever talk to HR. They are not your friend, they are not their for you, they are there for the company and they hate you. Ignore their emails",
            "title_similarity": "0.71378237",
            "sentiment_compound": -0.8329
        },
        {
            "id": "hixjx06",
            "score": 1,
            "text": "There is no way this is a thing. I refuse to believe anyone would write a letter to apologize.",
            "title_similarity": "0.37742636",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hixjzn4",
            "score": 1,
            "text": "Adding to this: hire a lawyer immediately if this happens to you. The payout you’re about to get will be worth it.",
            "title_similarity": "0.39055842",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hixk1sw",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.15071146"
        },
        {
            "id": "hixk7rw",
            "score": 1,
            "text": "If your companies asks you to apologize and you do you’re 100% unadulterated bitch and should be cast into a fire",
            "title_similarity": "0.66722405",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hixkbcp",
            "score": 1,
            "text": "This must be a US problem. It is so strange that a western country can have 3rd world worker rights where companies can get away with anything. Worker rights, free education and free health care is not communism. It is just civilization.",
            "title_similarity": "0.45847672",
            "sentiment_compound": 0.694
        },
        {
            "id": "hixkfx9",
            "score": 14,
            "text": "I cannot believe that adult people sit down and write an apology to the company that just fired them, I'd rather take a shit in an envelope and mail it to them",
            "title_similarity": "0.8375667",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hixkh1p",
            "score": 1,
            "text": "Yeah, no fuckin shit.",
            "title_similarity": "0.004805794",
            "sentiment_compound": 0.4968
        },
        {
            "id": "hixki4g",
            "score": 2,
            "text": "On the real your friend wrote a letter saying he was sorry for using the bathroom too much. After he was fired. Ffs",
            "title_similarity": "0.840494",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hixkqrc",
            "score": 1,
            "text": "I use the bathroom so much haha. No way will I apologize for it",
            "title_similarity": "0.5429884",
            "sentiment_compound": 0.2992
        },
        {
            "id": "hixkzfc",
            "score": 1,
            "text": "Your friend got nuked jfc",
            "title_similarity": "0.5750699",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hixl3wg",
            "score": 1,
            "text": "People actually wrote apology letters to companies they worked for?",
            "title_similarity": "0.6265851",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hixl64j",
            "score": 1,
            "text": "Don't sign any letter or blank paper.",
            "title_similarity": "0.24955902",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixl811",
            "score": 1,
            "text": "A coworker of mine was about to get fired but the director called him into the office and told him to resign out of respect for being a fellow west point grad. He fucked up and resigned, I told him not to fall for it but at the same time I was glad he was gone since the rest of my dept was pulling his weight while he got paid double.",
            "title_similarity": "0.89012563",
            "sentiment_compound": -0.705
        },
        {
            "id": "hixlcfv",
            "score": 1,
            "text": "Why the fuck would you write that even if they asked?",
            "title_similarity": "0.2990828",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hixleju",
            "score": 1,
            "text": "I can't imagine any situation where I'd oblige with writing an apology letter to a company. Especially if I'm out the door.",
            "title_similarity": "0.619305",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hixlla4",
            "score": 1,
            "text": "Jesus Christ they're such scumbags.",
            "title_similarity": "0.3616214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixlola",
            "score": 1,
            "text": "Apologizing to the company? And people actually do this? Instead of shouting, go eat a d*ck?!  Man, people do really weird stuff 😂",
            "title_similarity": "0.67821693",
            "sentiment_compound": 0.3483
        },
        {
            "id": "hixlte5",
            "score": 1,
            "text": "Are people idiots?\n\nHow is this an LPT?",
            "title_similarity": "0.38204628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixlzl2",
            "score": 1,
            "text": "[Everyone in a country with better employment protections than the US](https://brunchvirals.com/wp-content/uploads/2021/03/The-What-Meme.png)",
            "title_similarity": "0.34206438",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hixmnc0",
            "score": 1,
            "text": "As someone who knows a CFO for a wal mart or some aspect of corporate.\n\nHe should have a lawyer represent him and take them to the cleaners",
            "title_similarity": "0.5716221",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixmnj8",
            "score": 1,
            "text": "Why would anyone write an apology letter in these circumstances?? What's the company going to do if you refuse? Fire you? THEY'RE ALREADY FIRING YOU.",
            "title_similarity": "0.8037448",
            "sentiment_compound": -0.8173
        },
        {
            "id": "hixmrpr",
            "score": 1,
            "text": "Whilst I agree with this, I wish a certain someone would get a serious talking to for using the toilet too much. \n\nNot for actually using the toilet. No he was throne surfing to escape doing his job.",
            "title_similarity": "0.60355246",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hixn2ra",
            "score": 1,
            "text": "Is “using the bathroom too much” a legal cause to fire someone?",
            "title_similarity": "0.6333847",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hixn3ks",
            "score": 1,
            "text": "Why would anyone ever write an apology to their company?? Even if they knew they weren't going to get fired?! That's some wild shit.",
            "title_similarity": "0.6835339",
            "sentiment_compound": -0.833
        },
        {
            "id": "hixn8lp",
            "score": 1,
            "text": "Why the hell would you write a letter of apology? I've never heard of that concept before! Damn corps..",
            "title_similarity": "0.57154715",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hixnb73",
            "score": 1,
            "text": "Isn't it more likely he filed for unemployment after being fired for cause, then Walmart finally provided the documentation to show that true?\n\nYou don't get unemployment in most places if you are fired or quit.",
            "title_similarity": "0.8020931",
            "sentiment_compound": -0.709
        },
        {
            "id": "hixni46",
            "score": 1,
            "text": "The last place I worked had me on contract for two years as a 'casual' employee. I found a better job near that end date and asked for a meeting with my managers to discuss retention. Nothing came of it until the third shift before my last day. They offered me a 6 month extention on my casual contract. I declined.\n\nAs a casual employee i dont earn towards the company retirement plan or production bonus. I get my (meager) paycheque - and thats it\n\nThey then asked me to write up a letter of resignation. Like i quit or something. I told them to fuck off, Im not resigning. Im declining to sign another contract with them. The manager insisted.\n\nSo i wrote an email and saved a copy, essentially stating that I had found a similar job, unionized, not on contract basis and was paying about $10/hr more. I sent it to the whole company so that others in my position knew that there were other positions at this company available, and I made sure to state that I was not resigning - i was simply allowing my contract to expire. I also mentioned that Manager's tactic of having me write up a letter of resignation was shady and weird, and that if youre asked to do the same at the end of a contract, not to. Its not a resignation if you decline a contract extention.",
            "title_similarity": "0.79881394",
            "sentiment_compound": 0.9005
        },
        {
            "id": "hixnofc",
            "score": 1,
            "text": "Can the US just get unionized already. Im fairly sure this doesn't happen anywhere else",
            "title_similarity": "0.3862468",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hixnsnw",
            "score": 1,
            "text": "one more reason I'm glad I dont live in ancapistan or as it is known around the world the USA.",
            "title_similarity": "0.53214",
            "sentiment_compound": 0.5046
        },
        {
            "id": "hixntjb",
            "score": 1,
            "text": "\"Dear walmart, I'm sorry that i couldn't poop more\"",
            "title_similarity": "0.5376238",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hixnvkr",
            "score": 1,
            "text": "His company fired him… then asked him to write a letter apologizing to them…. And he did it?  \n\nI know that sometimes people will get a long lecture, after they are fired, about why…. But really, nothing you say after “fired” matters a damn bit to me. Might as well turn off your mouth after that word because I can’t even hear you. I am no longer being paid to listen to your bullshit, so that is now someone else’s job. Goodbye",
            "title_similarity": "0.86116207",
            "sentiment_compound": -0.926
        },
        {
            "id": "hixnyd2",
            "score": 1,
            "text": "I remember I was leaving a company a few years back (product development lead) and when I put in my 2 week..  The HR rep was prepping my final exit stuff and realized that I had somehow never signed an NDA (their mess up, I was with the company for 5 years) \n\nSo last day I roll into HR to sign some shit and then they casually slide a random document across the desk and say - oh this isn't really a big deal but do you mind signing it? It was the NDA with a 1 year stipulation for working in the industry. I giggled and said - I'm absolutely not signing that. Then walked out. \n\nMoral of the story.. you're not obligated to sign anything you don't want to. Capitalize on their missteps; cause we all know they would do it to you",
            "title_similarity": "0.80109566",
            "sentiment_compound": 0.0559
        },
        {
            "id": "hixo11q",
            "score": 1,
            "text": "I honestly don't understand why anyone would do that.  Did your friend explain?",
            "title_similarity": "0.3495742",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hixo2oz",
            "score": 1,
            "text": "The making of an r/antiwork user",
            "title_similarity": "0.20035335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixo3yo",
            "score": 1,
            "text": "And the iPhone 5 is an iPhone 4",
            "title_similarity": "0.07269271",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixo4p0",
            "score": 1,
            "text": "Also a common tactic for policing. I have had quite a few guys write apology letters to victims making sure they specifically write what they did so the victim knows they actually wrote it. That apology letter is also a written admission of guilt.",
            "title_similarity": "0.6145241",
            "sentiment_compound": -0.4728
        },
        {
            "id": "hixoa3i",
            "score": 1,
            "text": "Uh, I believe bathroom breaks are legitimately protected under OSHA laws in the states. Like, no matter what your job is. Whoever fired him is lucky nothing ever came of that.",
            "title_similarity": "0.6565783",
            "sentiment_compound": 0.5463
        },
        {
            "id": "hixohic",
            "score": 1,
            "text": "Dang, worked at Walmart a few years ago. The pay sucked, but the job itself actually wasn't that bad. They never once tracked how often we used the bathroom.",
            "title_similarity": "0.69349617",
            "sentiment_compound": 0.3767
        },
        {
            "id": "hixokxp",
            "score": 1,
            "text": "I don't even know what to make of this. First of all, they fired your friend for using the bathroom too much? Sounds illegal as fuck to me. Maybe your friend has a medical condition.\n\nSecond, I've never heard of an employer asking an employee to write a letter of apology for anything, especially if that employee is fired. If I were your friend in this case I'd probably just laugh and go home (and lawyer up because there's some money to be made here). I mean, what are they gonna do if your friend just says \"fuck you\" instead of writing a \"letter of apology?\" The answer is nothing. \n\nLiterally none of this makes sense.",
            "title_similarity": "0.88725924",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hixoul4",
            "score": 1,
            "text": "America, I assume?",
            "title_similarity": "0.03014807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixp0qo",
            "score": 1,
            "text": "I never heard of jobs asking for apology letters.",
            "title_similarity": "0.46482497",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hixp3qa",
            "score": 1,
            "text": "I mean, is this actually a thing? You get fired and the company wants you to write an apology? Lol. Seems so absurd that it can't even be real.",
            "title_similarity": "0.7802082",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hixp4wa",
            "score": 1,
            "text": "Counterpoint or clarification regarding commitment letters: \n\nIf they ask for a commitment letter describing your plan for correcting a behavior you have repeatedly been documented for exhibiting which breaks company policy, then you will be fired if you do not follow instructions and remit the letter.",
            "title_similarity": "0.7548919",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hixp5oc",
            "score": 1,
            "text": "You gotta be one whole of a dumbass to write an apology letter to a company, whether you’re being fired or not.",
            "title_similarity": "0.77752435",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hixpec8",
            "score": 1,
            "text": "They're also goading you to quit because it's such a bullshit thing to ask.",
            "title_similarity": "0.564069",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hixpgl7",
            "score": 1,
            "text": "Why on earth would anyone ever write an apology letter for being fired?",
            "title_similarity": "0.6825212",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hixphfs",
            "score": 1,
            "text": "\"Why are you telling me what to do if I no longer work for you?\"",
            "title_similarity": "0.41439104",
            "sentiment_compound": -0.296
        },
        {
            "id": "hixpiap",
            "score": 1,
            "text": "Pretty sure they cannot fire you for that but they also know people won’t pursue the all might force that is the Walton family.",
            "title_similarity": "0.5061631",
            "sentiment_compound": 0.5053
        },
        {
            "id": "hixplvs",
            "score": 1,
            "text": "Never speak when you can nod.\n\nNever nod when you can wink.\n\nAnd never, ever put anything in writing.",
            "title_similarity": "0.37297824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixplxj",
            "score": 1,
            "text": "Imagine writing a letter while getting fired",
            "title_similarity": "0.5511807",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hixpmai",
            "score": 1,
            "text": "What the fuck is wrong with the USA where you're being asked to write apology letters",
            "title_similarity": "0.58219343",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hixpn31",
            "score": 1,
            "text": "Does that even do anything for the company? It feels like that just fucks over the employee",
            "title_similarity": "0.7167891",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hixpnbs",
            "score": 1,
            "text": "D-Day aka Decision Day \nClassic walmart",
            "title_similarity": "0.3156113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixpngg",
            "score": 1,
            "text": "So what your telling me is that your friend was abusing the bathroom privileges. Because everyone has a bathroom at their workplace, and can hide in it. Maybe he apologized because he got caught in a pattern.",
            "title_similarity": "0.76633096",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hixpp02",
            "score": 1,
            "text": "America is a dystopian nightmare.",
            "title_similarity": "0.41062325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixpqxt",
            "score": 1,
            "text": "Daily reminder that the USA is an insane country.\n\nUnemployment benefit is for unemployed people. It shouldn't matter how you lost your job.",
            "title_similarity": "0.7511318",
            "sentiment_compound": -0.609
        },
        {
            "id": "hixpst2",
            "score": 1,
            "text": "Can I say “I’m sorry for thinking this was a good place to work”?",
            "title_similarity": "0.3558544",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hixptds",
            "score": 1,
            "text": "Don't sign anything either. Just get your belongings and walk out.\n\nWhat are they gonna do if you don't sign it? Fire you?",
            "title_similarity": "0.6032607",
            "sentiment_compound": 0.3391
        },
        {
            "id": "hixpum3",
            "score": 1,
            "text": "Why the hell would you apologize for getting fired for something?",
            "title_similarity": "0.6137292",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hixq73g",
            "score": 1,
            "text": "Companies are NEVER your friends. They're only looking to use you to help make a profit.",
            "title_similarity": "0.6236945",
            "sentiment_compound": 0.4671
        },
        {
            "id": "hixq804",
            "score": 1,
            "text": "Best story I ever heard was a guy who was called into the conference room and knew he was about to be fired. Sat down and said, \"I'm glad I have you here. I wanted to let you know that I'm gay and ready to live openly.\"",
            "title_similarity": "0.64163107",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hixqbai",
            "score": 1,
            "text": "I have IBS. I wonder if I’m on the “bathroom too much” radar at work. If they called me on it, I’d just happily invite them along. I wouldn’t really though cause I’m soft.",
            "title_similarity": "0.48785764",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hixqbkb",
            "score": 1,
            "text": "Why would I write an apology letter to company that's firing me??",
            "title_similarity": "0.77400005",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hixqf83",
            "score": 1,
            "text": "When the pandemic hit I told my work I don't want shifts as I'm on 0 hours. Fast forward a few weeks they asked me to come in for some sort of meeting to essentially fire me. Lmao like I would turn up. Months later I get an email from someone in IT and I simply replied I don't work for the company anymore and to troll I asked about my pension.",
            "title_similarity": "0.85729563",
            "sentiment_compound": 0.5828
        },
        {
            "id": "hixqh24",
            "score": 1,
            "text": "LPT: if you work in a place where you might be asked to write an apology to your employer, the pendulum has swung too far right and it's time time unionise. \n\nAlso, never apologise for work performance. Not ever.",
            "title_similarity": "0.7955431",
            "sentiment_compound": -0.2462
        },
        {
            "id": "hixqww0",
            "score": 1,
            "text": "Wait, how did they convince them to write the letter if they already knew they were being fired? At that point wouldnt you not give af about what the company thinks? I guess unless you need them for a reference but still at that point youre already getting fired and theyre probs not the best reference choice",
            "title_similarity": "0.77645683",
            "sentiment_compound": -0.912
        },
        {
            "id": "hixqx9i",
            "score": 1,
            "text": "Keep it short. \"I'm sorry you think you deserve an apology.\"",
            "title_similarity": "0.37867266",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hixr0j9",
            "score": 1,
            "text": "That's straight up evil. God forbid a multi-billion dollar company should promote someone and pay them more.",
            "title_similarity": "0.7079073",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hixr5op",
            "score": 1,
            "text": "This shit is getting me in the mood for a revolution",
            "title_similarity": "0.2632005",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hixr88j",
            "score": 1,
            "text": "What in the hell, why does there even need to be a tip for this? Apologising via a letter to your employer while they're firing you? What kind of psychotic bullshit is that?",
            "title_similarity": "0.8063613",
            "sentiment_compound": -0.902
        },
        {
            "id": "hixr8vc",
            "score": 1,
            "text": "I have never ever heard if this and I'm flabbergasted that anyone would ever do so.",
            "title_similarity": "0.3586064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixrton",
            "score": 1,
            "text": "You know... Its as though the system is broken. Hmmm.",
            "title_similarity": "0.2994439",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hixrvul",
            "score": 1,
            "text": "Who the fuck has been asked got write an apology letter our of the 5th grade to a job that is FUCKING FIRING YOU!",
            "title_similarity": "0.81357026",
            "sentiment_compound": -0.8294
        },
        {
            "id": "hixs0sj",
            "score": 1,
            "text": "This happens?   lol",
            "title_similarity": "-0.07907382",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hixs3h5",
            "score": 1,
            "text": "Also always ask for your personell file, ask for an exit interview if they are just trying to fire and esxort you out.",
            "title_similarity": "0.6347977",
            "sentiment_compound": -0.34
        },
        {
            "id": "hixs6vi",
            "score": 1,
            "text": "Been reading this thread for a little while. America is fucking weird. They can make up any old reason to fire you? Crazy.",
            "title_similarity": "0.6473726",
            "sentiment_compound": -0.6997
        },
        {
            "id": "hixsfzf",
            "score": 1,
            "text": "In today's episode of \"LPT: Employer Bad\"...",
            "title_similarity": "0.5509816",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hixspeh",
            "score": 1,
            "text": "[But why must the confession be written?](https://www.youtube.com/watch?v=K19FtgBlz2A&t)",
            "title_similarity": "0.30475423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixsqax",
            "score": 1,
            "text": "There are some seriously shitty business practices out there and it's shockingly common going by the comments. I will write sweet fuck all  if I were asked something like that. I'd probably laugh in their faces if I were asked to write or sign anything.\n\nI get it, if you're younger or you really need the job etc, but man this seems like a pretty solid explanation for some of the mass shootings we hear about.",
            "title_similarity": "0.76225257",
            "sentiment_compound": 0.85
        },
        {
            "id": "hixswku",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10692595"
        },
        {
            "id": "hixsx4d",
            "score": 1,
            "text": "Your friend is an idiot",
            "title_similarity": "0.42432126",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hixt6p7",
            "score": 1,
            "text": "What the fuck? Who apologizes after being fired. \n🖕🏻😮🖕🏻 peace out bitches",
            "title_similarity": "0.6396546",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hixt7wj",
            "score": 1,
            "text": "If you are getting fired don’t do anything for them",
            "title_similarity": "0.50153494",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hixtfpz",
            "score": 1,
            "text": "Apologize for shitting too much in a shitty place? Lmao",
            "title_similarity": "0.5647976",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hixtoet",
            "score": 1,
            "text": "> Nods from across the internet",
            "title_similarity": "0.01700671",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixtozv",
            "score": 1,
            "text": "My god, this is vile on so many levels. I'm so sorry for,your friend, I hope they are able to get back on their feet.",
            "title_similarity": "0.52279216",
            "sentiment_compound": 0.3864
        },
        {
            "id": "hixu6wo",
            "score": 1,
            "text": "I don't know who needs to hear this but I don't trust their faculties.",
            "title_similarity": "0.3038671",
            "sentiment_compound": -0.5504
        },
        {
            "id": "hixuoyg",
            "score": 1,
            "text": "My wife’s aunt just had to do this exact thing. Granted, she is the WORST and I know for a fact that 10000% deserves to be fired.  But of course she was dumb enough to sign the letter. In her case, I don’t feel the least bit bad for her, but I know this happens to tons of ppl who don’t deserve it. So yeah, don’t ever write/sign these things.",
            "title_similarity": "0.8166982",
            "sentiment_compound": -0.8784
        },
        {
            "id": "hixv60x",
            "score": 1,
            "text": "Your friend got fucked over big time. One of the things I really hate are slimy actions like that.",
            "title_similarity": "0.6630478",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hixvbed",
            "score": 1,
            "text": "That is a fucked situation, wow.",
            "title_similarity": "0.17677113",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hixvckd",
            "score": 1,
            "text": "in what fucked up world do we live in that you're asked to write a letter of apology? Good lord.",
            "title_similarity": "0.56017447",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hixvfpr",
            "score": 1,
            "text": "TIL I wanted to be angry today",
            "title_similarity": "0.48380202",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hixvgiz",
            "score": 1,
            "text": "I was accused of falsifying sales in order to boost my commission (someone else on my team had done this and been fired for it two weeks prior). I hadn’t. A forceful and rude investigator for my company tried to get me to sign a pre-written apology that was an admission of guilt. I decline repeatedly. After two hours locked in a room with this woman, never signing the document despite her attempts, I was released and went back to work. I kept my job and my manager ended up apologizing to me. I used up all the PTO I’d saved for years and then I quit.",
            "title_similarity": "0.88457066",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hixvml6",
            "score": 1,
            "text": "I didn’t know this was a thing and would think it was a joke if my employer requested a letter of apology. Just fire me now sir ma’am",
            "title_similarity": "0.7523508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixvzl4",
            "score": 1,
            "text": "I have watched Making a Murderer. I am not getting  Brendon Dassey’ed.",
            "title_similarity": "0.5483673",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hixw0y1",
            "score": 1,
            "text": "This sounds like coercion to me.",
            "title_similarity": "0.00052140653",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hixw4pi",
            "score": 1,
            "text": "> they ask you to write a letter apologizing to the company,\n\n#WHAT IN THE PREDATORY 9TH LEVEL OF HELL IS THIS BULLSHIT?",
            "title_similarity": "0.759688",
            "sentiment_compound": -0.9035
        },
        {
            "id": "hixw6e7",
            "score": 1,
            "text": "WTF companies do this?  \n\n\n\"I'm sorry you think you deserve an apology\".",
            "title_similarity": "0.63320744",
            "sentiment_compound": -0.6841
        },
        {
            "id": "hixwauv",
            "score": 1,
            "text": "Fuck if anybody ever asks me to write an apology letter lmao",
            "title_similarity": "0.64503807",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hixwjuc",
            "score": 1,
            "text": "doesn’t that violate the ADA? employees are allowed to use the bathroom as often or as little as possible.",
            "title_similarity": "0.48167974",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hixwlzc",
            "score": 2,
            "text": "This sounds… implausible.",
            "title_similarity": "0.061971948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixwwiq",
            "score": 1,
            "text": "I’ve been fired twice and can confidently say the last thing on your mind would be writing an apology letter for them. Best I can do is a sticky note with “KMA” written on it",
            "title_similarity": "0.7107496",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hixxa6t",
            "score": 1,
            "text": "The fact that there’s zero labour protection and a worker can be fired for “using the bathroom” too much is the much more concerning piece of info here.",
            "title_similarity": "0.73301136",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hixxamy",
            "score": 1,
            "text": "That’s fucked up, getting fired for bodily functions.  What’s next breathing too much on company time",
            "title_similarity": "0.7372049",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hixxmjz",
            "score": 1,
            "text": "If anyone asked this of me I would laugh in their face. Also, how often was he using the restroom?!",
            "title_similarity": "0.53945017",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hixxqxt",
            "score": 1,
            "text": "What idiot would write an apology letter to a company firing him/her, let alone for the reason of using bathroom too much lol.",
            "title_similarity": "0.8486344",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hixxwk7",
            "score": 1,
            "text": "Add me on snap marysmith4961",
            "title_similarity": "0.14780249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixxylb",
            "score": 1,
            "text": "Also: the police use this tactic to elicit confessions from young offenders, before they can get parents or lawyers involved. \n\nWhat happens is, they arrest a teenager for something dumb - say shoplifting - then they get them to the station and sit them down and say, “ok, we’re calling your mom now, and she’ll be here soon,” then after five minutes of awkward waiting they say “you know, we know what you did. If you want to help yourself, you can use this time we’re waiting to apologize. The court will take that into account.”\n\n…then the kid writes a confession in their own handwriting. \n\nIt’s vile, but it’s legal.",
            "title_similarity": "0.72183526",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hixybau",
            "score": 1,
            "text": "If you do anything for a company that is firing you, it’s pretty much on you",
            "title_similarity": "0.63654125",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hixyf5x",
            "score": 1,
            "text": "Sadly most people never mature past grade school.  Writing a letter of apology because HR asked you to is being treated like a child and willingly participating.  I got fired from a job once for getting a job with a competing company, and convinced them to pay ME a severance just to make me go away.",
            "title_similarity": "0.8505454",
            "sentiment_compound": -0.6118
        },
        {
            "id": "hixyf8c",
            "score": 1,
            "text": "Not exactly the same thing, but back when I was probably like 18, McDonald's made me write a letter saying that I was quitting without notice after they called me back in after a \"no call no show\" that was actually just me not showing up to a shift I was approved off for. My name was written on a calendar that they used to show approved off days. Looking back at it, the store manager probably wanted me to 'confirm' that I was quitting and didn't get fired for the new teenage supervisor's mistake to avoid any UI claims. I didn't think twice because it was McDonald's and by then I already had a better paying job lined up",
            "title_similarity": "0.81098366",
            "sentiment_compound": 0.893
        },
        {
            "id": "hixyge0",
            "score": 1,
            "text": "Jumping onto this don’t sign any disciplinary forms either because of the same reason OP mentioned.",
            "title_similarity": "0.37979153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hixylsc",
            "score": 1,
            "text": "....wait, can they actually do that?? \"using the bathroom too much\" sounds like a weak-ass excuse. it seems like a higher up was having a bad day and took it out on someone that couldn't fight back.",
            "title_similarity": "0.73121595",
            "sentiment_compound": 0.5178
        },
        {
            "id": "hixylsh",
            "score": 1,
            "text": "I've never heard of this either (in the US). That said, we are talking about Americans... the same Americans that were willing to sign a consent form to show their faces on Cops (TV show), while in the process of being arrested, because they thought it would benefit them legally. And of course Wal-mart, who is beneath nothing.",
            "title_similarity": "0.6663389",
            "sentiment_compound": 0.296
        },
        {
            "id": "hixypgg",
            "score": 1,
            "text": "Man, your friend is a moron. I mean, you'd have to be to stay at Walmart that long, but still. Also, more importantly, fuck that judge. You should call them out by name so we know who to avoid.",
            "title_similarity": "0.74252266",
            "sentiment_compound": -0.6786
        },
        {
            "id": "hixypty",
            "score": 1,
            "text": "Way back when I used to work for McDonald’s I hung out with some employees after a shift. I was tired as I just worked a double and had to be back in 8 hrs. But they wanted to smoke weed. We go to a park and get caught by police. It was basically all smoked so the cops couldn’t really charge us. Since I was napping in the car the police told me I had to drive everyone home as I was the only sober one.\n\nThe next day some how my general manager found out. He sat us all down and made everyone write a letter apologizing and for going against company drug policy etc.\n\nMy letter essentially consisted of “I’m not apologizing for something I didn’t do.”\n\nI was told to write it again and this time tell the truth. So I wrote the same letter but included how it was off the clock and not on company property. \n\nI was the only one of 4 that didn’t get fired. But I quit a few months later anyway.",
            "title_similarity": "0.77879506",
            "sentiment_compound": -0.6145
        },
        {
            "id": "hixz2lc",
            "score": 1,
            "text": "Wow, this is really helpful - thank you. Not exactly my situation, but I was once asked to apologise to a manager who came and yelled at me while I was in the staff kitchen on my break. My offence? Not displaying my swipe ID card (it was in my pocket). I stood up to her and was told I needed to write an apology email.\n\nI was a contractor with a vendor so they essentially told me if I didn't I couldn't come back on site. We had been working remotely previously and the client suddenly demanded we all had to work from site, which sucked anyway. I wrote the damned email and then immediately found another contract and bailed. But based on the above I now wish I had called them on it.",
            "title_similarity": "0.84508026",
            "sentiment_compound": 0.0073
        },
        {
            "id": "hixza1j",
            "score": 1,
            "text": "This sounds like something a school bully would ask you to do.",
            "title_similarity": "0.48306504",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hixzagy",
            "score": 1,
            "text": "I would also add before you even look like getting in trouble add a few lawyers to your phone contacts for when you end up in issues later. eg criminal, employment liability lawyers",
            "title_similarity": "0.47626543",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hixzpap",
            "score": 1,
            "text": "Canada passed a law saying that apologizing is not an admission of guilt. Everyone always laughs when this is brought up, yet here we are.",
            "title_similarity": "0.44357288",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hixzvrs",
            "score": 1,
            "text": "Well if they are in the process of firing you and ask you to do that you could say they were intimidating you and causing a hostile work environment then you can still revive unemployment",
            "title_similarity": "0.69988513",
            "sentiment_compound": -0.743
        },
        {
            "id": "hiy00b0",
            "score": 1,
            "text": "Yes they do this on your third strike to let you keep your job until they fire you later on. Then they use the letter against you. Most people just said they weren't writing a letter and got fired and then got unemployment.",
            "title_similarity": "0.85803187",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hiy02ah",
            "score": 1,
            "text": "I'm not sure how this is a LPT rather than COMMON SENSE. If you write a letter like that, you deserve the feedback!",
            "title_similarity": "0.323297",
            "sentiment_compound": 0.2095
        },
        {
            "id": "hiy03d0",
            "score": 1,
            "text": "Yeah, never sign any write-ups or any sort of disciplinary paperwork. Even if they say, 'you have to', 'it's just to acknowledge a meeting' or 'it doesn't matter if you sign or not, so you might as well.' Your employer is lining up their ducks in a row to fire you justly. They will not have to pay out unemploynent if you agree to havibg broken the employment contract. Always deny, deny, deny",
            "title_similarity": "0.7681439",
            "sentiment_compound": -0.6886
        },
        {
            "id": "hiy09z7",
            "score": 1,
            "text": "Never heard of this before. I would politely ask them to fu*k off.",
            "title_similarity": "0.45039386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy0bcd",
            "score": 1,
            "text": "I’m not sorry for saying this but your friend is a moron for doing that.\n\nSeriously I’d be LIVID if they fired me for something like that and then on top of that they expected him to apologize?! What kind of self respecting human would EVER do that?!",
            "title_similarity": "0.7579968",
            "sentiment_compound": -0.6466
        },
        {
            "id": "hiy0s7q",
            "score": 1,
            "text": "I worked at Walmart for 2 weeks and got fired for taking drinks out of the coolers up front. I didn’t think it was a big deal cause at my other job the boss doesn’t mind if we take drinks because of how much profit they make off of them. Well they called me in and fired me asked me to write a letter and I did because they said they normally would get the police involved but said they wouldn’t because I was honest with them. I don’t really care that I was fired because the job sucked.",
            "title_similarity": "0.8724661",
            "sentiment_compound": -0.2048
        },
        {
            "id": "hiy0uzp",
            "score": 1,
            "text": "Why would you do that",
            "title_similarity": "-0.009888178",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy0wnp",
            "score": 1,
            "text": "Why would anyone even consider writing an apology letter, or anything else, if the company is firing you?  If they're firing me, I'm not doing shit...",
            "title_similarity": "0.72674024",
            "sentiment_compound": -0.1719
        },
        {
            "id": "hiy0zhj",
            "score": 1,
            "text": "That's so shady and schemey that humans wrote up these tactics to use on other humans.",
            "title_similarity": "0.4213623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy1546",
            "score": 1,
            "text": "The correct response for anything asked after firing: \"I don't work for you anymore.\" if it includes anything that could be billable (assuming you want to do it, you can always just say no), add \"But my consultant rate is (previous hourly x 10-15) with a (long but reasonable time frame, but way more than enough to cover unemployment hire the entire duration you might be on it) minimum, paid up front, if you want me to take care of that for you.\"",
            "title_similarity": "0.67576563",
            "sentiment_compound": 0.09
        },
        {
            "id": "hiy18zk",
            "score": 1,
            "text": "Sorry I had to use the bathroom to take a shit and didn't just do it on the store floor. Companies are literally fucking taking away peoples rights to piss and shit. Fucking low.",
            "title_similarity": "0.83433914",
            "sentiment_compound": -0.9117
        },
        {
            "id": "hiy1eev",
            "score": 1,
            "text": "What in the hell, how arecorporate apology letters so common!?",
            "title_similarity": "0.41578126",
            "sentiment_compound": -0.69
        },
        {
            "id": "hiy1g8g",
            "score": 1,
            "text": "Apologize? LOL, is this a thing?",
            "title_similarity": "0.16759147",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hiy1v0x",
            "score": 1,
            "text": "Say I ain’t signin shit and leave",
            "title_similarity": "0.28919974",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hiy2czp",
            "score": 1,
            "text": "This sounds awfully American.",
            "title_similarity": "0.1285422",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy2e55",
            "score": 1,
            "text": "I worked for a school and one coordinator tried her best to get me fired by sabotaging my workload and messing with my documentation. At the end of it she convinced the director that my work performance was not to par with my agreement and they dropped my contract. As a part of the process they wanted me to write a letter of resignation i assume for this reason.\nI wrote my letter and implicated the coordinator in her activities trying to get me fired and the coordinator looking the other way and numerous other points about how they made my workplace seem hostile, including where the documentation is located. I submitted it to the school board, teachers and staff. When my unemployment claim processed, there were  numerous investigations happening and both of them were also let go.\nSo it can go both ways if played right",
            "title_similarity": "0.84374875",
            "sentiment_compound": -0.34
        },
        {
            "id": "hiy2emd",
            "score": 1,
            "text": "Lol.. I'm trying to imagine living in a country so shit that unemployment could ever be denied to someone.\n\nWe pay our taxes. Unemployment is a basic human right.",
            "title_similarity": "0.5627022",
            "sentiment_compound": -0.9038
        },
        {
            "id": "hiy2o15",
            "score": 1,
            "text": "Are you vaccinated",
            "title_similarity": "0.09405221",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy2tz5",
            "score": 1,
            "text": "Sure, I'll write that letter after a 5x raise and a 3 year no termination contract.",
            "title_similarity": "0.44943938",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hiy2uij",
            "score": 1,
            "text": "first off that's wrongful termination.  using the restroom is a need. and it is required by law to allow even inmates the luxury of proportion potty time.",
            "title_similarity": "0.6702162",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hiy36vk",
            "score": 1,
            "text": "an even better LPT -- as an adult, never admit guilt. ever.",
            "title_similarity": "0.3340319",
            "sentiment_compound": 0.4805
        },
        {
            "id": "hiy3g6k",
            "score": 1,
            "text": "... some people in management that come up with shit like this need to get chased out of the workforce for good... with a whip",
            "title_similarity": "0.70367146",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hiy3xse",
            "score": 1,
            "text": "I really hope he boosted a ton of merchandise after that.",
            "title_similarity": "0.2918135",
            "sentiment_compound": 0.7146
        },
        {
            "id": "hiy3zec",
            "score": 1,
            "text": "Fired for using the bathroom too much? Sounds like Walmart doesn't like basic human rights. Hope he sued them.",
            "title_similarity": "0.8272077",
            "sentiment_compound": -0.0798
        },
        {
            "id": "hiy4afe",
            "score": 1,
            "text": "This is a tough one. If that happened to me I honestly have no idea what my response would be. I’d either laugh uncontrollably with my head on the table, or tell them to go fuck themselves and write an apology afterward.",
            "title_similarity": "0.6166239",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hiy4dfb",
            "score": 1,
            "text": "I had a manager ask me to sign a disciplinary letter in front of HR without having the ability to ask questions on the matter. I refused. After further investigation HR pointdly told me it was smart not to sign it.",
            "title_similarity": "0.7883427",
            "sentiment_compound": -0.0931
        },
        {
            "id": "hiy4npp",
            "score": 1,
            "text": "An apology letter? Is this grade school?",
            "title_similarity": "0.35800368",
            "sentiment_compound": 0.1431
        },
        {
            "id": "hiy4o4m",
            "score": 1,
            "text": "I worked at walmart back in 2001-2003ish. I didn't get my planogram set in time and my manager wanted to 2 page essay about why I didn't get it done and how I plan to fix that in the future. I walked right out and never went back. I didn't know that was a thing, and just thought my manager was a douche. Yikes.",
            "title_similarity": "0.85724986",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hiy4y3y",
            "score": 1,
            "text": "Are you sure this is the whole story?\n\nHe might be telling you he got fired for spending too long on his phone in the bathroom, but that seems a little suss if he was supposed to be in line for getting a promotion.",
            "title_similarity": "0.80254936",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hiy4y4e",
            "score": 1,
            "text": "Okay so the company are still the obvious bad guys in this story but dear lord please tell me your friend was 16 or in the midst of recovering from a TBI or something because that's a phenomenally stupid thing to do.",
            "title_similarity": "0.7532104",
            "sentiment_compound": 0.6428
        },
        {
            "id": "hiy52r9",
            "score": 1,
            "text": "Wtf I have NEVER heard of this.",
            "title_similarity": "0.236171",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hiy571o",
            "score": 1,
            "text": "anyone who has to be told this doesn't deserve the help.",
            "title_similarity": "0.3849465",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hiy59g9",
            "score": 1,
            "text": "Excuse me, what? If you're already firing me, what the fuck could possibly incentivize me to write you a goddamn apology? Are these people stu-\n\n... on second thought, yes, they definitely are stupid.",
            "title_similarity": "0.72056156",
            "sentiment_compound": -0.782
        },
        {
            "id": "hiy5fxg",
            "score": 1,
            "text": "why do we just want to bleed each other dry as humans?",
            "title_similarity": "0.4478889",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hiy5xnn",
            "score": 1,
            "text": "If anyone ever tells you to sign something...don't.\n\nThe only exception is where signing provides you with a benefit that you *clearly* understand.\n\nThe one that might trip people up is traffic tickets.  In general, you are signing only to accept that the ticket has been given to you and that you will at least appear in court to defend it (recognizance).  The benefit here is that you get to go home instead of being held in custody until you appear in court or until someone else provides recognizance (which again is a benefit that you will have to sign for).\n\nIf you are dismissed from a job or quit, they'll have a whole bunch of stuff that they would love for you to sign:  non-competes, assumptions of liability etc.  Very little of that of that is to your benefit.",
            "title_similarity": "0.47412258",
            "sentiment_compound": 0.9623
        },
        {
            "id": "hiy6gcc",
            "score": 1,
            "text": "Ya'll ever watch The Wire Season 1? Classic Bunk Moreland move.",
            "title_similarity": "0.30058488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy6h0d",
            "score": 2,
            "text": "I've never heard of this happening. Who asks to you apologize, and for what?",
            "title_similarity": "0.42373836",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hiy6qtu",
            "score": 1,
            "text": "How about instead you write \"Hey all of you people at (blank), go fuck yourself!\"",
            "title_similarity": "0.5545161",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hiy6y47",
            "score": 2,
            "text": "I’ve never heard of a company doing this… once you’ve been fired, don’t do anything they ask of you period. Professionally if you’ve been fired, say thank you for the opportunity and leave immediately with your stuff.",
            "title_similarity": "0.7363739",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiy7t6p",
            "score": 1,
            "text": "Laid off, not fired.  The words actually matter, A LOT.\n\nIf you are fired you're not getting unemployment, if you are laid off you can get it.  Not sure of any states give it out for someone terminated with cause (fired)",
            "title_similarity": "0.7015371",
            "sentiment_compound": -0.5764
        },
        {
            "id": "hiy7tzl",
            "score": 1,
            "text": "They'll do this even if they've already reported you to the police, if y'all are at such a point, and they'll give the police the letter your wrote.",
            "title_similarity": "0.46249244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy7wsj",
            "score": 1,
            "text": "Oh yeah. That's exactly my case. In May I was applying for this company, overall it's a quite big one. Then I started on job in Sept. In 2 months of probation, I was gradually realizing why people in the position left. The boss is horrible. Overall, other people and other departments are good enough (or I think so), but my dept, it's just a sh\\*thole. People do not have any idea what they are doing because of that boss. All the days we just fix the problem that led by her decision. But the nice thing is, she just screams at us. wth? other people having family and kids, that's why they cannot leave bc the salary is good. But not me, I'll take the risk that the next job could be worse with lower pay, but it could be vice versa as well. So after 2 months, I decided to leave.\n\nThe boss called me last night and said that I am just a f\\*cker and I should apologize her and all the company immediately. She mentioned that I must have remembered why the first interview was in May and how hard she tried to have me in the team in Sept. Lol she didn't know that I know: that's a trick to her boss. I said hey the contract says that I could leave 1 week before the probation ends, and she has no right to keep me. Start moaning that means there's a lot of job for her to do. Turns out since I started, all thing she does is... nothing. Other people sharing that with me once they know that I'm leaving. And now she's trying to make me feel guilty because now she has to work.",
            "title_similarity": "0.83632296",
            "sentiment_compound": -0.9567
        },
        {
            "id": "hiy7yfd",
            "score": 1,
            "text": "Another reason for unions",
            "title_similarity": "0.098501235",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy845x",
            "score": 2,
            "text": "LPT: Don't work for a company that would even ask you to do this in the first place.",
            "title_similarity": "0.49226892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiy84y2",
            "score": 3,
            "text": "Lol, apology letter? Who would actually be like \"Yea sure thing boss, ill write one up right now.\" I'd dip my balls in ink slap them on the paper and hand them it.",
            "title_similarity": "0.58160025",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hiy85c6",
            "score": 2,
            "text": "Looks like your friend was also ignorant of the term, \"duress.\"  \nThat apology letter would be void.",
            "title_similarity": "0.57240885",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hiy8huq",
            "score": 1,
            "text": "Don't ever sign shit. What are they gonna do fire you?",
            "title_similarity": "0.6129849",
            "sentiment_compound": 0.1341
        },
        {
            "id": "hiy8l7v",
            "score": 2,
            "text": "Who the fuck would write a letter of apology when they're being fired? xD",
            "title_similarity": "0.71362156",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiy8lr0",
            "score": 2,
            "text": "I've never heard of anyone at any company being asked to write a letter apologizing to the company. What kind of shit is this? And Walmart?..",
            "title_similarity": "0.64728177",
            "sentiment_compound": -0.676
        },
        {
            "id": "hiy8zs6",
            "score": 1,
            "text": "Can someone explain why the majority of WalMarts aren't unionized already? Asking for a friend... :)",
            "title_similarity": "0.5686297",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hiy91fp",
            "score": 1,
            "text": "Who the fuck would apologize?! They’re firing you! Fuck em!",
            "title_similarity": "0.6314103",
            "sentiment_compound": -0.8713
        },
        {
            "id": "hiy9hda",
            "score": 1,
            "text": "If y'all are falling for shit like this then don't ever let a cop pull you over!",
            "title_similarity": "0.6262082",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hiy9i5d",
            "score": 1,
            "text": "A co worker of mine was recently called into the sales managers office. He was given a written notice for termination and they made him sign in. I wonder if he didn’t sign it if he’d be better off. I don’t think I would have signed. Now they have grounds to fire him over anything small basically.",
            "title_similarity": "0.863503",
            "sentiment_compound": 0.128
        },
        {
            "id": "hiy9ka0",
            "score": 1,
            "text": "Wow, fuck Wal-Mart. Thanks for the tip!",
            "title_similarity": "0.4380837",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hiy9n2i",
            "score": 1,
            "text": "Rule #1 - Always blame others.",
            "title_similarity": "0.4367621",
            "sentiment_compound": -0.34
        },
        {
            "id": "hiy9ym6",
            "score": 1,
            "text": "Never heard of any company ever requiring this",
            "title_similarity": "0.32211977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyaqv3",
            "score": 1,
            "text": "I always ask for their reason for terminating me in writing, signed and dated.\n\nThis way if they try to tell unemployment any reason other than what they wrote there, unemployment will go with the termination letter's reason. Unemployment requires that you be terminated for no fault of your own (in my state anyways, don't know if that's a federal thing?).\n\nIt's super helpful in case they try to change their story or deny your unemployment claim.",
            "title_similarity": "0.71537703",
            "sentiment_compound": -0.6177
        },
        {
            "id": "hiyaqxg",
            "score": 1,
            "text": "I’ve never heard of this before. A company firing someone and asking them to write a letter of apology (for whatever reason) in the process of it?? Why would anyone do that??",
            "title_similarity": "0.80017424",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hiyavan",
            "score": 1,
            "text": "I have been screwed In both directions.\n\nIt sucks seeing guys more skilled and harder working than me, working for less than they're worth.\n\nFor lots of reasons they can't tell their boss to properly break them off or go fuck themselves. For my dad, it was my sister and I. For some friends, it's felony charges, or parole. Others it's a green card.\n\nEmployers pick these guys up and work them like dogs for starvation wages. You want to get looked at sideways? Walk into the office and say \"We can afford to pay our guys more.\"\n\nIt's inconceivable to mfs that instead of making sure we make a killing; we might make sure everyone keeping this shit show on the road has enough to eat.",
            "title_similarity": "0.7817738",
            "sentiment_compound": -0.9289
        },
        {
            "id": "hiyaymt",
            "score": 1,
            "text": "i've never seen or heard of  this. is this made up?",
            "title_similarity": "0.2313244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyb1a8",
            "score": 1,
            "text": "I’ve never heard of this ever",
            "title_similarity": "0.20454344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiybc04",
            "score": 1,
            "text": "What would happen if I just didnt didn’t pay back that unemployment? L\n\nAlso, why the FUCK would they have you write a letter to the company, and why would you comply? What would they do if you don’t, fire you???",
            "title_similarity": "0.78359437",
            "sentiment_compound": -0.7553
        },
        {
            "id": "hiybcaf",
            "score": 2,
            "text": "Excuse me, what?\n\nHonestly USA, you guys need to revolt.",
            "title_similarity": "0.43656042",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hiybym8",
            "score": 1,
            "text": "lol what?  What company asks for this?  This is like some when some guy who shouldn't be a boss starts a small company, hires people who are too young and inexperienced because he's cheap, then power trips up and down.  Then some fuck up happens because he's a control freak and they aren't mind readers, he asks them to write a letter apologizing.  Also the business is some rent seeking borderline illegal middleman type shit.",
            "title_similarity": "0.8091773",
            "sentiment_compound": -0.8738
        },
        {
            "id": "hiyc8ra",
            "score": 2,
            "text": "Man what the fuck is with this precedent. We all know in reality that apologising is often a knee jerk reaction and isn't an admission of guilt at all - why does it work that way in the legal system?",
            "title_similarity": "0.6203381",
            "sentiment_compound": -0.743
        },
        {
            "id": "hiycg7z",
            "score": 3,
            "text": "\"I'm sorry your company is abusing its workers\" - My formal apology.",
            "title_similarity": "0.71234673",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiycgeu",
            "score": 1,
            "text": "Wish I would have known this...... before this afternoon :(",
            "title_similarity": "0.31918344",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hiycggf",
            "score": 1,
            "text": "That is one of the most walmart things I have read in a while",
            "title_similarity": "0.37833297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyckym",
            "score": 1,
            "text": "How about a piece of paper that just reads “no”?",
            "title_similarity": "0.1149231",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiycux0",
            "score": 2,
            "text": "Most companies who offer severance packages are actually juking the system too. Basically it’s a way to keep their unemployment tax low. The company’s unemployment tax rate is based off of how often their ex employees file for and receive it.\n\nSeverance is considered income from the company and you don’t qualify for unemployment until after you’ve waited out the comparable time it would take to earn that amount of money. \n\nIf they give you just enough for what the average market takes to find a new job you’re less likely to file and receive the benefit. This reduces the tax for all their employees.",
            "title_similarity": "0.7138264",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hiyd0ob",
            "score": 1,
            "text": "This sub is weird as fuck man",
            "title_similarity": "0.27543598",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hiyd0sk",
            "score": 1,
            "text": "Who would write one of just laugh in their face",
            "title_similarity": "0.24312143",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hiydrlu",
            "score": 1,
            "text": "I didn't know that was a thing. Noted.",
            "title_similarity": "0.08334551",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyfdik",
            "score": 1,
            "text": "apology for WHAT, exactly? choosing your life over killing your self at WalMart?",
            "title_similarity": "0.6597763",
            "sentiment_compound": -0.6767
        },
        {
            "id": "hiyfu0z",
            "score": 1,
            "text": "Apology letter. That’s a first.",
            "title_similarity": "0.09766567",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hiyghbm",
            "score": 1,
            "text": "Worked at TSA. Had a ticket for running a stop sign and kept asking for days off-Denied. So on the last day possible for court, the leave chit was denied again. Told my supervisor that I would not be in and Didn't show for work due to court. Another supervisor told me that she was going to write me up. Asked how long I had to respond in writing to the write up. She didnt know. So when they finally got the paperwork in order, I handed in a type writen statement with the facts and why I was a no show after 7 different days requesting time off for court.  Never heard another word about it! Quit soon after because is they treat you like that for court, imaging how they are going to treat you for a family issue! Please be kind to TSA agents, they are the wait staff of the airline industry and work very hard for peanuts!",
            "title_similarity": "0.8427421",
            "sentiment_compound": 0.7417
        },
        {
            "id": "hiygiry",
            "score": 1,
            "text": "He must've been unrepresented.  Any lawyer would have that letter thrown out.  The company was obviously leveraging the potential non-fire and his desperation of needing employment to get him to write it.",
            "title_similarity": "0.74150515",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hiygm3m",
            "score": 1,
            "text": "walmart sounds really desperate to fuck over a guy like that",
            "title_similarity": "0.61984736",
            "sentiment_compound": -0.5936
        },
        {
            "id": "hiyhqko",
            "score": 1,
            "text": "They tell me I'm about to get fired they can lick deez nutz",
            "title_similarity": "0.58525056",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hiyhrkl",
            "score": 1,
            "text": "What is \"using the bathroom too much?\"",
            "title_similarity": "0.35071194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiyi77t",
            "score": 1,
            "text": "What kind of idiotic company would ask people to do that? I’d fucking tell them to take a hike. It is always their fault. \n\nThat’s like saying. “Brianna was mean to you. But you kind of caused her to be that way. Hi say you’re sorry.”  \n\nFuck no. \n\nIf any company ever even thinks to ask you to do something like this, they live in crazy town.",
            "title_similarity": "0.78286064",
            "sentiment_compound": -0.799
        },
        {
            "id": "hiyihe5",
            "score": 1,
            "text": "What advantage does letting an employee know they are going to be fired have? Last two jobs I got fired from I was escorted out.",
            "title_similarity": "0.7351464",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hiyj5n1",
            "score": 1,
            "text": "As soon as you know you are about to be fired the best bet is to walk away immediately. Don’t even talk or anything. Just walk away.",
            "title_similarity": "0.5778086",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hiyjpgv",
            "score": 1,
            "text": "What if you sign anything prior as a disciplinary action.\n\nCan this be used against you eventually if you get fired down the line",
            "title_similarity": "0.604586",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hiyjx2t",
            "score": 1,
            "text": "In NJ you own all of the unemployment, so even if you quit you can still collect although you can't immediately collect of you quit vs fired.",
            "title_similarity": "0.5538825",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hiyjzg4",
            "score": 1,
            "text": "Finally a pro tip thats not some inane common sense like not eating yellow snow that everyone knows",
            "title_similarity": "0.40106344",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiykgfu",
            "score": 1,
            "text": "I swear…half this sub’s posts are low-key unemployable millennials. I wouldn’t ever think about how to make an “unemployment” case. Where the fuck is the unemployment office in my town? I simply don’t think like this.",
            "title_similarity": "0.7081299",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hiykkqi",
            "score": 1,
            "text": "Why in the hell would anyone do this if they were being fired?",
            "title_similarity": "0.5559777",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hiykpep",
            "score": 1,
            "text": "If a company fires me, then asked ME to apologize for getting fired, the person who asked me would never be able to forget the disgusting words I would shout at them.\n\nI would actively try to make a person cry who told me to apologize after getting fired.\n\nBig Fuck That.",
            "title_similarity": "0.8267767",
            "sentiment_compound": -0.9432
        },
        {
            "id": "hiykxx0",
            "score": 1,
            "text": "What the hell? Someone would actually do this? Why would you ever need to appologize?",
            "title_similarity": "0.3272588",
            "sentiment_compound": -0.7303
        },
        {
            "id": "hiylkql",
            "score": 1,
            "text": "Are you sure your friend isn’t leaving some details out?",
            "title_similarity": "0.25514147",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hiylsbc",
            "score": 1,
            "text": "I had an employer ask me to apologize for not coming into work without enough notice when I texted him at 3am since I was vomiting all night.\n\nI asked him what I was supposed to be apologizing for and then refused his answer and that was that. I quit that job a few months later since I was going back to school, but I never got fired.",
            "title_similarity": "0.811693",
            "sentiment_compound": 0.5165
        },
        {
            "id": "hiylt7l",
            "score": 1,
            "text": "A lifetime ago I worked for Goodyear as a delivery driver. I was put on warehouse duty for “taking too long on a route”, supposedly you should be able to make a 400+ miles routes in 5ish hours. Either way, the manager suspended me a short time later to “write a letter” demonstrating what I had learned and promising I would do better. I basically told him to fuck himself, I was fired “out of the blue” about 3 weeks later for an “unrelated” matter that never actually happened.\n\nI also worked for walmart and was fired for “missing too many days” when I refused to drop out of school to be forcefully moved to 3rd shift from 1st shift. I was covered under FMLA for the absences, I did not fight the termination and laughed to the bank with the settlement. To this day I avoid Walmart unless it’s absolutely necessary for me to go to Walmart. The way they treat their employees along merits my boycott.",
            "title_similarity": "0.8485827",
            "sentiment_compound": -0.7443
        },
        {
            "id": "hiym4m6",
            "score": 1,
            "text": "I would have handed the a Doctor's note that says for medical reasons I'm allowed to use the washroom when, as often as needed.",
            "title_similarity": "0.42528963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiymde7",
            "score": 1,
            "text": "America is wild lol",
            "title_similarity": "0.11582746",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hiymf1n",
            "score": 1,
            "text": "I worked at Walmart and forgot they did this. They accused me of some BS that their \"witnesses\" couldn't agree on who actually did it. I just wrote some BS and got another job next week. It all makes sense now",
            "title_similarity": "0.81069165",
            "sentiment_compound": -0.5122
        },
        {
            "id": "hiymiya",
            "score": 1,
            "text": "why would anyone willingly write a letter of apology to a company they worked for that is in the process of firing them? fuck that",
            "title_similarity": "0.78816533",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hiymw4n",
            "score": 1,
            "text": "Major companies train their managers on how they can, and cannot fire. It’s why I’m not a manager anymore.",
            "title_similarity": "0.57401013",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hiyn4ov",
            "score": 1,
            "text": "Best Buy tried to get me to sign paperwork for helping physically MOVE a TV someone else picked and it being the wrong, and more expensive TV. \n\nI refused and got to hear for nearly an hour in a 5x10 office with 4 people in why I was going to get let go for not acknowledging my fuck up. \n\nTo this day is one of the only times I’ve gotten to use “are you finished” on someone. \n\ntl; dr; I didn’t get fired or written up, signed nothing and even saved the other employee by going behind managements back and calling the customer to ask if they would bring the TV back to which the customer was more than happy to do because, shocker, not everyone is an unethical scumbag. \n\nFuck retail. Fuck retail managers. Fuck Black Friday.",
            "title_similarity": "0.7974895",
            "sentiment_compound": -0.9486
        },
        {
            "id": "hiyndak",
            "score": 1,
            "text": "Writing an apology letter to your employer?? what is this, kindergarten??",
            "title_similarity": "0.6314702",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hiynuhf",
            "score": 1,
            "text": "Why the fuck do they even care?",
            "title_similarity": "0.20778659",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hiynxnw",
            "score": 1,
            "text": "I've never heard of a letter of apology. Usually it's just a piece of paper asking you to waive your rights and usually you're too emotional to think clearly when they do it.",
            "title_similarity": "0.5594924",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hiyobcn",
            "score": 1,
            "text": "I didn't have to write a letter but I had to sign some paperwork when I was fired. Worked at Wholefoods for 4yrs in Seafood and got fired for the dumbest shit. Pretty sure is just signed something to cover their asses. For those curious I was fired to using \"warm\" water for cleaning a fish I was fillet for a customer. I've been doing it like this since I started in Seafood 2yrs ago. My Team Leader and Assistant Team Leader both seen me do it this way for years and said nothing. We got a new store leadership who said that was a food safety violation. Okay I won't do this anymore... Well when your trained to do something WRONG FOR 2YRS its hard to break that habit. Got really busy by myself and slipped up. Came in the next day to be fired.",
            "title_similarity": "0.8371668",
            "sentiment_compound": -0.9666
        },
        {
            "id": "hiyobla",
            "score": 1,
            "text": "I've NEVER heard of a company asking an employee to write an apology letter to the company.",
            "title_similarity": "0.5858728",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hiyocel",
            "score": 1,
            "text": "Wait wait wait WAIT. There are companies that as for a LETTER OF APOLOGY for firing you? YOU'RE firing me, YOU apologize! And I want it in cursive!",
            "title_similarity": "0.75990546",
            "sentiment_compound": -0.412
        },
        {
            "id": "hiyojmr",
            "score": 1,
            "text": "A good idea when asked to sign anything at work is to ask for a copy to take to your lawyer for advice before signing. This has worked a treat for me twice.",
            "title_similarity": "0.46984968",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hiyoyk1",
            "score": 1,
            "text": "Honestly if I have the savings, then the satisfaction of resigning first is always worth it.",
            "title_similarity": "0.32499248",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hiyp00b",
            "score": 1,
            "text": "They did this to me when I was 18. Manager had it out for me. Jokes on him. Sam’s club closed.",
            "title_similarity": "0.6972481",
            "sentiment_compound": 0.25
        },
        {
            "id": "hiypws4",
            "score": 1,
            "text": "I got put on a PIP (Process improvement Plan) for a cell phone insurance company. Because I did not hit 100% because I refused to ask people to take a survey at the end of a call. I worked 2nd tier in a department that troubleshoot phones and had developed from the beggining the representatives for the team. Every other metric was being met and customers were satisfied and would generally end up getting their phones replaced or I solved their problem. Usually because you had forgotten how you had set up your phone when ypu got it. Unless you were a supreme dick and I noted what you said and let higher ups deal with your bullshit. Overriding my decision because well higher ups don't want to deal with the dick again. I do not believe in satisfaction surveys never have never will. When a client is already pissed off it will always scew towards the negative. After the PIP I did everything by the book for 3 months. Got 100% QA. Got my raise of 4k US a year. About a month after that brought into a meeting with my fellow co 2nd tier with a bunch of people I knew I had no reason to be in a meeting with and laid off. They actually had the gaul to ask me to train my replacements. Ended up with a good severance package. Moral of the story no matter how much you put into a corporation they are never going to give you what you earned. Many stories from that place. Bottom line I will be a greeter at WM before I ever go back into call center work again. I belive I was let go due to lack of Bachelors Degree. Another moral. No matter how intelligent you are no higher up who doesn't know you will ever give you a chance.",
            "title_similarity": "0.7597307",
            "sentiment_compound": -0.9057
        },
        {
            "id": "hiyr0ps",
            "score": 1,
            "text": "Same thing in a car crash. My mother is polite to a fault and she ended up getting ripped off on her insurance claim once because even though the guy hit her, she had apologized on the police report. She still has the dent in her door to this day",
            "title_similarity": "0.74809194",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hiyr3b0",
            "score": 1,
            "text": "But why would the company care if you get unemployment or not? It doesn't come out of their pocket. I would assume it's to prevent you from suing for wrongful termination. The unemployment is just a byproduct.",
            "title_similarity": "0.65046024",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hiyrwa1",
            "score": 1,
            "text": "Why you would write a letter of apology to ANYONE for using the bathroom is beyond my understanding...are you sure that was all it was, OP? It's illegal to fire someone for a disability, which could include using the bathroom longer than average. Your friend should be less worried about unemployment and more worried about suing Walmart for discrimination.",
            "title_similarity": "0.7717544",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hiys17m",
            "score": 1,
            "text": "If I'm getting fired, they can't ask for a damn thing from me.",
            "title_similarity": "0.56741774",
            "sentiment_compound": -0.743
        },
        {
            "id": "hiys17v",
            "score": 1,
            "text": "Maybe I've just been seething with anger for too long at this point, but to me an employer even asking this is unfathomable.\n\n\nSomebody actually writing the apology? That's something else entirely...",
            "title_similarity": "0.70227146",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hiys9sw",
            "score": 1,
            "text": "Shouldn't apologize for offending someone for similar reasons. Especially when debating online since they will take it as an admission of guilt and strengthen their position. Kind of sad to see the same thing happening in corporate business.",
            "title_similarity": "0.6691122",
            "sentiment_compound": -0.1991
        },
        {
            "id": "hiysljy",
            "score": 1,
            "text": "Why would anyone feel compelled to apologize to a company when they get let go?",
            "title_similarity": "0.65689564",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hiysvq6",
            "score": 1,
            "text": "Second hand info for an extremely unlikely situation…. Nobody needs this “tip.”",
            "title_similarity": "0.320289",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hiyswmz",
            "score": 1,
            "text": "Years ago in the dark ages of Blockbuster slowly dying in the embers of their own hubris.. I was \"under investigation\" of theft from the company for allowing a customer to manipulate a poorly worded sale that allowed them to get a free gift card for buying previously viewed movies... And then they'd turn around and use the gift card to buy more movies and get more gift cards... See I live in a state where you have to abide the terms of the advertisement and there was ***nowhere in the documentation*** anything about the customer being limited in anyway. This was pointed out to me by the customer and because I wasn't paid enough to give a shit, and because she ended up spending something like $500 on movies literally no one would ever buy (some were on our shelves when I started working there 5 years prior), I just went along with it.\n\nApparently, *that meant I stole from blockbuster* and after their investigation, they determined that I'd simply pay them back. They handed me a form basically solidifying that I pay them back. I asked the manager if I signed that would I be allowed to keep my job, she said yes. I signed. She uncovered my pink slip from beneath a stack of papers. I tore that contract up into a dozen pieces and told her I accept my resignation and fucked out of there.\n\nI was working for another company in the span of a week.\n\nFunny thing was, I continued to get commissions from blockbuster every two weeks for another year because I was damn good at my job and they were shit at paying for it.",
            "title_similarity": "0.7805545",
            "sentiment_compound": 0.9558
        },
        {
            "id": "hiytoat",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15071146"
        },
        {
            "id": "hiytqui",
            "score": 1,
            "text": "Unless YOU are absolutely resigning, don't write shit for HR.\n\nMy old clinic decided that I wasn't running my sedation cases and discharges fast enough and because of that, they wouldn't be extending my probation period.\n\nThing was, I was meeting and exceeding admit, case, and discharge times listed in the employee manual.  When I point blank asked them where I was too slow and what I could change to go faster, after countering some of their bullshit claims, they couldn't come up with anything.\n\nThe manager came up to me after we discussed everything and agreed that they were full of shit but fuck this place, asking me for a letter for HR \"letting them know when your last day will be.\"\n\nI wrote the letter but got a strange vibe, so I made sure to outline the details about how they claimed I wasn't fast enough regardless of meeting listed expectations, etc etc.\n\nWhat I should have done was not wrote anything.\n\nHR told unemployment that I had resigned.  The letter specifically said that I was not choosing to resign, rather I was not being left with any options.\n\nThe letter should have been clear that it was not a resignation letter, but the UI adjuster hated his job and just rubber stamped a rejection on my claims.\n\nI had to take it to a hearing before a judge.  \n\nI was me vs my manager, supervisor, and their hired agent (worked with the clinic's UI/work comp company or something)... What the fuck?\n\nThen it got strange.  Neither the manager or supervisor called in.  A few minutes into the call with the judge, the agent interrupted and apologized then said he was being instructed to leave the call.\n\nSo now it was me and the judge.  She listened for a bit and told me I would get a written decision within a couple days.\n\nCouple days later my UI was approved.  In Washington, if you quit IN LIEU OF BEING FIRED you can claim unemployment.  If you quit IN ANTICIPATION OF BEING FIRED you can't.\n\nThe rub was that they had already told me they were planning on firing me unless I met their nebulous, undescribed excess requirements (remember, I'm already meeting requirements as outlined in the manual).\n\nI remember one of the doctors I worked for coming up to me and saying he had really enjoyed working with me and would miss me.  Then he poked his head out into the hall and came back.  He shook my hand, stopped, grabbed it with his other hand, and gave me a serious look.\n\n\"I just really want you to know something.  They never asked for my opinion about you and your work.  You deserve to work somewhere better than here.\"\n\nThat clutched it.  I had a feeling that two of the higher up docs had personal issues with me (I apparently told one of them \"no\" or \"stop\" too often when he was trying to cut corners on patient sedation by starting endoscopy cases before the sedation was established; the other I flat out asked \"to stop being a jerk\" in front of everyone because he was \"teasing\" me).\n\nOver all, I later found out that nothing I did mattered because Chief Prick was apparently angry that I was \"the exact opposite of what he wanted in a new nurse\" (I was 325 lbs and 6'2 with a fantastic beard.  He was hoping to get some young female nurse on the floor.)\n\nSo ya, fuck that place.  Never write jack shit for HR.\n\nOh, BCC all your emails to your personal account as well.  If I had, I'm pretty sure I could have had a sexual discrimination case because they cut my hours when the two dicks were working because they didn't want to work with me but the official claim was that no procedure room was allowed to be all-male.",
            "title_similarity": "0.81613815",
            "sentiment_compound": -0.98
        },
        {
            "id": "hiyulz8",
            "score": 1,
            "text": "If they're in the process of firing you and ask you to do anything, don't.\n\nWhat are they gonna do? Fire you?",
            "title_similarity": "0.6157117",
            "sentiment_compound": -0.6322
        },
        {
            "id": "hiyut12",
            "score": 1,
            "text": "Apologize for using the bathroom. Your friend needs to take some online courses on critical thinking",
            "title_similarity": "0.557428",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hiyw4cy",
            "score": 1,
            "text": "If my workplace is in the process of firing me I sure as shit am not doing any writing assignments for them.",
            "title_similarity": "0.65887094",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hiywvzz",
            "score": 1,
            "text": "Who would be dumb enough to do this after being fired lmao",
            "title_similarity": "0.6112361",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hiyxcye",
            "score": 1,
            "text": "It’s so weird how many people don’t get unemployment. We had video of our employee coming in, logging in, and leaving for the day, another time blocking video cameras before some product in front of the cameras got dropped to the ground and destroyed… and he admitted all this plus insubordination in a telephone hearing and was STILL awarded his unemployment.  It was crazy",
            "title_similarity": "0.88097847",
            "sentiment_compound": -0.8268
        },
        {
            "id": "hiyxel1",
            "score": 1,
            "text": "TIL that this is a thing. \n\nI could see how some people may fall for this, but with age comes wisdom. I'd tell them let me consult with legal counsel before signing something like that. Even if I was bluffing.",
            "title_similarity": "0.5153586",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hiyy1gc",
            "score": 2,
            "text": "Hold up. Who the fuck apologizes to a company when being fired?",
            "title_similarity": "0.74273473",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hiyz24c",
            "score": 1,
            "text": "I'm sorry, I don't remember the events because I have been addicted to drugs and was trying to get clean.  I told my manager i was looking for treatment a day or two before they fired me.",
            "title_similarity": "0.8025406",
            "sentiment_compound": -0.296
        },
        {
            "id": "hiyz5ep",
            "score": 1,
            "text": "I was injured by hot oil to my left eye, manager said I can take a leave with pay until I recovered.\n\nAt first he cut my overtime which was hugh and days later cut more from my salary and never late bonus.\n\nI quit the next day and got better job with better pay at the restaurant around the corner.\n\n3 months later my old place shut down.\n\nThe owner knew what happen so he gift me 1 knife and 2 whetstones.\n\nOld manager went back to his homeland. Many ex workers told me he has throat cancer XD\n\nMy life lesson, dont let anyone do this kind of shit to you.\n\nStand and fight.",
            "title_similarity": "0.85381407",
            "sentiment_compound": -0.7982
        },
        {
            "id": "hiyzsu3",
            "score": 1,
            "text": "My God,  there is no other employee in any other country in the world that would be this fucking stupid",
            "title_similarity": "0.45851696",
            "sentiment_compound": -0.5849
        },
        {
            "id": "hiz0lps",
            "score": 1,
            "text": "There's a certain level/form of non compliance that pays. Always maintain that level.",
            "title_similarity": "0.21518804",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hiz0nyx",
            "score": 3,
            "text": "Why would you apologize for getting fired? It sounds like your friend needs to use the old noodle a little more",
            "title_similarity": "0.6672863",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hiz0onu",
            "score": 3,
            "text": "Law enforcement does this too. \"Just write a letter apologizing to the people for breaking into their home and they'll drop the charges\", except in a lot of places the victim doesn't get to decide to drop charges, especially with felonies. \n\nHere's a video everyone should watch. 44 minute mark is a former detective talking about using this tactic to get people's written admission of guilt.\n\nhttps://youtu.be/d-7o9xYp7eE",
            "title_similarity": "0.77640057",
            "sentiment_compound": -0.9284
        },
        {
            "id": "hiz1cx7",
            "score": 3,
            "text": "\"This is not an admission of guilt. I refuse to apologize to a corporate entity.\"\n\nLet them fire you. **Do not quit!** They cannot withhold your pay.\n\nThen file for unemployment and start looking for a better job.",
            "title_similarity": "0.71613973",
            "sentiment_compound": -0.6481
        },
        {
            "id": "hiz1oow",
            "score": 1,
            "text": "If you don’t know about r/antiwork - please consider checking it out.",
            "title_similarity": "0.23494902",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hiz2j2p",
            "score": 1,
            "text": "Or at least a letter grade.",
            "title_similarity": "0.012753075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz2l81",
            "score": 2,
            "text": "Honestly, at the point the company says \"You're fired.\" Fuck 'em. They can eat shit or send me a summons to court if they really want me to do anything more beside pickup my last check.",
            "title_similarity": "0.8119364",
            "sentiment_compound": -0.7968
        },
        {
            "id": "hiz2m6a",
            "score": 2,
            "text": "What in the everloving shit is wrong with the US, where this can happen?",
            "title_similarity": "0.33446264",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hiz2p33",
            "score": 2,
            "text": "I didn't even know this letter of apology to your employer is a thing.",
            "title_similarity": "0.63455915",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hiz3exz",
            "score": 2,
            "text": "Never heard of an employer asking anyone to write a letter about anything. WTF. No fucking way am I doing anything at that point other than showing them a specific finger.",
            "title_similarity": "0.5070468",
            "sentiment_compound": -0.7739
        },
        {
            "id": "hiz3izr",
            "score": 2,
            "text": "Is taking a shit on their desk considered an “admission of guilt”?\n\nEdit: moar like EMISSION of guilt",
            "title_similarity": "0.55078316",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hiz3qql",
            "score": 2,
            "text": "bruh your friend has 2iq, sorry",
            "title_similarity": "0.2536139",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hiz4asj",
            "score": 2,
            "text": "I've never ever heard of anyone ever being asked to do that until today.",
            "title_similarity": "0.30976072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiz4c93",
            "score": 2,
            "text": "So you get fired, and they assign you homework? I guess they figure you got the time for it now... but the gall of that.",
            "title_similarity": "0.6468496",
            "sentiment_compound": -0.3468
        },
        {
            "id": "hiz5dgl",
            "score": 2,
            "text": "What is this 5th grade? You are firing me i owe you nothing you fiends.",
            "title_similarity": "0.69582045",
            "sentiment_compound": -0.34
        },
        {
            "id": "hiz5eva",
            "score": 2,
            "text": "Pfffff apologize for being fired. I would rather drag my nuts through the sahara desert sand on the hottest day",
            "title_similarity": "0.5897534",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hiz5qss",
            "score": 1,
            "text": "Who is dumb enough to do ANYTHING for the people firing them? That they don't obviously have to do, like giving up badges/provided uniforms.",
            "title_similarity": "0.616314",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hiz5vy7",
            "score": 2,
            "text": "Why on earth would you do that? They already firing you, you literally owe them nothing. Right now there's enough places desperately looking for employees that you don't really need to worry about references in a lot of cases.",
            "title_similarity": "0.680153",
            "sentiment_compound": -0.8
        },
        {
            "id": "hiz6ijk",
            "score": 2,
            "text": "This. I worked at a company called Ruff and Ready moving, terrible terrible company. Employees would drink and drive, break personal items without telling anybody, cocaine on the job, lie about applications and liability information. Lots of terrible things, anyway they fired me for leaving a job early ( I waited on job site for 4 hours before the job started and then I left) they tried to force me to sign a letter admitting guilt and I said no. They then had me sit in a room with another employee and hear me say “no” don’t sign anything.",
            "title_similarity": "0.8896799",
            "sentiment_compound": -0.9231
        },
        {
            "id": "hiz75om",
            "score": 2,
            "text": "Apologising is always an admission of guilt. That's why you often see journalists and victims trying to persuade MPs and criminals to apologise for past events. Opens the gateway for litigation.",
            "title_similarity": "0.6336265",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hiz7hka",
            "score": 2,
            "text": "Damn that's fucked up.",
            "title_similarity": "0.11965423",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hiz7ld2",
            "score": 2,
            "text": "Hilariously, client of mine was fired and they wanted her to sign a letter saying they were firing her because she was exposed to covid. I said sign it if they’ll sign it. \n\nEEOC awards her back pay because they discriminated against her for having an illness. Dipshits dug their own grave. Love it.",
            "title_similarity": "0.8652789",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hiz84dz",
            "score": 1,
            "text": "What my last workplace did was to make me sign a letter saying I didnt do certain stuff I was supposed to during a \"review\" of my performance. \n\nI did and I said the CCTV will prove it and they said they would fire me on the spot if I didnt sign the letter. I thought it would be fine since there would be CCTV evidence to back me up my case later. \n\nI signed it and sent various emails to them requesting for said CCTV footage and they would never reply. \n\nIt was just a facade to later ask me if i wanted to resign. Which I wanted to anyway because it was an unpleasant situation whereby there were these false allegations etc. \n\nAt that time i waz really conflicted because I needed the money and job so i signed it. I would never sign something like that ever again. Fortunately I'm in the financial position to not have to be forced my hand in the near future. \n\nBut i totally understand how sometimes the workplace is toxic but life just doesnt allow u to say no to such unreasonable demands. Not everyone has time or money to lawyer up and losing that job while waiting for unemployment or for a lawyer to pick up ur case and hopefully win is near impossible in certain situations.",
            "title_similarity": "0.775622",
            "sentiment_compound": -0.6869
        },
        {
            "id": "hiz8yqf",
            "score": 2,
            "text": "Last time I got fired I recorded the conversation, I informed them I would of course.\n\nRights will vary between countries of course. I also never heard anyone write such a letter anything like it in the Netherlands nor Israel.",
            "title_similarity": "0.69162834",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hiz9gwl",
            "score": 1,
            "text": " Also if you're written up for some violation you can't write a rebutal on said piece of legal paper that goes in your file. I learned this from my wife...so working construction I was reprimand for driving a forlift off the pavement...long story...anyway I wrote down why I believed the project manager was incorrect in having me written up and he was some kind of mad about me writing what I did. I was terminated or \"laid off\" a few months later...but hey it was a construction job...nature of the beast.",
            "title_similarity": "0.854051",
            "sentiment_compound": -0.7346
        },
        {
            "id": "hiz9nvc",
            "score": 2,
            "text": "Why would I ever write that letter? What’s gonna happen if I don’t, you gonna fire me?",
            "title_similarity": "0.66326547",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hiz9r41",
            "score": 2,
            "text": "If your workplace is in the process of firing you, and they ask you to write a letter apologizing to the company, you might actually be a 6th grader in detention.",
            "title_similarity": "0.8061297",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hiza5i3",
            "score": 1,
            "text": "LPT: If you are Walmart, donate to your local judges",
            "title_similarity": "0.4088965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizb11a",
            "score": 1,
            "text": "This seems entirely an American thing.",
            "title_similarity": "0.106799215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizbb03",
            "score": 1,
            "text": "Wtf! An apology letter?  Walmart are scum!",
            "title_similarity": "0.5964681",
            "sentiment_compound": -0.6351
        },
        {
            "id": "hizcnu4",
            "score": 1,
            "text": "Inb4 people fantasizing this as real thing",
            "title_similarity": "0.072694845",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizd033",
            "score": 1,
            "text": "Another one in the category \"I hope this shit only happens in the USA\"",
            "title_similarity": "0.36389148",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hizdomb",
            "score": 1,
            "text": "My guess is you are talking about murrica, right?",
            "title_similarity": "0.08653897",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizeo0v",
            "score": 1,
            "text": "Why would anyone do this?",
            "title_similarity": "0.10871294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizf4k6",
            "score": 1,
            "text": "Sorry... uhm.... what???\n\nIs that really a thing? Writing apology letters to the soulless corporation that is in the process firing you?\n\nPardon me if this is a stupid question, but I don't think I've ever heard of something like that in the EU, where I live.\n\nYou guys in the US really have that?\n\nAnd if yes:  WHY?",
            "title_similarity": "0.806844",
            "sentiment_compound": 0.755
        },
        {
            "id": "hizfgz4",
            "score": 1,
            "text": "Why the hell would anyone do this? Fuck them.",
            "title_similarity": "0.3321271",
            "sentiment_compound": -0.8666
        },
        {
            "id": "hizfkbf",
            "score": 1,
            "text": "Why would somebody do anything that the employer asks after they know they're being fired? Fuck 'em.",
            "title_similarity": "0.7336035",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hizg9hz",
            "score": 1,
            "text": "Hahahahahahaha I would never write an apology letter for a job that just fired me. Fuck that! Hahahahahahaha",
            "title_similarity": "0.68723774",
            "sentiment_compound": -0.8196
        },
        {
            "id": "hizghpp",
            "score": 1,
            "text": "Any company asking me to fucking apologise for using the bathroom would be waiting until the black holes have evaporated.",
            "title_similarity": "0.7658395",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hizhnz8",
            "score": 1,
            "text": "NEVER SIGN A WRITE-UP!!! Ever!!! This comes from an HR manager. If you sign a write-up you’re admitting guilt. If you don’t, it’s their word against yours. So from now on do NOT sign a write-up.",
            "title_similarity": "0.7746785",
            "sentiment_compound": -0.5053
        },
        {
            "id": "hizhp3l",
            "score": 1,
            "text": "1) don't sign anything.\n\n2) don't verbally admit to anything.\n\n3) don't e-mail admitting to anything.\n\n4) secretly record their wrong doing via one of those cheap USB recording devices that records 48 hours straight (around your neck it works), send yourself e-mails of in work mal-practice, take copies of documents which exposes.\n\n5) Wait until they fire you for refusing to admit to any wrong doing and then take them to the employment tribunal.",
            "title_similarity": "0.7316939",
            "sentiment_compound": -0.8655
        },
        {
            "id": "hizhxat",
            "score": 1,
            "text": "This sounds so fake.",
            "title_similarity": "0.11310403",
            "sentiment_compound": -0.6113
        },
        {
            "id": "hizhyi8",
            "score": 1,
            "text": "I have never been asked to apologize by a workplace. What kind of employer would ask that of you unless you've actually done something wrong?",
            "title_similarity": "0.5934626",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hizi26z",
            "score": 1,
            "text": "Is it even legal to fire someone for using the bathroom too much? And how do you apologize for using the bathroom too much? I have a very active bladder and I wonder if your friend does as well. Sorry to hear about all of this.",
            "title_similarity": "0.7514365",
            "sentiment_compound": 0.7816
        },
        {
            "id": "hizjhcf",
            "score": 1,
            "text": "Totally agree with you. But also, WTF? \n\nThe company is firing you. Why would you comply and write an apology? It's not going to change their mind. Sorry for your friend's bad fortune.",
            "title_similarity": "0.7907927",
            "sentiment_compound": -0.9409
        },
        {
            "id": "hizjnr3",
            "score": 1,
            "text": "Fuck walmarts treatment of their employees",
            "title_similarity": "0.7013252",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hizjon3",
            "score": 1,
            "text": "i mean, what are they really gonna do if you dont write it, fire you? they're already doing that. walmart is such a shitty company.",
            "title_similarity": "0.7836642",
            "sentiment_compound": -0.3744
        },
        {
            "id": "hizjpxt",
            "score": 1,
            "text": "I'm baffled that a company would ask for something like this let alone people acquiescing to it.  You're being fired.  Why would you write an apology?",
            "title_similarity": "0.71584594",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hizjyis",
            "score": 1,
            "text": "Brah why will I apologize for something I wanted to do? \n\nFuck then company, give me more money.",
            "title_similarity": "0.52708",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hizl43j",
            "score": 2,
            "text": "This is some good timing to stumble across this…im currently in the grey area with my former employer - I could tell they were trying to make a case to fire me because that’s what happens when you have an actual qualified, educated, and well-respected clinician who has to answer to a bunch of assholes with not a single actual degree among any of them and the rampant internalized misogyny is on a scale unlike I’ve ever seen before - so I went to a doctor appointment last week and just, uh…never came back. Sent an email to HR late that night that for reasons I’m happy to discuss at a later date, I’m resigning. They want to do my exit interview now and now I’m wondering if they’d try and pull some shit like this? I wouldn’t put ANYTHING past this company tbh. For fucks sake this is a mental health agency with literal countless accusations of egregious ethical violations, sexual harassment that has driven out female colleagues and caused clients to leave (all surrounding the same dude, but of course he’s one of the untouchables so), misappropriation of public funds to the tune of hundreds and hundreds of thousands of dollars…they’ve gone through SEVEN people in the position I held in just the past year - so yeah wouldn’t put anything past these fucksticks. \n\nThe final straw was when my supervisor told me to call one of my clients, a man very precariously teetering on the edge of needing to be hospitalized for his own safety, to TELL HIM TO SHOWER. \n\nif anyone reading this also works in MH, Y’all can see the 8373737373763663 problems with that entire scenario right out the gate. That was too fucking far. I’m not going to risk pushing a man in crisis over the edge for something so insanely trivial and stupid just so my supervisor can feel like she’s right and aSsErT hEr dOmiNaNcE",
            "title_similarity": "0.8758996",
            "sentiment_compound": -0.7812
        },
        {
            "id": "hizl59g",
            "score": 1,
            "text": "Wow your friend is an idiot",
            "title_similarity": "0.41314894",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hizljxg",
            "score": 1,
            "text": "This is some r/ABoringDystopia shit right here",
            "title_similarity": "0.2467086",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hizllpu",
            "score": 1,
            "text": "Your friend wrote a letter apologising for using the bath room? No wonder he worked at wal-mart 😆 😂",
            "title_similarity": "0.75294197",
            "sentiment_compound": 0.765
        },
        {
            "id": "hizlz7l",
            "score": 1,
            "text": "Why would your friend write an apology letter if he didn’t do anything wrong? Sounds like a pretty shit LPT",
            "title_similarity": "0.6081935",
            "sentiment_compound": 0.34
        },
        {
            "id": "hizmcbj",
            "score": 1,
            "text": "So in the USA the company that fired you has to pay for the unemployment benefits? And if you get fired you don’t get unemployment benefits if they fire you for good cause?",
            "title_similarity": "0.78149736",
            "sentiment_compound": -0.8426
        },
        {
            "id": "hizndvr",
            "score": 1,
            "text": "I’ve never heard of a company asking an employee to write an apology letter to them, especially after firing that employee.",
            "title_similarity": "0.7172911",
            "sentiment_compound": -0.3566
        },
        {
            "id": "hizo3ne",
            "score": 1,
            "text": "apology letter wtf",
            "title_similarity": "0.23836392",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hizp5m5",
            "score": 1,
            "text": "Question, in the US, who pays for unemployment benefits?",
            "title_similarity": "0.4017607",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hizqbh0",
            "score": 1,
            "text": "Sounds like a pretty terrible court system.",
            "title_similarity": "0.35305756",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hizqrgk",
            "score": 1,
            "text": "I mean, duh. This is barely a regular tip. Has anyone found that life pro tips is turning into 'obvious tips from idiots that should really know better'?",
            "title_similarity": "0.5818727",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hizrocx",
            "score": 1,
            "text": "You pick up the paper fold it put in your pocket and walk out.Seems like a fishy way of them getting the liability off their ass",
            "title_similarity": "0.51701295",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hizs8wm",
            "score": 1,
            "text": "isn’t capitalism grand lads?",
            "title_similarity": "0.21683465",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hiztp5d",
            "score": 1,
            "text": "Wtf. I've never heard of such a thing in my life.",
            "title_similarity": "0.2899692",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hizu9us",
            "score": 1,
            "text": "It's a good tip.\n\nBut why would you do that in the first place?",
            "title_similarity": "0.24122891",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hizuibx",
            "score": 1,
            "text": "Your country is a fucking parody.",
            "title_similarity": "0.34491462",
            "sentiment_compound": 0.0
        },
        {
            "id": "hizuybp",
            "score": 1,
            "text": "What the fuck? Why oh why would anyone be dumb enough to do that????",
            "title_similarity": "0.3251428",
            "sentiment_compound": -0.8299
        },
        {
            "id": "hizvekv",
            "score": 1,
            "text": "What the fuck kind of backwater batshit insane country are you guys living in?!",
            "title_similarity": "0.42266417",
            "sentiment_compound": -0.7574
        },
        {
            "id": "hizvjju",
            "score": 1,
            "text": "Motherfucker my bladder is weak, what do you want from me",
            "title_similarity": "0.3775469",
            "sentiment_compound": -0.802
        },
        {
            "id": "hizvw32",
            "score": 1,
            "text": "Jesus what is wrong with your country",
            "title_similarity": "0.3190359",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hizw0ws",
            "score": 1,
            "text": "Is this a thing in America? That's hecking nuts, why would anyone do that o.o I'm flabbergasted",
            "title_similarity": "0.3927524",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hizwvw0",
            "score": 1,
            "text": "LPT: If walmart has already informed you that they're firing you and ask for *anything*, especially in writing, tell them to eat a dick. Not yours, that's sexual harassment. Just *a* dick. What will they do, fire you harder?",
            "title_similarity": "0.7948469",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hizxd9r",
            "score": 1,
            "text": "Write a letter of apology before getting fired? This is really a thing? Why would anyone actually do it? \n\nI guess this is the only good thing about doing manual labor jobs. I can tell my boss exactly what I think of them and the company and then go get another job the same day.",
            "title_similarity": "0.745589",
            "sentiment_compound": -0.2593
        },
        {
            "id": "hizz25o",
            "score": 1,
            "text": "Do jobs actually ask you to apologize?? The fuck?",
            "title_similarity": "0.48384",
            "sentiment_compound": -0.5632
        },
        {
            "id": "hizzbts",
            "score": 1,
            "text": "Here in Mexico you have to sign something similar BEFORE starting the job. That way they can fire you anytime without explanation.\n\nAnd if you don't sign it, you don't get the job.",
            "title_similarity": "0.6910355",
            "sentiment_compound": -0.34
        },
        {
            "id": "hj00lod",
            "score": 1,
            "text": "Holy actual fuck America is wild, and by wild I mean irredeemably fucking stupid. A letter of apology to the company? What the fuck is that? Why the fuck would you? Every time I think I've seen the bottom of the barrel of American degeneracy, y'all show me something new. Fascinating.",
            "title_similarity": "0.74379367",
            "sentiment_compound": -0.9008
        },
        {
            "id": "hj00mie",
            "score": 1,
            "text": "Same goes for car accidents. Many of us apologize by default in the case of anything potentially harmful, but keep your trap shut when insurance/police may be involved. \n\nI lost a case over a minor bump in a parking lot in which I was clearly in the right because I automatically said, “I’m so sorry, it’s been one of those days.” Learn from my mistake.",
            "title_similarity": "0.6603695",
            "sentiment_compound": -0.7913
        },
        {
            "id": "hj00oje",
            "score": 1,
            "text": "What in the fuck?!?!\n\nWho'd apologize in letter form to their employer?!?",
            "title_similarity": "0.6405828",
            "sentiment_compound": -0.7128
        },
        {
            "id": "hj01wmf",
            "score": 1,
            "text": "\"let me talk to my employment lawyer first\"",
            "title_similarity": "0.38974378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj05av7",
            "score": 1,
            "text": "I am most shocked about US education I think, because hell you should pick up on this kind of BS.\n\nI dunno, maybe it’s just my ancestry of resisting institutional BS for hundreds of years, but if they catch me by my hand I will defend to the death that this is indeed NOT my hand.",
            "title_similarity": "0.73635554",
            "sentiment_compound": -0.8438
        },
        {
            "id": "hj06da0",
            "score": 2,
            "text": "It’s been said a million times, but it bears repeating: HR is not your friend. It is not there for you. It is there to protect the company. Their interests will rarely align with yours so if the job is worth it, get a lawyer. Their interests will 100% be on your side.  You won’t scare HR with lawyers, so don’t get cocky.  The fact that you have a lawyer will force HR to find their pound of flesh elsewhere... or at the very least take a second look.  If nothing else, it will give you a stronger position to negotiate with.",
            "title_similarity": "0.6667273",
            "sentiment_compound": 0.5044
        },
        {
            "id": "hj07y4x",
            "score": 1,
            "text": "Never sign anything.",
            "title_similarity": "0.20726943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj0bja8",
            "score": 1,
            "text": "Using the bathroom too much? What?",
            "title_similarity": "0.3674875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj0e7ip",
            "score": 1,
            "text": "I mean isn’t this common sense? Hey we going to fire you for petty shit, but please write us a letter to tell us sorry? Nah you tell them fk off..",
            "title_similarity": "0.7335937",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hj0l9i6",
            "score": 1,
            "text": "Honestly you should never apologize for anything in formal writing ever lol. Unless you’re a public person making a statement to the media, but even then it’s supposed to be your lawyer writing it.\n\nSave apologies for friends and only face-to-face. You’re not supposed to apologize to your employer unless you’ve done something really really nasty and in that case, again, it should be your lawyer talking.\n\nEdit: honestly apologizing to friends and family is shit too, just make up for it asap.",
            "title_similarity": "0.7350644",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hj0thu4",
            "score": 1,
            "text": "what the fuck, they ask you to apologize? That is so insulting\n\nmaybe if you take a fat shit right in the managers office while looking them in their cold, uncaring, lizard eyes and ask - \"quick enough bathroom break for ya?\"\n\nThen you'd have something to apologize for",
            "title_similarity": "0.7730856",
            "sentiment_compound": -0.8951
        },
        {
            "id": "hj0zz1m",
            "score": 1,
            "text": "Wow holy shit that great information.  Walmart fired me for unauthorized overtime when I was told to stay on the clock then they denied that it was less then 15 minutes",
            "title_similarity": "0.80456305",
            "sentiment_compound": -0.296
        },
        {
            "id": "hj436bk",
            "score": 1,
            "text": "If I’m getting fired, they can be 100% sure of *0* input from my part, let alone writing a letter lol",
            "title_similarity": "0.45912617",
            "sentiment_compound": -0.128
        },
        {
            "id": "hj47pkf",
            "score": 1,
            "text": "Deeply fucked that apologies or shows of sympathy are legally considered a sign of guilt, to be honest",
            "title_similarity": "0.49943563",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hj4b102",
            "score": 1,
            "text": "Crazy how people just happen to accept such laws.",
            "title_similarity": "0.2961237",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hjct81j",
            "score": 1,
            "text": "Lol what is this middle School?  why would I write an apology letter.you're already firing me",
            "title_similarity": "0.7781354",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjxhjch",
            "score": 1,
            "text": "Creating stories is a rewarding experience.",
            "title_similarity": "0.020550689",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hk0dvhi",
            "score": 1,
            "text": "I would laugh and laugh and laugh",
            "title_similarity": "0.00136289",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hkrlxuy",
            "score": 1,
            "text": "At least you knew you were getting fired they didn't tell me",
            "title_similarity": "0.60648215",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hma8bu2",
            "score": 1,
            "text": "Family Dollar, the WORST company to work for! Not only because they give you a laughably small budget to pay your employees with, whenever I had to fire someone corporate would insist I try to make them write a letter of apology and THEN video tape them reading it! PASS",
            "title_similarity": "0.8395538",
            "sentiment_compound": -0.7793
        }
    ]
}