{
    "LPT: ‘Work friends’ are colleagues first and friends second. Never forget that. Be careful about gossip and how much you share.\n": [
        {
            "id": "hj82mhn",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.6066861",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hj8dx3g",
            "score": 0,
            "text": "I suppose that depends on whether or not your \"office friend\" is a bootlicker.",
            "title_similarity": "0.5645162",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hj8gd6q",
            "score": -9,
            "text": "Holy shit! An actual Life Pro Tip!!\n\nAnd I thought the stories were only myths.\n\nThey're out there people!! They're out there!",
            "title_similarity": "0.40175724",
            "sentiment_compound": -0.6973
        },
        {
            "id": "hj89kuf",
            "score": -1,
            "text": "I’d say that’s true for the most part \n\nBut it is helpful to find a true friend at work to bitch with and cut up and what not.  Misery loves company.",
            "title_similarity": "0.70386505",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hj899ny",
            "score": 4,
            "text": "I don’t talk to my coworkers unless it’s absolutely necessary.",
            "title_similarity": "0.47285575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8pfo4",
            "score": 0,
            "text": "Everything you tell the secretary will be told to the boss.\n\nEverything. Don't care how much of a friend she is. The Office isn't real. The secretary will tell him everything you tell her.",
            "title_similarity": "0.68904525",
            "sentiment_compound": 0.1461
        },
        {
            "id": "hj8qhiq",
            "score": 0,
            "text": "I'm glad this gets posted every week so I don't forget.",
            "title_similarity": "0.51150644",
            "sentiment_compound": 0.6033
        },
        {
            "id": "hj8f4qc",
            "score": 1,
            "text": "Nice copied post",
            "title_similarity": "0.44644767",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hj8hxwm",
            "score": 3,
            "text": "Same to \"school friends\" as well. They will ghost the fuck out of you once everyone graduates or is on summer/winter break.",
            "title_similarity": "0.5375508",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hj8d2cj",
            "score": -1,
            "text": "You might as well say \"get a job\". Repent in leisure.\n\nYou are right but surely the individual should know the score? It's not a difficult concept.",
            "title_similarity": "0.6473304",
            "sentiment_compound": 0.7944
        },
        {
            "id": "hj8rhqi",
            "score": -10,
            "text": "Especially the liberal ones, watch your back.",
            "title_similarity": "0.51061785",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj93au4",
            "score": 2,
            "text": "Not true\n\nMaybe in your gigantic faceless corporal nuricsn company",
            "title_similarity": "0.27199596",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hj8c0av",
            "score": 3,
            "text": "Wow this is so smart",
            "title_similarity": "0.17429012",
            "sentiment_compound": 0.8069
        },
        {
            "id": "hj8gn5b",
            "score": 0,
            "text": "I talk gossip all the time. But on the other hand I keep the real shit for me as a back up.",
            "title_similarity": "0.6619228",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hj8y7u9",
            "score": 0,
            "text": "Largely depends on where you work",
            "title_similarity": "0.34574425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9fmvt",
            "score": 0,
            "text": "Also don't form relationship with them also",
            "title_similarity": "0.13850233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjaaxu0",
            "score": 0,
            "text": "Work \"friends\" are responsible for a lot of marriages breaking up then those friends disappear",
            "title_similarity": "0.5066049",
            "sentiment_compound": 0.765
        },
        {
            "id": "hje4nd6",
            "score": 0,
            "text": "I don't know if it's because I'm a developer or I live and work in the UK but office drama has never existed and I've always felt like my managers and coworkers have my back and I have theirs. I've worked in four offices over 9 years and I have never felt I need to be careful about who I share with and still have friends spanning nearly a decade. \n\nI've been candid with my boss and choice coworkers alike about my dad committing suicide, my mental health issues, I've commiserated failures and celebrated successes with them and just generally treated them like I would anyone who I feel comfortable talking to and whom I feel a bond. Sure there have been times that I've been told areas I need to improve on or things which need to be dealt with but I've never taken it personally and even have asked for honest feedback so I can improve and as a manager myself I've never been unfair or treated someone badly because of privileged information.",
            "title_similarity": "0.48609698",
            "sentiment_compound": 0.9902
        },
        {
            "id": "hj8dxo5",
            "score": -10,
            "text": "Happy cake day to me ! \n\nJust had a long day at work and witnessed this (from the sidelines).",
            "title_similarity": "0.48702842",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hj8uioq",
            "score": 10,
            "text": "Nah people can be good friends and work for the same company. Please stop describing your own personal experiences like it relates globally",
            "title_similarity": "0.7233416",
            "sentiment_compound": 0.802
        },
        {
            "id": "hj8vnv4",
            "score": 5,
            "text": "I always see these types of LPT and it honestly makes me wonder what kind of awful work places you have all been at? Throughout all my years of work I’ve become hella good friends with my colleagues, we go out, talk shit, have drinks, have the boss over, go out, talk more shit, and get shit done.\n\nThis is the same with the various office jobs that I’ve had. And if you’re wondering why I say various, they’ve all been due to better opportunities (money, convenience, etc.) not because someone dogged on me for talking shit...\n\nI personally have never had any bad enough experience in a workplace to make me want to share it on LPT...",
            "title_similarity": "0.6774798",
            "sentiment_compound": 0.1117
        },
        {
            "id": "hj82wzx",
            "score": 33,
            "text": "Unfortunate how true this is.",
            "title_similarity": "0.24658586",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hj8gogi",
            "score": 6,
            "text": "How about just dont fucking gossip?  Doesnt matter if it's at work or with a friend outside of work, gossip will bite you in the ass. If you cant spend time with someone without talking smack about other people, that's a you problem, not a coworker problem.",
            "title_similarity": "0.6314095",
            "sentiment_compound": -0.2605
        },
        {
            "id": "hj8ucr2",
            "score": 7,
            "text": "I work with mostly Trump supporters. I never divulge my political leanings. They're nice now, but that could change quickly.",
            "title_similarity": "0.48840934",
            "sentiment_compound": 0.431
        },
        {
            "id": "hj8d0pi",
            "score": -1,
            "text": "Depends on whether you brought your friend into the company or vice versa.",
            "title_similarity": "0.525356",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hj8s2ad",
            "score": 1,
            "text": "Be careful with being friends with them in general. Had a friend from work who took a play fight too far and fucked up my face and front teeth. He left me to drive myself to the hospital with a busted face because he drove off. Had to work with him for months after that. I wanted to die.",
            "title_similarity": "0.43883747",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hj8wvmv",
            "score": -1,
            "text": "Ain’t no work friends.. coworkers only.",
            "title_similarity": "0.38039282",
            "sentiment_compound": -0.5795
        },
        {
            "id": "hj8xe5d",
            "score": -1,
            "text": "Happy cake day! And also, I'm an oversharer. My wife says I can share all I want about MY stupid life/family, but keep her and her family out of it.  Lol\n\nI don't care who knows what about me... no shame, no \"ragerts.\"",
            "title_similarity": "0.55669516",
            "sentiment_compound": 0.7971
        },
        {
            "id": "hj8xgwc",
            "score": 1,
            "text": "People can be good friends despite happening to work at the same place as you.\n\nIf you think people can't be \"Real Friends\" because they happen to work at the same place as you, them prioritizing work has less to do with work, and more to do with you.",
            "title_similarity": "0.69956404",
            "sentiment_compound": 0.534
        },
        {
            "id": "hj8y6so",
            "score": 1,
            "text": "But what if you live with your coworker and hangout constantly",
            "title_similarity": "0.56945074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj92l8a",
            "score": 1,
            "text": "Yes but on the rare occasion they can be genuine friends. I’m 5 weeks away from having my first baby and my old boss will by my support person in the room with me (I am a single mum by choice, IVF, doner sperm etc) she has been there for me through everything. She is one of my best friends, I spend Xmas with her family, consider her kids my niece and nephew etc\n\nYou can find genuine great friends from workplaces if you’re lucky.",
            "title_similarity": "0.47478366",
            "sentiment_compound": 0.9882
        },
        {
            "id": "hj93fqn",
            "score": 1,
            "text": "This again? I've worked with great colleagues and friends where we had mutual respect an no trouble sharing things like annoyance with work/boss or even that you are leaving.\n\nLPT: Be the kind of person that your work friends respect and this won't be a worry.\n\n Perhaps this says now about how OP treats his work friends trust rather than the opposite; you reap what you sow.",
            "title_similarity": "0.8284285",
            "sentiment_compound": 0.9762
        },
        {
            "id": "hj9ca4g",
            "score": 1,
            "text": "So many LPTs are just secluded introverts saying ‘don’t trust anyone’, when in reality I’ve made good friends through work and so has everyone I know",
            "title_similarity": "0.6977135",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hj9fc0e",
            "score": 1,
            "text": "This is dumb because people are different",
            "title_similarity": "0.14829856",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hj9pks7",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.10087939"
        },
        {
            "id": "hjbweeg",
            "score": 1,
            "text": "Stupid advice. By doing this and treating colleagues as mere colleagues is why the majority of you won't ever make it to upper management. \n\nThe key is in identifying which of your colleagues are tight lipped and can give you the push you need to ascend greater heights\n\nThe idea of treating colleagues as mere colleagues makes for a miserable working environment and believe it or not you'd be marked down if you practice it religiously\n\nNever forget that the right people will always open doors for you. And more often than not, it is not the friends that you spent a lot of time with in your personal life.",
            "title_similarity": "0.63337684",
            "sentiment_compound": -0.7174
        },
        {
            "id": "hj8noba",
            "score": 2,
            "text": "I don't understand what's the downside.\n\nLike I've talked about unionization, high school drug distribution, about my sex life, about smoking weed, about making my own alcohol when I was 19(and shared it with my manager), about politics, mental health issues, etc etc with coworkers.\n\nAnd coworkers have told me about their sexuality, past fentanyl use, family history of alcoholism, being a former stripper, that they are high on weed/Molly while at work, drunk driving, propositioned for being a bull, and  about what you should and shouldn't order from the dark web.\n\nNothing bad came out of any of that, because we have solidarity as workers. We are all working for the same boss, the same company, and we all know we had more in common with each other than the higher ups making six figures. We were all there to do our jobs, get our paycheck and go home, while making our work life as bearable as we can make it. \n\nI don't really see what could go wrong as long as nobody overhears.",
            "title_similarity": "0.4997247",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hj8wa6v",
            "score": -2,
            "text": "i trust early and i trust hard. my employees are my best friends after day 6. they didnt leave on day 5. Props to ya. federal crimes on your behalf coming soon. im a bad boss.",
            "title_similarity": "0.64474887",
            "sentiment_compound": 0.8792
        },
        {
            "id": "hj8xx5u",
            "score": 2,
            "text": "I don’t get this. You either have friends that you trust, or you don’t. What does work have to do with it?",
            "title_similarity": "0.53991073",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hj8yocz",
            "score": 2,
            "text": "Wow this is awful advice - sad, really. As with all people you’ll come across in your life, some you’ll want to make friends with and some not. They may be coworkers or otherwise, and it doesn’t matter because the most important thing is to see them as human first.",
            "title_similarity": "0.7066548",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hj9180c",
            "score": 2,
            "text": "LPT is situational once again.\n\nSpend more than a few years at a place, and you know where relationships stand.",
            "title_similarity": "0.4373048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9awmd",
            "score": -2,
            "text": "I see this advice atleast 4 times a week. Just stop.",
            "title_similarity": "0.29641277",
            "sentiment_compound": -0.296
        },
        {
            "id": "hj89j00",
            "score": 40,
            "text": "The President can’t even get a BJ in the most secure building on earth without the whole world knowing. Remember this whenever you’re thinking of telling someone something. Just don’t do it.",
            "title_similarity": "0.39360648",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hj8e7rl",
            "score": 55,
            "text": "I disagree on principle. If I'm spending 40 hours of my life a week in a particular social situation, no matter what it is, I'm going to eventually make friends and meet people that I like. Why would I deny myself opportunities to develop new lasting relationships regardless of where they're made?\n\nIf making friends at work is causing adverse consequences, and toxic outcomes, that says more about your inability to read and manage social cues as well as not setting proper boundaries where appropriate.\n\nI recognize that there's exceptions to this, if it's truly a toxic workplace, but people need to navigate that. Having a hard and fast rule about social boundaries regardless of context is silly.",
            "title_similarity": "0.619022",
            "sentiment_compound": 0.3466
        },
        {
            "id": "hj8kmer",
            "score": 2,
            "text": "If they talk to you about other people they talk to other people about you",
            "title_similarity": "0.57271177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8qzzw",
            "score": 3,
            "text": "I can attest to this. I had a coworker who would shit on our former boss all the time, and I would let her vent. Once I did a test. I crapped on the boss about something incredibly unethical he said, and the next thing I know, a few days later the boss brings it up as a warning to “the people in the room” almost verbatim. I decided to quit that toxic workplace, and little did I know, right after I quit, my “friend” got a promotion. \n\nMoral of the story? Nobody at work is really your friend. When out against their own self interest, they will put themselves first. \n\nBut, life catches to people like that, funding ran out on the place she was working at ( due to covid) and she was forced to leave the post. I didn’t have to go through that stress, because I already had left the post. Shit gets back to you one way or another.",
            "title_similarity": "0.54136264",
            "sentiment_compound": -0.9137
        },
        {
            "id": "hj8tkak",
            "score": 2,
            "text": "And don’t add them on your social media.",
            "title_similarity": "0.18901362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj94z7a",
            "score": 2,
            "text": "lmao what even is this thread? Never seen a larger collection if paranoid ppl in my life. Jesus just behave\nlike a normal human at work and treat people the way they treat you. Shit talking is fine as everyone is doing it and not sure when it became taboo. Its fun and allows ppl to diffuse. I know my staff talk\nshit about me but its normal because we are all human at the end of the day",
            "title_similarity": "0.6296773",
            "sentiment_compound": 0.4346
        },
        {
            "id": "hj97ggl",
            "score": 3,
            "text": "LPT LPT: Work friends aren't even real friends, first or second. Trust no one. Bit dramatic, but worth remembering.",
            "title_similarity": "0.5844959",
            "sentiment_compound": 0.4893
        },
        {
            "id": "hj9aqkk",
            "score": 3,
            "text": "I married my work colleague, but you're right, I should not forget what they truly are. Colleague first, wife second.",
            "title_similarity": "0.70740664",
            "sentiment_compound": 0.7049
        },
        {
            "id": "hj8cjf7",
            "score": 13,
            "text": "Never date coworkers",
            "title_similarity": "0.2294915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj85jv8",
            "score": 64,
            "text": "Great advice - and an important reminder to invest in making friends outside of work.",
            "title_similarity": "0.67847395",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hj8o0ho",
            "score": 14,
            "text": "Yeah I told my coworkers way too much about my trauma after first getting out of rehab/homelessness... They fired me I'm pretty sure for talking about it a bit too much. It was a smokeshop too I thought they'd be more tolerant...\n\nI was in such a bad place at the time. I couldn't stop just going in circles talking about that shit and it was my first job after getting sober... Haven't had a job since then (school).\n\nIt hurt so much because I already had no confidence in myself after all that shit and then got fired like almost immediately. Hard to pick myself back up. Failed multiple interviews since then too for jobs in areas I was actually passionate about. Bad feels.\n\nThe worst part is they legit just stopped giving me hours and didn't even tell me why. I had to go in to learn that I'd been essentially fired although they never formally fired me, like I said they just gave me no hours and never let me know officially or why they did it.",
            "title_similarity": "0.4946668",
            "sentiment_compound": -0.9713
        },
        {
            "id": "hj8co7q",
            "score": 6,
            "text": "Everyone in here worried about people repeating negative shit you say...but forgetting the inherent opportunity to say something you know will play well when they repeat it later.",
            "title_similarity": "0.5974367",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hj8e9aa",
            "score": 4,
            "text": "This is true...but with some people, it doesn't really matter. They're so miserable and see you happy and then talk shit to your bosses and coworkers behind your back about you to make your life as miserable as theirs..\n\nI've been there once or twice with the rough, egotistical, hillbillies, in my field of work.",
            "title_similarity": "0.6210569",
            "sentiment_compound": -0.8309
        },
        {
            "id": "hj8hw49",
            "score": 4,
            "text": "Not really. Most people meet their best friends through work.",
            "title_similarity": "0.6395445",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hj8mcd8",
            "score": 3,
            "text": "my best friends are from work. if you can't tell who's your friend or not, that's on you",
            "title_similarity": "0.754949",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hj8nvj8",
            "score": 5,
            "text": "This isn't a very good LPT because there's too many factors. Industry... Demographic of the employees etc. I was a manager for a while at a movie theater and became amazing friends with both other managers and employees. The age range was about 18 to 24 at the time. Many of those I'm still good friends with and two of which I was recently in their wedding party.\n\nSo no, don't automatically exclude people from work as possible life friends. Work is a great place to meet new people.\n\nThat said, always be conscious about what you say around people... But that should be common sense.",
            "title_similarity": "0.5733917",
            "sentiment_compound": 0.8865
        },
        {
            "id": "hj939iq",
            "score": 5,
            "text": "No, YOUR work friends are colleagues first. Mine are very close friends. Stope projecting your rubbish job onto the rest of us.",
            "title_similarity": "0.84381485",
            "sentiment_compound": 0.7564
        },
        {
            "id": "hj8hkxi",
            "score": 164,
            "text": "I feel sad for the people in these threads who agree with this.  I’m very good friends with people I work with—have stayed in their homes, have been to their bachelor parties.  \n\nI’m always reminded of that scene in House where Wilson asks if House really believes he can’t trust anyone and Wilson says how sad a life that must be.",
            "title_similarity": "0.5924992",
            "sentiment_compound": 0.8347
        },
        {
            "id": "hj8nzpo",
            "score": 5,
            "text": " Man oh man did I learn this the hard way. I was in a temporary job fresh out of college while getting my Masters. I became friends with one of the guys. During lunch I got hired at a CPA firm to start in a few months for tax season. We were talking and he asked what Id be making, I told him. The next day he went to our boss and threatened to quit, throwing me under the bus repeatedly apparently about he is way smarter and works harder than I did at the time blah blah. My boss was very kind but warned me to be careful what you share because it can really upset people.",
            "title_similarity": "0.57361966",
            "sentiment_compound": 0.0674
        },
        {
            "id": "hj8o0cy",
            "score": 6,
            "text": "Trust no one you wouldn’t die for.",
            "title_similarity": "0.43557644",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hj8qejw",
            "score": 4,
            "text": "This is so cynical and untrue. You can use character judgement to figure out who your friends are and who aren't.",
            "title_similarity": "0.5195511",
            "sentiment_compound": -0.0686
        },
        {
            "id": "hj8ar8m",
            "score": 7,
            "text": "I got married over the weekend and today was my first day back at work. I was surprised at the number of people (it close to a dozen) who told me they were 1 surprised they weren't invited AND 2 had no idea I was engaged AND 3 surprised at who as I was marring as he works there too. One person told me that she and I talk all the time and how did she not know any of this?",
            "title_similarity": "0.4640482",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hj8oljw",
            "score": 101,
            "text": "Man it's a circlejerk of miserable fucks in here.\n\nNo, not all coworkers are complete dicks that would throw you under the bus if they could get a cream cheese bagel out of it.  Just be a good judge of character and pick your friends right, just like in every other situation.  And maybe be a decent human being and don't gossip and trash your coworkers to other coworkers.",
            "title_similarity": "0.50905687",
            "sentiment_compound": 0.4055
        },
        {
            "id": "hj860lw",
            "score": 10,
            "text": "My work friends are work friends. That's it.",
            "title_similarity": "0.7060348",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hj8jsos",
            "score": 31,
            "text": "If they'll gossip to you, they are gossiping about you",
            "title_similarity": "0.6646937",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hj887nk",
            "score": 115,
            "text": "Don't drink too much at happy hour and for god's sake don't bang any interns .. no matter how hawt they look after a fishbowl margarita",
            "title_similarity": "0.41456592",
            "sentiment_compound": 0.5612
        },
        {
            "id": "hj8l642",
            "score": 40,
            "text": "Boo!! I say just be yourself and find an environment that appreciates that.",
            "title_similarity": "0.50949204",
            "sentiment_compound": 0.5972
        },
        {
            "id": "hj88h65",
            "score": 690,
            "text": "Never turn down a better offer to stay with your work friends.\n\nYour \"friends\" will leave you behind in a moments notice.\n\nEDIT: SHOCKING DEVELOPMENT....\n\nMy two sons work at the same company. Today the younger one came over for a visit and was not happy. Turns out his brother resigned to take a better job at another company.",
            "title_similarity": "0.5508851",
            "sentiment_compound": 0.5218
        },
        {
            "id": "hj892th",
            "score": 59,
            "text": "Most workers will be nice and tolerate listening just to keep peace. I think that's where most people will think that is a sign of being a friend when it's not.",
            "title_similarity": "0.66649616",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hj8lpfl",
            "score": 26,
            "text": "Never been a problem. My anxiety is so bad that I essentially have to operate with a different personality at work to function. Nobody there actually knows me, and that's the way I'd like to keep it.",
            "title_similarity": "0.58837676",
            "sentiment_compound": -0.1864
        },
        {
            "id": "hj8ksl6",
            "score": 123,
            "text": "Generally true, but also don't let this attitude prevent you from making ACTUAL work friends.. pretty much every one of my best friends is someone I used to work with. \n\nBest way to make good friends at work that continue to be good friends is to not involve yourself with shitty gossip. That should be the LPT. You not shit-talking your coworkers will make everyone think better of you whether they know they think better of you for it it or not. Just don't gossip, maybe those colleagues would have been friends. \n\nBetter yet - if you gossip, say good shit. People love when you say good shit behind their backs.",
            "title_similarity": "0.81967586",
            "sentiment_compound": 0.9953
        },
        {
            "id": "hj8jigz",
            "score": 33,
            "text": "I never gossip and try to stay away from it as much as possible, but other people always gossip to me and I don't know how to respond. I can't tell someone to not gossip to me because I don't want to upset them, but I also don't want to get in trouble for someone gossiping to me. Gossip is just toxic in general and is often a projection of yourself. I feel bad for people who gossip most of the time and find people tend to do it when they're bored or they have a boring life to find excitement.",
            "title_similarity": "0.546101",
            "sentiment_compound": -0.9326
        },
        {
            "id": "hj88a11",
            "score": 402,
            "text": "It depends. Some of them are only work friends while others are actual friends.\n\nI mean it definitely helps that I'm in the IT field as there's a lot of coinciding personal interests.\n\nHowever I know how to separate specific work friends and keep it just as that. \n\nI definitely learned early that you can't trust all your work friends as they just gossip, and not even for the benefit of themselves they just like to create shit, and others try and take advantage of you acting like they didn't do anything wrong when you catch them in the act.",
            "title_similarity": "0.7648792",
            "sentiment_compound": 0.9778
        },
        {
            "id": "hj8deuz",
            "score": 49,
            "text": "This is so true but hard to not vent when that one guy pisses you off, or that project you worked hard on got side tracked by someone else.",
            "title_similarity": "0.5953252",
            "sentiment_compound": -0.5247
        },
        {
            "id": "hj8b1ei",
            "score": 317,
            "text": "But I'm the office drug dealer. If I go down they all go down with me!!!",
            "title_similarity": "0.448844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8ctx3",
            "score": 1834,
            "text": "[deleted]",
            "title_similarity": "0.10087939"
        },
        {
            "id": "hj8a7k8",
            "score": 639,
            "text": "Never ever talk shit with colleagues about things that you wouldn't talk with the boss. You never know when your friend gets promoted and has new responsibilities.",
            "title_similarity": "0.45395207",
            "sentiment_compound": 0.837
        },
        {
            "id": "hj8bqct",
            "score": 302,
            "text": "Having recently discovered how quickly work 'friends' will forget you, this is 100% true.",
            "title_similarity": "0.5885019",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hj8l1xk",
            "score": 86,
            "text": "I found at my last salary corporate position.\n\nSometimes saying something you don't even believe just to see where the gasket leaks was helpful in determining who to trust\n\nNot anything crazy mind you. But tell Tom you dislike bobs hair or something like that and only to Tom.",
            "title_similarity": "0.63006306",
            "sentiment_compound": 0.5296
        },
        {
            "id": "hj8gdxa",
            "score": 1824,
            "text": "This is why, even though I really really wanted to, I did not tell my work bestie that I had taken another job until I had officially given notice to my boss and HR. Of course, a larger reason was because I didn't want her to have to hold on to the secret longer than necessary, nor take the chance that she wouldn't.",
            "title_similarity": "0.5604384",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hj8gj65",
            "score": 1180,
            "text": "Just say nice things about people behind there backs.",
            "title_similarity": "0.5744496",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hj833ru",
            "score": 2447,
            "text": "And never gossip in writing, esp over company email",
            "title_similarity": "0.36596417",
            "sentiment_compound": 0.1326
        },
        {
            "id": "hj8hdgg",
            "score": 149,
            "text": "Until you quit! My work bestie still keeps me in the loop on company gossip even though I left 5 years ago. I love it.",
            "title_similarity": "0.6005455",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hj8eu2d",
            "score": 6310,
            "text": "[removed]",
            "title_similarity": "0.0848498"
        },
        {
            "id": "hj8n06z",
            "score": 3624,
            "text": "There are \"work friends\" and then there are friends you met through work and you just have to know the difference.",
            "title_similarity": "0.74587476",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hj8d3s8",
            "score": 34,
            "text": "100% Make friends outside work as much as possible.",
            "title_similarity": "0.47052008",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj8fbvp",
            "score": 107,
            "text": "Felt like I needed to hear this at the right time",
            "title_similarity": "0.38012168",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hj8fl70",
            "score": 9,
            "text": "This may tend to be true but isn't a guarantee. Close friends are close close friends, regardless of if you work together. That said, you should be careful who you gossip too anyway. There is no reason that people you gossip with don't gossip with other people besides you, regardless of if you work together.",
            "title_similarity": "0.7937316",
            "sentiment_compound": 0.7066
        },
        {
            "id": "hj8gcxe",
            "score": 4,
            "text": "That's only true sometimes. I've been friends with people years after we left the office.",
            "title_similarity": "0.56104255",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hj8gecu",
            "score": 5,
            "text": "A friend of mine helped me get a job with his company and immediately changed into a douche. Went from being a good friend to just a colleague over the years because I can't trust him with anything personal anymore.",
            "title_similarity": "0.5441315",
            "sentiment_compound": 0.6246
        },
        {
            "id": "hj8gemt",
            "score": 2,
            "text": "Learned this too late. That too from a bad experience.",
            "title_similarity": "0.36090517",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hj8hp2i",
            "score": 2,
            "text": "Depends on the job/industry. I have some ex-coworkers that are better friends than anyone I met in college and most people from high school. That said, in my current office job I wouldn't trust most people beyond the most basic social function. If you're unsure, I'd definitely err on the safe side and keep coworkers at arms length.",
            "title_similarity": "0.6545148",
            "sentiment_compound": 0.7844
        },
        {
            "id": "hj8im1p",
            "score": 5,
            "text": "Never forget than being at work is like being arrested, anything can say can and will be used against you",
            "title_similarity": "0.56976765",
            "sentiment_compound": 0.017
        },
        {
            "id": "hj8iz7c",
            "score": 1,
            "text": "There is no such thing as friends everyone is an opportunist",
            "title_similarity": "0.35924703",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hj8jay0",
            "score": 3,
            "text": "It's even easier, just dont gossip at work. If you wouldn't say it in ear shot of the person it doesn't need to be said.",
            "title_similarity": "0.59064186",
            "sentiment_compound": 0.5136
        },
        {
            "id": "hj8k9rx",
            "score": 1,
            "text": "You have to know who trust. My team has had the opportunity to throw each other under the bus and none of us has done it. In leas than a year we've met each other families and even went On vacation together.",
            "title_similarity": "0.38313806",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hj8kkxu",
            "score": 21,
            "text": "I had a friend stab me in the back so fucking hard at my first real career job. Never again. I have people I hang with on occasion,  but I don't share anything too important. It is kind of sad because they never really know me, but I have my friends for that.",
            "title_similarity": "0.55644375",
            "sentiment_compound": -0.3307
        },
        {
            "id": "hj8ky3x",
            "score": 1,
            "text": "Instead of gossiping, compliment coworkers behind their back.",
            "title_similarity": "0.6624073",
            "sentiment_compound": 0.128
        },
        {
            "id": "hj8l4ca",
            "score": 2,
            "text": "I would say that coworkers are never your friends. All workers are compared against one another at EOY performance reviews and the bottom few are cut. So when one employee does well, it's at their peers' expense.\n\nAnd when you and your family's healthcare is tied to your continued employment, not to mention your ability to feed, house, and clothe yourself, there's immense incentive to sabotage others, or at the very least to hold on to those nuggets of potentially harmful information you divulged about yourself last year at the Christmas party.\n\nWelcome to the corporate Squid Game. I hate the system, but that's how it is at the majority of workplaces.",
            "title_similarity": "0.5336691",
            "sentiment_compound": -0.0199
        },
        {
            "id": "hj8lec9",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.10087939"
        },
        {
            "id": "hj8m0nl",
            "score": 1,
            "text": "Don’t share socials either",
            "title_similarity": "0.13665542",
            "sentiment_compound": 0.296
        },
        {
            "id": "hj8mim4",
            "score": 1,
            "text": "fuck them - I hope they gossip how much I hate everyone",
            "title_similarity": "0.38193524",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hj8mqtq",
            "score": 6,
            "text": "This younger gal I worked with talked about everyone. I’d always nod along and laugh with her but I never contributed to the gossip (because I don’t remember shit about anyone.)\n\nShe’d get issues with others and took comments a little too personally",
            "title_similarity": "0.57602453",
            "sentiment_compound": -0.6858
        },
        {
            "id": "hj8mvwt",
            "score": 4,
            "text": "My defining threshold is generally how many friends/acquaintances I've met *through* them that aren't at the workplace. Also when you're almost always talking about stuff that isn't related to work at all.\n\nIf I've met your wife/husband, your parents, or some of your friends from college at board game nights, and hit it off with some of them too? \n\nYeah we're friends, because I trust that you probably don't want to be awkwardly explaining why I'm not showing up to your game nights all of a sudden while your college buddies are hitting me up in my DMs asking me if everything's ok, or telling your mom why she can't see that charming fellow from your work that she met at karaoke night again, all over some office drama.",
            "title_similarity": "0.5682306",
            "sentiment_compound": 0.7274
        },
        {
            "id": "hj8n6pm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0848498"
        },
        {
            "id": "hj8ngg5",
            "score": 1,
            "text": "Fuck that. I actually want to get fired.",
            "title_similarity": "0.40538025",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hj8obz5",
            "score": 2,
            "text": "This is a good LPT for those peeps into a new work environment.",
            "title_similarity": "0.5375422",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj8oewd",
            "score": 2,
            "text": "Learned this thing hard way !!!",
            "title_similarity": "0.32530808",
            "sentiment_compound": -0.3129
        },
        {
            "id": "hj8oia1",
            "score": 10,
            "text": "If you’re in the military it’s simple: infantry, you are colleagues. military intelligence, you are bitter enemies who play nice, any logistical branch, bffs",
            "title_similarity": "0.6474308",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hj8oogj",
            "score": 2,
            "text": "I tell my coworkers all my shit if it comes up, I don’t have the patience to run a mental filter for half of my day.  “Hey turnips you ever done acid?”  “Fuck yeah employee I supervise, it’s my favorite drug of the many I’ve tried”.  “Hey turnips how about religion right?”  “Nah man I’m good but do your thing.”  I’m not going out to events with these people after hours, but I spend more time with them than I do my wife, so I’ll be damned if I’m gonna pretend to be someone I’m not.",
            "title_similarity": "0.57183135",
            "sentiment_compound": -0.5432
        },
        {
            "id": "hj8oqnr",
            "score": 2,
            "text": "This is a constant paranoia of mine, I find that when I’m done hanging out with a co-worker I rack my brain for all of the possible work place repercussions. \nI do not hang out with people who gossip especially.",
            "title_similarity": "0.5434021",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hj8orl1",
            "score": 1,
            "text": "Some of my best friends I met through work. One of them met and married my wife's sister. Another is married to one of my good friends from high school, meeting through me. It's not that hard to tell the difference between people you can actually get close to and who should just remain casual acquaintances.",
            "title_similarity": "0.7150355",
            "sentiment_compound": 0.9371
        },
        {
            "id": "hj8p12g",
            "score": 1,
            "text": "Whazzup Machiavelli!",
            "title_similarity": "0.2872356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8p1no",
            "score": 2,
            "text": "Never feel bad for the environment!\"",
            "title_similarity": "0.41123658",
            "sentiment_compound": 0.484
        },
        {
            "id": "hj8p5a2",
            "score": 22,
            "text": "Too fucking late 🤦🏽‍♂️",
            "title_similarity": "0.11552327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8p7oy",
            "score": 6,
            "text": "Lmao that's what I'm finding out!!",
            "title_similarity": "0.34176052",
            "sentiment_compound": 0.6688
        },
        {
            "id": "hj8pk9s",
            "score": 2,
            "text": "I think that goes for all friends, be careful about gossip and how much you share.",
            "title_similarity": "0.84474015",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hj8pmvw",
            "score": 15,
            "text": "I work in a school with what I thought were great caring people. A few weeks ago I got pulled into the office because a coworker was distraught that I said I was going to report her to HR. I never said or thought that and was blindsided myself. I don’t know who or why someone made that rumour up",
            "title_similarity": "0.4981335",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hj8pofg",
            "score": 1,
            "text": "I’ve mostly worked in education and I would say it depends on the friends, the situation. Not a life pro tip. If you’re trying to say don’t shit where you eat, that’s a LPT.",
            "title_similarity": "0.63137645",
            "sentiment_compound": -0.128
        },
        {
            "id": "hj8ptm1",
            "score": 2,
            "text": "LPT: “Work friends” are not friends. They are coworkers. When you are at work they are not your friends. DO NOT SHARE GOSSIP EVER. Talking about some behind their back tells everyone that you will gossip about them behind their back as well… don’t worry about HOW MUCH you share. If you gossip to one you WILL at some point gossip about ALL.",
            "title_similarity": "0.6958916",
            "sentiment_compound": -0.8511
        },
        {
            "id": "hj8pty7",
            "score": 18,
            "text": "I hate this viewpoint. I’ve had coworkers that were great friends. We would even hang out outside of work.",
            "title_similarity": "0.63946056",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hj8puc9",
            "score": 1,
            "text": "I think it totally depends on the nature of your work. Some of my lifelong best friends started as work friends.",
            "title_similarity": "0.7434009",
            "sentiment_compound": 0.886
        },
        {
            "id": "hj8pzd9",
            "score": 2,
            "text": "Coworkers are not friends they are comrades and it is up to you to organize them.",
            "title_similarity": "0.5419089",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hj8q0ll",
            "score": 5,
            "text": "I met my best friend at my last job, and told her all kinds of things knowing I could trust her. \n\nI’ve worked in other places and told people things, then had my words twisted to manipulate other coworkers. It really depends on the workplace mentality as well as the person you talk to.",
            "title_similarity": "0.73422736",
            "sentiment_compound": 0.9153
        },
        {
            "id": "hj8q6ov",
            "score": 1,
            "text": "Yes and no. My best friend and best man at my wedding next year is someone I used to be a supervisor of and another person in my wedding party is my old Manager at a different job. Also they are also best friends with each other now.",
            "title_similarity": "0.52278954",
            "sentiment_compound": 0.9758
        },
        {
            "id": "hj8qibg",
            "score": 2,
            "text": "And triple down supervisors and managers are bosses first, coworkers second and friends last.",
            "title_similarity": "0.62106746",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj8qnaa",
            "score": 3,
            "text": "i sometimes tell them things just to see how long it takes to change by the time it gets back to me",
            "title_similarity": "0.47377792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8qoqr",
            "score": 2,
            "text": "YES YES YES!! Can't count how many times I heart my coworkers share *every juicy thing* about their lives, like how their husbands cheated on them, money problems, family problems, and all the stuff that people should be keeping to themselves!! Be careful out there guys.. as the saying goes\n\n*trust no bitch*",
            "title_similarity": "0.6962849",
            "sentiment_compound": 0.962
        },
        {
            "id": "hj8qwj6",
            "score": 1,
            "text": "If you don't like gossip you don't care about peope",
            "title_similarity": "0.46321213",
            "sentiment_compound": -0.4973
        },
        {
            "id": "hj8qyt2",
            "score": 2,
            "text": "For me there never was a work friend, all work people were acquaintances as I found working was a competition where you advance on opportunity and qualifications.\n\nAs you advance, you are hiring, mentoring, reviewing and terminating. There is no place for personal interaction effecting your judgment and execution of the responsibilities of the position upon review.\n\nMany people whom are not terribly bright try to work you to embed themselves in the operation. With experience you can smell the strategy.",
            "title_similarity": "0.58629906",
            "sentiment_compound": 0.6506
        },
        {
            "id": "hj8r5bg",
            "score": 2,
            "text": "C-c-c-capitalist propaganda. People are people, stop acting like you're going to win at anything against the normal ass people around you. This whole 'compete with everybody' dipshit crab bucket ultra-materialist philosophy is inane and screams of psychological baggage. dOn'T tRuSt YoUr CoWoRkErS, yeah that's some red-flag shit right there.",
            "title_similarity": "0.48703796",
            "sentiment_compound": -0.869
        },
        {
            "id": "hj8r68i",
            "score": 1,
            "text": "ITS DIFFERENT IN THE NAVY MATE",
            "title_similarity": "0.27103904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8rcqs",
            "score": 2,
            "text": "I mean...I dunno...that depends on the person. \n\nOne of my buddies and I met at an employer quite a few years back.  After I left, he got my old job...then a year later I poached him to come to where I was working (was a much better opportunity for both of us). \n\nIf either of us leaves from where we're at then we'd still be friends first, and if the grass is greener, probably pull the other one if possible after. \n\nHe and I have also been all over the world together, he was the best man at my wedding to a woman I first met when were were both on vacation in Indonesia. \n\nSo, while this is most often true, sometimes you meet cool as fuck people at work who become lifelong friends.",
            "title_similarity": "0.5356591",
            "sentiment_compound": 0.9515
        },
        {
            "id": "hj8rlyk",
            "score": 7,
            "text": "Wherever you don’t feel comfortable talking to people you spend upwards of 40 hours a week with is a bad place.",
            "title_similarity": "0.33522347",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hj8s803",
            "score": 6,
            "text": "THANK YOU. I am just now getting back to the office and we have a bunch of young new hires. They keep way over sharing with me about everything, from divorces to work issues, even though we just met. I will always keep it all to myself and I’m trying my best to be a good listener, but how do they know I’m not going to blab or blow up their lives with their info? People honestly need to stop being so trusting. Polite and friendly =/= trustworthy. I’ve seen a lot of people get backstabbed by work friends.\n\nEdit: forgot to add that I’m their boss so it’s extra uncomfortable lol. I don’t mind it too much but I worry about them gossiping and oversharing with other, stricter supervisors or at future jobs. It makes me cringe to think about how the random TMIs and inappropriateness will affect how people view them",
            "title_similarity": "0.73991716",
            "sentiment_compound": 0.9626
        },
        {
            "id": "hj8s90c",
            "score": 40,
            "text": "God I struggle with this. I get comfortable and start talking like a normal human being, next thing I know someone is coming to confront me after my teenage coworkers have played a game of a telephone with it. Never underestimate how petty and bored the people you work with can be.",
            "title_similarity": "0.6599897",
            "sentiment_compound": 0.7704
        },
        {
            "id": "hj8sb0x",
            "score": 6,
            "text": "Learned that the hard way. My work BFF was a total ahole to me throughout my pregnancy, blew off my shower, never sent a gift, text me constantly during my leave and now that I’m back she constantly whines about having had to cover for me. As if leaving my baby isn’t hard enough.",
            "title_similarity": "0.52723986",
            "sentiment_compound": -0.1464
        },
        {
            "id": "hj8se0x",
            "score": 2,
            "text": "Am I crazy or did someone already post this within the last year on here",
            "title_similarity": "0.16448972",
            "sentiment_compound": -0.34
        },
        {
            "id": "hj8sek1",
            "score": 1,
            "text": "So true, learned it during covid.. (Im in healthcare field). It's very quick these work \"friends\" will suddenly all have preexisting conditions so they didn't need to come in for work...while suggested hanging out in the parking lot for get together because they were lonely.",
            "title_similarity": "0.63953567",
            "sentiment_compound": 0.5709
        },
        {
            "id": "hj8sfig",
            "score": 3,
            "text": "Yup. And this doesn't apply to just while working. This applies to after work as well.",
            "title_similarity": "0.4845273",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hj8sg35",
            "score": 2,
            "text": "There were two guys at work that would show each other their wipes during their toilet breaks.",
            "title_similarity": "0.408821",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8shxf",
            "score": 5,
            "text": "Depends how much cocaine is involved during off hours.",
            "title_similarity": "0.29525185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8site",
            "score": 3,
            "text": "Found out the hard way that this is true",
            "title_similarity": "0.35534",
            "sentiment_compound": 0.34
        },
        {
            "id": "hj8sjgw",
            "score": 7,
            "text": "I might have lost my job because of this. (I lost it because I messed up first and foremost, but this had a role)  \n\n\nWhen I started I worked with a very friendly old man and I kept joking about him letting me do the more advanced work. Little did I know, although he was friendly, this really bothered him and he started reporting any small error I made to the boss.  \nIn my last week I made a small mistake at work. The old man had made the exact same mistake that day and so did another employee as it's a common mistake. On Thursday I was let go for my mistake.  \nI shook everyone's hands and said goodbye and the only one who didn't asked me what happened was that old man.   \n\n\nBe careful, and even being too talkative funny or friendly in certain industries can put a mark on you.",
            "title_similarity": "0.58052635",
            "sentiment_compound": 0.6236
        },
        {
            "id": "hj8smlt",
            "score": 3,
            "text": "LPT: Your job is not as important as friendship. Having friends can last a lifetime, no job does that anymore.",
            "title_similarity": "0.43983558",
            "sentiment_compound": 0.4953
        },
        {
            "id": "hj8sn3d",
            "score": 3,
            "text": "My new role is with 90% women. They love to gossip. As soon as gossip is brought up, I walk away. Guess who doesn’t talk gossip with me anymore; everybody.",
            "title_similarity": "0.47998518",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hj8so22",
            "score": 4,
            "text": "One of my first managers (at a very rural place in the 90s) told me something that really stuck with me when it comes to work place gossip:\n\n\"If a dog gives you a bone, he'll take a bone\"",
            "title_similarity": "0.44358537",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hj8sour",
            "score": 2,
            "text": "I dont agree with this. Work friends are how you make new drug connections.",
            "title_similarity": "0.511592",
            "sentiment_compound": 0.2477
        },
        {
            "id": "hj8sqr8",
            "score": 3,
            "text": "Yes and no, like many things in life.",
            "title_similarity": "0.29232535",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hj8sytr",
            "score": 5,
            "text": "Leave your job and see how many of your work friends are actually your friends.",
            "title_similarity": "0.7200594",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hj8t25h",
            "score": 5,
            "text": "Oh man did I learn this the hard way!\n\n5 years in a union multinational company for 5 years and witnessed some brutal nepotism and boss stroking bullshit like you wouldn't believe.\n\nI left there some 20 years ago and the worst offenders then are in positions worth 150k/yr now.  \n\nNo sour grapes but fuck those people.",
            "title_similarity": "0.33361608",
            "sentiment_compound": -0.9168
        },
        {
            "id": "hj8t66e",
            "score": 1,
            "text": "I refuse to have work \"friends\" they are colleagues. People talk about work life balance, for me it's that, personal and professional worlds can't mix.",
            "title_similarity": "0.45112884",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hj8t6q5",
            "score": 1,
            "text": "I always kinda wonder about advice like this. We're not talking about construction jobs or blue collar work here, we're talking about office jobs, right?\n\nWell if you're working in an office, instead of being bound by office culture, have you considered being good enough at your job that you could just ... move to another another one if you had to?\n\nSo stop giving a shit about all of this nonsense, be good at what you do, and if someone tries to sabotage you because you told them something and it works, just fucking leave and go get a better job with more pay elsewhere. Who cares? Who wants to work at a shithole place with little children for coworkers anyway?",
            "title_similarity": "0.6175622",
            "sentiment_compound": 0.5805
        },
        {
            "id": "hj8tgze",
            "score": 5,
            "text": "One of my best friends joined my company a few years ago. I was training him and he seemed like a nice bloke. He rocks up to work later in his first week in a Williams F1 team jacket. Instant best friends. I went to the Australian Grand prix with him and his family a few weeks later. I've since left the company and we are still really really good friends. Fellow F1 fans are hard to find haha.",
            "title_similarity": "0.51926535",
            "sentiment_compound": 0.9856
        },
        {
            "id": "hj8touz",
            "score": 4,
            "text": "This could be an LPT every day and it still wouldn’t be enough. If you are young professional or in a new career, please listen to this!",
            "title_similarity": "0.4981234",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hj8tqed",
            "score": 1,
            "text": "If you don't spend time with them outside of work or work functions they aren't your friends at all, not even just second to being a colleague.",
            "title_similarity": "0.42628086",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hj8txxa",
            "score": 2,
            "text": "Just never say anything bad about anyone at work in general. I was told that as a core truth. Anyone could be anyone's nephew or something and get you fired.",
            "title_similarity": "0.65926147",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hj8uf4c",
            "score": 2,
            "text": "yep this 100%. coworkers will gossip and make up anything",
            "title_similarity": "0.536579",
            "sentiment_compound": 0.128
        },
        {
            "id": "hj8uhl0",
            "score": 2,
            "text": "Finally, a legit LPT. 🙏👌",
            "title_similarity": "0.23795551",
            "sentiment_compound": 0.7297
        },
        {
            "id": "hj8uony",
            "score": 3,
            "text": "In the military your \"work friends\" are 50/50 the best friends you'll ever have and always keep in touch with and share the deepest darkest secrets to, or you'll just talk to each other every five years or so.",
            "title_similarity": "0.5141697",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hj8uqpa",
            "score": 3,
            "text": "Don’t shit where you eat. This is a valuable life lesson for both relationships and friendships in the work place.\n\nI shat where I ate on both occasions and once it turns negative on you you’re in idiot for falling for it in the first place.",
            "title_similarity": "0.7340585",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hj8urf2",
            "score": 2,
            "text": "This also goes with my LPT: Do not under any circumstances add colleagues to Facebook, no matter how good of a work friend they are.",
            "title_similarity": "0.53085613",
            "sentiment_compound": 0.7207
        },
        {
            "id": "hj8utwg",
            "score": 1,
            "text": "Unless you work for a corporation with an aging workforce tucked away in some suburban corporate park, this isn’t true.",
            "title_similarity": "0.30077863",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hj8uwfd",
            "score": 1,
            "text": "Never talk shut about your boss to a colleague. Ever.",
            "title_similarity": "0.38610405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8uxiw",
            "score": 1,
            "text": "seems like this depends on your job",
            "title_similarity": "0.4108488",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hj8v4fz",
            "score": 1,
            "text": "Working in retail and food service, sleeping with coworkers and supervisors is fairly common 😂",
            "title_similarity": "0.6000641",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj8v5cb",
            "score": 4,
            "text": "I have a couple work friends that I would absolutely hang out with outside of work but those 3 are the only ones, I get along with the rest of them fine but I don't think I'd enjoy being around them unpaid.",
            "title_similarity": "0.58338135",
            "sentiment_compound": -0.0495
        },
        {
            "id": "hj8v7v8",
            "score": 2,
            "text": "It’s amazing how fast colleagues will leave once they get the information they want. Work people by and large are not your friends.",
            "title_similarity": "0.56440777",
            "sentiment_compound": 0.3283
        },
        {
            "id": "hj8v8uz",
            "score": 2,
            "text": "I have learned this the hard way. It just sucks because work can be stressful and you want someone you can be open with throughout the day, but you have to keep that level of distance no matter how friendly they seem. This goes quadruple at least for bosses.",
            "title_similarity": "0.6676646",
            "sentiment_compound": 0.3047
        },
        {
            "id": "hj8v94e",
            "score": 13,
            "text": "I used to work on the weekends off the clock to fix a busted project.  I really didn't care about the pay it was just a passion project.  It was a big deal as it was a multi million dollar project we were ready to scrap, and after I was done, it ended up being a product our clients demanded. \n\nOne of my coworkers and my boss kept 'checking up on me', and it turned out they took credit for everything.  Both of them got promoted for it, and that pretty much wrecked my desire to work hard for like 10 years.  Back then I was naive enough to assume we were all a team and they wouldn't do that, now I'm a bit jaded about work.",
            "title_similarity": "0.525541",
            "sentiment_compound": 0.8399
        },
        {
            "id": "hj8v97s",
            "score": 1,
            "text": "Yeah this is definitely a nice tip depending on your industry and how shit the people are you work with.",
            "title_similarity": "0.65825194",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj8v9kz",
            "score": 2,
            "text": "Worked with friends. Reported to friends further up the chain that I was and I have had friends be direct reports. Some friends were from other companies that stayed in touch and some were friends that I met completely outside of whatever company.\n\nMy go-to way to set expectations: \"I will never ask you to choose between food on your table and our friendship.\" and that while we are in the office, we're not friends.\n\nIt keeps things simple. Has worked really well.",
            "title_similarity": "0.7266848",
            "sentiment_compound": 0.9534
        },
        {
            "id": "hj8vat5",
            "score": 3,
            "text": "and also don’t date them cause they end up being a narcissistic sociopath 😭",
            "title_similarity": "0.3049779",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hj8vc81",
            "score": 1,
            "text": "I disagree- Working with friends is the best.",
            "title_similarity": "0.53329766",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hj8vdzu",
            "score": 3,
            "text": "The only exception to this rule is when you feel that your boss has truly become your friend. He vouches for you, he looks out for you, he gives you the biggest possible raise he can and you have a friendly relationship outside of work. It pays to have real allies",
            "title_similarity": "0.7107724",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hj8vg16",
            "score": 1,
            "text": "This is something I’m having to learn about civilians",
            "title_similarity": "0.478455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8vh8b",
            "score": 5,
            "text": "Yep. My friend C who works at a school department who is also a grad student there is in a hell situation because of this. C was shooting the shit with their advisor. The department head had some kind of personal problem with C so they went to every other employee to get every shred of dirt on C they could possibly find and compile it into a document. Phrases like “I hate men” were taken out of their obvious joking context in personal conversations with C’s advisor and added to this document. Now C is on probation.",
            "title_similarity": "0.5102569",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hj8vh9x",
            "score": 2,
            "text": "I distance myself fr coworkers outside of the office. Whenever they add me or follow me on social media I block them. I've been confronted before and I just say I don't want to mix work with anything I post online.",
            "title_similarity": "0.51197284",
            "sentiment_compound": -0.6023
        },
        {
            "id": "hj8vhxe",
            "score": 3,
            "text": "Ohhhhh yessss. Because ppl will have NO PROBLEM ratting you out if it means their job vs yours or them being promoted vs you. People won’t think twice to throw you under the bus in the blink of an eye and it doesn’t matter how close you THINK you are to that person. I’ve learned this the brutally hard way.",
            "title_similarity": "0.6558961",
            "sentiment_compound": -0.0624
        },
        {
            "id": "hj8vju5",
            "score": 1,
            "text": "Yeah this is so true.  So many snakes out there",
            "title_similarity": "0.3147958",
            "sentiment_compound": 0.7019
        },
        {
            "id": "hj8vn53",
            "score": 2,
            "text": "Excellent advice. If anything is said to you about work by a work friend but not at work make sure you write it down. What he said and your response. Hopefully you will never need to recall those notes but you have them just in case.",
            "title_similarity": "0.74112463",
            "sentiment_compound": 0.8735
        },
        {
            "id": "hj8vv03",
            "score": 1,
            "text": "Oh oops I just started dating a coworker.",
            "title_similarity": "0.55834204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8vycx",
            "score": 2,
            "text": "This is excellent advice. Of course, it will vary from situation to situation, but if you're not actively hanging out outside of work, you might just be work friends and not actual friends. There is a difference, and in the worst cases, might bite you in the butt.\n\nBut also, you should probably get into the habit of not gossiping with co-workers in the first place, or at least keep it to a minimum. Avoid the problem altogether.",
            "title_similarity": "0.6720837",
            "sentiment_compound": -0.859
        },
        {
            "id": "hj8vzjm",
            "score": 1,
            "text": "Eh. You gotta learn how to tell the real mfs from the fools and sociopaths.",
            "title_similarity": "0.5659573",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hj8vzkv",
            "score": 1,
            "text": "Tell this to cops, firefighters, nurses, EMTs, pretty much any first responder profession.",
            "title_similarity": "0.44735256",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hj8w0ic",
            "score": 2,
            "text": "While in university, I was working a full-time job where most of the staff are friends on and off work but a supervisor was caught giving \"bonuses\" to two co-workers who were dating and sharing videos of them doing the deed to him. The three of them were fired (they were also asked to pay back the \"bonuses\") which led to a fellow colleague and myself as acting supervisors for a few weeks.",
            "title_similarity": "0.56810427",
            "sentiment_compound": 0.9209
        },
        {
            "id": "hj8w3qr",
            "score": 2,
            "text": "Uhmm... Yeah, no shit??",
            "title_similarity": "0.07726057",
            "sentiment_compound": 0.6688
        },
        {
            "id": "hj8w4qo",
            "score": 3,
            "text": "I largely agree, but this attitude hurts employees in some areas. For example, compensation. I freely discuss compensation and encourage everyone else to do the same. The only way you can knock down barriers to unequal pay is to have open, honest conversations about it.\n\nPolitics and religion, on the other hand…hell no! I run from those conversations!",
            "title_similarity": "0.62474775",
            "sentiment_compound": 0.8039
        },
        {
            "id": "hj8way0",
            "score": 1,
            "text": "LPT, show up and try to provide value, you will not be fired.  \n\n\nDepending on skill level, you may not even have to work hard.",
            "title_similarity": "0.5068589",
            "sentiment_compound": 0.6025
        },
        {
            "id": "hj8wc87",
            "score": 2,
            "text": "Who cares u pay half what u make to rent anyway",
            "title_similarity": "0.26849976",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hj8wivm",
            "score": 2,
            "text": "Holy shit. Yes. This.",
            "title_similarity": "0.10867305",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hj8wkqk",
            "score": 2,
            "text": "A lot of LPTs that make it to r/all have MASSIVE caveat. This one does not.",
            "title_similarity": "0.2070368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8wl9d",
            "score": 2,
            "text": "One of the best advice I got when I first started working was that I did not need to be friends with my coworkers as long as I can work together with them to get the job done.",
            "title_similarity": "0.64262295",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hj8wn61",
            "score": 1,
            "text": "sounds like a tip from HR.",
            "title_similarity": "0.42135078",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hj8wnc8",
            "score": 1,
            "text": "It depends on the group you work with doesn't it? Be wary in general if you want, but stereotyping it to \"work friends\" isn't fair.",
            "title_similarity": "0.5988276",
            "sentiment_compound": 0.4323
        },
        {
            "id": "hj8wowu",
            "score": 2,
            "text": "Get laid off or fired from a job and see how well those “friendships” last. You are a number like everyone else. Learned this the hard way a couple of times.",
            "title_similarity": "0.6576673",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hj8wozy",
            "score": 1,
            "text": "This sounds like someone just trying to argue against working class solidarity without saying it.",
            "title_similarity": "0.46429348",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hj8wr6p",
            "score": 4,
            "text": "I recently departed from a company and worked with 4 other guys. We really bonded over 3 years and I truly thought we were a family. I haven’t heard once from them since.",
            "title_similarity": "0.37333837",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj8wtam",
            "score": 1,
            "text": "How many times is this same \"LPT\" gonna get posted",
            "title_similarity": "0.28883606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8ww0f",
            "score": 2,
            "text": "Yeah, no. Four of five of my longest friendships started as colleagues. Always were and always will be friends first.",
            "title_similarity": "0.50742865",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hj8wwrn",
            "score": 7,
            "text": "I lost a 7 year career over workplace gossip when I divulged too much to \"friends\", who then weaponized my secrets against me in a smear campaign. It's a hard lesson that still hurts years later.",
            "title_similarity": "0.43810743",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hj8x3kc",
            "score": 1,
            "text": "This! I’ve worked in the same industry with basically the same people for 12 years now and have mastered saying a lot while saying nothing. I once asked my coworker… outside of my name and what car I drive what do you know about me? And they couldn’t think of anything and honestly I was very happy about that. They know what I want them to know.",
            "title_similarity": "0.47020817",
            "sentiment_compound": 0.8217
        },
        {
            "id": "hj8xaqr",
            "score": 2,
            "text": "That's why you gotta do drugs with them to solidify the pact of discretion",
            "title_similarity": "0.46923772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8xbvb",
            "score": 2,
            "text": "Sounds like somebody got burned",
            "title_similarity": "0.20460682",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hj8xdgn",
            "score": 2,
            "text": "I say this all the time. People get familiar with you at work and think they are your friend. No. We work together Kyle. That’s it. I don’t wanna hang out, I don’t wanna text you and I definitely don’t want to be your friend. Never confuse good mornings and smiles as friendships. I dress the same everyday for work just so people see the same shit daily. Gray slacks and black shirt. (Not a uniform lol) People at work think they know me. They’ve never seen me with regular clothes on or outside of our shop.",
            "title_similarity": "0.66053605",
            "sentiment_compound": 0.814
        },
        {
            "id": "hj8xe5w",
            "score": 1,
            "text": "My largest, best and oldest group of friends are from a company we all worked at together over twenty years ago.",
            "title_similarity": "0.39837357",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hj8xho9",
            "score": 1,
            "text": "just keep your head down at work and never speak to anyone unless spoken to.",
            "title_similarity": "0.2934055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8xlui",
            "score": 2,
            "text": "My favorite is when coworkers start dating and are *shocked* that their new SO acts differently outside of work lol",
            "title_similarity": "0.66692096",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hj8xtst",
            "score": 2,
            "text": "Yup, moment your relationship sours you're fucked",
            "title_similarity": "0.3704611",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hj8xyqo",
            "score": 1,
            "text": "Facts facts facts.",
            "title_similarity": "0.24117549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8xz1f",
            "score": 4,
            "text": "Got burned twice. \nWhen I first immigrated to the US this coworker became a friend and we went off-roading and stuff and he invited me into his home. Later out of the blue he accused me of being illegal and contacted immigration. I was legal so all was fine. But damn. \n\nSecond was my colleague of 10 years. We shared a room for 10 years and talked about everything and helped each other out. I saw him as my second best friend. Then the company structure changed and everybody became crazy and he all of a sudden worked against me and tried to push me down. I quit and left him do this crap on his own. \n\nThat was the last time I considered a person at work a “Friend”.",
            "title_similarity": "0.49683076",
            "sentiment_compound": 0.5472
        },
        {
            "id": "hj8y0vz",
            "score": 1,
            "text": "What if they are friends before they become colleagues and what if you recruited them into your family business. I wholeheartedly agree about being careful about gossip and sharing but you can't retroactively distance a friendship and unshare anything. I think that this is great advice for people you meet at work but for smaller town communities and businesses the paradigm of working together in this day and age is shifting towards less hierarchy more enlightened collective/partnership.",
            "title_similarity": "0.7873192",
            "sentiment_compound": 0.9612
        },
        {
            "id": "hj8y4c9",
            "score": 1,
            "text": "A lot of country music songs bout to get cancelled.",
            "title_similarity": "0.23923716",
            "sentiment_compound": -0.25
        },
        {
            "id": "hj8ybl9",
            "score": 1,
            "text": "Soooooooooo true",
            "title_similarity": "0.1873274",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hj8z1lt",
            "score": 1,
            "text": "Speak for yourself",
            "title_similarity": "0.32905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8z9i1",
            "score": 1,
            "text": "good lesson to learn. overshare is a thing",
            "title_similarity": "0.5264363",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj8zbpa",
            "score": 2,
            "text": "It’s true. I once worked with a very small team and we all had a mutual unliking to our boss, so of course we complained about him when he wasn’t around. Sometimes even complained through texts (big mistake). One of our teammates left the business on not so good terms and decided to share screenshots of our texts to the boss. Luckily for us we kept our jobs and it was just never talked about. Was still a horrible job and we all eventually left, but I learned my lesson on how much I gossiped and complained with colleagues.",
            "title_similarity": "0.65953434",
            "sentiment_compound": -0.8487
        },
        {
            "id": "hj8zete",
            "score": 1,
            "text": "As I was told many years ago, *know your audience..*",
            "title_similarity": "0.5276772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8zjvw",
            "score": 1,
            "text": "In my experience, there are basically 4 levels of work closeness.  From farthest to closest:\n\n1.  Toxic weasels that you minimize contact with at all cost\n 2. Colleagues that you strictly work with professionally, but would probably never associate with outside of your work environment\n3.  Work friends that you have a more casual relationship.  Chat with.  Might grab a beer with.\n4.  People that you’ve done crazy shit with and are down to party.",
            "title_similarity": "0.6589447",
            "sentiment_compound": 0.3269
        },
        {
            "id": "hj8znwy",
            "score": 1,
            "text": "There's a lot of people asking for raises. We should be bold with these companies.",
            "title_similarity": "0.45525604",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hj8zpox",
            "score": 1,
            "text": "Another thing to keep in mind is for those who don't have a fulfilling social life outside of work. Do to not fall into the trap of thinking that your new job that essentially takes up all your time and is filled with social interactions will be filling that void, this is how blurring the lines of coworkers / friends can begin and have you saying things you shouldn't.\n\nAs the title says, \"work friends\" are colleagues first and friends second.",
            "title_similarity": "0.7358148",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hj8zrw3",
            "score": 1,
            "text": "Oops 🤷🏻‍♀️",
            "title_similarity": "0.06637084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj8ztdz",
            "score": 2,
            "text": "I completely disagree with this, work with some of my best mates. Always mates before the company.",
            "title_similarity": "0.63056594",
            "sentiment_compound": 0.3197
        },
        {
            "id": "hj8zx75",
            "score": 1,
            "text": "\"Work friends aren't friends\" will keep you out of a lot of drama and trouble.",
            "title_similarity": "0.6292622",
            "sentiment_compound": -0.2856
        },
        {
            "id": "hj8zx9f",
            "score": 1,
            "text": "Yeah avoid to be friendzoned manager. Had very bad experience of it",
            "title_similarity": "0.35099697",
            "sentiment_compound": -0.5849
        },
        {
            "id": "hj904cv",
            "score": 1,
            "text": "Don’t shit where you eat.",
            "title_similarity": "0.30248562",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hj9075r",
            "score": 1,
            "text": "A person I know become BFF with his boss, he gets a promotion and his old “work friends” didn’t want to do what he said bc now he was on charge. Turns out boss and him looks like they are more than just friends lol",
            "title_similarity": "0.68333685",
            "sentiment_compound": 0.9273
        },
        {
            "id": "hj90hu0",
            "score": 3,
            "text": "I like to ride the line between the 2. I work for a small company of anywhere between 4-8 employees depending on the market at the time.  I'm the most senior employee.  If a coworker is being less than useful to the company then ya, I'll tell my boss about it.  \n\nBut a couple years ago we had a guy who was really really good. Top notch work. So good he wanted to start his own company and go independent, which he shared with me. My boss was about to invest some money in him and I said \"well hold on a minute. I know this guy's good, but he's about to jump ship\".\n\nLooking back I wish I hadn't. That was not my information to share. And I wouldn't do it again.",
            "title_similarity": "0.5943308",
            "sentiment_compound": 0.9853
        },
        {
            "id": "hj90je4",
            "score": 1,
            "text": "all friends that operate in a large group",
            "title_similarity": "0.47608912",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj90lgd",
            "score": 1,
            "text": "Never mix work and friendship.",
            "title_similarity": "0.18149513",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj90mjs",
            "score": 2,
            "text": "My best friend invited a work friend to a baby shower.  We were smoking a j out back and the dude ratted my buddy out to get a quick advancement at work.  Friend had 10 years in at the company and 2 kids.  Had to do 3 month mandatory program. We live in a legal rec state.  Fuck work friends.",
            "title_similarity": "0.4234506",
            "sentiment_compound": 0.9349
        },
        {
            "id": "hj90mxx",
            "score": 1,
            "text": "It is true in most cases. I've had a job in a retail store while being a student and there were many students as well. So, we were like a brotherhood and rely on each other because we knew we won't stay forever. I left to continue my studies in another city. I don't talk with anyone now but for sure if I knew one who was in my university, we helped each other with homework, books, etc.",
            "title_similarity": "0.591693",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hj90rcv",
            "score": 1,
            "text": "My entire department gossips and shares personal info with all the department’s employees. It’s terrible. Even the managers will do that. “Hey so-and-so keeps messing up and it’s driving me insane. He does this and this and that and I just can’t stand it.” I stand there and listen because I can’t really tell my managers it’s not something that needs to be shared. The name-dropping is what gets me. Nothing is personal. I can expect that whatever I say will get spread within the department 100% of the time. Even if it’s behind closed doors.",
            "title_similarity": "0.5393853",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hj90te6",
            "score": 2,
            "text": "Never tell a coworker something you aren’t ok with the entire company knowing",
            "title_similarity": "0.39200965",
            "sentiment_compound": 0.296
        },
        {
            "id": "hj90xp4",
            "score": 1,
            "text": "Like the 10th time I've seen this reposted in the last 2 days",
            "title_similarity": "0.17041335",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hj90yhb",
            "score": 1,
            "text": "Ppl forgot what class solidarity means.",
            "title_similarity": "0.2829849",
            "sentiment_compound": 0.296
        },
        {
            "id": "hj90zng",
            "score": 1,
            "text": "Also, try to avoid having sex with your secretary. If you can help it.",
            "title_similarity": "0.54197145",
            "sentiment_compound": 0.128
        },
        {
            "id": "hj910bi",
            "score": 1,
            "text": "Yo people will throw you under a bus in a heart beat",
            "title_similarity": "0.25281936",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hj914vr",
            "score": 1,
            "text": "Met a best friend this way. Lpt for kids.",
            "title_similarity": "0.48204574",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hj9165i",
            "score": 1,
            "text": "No.  Get gangster and find your loyalty.  You see these people more than your family",
            "title_similarity": "0.65286005",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hj918qb",
            "score": 2,
            "text": "Literally my advice to every girlfriend I've ever had and none of them have ever listened.",
            "title_similarity": "0.36377674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj91anl",
            "score": 2,
            "text": "Maybe true for you but my employer says we’re all “like a family” so checkmate.",
            "title_similarity": "0.6821462",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hj91h39",
            "score": 2,
            "text": "I used to work with another teacher that would come in and tell these horror stories about how much his wife hated him.  Almost like he needed a therapist and “we” were it. I’m thinking damn.  You poor bastard.",
            "title_similarity": "0.48935366",
            "sentiment_compound": -0.9432
        },
        {
            "id": "hj91l3d",
            "score": 2,
            "text": "Could not agree more! Worked in a department, became good friends with the Director. Learned 95% of the job and was getting paid a fraction of the director’s salary. Since we were friends the director felt they could pass down all their work to me, including late night or weekend calls. Got so good at the job there were rumors of their replacement with me, since they were not performing, was coming and going and they pleased, etc. I was told I was moving to a different department.",
            "title_similarity": "0.5715462",
            "sentiment_compound": 0.9316
        },
        {
            "id": "hj91uev",
            "score": 1,
            "text": "To add to this if you are gonna do this never cast the first stone…wait till you see a few flying…and even then make sure there is alcohol involved…",
            "title_similarity": "0.43197474",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hj91up3",
            "score": 1,
            "text": "the person that is gossiping to you is also gossiping about you",
            "title_similarity": "0.6052388",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hj91x6e",
            "score": 1,
            "text": "Gift and a curse",
            "title_similarity": "0.25275487",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hj91zpj",
            "score": 1,
            "text": "And if someone talks shit about your coworkers to you, don’t let it make you feel special- they talk shit about you to others, too",
            "title_similarity": "0.6574302",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hj921xq",
            "score": 1,
            "text": "I disagree with this sentiment on principle. I think it comes from a kind of unfortunate attitude, I'd hate to work in such a cutthroat environment that you couldn't call a workfriend a real friend.\n\nI understand the idea of not getting too attached work friends are often transient, and many times the biggest connection you have with them is working together, and without that you find you don't share many common interests.\n\nBut I don't think it's healthy to approach work relationships with so much distrust and distance. I've met some of my best friends at work. I think the real lesson is just to cultivate friendships outside of work too, because strong work friendships are rare.",
            "title_similarity": "0.5941949",
            "sentiment_compound": 0.9338
        },
        {
            "id": "hj925au",
            "score": 6,
            "text": "I used to work at places that would say “we’re a family”. Always repulsed me tbh",
            "title_similarity": "0.5483558",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hj9278p",
            "score": 1,
            "text": "If a co-worker talks shit to you about another employee, they’re absolutely talking shit about you to that person.",
            "title_similarity": "0.60938823",
            "sentiment_compound": -0.8166
        },
        {
            "id": "hj92enz",
            "score": 2,
            "text": "I would add, never put your work friends in a situation where they have to choose between being your friend or being a good employee.",
            "title_similarity": "0.53288645",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hj92gej",
            "score": 1,
            "text": "I don’t let colleagues know too much about my personal life. That’s how I avoid the rumor mill.",
            "title_similarity": "0.44765827",
            "sentiment_compound": -0.296
        },
        {
            "id": "hj92hpv",
            "score": 2,
            "text": "'Work friends' are comrades first and colleagues second. Build your trust with them against the system.",
            "title_similarity": "0.8022444",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hj92ias",
            "score": 2,
            "text": "This makes me a little glad I'm in the military. We all get paid the same (based on rank) and if you're not doing your job well. You definitely get called out on your shit. Making friends is so much easier with coworkers because we're not all out to stab each other in the back (most of the time).",
            "title_similarity": "0.66643035",
            "sentiment_compound": 0.6469
        },
        {
            "id": "hj92roy",
            "score": 1,
            "text": "Yes, I've gotten too comfortable with colleagues and said something disparaging about a supervisor before and paid for it later.",
            "title_similarity": "0.7174034",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hj92szf",
            "score": 1,
            "text": "And they will f. You if you give them a chance",
            "title_similarity": "0.4596826",
            "sentiment_compound": 0.25
        },
        {
            "id": "hj92tmp",
            "score": 1,
            "text": "as someone in high school I just assumed they were like those friends you really get along with in class but dont really hang out with anywhere else",
            "title_similarity": "0.55700934",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hj92tvl",
            "score": 1,
            "text": "Yup say something wrong to them and they will snap and make your work life a miserable hell.",
            "title_similarity": "0.35737297",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hj92yrw",
            "score": 1,
            "text": "I feel like the real \"life pro tip\" is just don't talk about people behind their back. I worked in IT for 5 years and they were my real friends the whole time. Maybe it's only certain types of jobs, but i feel like it's very possible for your work friends to be real friends.",
            "title_similarity": "0.54013026",
            "sentiment_compound": 0.9423
        },
        {
            "id": "hj93bji",
            "score": 3,
            "text": "Yes. I have remained friends with many people I have worked with. Do heed this advice by op though.\nI worked briefly for a German company that opened an office in the uk. I was the only male in the office. Gossip was inevitable...the one lady was a wolf in sheep's clothing...she ratted everyone out. Everything that was ever said even in jest was reported. Everyone quit\nThe office closed. I think the whole business eventually closed",
            "title_similarity": "0.4720968",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hj93j8o",
            "score": 1,
            "text": "Have yet to keep in touch with any co worker. I never get friendly in the sense of sharing anything more than surface level. To many whack jobs and asshats.",
            "title_similarity": "0.29939803",
            "sentiment_compound": 0.0444
        },
        {
            "id": "hj93nl6",
            "score": 2,
            "text": "Remember - there’s a difference between a “work friend” and a “friend from work”",
            "title_similarity": "0.6335464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj93ps7",
            "score": 1,
            "text": "Was laid off from my job of two years last year, they say due to covid but I believe that it was due to exactly this!\n\n\nNobody EVER called or even texted to check in. Slowly but surely creeping my way out of the financial hole I dug myself into.",
            "title_similarity": "0.3591358",
            "sentiment_compound": 0.63
        },
        {
            "id": "hj93v2o",
            "score": 1,
            "text": "Just don’t gossip about people even with people you consider friends.",
            "title_similarity": "0.38913327",
            "sentiment_compound": 0.34
        },
        {
            "id": "hj93x88",
            "score": 1,
            "text": "Most colleagues will remain as such no matter how friendly they may come off.",
            "title_similarity": "0.546512",
            "sentiment_compound": 0.4812
        },
        {
            "id": "hj93z9i",
            "score": 3,
            "text": "I do not make friends at work. They aren't on my social media. I don't have any conversations with them that aren't work related. They won't be invited to my house, I won't go to their house. I've had too many people take something that I thought was said in confidence and fuck me behind my back with it. Run to the boss and tell them the joke I made or some shit and get me written up/fired. \n\nNope.\n\nWe're here for eight hours because that's what our collapsing fucking economy demands we do to have food and shelter. I only care about your ability to help me fulfil that goal. I don't give a fuck about your spouse, your kids, your car, your favorite football team, or your home life. \n\nI'm just doing what I need to do so I can go see the people I do care about when this shit is over.",
            "title_similarity": "0.36494866",
            "sentiment_compound": 0.6854
        },
        {
            "id": "hj940nk",
            "score": 2,
            "text": "Work colleagues are not friends, they are work colleagues.",
            "title_similarity": "0.4703799",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hj944n3",
            "score": 1,
            "text": "Linda Tripp presented herself as Monica Lewinsky's \"work friend\"",
            "title_similarity": "0.5926428",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hj94m4y",
            "score": 2,
            "text": "Three Fs my mentor gave me while stepping into a management position:\nFirm, Fair, Friendly.  In that order.",
            "title_similarity": "0.50438243",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hj94odh",
            "score": 2,
            "text": "But what about the ones I've cum inside?",
            "title_similarity": "0.3223331",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj94vhy",
            "score": 2,
            "text": "And then their are friends who become colleagues the hardest I supppse",
            "title_similarity": "0.7237644",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj94xnu",
            "score": 3,
            "text": "I have never, ever, ever understood how people get so super close and forget that it is a work environment (first and foremost).",
            "title_similarity": "0.35316384",
            "sentiment_compound": 0.6238
        },
        {
            "id": "hj9523g",
            "score": 1,
            "text": "My friends I’ve made from work have all hated the place and that’s what initially formed the bond lol. Maybe I haven’t had jobs where people take it seriously",
            "title_similarity": "0.507259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj952se",
            "score": 2,
            "text": "Honestly I've realized most friendship is either about proximity or intentionally.",
            "title_similarity": "0.55374646",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hj957kh",
            "score": 1,
            "text": "Found the former enterprise employee..",
            "title_similarity": "0.49103624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj957yu",
            "score": 1,
            "text": "And who you fuck",
            "title_similarity": "0.22458215",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hj9592p",
            "score": 3,
            "text": "I've made dedicated and great friendships at many of my jobs.  HelI, met my wife while working together.  Just moved across the country and built a home next door to a close friend of mine I met at a job.  Have another group of friends that I was an assistant manager over at my last retail job.  Some of the best guys I know and even though I'm not living near the anymore they still remain caring friends.\n\nIt's not all cloaks and daggers.",
            "title_similarity": "0.59059167",
            "sentiment_compound": 0.9788
        },
        {
            "id": "hj95av3",
            "score": 1,
            "text": "Not true in all careers. Trades are quite different",
            "title_similarity": "0.2023424",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hj95dl6",
            "score": 1,
            "text": "Someone had a bad day",
            "title_similarity": "0.17426488",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hj95f2d",
            "score": 1,
            "text": "Depends on the work and what you’ve been through. People might become trusted mentors or mentees, you may have achieved something that changed your lives. Usually it’s only the work that links you but you’re allowed be mates beyond work.",
            "title_similarity": "0.6823305",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hj95igk",
            "score": 1,
            "text": "Especially in a hospital…",
            "title_similarity": "0.17432201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj95nxj",
            "score": 2,
            "text": "I have first hand experience with exactly this, had a work \"friend\" who always bent the rules and did things he wasn't supposed to. He made me feel like anything goes but the minute I did something he's done 100 times he reported me to the boss and got me fired lol.... Be careful with work \"friends\"",
            "title_similarity": "0.6236863",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hj95qdc",
            "score": 1,
            "text": "As others have said, it depends a lot on the industry. My current close circle of friends are all from work, we no longer work together, some of us didn’t even worked at the same place at the same time but still.",
            "title_similarity": "0.51483804",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hj95qfv",
            "score": 2,
            "text": "This is one of the reasons I really value my job. I do crewing in events/film/tv and you meet and work with so many different people.\n\nMany in this sort of industry are also just pretty interesting people living outside the normal work cycle. You're pretty much guaranteed to find people who you can be really good friends with. Male or female.\n\nPersonally I've disconnected from the few high school friends I had, I'm much closer to my work mates (altho my uni friends are still the closest tbf).",
            "title_similarity": "0.71944666",
            "sentiment_compound": 0.9737
        },
        {
            "id": "hj95qoo",
            "score": 1,
            "text": "This is more of a Life Common Sense than a pro tip.",
            "title_similarity": "0.41610005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj95rk7",
            "score": 2,
            "text": "‘Work friends’ are colleagues ~~first and friends second.~~ Never ~~forget that. Be careful about~~ gossip and ~~how much you~~ share.\n\nFTFY",
            "title_similarity": "0.9302202",
            "sentiment_compound": 0.7065
        },
        {
            "id": "hj95xd6",
            "score": 1,
            "text": "Don’t gossip at all",
            "title_similarity": "0.17269397",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hj95xfb",
            "score": 1,
            "text": "Eh, most of my current friends are ex co-workers and I'm dating one right now. Shitty people will rat you out but friends worth keeping will support you through work hardships. Hell, I've even set up a group chat for 4 ex employees to vent about our shared misery outside of work, still in use today after everyone's left, to share work frustrations, memes, and life updates.\n\n\nThis is, of course, assuming you're not stupid enough to share critical information that shouldn't be shared in the first place.",
            "title_similarity": "0.7364498",
            "sentiment_compound": 0.1306
        },
        {
            "id": "hj964ww",
            "score": 1,
            "text": "this comes up way too often",
            "title_similarity": "0.28154367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9680u",
            "score": 2,
            "text": "Two of my closest friends in the world are coworkers. We have changed jobs together twice in the last decade. We're pretty much a package deal.\n\nIf you are smart about it, and grow the relationships pragmatically, there's no reason you can't make great friends through work.",
            "title_similarity": "0.6671648",
            "sentiment_compound": 0.2387
        },
        {
            "id": "hj96d32",
            "score": 3,
            "text": "That's such a weird American thing.",
            "title_similarity": "0.12491981",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hj96gww",
            "score": 2,
            "text": "Couldn't be more true, I've had \"work friends\" record me talking about what I thought was a private conversation and show everyone. Never underestimate the complete disregard people have for you to move up in a company that doesn't give a shit about them in the first place.",
            "title_similarity": "0.7193632",
            "sentiment_compound": 0.5045
        },
        {
            "id": "hj96ke9",
            "score": 3,
            "text": "I'm always one of the first people to arrive at the break room and I deliberately choose to sit at an empty table during break, just to see who'll choose to sit next to me. The amount of times I was alone is astonishing. But I don't mind (Introvert)",
            "title_similarity": "0.5057388",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hj96qb5",
            "score": 1,
            "text": "But where are you supposed to make friends as an adult if not at work?",
            "title_similarity": "0.51481485",
            "sentiment_compound": 0.631
        },
        {
            "id": "hj975gl",
            "score": 3,
            "text": "Just had an acquaintance get fired for not listening to my advice.  His company was cheating him on hours.  I advised he hire an attorney and find out about reporting them to the state labor board.  So, what does he do?  Ignores all that, but then asks several fellow employees if they want to stage a strike... not enough of them wanted to and the company fired him the first opportunity they got.\n\nWhy bother asking my advice if you're not going to listen to any of it?  Just a waste of my time... and his.",
            "title_similarity": "0.4711944",
            "sentiment_compound": -0.9301
        },
        {
            "id": "hj97cyj",
            "score": 1,
            "text": "Who'd knew that lead to Brexit.",
            "title_similarity": "0.23902577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj97m7y",
            "score": 1,
            "text": "I discuss D&D and play New World with my colleagues. So I think I’m one of those lucky people who have colleagues that are friends (and not the fake kind)",
            "title_similarity": "0.7142152",
            "sentiment_compound": 0.7951
        },
        {
            "id": "hj97miv",
            "score": 1,
            "text": "Don't hook up with and/or fall in love with a colleague. It seriously complicates things.",
            "title_similarity": "0.34657437",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hj97v00",
            "score": 1,
            "text": "I found this out from a nice coworker after 5 years of working at a company, most of the people that would ask me questions and probe for information were just gossiping and shit talking once I left the room, a very classy bunch.",
            "title_similarity": "0.527072",
            "sentiment_compound": -0.0534
        },
        {
            "id": "hj97z3h",
            "score": 1,
            "text": "This applies even in entry level jobs like retail - if your boss wants to be your friend, odds are they just want to get away with wprking less or not working. Can't blame people for the sentiment, but if you're a living breathing person you deserve better.",
            "title_similarity": "0.71134967",
            "sentiment_compound": 0.7555
        },
        {
            "id": "hj9821u",
            "score": 1,
            "text": "lmfao at my last job all we did was gossip and talk shit despite the fact that our owners had a nanny cam behind us that also recorded audio. i was getting paid $12 an hour so you bet your goddamn ass me and my bestie were entertaining ourselves during downtime",
            "title_similarity": "0.5256505",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hj98ijm",
            "score": 1,
            "text": "This is only true if you give a shit about your job. if no shits are given, be regular friends.",
            "title_similarity": "0.73175716",
            "sentiment_compound": 0.5932
        },
        {
            "id": "hj98k7x",
            "score": 1,
            "text": "School friends too, especially in professional school",
            "title_similarity": "0.5683385",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj98kn3",
            "score": 1,
            "text": "Not when you work in a restaurant lmao",
            "title_similarity": "0.28950933",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hj98m3w",
            "score": 2,
            "text": "Don’t know about “never”. A good person is a good person and a friend is a friend. That’s like saying don’t remain friends with somebody you went to school with. How are you supposed to meet people?",
            "title_similarity": "0.60579646",
            "sentiment_compound": 0.9501
        },
        {
            "id": "hj98mgp",
            "score": 1,
            "text": "This applies to some school friends too.",
            "title_similarity": "0.4687227",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj98mls",
            "score": 2,
            "text": "This is SO important!!! Like A #1 business rule. I have watched bosses be ignored because they become funny and back slappy with employees and ultimately losing their jobs because of it. Don’t do it! Especially if you’re the boss.",
            "title_similarity": "0.5431372",
            "sentiment_compound": 0.7861
        },
        {
            "id": "hj98q6k",
            "score": 2,
            "text": "I agree with this 💯.  Treat every conversation as if you're yelling it out loud in the office. Everyone will know if you say something mildly spicy",
            "title_similarity": "0.6084184",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hj98ulg",
            "score": 1,
            "text": "I’m pretty good mates with my boss. We work in catering so we like to try out different restaurants. It’s a pretty tight team that we have and nothing bad is said about each other. I feel pretty lucky with my working environment at the moment.",
            "title_similarity": "0.67519987",
            "sentiment_compound": 0.9634
        },
        {
            "id": "hj99e0o",
            "score": 1,
            "text": "Even though you should be careful what you say (talking shit about someone won't you in any way). I've made very close friends through work. We were made redundant together, found a new job together at the same company, i know his kids and family. Been to his wedding.. We are real friends no question about it. LPT advices are not always 100% true",
            "title_similarity": "0.77990794",
            "sentiment_compound": -0.0139
        },
        {
            "id": "hj99f3b",
            "score": 1,
            "text": "But that's my only friends",
            "title_similarity": "0.38374114",
            "sentiment_compound": 0.631
        },
        {
            "id": "hj99hjc",
            "score": 1,
            "text": "I def spill too much all the time.",
            "title_similarity": "0.28515717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9a9bz",
            "score": 1,
            "text": "Disagree. You make friends at work like anywhere else, and you’re careful with what you say to anyone as they get elevated through your own trust boundaries. I met my wife at work. My best man is someone I worked with. I was best man for another guy at a different business. \n\nNote, you should always be careful with what you say at work, but your trusted friends are your trusted friends.",
            "title_similarity": "0.8463287",
            "sentiment_compound": 0.9789
        },
        {
            "id": "hj9aeh2",
            "score": 1,
            "text": "I don’t know, I have a few friends that I’ve made over the years. It wasn’t automatic either. We all fell in love with shooting and archery plus going to our favorite restaurant afterwards. Same thing with an OR team I worked with. We would hang out at our surgeons house, Pj’s no scrubs,  and pick up take out from our favorite Chinese restaurant and play video games. Unfortunately our Ortho took his own life during the pandemic. We were devastated. He was a perfectionist and someone I loved deeply as my friend. \n\nAnother group was the balls to the wall parting monsters!! However, over the  years. Those relationships fizzle out right when I was recruited for a rural hospital. \n\nThe first groups I mentioned , schedule bi- yearly get together for those of  us whom the left bedside because we became Administrators, Chief Operation  Officers, Directors of Nursing, Consulting paralegals, NPs and MBA, PhD. We also recruited our old friends, who were chilling in Cath Lab.  We all did PRN shifts at our previous hospital ad others in the same system, and it was awesome to be reunited…we laughed every-time one of us would say, “mount up! We are going back into hell” I couldn’t have made it through the first year of the pandemic without them. None of us had any reason beyond helping others to go back to the floor whilst finishing our advanced degrees or working with our advanced degrees. I got luck. Really lucky. They’re all back in their farms and lake houses because we all had COVID and therefore they refused the vaccine. Mine is medical exemption.  \n\nMy mom has a few Cronies like this and some of my people even worked with my Mom! Actually, a majority of them worked with my mom. So the get togethers are quite large. Good thing mom and I get along in our 40’sand 60’s. I suppose that because of their age, interpersonal relationships meant more to them than FB. \n\nI have a few friends from high school that I speak with that did marry into my family, and even though our lives changed, we talk on the phone and see each other on the holidays. My deceased father said he was running a boarding school for girls in our home. We had 3 bedrooms. One bedroom was my parents, the other 2 were un usually large so we had 4 full size beds in one room, a full in my bedroom and bunk beds in my room too. They’re 4 daughters, and we each had to spit a room. Lizzie wasn’t there most of the time because she was my half sister. So I had 3 in my room and 4 in the other room.  When we were teens. My male cousins were our ages and had the same setup. My other cousins would come and stay and we got season passes to Astroworld/Water Wold faithfully. It Was awesome!! We were all married before 20, and It changed everything. We buried our parents (except my mother) months apart from each other. They all have children. My daughter died before I could even hold her because I had a stroke during delivery. But I love all my nieces and nephews. \n\nWork schedules and responsibilities have kept us from being as physical close as we once were. However, it I call, they come. If they call, I go. \n\nSorry for the long rant, but people do grow apart and that’s okay. Had they not, I wouldn’t have met some great people that I now call my friends today. \n\nJust remember that it isn’t personal and that they probably miss you too.  But if your lifestyle is very different to theirs, I encourage you to go to Meetup Groups in your are. You’ll meet some cool people and do something kind of dumb together. True friendship takes time to grow. \n\nBe careful with work friends, especially if you work in a small circle. Hanging out and cat aching a movie, or mani pedis, happy hour, and conferences are a great way to meet a network with others. If you have a few jealous asshole types than be friendly but that’s it. Just see an X on there face. Never let trouble infiltrate your group. \n\nHope this helped. Good luck!!",
            "title_similarity": "0.5019475",
            "sentiment_compound": 0.9976
        },
        {
            "id": "hj9ah5k",
            "score": 1,
            "text": "Met one of my best friends at work :) 20 years later were still thick as theives",
            "title_similarity": "0.4368982",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hj9aj5u",
            "score": 1,
            "text": "Got a group of friends at the office that I’ve been gaming with for the past year, but we’ve been friends for much longer working together. \n\nThought we were close, but one got a promotion and the other convinced himself that the promotion had been “stolen” from him.\n\nHe spent months seething over it and convinced himself we are his enemies now. Couldn’t lash out against the company, so he conflated all his stress and resentment onto us instead. Trying to reason with him is like talking to a wall. It’s all just absurd rage-logic. \n\nBut I am now closer with the rest of the group, at least.",
            "title_similarity": "0.552732",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hj9amt0",
            "score": 1,
            "text": "Yes and no. I think it depends on the job. I've worked in 2 customer service jobs and have been bridesmaid for a former colleague from each.\nI now work corporate and there's definitely way more applicable advice.\nI think you do bond with people when it feels like 'we're all in the trenches together' as opposed to a job where I'm your equal now but that just makes me your competitor for promotions.",
            "title_similarity": "0.6432959",
            "sentiment_compound": 0.5346
        },
        {
            "id": "hj9aupa",
            "score": 1,
            "text": "Some of my colleagues became my best friends. We were at each other's wedding and celebrated Christmas together because we all hate our families for different reasons.",
            "title_similarity": "0.47821724",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hj9av1m",
            "score": 1,
            "text": "You get this so called LTP or a variation of it a lot.",
            "title_similarity": "0.32478386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9avlw",
            "score": 1,
            "text": "This of course depends on the workplace. There also times where it's fine to share things with your coworkers.",
            "title_similarity": "0.7006636",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hj9ayxd",
            "score": 1,
            "text": "Gossip in a circle allways leads to unnecessary drama. Just dont do it lol",
            "title_similarity": "0.3911786",
            "sentiment_compound": -0.4646
        },
        {
            "id": "hj9bc8a",
            "score": 1,
            "text": "My wife learned this one the hard way, when a supervisor she thought was a *friend* threw her under the bus… this was after she drove to comfort her supervisor, in the middle of the night, when the supervisor’s abusive spouse ran out on her",
            "title_similarity": "0.40765408",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hj9bduo",
            "score": 1,
            "text": "I often tell people at work, if i don't see you or spend personal time with you outside at work then you aren't classed as a friend just a really good colleague. I now have 4 friends at work",
            "title_similarity": "0.61593926",
            "sentiment_compound": 0.8588
        },
        {
            "id": "hj9bhox",
            "score": 1,
            "text": "Still, even though they are work friends, if they stab someone in the back, then they are terrible people. So LTP should be: Don't befriend terrible people. If they are putting on an act, then learn to recognize that. There are always clues if you look for them.",
            "title_similarity": "0.69490945",
            "sentiment_compound": -0.3063
        },
        {
            "id": "hj9bsi5",
            "score": 1,
            "text": "Actually, most of the people I regularly keep in touch with I met through work. But if they hadn't reached out first I probably wouldn't be friends with them now.",
            "title_similarity": "0.6022458",
            "sentiment_compound": -0.5824
        },
        {
            "id": "hj9buz1",
            "score": 1,
            "text": "Also be careful with gossip among your regular friends",
            "title_similarity": "0.8498274",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hj9bx11",
            "score": 1,
            "text": "I see work colleague more a “colleague” first and “rival” second, almost never friends.\n\nI am not at work to make friends but I make it very clear on that. I will be friendly and professional though, but won’t be friends on a personal level.",
            "title_similarity": "0.63154805",
            "sentiment_compound": 0.9287
        },
        {
            "id": "hj9cnm2",
            "score": 2,
            "text": "As a person with an invisible disability, 100% this. You never know who will turn on you/spread your business, especially when stigma and misinformation are involved. I live openly except at work, where I’m in the disability closet.",
            "title_similarity": "0.44910347",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hj9cql0",
            "score": 4,
            "text": "Never underestimate who or what someone is prepared to thow under the bus to save their own mortgage payment each month.",
            "title_similarity": "0.43627357",
            "sentiment_compound": 0.7174
        },
        {
            "id": "hj9cuoi",
            "score": 1,
            "text": "If you can't tell the difference, this is a good rule to go by. But I have to ask, why can't you tell the difference? There are people where, you immediately know you're going to be thick as thieves and it's you vs. the world, then there are people where you won't. \n\nKnowing who the \"narcs\" are is something people should naturally learn through life.\n\nIf you truly are unable to tell, I suggest you set a trap by testing them. Tell them something and see whether it gets around, then set it up in such a way that it actually ends up making you look good if management looks into it.",
            "title_similarity": "0.67157096",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hj9cxij",
            "score": 2,
            "text": "Yep, the office bully at my work recently lost her pushover manager who thought they were friends. When she left, bully wouldn’t say goodbye and unfriended her on socials. The manager was shocked, nobody else was.",
            "title_similarity": "0.47862124",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hj9ddi5",
            "score": 1,
            "text": "Wrong work friends are friends with benefits first, then drinking buddies, then poker night suckers and finally co workers. Tell them a ton of lies and truths, no one will believe anything they say, even when they catch you stealing from the Christmas donation bin and try to report you.",
            "title_similarity": "0.5367745",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hj9dduo",
            "score": 1,
            "text": "Man this shit bit my wife so hard. I couldn’t believe the treachery when it happened. I’m still mad about it like 6 years later.\n\nShe was friends with a coworker for like 12 years as they came up in the same company together. Mind you, the friend was the maid of honor at our wedding and we used to do each other’s kids birthdays and such. \n\nOne day, a supervisor crosses a line by opening mocking someone’s disability and my wife sends a text to her friend’s personal phone complaining about it. That friend forwards the supervisor’s boss the text where my wife called the supervisor an idiot. The supervisor and boss ambush my wife at work the next day, tell her she needs to start looking for a new job and will never be allowed out of her current position if she stays. They also threaten to fire her if she reports any part of the mishap or that conversation to HR. \n\nWe got a lawyer, and was basically told there are lot of things companies do that are unfair, but not illegal and to move on. My wife found a new, better job, reported them to HR when she quit. The supervisor’s boss was fired shortly afterward, the supervisor got stuck in a bad position until she retired soon after.\n\nBoth of those women, the supervisor who caused the mess and friend who betrayed a private conversation have separately contacted my wife over the years not to apologize but to fucking catch up like nothing happened! My wife is too polite to tell them to fucking eat glass. \n\nThe whole thing makes me seethe. 9th circle of hell for betrayers.",
            "title_similarity": "0.52179646",
            "sentiment_compound": -0.9537
        },
        {
            "id": "hj9dh2i",
            "score": 1,
            "text": "LPT: if you don't have any actual friends at work, there is either something wrong with you, or there is something wrong with your coworkers. It's not normal to be distrustful of everybody around you.",
            "title_similarity": "0.57432425",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hj9dkv7",
            "score": 1,
            "text": "Unless you’re in the military. Other than that, yes.",
            "title_similarity": "0.24169755",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hj9dmcr",
            "score": 1,
            "text": "If someone talks shit about other employees to you, there's a good chance they're talking shit about you behind your back.",
            "title_similarity": "0.6607832",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hj9dpyr",
            "score": 1,
            "text": "Been covering full holidays for colleagues this summer so they could fully relax without being on call. My time arrives and no one wants to help :-)))))))) \n\nThis is when you get an incredibly toxic work environment and you're the only one trying to make it better.",
            "title_similarity": "0.48567104",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hj9dry4",
            "score": 1,
            "text": "I’m not sure I entirely agree, one of my best friends is an old work colleague.",
            "title_similarity": "0.5728239",
            "sentiment_compound": 0.8454
        },
        {
            "id": "hj9dsmd",
            "score": 1,
            "text": "I'm still friends with some of the colleagues from a job I had 15 years ago. My dad is still friends with colleagues from a job he retired from 20 years ago. This is a horrible attitude, no wonder some people complain they can't make friends as an adult.",
            "title_similarity": "0.5366483",
            "sentiment_compound": -0.5505
        },
        {
            "id": "hj9dtjn",
            "score": 1,
            "text": "But Lisa in accounting is such a bitch. You won’t believe who she’s pegging.",
            "title_similarity": "0.36608076",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hj9dweq",
            "score": 3,
            "text": "Seeing this first hand at my job. We hired a new guy who apparently went out to the bar with another coworker and told him some very personal and embarrassing stuff about his private sex life and said coworker has been going around telling people new guy's business. Hate to see it.",
            "title_similarity": "0.5772234",
            "sentiment_compound": -0.5209
        },
        {
            "id": "hj9e0sz",
            "score": 1,
            "text": "I see this kind of post come up quite often, but I feel it's directed at places with high employee turnover, as for instance in retail. Perhaps its just my own personal experience creating a bias, but I never felt at any of my jobs as an adult, that I had to be careful of being stabbed in the back. I had this feeling as a teenager working in clothing shops, but never again after that.",
            "title_similarity": "0.5078211",
            "sentiment_compound": 0.0484
        },
        {
            "id": "hj9ew2z",
            "score": 1,
            "text": "Wait first and second in what way?",
            "title_similarity": "0.19966415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9f23n",
            "score": 1,
            "text": "Very fucking true",
            "title_similarity": "0.20859838",
            "sentiment_compound": 0.5222
        },
        {
            "id": "hj9f4tn",
            "score": 1,
            "text": "Meh maybe the title isn’t the best. But  obviously it’s not that you can’t make friends at work, is that for example a friend would defend you until the end against a terrible bullying manager. But if said friend is a coworker under that same manager he’s sure as hell gonna be thinking REAL hard about doing that and sacrifice his mortgage in the process.",
            "title_similarity": "0.5821843",
            "sentiment_compound": -0.09
        },
        {
            "id": "hj9fdjp",
            "score": 2,
            "text": "I feel like some people have a much shallower definition of \"friend\" than others.",
            "title_similarity": "0.3814637",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hj9fgpl",
            "score": 2,
            "text": "this is true sometimes but definitely not true all the time\n\nI'm going to be in 2 weddings for coworkers this year, one as a groomsman and the other as the groom",
            "title_similarity": "0.4336532",
            "sentiment_compound": 0.351
        },
        {
            "id": "hj9figt",
            "score": 1,
            "text": "Learned this the hard way",
            "title_similarity": "0.3426956",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hj9foaa",
            "score": 1,
            "text": "Reported the guy for Cleveland?\n\n\"Never was\"\n\n👩‍🚀🔫👩‍🚀🌎",
            "title_similarity": "0.14672196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9g84c",
            "score": 1,
            "text": "I think this depends alot on the work environment or atleast the people. Im not sure which is the norm, but work is a great place to form relationships as an adult. Coworkers of mine have reached out to me when no one else noticed/would. Helped me find help when I could not.",
            "title_similarity": "0.69577086",
            "sentiment_compound": 0.8186
        },
        {
            "id": "hj9gaok",
            "score": 1,
            "text": "Great great great tip! I'm such a blabbermouth and I need to remember this",
            "title_similarity": "0.41755953",
            "sentiment_compound": 0.9273
        },
        {
            "id": "hj9gdha",
            "score": 1,
            "text": "Even better LPT: DONT GOSSIP",
            "title_similarity": "0.4059191",
            "sentiment_compound": 0.6073
        },
        {
            "id": "hj9ge9c",
            "score": 1,
            "text": "I consider all the people I work with close friends, and often hang out with them outside of work.",
            "title_similarity": "0.6278032",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj9gomt",
            "score": 1,
            "text": "Unless you’re Dutch, we say everything to anyone lol",
            "title_similarity": "0.39837992",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hj9gp2u",
            "score": 1,
            "text": "at least you’re in for a second",
            "title_similarity": "0.29062974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9h0p4",
            "score": 1,
            "text": "Yikes. This was the best. Be safe!",
            "title_similarity": "0.39103568",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hj9h1ak",
            "score": 1,
            "text": "Anyone will stab you in the back if they have motive and opportunity",
            "title_similarity": "0.44287878",
            "sentiment_compound": -0.25
        },
        {
            "id": "hj9h1xz",
            "score": 1,
            "text": "That might be a snitch, be careful",
            "title_similarity": "0.47875944",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hj9h3bc",
            "score": 1,
            "text": "And Im here without any job",
            "title_similarity": "0.018316137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9hgba",
            "score": 1,
            "text": "I learnt this the hard way too.   What a dobber.",
            "title_similarity": "0.41426492",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hj9hjac",
            "score": 1,
            "text": "LPT: Don't talk shit about people behind their back no matter if they are collegue, friend or family. If something really annoys you, better talk with that person about it.",
            "title_similarity": "0.6135644",
            "sentiment_compound": 0.7287
        },
        {
            "id": "hj9hni5",
            "score": 1,
            "text": "please do this. i’m currently about to lose my job over hearsay and there’s nothing i can do about it. don’t trust anyone and be mindful of your words.",
            "title_similarity": "0.4455292",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj9hu3v",
            "score": 1,
            "text": "This is a good one",
            "title_similarity": "0.20796584",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj9hvp4",
            "score": 1,
            "text": "I think this depends on the work culture in your country/area. Plenty people who meet at work become proper friends.",
            "title_similarity": "0.6744647",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj9i3b2",
            "score": 1,
            "text": "I had a best friend that I also worked with. I thought everything was fine and then I got promoted. Well she got jealous really quickly and proceeded to put me down at every opportunity over the next few months. Then she got promoted and I thought everything would be fine. Nope she messaged me saying we can’t be friends anymore and that it’s because everything was a competition at work (which I never felt) and that I get treated more favourably and it isn’t fair. \n\nShe then became best friends with another colleague and spent an entire shift joking about how I’ve been replaced and then when I told her to stop because it’s hurtful she said she thought it was fine because I was laughing. I was laughing because I was at work and we had a lot of work to do so couldn’t afford to sort it out then and there. She handed in her notice a couple of weeks later but now she seems to be trying to get me into trouble before she leaves. \n\nI’m never going to have friends at work again, it’s not worth it at all. I get on with everyone I work with, but I don’t want more than that.",
            "title_similarity": "0.5674958",
            "sentiment_compound": 0.9469
        },
        {
            "id": "hj9i5sv",
            "score": 1,
            "text": "People seem to forget you are in a situation where there can be a financial gain to screwing you over.\n\nWork makes some people really strange too. I've had issues with so-called friends that I've managed concocting really weird stories about how they are being screwed over. \n\nI personally won't share salary info for two reasons: I've had people create drama after finding out how much I was earning, see above. Also, there is no reason why you cannot find out what the salary bracket is for a given job online.",
            "title_similarity": "0.5790282",
            "sentiment_compound": -0.5535
        },
        {
            "id": "hj9indc",
            "score": 1,
            "text": "I was raised in a very ... \"political\" household, but not simply, we care about the politics of the government. My mom raised me to be very conscious of how people interact in society, so I had this ingrained in me as I joined the workforce. I still made mistakes, but they weren't too bad, at the end of the day.\n\nMy interaction with this specific concern has almost always been on the other side of the equation. I'm very gregarious and make friends easily. I have had co-workers many times confide in me things they should not, and I've had to gently tell them, I appreciate this, and you can trust me, I will not betray you. But this is a business, do not share your feelings with anyone else in this office.\n\nMy favorite was when we got a new hire and one day I saw I had a facebook request from him. I use Facebook for almost nothing but remembering birthdays so my own facebook is very work-safe, and I assumed if he was connecting his was, too. I looked at his page for a few seconds, then walked to his desk and said, hey, thanks, I appreciate it, glad we're buddies. Do not send a request to literally anyone else at the company under any circumstances. Also, nice tattoo on you ass.",
            "title_similarity": "0.68242556",
            "sentiment_compound": 0.9881
        },
        {
            "id": "hj9ip7h",
            "score": 1,
            "text": "If someone is gossiping about someone with you, they are probably gossiping with someone else about you\n\nMost \"friends\" in work are simply people you have one thing in common with. Work\n\nHow many work people do you actually have non work related conversations with? Most work conversations are about work, people you work with, or incidents that happened in work previously",
            "title_similarity": "0.74370825",
            "sentiment_compound": -0.204
        },
        {
            "id": "hj9is9e",
            "score": 1,
            "text": "As someone who has made good friends through work that I have known for years after not working with them, this is not always the case",
            "title_similarity": "0.5539954",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hj9is9m",
            "score": 1,
            "text": "Had to learn this the hard way",
            "title_similarity": "0.31074634",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hj9izio",
            "score": 1,
            "text": "Yup. I work, get paid and then go home. It amazes me how the same people can work and hang out together. When one goes to another department, they stop talking real quick.\n\nI've never understood that. I try to treat everyone like a human. I ask the same from people at my job.",
            "title_similarity": "0.68959725",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hj9j93d",
            "score": 1,
            "text": "A women I was pally with at work and gave lifts home to occasionally as she lived nearby, was trying to quiz me on my 'party' habits one time and really tried to carry on despite me shutting that conversation down cold. It wasn't much later when she got shitty about something and went over my head to my new boss who I'd been walking on egg shells around to start off on a good foot, getting me an unearned tongue lashing. I was very glad at that point I kept a firm divide between business and personal, not giving this women any ammo.  \nThat's not to say I haven't crossed that line before, but it's a far more calculated dance when I do than just opening up to someone because I like them.",
            "title_similarity": "0.619473",
            "sentiment_compound": 0.6574
        },
        {
            "id": "hj9jdgy",
            "score": 1,
            "text": "“Work friends” is an oxymoron: coworkers are people paid to be around you until it’s more profitable for them to stab you in the back.",
            "title_similarity": "0.68810153",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hj9jrib",
            "score": 1,
            "text": "This advice came a couple of days too late. Betrayed anf backstabbed by the person whom I was with before we started working, we were in training in the other city together. She is such a sweet-talker, charity worker. Threw me under the bus in an instant I drank fire afterwards. If I wasnt the person who doesnt like leaving dead leaves when I leave, I'd tell on everything she did.",
            "title_similarity": "0.49800542",
            "sentiment_compound": -0.3544
        },
        {
            "id": "hj9jsa8",
            "score": 1,
            "text": "But always share how much you make. Since that keeps your bosses in check and doesn’t allow them to exploit you.",
            "title_similarity": "0.75844485",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hj9jscg",
            "score": 1,
            "text": "Bollocks. Our friend group all left the company we used to work at at one time or another, and we're still a tight knit group.\n\nBad LPT. Par for the course these days.",
            "title_similarity": "0.5711607",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hj9jw8o",
            "score": 1,
            "text": "Friends today are not necessarily friends tomorrow.\n\nShare nothing you don't want splashed all over the internet.",
            "title_similarity": "0.47050172",
            "sentiment_compound": 0.4424
        },
        {
            "id": "hj9k8ht",
            "score": 1,
            "text": "Here we have a case of: I'm see myself as a better person than average but in reality I'm lacking.",
            "title_similarity": "0.3697834",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hj9ki1d",
            "score": 1,
            "text": "One of my really good friends is someone I met and worked with for about 7 years. I left the engineering firm we worked at and we still hang out atleast once every few weeks. We just went to game 4 of the World Series last Saturday. We really don't talk much about \"work\" and focus on other interests.",
            "title_similarity": "0.42627466",
            "sentiment_compound": 0.8211
        },
        {
            "id": "hj9kjrd",
            "score": 1,
            "text": "Fucking right this is",
            "title_similarity": "0.13028233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9kocx",
            "score": 1,
            "text": "Old timer here, with a valuable life tip (motto) for work that has saved me from drama *many* times over the years: \n\n\n\"Friendly with everyone,  Friends with no-one.\"",
            "title_similarity": "0.68415684",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hj9l1r2",
            "score": 1,
            "text": "LPT Regardless of you relationship status with someone, don’t talk shit",
            "title_similarity": "0.37748998",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hj9l2t8",
            "score": 1,
            "text": "I mostly agree, but when you’re all high schoolers/ first year uni students it is very much friend > colleague. I’m really happy to have people from my work who I can call friends!!",
            "title_similarity": "0.62749374",
            "sentiment_compound": 0.9565
        },
        {
            "id": "hj9ldhf",
            "score": 1,
            "text": "Based on my experience it's better to be cordial but reserved. I had made friends with three co-workers over the past three years. All three of them crossed massive boundaries and I cut them out of my life. Sometimes when people see you as a \"friend\" they think \"Oh, this is the person I can push my luck with and take for granted\". \n\nAlso, don't gossip. What is this highschool? I know some people's 9-5 work, commute and watching reruns of The Big Bang Theory lifestyle is unfulfilling and grey but the kind of people you want who would add some spark in your life are not going to spend time with people who gossip like that. I knew this boring dull woman at work who liked almost nothing, did almost nothing and always wanted to talk to me about some supposed non-issue about someone else and she could not understand why I wasn't interested(of course she ended up gossiping about me too, too \"arrogant\" not to engage in gossip) The only time you should be talking about other people like that is to warn them about them being a confirmed abuser or manipulator.",
            "title_similarity": "0.5985956",
            "sentiment_compound": 0.3581
        },
        {
            "id": "hj9ledd",
            "score": 1,
            "text": "The people I was in the military are far more my friends I’d trust than the fucks I deal with daily in the fire department. Brotherhood? My ass.",
            "title_similarity": "0.6049311",
            "sentiment_compound": -0.323
        },
        {
            "id": "hj9mge2",
            "score": 1,
            "text": "gossip is a sin in my life. if you gossip, I lose respect for you immediately.",
            "title_similarity": "0.5150074",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hj9mj0j",
            "score": 1,
            "text": "Work more, so that's a giant ti me",
            "title_similarity": "0.36499602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9msr1",
            "score": 1,
            "text": "They're not friends",
            "title_similarity": "0.10518544",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hj9mydy",
            "score": 1,
            "text": "The problem with this is that if you believe it to be true, it will be, because you'll never let them become actual friends. And work friends can 100% become real friends, but you are right that you should be careful about it",
            "title_similarity": "0.6023265",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hj9n6v9",
            "score": 1,
            "text": "\"friends\" get thrown around too much/carries more weight imo,  should use \"acquaintances\"",
            "title_similarity": "0.5023861",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj9nbb5",
            "score": 1,
            "text": "Remember in the future your coworker could become your manager. Or vice versa. Be careful what you say/do/share.",
            "title_similarity": "0.7218261",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hj9ndtb",
            "score": 1,
            "text": "Work friends are not friends.  There are co-workers and friends.  Never both.",
            "title_similarity": "0.41426528",
            "sentiment_compound": 0.5641
        },
        {
            "id": "hj9nf71",
            "score": 1,
            "text": "Cake 🍰 day!! Whoop whoop 🙌",
            "title_similarity": "0.26424366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9njsj",
            "score": 1,
            "text": "For a 29 year old man, I gossip too much lol",
            "title_similarity": "0.44966054",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hj9ns92",
            "score": 1,
            "text": "This is why I don’t have work friends. Never shit where you eat",
            "title_similarity": "0.34764478",
            "sentiment_compound": 0.7205
        },
        {
            "id": "hj9o7si",
            "score": 1,
            "text": "stop reposting this advice in different wordings.",
            "title_similarity": "0.31051412",
            "sentiment_compound": -0.296
        },
        {
            "id": "hj9obzu",
            "score": 1,
            "text": "Absolutely great tip .",
            "title_similarity": "0.24015363",
            "sentiment_compound": 0.659
        },
        {
            "id": "hj9opjv",
            "score": 1,
            "text": "This is a pretty pathetic LPT. Yes, some people are just work friends, but I've had several people I used to work with become really, genuine friends. Having friends at work that are meaningful to you is a sign both of emotional maturity and that you're in the right job.\n\nPeople new to the workforce: ignore this advice.",
            "title_similarity": "0.7238498",
            "sentiment_compound": 0.918
        },
        {
            "id": "hj9ox2s",
            "score": 1,
            "text": "Never divulge anything to anybody at work that could be used against you. This is a great LPT. Thanks OP.",
            "title_similarity": "0.49003255",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hj9oyc6",
            "score": 1,
            "text": "Oh man that’s gotta be sucky. My workplace is all real-life friends because we work together but due to being in such a small town we’re all in recovery together. I don’t LIKE everyone but genuinely love them and appreciate them.",
            "title_similarity": "0.68635786",
            "sentiment_compound": 0.9413
        },
        {
            "id": "hj9p3gn",
            "score": 1,
            "text": "You probably shouldn’t gossip about your friends regardless of if you work together or not.",
            "title_similarity": "0.58672416",
            "sentiment_compound": 0.34
        },
        {
            "id": "hj9pblh",
            "score": 1,
            "text": "In the words of a colleague \"You gotta say 'We're not fucking friends, we're colleagues\"",
            "title_similarity": "0.5825671",
            "sentiment_compound": -0.4158
        },
        {
            "id": "hj9pfz0",
            "score": 2,
            "text": "Nobody is a friend. Everyone is an enemy. Be vigilant, ladies and gentlemen.",
            "title_similarity": "0.4489991",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hj9pkhm",
            "score": 1,
            "text": "I agree, to a point, one of my co-workers is one of my closest friends. We bitch about absolutely everything (our work is a toxic hellhole), and will absolutely still be friends long after one or both of us have left.\n\nFor the most part, I agree, I get along with my other co-workers but I wouldn't call us friends, and I am definitely careful about what I share with them.",
            "title_similarity": "0.76503134",
            "sentiment_compound": 0.8117
        },
        {
            "id": "hj9pn43",
            "score": 1,
            "text": "My boss in a team meeting called us “family”. I cringe when I hear this because we are colleagues and coworkers first. If we were family, wouldn’t you have at least invited me over for dinner or a Christmas party? I mean I have worked for you for 3 years. My boss is more concerned about a report or a presentation, because you’re my boss and not mom and dad.",
            "title_similarity": "0.52873456",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hj9q4m5",
            "score": 1,
            "text": "Can confirm... I had a job that did not pay overtime, but most of the staff was required to stick around as long as they could to ensure the customers were taken care of and the job was done correctly and cleaned up. Naturally, this caused a big rift between the people who were putting in OT and the ones who got to leave at 5 everyday (mostly administration and supervisors). We would all talk about saying something, or calling in sick for a day as a way to show administration how important we truly were, but nothing ever really came from it. At some point I got sick of the way me and my \"colleagues\" were being treated, so I started speaking up about it while under the impression my \"friends\" would be right there next to me.... turns out most people are perfectly fine sacrificing they're lives for the bare minimum, and mostly just want to complain about something without actually doing anything about it.",
            "title_similarity": "0.5040869",
            "sentiment_compound": 0.9501
        },
        {
            "id": "hj9q6lj",
            "score": 1,
            "text": "Actually, protests are still effective, that's why",
            "title_similarity": "0.46765506",
            "sentiment_compound": 0.296
        },
        {
            "id": "hj9q8rc",
            "score": 1,
            "text": "The best policy: Who knows it changes constantly to the whims of the ownership class.",
            "title_similarity": "0.54665434",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hj9qit0",
            "score": 1,
            "text": "This is one of the most important things to remember. Ironically, a colleague of mine mentioned this to me!",
            "title_similarity": "0.5630576",
            "sentiment_compound": 0.3367
        },
        {
            "id": "hj9qnin",
            "score": 2,
            "text": "Wish I'd seen this post a couple of days ago -_-",
            "title_similarity": "0.35287148",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hj9r9x3",
            "score": 2,
            "text": "Don't shit where you eat.",
            "title_similarity": "0.30982852",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hj9s2tb",
            "score": 1,
            "text": "I work in healthcare and I made the mistake of trying to be everyone's friend. I try to be a best team player I can be because overall it ends up making everyone's day better and it's reciprocated back to me when I need help. However, I overheard I am a \"kiss ass\" and a \"tattle tale\" despite me never \"tattling\". Apparently being a good team player makes me a kiss ass and I'm not even sure where the tattle tale thing came from. \n\nI've become more reserved at work, still continuing to be a team player, but a lot less social.",
            "title_similarity": "0.6368744",
            "sentiment_compound": 0.6777
        },
        {
            "id": "hj9s40x",
            "score": 1,
            "text": "I didn’t add any current colleague to any social media too. It’s my last day after 5 years, so I might add them, I might just leave it to email though.",
            "title_similarity": "0.2731967",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hj9skxv",
            "score": 1,
            "text": "I actually met one of my closest friends at work. Worked together through college and then continued to hang afterward. We were in each other’s weddings and still continue to spend time together after meeting some 15 years ago.",
            "title_similarity": "0.46567816",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj9smwa",
            "score": 1,
            "text": "This is good advice in general. Trust no one. Everyone looks out for themselves, which is fine, but don't give anyone ammo against you",
            "title_similarity": "0.5857791",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj9sr3i",
            "score": 1,
            "text": "I had to demote a guy last month he asked \"I thought we were friends?\" I replied \"Are we? My friends know where I live. Been to my house.\" Sorry not sorry.",
            "title_similarity": "0.5000021",
            "sentiment_compound": 0.7566
        },
        {
            "id": "hj9st71",
            "score": 1,
            "text": "You see this a lot with people who relocate for a job. They have no social circle, so they try to create one with work colleagues. Big mistake. \n\nBonus LPT: If you relocate for a job, make friends outside of work and find non job-related activities as quickly as you can.",
            "title_similarity": "0.6276778",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hj9sw8q",
            "score": 1,
            "text": "Mhmm, I had to put my hand out to my boss and tell hime we need boundaries. Everyones to mutha-fucking friendly. Lol.",
            "title_similarity": "0.67484343",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hj9t9zw",
            "score": 3,
            "text": "And *ALWAYS* remember: your company cares more about money than you.",
            "title_similarity": "0.52513605",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hj9tphi",
            "score": 1,
            "text": "We aren't friends, we're friendly.",
            "title_similarity": "0.42608947",
            "sentiment_compound": -0.6348
        },
        {
            "id": "hj9u5z8",
            "score": 1,
            "text": "So much this!! When the colleague leaves, they're safer, but still not entirely",
            "title_similarity": "0.51618475",
            "sentiment_compound": 0.3578
        },
        {
            "id": "hj9u99h",
            "score": 1,
            "text": "Also after lifelong friends start working at the same place as you and then you get a promotion and no longer can act like friends because they’ve become shitty at their jobs.",
            "title_similarity": "0.5506162",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hj9uh86",
            "score": 1,
            "text": "What about friends from work?",
            "title_similarity": "0.58161914",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj9uikt",
            "score": 1,
            "text": "I can count on 1 hand the amount a work friends that became actual friends since my first job in 2006.",
            "title_similarity": "0.49338165",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hj9unn6",
            "score": 1,
            "text": "I tell them no more than I’d tell my boss",
            "title_similarity": "0.6396489",
            "sentiment_compound": -0.296
        },
        {
            "id": "hj9uq9c",
            "score": 1,
            "text": "Work friends are people you only hang out with at work. Real friends are people you hang out with anywhere (but in more than just one setting).",
            "title_similarity": "0.6463113",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj9v9yk",
            "score": 1,
            "text": "So true.  Teammate of 4 years recently went to the boss and said i boss her around....   hmmm",
            "title_similarity": "0.55628073",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hj9vb4x",
            "score": 1,
            "text": "Don't make friends with your colleagues, don't shit where you eat.",
            "title_similarity": "0.40984994",
            "sentiment_compound": 0.0951
        },
        {
            "id": "hj9vcjw",
            "score": 1,
            "text": "I learned this the hard way back in my early 20s. Luckily it wasn't my career job, of even a job that had lots of room for growth. But I had a coworker who was super friendly and would ask me all sorts of questions, personal/professional, and then ended up telling the manager literally everything. It was a good life lesson at the end of it all.",
            "title_similarity": "0.60147184",
            "sentiment_compound": 0.9535
        },
        {
            "id": "hj9w746",
            "score": 1,
            "text": "Had a boss that I was really close with. He was the asst. dir. and I and he had a lot in common.  He and the Direktor went to grad school together. They were old friends. I fit right in and we used to stand around chatting and it was fun. It made work a little nicer, too, because it felt like I was working with like minds and I had the freedom to express my honest opinion about projects.\n\nThen the asst. dir. came and said that he had gotten another job and was gonna take it. Another part of the country. I was pretty sad. The time came for him to be done and we made arrangements to meet for dinner and chat. I gave him a gift. I wanted him to know how much the time meant. We laughed, hung out, had a nice time.\n\nWe kept in touch via text for a while, after he moved, but then, he just fell away. I thought that it was just me and I was little sad, but he had taken on a new higher paying position and it was pretty time-consuming. I just assumed that he had been keeping up with his friend the Direktor and some of the other people around here he was close with.\n\nTurns out, he basically ghosted all of us. I was less hurt by this than by the fact that he'd done the same to the Direktor, especially since that was his oldest friend, with whom he'd had more than a decade of shared life and work experience. \n\nCome to find out, through another person he was close with here, that he'd been having an extra-marital affair (his wife was pretty ill, actually and had some serious health problems around the time he left) and that one of the reasons he had dropped all contact was to protect that. \n\nYou think you know a guy.\n\nI'm pretty grateful, because it put me on good standing with the Direktor and I can still go straight to him for advice or for a chat, and he will come by my office to tell me things or share a stupid joke, which is nice. It's professional. We do not chill after work. I wouldn't feel right with that, but, he's still pretty cool and it has helped over the years when I'm trying to see things objectively on a project, or when he's looking for unbiased input and so that's cool.\n\nStill, I'm a little hurt by the asst. dir. and it just goes to show that you have to be very guarded and doubly so at work. Gotta maintain those boundaries.",
            "title_similarity": "0.68867517",
            "sentiment_compound": 0.9928
        },
        {
            "id": "hj9w7bs",
            "score": 1,
            "text": "I never accept or offer social media inventations with new work acquaintances (and my FB is set to private, friends of friends only). I wait to see. I know one guy who is constantly stalking co-workers profiles for info. \n\nThat said, I have several friendships that started at work and one landed me the job I've had for almost 25 years....",
            "title_similarity": "0.539374",
            "sentiment_compound": 0.7661
        },
        {
            "id": "hj9wtik",
            "score": 1,
            "text": "Y'all better listen to this shit, especially for smaller staffed companies.",
            "title_similarity": "0.6719551",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hj9xnk9",
            "score": 1,
            "text": "As a person who barely shares anything(personal) with anybody, this advice is just perfect.",
            "title_similarity": "0.4198209",
            "sentiment_compound": 0.6815
        },
        {
            "id": "hj9xt5a",
            "score": 1,
            "text": "No such thing as work friends, ever.",
            "title_similarity": "0.21943912",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hj9xtvh",
            "score": 1,
            "text": "Unless you're aware that gossiping coworkers are useful tools to spread information that otherwise couldn't be said in a memo",
            "title_similarity": "0.6485026",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hj9xvea",
            "score": 1,
            "text": "“I once worked with a guy for three years and never learned his name. Best friend I ever had. We still never talk sometimes.”\n\n—Ron Swanson",
            "title_similarity": "0.3317592",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hj9y15z",
            "score": 1,
            "text": "I had a coworker who left his login on (we usually shared computers and logged off when changing out our shifts). Don't read emails like that. I saw him and my boss were talking shit.",
            "title_similarity": "0.57899415",
            "sentiment_compound": -0.5122
        },
        {
            "id": "hj9y34z",
            "score": 1,
            "text": "This is like the case with squares and rectangles. Every square is a rectangle - a friend is a friend, no matter where you met them. However, not every rectangle is a square - which means, not every person you consider a friend, is a true one.",
            "title_similarity": "0.57225394",
            "sentiment_compound": 0.9303
        },
        {
            "id": "hj9y64s",
            "score": 1,
            "text": "A coworker once told me DTA. Don’t trust anyone.",
            "title_similarity": "0.43292627",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hj9y9xu",
            "score": 1,
            "text": "My new work colleague talked horrible about the woman who got me said job, not to mention many other things she said. She apparently has a long history of being an asshole/drunk at work. People suck",
            "title_similarity": "0.5146657",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hj9yddf",
            "score": 1,
            "text": "I fell for a coworker I’ve known for 8 months, she says she feels the same…how guarded should I be around her?",
            "title_similarity": "0.5306921",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9yq91",
            "score": 1,
            "text": "It can go both ways and it depends on the person. I had an acquaintance tell me about a job opening where she worked. Initially I was worried about working with someone I knew outside of work because she'd essentially be my superior (she was the charge nurse and I'd be a patient care technician) but it actually became beneficial for us both. We've both been at the company for 12 years. She became the head of clinical education and I'm the chief biomedical technician. I don't think either of us would've risen as far as we have without the other's support. Sometimes it's nice to have someone who knows your life outside of work and not only encourages you, but also holds you accountable when you need that kind of honesty.",
            "title_similarity": "0.50399256",
            "sentiment_compound": 0.8468
        },
        {
            "id": "hj9zc3t",
            "score": 1,
            "text": "Learned that the hard way once before",
            "title_similarity": "0.343543",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hj9ztu6",
            "score": 1,
            "text": "OP just outted himself as the office snitch.",
            "title_similarity": "0.47446418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj9zwam",
            "score": 1,
            "text": "A lot of my work friends are from departments I'd usually never interact with. It's actually pretty nice. Just became friends with them through work sports teams",
            "title_similarity": "0.6098206",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hj9zyv0",
            "score": 1,
            "text": "With that attitude, its no wonder those work friends never turn into real friendships.",
            "title_similarity": "0.508961",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hja08d2",
            "score": 1,
            "text": "Eh. Much of my good will and respect in the workplace comes from the relationships that I have formed over years of *genuinely engaging* with my coworkers. (I get a 5-10% raise each year and essentially get to choose my own manager because multiple people in leadership want me on their team, based on the fact that people find me enjoyable and efficient to work with.) \n\nMy role is even a highly impersonal one. I do legal operations. I negotiate contracts, like an attorney - we're the quintessential buzzkill. I should (and could) be my sales team's worst nightmare, but I've managed to build rock solid trust and respect with them over the years. Through countless happy hours, lunches, and personal conversations, I became someone they're eager to please and be honest with, and they can lean on me when things are tough, even though I'm a rule enforcer and they're rule breakers, practically by definition. So we solve problems together, and they apparently send good reports to my boss. You don't build that kind of trust and understanding without bringing vulnerability and consistent social effort. \n\nMy relationships with coworkers are the absolute most valuable resources of my career. \n\nI have a hard time understanding how relationships are not the priority of every professional, to be honest. The only people I've seen reaching success without putting in social effort are either *absolute fucking geniuses* that everyone gives a pass for being shy, or people who came in at the exact right time to fall into a niche position that no one wants to hire for, and everyone else just quietly resents them. \n\nPlease, for your own sake - be kind, be human, be genuine. It will benefit you far beyond what you can immediately comprehend.",
            "title_similarity": "0.5594406",
            "sentiment_compound": 0.9959
        },
        {
            "id": "hja0hrr",
            "score": 1,
            "text": "i has been always at work place not here to make friends. no friends there, no friends outside hut i have hobby",
            "title_similarity": "0.32255968",
            "sentiment_compound": -0.2519
        },
        {
            "id": "hja0mfn",
            "score": 1,
            "text": "Ayo if I play some PlayStation with my work friends after work hours then they one of the homies",
            "title_similarity": "0.46253693",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hja138n",
            "score": 1,
            "text": "Especially romantic. My mother summed it up as.\n\n'You don't eat and shit in the same place'\n\nNever forget work in a 4 letter word.",
            "title_similarity": "0.5103813",
            "sentiment_compound": 0.7638
        },
        {
            "id": "hja18b9",
            "score": 1,
            "text": "This is so true. Lost count of the amount of best friends my wife has had at work only for them to cut all contact when promoted or change departments.",
            "title_similarity": "0.5886129",
            "sentiment_compound": 0.8761
        },
        {
            "id": "hja1kzp",
            "score": 1,
            "text": "i had so many shitty friends this doesn't apply so much",
            "title_similarity": "0.32730308",
            "sentiment_compound": -0.1317
        },
        {
            "id": "hja23lh",
            "score": 1,
            "text": "Ummm, I hung out with coworkers, and we are still friends despite not being in the same company anymore.  Though they are trying to get me hired there.\n\nHow about don't gossip because it's rude?  Say things as if the person you are talking about is there.  It's useful in and outside of work.",
            "title_similarity": "0.7654953",
            "sentiment_compound": 0.5451
        },
        {
            "id": "hja2nqk",
            "score": 1,
            "text": "I have some real good friends that started as colleagues. Don't let others experience and resulting cynicism deter you from making friends wherever you can find them.",
            "title_similarity": "0.7768445",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hja3nm8",
            "score": 1,
            "text": "I had a work friend, who I would often bitterly complain about the company to.  Later on he became my boss.  \n\nMe:  \"you know, I said a lot of things I wouldn't normally say to my boss\"\n\nHim: \"I know, and while it did make me feel a bit uncomfortable knowing I was getting a promotion\".\n\nMe:  \"Just so we're on the same page, I want you to know I meant EVERY word I said and I take NONE of it back\"",
            "title_similarity": "0.69669235",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hja3r0a",
            "score": 1,
            "text": "Perfectly true from my experience!",
            "title_similarity": "0.3177865",
            "sentiment_compound": 0.807
        },
        {
            "id": "hja42bf",
            "score": 1,
            "text": "Except 1, she's my sister from another mother. We no longer work together but she's amazing and we're still close friends.",
            "title_similarity": "0.5574677",
            "sentiment_compound": 0.8674
        },
        {
            "id": "hja4hl7",
            "score": 1,
            "text": "\"Be not afraid\"\nSir, this is Patrick",
            "title_similarity": "0.33410966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hja4ikf",
            "score": 1,
            "text": "Unless you know they’re a comrade.",
            "title_similarity": "0.5124805",
            "sentiment_compound": 0.0
        },
        {
            "id": "hja4udh",
            "score": 1,
            "text": "I am ashamed to say I learn this lesson at least twice a year.",
            "title_similarity": "0.35372096",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hja5fiv",
            "score": 1,
            "text": "Keep your lips tight, and your knees tighter.",
            "title_similarity": "0.39610755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hja5op2",
            "score": 2,
            "text": "On the flip side, always share how the company treats you, including compensation",
            "title_similarity": "0.7095326",
            "sentiment_compound": 0.296
        },
        {
            "id": "hja5pmg",
            "score": 1,
            "text": "I overheard a coworker say to someone “we aren’t on a sitcom we are actually here to work” and it reminded me how sitcoms like to glorify work friendships as if no one has a life or relationship outside of their work circle and that’s just now how it works IRL.",
            "title_similarity": "0.63540196",
            "sentiment_compound": 0.765
        },
        {
            "id": "hja65cb",
            "score": 1,
            "text": "Used to work at a big name hardware retailer. Ended up staying until they closed the store due to underperformance. I made 2 new friends and re-united with a childhood friend in the process. We were friends while working there, now we are 4 best friends and regularly chat/hang out.",
            "title_similarity": "0.5894742",
            "sentiment_compound": 0.9493
        },
        {
            "id": "hja6769",
            "score": 1,
            "text": "Real LPT: Be careful about gossip and how much you share.  Do it at work, school, and in social settings.",
            "title_similarity": "0.8219224",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hja6qkj",
            "score": 1,
            "text": "They are not friends at all in my world",
            "title_similarity": "0.10427218",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hja7o3g",
            "score": 1,
            "text": "I call them prison friends.",
            "title_similarity": "0.54550683",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hja7pma",
            "score": 1,
            "text": "Agreed to the fullest extent of my being!!!!🤔",
            "title_similarity": "0.28261995",
            "sentiment_compound": 0.5053
        },
        {
            "id": "hja833s",
            "score": 1,
            "text": "Yup 100% I keep my butt clenched around work people at all times. It’s not worth risking real consequential drama down the line.",
            "title_similarity": "0.5567901",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hja88qd",
            "score": 1,
            "text": "I don't even like most of the people I work with.",
            "title_similarity": "0.33089435",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hja8ajk",
            "score": 1,
            "text": "This. At my former job I told supervisor (thought she was a nice mom figure to talk to) that I had issues with my mental health and it was affecting my work performance. (In reality, I still had severe brain fog from COVID but didn't know exactly that at the time)\n\nShe ended up placing blame on me for a project despite knowing this, and still has no idea how to properly supervise or manage a team. (She knew that I'm usually not one to make mistakes and I'm the one that came in early and was on the top of my game)\n\nLost my job during the height of COVID, and I'm still trying to get back on my feet financially from it.\n\nNever tell anyone but a licensed professional about issues like this. If you need to take the day off for when things become unbearable at all, just keep it short with your manager and no one else. (If you have to let your team know, just tell them you'll be out and something came up)\n\nI will never make that same mistake again for as long as I live with my job.",
            "title_similarity": "0.59261936",
            "sentiment_compound": -0.9091
        },
        {
            "id": "hja8sd8",
            "score": 1,
            "text": "Couldn't be more inaccurate.\n\nEvery single workplace is different.\n\nI'm sure this is top advice for some places, and others it will make you look like a prick.\n\n\"I'm here to work, not to make friends\"\n\nThey aren't mutually exclusive you know, you can do both, Ive made some life long friends through my place of work, something that wouldn't have happened if I took this, entirely subjective advice.",
            "title_similarity": "0.6962737",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hja8yyu",
            "score": 1,
            "text": "100% of my friends were previously coworkers or friends or previous coworkers.",
            "title_similarity": "0.3909771",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hja9qzp",
            "score": 1,
            "text": "Such good advice!!!",
            "title_similarity": "0.32654205",
            "sentiment_compound": 0.5826
        },
        {
            "id": "hjaa0lu",
            "score": 1,
            "text": "this is so true, most learn the hard way  \nimo in general try to exclude yourself from any gossip what so ever  \nit leads to nothing good for you and your environment",
            "title_similarity": "0.56419605",
            "sentiment_compound": -0.2625
        },
        {
            "id": "hjaa976",
            "score": 1,
            "text": "Are we at the point that this gets posted once a day yet? It feels like it gets posted once a day, but maybe we’re still at once a week numbers.",
            "title_similarity": "0.3900503",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hjaaizo",
            "score": 1,
            "text": "This is why I just don’t make friends. Can’t be too careful nowadays \n\n*insert guy tapping head meme",
            "title_similarity": "0.4269455",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hjaapkc",
            "score": 2,
            "text": "Very true. I’m currently working with someone who I like pretty well, they trained me and have been super friendly and shared gossip with me but I would never tell her I’m actively taking classes on the side to get a new job with much better pay. I need to make sure I keep this job until then. Don’t take chances that could risk your livelihood.",
            "title_similarity": "0.72755694",
            "sentiment_compound": 0.9598
        },
        {
            "id": "hjaaqqs",
            "score": 2,
            "text": "eh. I've met some of my best friends at work. This is one of those \"it depends\" kind of things.",
            "title_similarity": "0.69387543",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hjaavcf",
            "score": 1,
            "text": "I'd argue that gossip *can* be a good thing, in the right context. Sometimes it's good to know whether you should hire someone to be on your team and it'd be a good idea to check with other coworkers. Or it'd be a good way to assess whether *you'd* want to join someone else's team. And aren't 360 reviews essentially gossip labelled as \"feedback\"?",
            "title_similarity": "0.69166934",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hjabuwp",
            "score": 1,
            "text": "What if my coworker is my friend and brother in law… that makes it awkward!",
            "title_similarity": "0.55988634",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hjaby4d",
            "score": 1,
            "text": "The two women in my office tend to gossip about people in other departments, sometimes after being friendly to their face. I stay out of it. I can go on the assumption that they’re doing the same to me.",
            "title_similarity": "0.67432976",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjad6vs",
            "score": 1,
            "text": "Same with flatmates on a lesser degree, but still valid as advice.",
            "title_similarity": "0.53742725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjadgvr",
            "score": 1,
            "text": "Quid pro quo is important too.  People notice when you are the guy who listens but doesn't give.",
            "title_similarity": "0.59496975",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hjadhg8",
            "score": 1,
            "text": "What if I don't have any other friends? Asking for a friend obviously.",
            "title_similarity": "0.4179988",
            "sentiment_compound": 0.743
        },
        {
            "id": "hjaeqjl",
            "score": 1,
            "text": "Unless you work in the music industry. Then it’s thrives upon",
            "title_similarity": "0.48936784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjaf30u",
            "score": 1,
            "text": "They aren't friends, they're colleagues. It's a different category of relationship that needs to be treated as such.\n\nYou should be friendly with your co-workers but above all you need to stay professional. There's a degree of distance implicit in that, and certain social lines you should never cross.\n\nIt shouldn't really be that weird. I there are many social lines you do or don't cross with various categories of relationships from spouses to girlfriends to regular friends and beyond.",
            "title_similarity": "0.68532467",
            "sentiment_compound": 0.554
        },
        {
            "id": "hjaf988",
            "score": 1,
            "text": "Lol I have the opposite problem. People want to hang out with me after work. Like no we see each other more than I see my girlfriend or anyone else I know. Set healthy boundaries yall.",
            "title_similarity": "0.6682559",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hjafebm",
            "score": 1,
            "text": "This is dumb.\n\nPeople are people. Everyone has their own motivations. A friend outside of work can betray you just as easily as a work friend can.\n\nHave your relationships, use the appropriate amount of caution with them, understand people's motivations, do fine. Whatever.",
            "title_similarity": "0.71840334",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjaffli",
            "score": 1,
            "text": "i was getting sexually harassed at work(or borderline, i'm a guy so it rarely happens to me.) and i expressed my displeasure.  it got back to the lady who was doing it and she got pissed AF.  didn't realize how leaky the gossip was in that building.",
            "title_similarity": "0.51314956",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hjafwrz",
            "score": 1,
            "text": "95% are ready to stab your back in a second.",
            "title_similarity": "0.25221038",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hjafyzn",
            "score": 1,
            "text": "if they can have a negative affect on your pay, sick leave, or vacation time, they are NOT your friends.",
            "title_similarity": "0.388598",
            "sentiment_compound": -0.8794
        },
        {
            "id": "hjagdbg",
            "score": 1,
            "text": "Part of the reason that “high school drama” is a thing is because you have to see and interact with your fellow students everyday (the other part is that teenagers are generally immature). \n\nAs you get older, most of that drama goes away because you can simply choose to not be around the person who offended you. \n\nAt work, you once again are forced to be around and interact with the same people every day, so if something happens that upsets someone, they can’t just cut their coworker out of their lives.",
            "title_similarity": "0.6188798",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hjagnkn",
            "score": 1,
            "text": "Also learn to figure out who to trust. If you don't know who that is, just don't trust anyone at work.",
            "title_similarity": "0.5195707",
            "sentiment_compound": 0.1526
        },
        {
            "id": "hjagud3",
            "score": 1,
            "text": "Remember that people that try to gossip with you are also going to be gossiping about you.",
            "title_similarity": "0.664",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hjagx5m",
            "score": 1,
            "text": "The real LPT is don’t gossip. Anyone that comes to me and tries to gossip about people is someone I automatically don’t trust anymore. If they’re capable of saying shit behind someone else’s back then they’re capable of saying shit about me behind my back. I don’t think I’m special and hold some kind of immunity from them and their gossip. And if I gossip then I should expect others to also gossip and whoever I gossiped about has every right to hear it and be mad. Just don’t gossip. If you have a problem with somebody then tell them so they can reflect, telling everyone but them isn’t going to change shit.",
            "title_similarity": "0.601413",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hjah0cc",
            "score": 1,
            "text": "Shitty life pro tip:\nBefriend the person in the office you hate most. B/c they think you’re tight they will eventually say/do something to you that can get them in trouble and they think you won’t tell.",
            "title_similarity": "0.61337",
            "sentiment_compound": -0.875
        },
        {
            "id": "hjahah7",
            "score": 1,
            "text": "This is on here at least once a month",
            "title_similarity": "0.16491708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjahbg6",
            "score": 1,
            "text": "Everyone who knows this fact learned the hard way",
            "title_similarity": "0.477753",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hjai4kg",
            "score": 1,
            "text": "Never had friends at work and never will. Dad told me long ago work associates are just that useful for work.",
            "title_similarity": "0.45196715",
            "sentiment_compound": 0.089
        },
        {
            "id": "hjaimxk",
            "score": 1,
            "text": "My best friend is the wife of my husbands boss. We hang all the time ….    My old boss in germany is still texting me every second day and his wife never miss my birthday and i sure get a personal postcard, even tho i quit 7 years ago…..    I’m also friends with other people from my job from other facilities that i‘ve never seen in my entire life, but know all the family history and more personal stuff than work related things about them- NEVER would i tell anything what they tell me to other people in first place or use anything against them to my advantage when I would be upset at something.",
            "title_similarity": "0.5744707",
            "sentiment_compound": 0.6929
        },
        {
            "id": "hjaj00d",
            "score": 1,
            "text": "Learned that recently when the coworker I talk about VR with quit. I just found out he had a headset like a month ago and on his last day I told him I would give him my steam ID so we could play. He just smiled all awkward and said \"uh huh ok\" and I realized he could give a fuck less now that he was out the door. No hate on him, he was just being polite but I THOUGHT WE HAD SOMETHING RAY.",
            "title_similarity": "0.52449334",
            "sentiment_compound": 0.5075
        },
        {
            "id": "hjajfmd",
            "score": 1,
            "text": "The dynamic shifts. High school or college jobs are often a major social group. Once you’re an adult there’s often so much difference between you personally but you assume a similar level of life experience. \n\nI mean gossip is gonna happen anyway but if you find you’re not getting on with people like you used to don’t take it personally.",
            "title_similarity": "0.595383",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hjajfwt",
            "score": 1,
            "text": "The sooner you realize that you are with your coworkers for so long, the sooner you will realize how ok it is to make friends. And yeah, I gossip the shit out of the workplace because its fun as fuck. I spend more time with these people more than actual girlfriends so yeah complicated relationships form.",
            "title_similarity": "0.6898901",
            "sentiment_compound": 0.9094
        },
        {
            "id": "hjajni5",
            "score": 1,
            "text": "Disregarding the 2nd bit, buddy tells me to come earlier than 7am, I come in 6:40am. He tells me he doesn't feel well, and to \"hang out\" in my car, in the cold. 1 hour, 45 minutes later, I dip. We'll see how this goes for our relation. I like him, but getting real sick of this shit. I always gotta hustle because we have no time, then we sit around long as he wants when it's on him. He's only called me 3 times in the past 5 minutes. Told him try again tomorrow. Jobs are for fucking scrubs anyways. Just let society collapse.",
            "title_similarity": "0.42580226",
            "sentiment_compound": -0.9556
        },
        {
            "id": "hjajt10",
            "score": 2,
            "text": "Never forget…. WHAT THEY DON’T KNOW THEY CAN’T RUIN.",
            "title_similarity": "0.50055337",
            "sentiment_compound": -0.6739
        },
        {
            "id": "hjalg84",
            "score": 2,
            "text": "Gathering dirt to use during review/promotion time.",
            "title_similarity": "0.4003",
            "sentiment_compound": -0.34
        },
        {
            "id": "hjalj00",
            "score": 1,
            "text": "I wish my SO understood this.\n\nShe thought her manager was her bestie because they would gossip a lot and hang out after work to drink. Turns out the manager was using her to learn about dirty from other employees and nothing else.\n\nWhen she was let go she was mortified, even though her mother and I warned her about it multiple times, but we were always in the wrong. Took a while to open her eyes. Thankfully I managed to not allow her to be our child's godmother, but she did go to our weeding as a bridesmaid, which to this day my SO hates when she goes through our wedding photos, even though I also warned her about that.\n\nSometimes you need to let children fall so they understand why you shouldn't run on unknown terrain.",
            "title_similarity": "0.58025795",
            "sentiment_compound": -0.9272
        },
        {
            "id": "hjalm4s",
            "score": 1,
            "text": "i work retail with a bunch of other teenagers. we all hate some of the managers equally",
            "title_similarity": "0.44585443",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hjaloj6",
            "score": 2,
            "text": "The better tip is: Your manager/boss is not your friend and they never will be no matter how hard they try to appear friendly.",
            "title_similarity": "0.5085875",
            "sentiment_compound": 0.4585
        },
        {
            "id": "hjanke3",
            "score": 1,
            "text": "Don’t confuse friendship with acquaintances, people use “friend” too often their vernacular.",
            "title_similarity": "0.75709707",
            "sentiment_compound": 0.25
        },
        {
            "id": "hjao3po",
            "score": 1,
            "text": "My “work friend” sent pictures to my boss to try to get me fired. I had just covered all they’re extra breaks because they said they weren’t feeling good. I wasn’t fired He just reprimanded me for covering my eyes with my hat while sitting visible in the work area. I can’t sleep like that, I just get sensitive to the sun shining in and rest my eyes in the dark. Immediately shut off the buddy act with that coworker. I really don’t know the motivation for getting others fired when you’re all equally being screwed. I choose more carefully who to bend rules around and who has a hard on for management.",
            "title_similarity": "0.5150994",
            "sentiment_compound": -0.7436
        },
        {
            "id": "hjaolkt",
            "score": 1,
            "text": "You must have a toxic work environment to think like that.\n\nMe and my colleagues are like friends that get together and do thinks that we enjoy, at work. We also go out at night together and do stupid shit and talk too much and honestly about our visions in any subject.\nI trust them and have no fear of sharing my opinion in a controversial subject or things from private life. Those closest have been at my home, dining, drinking, dancing up to late hours.\n\nJust as I wouldn't use any of the things they do or say to make them look bad at work I trust they also won't.\n\nAt 43 I'm living the life I dreamed about when a kid and enjoying it.\n\nBesides that, I don't think that they sharing that I sometimes go to nudist beaches, that I have a wig or dresses in my closet, that I sometimes drink, that I sometimes smoke weed and that other times we have looked to the stars through my telescope could cause me any harm at work.",
            "title_similarity": "0.7233925",
            "sentiment_compound": 0.9488
        },
        {
            "id": "hjaouks",
            "score": 1,
            "text": "how the fuck do i make friends then",
            "title_similarity": "0.43616834",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hjap6jw",
            "score": 1,
            "text": "A friend will come by the house after you no longer work together. If you work with someone and have no relationship with them outside of work you have a co worker and not a friend.",
            "title_similarity": "0.54328424",
            "sentiment_compound": -0.4268
        },
        {
            "id": "hjapbq9",
            "score": 1,
            "text": "Or just don't gossip or share other people's shit...",
            "title_similarity": "0.27821434",
            "sentiment_compound": -0.6085
        },
        {
            "id": "hjapj2w",
            "score": 1,
            "text": "Tbh I’m honestly kind of sick of all these “your coworkers are out to get you” posts. Not everyone works in a competitive field, or for a corporation. Not everyone is out for blood all the time. Yes, be cautious with new people and don’t talk trash about colleagues, but it seems like every other post is “don’t be friends with your coworkers.”",
            "title_similarity": "0.6086188",
            "sentiment_compound": 0.85
        },
        {
            "id": "hjaqh6p",
            "score": 1,
            "text": "I didn’t understand this for a while and burned myself several times before I learned the hard way and was put into some very uncomfortable positions. Don’t try and be best friends with your coworkers",
            "title_similarity": "0.4034698",
            "sentiment_compound": 0.6133
        },
        {
            "id": "hjaqmrt",
            "score": 3,
            "text": "A related tip: if you come up with a good idea/solution, wait to share it during a meeting with your team or send in an email to multiple co-workers if urgent. I'll never forget the feeling of betrayal during my first corporate job out of college when a co-worker rushed to tell everyone of \"their\" great solution to fix an extremely pressing issue. This was right after I blurted it out to him when it came to me. He received a big promotion shortly after. I truly saw him as a good friend before that happened.",
            "title_similarity": "0.6675029",
            "sentiment_compound": 0.9501
        },
        {
            "id": "hjarjsn",
            "score": 1,
            "text": "That’s why I don’t have anyone from work on my FB page. Old co-workers? Sure. Current co-workers? Nope",
            "title_similarity": "0.38283214",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hjarq35",
            "score": 1,
            "text": "Some of you8 don't get the point here -- it's that being around each other 8 hrs./day does NOT mean you are \"friends\" unless you're really friends the rest of the time. \n\nFamiliarity is not friendship. You CAN be friends but it's dumb to confide too much to a coworker you don't socialize with and know. It can BACKFIRE. Oversharing can turn out badly.",
            "title_similarity": "0.5373081",
            "sentiment_compound": -0.719
        },
        {
            "id": "hjaspzs",
            "score": 1,
            "text": "Some of my best friends I met at work, what a trash post.",
            "title_similarity": "0.6603006",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hjauf3r",
            "score": 1,
            "text": "Lol, the people you work with are not your friends. It is a dog eat dog world out there.",
            "title_similarity": "0.31096476",
            "sentiment_compound": 0.0634
        },
        {
            "id": "hjav27q",
            "score": 1,
            "text": "This. My little sister was kneecapped at work until she learned this. When it finally sunk in that they are not her friends, she was able to break into the C suite and now makes more money than a lot of my doctor relatives",
            "title_similarity": "0.52258635",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hjav5pv",
            "score": 1,
            "text": "After working as a waitress at different places for most of my high school and college life, I learned that you never gossip about a co-worker or higher-up to A) someone who also works there, and B) never in the place of business/employment. No matter how friendly or nice they are to you, they will 99% of the time spread what you say to others. \n\nNow as someone working in a professional career, I found that the same still applies.",
            "title_similarity": "0.5158483",
            "sentiment_compound": 0.7539
        },
        {
            "id": "hjaw30d",
            "score": 1,
            "text": "I always approached work acquaintances as friends first, when I first started working. Not in the sense that I would gossip or share, but in that I was genuinely happy to see them and wanting to talk/hang out. I realized quickly a lot of people aren't willing to reciprocate and just want to clock in/clock out. Or, there were some feigned niceties for the purpose of getting productivity out of you. Kinda sucks. I do have a couple of people that do keep in touch and look to catch up at some point, which I appreciate.",
            "title_similarity": "0.7315451",
            "sentiment_compound": 0.9151
        },
        {
            "id": "hjaw30s",
            "score": 1,
            "text": "Learned this one the hard way as someone who needs constant validation. Way to easy to be manipulated.",
            "title_similarity": "0.6362405",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hjaw5xy",
            "score": 1,
            "text": "To add to this; also be wary of telling a friend anything confidential about your life if they know/are associated with someone who shares a workplace with you. This is why I was terminated suddenly after returning from rehab despite having gotten my leave approved and being told that I would still have a permanent position with the company upon my return. Returned from leave, was terminated 2 days later. Found out later it was because word had gotten back to the CFO from said person and in said person's words, \"I don't want to work with a drug addict\".",
            "title_similarity": "0.5699942",
            "sentiment_compound": 0.7634
        },
        {
            "id": "hjaws5v",
            "score": 1,
            "text": "Never forget the allure of the enemy of my enemy is my friend.  \n\nFriendships based on a mutual dislike of the boss or the company rarely last.  Friendships based on mutual likes are always the way to go.",
            "title_similarity": "0.7691828",
            "sentiment_compound": -0.3649
        },
        {
            "id": "hjaxdbx",
            "score": 1,
            "text": "This advice is too late for Monica Lewinsky.",
            "title_similarity": "0.27348498",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjaxe5b",
            "score": 1,
            "text": "Haha, my ex left me and our children for her \"work family\" only for them to focus on their own families instead of her....she was shocked she came second to their own families.",
            "title_similarity": "0.48185575",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hjaxg8z",
            "score": 1,
            "text": "So we work in a small office of 4 people and one of our coworkers just left last month. She gave really elaborate parting gifts to some of us that she considered \"friends\" but I know that she's talked shit on and gossiped about all 3 of us at one point during her time here.   I don't think she knows that we know, but we know.",
            "title_similarity": "0.49297708",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hjaz6lt",
            "score": 1,
            "text": "I just never gossip about colleagues, mostly because I usually just genuinely don’t care but also because it’s rarely ever going to end well, like the best outcome is to have a couple laughs. \n\nI echo many comments here too in that usually I’ve not maintained any sort of friendship going after either me/them/both have left the company. \n\nFor me the distinction between friends and colleagues is fairly obvious and it’s kind of sad watching people eat the corporate crap about “being a family” because it’s mostly lonely people being taken advantage of.",
            "title_similarity": "0.55898607",
            "sentiment_compound": 0.944
        },
        {
            "id": "hjb0ika",
            "score": 1,
            "text": "People at work are not your friends period.",
            "title_similarity": "0.33620197",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hjb0si1",
            "score": 1,
            "text": "Can I post this tip next week also?",
            "title_similarity": "0.33887506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjb17xs",
            "score": 1,
            "text": "OP was never able to make friends at work now they're angry about it",
            "title_similarity": "0.24959522",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hjb1bun",
            "score": 1,
            "text": "Absofuckinglutely. The people I work with are very gossipy and have huge mouths. Not even just discussing others (which they do) but also the personal details of their life. Sometimes I'll be involved in a conversation but I'll have to catch myself from divulging personal info or certain opinions. I may *like* some of these people but I don't trust them as far as I can throw them and I'm certain that once I leave the company I'll never see them again.",
            "title_similarity": "0.5773035",
            "sentiment_compound": 0.55
        },
        {
            "id": "hjb30uy",
            "score": 1,
            "text": "Not only is this a life pro tip, but a life lesson, for sure!",
            "title_similarity": "0.54339445",
            "sentiment_compound": 0.501
        },
        {
            "id": "hjb3koq",
            "score": 1,
            "text": "Boss / CEO talked about how hard he partied and the drugs he did. Coworker also shared some of his stories with Boss. I pulled coworker aside and told him never do that again. Just say \"wow that's crazy\" or something along those lines.",
            "title_similarity": "0.5242424",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hjb4ncx",
            "score": 1,
            "text": "Best advice I’ve seen before on here",
            "title_similarity": "0.40289116",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hjb5dxs",
            "score": 1,
            "text": "I feed work friend fake tidbits all the time to see if they gossip and to whom the tell.",
            "title_similarity": "0.6638737",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hjb5ixn",
            "score": 1,
            "text": "People I work with are coworkers, nothing more",
            "title_similarity": "0.63231575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjb7w2p",
            "score": 1,
            "text": "Ugh someone in work that I didn't like left today and a colleague I trust messaged me about it and I listed out the reasons I wouldn't miss him. Now feeling paranoid about it",
            "title_similarity": "0.6874622",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hjb8dqv",
            "score": 1,
            "text": "Worked with 3 other guys a few years back, and they kept asking if I'd gone full-time all the time.\nSo one day I made the remark that I'd only go full-time if someone quit, retired or died.\n\nWell 1 of them starting telling everyone I wanted them to die. I quickly became unpopular and even got threatened verbally.\n\nFunny thing is 2 of them retired not too long ago and I ended up with both their jobs, and now everyone jokes about being the company serial killer.",
            "title_similarity": "0.43931097",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hjb9eti",
            "score": 1,
            "text": "Wow. This is relevant",
            "title_similarity": "0.18201631",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hjb9udk",
            "score": 1,
            "text": "Same goes for work boyfriends/girlfriends, once things go sour you might regret a lot that you’ve confided with them.",
            "title_similarity": "0.7352678",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hjbc8cq",
            "score": 1,
            "text": "A whole bunch of snitches, snakes and fakes in all my jobs I ever had.",
            "title_similarity": "0.3318528",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hjbcq5t",
            "score": 1,
            "text": "This is really important. I had someone I trusted as a friend snitch on me for leaving the job. When I gave my two week notice, they were like \"ya, we knew\"",
            "title_similarity": "0.6180531",
            "sentiment_compound": 0.8718
        },
        {
            "id": "hjbfb2n",
            "score": 1,
            "text": "kind of applies to uni too",
            "title_similarity": "0.31106022",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjbfls9",
            "score": 1,
            "text": "I've heard of so many stories of people being in trouble because their coworkers saw their Facebook posts about the party or trip they went to on their \"sick day\"\n\nI won't add current coworkers to my social media except my LinkedIn. Besides, the number of former coworkers I even still have *contact* with I can probably count with one hand. Your \"friendship\" with these people is heavily dependent on you continuing to work with them.",
            "title_similarity": "0.61110985",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hjbgn2d",
            "score": 1,
            "text": "I specifically rely on this for people who can't take direct criticism.\n\nI know if I complain to someone else it'll get back to them. \n\nAs long as it's a legitimate complaint I won't get in trouble and idc of they try to make it awkward or something.",
            "title_similarity": "0.65699184",
            "sentiment_compound": -0.162
        },
        {
            "id": "hjbilbb",
            "score": 1,
            "text": "Not always. That's how unions were born and still form. Be cautious, but don't be off putting. I've met awesome ppl at places I've worked. (Mostly shitty places where everyone knows they're in the same bag)",
            "title_similarity": "0.71440566",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hjbk9b0",
            "score": 1,
            "text": "I always counseled my employees to listen to the gossip if they felt the need.  Just don’t pass it along nor add to it.",
            "title_similarity": "0.7182007",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hjbl7ui",
            "score": 1,
            "text": "10000%. It’s very rare a work friend can become a true real friend, I feel. It’s happened to me once, and the real friendship didn’t even truly begin until after we worked together.",
            "title_similarity": "0.42438942",
            "sentiment_compound": 0.9325
        },
        {
            "id": "hjbpeak",
            "score": 1,
            "text": "So true.. I have two People I trust at work. No one else",
            "title_similarity": "0.5978098",
            "sentiment_compound": 0.6361
        },
        {
            "id": "hjbqn9e",
            "score": 1,
            "text": "Someone hurt you..",
            "title_similarity": "0.2186458",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hjbqu6c",
            "score": 1,
            "text": "So far from what I see.... people who gossip to their bosses are ass kisser. This is where favoritism starts to happened, because you did not play into the \"I want to create a closeness with my coworkers.\" Yeah people suck EVERYWHERE. Doesn't matter if it's work or even at school or church. You will see how desperate these people are to get the higher position or want attention.",
            "title_similarity": "0.6080066",
            "sentiment_compound": -0.4956
        },
        {
            "id": "hjbr24j",
            "score": 1,
            "text": "There's good gossip and bad gossip. We all know bad gossip, it's shit talking someone for silly things they likely can't control.\n\nGood gossip is stuff like working manual labor and finding out a coworker drinks on the job. Could literally save your damn life.\n\nOther than that I try to say nice things about people and not react to bad gossip coming to me. It's a pretty good system so far.",
            "title_similarity": "0.720879",
            "sentiment_compound": 0.1184
        },
        {
            "id": "hjbtyjj",
            "score": 1,
            "text": "Yep, I got along with some people for like 6-9 months but after I got let go, not a single person texted me or even check what happened with me.\n¯\\_(ツ)_/¯ lesson learned. Don't expect much.",
            "title_similarity": "0.33829436",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hjbv4mg",
            "score": 1,
            "text": "That's for damn sure. Confided in a coworker about the boss and what does this person do but gossip to the boss and I get raked over the coals. My introduction to the corporate world.",
            "title_similarity": "0.61869895",
            "sentiment_compound": -0.3071
        },
        {
            "id": "hjbvqlm",
            "score": 1,
            "text": "can we add in this thread: DO NOT SLEEP WITH COWORKERS.",
            "title_similarity": "0.49250543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjby708",
            "score": 1,
            "text": "You don’t know how much I needed this today.",
            "title_similarity": "0.21604484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjc27ji",
            "score": 1,
            "text": "I normally keep drama under wraps and keep shit to myself. However, my supervisor has done fuck all about the problems with my incompetent coworker. We could be in deep shit because of her(like legally) and he just over there shrugging his shoulders.  Like, ok I guess I don't get paid enough to be concerned then. I'm letting every 'work friend' know we are having issues. The gossip can come back around to him and he can be mega butthurt about it.",
            "title_similarity": "0.6418017",
            "sentiment_compound": -0.872
        },
        {
            "id": "hjc64k7",
            "score": 2,
            "text": "Don't gossip at work. Period. Nothing good will come off it.",
            "title_similarity": "0.38022637",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hjc6ojr",
            "score": 1,
            "text": "The best co-workers make the worst drinking buddies and vice versa.",
            "title_similarity": "0.5556903",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hjc7xhu",
            "score": 1,
            "text": "I have a colleague (lets call him dave) who is a really nice guy, but he's also a pain in the ass.\nHe \"never lies\" apparently and that gets us into trouble..\nSo i started distancing from him.\n\nMeanwhile, I got closer to another guy (mike) who is basically a thug and an asshole. Dave and i constantly bitched about him.\nThen one day Mike and i just bonded, and turns out he's a softy.\nThe man is just a hard shell and he looks and talks like a thug, but it's just an all-round great guy..\n\nSo now, mike bitches about dave, and i have to agree, because well, i don't know how to say no..\n\n\nThis is how i realised two things..\n1)Everyone at work is an asshole and will bitch about you behind your back.\n2) I'm do that too. It's me, I'm the asshole.",
            "title_similarity": "0.6157072",
            "sentiment_compound": -0.9239
        },
        {
            "id": "hjc839w",
            "score": 1,
            "text": "But before they're work friends we're all people. We are all they.",
            "title_similarity": "0.6385336",
            "sentiment_compound": 0.631
        },
        {
            "id": "hjc9o9w",
            "score": 1,
            "text": "Are work friends with benefits 3rd then?",
            "title_similarity": "0.46493787",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hjc9yvt",
            "score": 1,
            "text": "People will gladly take what you have.",
            "title_similarity": "0.518204",
            "sentiment_compound": 0.34
        },
        {
            "id": "hjcenzv",
            "score": 3,
            "text": "I learnt this the hard way. I was pretty tight with a colleague, we'd go grab coffees and ask about each other's kids and work collaboratively to get larger tasks done.  \n\nManagement even complemented how well we'd been working together and I was able to use it as basis for a promotion (she was senior at the time where as I was not).  \n\nSo to my shock a few months later during a quarterly performance review, I learn she had gone to my manager to complain about a design I did which she felt wasn't detailed enough, rather than come to me first.  I get raked over the coals and get marked as \"needs improvement\" in my review.  I brought it up with her afterward,  she got defensive and things haven't been the same since.",
            "title_similarity": "0.60540056",
            "sentiment_compound": 0.3892
        },
        {
            "id": "hjcpfxv",
            "score": 1,
            "text": "As a recovering over-sharer I wholeheartedly agree. I can't tell you the number of times the shit I've said has gotten used against me or become office gossip.",
            "title_similarity": "0.69249165",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hjdqkf0",
            "score": 1,
            "text": "I've made some really good friends through work. We're no longer working at the same place but are still going strong as friends. \nThe reason? We got drunk almost every fortnight Friday (pay week), if not every week. \nI think drinking tends to show others who you are and if they like you and like then back, you tend to out more and share shit with each other.\n\nThe people whom I'm working for now, I can't be bothered to put in the effort of being more than work mates as I've already got a good bunch whom I hangout with outside of work.",
            "title_similarity": "0.6014607",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hje6nnn",
            "score": 2,
            "text": "This may have been said but not only don’t talk about anybody but if you’re standing in a group of people that starts gossiping excuse yourself from the conversation",
            "title_similarity": "0.51720756",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hjfm0we",
            "score": 2,
            "text": "Uh this is fucking important.\nI was working at this place, dating someone from a different area (we'll call her \"X\") always super discrete and professional. \nThere was a guy, \"Asshole\" that worked closely with me who I considered a friend, not a super close friend but anyhow...I told him one day I was going out with \"X\" when he asked me if I was dating anyone, you know, it seemed like an innocent thing at the moment.\nWe stopped being friends eventually because he was kind of an idiot, but you know, kept it professional.\nFast forward to almost a year after I quit, \"X\" texted me saying that I am an asshole because I told people back in the day that I was \"fucking her\", which I never did. \nThe thing is, \"Asshole\" started gossiping and telling people I had told him that whole thing about fucking \"X\" and now everyone knows. I don't really care about them saying shit about me because I'm not even there anymore, but it pisses me off because \"X\" still works there and it is affecting her professionally. \nDon't make the same mistake I did.",
            "title_similarity": "0.66508037",
            "sentiment_compound": -0.8871
        },
        {
            "id": "hjggmrf",
            "score": 1,
            "text": "I learned this far, far too late.  My company has exactly two employees who aren't related to anyone else in some way, and they're the only two I work with regularly.  I had formed a real friendship with this guy, until he recently became my manager.  I said something I shouldn't have, and he literally immediately reported me to the owner, who also happens to be my closest relative at the company.\n\nDon't work for family, folks.",
            "title_similarity": "0.576172",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hjjsniw",
            "score": 2,
            "text": "I learned this the hard way. I was working in a fast food restaurant and I was doing great, in fact, I was buddy buddy with my boss (mainly because I was good friends with his son). He would compliment me on doing a good job and we would have casual conversations about random topics, overall we were cool with each other. But I felt like there were some things he was doing wrong and some things that he just shouldn’t do period. So one night while I was working with a different manager there, the regional manager came by to see how everything was going. I was also very friendly with him, so I decided to tell him everything that I thought. Basically, I snitched hard on my boss. The regional manager promised me he would keep the employee who snitched (so me) anonymous. So either it was the regional manager or one of the other 4 people who were working with me that shift that snitched. The following week, my boss pulls me aside to talk to me and shows me the data he printed out about money loss and how what he was doing was trying to save us money. Luckily, I didn’t get fired or punished, he just chewed me out a bit. Needless to say, I don’t think I was his favorite employee anymore.",
            "title_similarity": "0.6277747",
            "sentiment_compound": 0.95
        },
        {
            "id": "hjvqv3o",
            "score": 2,
            "text": "Or just don't talk at work. I know many people like that, and I try to be one of them. I tell others, \"It's nothing personal, but I try not socialize here because it is too easy for me to get comfortable around people,\" and that tends to lead to all sorts of drama.",
            "title_similarity": "0.6486225",
            "sentiment_compound": 0.8765
        },
        {
            "id": "hlmuq5g",
            "score": 2,
            "text": "I try hard to never gossip to begin with. Makes my life easier and less dramatic = a happier and better quality of life. :)",
            "title_similarity": "0.50558853",
            "sentiment_compound": 0.9046
        }
    ]
}