{
    "LPT - when someone insults you during a meeting, pretend as if you did not hear them and ask them to repeat what they just said. They will either apologize or confirm their unprofessional behavior to the meeting audience - the latter can not be accepted.\nPsychological safety makes or breaks teams. Aggressive language should therefore be avoided at all time and actively eliminated from corporate cultures. The tip above helps flagging that insults are not accepted in the workplace.": [
        {
            "id": "hkqhr8e",
            "score": -1,
            "text": "Real LPT: \\*IF\\* ever someone insults you during a meeting, leave the room. If it ever happens again, leave the company.",
            "title_similarity": "0.81619483",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hkpyycq",
            "score": 2,
            "text": "hmm, can't wait to try this one. but really hope to never need too.",
            "title_similarity": "0.3208629",
            "sentiment_compound": 0.6474
        },
        {
            "id": "hkqcsnt",
            "score": -3,
            "text": "Slap them and say oops my hand slipped",
            "title_similarity": "0.46567625",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hkqfhoa",
            "score": -1,
            "text": "I did that while having a meeting with my commander in the military.  I *wanted* to throw him out the window, but instead I just asked if he was really saying what I thought he was saying... and he quickly backtracked instead of doubling down.\n\nThrowing him out the window was my next option though.",
            "title_similarity": "0.7016852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkq4w38",
            "score": 5,
            "text": "I did this recently when someone made a flirtatious comment to me under their breath and I don't know why that was my reflex, I could hear him perfectly. It made him feel extremely awkward and he didn't do it again after that. I love myself but I don't like the way I am.",
            "title_similarity": "0.6841674",
            "sentiment_compound": 0.3266
        },
        {
            "id": "hkqicni",
            "score": 1,
            "text": "Or or or you can just chose to fight fire with fire and put down such ppl so that they don't dare to the same to you in future. Speaking with experience and 💯% success.",
            "title_similarity": "0.6672281",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hkpxpnm",
            "score": 132,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.6263963",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hkq07b9",
            "score": -2,
            "text": "I would love to try this",
            "title_similarity": "0.030423256",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hkqn97h",
            "score": 2,
            "text": "This is a good strategy. You typically end up with 1 of two things:\n\nYou: \\*something\\*  \nSomeone: You are an asshole  \nYou: I'm sorry, could you say again?  \nSomeone: No.  \nYou: Ok, moving on... (you somewhat diffuse and prove the person a coward)\n\n\\-OR-\n\nYou: \\*something\\*  \nSomeone: You are an asshole  \nYou: I'm sorry, could you say again?  \nSomeone: You are an asshole  \nYou: Ok, we will take that discussion offline. Moving on... (establish that you are in control, patient and professional, but will not simply accept that behavior)",
            "title_similarity": "0.72372264",
            "sentiment_compound": -0.577
        },
        {
            "id": "hkq60ni",
            "score": 13,
            "text": "I was once at a meeting in a restaurant, planning a golf tournament with about a half dozen people including a manager for an NBA team.  While I was speaking to the group, the NBA manager quite unexpectedly roared at me like a rabid Chihuahua, (not exaggerating).  In that instant, time stood still.  As we all sat there in awkward silence, I could see everyone in my peripheral vision with their hands glued to the table, their eyes locked on me with a serious look on their faces that said, “what the crap are you gonna do now?”  I quickly turned to the person next to me and asked, “so Sally, how do you think we she handle such and such?”  Completely ignoring what just occurred and continuing on as if nothing happened.  Worked like a charm!",
            "title_similarity": "0.53754914",
            "sentiment_compound": -0.3689
        },
        {
            "id": "hkqwb9o",
            "score": 1,
            "text": "This overlooks the most likely option, that the person will simply say, \"oh, nothing\" and attempt to move the meeting along. Don't let them. \n\n\nIf they do this, insist on stopping the meeting and make them repeat it.",
            "title_similarity": "0.81026137",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hkq1ceb",
            "score": -3,
            "text": "I have learned this from a lot of Chinese videos and reality shows.",
            "title_similarity": "0.23235667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqsb7a",
            "score": 1,
            "text": "Or say “the Jerk-store called and they’re running out of YOU.” \nDone.",
            "title_similarity": "0.66150045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqifdu",
            "score": 4,
            "text": "Narcissist are better at gaslighting and manipulating than normal people. The only thing they actually fear is exposure.",
            "title_similarity": "0.60317045",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hkqkw5s",
            "score": 0,
            "text": "This is old news. Just watch any mafia movie. “Whatd you just say to me? Say again what you just said to me”\n\nMy move when somebody says some inappropriate or insulting joke/remark at work is to instantly say “wait I don’t get it. Why don’t you explain it to everybody here so they understand?”",
            "title_similarity": "0.70397353",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hkqqp8n",
            "score": 0,
            "text": "This works throughout life to whip the rug out from under someone trying to get a rise - see if they have the cajones to say it twice",
            "title_similarity": "0.36505675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqqtd3",
            "score": 0,
            "text": "Don't pretend you didn't hear them, that only shows you were likely not paying attention.\n\nInstead, ask them to repeat themselves so that you can be sure you understood them correctly.  This makes you look better because you are allowing them the benefit of a doubt along with showing that you are an active listener.  Everyone likely heard them and you commenting on it in a somewhat positive way de-escalates and if the disrupter repeats themselves and gets asked to leave, you don't seem like an aggressor albeit passive.",
            "title_similarity": "0.7278495",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hkqqxlq",
            "score": 0,
            "text": "I do this at work (retail) all the time. I'm also a big fan of long, uncomfortable pauses so my rude customers can think about the choices that they've made today.",
            "title_similarity": "0.59177506",
            "sentiment_compound": -0.5542
        },
        {
            "id": "hkqrg64",
            "score": 0,
            "text": "And make sure to say it like this “Umm excuuuuuse me???”",
            "title_similarity": "0.21669942",
            "sentiment_compound": 0.6531
        },
        {
            "id": "hkqriai",
            "score": 0,
            "text": "This is one of the best tips I learned years ago.  When you have done it a couple of times the ashholes catch on and stop the bad behavior.  A follow up question is a version of \"would you please explain that comment/question?\"  Bullies have a difficult time explaining their actions.",
            "title_similarity": "0.6003644",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hkqsm09",
            "score": 0,
            "text": "Another tip is to force them to explain their joke when it’s something racist, misogynistic, homophobic, etc. \n\nJust keep playing dumb. “Huh? I don’t get it. Why is that funny?”",
            "title_similarity": "0.63922846",
            "sentiment_compound": -0.6868
        },
        {
            "id": "hkqtqis",
            "score": 0,
            "text": "Daaamn I wish I heard this years ago! Thanks OP!",
            "title_similarity": "0.34028703",
            "sentiment_compound": 0.7339
        },
        {
            "id": "hkquqc4",
            "score": 0,
            "text": "Wish I had this advise sooner:\n\nOne time I was very hungry and brought a shrimp platter to eat as lunch during a meeting and some jerk called me out on it and said “ The ocean called, their out of shrimp” I was horrified and embarrassed.",
            "title_similarity": "0.57888734",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hkqv777",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.23570459"
        },
        {
            "id": "hkrjfu2",
            "score": 0,
            "text": "This is passive aggressive bullshit that makes teams worse. You shouldn’t ask people to repeat things unless you didn’t hear them. This kind of low level dishonesty is the beginnings of people being toxic with one another. A better LPT is say what you mean and mean what you say- what you consider to be out of line may not actually be out of line, and visa versa- constructive feedback is not always easy to hear and even when it’s overly blunt that doesn’t mean it should be dismissed. If you’re going the make them repeat it route- say did you intend to communicate …but the lie about not hearing is not a small lie.",
            "title_similarity": "0.8178977",
            "sentiment_compound": -0.8224
        },
        {
            "id": "hksp4lb",
            "score": 0,
            "text": "The trick is to insult people with facts, such that you can make them feel bad and then screw them over if they go to HR",
            "title_similarity": "0.8040786",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hkqjy6e",
            "score": 11,
            "text": "Let the repost fly.. some people didn't see this last time. It's ok.",
            "title_similarity": "0.37644362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkq3ztv",
            "score": 26,
            "text": "Only matters if HR cares. At my last job, one of the higher ups in management made a joke about wanting to shoot his political opponents and HR didn’t do shit about it.",
            "title_similarity": "0.7691702",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hkq2u49",
            "score": 13,
            "text": "Or just politely communicate how unprofessional that is and if it escalates then call HR\n\nIf you know the culture is toxic then do what someone else said and apply for a new job without letting them know.",
            "title_similarity": "0.8517593",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkqgaaj",
            "score": -1,
            "text": "This doesn’t just work in a business setting. I also like to ask people to explain what they mean whenever they use a veiled insult. I fully understood the meaning, but I want to make them explain it so I act like I didn’t.",
            "title_similarity": "0.71484685",
            "sentiment_compound": 0.5713
        },
        {
            "id": "hkqo9ea",
            "score": -1,
            "text": "this is a good tip for dealing with assholes in general - usually making them repeat themselves makes them (or the people around you guys) realize what am asshole they’re being.  Plus it helps make everyone more aware of what they’re saying without seeming like you’re accusing them of anything. It also helps once the confrontation’s over, that way you’re not doubting yourself about what they said or meant.",
            "title_similarity": "0.72459763",
            "sentiment_compound": 0.3666
        },
        {
            "id": "hkqvval",
            "score": 1,
            "text": "\"Sure, I said 'What's the difference?  You're their all time best seller!'\"",
            "title_similarity": "0.16978462",
            "sentiment_compound": 0.7777
        },
        {
            "id": "hkqwgyd",
            "score": -1,
            "text": "Just say that you had sex with their mother.",
            "title_similarity": "0.41270316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqwk6i",
            "score": 1,
            "text": "You guys are having meetings? 🥺",
            "title_similarity": "0.26736957",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqxos3",
            "score": -1,
            "text": "I try to do this everywhere it happens, whether it's me or someone else being insulted.",
            "title_similarity": "0.4259606",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkqxtty",
            "score": -1,
            "text": "\"Oh you heard me fine, chump\"",
            "title_similarity": "0.22960761",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hkqye04",
            "score": -1,
            "text": "You follow josh otusanya or what?😂",
            "title_similarity": "0.055094175",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hkqyhoi",
            "score": 1,
            "text": "Who the fuck is insulting people during meetings? Guess I'm glad I work where there shit doesn't happen.",
            "title_similarity": "0.7782387",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hkqyrjo",
            "score": -1,
            "text": "What did you just say, punk?",
            "title_similarity": "0.35826412",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqytx1",
            "score": -1,
            "text": "George needed this on Seinfeld....",
            "title_similarity": "0.3423094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqzc8e",
            "score": 1,
            "text": "\"Well the Jerk Store called...\"",
            "title_similarity": "0.36287627",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hkr0kyx",
            "score": -1,
            "text": "How about stand up for yourself in a tactful and respectful manner.  Or u can point out there issue needs to be addressed in a more private conversation.  Playing dumb is stupid.",
            "title_similarity": "0.6554225",
            "sentiment_compound": -0.3892
        },
        {
            "id": "hks8z8n",
            "score": 1,
            "text": "Man, I am often brutally direct in meetings, and this would not slow me down. \n\nPerhaps a straight-up personal insult is unprofessional, but criticisms are common and necessary in meetings, even if they might hurt feelings.",
            "title_similarity": "0.7242437",
            "sentiment_compound": -0.9144
        },
        {
            "id": "hkqm461",
            "score": 24,
            "text": "\"You are dumb as shit\"\n\n\"I'm sorry what was that?\"\n\n\"I was simply noting that your idea is pretty much not going to work in any universe known to exist. [proceeds to list six reasons why you are, in fact, dumb as shit but through the frame of your ideas]\"\n\nThis LPT is dumb as shit",
            "title_similarity": "0.6636981",
            "sentiment_compound": -0.946
        },
        {
            "id": "hkqopgj",
            "score": -2,
            "text": "First actual LPT I’ve seen here in like a month",
            "title_similarity": "0.03382829",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hkqtfz2",
            "score": 2,
            "text": "Unless it's the c-suite or HR and they can do whatever they want",
            "title_similarity": "0.18126121",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hkqwzh4",
            "score": 2,
            "text": "'I'm not sure I understand your position, would you please clarify?' \n\nWorks every time",
            "title_similarity": "0.30199155",
            "sentiment_compound": 0.0869
        },
        {
            "id": "hkqfjop",
            "score": 12,
            "text": "They won’t repeat it. They’ll fudge it and try and explain why they disagree with you and why you are song a bad job / have bad ideas. Unfortunately if you are working in an environment with someone who is comfortable enough to do this then the tactic won’t work. Source: 30 years of working in an aggressive sector (financial services)",
            "title_similarity": "0.7993155",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hkqjqta",
            "score": 4,
            "text": "Congratulations, youve been insulted twice",
            "title_similarity": "0.30326203",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hkqsx9g",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.2603066"
        },
        {
            "id": "hkrhnk8",
            "score": 4,
            "text": "I'm a middle-aged white guy with a beard. A fellow middle-aged white guy with a beard, I guess presuming we're all like him, said an INSANELY racist thing to me, like he expected me to go along with it, on account of being another white guy with a beard.\n\nI looked at him like I didn't understand what he said, and asked him what he meant. The moment of \"oh shit this guy isn't a racist like I am\" that flashed across his eyes was priceless.\n\nHe hemmed and hawed about how \"you know...\" and I said, \"I'm sorry. I really don't get it. Help me out.\"\n\nHe stuttered and stammered, made a few attempts to talk his way out of the shitty thing he'd said, with the racist accent and everything, and I never let him off the hook. Just maintained that I must be stupid or something, because I didn't get why it was funny.\n\nIt was glorious. Highly recommend using this tactic with all shitty people who say shitty things.",
            "title_similarity": "0.62432176",
            "sentiment_compound": -0.9281
        },
        {
            "id": "hkqgey0",
            "score": 101,
            "text": "Yeah thats not how the real world works. \n\nInsulting someone and that person being disciplined are two different things but most people cant make that distinction nowadays.\n\n If i say, \"you are incompetent and people will eventually get hurt with you on the jobsite\" that isnt me calling you a piece of shit, thats me saying that you either need to step it up or step the fuck out.",
            "title_similarity": "0.80454606",
            "sentiment_compound": -0.9678
        },
        {
            "id": "hkqt19w",
            "score": 6,
            "text": "What a load of Horse Shit!",
            "title_similarity": "0.20739064",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hkq4h41",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.23570459"
        },
        {
            "id": "hkql6ir",
            "score": 7,
            "text": "The jerk store just called, they running out of YOU!",
            "title_similarity": "0.6285956",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hkqdflc",
            "score": 66,
            "text": "I had one “colleague” start a sentence in a meeting with “You know what I hate about jazzhandler?” And then proceeded to list them. I was there another year after that. Safe to say that job damn near destroyed me psychologically (and professionally).\n\nTaking that job was the single worst mistake I ever made. Trust your instincts, kids.",
            "title_similarity": "0.6848444",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hkq6aq1",
            "score": 245,
            "text": "This LPT was posted here like 6 months ago, verbatim.",
            "title_similarity": "0.12072664",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hkq9i9q",
            "score": 9,
            "text": "Criticize my work if you want, but never make it personal. That’s next level assholery",
            "title_similarity": "0.77213144",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hkqovca",
            "score": 9,
            "text": "... and then everyone stands up and cheers while the bully runs away crying!",
            "title_similarity": "0.41173524",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hkqecck",
            "score": 80,
            "text": "LPT: re-post LPTs for karma",
            "title_similarity": "0.3154257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqhs6d",
            "score": 37,
            "text": "Or they just respond with \"you heard me\"",
            "title_similarity": "0.15468952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqnv3g",
            "score": 14,
            "text": "Oh yeah? Well the jerk store called, they're running out of you!",
            "title_similarity": "0.6288289",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hkqgopp",
            "score": 18,
            "text": "I'm really sorry but that flair is ugly as fuck",
            "title_similarity": "0.45959473",
            "sentiment_compound": -0.8884
        },
        {
            "id": "hkqj9x2",
            "score": 19,
            "text": "Can I post this again tomorrow?",
            "title_similarity": "0.167323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqtkrj",
            "score": 173,
            "text": "Haha I used this the other day when someone made a comment about the Asian population at my work. I paused for a second and then said “I’m sorry what was that?” And he doubled down and said “I SAID, WHATS WITH ALL THE FUCKIN ASAINS IN HERE!!” So …that didn’t work 😑",
            "title_similarity": "0.6755214",
            "sentiment_compound": 0.508
        },
        {
            "id": "hkquf22",
            "score": 69,
            "text": "Another lpt totally out of touch with reality",
            "title_similarity": "0.41489995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqrzaz",
            "score": 34,
            "text": "LPT - this doesn't actually work",
            "title_similarity": "0.26926258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqm5kf",
            "score": 268,
            "text": "This isn’t going to go the way you think it is.",
            "title_similarity": "0.3581202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqompa",
            "score": 448,
            "text": "I remember when this was posted in LPT a few months ago and the comment section ripped it and said it was bad advice. Such is the nature of LPT",
            "title_similarity": "0.6323091",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hkq1spk",
            "score": 301,
            "text": "What’s worse is when they don’t want to repeat it, but everyone is still snickering and telling you to move on.",
            "title_similarity": "0.7178711",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hkq9z9f",
            "score": 1633,
            "text": "My issue is that the guy who does this to me is very, very good at this and keeps his insults passive-aggressive. It's easy to handle the people dumb enough to make an obvious and clear insult at work. It's the people who say things that sounds perfectly fine but imply you are lazy or incapable or dumb without ever flat-out saying it you have to watch out for; and if you try this trick with them, you'll just give them the chance to subtly spread their message again, while possibly confirming the impression that you're a little bit slow.\n\nAs others have said... if you're working at a place where people are able to openly insult you to your face and you have to resort to tricks to get anyone to notice or care... that's a toxic workplace and you should already be looking for a new job, and just doing what you can to buckle down and survive until you get it. If this trick helps that, great, but if it's needed, your workplace as a whole is just awful.",
            "title_similarity": "0.6539777",
            "sentiment_compound": -0.5668
        },
        {
            "id": "hkqfqfp",
            "score": 70,
            "text": "[deleted]",
            "title_similarity": "0.2603066"
        },
        {
            "id": "hkq2tcp",
            "score": 2528,
            "text": "What if the insult was completely justified and they just double down?\n\n\"Yes, I called you incompetent, because you are. [Goes on to list your mistakes and failings in painful detail]\"",
            "title_similarity": "0.62730396",
            "sentiment_compound": -0.8522
        },
        {
            "id": "hkqfcpo",
            "score": 112,
            "text": "I like this idea. In practice though, I sometimes don’t recognize insults until later. Sometimes much later. I don’t have an innate sense of what is insulting. I usually end up getting defensive over something that is not an insult and completely missing actual insults. I’ve gotten better over time and have worked on it most of my life. Just wanted to point it out in case anyone else has reacted this way.",
            "title_similarity": "0.5816573",
            "sentiment_compound": -0.5195
        },
        {
            "id": "hkpzkvy",
            "score": 9094,
            "text": "if you're working at a place where people are hurling insults in meetings, do try and find a new job. that's toxic as hell. \n\nonly times i've been *even remotely insulted* at work were during reviews. but they were honest criticisms at the appropriate time and place.",
            "title_similarity": "0.7908907",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hkqeqat",
            "score": 14209,
            "text": "'You never paying attention during these meetings!'\n\n'Sorry could you repeat that I wasn't listening'",
            "title_similarity": "0.6804278",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hkqfm6l",
            "score": 1,
            "text": "This doesn't just have to be on internal meetings. I've worked in customer facing roles my whole career and this is my favorite tactic when a customer gets aggressive or hurls an insult. They usually feel foolish having to repeat what they said and will throttle things back.",
            "title_similarity": "0.6961262",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hkqfyr4",
            "score": 1,
            "text": "LPT - when you see a tip posted a thousand times just post it again word for word and receive karma.\n\nFuck off with this tip already",
            "title_similarity": "0.5572481",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hkqfz4g",
            "score": 1,
            "text": "Can work, or they will just continue and not repeat it. Definitely report to HR anyway.",
            "title_similarity": "0.6314479",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hkqivwu",
            "score": 4,
            "text": "What if it was by your boss?",
            "title_similarity": "0.4304395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqj12d",
            "score": 1,
            "text": "I will use this with this absolute nightmare of a woman i work with who constantly talks over you, makes passive agressive jabs at you and your work, makes you out to be an idiot in front of everyone else then pretends she’s a victim when you try and confront her about it.",
            "title_similarity": "0.7025169",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hkqkjjq",
            "score": 6,
            "text": "Question, What if they repeat the insult, but more aggressively?",
            "title_similarity": "0.507406",
            "sentiment_compound": -0.6746
        },
        {
            "id": "hkql0yn",
            "score": 7,
            "text": "You have never met my previous boss then, that office got a 100% turnover rate for the people they hired the previous year when I was there.",
            "title_similarity": "0.32000345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqo369",
            "score": 4,
            "text": "Where the hell are people working that they're spoken to like this?",
            "title_similarity": "0.3825488",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hkqok29",
            "score": 1,
            "text": "I had a rude client and asked him if he had to be so rude. Things got pretty heated for a few minutes and the call was cut short. I thought they would leave ASAP but actually improved the relationship\nAfter that we had much more productive meetings, my work with them was better and he was very polite. \n\nAll worked out in the end",
            "title_similarity": "0.65987146",
            "sentiment_compound": 0.7199
        },
        {
            "id": "hkqosrq",
            "score": 1,
            "text": "The jerk store called...",
            "title_similarity": "0.33200043",
            "sentiment_compound": -0.34
        },
        {
            "id": "hkqp0kd",
            "score": 1,
            "text": "What did you just say?",
            "title_similarity": "0.13103142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqp6cc",
            "score": 1,
            "text": "That’s usually how I *escalate* a situation, not diffuse it. “What did you say?!”",
            "title_similarity": "0.4938347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqpd5z",
            "score": 1,
            "text": "Had a friend that recently had to deal with a sarcastic jerk that would belittle them (a new hire) in front of the boss.  The boss was good friends with the sarcastic jerk, and decided to let my friend go because they weren't getting along together.\n\nI've never heard of anything so spineless in the workplace in a long time.  My friend was in a lose - lose situation no matter what was said.  It was easier to just let my friend go rather than having the 3 adults put in a room to try to work things out.  Cowardly behavior any way you look at it.  \n\nMy friend had a ton of experience on the software that they were working on, but the sarcastic jerk that had to have things done their way insisted that my friend didn't know what they were doing.  Eventhough my friend has been working on the software for well over a decade.  My friend chose not to say anything, expecting for the boss to eventually try and act like a boss and deal with the situation.  Easier just to get rid of the new hire, and move on.  What a coward. \n\nHowever, I'll definitely pass on the suggestion to them.  I think that your suggestion is a great one. Thanks.",
            "title_similarity": "0.7965423",
            "sentiment_compound": 0.984
        },
        {
            "id": "hkqpiiq",
            "score": 31,
            "text": "If anyone is planning on doing this please be sure you're being insulted and not being criticized for work. I've seen several instances of people take personal offense to something  that the other party was completely valid in pointing out as a shortcoming and ended up making a larger issue of something someone was quickly addressing. Too many people see red and end up asking for someone to repeat or further elaboration and get handed their ass AND it becomes an action item for their boss.",
            "title_similarity": "0.8175198",
            "sentiment_compound": -0.0168
        },
        {
            "id": "hkqpiyu",
            "score": 1,
            "text": "Sounds like Harvey Keitel in Reservoir Dogs.  Someone insults him and questions his loyalty and he asks for him to repeat it, apparently confirming that he may need to fight or kill the guy.  His acting in that scene is great.",
            "title_similarity": "0.6371069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqpojb",
            "score": 1,
            "text": "This is one of my favorite responses to unprofessional behavior:\n\n\"...This sort of behavior is not professional and causes concern. I understand that {we} are not on solid ground, and we have been working hard to fix this. I would appreciate a higher level of professionalism from you.\"\n\nOr \" I would appreciate a higher level of professionalism\"",
            "title_similarity": "0.6475435",
            "sentiment_compound": 0.5033
        },
        {
            "id": "hkqq451",
            "score": 10,
            "text": "What if you suck and you do this and it just reaffirms you suck.",
            "title_similarity": "0.4929153",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hkqq7kl",
            "score": 1,
            "text": "Except if you work in a toxic workplace and gaslighters jump in to whitesplain/mansplain what the offending person said in front of everyone. This happens all the time and then it’s you vs multiple people.",
            "title_similarity": "0.6430124",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkqqef8",
            "score": 7,
            "text": "I think, if you are at a point where people are being insulting, you should find out where it's coming from.  You might be the reason people are frustrated or upset.  No, being insulting isn't nice but there is usually a reason it's being done.  Passive-aggressively escalating the situation by asking them to repeat like this isn't right either.",
            "title_similarity": "0.76284647",
            "sentiment_compound": -0.5597
        },
        {
            "id": "hkqqo2o",
            "score": 3,
            "text": "Nah. If you cross a line with me I will hang up or simply walk out without saying a word. You can come find me when you’re willing to be nicer. I don’t owe anyone a thing. Not even an acknowledgement I heard you.",
            "title_similarity": "0.62591934",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hkqqtrf",
            "score": 1,
            "text": "That might work, until you meet Vincent Vega.\n\nhttps://www.youtube.com/watch?v=OYDF666wtrc",
            "title_similarity": "0.27573895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqr0qb",
            "score": 1,
            "text": "When someone double dares you to say what one more time and calls you a motherfucker.\n\nBut you act professional and ask - excuse me what di...\n\nAt least they'll get chastised that the meeting room ain't a dead n€gar storage.",
            "title_similarity": "0.7949658",
            "sentiment_compound": -0.2469
        },
        {
            "id": "hkqr93h",
            "score": 1,
            "text": "No they'll say some neutral like \"I was complimenting your suit\" and then the whole room will chuckle at you.",
            "title_similarity": "0.49899888",
            "sentiment_compound": 0.743
        },
        {
            "id": "hkqrbtq",
            "score": 1,
            "text": "Kind of off-topic but whoever designed that flair should end up in jail.",
            "title_similarity": "0.6247889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqrdy5",
            "score": 5,
            "text": "Even better is, if they brush you off, pretend you don't understand their meaning and insist they explain as you are sure it relates to the meeting and it is important that everyone is heard and listened to.",
            "title_similarity": "0.76489985",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hkqrg00",
            "score": 1,
            "text": "This also works for me as a bartender, when a customer says something inappropriate or sexist to me, I’ll pretend I didn’t hear it and ask them to repeat it. It works especially well when there are many people with the person speaking inappropriately.",
            "title_similarity": "0.67583966",
            "sentiment_compound": 0.2484
        },
        {
            "id": "hkqrgwm",
            "score": 1,
            "text": "Just tell them you slept with their wife.",
            "title_similarity": "0.42195138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqs0g2",
            "score": 3,
            "text": "LPT: works the same on recorded calls where each member is expected to act a certain way. I often call Retail locations for verification purposes and we all work for the same org. Some dont like my deliverance of bad news and get really upset. If it ever gets to insulting or name calling I just do as OP described and they either apologize or hang up the phone. Regardless of this the call gets pulled and they get talked to by thier boss' boss.",
            "title_similarity": "0.73124987",
            "sentiment_compound": -0.8482
        },
        {
            "id": "hkqs4ph",
            "score": 36,
            "text": "I have never, in almost 20 years of white collar work ever heard anyone insult another in a meeting. Sure they got heated but never insults. Where the hell do you work?!",
            "title_similarity": "0.47681528",
            "sentiment_compound": -0.7347
        },
        {
            "id": "hkqslvb",
            "score": 2,
            "text": "\"You're a fucking asshole, Dave!\"\n\n\"Sorry, can you repeat that?\"\n\n\"Oh sorry, I was on mute.\"",
            "title_similarity": "0.57934916",
            "sentiment_compound": -0.2859
        },
        {
            "id": "hkqst0s",
            "score": 1,
            "text": "Depending on context/ what they specifically say/ if it is deserved, sometimes you just gotta hold the \"L\".",
            "title_similarity": "0.30749053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqt26f",
            "score": 1,
            "text": "Conversely, one of the most character-building jobs I ever had was one that put you out if you didn’t carry your weight and the team had tampons available, strategically placed, to throw at you if you started complaining about the job being hard. \n\nI actually, somehow, still look back on that experience fondly and wouldn’t be who or where I am today without having gone through it. \n\nIs it proper? Absolutely not. Helped me become who I am in that specific situation, though.",
            "title_similarity": "0.63774705",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hkqtjth",
            "score": 1,
            "text": "Had this from an idiot manager during a disciplinary as he was making clear to everyone that it was purely a vindictive action on his part and I had nothing to answer for.\n\nIgnored him, then asked him to repeat his abusive comment, leaned over and asked if the HR Manager who was taking notes had got all that, and he totally lost it much to my amusement.\n\nHe ended up on a disciplinary and eventually chucked out of the company. There is no place for egotistic, narcissistic managers in business.",
            "title_similarity": "0.82004625",
            "sentiment_compound": -0.8977
        },
        {
            "id": "hkqtpqq",
            "score": 1,
            "text": "Same thing for offensive jokes. \n\nAsk them to repeat and explain. \n\nUsed to be a corporate pharmacy guy, and the number of people who thought they were clever with offensive shit was shocking. \n\nNo one ever wanted to repeat or explain their jokes when asked.",
            "title_similarity": "0.7408968",
            "sentiment_compound": -0.802
        },
        {
            "id": "hkqu604",
            "score": 11,
            "text": "I worked for a bully. In this scenario, he would just sigh, take a deep breath, clench his fists and repeat verbatim what he said while everyone more junior or senior than him sits around petrified / uninterested enough to take him on.",
            "title_similarity": "0.70350146",
            "sentiment_compound": -0.765
        },
        {
            "id": "hkquj6m",
            "score": 1,
            "text": "Could you give a few examples of what kind of insults are these?",
            "title_similarity": "0.41227025",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hkqur3o",
            "score": 1,
            "text": "Personally I think it is best to address it head-on. Just say \"let's not start an insult war, it is counterproductive\" and then offer solutions or whatever to the problem they are looking to solve. If that doesnt work, and they simply want to belittle you for no reason, then find a different place to work.",
            "title_similarity": "0.76390254",
            "sentiment_compound": -0.2495
        },
        {
            "id": "hkqv3ez",
            "score": 1,
            "text": "\"when I try to do that every year.",
            "title_similarity": "0.07306448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqv55e",
            "score": 1,
            "text": "Or they will either say “nothing, never mind,” or pretend that they said something else. If you actually did hear them but they don’t repeat it, then you can respond with “that’s what I thought. you and I can have a private chat over email but for now let’s keep it professional”",
            "title_similarity": "0.6851395",
            "sentiment_compound": 0.0382
        },
        {
            "id": "hkqvign",
            "score": 1,
            "text": "100% of the time this has ever been a situation around me, they just go “ehh, nevermind you don’t get it” and move on",
            "title_similarity": "0.26804185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqvo2o",
            "score": 3,
            "text": "Maybe also get rid of that word \"team\". It's condescending and demeaning.",
            "title_similarity": "0.6640258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqwhng",
            "score": 1,
            "text": "This works for co workers, family anyone being snarky. Give them a chance to own it or do better",
            "title_similarity": "0.61184204",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hkqx8z2",
            "score": 3,
            "text": "who gets insulted during meetings?",
            "title_similarity": "0.57559973",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkqxgim",
            "score": 2,
            "text": "My dad had to do a variation of this during a meeting where a colleague was subtly patronizing his latin name by referring to him as José. After the third mention of José my dad stopped the meeting and asked \"who is José\" and just stares at the guy. The guy shut up and started using his actual name.",
            "title_similarity": "0.6676911",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hkqximw",
            "score": 2,
            "text": "And this will 100% backfire if you misinterpreted the \"insult\" or if the \"insult\" is very much a valid assessment of you...\n\nBasically if YOU'RE the dick, and someone gets snarky with you, you are going to lose this one...",
            "title_similarity": "0.6987686",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hkqxj5c",
            "score": 4,
            "text": "It's arrogant to think you can pretend anything like that and get away with it.  You'll be seen as an asshole too.",
            "title_similarity": "0.70209736",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hkqxwe4",
            "score": 3,
            "text": "I had a senior director do this to me outside of a meeting and when I met with HR they told me he is under a lot of stress. \n\nThe guy was a total moron and the only reason he was under stress was because he failed upward beyond his capabilities and didn't have anyone to blame it on.",
            "title_similarity": "0.7729217",
            "sentiment_compound": -0.9299
        },
        {
            "id": "hkqyfq9",
            "score": 1,
            "text": "'There's nothing wrong with your hearing you heard what I said.'",
            "title_similarity": "0.28193557",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hkqyq24",
            "score": 2,
            "text": "So I'm supposed to talk to my superiors like a simp? Fuck this post so much",
            "title_similarity": "0.6588967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkqz85t",
            "score": 2,
            "text": "So then you challenge them to a duel if they repeat it?",
            "title_similarity": "0.46920842",
            "sentiment_compound": 0.144
        },
        {
            "id": "hkqzie3",
            "score": 1,
            "text": "This is a great LPT for anytime anyone says something rude to you. I was a teller at a bank and I would do this with drive through customers because they spoke into a microphone and there were speakers inside so usually the whole lobby would hear",
            "title_similarity": "0.54582703",
            "sentiment_compound": 0.296
        },
        {
            "id": "hkqzifb",
            "score": 1,
            "text": "The latter is sometimes accepted. That is the problem",
            "title_similarity": "0.20150909",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hkqzmz6",
            "score": 1,
            "text": "lol yeah assuming it isn't the boss/owner doing the humiliating",
            "title_similarity": "0.6777389",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hkr0aj2",
            "score": 1,
            "text": "Or they say that they didn't say anything.\n\n\"What did you say.\"\n\n\"Nothing, anyway let's continue on.\"",
            "title_similarity": "0.3870118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr0ztj",
            "score": 1,
            "text": "Except when you challenge a person in power and try this, you just became a targeted individual, no one will help you because no one wants to put their livelihood at risk then suddenly you are isolated and eventually let go or fired. Just be careful and know who you are dealing with.",
            "title_similarity": "0.84796035",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hkr1086",
            "score": 1,
            "text": "LoL I am not insulting people usually....\nSo when I do is common to ask me what I say...\nSo I just repit the insults Lauder and with extra clarification!!!!",
            "title_similarity": "0.54771423",
            "sentiment_compound": 0.5853
        },
        {
            "id": "hkr10v9",
            "score": 1,
            "text": "I'm never going to stay in a job where I feel like I have to defend myself. My star is too bright to waste its energy on shit like that.",
            "title_similarity": "0.5913882",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hkr123w",
            "score": 1,
            "text": "This would be a great LPT if it hadn’t been posted so many times.",
            "title_similarity": "0.33379644",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hkr15rb",
            "score": 2,
            "text": "I dunno. My colleague once doubled down on an insult in a meeting exactly this way and everyone was just perplexed, but nothing bad happened. But we are British so they probably couldn't fathom someone being openly rude so they assumed they'd misunderstood.",
            "title_similarity": "0.77827615",
            "sentiment_compound": -0.729
        },
        {
            "id": "hkr18d7",
            "score": 2,
            "text": "The military is like this. Worst job i ever had. Constantly berated and insulted for no reason. Thank you for the depression",
            "title_similarity": "0.65389454",
            "sentiment_compound": -0.9285
        },
        {
            "id": "hkr19z0",
            "score": 2,
            "text": "This caused me to have a nervous breakdown. Gave me all sorts of genuine PTSD that I needed therapy for it afterwards. \n\nThey even tried to sue me for violating an NDA by leaving a GlassDoor review.",
            "title_similarity": "0.69604987",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hkr1jl5",
            "score": 1,
            "text": "Ah great tip !  It totally drains the energy out of the insult.",
            "title_similarity": "0.44257334",
            "sentiment_compound": 0.5355
        },
        {
            "id": "hkr1jr3",
            "score": 1,
            "text": "Also, slightly related:\n\nOutside of work, If someone makes a \"joke\" that is Racist/sexist/Homophobic/etc. Pretend that you don't get it and ask them to explain it. Then watch them squirm.",
            "title_similarity": "0.7107357",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hkr1ogb",
            "score": 1,
            "text": "Great talk Simon sinek gave on toxic leadership & toxic team members. This resonated with me because I’ve always thought the same thing throughout my career about what kind of people I want on my team or I would work with. Unfortunately, businesses often overly emphasize tactical performance over team cohesiveness, thus allowing the asshole types not only survive but thrive in a lot of companies, influencing the company culture further and further into a toxic environment.  Worth a watch, and it is very short:\n\nhttps://youtu.be/kJdXjtSnZTI",
            "title_similarity": "0.6895476",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hkr1ua5",
            "score": 2,
            "text": "I like it!  Awesome passive aggressive move...",
            "title_similarity": "0.16781867",
            "sentiment_compound": 0.7959
        },
        {
            "id": "hkr1vnn",
            "score": 1,
            "text": "I umpire baseball and referee basketball and this trick is awesome.\n\nEspecially in youth sports the coaches will often say mind numbingly stupid, automatically electable shit.\n\nEjecting people isn't fun, so I simply let it go through one ear and out another. \"Excuse me, could you repeat that please?\"\n\n90% of the time its rephrased to something appropriate, or dropped entirely. But 10% of the time they just have no clue how badly they fucked up and follow through, making my paperwork very straightforward.",
            "title_similarity": "0.6399304",
            "sentiment_compound": -0.9395
        },
        {
            "id": "hkr20uu",
            "score": 1,
            "text": "LPT if you're at a job where you're being openly insulted (or insulted at all)... get a new job.\n\nwtf?",
            "title_similarity": "0.6432586",
            "sentiment_compound": -0.886
        },
        {
            "id": "hkr229s",
            "score": 1,
            "text": "If you can't take a sideline insult and feel the need to go on a power trip over it then you shouldn't be in a leadership role.",
            "title_similarity": "0.69392",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkr22wo",
            "score": 2,
            "text": "Do y’all get insulted at your jobs often?",
            "title_similarity": "0.5664323",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkr2432",
            "score": 2,
            "text": "\"Tact is the ability to tell someone to go to hell in such a way that they look forward to the trip\"   Winston Churchill (according to \"the internet\")",
            "title_similarity": "0.59142244",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkr25jh",
            "score": 1,
            "text": "Phyllis:\tI want to understand what you're saying, but it's difficult for me when you use that tone.\n\n  \nAngela:\tPhyllis, these are spoons. Spoons have rounded tops and are used to scoop things. What we need are forks, which have prongs or tiny spears on top. And we need knives, which have blades. Do you understand me now?\n\n  \nPhyllis:\tYes.\n\n  \nAngela:\tGoody",
            "title_similarity": "0.49265203",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hkr26dr",
            "score": 2,
            "text": "This is another of the many LPTs that sound good on paper, but rarely play out this way in real life. If anything, the insult may get worse the second time around.",
            "title_similarity": "0.48801172",
            "sentiment_compound": -0.8808
        },
        {
            "id": "hkr2e1k",
            "score": 2,
            "text": "Outcome 3, they repeat the insult and it turns out to be a feeling shared by everyone else because the person asking for it to be repeated deserves the comment.",
            "title_similarity": "0.43776262",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hkr2ls3",
            "score": 1,
            "text": "This usually would not work as they would pretend like they said nothing. Their point is not to make you hear it but moreso to make others hear it",
            "title_similarity": "0.67149395",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hkr2nsa",
            "score": 3,
            "text": "\"You heard what I said.\"\n\nYeah, neither an apology or admission.  Good try, though, OP.",
            "title_similarity": "0.45155948",
            "sentiment_compound": 0.6062
        },
        {
            "id": "hkr2zfd",
            "score": 1,
            "text": "I am a female chef and it is very much a “man’s kitchen”. I worked at a country club for four years and walked out this past summer. My last day there was something that haunts me. The experience left me having a severe panic attack in front of all of my coworkers and my boss’s boss just walked by like it wasn’t happening.\n\nThe things I experienced (mostly that job) in my seven years in the culinary field were traumatizing. Everything from insults, disrespect, gaslighting, intimidation, sexual harassment in most of its horrendous forms, etc.\n\nI could go on and on about every horrible thing that happened to me there, but I’m just so thankful to the restaurant I work at now. I’ve experienced a very minor set of the similar things. And all have been handled with more elegance and grace than a place that has literally millions and millions of dollars pouring into it every year.\n\nThe Kitchen is already an extremely stressful place to work. It needs to become vastly less toxic. Not just to females, but in general. I may have experienced Chef Rage as well, but I’ve never reduced anyone to feel like they’re nothing.",
            "title_similarity": "0.56716835",
            "sentiment_compound": -0.498
        },
        {
            "id": "hkr34pe",
            "score": 1,
            "text": "Will have to disagree partly. You just ignore them. I have been in calls with customers where they have been completely dicks. Just asking them to reiterate gains nothing. You just ignore and don't do business with them (hopefully)",
            "title_similarity": "0.7320042",
            "sentiment_compound": 0.3343
        },
        {
            "id": "hkr353q",
            "score": 2,
            "text": "I find it amusing that in movies and TV, corporate meetings are often portrayed as very aggressive with lots of disagreement, arguing and shouting.\n\nIn my experience this is rarely the case.",
            "title_similarity": "0.585469",
            "sentiment_compound": -0.5849
        },
        {
            "id": "hkr365g",
            "score": 1,
            "text": "\"You heard me\" Destroys this crap amazingly. makes em stammer about being insulted",
            "title_similarity": "0.6640746",
            "sentiment_compound": -0.9014
        },
        {
            "id": "hkr3b5r",
            "score": 1,
            "text": "Ctrl F shrimp...... no comments found. I am disappoint.",
            "title_similarity": "0.4118902",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hkr3fw5",
            "score": 1,
            "text": "I smell\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRepost",
            "title_similarity": "0.31319982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr3i61",
            "score": 1,
            "text": "“Aggressive language” should be “actively eliminated.”\n\nAlong with irony apparently.",
            "title_similarity": "0.6111654",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hkr3rn3",
            "score": 1,
            "text": "This tip is also great for those holiday family dinners when someone inevitably decides to be a fuxface",
            "title_similarity": "0.40644723",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hkr3seg",
            "score": 1,
            "text": "You have to also include pauses.  Where you just stare at them.  Pause for a moment and then ask them to repeat themselves and just paused and wait for their reaction.  The awkwardness and your unresponsiveness drive people crazy and they will likely panic and make themselves look worse.  \n\nThen you change the subject, don't address it and the guy has to sit there feeling like a dumbass.",
            "title_similarity": "0.7735816",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hkr3vwx",
            "score": 1,
            "text": "I simply stare them in the eyes until they go silent.",
            "title_similarity": "0.39327705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr3z6z",
            "score": 2,
            "text": "or they'll come back with\n\"you heared what i said\" \nor\n\"why arent you paying attention during important meetings?\"",
            "title_similarity": "0.5748441",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hkr446t",
            "score": 1,
            "text": "\"nothing important, moving on blah blah blah\"",
            "title_similarity": "0.2346717",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hkr46pk",
            "score": 1,
            "text": "unfortunately, the offender typically doesn't have the balls to repeat it, and someone inevitably changes the subject to avoid an uncomfortable silence. Essentially letting them get away with it.\nSeen this so many times....",
            "title_similarity": "0.69297427",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hkr482f",
            "score": 2,
            "text": "Blows my mind that people work in places where this would be a common occurence.",
            "title_similarity": "0.39274418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr4cad",
            "score": 1,
            "text": "I just used an approach similar to this one, but for jokes. There a post about a stupid political grifter giving a dumb hot take of: if sex work is work then can a boss require women to suck his dick as a job requirement? \n\nThen the predicted “it’s just a joke” defense was used.\n\nSo I asked a person who agreed it was just a joke and said you’d see so if you weren’t primed to be angry at him how it was funny and where the punchline was.\n\nHe resorted to “didn’t read that, lol” \n\nIt works far too well.",
            "title_similarity": "0.72823346",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hkr4idc",
            "score": 2,
            "text": "No. That’s not what they do. They just wave it off and say “Nevermind. You wouldn’t get it”",
            "title_similarity": "0.5329159",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr4kdv",
            "score": 1,
            "text": "This is great advice for dealing with my mother in law. Thanks!",
            "title_similarity": "0.2935771",
            "sentiment_compound": 0.807
        },
        {
            "id": "hkr4lvl",
            "score": 1,
            "text": "You work in a place where people insult you in meetings? Lol.\nGet the fuck out of there. \nWe don’t need a “life protip” to cope with toxic work environments because you felt the need to with your absence of a backbone",
            "title_similarity": "0.8697287",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hkr4sij",
            "score": 1,
            "text": "Oh god this tip  is from those cringey phycological tiktok vids.",
            "title_similarity": "0.38889134",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hkr4tcu",
            "score": 1,
            "text": "Holy fuck. What a great idea",
            "title_similarity": "0.07140591",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hkr4xe7",
            "score": 1,
            "text": "This works in a lot of social situations that aren't 1:1, I think! Shame is a hell of a tool that can easily turned against transgression (that's arguably what it was originally meant for), after all.",
            "title_similarity": "0.5904962",
            "sentiment_compound": -0.8221
        },
        {
            "id": "hkr53co",
            "score": 1,
            "text": "Insulting each other durning work and at the meeting is how half the guys I work with talk to each other. Nobody means any spite. Just how we talk to each other.",
            "title_similarity": "0.6855829",
            "sentiment_compound": -0.765
        },
        {
            "id": "hkr54mg",
            "score": 1,
            "text": "I actually do this with clients/customers as well. Any time someone says something shitty (or stupid, and honestly that’s more frequent) I just claim I didn’t understand them and ask them to repeat themselves. Works like a charm.",
            "title_similarity": "0.75959766",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hkr58st",
            "score": 1,
            "text": "R.I.P to all those who will follow this advice",
            "title_similarity": "0.22475705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr5dce",
            "score": 1,
            "text": "Insults is a criteria in construction. Not constructive criticism but in the act of physical labor.",
            "title_similarity": "0.48694086",
            "sentiment_compound": -0.0508
        },
        {
            "id": "hkr5ht7",
            "score": 1,
            "text": "Usually when doing this it always results on the other person saying -1 \"uh?\" (Which leds to \"being your fault\" for not \"speaking more clearly\" or in the case of repeating the question it leds to you being considered the one causing trouble or the one provoking) -2 they simply ignore you completely and in the case of repeating your question  leads to the first outcome",
            "title_similarity": "0.7276752",
            "sentiment_compound": -0.88
        },
        {
            "id": "hkr5o5w",
            "score": 1,
            "text": "I swear this was on LPT like 3 weeks ago.",
            "title_similarity": "0.07382911",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hkr5pip",
            "score": 1,
            "text": "I swear this was on LPT like 3 weeks ago.",
            "title_similarity": "0.073829085",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hkr5whd",
            "score": 1,
            "text": "Aw man. I just got fired from my casual job for unprofessionalism. I made a joke within a group setting about a superior. We have a meeting at the end of each night shift being being let go. The person in question used to be a team leader but has been demoted to team leader support which is just a position where as he is teaching the new team leader the ropes and has essentially become a regular worker. He mentions that there is a position in another department for a team leader role which he is no longer in. Says he likes where he is and what he's doing. I made a comment and said. You liking picking? Because we're in a warehouse environment and that's what the rest of us did. And he goes. I like being out bound team leader and I laughed because he no longer had the role. And the person standing behind him was the real team leader and he was smirking about the comment also",
            "title_similarity": "0.71212417",
            "sentiment_compound": 0.9371
        },
        {
            "id": "hkr5yd8",
            "score": 1,
            "text": "\"the ocean called they're running out of shrimp \"",
            "title_similarity": "0.46883205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkr6j3r",
            "score": 1,
            "text": "Or they’ll just ignore you",
            "title_similarity": "0.48272514",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hkr79v8",
            "score": 1,
            "text": "Might be unpopular opinion but I truly believe that when people are subjected to unprofessional/disrespectful behavior they suffer more from the regret of not standing up for yourself or \"fighting back\" than from the comment/behavior itself. Now, if this is the job with great insurance that's paying for your kiddos cancer treatments, then I can understand laying low/not rocking the boat etc. Otherwise, call that shit out immediately and directly. People don't respect people that don't defend themselves. Protect yourself and your sanity.",
            "title_similarity": "0.7778142",
            "sentiment_compound": -0.967
        },
        {
            "id": "hkr7lv3",
            "score": 1,
            "text": "Said that to the CEO today. Got fired.",
            "title_similarity": "0.5567127",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hkr7o7j",
            "score": 1,
            "text": "Or just be direct. Once a respected director level coworker of mine made an off handed rude comment during a meeting. I simple responded \"Wow, that was rude.\" and sat there pleasantly. She tried to joke skip over it but stayed in the meeting room to talk/apologize to me immediately afterwords. I felt that I received a non apology apology. We talked again later in my office because she felt that she didn't really apologize and that I didn't really accept it. And we got to a really good place with mutual understanding if each other. People from the meeting came up to comfort me. My one coworker that I stuggled to work well with call our boss to tell him he needed to address my coworkers behavior. My boss checked in to say he would be address it and I had the pleasure of saying please don't we talked and are both fine. I came across as honest, calm, and willing to work through a hard conversation. No reason to play games at work.",
            "title_similarity": "0.7497155",
            "sentiment_compound": 0.9774
        },
        {
            "id": "hkr7xdz",
            "score": 1,
            "text": "Is it possible we are overthinking this?\n\n If someone insults me at work it is probably a friend of mine. Just tell 'em to \"bite my ginger balls\", and move on with my day. \n\n(And no this would not work, or be advisable, if it wasn't a friend of mine)",
            "title_similarity": "0.80499744",
            "sentiment_compound": -0.5312
        },
        {
            "id": "hkr8cfp",
            "score": 1,
            "text": "What sort of work environment are you in where people hurl insults in an open meeting? If they're that obvious and frequent then I'm assuming other people know.",
            "title_similarity": "0.7139661",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hkr8fxt",
            "score": 1,
            "text": "If you're getting insulted often enough during meetings that you have to develop a counter-strategy against it, MAYBE you're the problem.",
            "title_similarity": "0.75031406",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hkr8g3b",
            "score": 2,
            "text": "I do this with nasty customers on the phone also. I give them a chance to come correct otherwise we're going down a different path.",
            "title_similarity": "0.7012397",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hkr8ssj",
            "score": 2,
            "text": "Youre a bad employee Harry! You are always late, you underperform, and you are rude to everyone!\n\nHarry:\"I'm sorry, could you repeat that?",
            "title_similarity": "0.65347296",
            "sentiment_compound": -0.8118
        },
        {
            "id": "hkr8y7a",
            "score": 1,
            "text": "Or repeat it louder lmao",
            "title_similarity": "0.10663326",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hkr97sl",
            "score": 3,
            "text": "Oh ho ho, I can't wait until someone tries this on me at my workplace! People at my work hate confrontation and will ignore things so they don't have to deal with them, so I would be floored if I was asked to repeat myself.\n\nDon't like facing facts about poor performance? Wanna pretend it's all an insult to your precious ego? I will double down on that and gladly repeat myself. \n\nSome times people enjoy being offended as a way to deflect blame for things they should take responsibility for, so just be prepared for that thing you think is an insult to get repeated again. It may not be an 'insult' but honest feedback you need to hear.",
            "title_similarity": "0.89969695",
            "sentiment_compound": -0.1715
        },
        {
            "id": "hkra3bb",
            "score": 1,
            "text": "Cannot he accepted? WHAT? They just got away with it twice because you’re too passive to defend your self. Pretty sad.",
            "title_similarity": "0.71161014",
            "sentiment_compound": 0.1144
        },
        {
            "id": "hkra80h",
            "score": 1,
            "text": "I feel like that is likely to backfire and make you look passive aggressive",
            "title_similarity": "0.63580996",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hkra8he",
            "score": 1,
            "text": "This doesn't have to apply to just you - if someone else is insulted and they don't know this LPT, you may still want to have the boss or whomever repeat the insult. \n\n\nStick up for your teammates that may not know how to stick up for themselves!",
            "title_similarity": "0.8120675",
            "sentiment_compound": -0.7644
        },
        {
            "id": "hkrajjb",
            "score": 1,
            "text": "It very much depends on the audience. I was a senior manager and my superior was a board director. He would intimidate, bully, gaslight, you name it - and publicly. But because of his seniority, and extreme closeness to the HR director, calling him out only resulted in further intimidation. It wasn’t even covert, he enjoyed it. So it was just endured. The issue was systemic - the company culture that they spent so much time on, was a facade. It only stopped when he left.",
            "title_similarity": "0.7886767",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hkrapef",
            "score": 1,
            "text": "LPT brought to you by someone who has never been in a meeting with executives or people on the C-suite haha",
            "title_similarity": "0.4468714",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hkrapf0",
            "score": 2,
            "text": "Also, add “ese” at the end so they think you’re in the Latin kings",
            "title_similarity": "0.36590692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrapj0",
            "score": 1,
            "text": "LPT: This works in most any situation really, I've found. Lets you avoid accidental misunderstandings where you thought someone insulted you but they didn't mean to do so, as well as generally pushes things towards being more friendly in general.",
            "title_similarity": "0.62651265",
            "sentiment_compound": 0.6694
        },
        {
            "id": "hkravh6",
            "score": 2,
            "text": "I said : *Your mother was a hamster, and your father smelt of elderberries!*",
            "title_similarity": "0.4130053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrb3n2",
            "score": 2,
            "text": "and then everyone else agrees with him",
            "title_similarity": "0.15757154",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hkrbf8y",
            "score": 1,
            "text": "\"The ocean called...\"",
            "title_similarity": "0.019697092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrbh7r",
            "score": 1,
            "text": "This also works VERY well for inappropriate jokes. Another route is to look at them and ask “I don’t get it. What is that funny?”  \n\nMake them explain the inappropriate connection. \n\n“How many women are needed for _____ to happen? ________ number because (insert stereotype here)!”\n\n…..I don’t get it? Why would the woman do _____ ?”\n\nMake them tell you. Works VERY well. \n\nAnother is repeat LOUD for ALL to hear, when someone quietly whispers some inappropriate thing to you. \n\n“PAT DID YOU MEAN TO TELL ME I HAVE A NICE ASS??? PAT WHY WOULD YOU COMMENT ON MY BODY?!?!”",
            "title_similarity": "0.6137129",
            "sentiment_compound": 0.812
        },
        {
            "id": "hkrbw2i",
            "score": 2,
            "text": "You are a slow overweight jackass who is slowing your team down by not listening.\n\n\"Boot camp commander - can you repeat that I wasnt listening, sir.\"",
            "title_similarity": "0.69697225",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hkrbxtp",
            "score": 2,
            "text": "This is not a good strategy for me, cause if they double down and insult me again. Things gone escalate fast",
            "title_similarity": "0.6476964",
            "sentiment_compound": -0.6914
        },
        {
            "id": "hkrbyti",
            "score": 1,
            "text": "This is not a good strategy for me, cause if they double down and insult me again. Things gone escalate fast",
            "title_similarity": "0.6476964",
            "sentiment_compound": -0.6914
        },
        {
            "id": "hkrc1ao",
            "score": 1,
            "text": "Yeah unless you're getting called out and then you give that person a chance to not only repeat themselves but to give a more elaborate explanation of why you suck.",
            "title_similarity": "0.64218736",
            "sentiment_compound": -0.4118
        },
        {
            "id": "hkrccd9",
            "score": 1,
            "text": "The latter is accepted and has been accepted. Work culture is horrible.",
            "title_similarity": "0.5429059",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hkrcfho",
            "score": 1,
            "text": "I can't do that with my boss or client!",
            "title_similarity": "0.6139873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrcqiy",
            "score": 1,
            "text": "I mean they would just not answer…",
            "title_similarity": "0.33775973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrcw4o",
            "score": 1,
            "text": "I feel like this exact LPT is posted verbatim every month.  Are people karma farming?",
            "title_similarity": "0.21084273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hkrd9et",
            "score": 1,
            "text": "Who the fuck is insulting people in meetings?!",
            "title_similarity": "0.64582634",
            "sentiment_compound": -0.7901
        },
        {
            "id": "hkrdpvd",
            "score": 1,
            "text": "Same when someone says anything inappropriate. And when people tell inappropriate jokes, ask them to explain why it's funny.",
            "title_similarity": "0.49259996",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hkrdya4",
            "score": 1,
            "text": "Can use with irate/rude customers as well.  Really shines a spotlight on their behavior and they often backtrack.",
            "title_similarity": "0.5752653",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hkre4ka",
            "score": 1,
            "text": ".Man, reading through some of these comments is both eye-opening and sad: I 100% despise my direct supervisor (could even possibly say I actually hate him because of his passive aggressive approach to silly shit, but failure to exercise his job and duties as he should) but never have I been insulted at ANY of my various IT roles, ranging from help desk scrub straight out of college, to senior dev at a law firm, and now IT consultant for multinationals.  Yeah, I have gotten annoying comments and such, but never personally insulted.  That is WILD that people are getting that kind of treatment at work.",
            "title_similarity": "0.76555717",
            "sentiment_compound": -0.815
        },
        {
            "id": "hkre68e",
            "score": 1,
            "text": "She is the latter. Id leave if the benefits and money weren't good but fuck I cant take her public humiliation tactics much longer",
            "title_similarity": "0.67884207",
            "sentiment_compound": -0.3134
        },
        {
            "id": "hkre8g8",
            "score": 1,
            "text": "This is a top level LPT!",
            "title_similarity": "-0.0054972945",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hkredfh",
            "score": 2,
            "text": "What? No. If someone insults you during a meeting you ignore it and carry on with the meeting. When you get out of the meeting, you pull them aside immediately and nip that shit in the bud.\n\nIf they keep fucking around, escalate.\n\nYou’re in a meeting to get work done, not for some prick to belittle you. Even if the insult was justified because you’re a fucking clown, there’s proper avenues to address it.",
            "title_similarity": "0.832201",
            "sentiment_compound": -0.8851
        },
        {
            "id": "hkrelly",
            "score": 2,
            "text": "I did this to a guy in my neighborhood who tried to talk shit, unprovoked, while jogging by. I asked him to repeat himself 3 times and he literally ran away after the third request. He was 2x my size.\n\nI live in a super uppity neighborhood full of holier-than-thou middle-class people who think they're upper class. Nobody here expects anyone to talk back to them so they have absolutely no clue how to react when you do.",
            "title_similarity": "0.5941385",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hkrfnzg",
            "score": 2,
            "text": "I did this to my boss. She walked me out of the meeting sat me down and made my life a living hell for the next year. Good times. I said, “excuse me?”. Nailed it.",
            "title_similarity": "0.6617085",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hkrg3d9",
            "score": 1,
            "text": "If it’s an inappropriate joke say “I don’t get it”\n\nHaving to explain a racist / sexist joke is super embarrassing to even the most insensitive people.",
            "title_similarity": "0.68839836",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hkrgovb",
            "score": 2,
            "text": "I'll just be mean and say it. This idea is pure garbage lol",
            "title_similarity": "0.5576247",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hkrgpwa",
            "score": 1,
            "text": "Oh yeah? Well the jerk store called and they’re running out of you!",
            "title_similarity": "0.63917756",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hkrgvl4",
            "score": 2,
            "text": "\"Hey, Costanza, the ocean called...they're running outta shrimp!\"",
            "title_similarity": "0.4662173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrh76e",
            "score": 1,
            "text": "Lol this definitely works. I had a customer tell me he was going to show up at my doorstep and finished the sentence with “and yes this is a threat”. I said “Sorry Joe, the phone cut out on me. What was the last part you said?” He immediately changed the sentence to “All I’m saying is I need my stuff ASAP.”\n\nWhat was the problem you ask? A man in the industry for decades, didn’t understand why his special order material wasn’t here in 2 weeks and was being delayed…. During a pandemic…. Material shortage…: labor shortage….",
            "title_similarity": "0.6547201",
            "sentiment_compound": 0.7941
        },
        {
            "id": "hkrhqca",
            "score": 2,
            "text": "Another tactic I've often used is to act like you don't understand the insult.  If someone has to explain an insult, it not only puts the spotlight on them for what they said, it loses all effectiveness.",
            "title_similarity": "0.76828575",
            "sentiment_compound": -0.1022
        },
        {
            "id": "hkrhz6n",
            "score": 1,
            "text": "LPT - tell them the jerk store called and theyre running out of him",
            "title_similarity": "0.6583161",
            "sentiment_compound": -0.34
        },
        {
            "id": "hkri6eo",
            "score": 1,
            "text": "“YOURE A TERRIBLE STUNTMAN!”",
            "title_similarity": "0.47475883",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hkrifjd",
            "score": 2,
            "text": "The repeating part is actually really smart. People sometimes say things they don't mean or wish they wouldn't have said. This gives the person a chance to reconsider how they approved a situation verbally. If it is a meeting with multiple people, it can also kind of put them on the hot seat which heightens the pressure to get it right the second time.",
            "title_similarity": "0.5956792",
            "sentiment_compound": 0.5163
        },
        {
            "id": "hkripdx",
            "score": 2,
            "text": "I tried this once not in a meeting but in a convo with friends and they just refused to repeat it lol or apologize they were like you don't listen",
            "title_similarity": "0.6663557",
            "sentiment_compound": 0.872
        },
        {
            "id": "hkrj9jd",
            "score": 1,
            "text": "In what kind of civilised workplace do people generally insult each other during meetings?",
            "title_similarity": "0.7082279",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkrjb2z",
            "score": 1,
            "text": "Why do you hate latters op",
            "title_similarity": "0.470293",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hkrjesn",
            "score": 1,
            "text": "It takes a certain kind of single celled brain dead husk to work business or office jobs. It sounds like it's just licking the next guys ass until you get to the top",
            "title_similarity": "0.6356312",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hkrjfyf",
            "score": 1,
            "text": "Just sit in silence imo let the comment linger in the air like a bad fart then move on to the topic in hand professionally and efficiently",
            "title_similarity": "0.5860276",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hkrjml5",
            "score": 1,
            "text": "In my experience this comes off as a challenge like facing off and saying..I dare you to say that again, or saying repeat that with an insinuation you will do something about it. The room looks at both sides with both feeling pressure to show who is on top.\n\nDo this if you have the power and security to back it up. Otherwise I'd rather deal with the person 1 on 1. Not because I respect them but because it's normally a better way to deal with an asshole that probably likes an audience.",
            "title_similarity": "0.73381734",
            "sentiment_compound": 0.8564
        },
        {
            "id": "hkrjpbc",
            "score": 1,
            "text": "How has no one made a George Costanza reference yet!? When someone insults you at a meeting, just tell everyone you slept with their wife!",
            "title_similarity": "0.68488795",
            "sentiment_compound": -0.6792
        },
        {
            "id": "hkrk29z",
            "score": 1,
            "text": "And the follow up make sure to record the speech",
            "title_similarity": "0.3011763",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hkrkewp",
            "score": 1,
            "text": "Once I was fooling around in class and teacher asked me “what was the last thing I said?” And I said “ what was the last thing I said” her face went red and she just could not come back with anything. It was a good day",
            "title_similarity": "0.66821617",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hkrki0s",
            "score": 1,
            "text": "This some lifetime movie tip",
            "title_similarity": "0.06820692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrkpfa",
            "score": 1,
            "text": "Who the hell is throwing insults in a work meeting",
            "title_similarity": "0.62503964",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hkrkxi6",
            "score": 1,
            "text": "The most insulting thing I have had done to me is when my mom was in hospital, in a coma (she tried to take her own life), I left work early that day to go to the hospital, I then called my boss to say I wouldnt be in the following day as we disnt know if she would make it.  He said I coulsnt take off because he had an ear appointment with the VA.\n\nSo I was at work the following day.",
            "title_similarity": "0.6087038",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hkrl6fs",
            "score": 1,
            "text": "\"What do you mean by that?\" asked in an innocent way can work well.",
            "title_similarity": "0.26239598",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hkrl780",
            "score": 1,
            "text": "I had a co-worker call a fellow employee poopy pants in a joking manner then get called in for a meeting because the person he called poopy pants had GI issues and was incontinent. He had no idea. That lady sucked though so she can eat a dick anyway.",
            "title_similarity": "0.7252135",
            "sentiment_compound": -0.765
        },
        {
            "id": "hkrlmww",
            "score": 1,
            "text": "r/ShittyLifeProTips",
            "title_similarity": "0.34094423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrlska",
            "score": 1,
            "text": "You're not gonna beat assholes at their own game, this won't work more than once.",
            "title_similarity": "0.6253084",
            "sentiment_compound": 0.4717
        },
        {
            "id": "hkrm9w7",
            "score": 1,
            "text": "I do this to my high school students all the time...",
            "title_similarity": "0.15432021",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrme9c",
            "score": 2,
            "text": "I find \"what does that mean?\" Works really well. Also if someone is being super aggressive saying that A is better than B. Ask \"is it?\" Quite often it's as far as they have gone with their point and just asking a simple question makes them over explain giving you ammunition for a counter.",
            "title_similarity": "0.54635394",
            "sentiment_compound": 0.8848
        },
        {
            "id": "hkrmec3",
            "score": 1,
            "text": "u/repostsleuthbot",
            "title_similarity": "0.21310404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrmgbh",
            "score": 1,
            "text": "This works with sexual harassment jokes too. If someone is making uncomfy jokes towards you, ask them to explain the joke. That will make them look like an ass REAL quick",
            "title_similarity": "0.6321038",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hkrmoxt",
            "score": 1,
            "text": "I have never been in a meeting where someone has personally insulted someone else. Is this a common thing that happens?",
            "title_similarity": "0.42743146",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkrn4x2",
            "score": 1,
            "text": "Honest question: is it ok if i insult my work ? E.g.  why is this shit not working?",
            "title_similarity": "0.6984209",
            "sentiment_compound": -0.5283
        },
        {
            "id": "hkrnble",
            "score": 1,
            "text": "Yeah, well the jerk store called—they’re running out of you!",
            "title_similarity": "0.63099355",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hkrnw8u",
            "score": 1,
            "text": "Jesus I wish I read this two years ago",
            "title_similarity": "0.34285262",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hkro9xx",
            "score": 1,
            "text": "I pull a Costanza and just say, \"Oh yeah, well I had sex with your wife!\"",
            "title_similarity": "0.3703833",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hkroc87",
            "score": 1,
            "text": "Mom told me it was my turn to post this",
            "title_similarity": "0.27085477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrodo2",
            "score": 1,
            "text": "Unless it's your boss, in which case it's time to leave.",
            "title_similarity": "0.5916548",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hkrol4b",
            "score": 1,
            "text": "And what if the aggressive language was said by my senior who is not only more important than me and more useful than me, but also indespensible in a short staffed profession and widely accepted as just being rude to everyone?\n\nOh and is consistent from day to day",
            "title_similarity": "0.7081562",
            "sentiment_compound": -0.2401
        },
        {
            "id": "hkrolaj",
            "score": 1,
            "text": "Very smart tip, one I have used myself, a variation of ‘playing dumb’. It’s a good way to see if they double down on the remark, feigning ignorance or a little deafness to draw out the bastards",
            "title_similarity": "0.5469562",
            "sentiment_compound": -0.1548
        },
        {
            "id": "hkrovto",
            "score": 1,
            "text": "Mildly related...\n\n\nBack in the day I worked with a guy called Angus. \n\nSat in a release meeting (some 10+ people) one of the architects asked him a question, just phrased it \"Anus, what do you think?\".\n\nAngus did a double-take, asked him what he said, and the guy said \"Angus, what do you think?\", totally deadpan.\n\nI've never seen someone look so confused, and it was one of the funniest things I've seen.",
            "title_similarity": "0.52105296",
            "sentiment_compound": 0.2427
        },
        {
            "id": "hkrqa5g",
            "score": 1,
            "text": "What kind of unprofessional bs job do you work at where people sling insults in meetings? Haha",
            "title_similarity": "0.75798434",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hkrqafu",
            "score": 1,
            "text": "100% a real thing I have used in life.\n\n\"Sorry I didn't hear you. I am hearing disabled\"",
            "title_similarity": "0.32335436",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hkrqap3",
            "score": 1,
            "text": "God LPT is shit. Firstly the two responses given arent the only two possible responses, they could easily reply by changing what they said slightly or changing the topic. So youve just let them get away with insulting you. And what sort of tip is 'this can not be accepted', what do you do to not accept it?  \n\nAlso insult is a very broad term, that could range anywhere for justified criticism of your work to childish name calling. You cant summarize how to interpret and deal with such things in a one line LPT.",
            "title_similarity": "0.75790596",
            "sentiment_compound": -0.9
        },
        {
            "id": "hkrqwx6",
            "score": 1,
            "text": "Ive also found with narcissists you can stay totally silent and fold your arms and simply look at them plain faced. \n\nMy emotional abuser said the last straw and id honestly given up. When she offended me for the last time, I did this and she went bright red, and kept digging a hole. Then lied and told people in the next room I was crying (I wasnt, just stood there), and they came in to see her trying to be nasty and lie about me and were like ‘are you lying again.’ It was the highlight of my 2020.",
            "title_similarity": "0.7301724",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hkrrf13",
            "score": 1,
            "text": "A slightly more practical LPT is that when someone makes an inappropriate or offensive joke or comment, act like you don't get it and ask them to explain it. Then sit back and watch them squirm!",
            "title_similarity": "0.63682914",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hkrrkge",
            "score": 1,
            "text": "or they'll say \"nothing\"",
            "title_similarity": "0.35431504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrrkhs",
            "score": 1,
            "text": "You might get laughed at if they're brazen enough to repeat is louder and they have rapport with others in the room.",
            "title_similarity": "0.49180764",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hkrrvnb",
            "score": 1,
            "text": "Disclaimer: This LPT does NOT apply for members of the US armed forces (or any military in the world probably). Use of this LPT while on active duty will likely result in a louder, clearer insult followed by the raucous laughter of your peers.",
            "title_similarity": "0.80437374",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hkrs16j",
            "score": 1,
            "text": "Big. Meaty. CLAWS!",
            "title_similarity": "0.044430144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrs1vf",
            "score": 1,
            "text": "How often are people being insulted during meetings?? this seems like such a specific and rare occurrence that this \"tip\" is worthless.",
            "title_similarity": "0.6739727",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hkrs4kn",
            "score": 1,
            "text": "Had a toxic AF co-worker who was holding us all hostage.  During a meeting they were sitting in the corner muttering a bunch of \"this is bullshit\", \"this is f-in stupid\", etc.\n\nManager did the \"Sorry, can you repeat that?\" and was met with silence.  I couldn't help myself and chimed in with an \"I believe they said...\"  Toxic co-worker blew up, screamed at everybody, and management finally walked them out that day.\n\nSo much stress lifted off my shoulders that day.",
            "title_similarity": "0.73744",
            "sentiment_compound": -0.9341
        },
        {
            "id": "hkrsa30",
            "score": 1,
            "text": "Where you ya’ll work?\n\nCan’t imagine working where insults during meetings is common.\n\nSave it for lunch hour behind their back like a professional.",
            "title_similarity": "0.6393347",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hkrscqf",
            "score": 1,
            "text": "I think this advice just gets the insult said twice.....with extra attention paid to it the second time around.",
            "title_similarity": "0.48943037",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkrsgk3",
            "score": 1,
            "text": "Seventh time I’ve seen this advice in the last 3 weeks.",
            "title_similarity": "0.07673785",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrsi2x",
            "score": 1,
            "text": "Well the jerk store called and they're running out of you!",
            "title_similarity": "0.6218287",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hkrstwn",
            "score": 1,
            "text": "But don't be like \"the fuck did you just day to me?!\" because that will sound pretty unprofessional too.",
            "title_similarity": "0.6824292",
            "sentiment_compound": -0.8341
        },
        {
            "id": "hkrtad2",
            "score": 1,
            "text": "tactics for phycological warfare",
            "title_similarity": "0.3108238",
            "sentiment_compound": -0.296
        },
        {
            "id": "hkrto75",
            "score": 1,
            "text": "In my country the audience will only cheer and support the insulter over insulted",
            "title_similarity": "0.5250217",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hkrtza5",
            "score": 1,
            "text": "Or they will just say “never mind” and laugh to themselves. I really feel like this would be more common than them apologising or repeating themselves to the group.",
            "title_similarity": "0.5807227",
            "sentiment_compound": 0.7635
        },
        {
            "id": "hkru484",
            "score": 1,
            "text": "ITT: people throwing their edge case \"what ifs\" for ways that this advice won't work in their specific situation. \"What if they're being passive aggressive??\" ... well then don't use this tip!!",
            "title_similarity": "0.76671153",
            "sentiment_compound": 0.5013
        },
        {
            "id": "hkru5yi",
            "score": 1,
            "text": "Is this the same as \"you talkin' to me?\"\nOr is it more like, \" what did you just say to me?\" They rarely repeat the insult if they're too busy dodging your fist!.",
            "title_similarity": "0.6702719",
            "sentiment_compound": 0.6953
        },
        {
            "id": "hkru6y2",
            "score": 1,
            "text": "Worst boss I ever had, told me one day she was upset about how I said “ Yes” to her when she asked me to do things.  It wasn’t the attitude or anything ( I’m very pleasant), but because I was “too casual” when I responded. Instead of saying just “ Yes” I would say “ Sure, no problem!” or “ absolutely, consider it done”.  It was the most toxic person I ever worked with in my life, and I knew she was actively trying to get me fired.",
            "title_similarity": "0.7624622",
            "sentiment_compound": -0.6304
        },
        {
            "id": "hkru9i7",
            "score": 1,
            "text": "Sorry, but this response only works with people who have a sense of shame.  Following this advice just gives them an opportunity to repeat and even expand on their insults.",
            "title_similarity": "0.6979759",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hkruav6",
            "score": 1,
            "text": "Ask them to repeat it several times, act as if you can’t hear them. By the 3rd time, whatever comment that was being made, sounds even more stupid. Taking the wind out of one’s sails/sales",
            "title_similarity": "0.66027546",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hkrugh1",
            "score": 1,
            "text": "How is The Jerk Store not the top comment? How?",
            "title_similarity": "0.5434916",
            "sentiment_compound": -0.5191
        },
        {
            "id": "hkrusj9",
            "score": 2,
            "text": "It’s an absolute nightmare when it’s the boss being toxic & passive aggressive with no HR to answer to.",
            "title_similarity": "0.70664334",
            "sentiment_compound": -0.25
        },
        {
            "id": "hkrv6se",
            "score": 2,
            "text": "Unless it’s my boss. He would repeat the insult… and call me an idiot for not hearing him the first time. 👍",
            "title_similarity": "0.8045051",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkrvrj1",
            "score": 1,
            "text": "Unless they’re really ballsy and just say it louder. Kind of makes you look like a bitch.",
            "title_similarity": "0.5151068",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hkrvut8",
            "score": 1,
            "text": "sometimes things are misheard/misunderstood for example if someone is really negative and defensive they will extrapolate insults out of perfectly well-intentioned comments/criticism.  But if someone is constantly insulting others without question, they should be moved or fired. Otherwise i'd just find another job.",
            "title_similarity": "0.77913725",
            "sentiment_compound": -0.896
        },
        {
            "id": "hkrwasu",
            "score": 1,
            "text": "Or claim they didn't say anything.",
            "title_similarity": "0.30673206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkrwgol",
            "score": 1,
            "text": "why you all upvoting this fake-ass future astroturf account?  are we that stupid as a group?\n\nthe advice is bullshit and this is just a shill farming your sweet sweet karma.",
            "title_similarity": "0.6696522",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hkrwiwa",
            "score": 1,
            "text": "Lol no. Don't pretend you didn't hear that. Shame the hell out of them. Laugh at them. But don't pretend that you didn't hear that.",
            "title_similarity": "0.62963396",
            "sentiment_compound": 0.4155
        },
        {
            "id": "hkrwo5x",
            "score": 1,
            "text": "Uh... why are people hurling insults your way in meetings? It this supposed to be a common thing?",
            "title_similarity": "0.74602395",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hkrxps3",
            "score": 1,
            "text": " or they repeat it again, and the people just keep laughing at you...\n\nLike the guy who tried this in a meeting a few years back, so the \"insulter\" repeated the joke and everyone laughed at the dude again. It's not so cut and dry.",
            "title_similarity": "0.5275947",
            "sentiment_compound": 0.8364
        },
        {
            "id": "hkrxrfp",
            "score": 1,
            "text": "Not during a meeting but I did something like this to a coworker a few weeks ago. It was during lunch and there were probably.... 7 employees in the restroom at the time? Coworker comes in and starts making these horrible \"jokes\" about a good friend and other coworker of mine that he works directly with. He was laughing like it's hilarious saying, \"it's about time that f-ing *insert slur for gay men that starts with \"F\" here* comes out of the closet!\" \"The F-ing F****t!\" And all around making a big scene of calling my friend gay.\n\nI just asked him to repeat it with a deadpan look. Just to make sure everyone in the restroom could and did hear this shit. (He legit thought I didn't so he cracked the \"joke\" again...) I left and went straight to the CEO and reported this, along with listing off every witness that was in the restroom. The bastard didn't make it through the next work day before getting fired (they had to question everyone so it took a little while).\n\nDon't let people get away with saying insulting shit to you or anyone. They probably think they're being funny and don't realize their words can and usually do hurt others.",
            "title_similarity": "0.5828778",
            "sentiment_compound": 0.5802
        },
        {
            "id": "hkrxu9l",
            "score": 1,
            "text": "this is straight up r/antiwork gold",
            "title_similarity": "0.07224765",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hkrxxij",
            "score": 1,
            "text": "“You can be an asshole or you can be wrong. But you can’t be both.” \n\nSo you better not be in the wrong when you ask them to repeat it lol",
            "title_similarity": "0.68382",
            "sentiment_compound": 0.4152
        },
        {
            "id": "hkrybv5",
            "score": 1,
            "text": "This is king advice, thanks brother",
            "title_similarity": "0.28772244",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hkryikp",
            "score": 1,
            "text": "You've clearly never been in the military. \n\n\"You've sucked so hard at your job you could start charging for it on the corner.\"\n\n\"I'm sorry what was that?\"\n\n\"**I said you've sucked so hard at your job you could start charging for it on the corner. Like a whore.**\"",
            "title_similarity": "0.7194636",
            "sentiment_compound": -0.8455
        },
        {
            "id": "hkryq0s",
            "score": 1,
            "text": "If i say to someone he s an idiot and asks me to repeat, i might just do it in slow mo",
            "title_similarity": "0.62764585",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkrytyl",
            "score": 1,
            "text": "Other people in the room: “don’t be so sensitive”",
            "title_similarity": "0.39800566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkryzyj",
            "score": 1,
            "text": "I like to follow up with a clarification email and copy both my own and their direct supervisor. \n\n\"Hi Joe, I've been thinking about the meeting today and especially your statement of (the entire insult, word for word). I am open to feedback and would appreciate further explanation. Do you have a specific example of (behavior demonstrating said insult)?\"\n\nMy work ethic is strong and I am the first person to call myself out on an error, so management usually has my back. If not, it's time to go.",
            "title_similarity": "0.691747",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hkrzfca",
            "score": 1,
            "text": "I've tried that in the past, the bully usually responds with \"you heard me\" and just leaves it at that. So you don't get the satisfaction of calling them out on their bs",
            "title_similarity": "0.7542288",
            "sentiment_compound": -0.6814
        },
        {
            "id": "hkrzrx5",
            "score": 1,
            "text": "Lifeprotips has become a proper shithole",
            "title_similarity": "0.46409625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hks0dn7",
            "score": 2,
            "text": "Working at a family restaurant with a real dick of a chef, can confirm asking a bully to repeat themselves and saying \"oh okay\" will cut that shit off at knees",
            "title_similarity": "0.64433694",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hks0m5d",
            "score": 1,
            "text": "\"The Jerk Store called, they're running out of you!\"",
            "title_similarity": "0.6308797",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hks11t4",
            "score": 1,
            "text": "Oh yeah, well the jerk store called, and they're running out of you!",
            "title_similarity": "0.6326129",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hks14fk",
            "score": 2,
            "text": "Didn’t work for my narcissistic ex. He had no problems repeating his verbally and emotionally abusive quips bc there were definitely times when I said excuse me what the fuck did you just say",
            "title_similarity": "0.7058506",
            "sentiment_compound": -0.5334
        },
        {
            "id": "hks1ifc",
            "score": 1,
            "text": "Just tell them that the Jerk Store called, and they're running out of you!",
            "title_similarity": "0.6935704",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hks1m77",
            "score": 2,
            "text": "Just answer with \"That's not what your wife thought, last night\"\n\n\nThen disrobe and urinate over his desk in an obvious alpha-male power move.\n\n\nMaintain eye contact at all times.",
            "title_similarity": "0.62050366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hks1urv",
            "score": 2,
            "text": "What if they tell the exact same thing again and not back off. Cause I‘ve seen many shameless people, especially in daily business life.",
            "title_similarity": "0.6274829",
            "sentiment_compound": -0.34
        },
        {
            "id": "hks206m",
            "score": 2,
            "text": "Tried to utilize this tip in the past. The colleague actually repeated exactly what they said. It was quite comical",
            "title_similarity": "0.4477653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hks32l4",
            "score": 1,
            "text": "This is so gray because it all depends on how emotionally sensitive someone is. There are MORE than a lot of people who'll take valid criticism as an attack - if you ask them to repeat themselves, they'll still look reasonable and you'll just make yourself look dumber.",
            "title_similarity": "0.6803458",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hks36s4",
            "score": 1,
            "text": "Unless it's the person paying your salary. In that case, you're going to be insulted twice.",
            "title_similarity": "0.52307737",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hks447w",
            "score": 1,
            "text": "Or they’ll give a different version of what they said to conceal their bs?",
            "title_similarity": "0.5834759",
            "sentiment_compound": 0.0
        },
        {
            "id": "hks47vg",
            "score": 1,
            "text": "Oh yeah? Well the jerk store called and they’re running out of you!",
            "title_similarity": "0.63917756",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hks5n73",
            "score": 1,
            "text": "LPT: Do not do this if you teach 7th grade",
            "title_similarity": "0.5275838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hks5vy6",
            "score": 1,
            "text": "Or they'll say nothing, refusing to respond. Then what?",
            "title_similarity": "0.42068702",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hks61ap",
            "score": 1,
            "text": "The thing about the workplace is that colleagues aren't your friends, unless you have clearly established a friendship and verbally confirmed it.  \n \nThat nice attitude they are showing to you is because it's part of their work contract to cooperate and integrate in the office environment at this company. Unless you work in some weird place, it does normally say in the contract that you conduct yourself in a helpful and approachable manner. It's easy to confuse that with being your friend, but if you get a sense that someone doesn't like you for any reason, you should be discussing that with them and with HR.",
            "title_similarity": "0.77684903",
            "sentiment_compound": 0.528
        },
        {
            "id": "hks7i6i",
            "score": 1,
            "text": "Shoot one monkey and they all know about it.",
            "title_similarity": "0.3017924",
            "sentiment_compound": -0.34
        },
        {
            "id": "hks877n",
            "score": 1,
            "text": "What I would pay to hear what prompted this LPT...",
            "title_similarity": "0.24425198",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hks87yp",
            "score": 1,
            "text": "Who the hell gets insulted in group meetings?",
            "title_similarity": "0.60305244",
            "sentiment_compound": -0.836
        },
        {
            "id": "hks8jxe",
            "score": 1,
            "text": "So, uh, what happens if they do confirm their unprofessional behavior?   Saying \"the latter can not be accepted\" doesn't mean that the people at the meeting will do anything about it.  \n\nRequiring them to repeat it gives you a chance to decide what to do next.  It could be anything from \"Ok.  I think we're done here\" to just ignoring him or calling him on it.  If the person is in authority, the response would probably be different than if it were a peer.",
            "title_similarity": "0.84220505",
            "sentiment_compound": -0.672
        },
        {
            "id": "hks9m5w",
            "score": 1,
            "text": "I always say: -You heard me. Then they are the ones looking bad. I'll never apologize.",
            "title_similarity": "0.64051867",
            "sentiment_compound": -0.5853
        },
        {
            "id": "hks9tbs",
            "score": 1,
            "text": "I feel like anytime I have tried this technique, they respond with, \"oh nothing *snicker snicker, audience snickers too because they think I didn't hear*\"\n\nEdit: I am a female working with predominantly female coworkers",
            "title_similarity": "0.65624046",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hksa1t3",
            "score": 1,
            "text": "This applies not just to insults, but also to passive aggressive jabs, sarcastic side comments or any \"non professional\" thing that is said during meetings.\n\nWell, unless you're working with a bunch of entitled, participation award, gender diversity hires.",
            "title_similarity": "0.6668218",
            "sentiment_compound": 0.8596
        },
        {
            "id": "hksa8st",
            "score": 1,
            "text": "No way this doesn’t come across as aggressive, no one will believe the one thing you didn’t hear was an insult directed at you.\n \nThis is bad advice imo.",
            "title_similarity": "0.71393585",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hksag2y",
            "score": 1,
            "text": "Guys, fuck sake. LPT is a karma farm sub at this point. Always click the profile and check their history. This account is 15 days old, this is clearly a person trying to boost this account's karma for whatever reason.",
            "title_similarity": "0.35474372",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hksakfu",
            "score": 1,
            "text": "Just saying, this got me fired. So be careful. The job was indeed toxic af before you ask",
            "title_similarity": "0.7167351",
            "sentiment_compound": -0.4062
        },
        {
            "id": "hksav7h",
            "score": 1,
            "text": "Real LPT: \nTake out a chewing gum and offer it to them.\nTake out air freshener and spray it.\nDo either one whilst pretending their breath stinks.",
            "title_similarity": "0.45173484",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hksaxfv",
            "score": 1,
            "text": "You're better off ignoring it completely and move on.",
            "title_similarity": "0.54652417",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hksdb1l",
            "score": 1,
            "text": "This also gives you time to think of a comeback",
            "title_similarity": "0.28621587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksdg1p",
            "score": 1,
            "text": "Short story of a time I got the best of an asshole boss.\n\nLong story short he was a sexist, racist, narcissistic dick. One day we were in a conference room meeting with a total of about 10 people, his boss included, who was a woman, was present.\n\nSome context: we worked in a warehouse and as such everyone wore reflective vests. Well he got the idea in his head that since his vest was the only one that was blue, it meant that blue = for managers only. I happened to be wearing a black vest at the time.\n\nAny who, he made a smartass comment about \"yeah, we make all the coffee runners wear black vests\" I happened to notice that his boss, a woman whom I was very close with, was also wearing a black vest. (He was unaware of this at the time.) I then said aloud \"Wow, I can't believe you just said that about [Boss' name]. She turned and said huh? What did he say? And he QUICKLY shut his ass up. \n\nHe was fired a month later for other reasons.",
            "title_similarity": "0.5857951",
            "sentiment_compound": -0.8105
        },
        {
            "id": "hksdu52",
            "score": 1,
            "text": "I mean, or they would just say \"I didn't say anything.\"",
            "title_similarity": "0.39713696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkse5o4",
            "score": 1,
            "text": "\"You wanna hear the most annoying sound?\"",
            "title_similarity": "0.4090306",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hkseb3d",
            "score": 1,
            "text": "I have had the issue of aggressive language at work (unreasonable, towards me) happen twice in the last 2 weeks. Already confirmed with colleague it was outta line. Thanks for this well timed tip!!",
            "title_similarity": "0.60613",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hksebzl",
            "score": 1,
            "text": "Another reason almost nothing of value is said in corporate meetings",
            "title_similarity": "0.5937077",
            "sentiment_compound": -0.1956
        },
        {
            "id": "hkseik7",
            "score": 1,
            "text": "DING DING DING\n\nThis is A+ material right here",
            "title_similarity": "-0.032162607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksemgk",
            "score": 1,
            "text": "Unless they repeat it again. Then you’re kinda screwed. Cuz I mean shit if they said it in a meeting it’s probably true.",
            "title_similarity": "0.6176938",
            "sentiment_compound": -0.5729
        },
        {
            "id": "hksevlv",
            "score": 1,
            "text": "Can’t see this working in a work setting but maybe with people outside of work? I can see this working on people that make backhanded or offensive comments disguised jokes.",
            "title_similarity": "0.62574077",
            "sentiment_compound": -0.631
        },
        {
            "id": "hksffuu",
            "score": 1,
            "text": "Unless it comes from me, I’m which I’ll loudly add a “could you fucking hear me now?” Afterwards",
            "title_similarity": "0.3990249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksgnzw",
            "score": 1,
            "text": "Actually, a different take on this is to ask them to EXPLAIN what they meant by their statement, because you don't understand.  If you just ask them to repeat it, they will just repeat what they said, thinking their original thought that it was funny, or whatever caused them to say what they said to begin with.  \n\nWhen you ask them to explain it, they have to explain why they said what they said, and in doing so, show what their intent was. \n\nThe same goes for whenever somebody tells a racists or inconsiderate joke.  \"I don't get it....\" and ask them to explain it.  Their explanation will show that they know it's racist or inconsiderate and that those things are funny to them.",
            "title_similarity": "0.70373553",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hksh2nz",
            "score": 1,
            "text": "My boss didn’t insult my intelligence, but EVERY time I spoke he would interrupt and over talk me. I’m female & am 31… Everyone of my colleagues would notice, he’d also do it in front of clients until a client called him out on it & asked me to finish what I was saying. \nAfter that, I’d interrupt him and say, “Sir, it’s my turn to talk. You’re more than welcome to add in once I’m finished speaking.” He was shocked & called out. It actually worked…",
            "title_similarity": "0.7206112",
            "sentiment_compound": -0.5903
        },
        {
            "id": "hkshgus",
            "score": 1,
            "text": "This loses to the three bet unfortunately if the person is socially stronger. I know that it seems perfect as a reply since it is not widely adopted but everything is situational. Also if they were very clear (approximate decibel and enunciation) this sounds less impressive than when written. \n\nEdit: so everyone understands my drift I am a mild person professionally. Always less aggressive than the median.",
            "title_similarity": "0.5422046",
            "sentiment_compound": 0.8477
        },
        {
            "id": "hkshv5t",
            "score": 1,
            "text": "“I slept with you’re wife”  “his wife’s in a comma”  ~ George Castanza",
            "title_similarity": "0.39862508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksi7tv",
            "score": 1,
            "text": "They won't apologize, they will likely say 'nevermind' or some other sly way of not repeating it while being a smart ass",
            "title_similarity": "0.6700247",
            "sentiment_compound": -0.2723
        },
        {
            "id": "hksjhsa",
            "score": 1,
            "text": "This all works well when someone is being rude, defamatory, aggressive, non-inclusive with others. Boss says something sexist to a woman? “Sorry, didn’t catch that - would you repeat yourself?” (…now that everyone is listening)",
            "title_similarity": "0.71250534",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hksjndi",
            "score": 1,
            "text": "This works for super offensive jokes too, have someone explain why the joke is funny and play dumb like you really don’t understand.",
            "title_similarity": "0.588669",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hksk39t",
            "score": 1,
            "text": "I’d suggest rather replying “That’s not an appropriate way to talk to me. If you can’t speak to me professionally don’t speak to me again.”  Bullies need to get called out, not this passive-aggressive way you are detailing above. That’s my two cents, from a psychologist, former supervisor, and current team leader.",
            "title_similarity": "0.84062576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksks1c",
            "score": 1,
            "text": "Yes! I do this when people make sexist or racist comments in passing. \n\nI pretend I don't understand the concept of their casual racism\n\nI'm like 'The cops said a black guy stole your car? Wow they caught him already. And they told you his ethnicity, that is so weird. You would think they couldn't release that info before they actually charged anyone. Damn, was he young, old?\"",
            "title_similarity": "0.6818954",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hksksbk",
            "score": 1,
            "text": "If you need a flowchart on how to handle an insult, you're going to look like a douche no matter how it is you respond.",
            "title_similarity": "0.69194925",
            "sentiment_compound": -0.5226
        },
        {
            "id": "hksl3nj",
            "score": 1,
            "text": "Or they'll just say 'nothing' and smirk. \n\nThere are a lot more than two options here, lol",
            "title_similarity": "0.4162444",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hksm2go",
            "score": 1,
            "text": "Them: \"Your sense of hearing is poor.\"\n\nYou: \"I didn't hear you.\"",
            "title_similarity": "0.40530592",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hksnmf8",
            "score": 1,
            "text": "BIG. MEATY. CLAWS!",
            "title_similarity": "0.044430144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksom5n",
            "score": 1,
            "text": "What if they say ‘doesn’t matter’",
            "title_similarity": "0.21819991",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksp0m6",
            "score": 1,
            "text": "This has been posted so many times.",
            "title_similarity": "-0.012776202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkspt33",
            "score": 1,
            "text": "Karma farming bot",
            "title_similarity": "0.18449134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksq11u",
            "score": 1,
            "text": "The more likely response is to deny saying anything at all.",
            "title_similarity": "0.53861964",
            "sentiment_compound": -0.34
        },
        {
            "id": "hkssj84",
            "score": 1,
            "text": "Or they will explain what you misheard and therefore over-reacted to.",
            "title_similarity": "0.5708667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkssqeb",
            "score": 1,
            "text": "Someone’s clearly never been hit with “you hear me the first time”.",
            "title_similarity": "0.28792596",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hkst6we",
            "score": 2,
            "text": "I just tell them, \"oh yeah, well I had sex with your wife.\"\n\nIt's really effective when a coworker insults me about all of the shrimp I'm eating during the meeting.",
            "title_similarity": "0.5587499",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hksvb9d",
            "score": 1,
            "text": "That was smooth by the way",
            "title_similarity": "-0.03194672",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksvkbk",
            "score": 2,
            "text": "I tried this...\n\nDrill Sergeant punched me instead...",
            "title_similarity": "0.49408212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksw5ac",
            "score": 1,
            "text": "But some shameless pricks just repeats the insult as if they are absolutely proud of it.",
            "title_similarity": "0.5045178",
            "sentiment_compound": -0.6497
        },
        {
            "id": "hksyawq",
            "score": 1,
            "text": "\nAnyone seen that youtube video of the teacher going \" I said, whoever did that, your mom's a hoe.\"",
            "title_similarity": "0.42671627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hksye4u",
            "score": 1,
            "text": "There is nothing wrong with insulting someone during a meeting.",
            "title_similarity": "0.44018602",
            "sentiment_compound": 0.6348
        },
        {
            "id": "hkszh1q",
            "score": 1,
            "text": "Tried it in my team on my video game. Couldn’t replicate results.",
            "title_similarity": "0.4819605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkszojz",
            "score": 1,
            "text": "I've seen this already a few months ago",
            "title_similarity": "0.038896147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt03zi",
            "score": 1,
            "text": "this shitty tip shows up every few months and its not any better now\n\nyeah you heard me and ill say it again if you ask me to",
            "title_similarity": "0.542264",
            "sentiment_compound": -0.7654
        },
        {
            "id": "hkt164f",
            "score": 1,
            "text": "I said 'you heard me the first time bitch'",
            "title_similarity": "0.23709476",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hkt1gp9",
            "score": 1,
            "text": "Can this apply to conversations with people outside of work too?",
            "title_similarity": "0.3267945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt1v07",
            "score": 1,
            "text": "Hey OP, the ocean called…",
            "title_similarity": "0.07352544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt2six",
            "score": 1,
            "text": "This works when people are sneaking insults and don’t want anyone else to hear,  like when a coworker mumbled “stupid” under her breath when I said I forgot something.  I loudly said “what did you say?”  She sheepishly walked away and didn’t show her ass again.",
            "title_similarity": "0.7908381",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hkt3bkf",
            "score": 1,
            "text": "Or they'll lie and say they said something different. Most likely the same thing, but worded less harshly.",
            "title_similarity": "0.5620831",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt3uo5",
            "score": 1,
            "text": "This does not work as intended on construction sites.",
            "title_similarity": "0.3839171",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt4m9w",
            "score": 1,
            "text": "I said [“the ocean called, they’re running out if shrimp!”.](https://m.youtube.com/watch?v=ZXyfs4zB9_w)",
            "title_similarity": "0.5090009",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt50ku",
            "score": 1,
            "text": "What’s worse is when it’s not a direct insult and it’s not even directed at you, but they say something that implies you would have to be incompetent if it’s true, and casts doubt about you and maybe even your entire team.   \n\nThey may not even realize that’s the implication, so you don’t really have cause to confront them.",
            "title_similarity": "0.7843008",
            "sentiment_compound": -0.7139
        },
        {
            "id": "hkt72dq",
            "score": 1,
            "text": "This doesn't work in the oilfield",
            "title_similarity": "0.40879476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkt9y66",
            "score": 1,
            "text": "Or they'll just try passing it off by saying \"Oh, nothing. Don't worry about it\". \n\nGood advice still.",
            "title_similarity": "0.46584398",
            "sentiment_compound": 0.2167
        },
        {
            "id": "hkta399",
            "score": 1,
            "text": "Old tip… been posted here before",
            "title_similarity": "0.09142518",
            "sentiment_compound": 0.0
        },
        {
            "id": "hktai3i",
            "score": 2,
            "text": "I recommend the book “Dealing with difficult people”. The person described here is a “sniper” who feels comfortable making snide remarks under cover. When you flush them out, the dynamic changes.",
            "title_similarity": "0.59974307",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hktc8wh",
            "score": 1,
            "text": "I mean, they could just ignore you ...",
            "title_similarity": "0.495354",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hkte2lp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.23570459"
        },
        {
            "id": "hktep0z",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.23570459"
        },
        {
            "id": "hkteuc3",
            "score": 1,
            "text": "Not even meetings; any social setting. I'll give you the chance to walk it back, but don't talk spicy and not expect some water.",
            "title_similarity": "0.5842786",
            "sentiment_compound": 0.128
        },
        {
            "id": "hkthljl",
            "score": 1,
            "text": "I wish this worked. I’ve asked offenders to repeat themselves. They just stay silent and there’s an long awkward silence.",
            "title_similarity": "0.58912516",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hkti2vm",
            "score": 1,
            "text": "\"Did I stutter?\" Lol",
            "title_similarity": "0.21386245",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hktj6mx",
            "score": 1,
            "text": "*Cries in at-will employment*",
            "title_similarity": "0.41781467",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hktkf37",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.2603066"
        },
        {
            "id": "hktkrtr",
            "score": 1,
            "text": "Alternatively, just tell them the jerk store called and was running out of them",
            "title_similarity": "0.660295",
            "sentiment_compound": -0.34
        },
        {
            "id": "hktl2l9",
            "score": 1,
            "text": "My boss made a joke about me being the fattest guy on the team and I laughed. When everybody stopped laughing he said, “ I can’t believe you thought that was funny!”\n\nI said, “It’s impossible to offend me, but I bet our HR rep doesn’t even get the joke!”",
            "title_similarity": "0.6252259",
            "sentiment_compound": 0.4997
        },
        {
            "id": "hktlpvj",
            "score": 1,
            "text": "“I beg your pardon?” Is the way to do this.",
            "title_similarity": "0.2594661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hktlw0t",
            "score": 1,
            "text": "Ans then you look weak because everyone else heard it",
            "title_similarity": "0.5869938",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hktmg3h",
            "score": 1,
            "text": "Why would they apologize? They could just say “nothing”",
            "title_similarity": "0.47832873",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hktmuxy",
            "score": 1,
            "text": "I only insult someone in a meeting if I have to. Your LPT is for people with no backbone.",
            "title_similarity": "0.76113224",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hktq3ao",
            "score": 1,
            "text": "\\*gets insulted twice\\*\n\nsadface",
            "title_similarity": "0.42407566",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hktrief",
            "score": 1,
            "text": "Worst advice. Sounds like you are good at picking fights. Let that slide.",
            "title_similarity": "0.5858263",
            "sentiment_compound": -0.34
        },
        {
            "id": "hktrwae",
            "score": 2,
            "text": "I love this account learn something new everyday",
            "title_similarity": "0.1610233",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hktwn8g",
            "score": 1,
            "text": "How many times have I seen this LFT here?🤔",
            "title_similarity": "0.058153257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hktwnsv",
            "score": 1,
            "text": "15 day account with the repost. Swish",
            "title_similarity": "0.09124579",
            "sentiment_compound": 0.0
        },
        {
            "id": "hktxn6f",
            "score": 1,
            "text": "Just ignore it bro.",
            "title_similarity": "0.34440643",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hku4r5m",
            "score": 1,
            "text": "Something I could have used today 🙄",
            "title_similarity": "0.15447187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hku7a9l",
            "score": 2,
            "text": "I usually just ask them why that's relevant to X and then add that it kinda stings that they'd say that because I think pretty highly of W attribute they contribute to the team. It looks the momentum of the attack by getting realistically specific into the point, creates a shield of victim taking the hit with humility, and brings their ego up high enough to let the situation end with a compliment. Friends are allies and allies build teams.",
            "title_similarity": "0.61618876",
            "sentiment_compound": 0.743
        },
        {
            "id": "hku8j0t",
            "score": 1,
            "text": "This is the LPT I’d expect, if wish did Corporate LPTs.\n\nRepeating myself for the record: \n\nThis is the LPT I’d expect, if wish did Corporate LPTs",
            "title_similarity": "0.45235354",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hkud369",
            "score": 1,
            "text": "\"Well the jerk store called, they're running out of you!\"",
            "title_similarity": "0.6295438",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hkudbnf",
            "score": 1,
            "text": "The insulted has to be smarter than the insulter though. Or else this may backfire spectacularly",
            "title_similarity": "0.518668",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkudr3j",
            "score": 1,
            "text": "This works, though also exposes those who expect you to be removed from the group in the future.\n\nThis can go go both ways.\n\nBack yourself, and do it anyway.",
            "title_similarity": "0.6621336",
            "sentiment_compound": -0.128
        },
        {
            "id": "hkuexw8",
            "score": 1,
            "text": "This is a great tip, especially if you can pull it off whilst remaining calmly in control.\n\nHowever, the OP confuses aggressive language with insulting language, whilst often used in combination, are two completely different things.",
            "title_similarity": "0.58591163",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hkujfi2",
            "score": 1,
            "text": "Clearly you guys don’t work on a sales team… \n\n\nIt’s all in good fun though",
            "title_similarity": "0.6319753",
            "sentiment_compound": 0.836
        },
        {
            "id": "hkul27r",
            "score": 1,
            "text": "Had a boss who decided to make a passive aggressive comment/joke to a manager he did not like during a team's meeting, no one laughed, no one gave him a reaction, and the old asshole decided to say it louder so the team would react.   So word of caution, some people might not care about being perceived as unprofessional if they're the ones in charge. But by then you should gtfo.",
            "title_similarity": "0.8616785",
            "sentiment_compound": -0.7476
        },
        {
            "id": "hkul2gi",
            "score": 1,
            "text": "Yes! I learned this in service as well, but my approach was to repeat it back to the person verbatim but in a very calm tone. One of two things happens, they either double down or apologize. It's a risk but people who behave that way are unpredictable as is.",
            "title_similarity": "0.67281187",
            "sentiment_compound": 0.6164
        },
        {
            "id": "hkulw1q",
            "score": 1,
            "text": "Psychological safety is also Paramount in personal relationships. Look up, Attachment Styles. Have fun.",
            "title_similarity": "0.34324554",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hkun2qs",
            "score": 1,
            "text": "try that in a factory.",
            "title_similarity": "0.23066393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkupwdo",
            "score": 1,
            "text": "Would you care to put that in writing",
            "title_similarity": "0.18179166",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hkv5d1f",
            "score": 1,
            "text": "How often does this one show up here?",
            "title_similarity": "0.000377547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkvwrub",
            "score": 2,
            "text": "I did this multiple times yesterday during a meeting with my bosses. I learned that they don't value me so now I'm applying for a new job",
            "title_similarity": "0.6814376",
            "sentiment_compound": -0.2584
        },
        {
            "id": "hkw9hbs",
            "score": 1,
            "text": "Boss: \"We seem to have narrowed down the notorious lunch thief...\"\n\nMe covered in chicken wing sauce: \"Sorry, was too busy eating 'Dave's wings from Wings To Go DO NOT EAT'.\"",
            "title_similarity": "0.55084157",
            "sentiment_compound": -0.765
        },
        {
            "id": "hkwmk5a",
            "score": 2,
            "text": "This tip works for people who want to fight. In summer, some arse told me about how he'd beat me up, shoot me in the head and watch my brains bleed out.\n\nI heard what he said but pretended I hadn't and said Sorry mate, i want paying attention - what did you say?\n\nWas very enjoyable watching his face contort in anger with me maintaining deadpan.\n\nThen my girlfriend stepped in, obi wan style and told him this is not the fight you are looking for.",
            "title_similarity": "0.6903191",
            "sentiment_compound": 0.115
        },
        {
            "id": "hl4obit",
            "score": 2,
            "text": "I don’t play games. I will politely ask them why they made such a comment. I’ll ask In front of everybody since you feel so comfortable in front of an audience.",
            "title_similarity": "0.7112837",
            "sentiment_compound": 0.7678
        },
        {
            "id": "hl8dpqk",
            "score": 1,
            "text": "LPT when you're at a meeting: don't",
            "title_similarity": "0.5291382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwltmp",
            "score": 1,
            "text": "Unless your coworkers and/or boss are jerks.",
            "title_similarity": "0.6257556",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hn1jm1e",
            "score": 1,
            "text": "Absolutely solid gold advice.",
            "title_similarity": "0.04697936",
            "sentiment_compound": 0.2247
        },
        {
            "id": "hopuowk",
            "score": 1,
            "text": "If somebody is hurling insults at you during a work meeting then your workplace is already completely unprofessional and nobody gives one diddly fuck about anybody's behavior.",
            "title_similarity": "0.7303922",
            "sentiment_compound": -0.8718
        }
    ]
}