{
    "LPT: If your grandma or mom knits/crochets you something, keep it. Even if you don't wear it, trust me, one day you won't care what's cool, you'll just wish you had that scarf that your mom spent days making for you. They are irreplaceable.\n": [
        {
            "id": "hlclce6",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.57081336",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hlcsm35",
            "score": 2,
            "text": "But if your dad or grandpa knit you something, be suspicious.",
            "title_similarity": "0.5300407",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hlcuhsg",
            "score": 1,
            "text": "As someone who just threw away almost all of my childhood blankets and stuffed animals my mom kept, I doubt it.",
            "title_similarity": "0.58580434",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hlcyb5d",
            "score": 0,
            "text": "If you need to be told this you’re already an irreparable piece of shit, sorry.",
            "title_similarity": "0.2568075",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hld3pg8",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.05641327"
        },
        {
            "id": "hlcykrx",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.05641327"
        },
        {
            "id": "hlctzg0",
            "score": 0,
            "text": "Backed. I donated all the shit my aunt made me bc I was young and thought it was wack but after she died I got really sad that I just gave away her hard work translated into a gift of love",
            "title_similarity": "0.69258535",
            "sentiment_compound": 0.2756
        },
        {
            "id": "hld37a3",
            "score": 5,
            "text": "My mom knitted scarves. When she passed, I didn’t care about those scarves. Still don’t. \n\nThis isn’t a LPT.",
            "title_similarity": "0.7361003",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hlcz1gs",
            "score": 5,
            "text": "What kind of animal needs to be told this like it's news",
            "title_similarity": "0.13633415",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hld4jhn",
            "score": 6,
            "text": "tying memories and sentiment to materialistic objects is exactly how hoarding starts.. especially if there's no intent to use. not a LPT imo.",
            "title_similarity": "0.49568605",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hld0pmc",
            "score": 5,
            "text": "Probably an unpopular opinion, but not everybody has great relations with their family. I was barely on speaking terms with my parents most of my adult life. It bugs me when people are always saying \"But it's your family.\" They were shitty parents, and didn't take care of the kids well at all.",
            "title_similarity": "0.52851295",
            "sentiment_compound": -0.9029
        },
        {
            "id": "hlcych8",
            "score": 7,
            "text": "LPT: this sub is 99% straight up common sense.",
            "title_similarity": "0.21217503",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hlcuxlc",
            "score": 1,
            "text": "This is probably one of the better tips I have seen on here in awhile.",
            "title_similarity": "0.30721122",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hlcvjdh",
            "score": -1,
            "text": "I don't disagree. But damn, who would throw something like that away???",
            "title_similarity": "0.19711928",
            "sentiment_compound": 0.8057
        },
        {
            "id": "hld3145",
            "score": 1,
            "text": "I'm sorry how is this a Life Pro Tip?? Do people really be tossing out stuff handmade for them by a loved one?? 😕",
            "title_similarity": "0.6181458",
            "sentiment_compound": 0.504
        },
        {
            "id": "hld57se",
            "score": 4,
            "text": "If you have to put \"trust me\" in your title, it's not a pro-tip",
            "title_similarity": "0.38024968",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hldap8o",
            "score": 6,
            "text": "So where is the life pro tip?",
            "title_similarity": "0.20924205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcv111",
            "score": 3,
            "text": "My mom doesn't give a shit about fuck",
            "title_similarity": "0.47420296",
            "sentiment_compound": -0.1471
        },
        {
            "id": "hld4k57",
            "score": 3,
            "text": "Who even thinks like this?",
            "title_similarity": "0.045154177",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hld9nuq",
            "score": 4,
            "text": "Unless your family knits too much. Hoarding is emotionally unhealthy. Keep what sparks joy.",
            "title_similarity": "0.7220576",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hlcvvgs",
            "score": 0,
            "text": "This is so absolutely true",
            "title_similarity": "0.0023387102",
            "sentiment_compound": 0.5222
        },
        {
            "id": "hlcw80f",
            "score": 0,
            "text": "This is really really true.",
            "title_similarity": "0.02481219",
            "sentiment_compound": 0.5222
        },
        {
            "id": "hlcwbaf",
            "score": 0,
            "text": "My mother took up knitting after she retired. Knitted matching, awesome, patchwork sweaters for me and my nephew - he was about 8. I have a picture of me holding him in the sweaters.\n\nMine disappeared at some point and I'm very bummed.\n\nHe's now full grown. I wonder if he knows where his is. It would only be useful to him if he had a kid.",
            "title_similarity": "0.75296223",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hlcwqct",
            "score": 0,
            "text": "My grandma made this old blanket, a couple of them. I have one and my cousin has the other. My little family unit was really the closest to my grand patents before they passed, everyone else had moved away. Quite a few of those cousins and even siblings have come after that blanket. I would love for them to know the happiness I have with it in my possession but I'm not ready to pass it on.",
            "title_similarity": "0.74838066",
            "sentiment_compound": 0.4998
        },
        {
            "id": "hlcwu5d",
            "score": 0,
            "text": "This hit home. My mom makes these super detailed embroidery scarves and napkins. She’s been doing it since 30+ years now and I am so scared that one day that’s all i would have left from her. Storing every single piece she created. I guess she had made over 1000 such embroidered pieces",
            "title_similarity": "0.6739429",
            "sentiment_compound": 0.2866
        },
        {
            "id": "hlcy74r",
            "score": 0,
            "text": "my mum use to make little blankets for my kids teddybears, I can't find any of them and its devastating",
            "title_similarity": "0.69602895",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hlcyiev",
            "score": 0,
            "text": "I was out of college before I slept under a store bought blanket on my own bed.  My grandmother was a master quilter and made me one every few years and my mom made afghans.   Time hasn't been kind to all of them,  puppy claws can be rough.",
            "title_similarity": "0.7175609",
            "sentiment_compound": -0.4168
        },
        {
            "id": "hlcykax",
            "score": 0,
            "text": "When my mother was learning to knit she made a bunch of little squares with different patterns and whatnot (all solid colors). She thought I'd use them up as rags. I use them as coasters, She was shocked as shit a few days ago when she saw one on my desk.",
            "title_similarity": "0.7633939",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hlcym8e",
            "score": 0,
            "text": "Still have the quilt my mom made me as a kid.  Its tattered to all hell now but it's not going anywhere.  Love that quilt.",
            "title_similarity": "0.82181215",
            "sentiment_compound": -0.8101
        },
        {
            "id": "hlcz1rl",
            "score": 0,
            "text": "And if someone burns it, you full auto them with an Airsoft gun",
            "title_similarity": "0.20212325",
            "sentiment_compound": -0.34
        },
        {
            "id": "hlcz2os",
            "score": 0,
            "text": "Vincenzo Cassano",
            "title_similarity": "-0.0028884038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcz392",
            "score": 0,
            "text": "Reminds me of something my grandma made me and I don't know where it is!",
            "title_similarity": "0.6339172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcz9vv",
            "score": 0,
            "text": "My mom n dad passed away last year and I have saved everything she ever made, blankets, clothes, tables, even this crochet poncho that is totally not rain resistant. Idk I just miss and love her so much. My 6mo boy is wearing gloves she made a couple years back and she died before he was born. It’s like she knew…",
            "title_similarity": "0.8006134",
            "sentiment_compound": 0.6804
        },
        {
            "id": "hlczcgb",
            "score": 0,
            "text": "I have a bunch of knitted rags. Sure some of them are stored and two held up my strainer but she still helps me clean the kitchen. I can still hear her fuss about washing out my cast iron when I do something extravagant in it. Yes I immediately oil it but I still hear her complaints.",
            "title_similarity": "0.613705",
            "sentiment_compound": 0.802
        },
        {
            "id": "hlczdu4",
            "score": 0,
            "text": "When my ex and I were still together, she crocheted a blanket that fit our queen size bed. Thing weighs about 40 pounds! Warm in the winter, though. After we separated, she gave it to me because my futon was bigger than the single bed she chose. She passed on a few years ago, but I still have that blanket. Just washed it so it'd be ready for the winter.",
            "title_similarity": "0.72047365",
            "sentiment_compound": 0.7301
        },
        {
            "id": "hlczecm",
            "score": 0,
            "text": "Also they’re way more durable and warm",
            "title_similarity": "0.15370128",
            "sentiment_compound": 0.2878
        },
        {
            "id": "hlczlzq",
            "score": 0,
            "text": "My grandma knitted me an oversized checkboard with obnoxiously large pieces. Haven't played checkers in forever. It's bagged up. But it smells like her home. So I seldomly open it\n\nAlso an Afghan and a teddy bear",
            "title_similarity": "0.7390897",
            "sentiment_compound": 0.1486
        },
        {
            "id": "hlczmqf",
            "score": 0,
            "text": "Agreed, my now wife knitted me a scarf taller than I am. I think about it every time I see it in the closet and the effort she put into it. We are still together 10 years, 2 kids later. I have no intention of every getting rid of it, even though we live in a warm climate",
            "title_similarity": "0.8015014",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hlczv8m",
            "score": 0,
            "text": "I still have the baby blanket my mom crocheted for me. She dropped the hobby for a long time while she was busy raising us, but she's recently picked it back up. I started it myself a few years back, and now she texts me asking for crocheting tips. Makes me feel like a dang Pixar short.",
            "title_similarity": "0.7970053",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hld02xq",
            "score": 0,
            "text": "I have a blanket my grandma made before she died. As far as blankets go, it doesn't work (hairpin laslce crochet that means a lot of holes in it) but I love cuddling up with it and imagining her still being around. Truly irreplaceable.",
            "title_similarity": "0.8293903",
            "sentiment_compound": 0.8537
        },
        {
            "id": "hld07x5",
            "score": 0,
            "text": "My grandmother paints and she offered to paint me anything I want. I can't even bring myself to ask for anything because it feels greedy and entitled. Like whatever she paints would be too precious of a gift to waste on me.",
            "title_similarity": "0.73491275",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hld0aho",
            "score": 0,
            "text": "Everyone dies eventually and more often than not, it's sooner than you'd hope or imagine. This is fantastic advice for everyone and I hope those of you not yet convinced find something in this thread as a change of heart. \n\nYour grandparents will die, your aunts, uncles, mother, and father will die. Your friends will die. Cherish your time with them and please keep what you can from them.",
            "title_similarity": "0.59608763",
            "sentiment_compound": 0.7678
        },
        {
            "id": "hld0k13",
            "score": 0,
            "text": "The coolest thing you can ever wear is something that has a story.",
            "title_similarity": "0.33029166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld0mb3",
            "score": 0,
            "text": "I asked (semi-forced) my grandma to make a blanket for my baby. I don't have any left from when I was baby that she made me-my mom got rid of them. I wanted my daughter to have one and get to keep it. My husband's grandma also made her one and I'll see to it she keeps that one as well.",
            "title_similarity": "0.8200027",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hld0rsh",
            "score": 0,
            "text": "God this is so true. My Nan used to knit us all little booties. Every Christmas. I would kill for a pair of them again.",
            "title_similarity": "0.77255416",
            "sentiment_compound": 0.0042
        },
        {
            "id": "hld0yfk",
            "score": 0,
            "text": "I have a white embroidered blouse my grandmother hand embroidered in the 60s for my mom. I never liked it when I was younger because it wasn't \"cool.\" Now I wear it out even though its 50+ years old and is stained. I couldn't care less. My embroidered vintage stained blouse is worth more than anyone's Forever 21 peasant blouse.",
            "title_similarity": "0.75452834",
            "sentiment_compound": -0.2076
        },
        {
            "id": "hld13e6",
            "score": 0,
            "text": "100% Truth! I have a scarf made by my great grandmother, and I cherish it so much since she isn't around anymore.",
            "title_similarity": "0.814304",
            "sentiment_compound": 0.8516
        },
        {
            "id": "hld14ig",
            "score": 0,
            "text": "I’ve got an afghan that my mom knitted for me and you couldn’t give me enough money to part with it. OP is right.",
            "title_similarity": "0.8409828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld1jb2",
            "score": 0,
            "text": "Totally agree. I don't know what happened to a jumper my aunt knitted that had the image of my favourite toy on it. I'm gutted. It wouldn't mean anything to anyone else.",
            "title_similarity": "0.8322878",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hld1lny",
            "score": 0,
            "text": "Wtf who would throw that away anyway",
            "title_similarity": "0.19459088",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hld1usp",
            "score": 0,
            "text": "I spent way too many years helping a friend through mental issues, serious physical ailments, and drug addiction. At one point his mother made me a beautiful afghan as a thank you. Eventually he made a decision to stop trying to find work. He was on disability and got money from his Mom, and as long as I let him live at my place he could get by by leeching off his wife.\n\nWhen it became obvious that he would never get his shit together I took matters into my own hands. I called in a favor and got him an job interview. I wrote his resume myself and sent it on his behalf. When a $75,000 job was dangled in front of him he couldn’t say no. He got it and moved out, promising to send me what he owed me. That got him out of my hair. Word is that he blew the job in a few months, but then he wasn’t my problem any more. \n\nI still have the Afghan. It’s lovely and warm and reminds me of the good times. It also reminds me not to be a schmuck.",
            "title_similarity": "0.73472965",
            "sentiment_compound": 0.9494
        },
        {
            "id": "hld1y1x",
            "score": 0,
            "text": "Not gonna lie I wish I had the blanket my mom crocheted me. Through no fault of my own over the years it became damaged then lost in a move. Would give anything to have it back. I still have the puffalump from when I was a baby. It's a nice memory & brings comfort.",
            "title_similarity": "0.83760476",
            "sentiment_compound": 0.6197
        },
        {
            "id": "hld22nt",
            "score": 0,
            "text": "Okay but what do I do if my aunt is the one who makes it?",
            "title_similarity": "0.5253668",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hld25ao",
            "score": 0,
            "text": "Days? More like months.",
            "title_similarity": "0.066987805",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hld25zv",
            "score": 0,
            "text": "Is that when you steer left and right lmao",
            "title_similarity": "0.06870563",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hld28bx",
            "score": 0,
            "text": "Yeah I remember when I was like 10 years old and my fathers grandfather (I guess my great grandfather) had died and he had a whole collection of flat caps, scarves and gloves...like really good quality stuff. I got asked if I wanted any, but declined since they were so uncool. Now that I am old and uncool myself I really regret not taking every single one of those items.",
            "title_similarity": "0.6551417",
            "sentiment_compound": -0.1136
        },
        {
            "id": "hld2dgl",
            "score": 0,
            "text": "My grandma knits, but I don’t want anything from her. Ever. \n\nCarol sucks.",
            "title_similarity": "0.7046627",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hld2dnt",
            "score": 0,
            "text": "My mother used to crochet. She showed me something she just finished and the detail was exquisite. Then she started to unravel it. I said “What are you doing?”. She said the material cost was too high so she would unravel it to make something else. I said stop. Here is money to buy more material, if you need more tell me. The things she crocheted are hanging on the walls at home now. So yes this is a great LPT.",
            "title_similarity": "0.78572327",
            "sentiment_compound": 0.75
        },
        {
            "id": "hld2ipt",
            "score": 0,
            "text": "Record your loved one saying “I love you too.”",
            "title_similarity": "0.46832374",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hld2ona",
            "score": 0,
            "text": "As someone who crochets shit all the time for family and friends this makes me happy.",
            "title_similarity": "0.61545223",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hld51nb",
            "score": 0,
            "text": "My mother-in-law knitted me this beautiful scarf but it's a bit short. But I still wear it every winter as no one has ever made me anything before and I know she spent months doing it.",
            "title_similarity": "0.7831239",
            "sentiment_compound": 0.0032
        },
        {
            "id": "hld5l9c",
            "score": 0,
            "text": "More specifically, take care of them and be safe when cleaning them",
            "title_similarity": "0.2851942",
            "sentiment_compound": 0.7479
        },
        {
            "id": "hld5r1g",
            "score": 0,
            "text": "I’m sure most people 20+ will appreciate this. I just hope younger people will see this and consider",
            "title_similarity": "0.3530644",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hld5uf0",
            "score": 0,
            "text": "This is one of the best tips I’ve ever seen.",
            "title_similarity": "0.23005852",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hld5yyg",
            "score": 0,
            "text": "what if it is a scarf covered in swasticas and derogatory slurs",
            "title_similarity": "0.23709142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld7nej",
            "score": 0,
            "text": "This should be LBT: Life Basic Tips.  Who would discard an item like this?",
            "title_similarity": "0.45510274",
            "sentiment_compound": 0.128
        },
        {
            "id": "hld8zon",
            "score": 0,
            "text": "What monster wouldn't keep it?",
            "title_similarity": "0.2229624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldaonc",
            "score": 0,
            "text": "It's bizarre how much of life your realize is distracting bullshit when you lose one of these monumental figures in your life. Might not be grandparents. If you're very lucky you will feel this pain because it meant you felt the love on the other side of it.  Don't take those people for granted. I promise your all the shit you think is important is meaningless compared to time with those that share love with you",
            "title_similarity": "0.6139281",
            "sentiment_compound": 0.72
        },
        {
            "id": "hldecv1",
            "score": 0,
            "text": "People throw away stuff that their parents and grandparents make for them?",
            "title_similarity": "0.5369686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldf54b",
            "score": 0,
            "text": "True. Respect and listen to your elders in your life. They definitely aren’t as crazy or foolish as you think when you were young. Well maybe a little.",
            "title_similarity": "0.56442654",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hldstth",
            "score": 0,
            "text": "Holy shit. This made it to the very top of /all?\n\nPeople needed to be told \"hey man. Quick tip. Don't throw away sentimental things\"",
            "title_similarity": "0.44889212",
            "sentiment_compound": -0.5376
        },
        {
            "id": "hlezraw",
            "score": 0,
            "text": "Free cum rags from GG!",
            "title_similarity": "0.30805275",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hopu6yk",
            "score": 0,
            "text": "Wow no fucking way I was just going to use it to wipe my ass thank you so fucking much for this rare advice that nobody could think of on their own.",
            "title_similarity": "0.577356",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hld2r5g",
            "score": 6,
            "text": "I might be alone in this but I'm not really attached to things like that. I was left a bunch of stuff when my grandparents died but I mostly sold it all. I have maybe 2 or 3 things left just because I use them. I remember them with my mind, I don't really need a special memento of them. Same goes for childhood toys and keepsakes. I just got rid of them all because they weren't important to me.",
            "title_similarity": "0.6813716",
            "sentiment_compound": -0.0239
        },
        {
            "id": "hlcsp6q",
            "score": 1,
            "text": "Some of my most prized possessions are my hot pads my grandma crocheted for me. I can make new ones if need be but it would break my heart to lose the ones she made.",
            "title_similarity": "0.8052602",
            "sentiment_compound": 0.6805
        },
        {
            "id": "hlcspw4",
            "score": -1,
            "text": "I was just thinking about this last night. My mom made me a cover up for the beach when I was about 13 that I’ve never worn. I’ll never get rid of it.",
            "title_similarity": "0.6600206",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hlctrgw",
            "score": 1,
            "text": "Grew up in the Northeast and my grandmother crocheted so many blankets and scarves! I now live in Miami so I no longer use them, but I will always treasure them as a beautiful reminder of her.",
            "title_similarity": "0.80342144",
            "sentiment_compound": 0.8273
        },
        {
            "id": "hlcv4k0",
            "score": -1,
            "text": "Any time your grandma or family member wants to do something, even if you don’t want to, do it. It will make their world and one day you’ll look back and be grateful.",
            "title_similarity": "0.66851056",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hlcvli2",
            "score": -1,
            "text": "We still have great grandma T's toilet paper doilies.  \n\nI don't care if it fits with the decor.\n\n [Edit: lawl someone's mad that we have knitted doilies for our TP rolls]",
            "title_similarity": "0.8179834",
            "sentiment_compound": 0.171
        },
        {
            "id": "hlcvnxw",
            "score": 1,
            "text": "Absolutely! When my mom passed away I got the afghan we we all used when we were on the couch, sick.  We think it was the first afghan she crocheted. It's ratty and has all kinds of worn/frayed yarn, but I'm never tossing that thing out. Hopefully my kids argue about who gets it when I'm gone. She made afghans for all of her kids and grandkids as well. Definitely a labor of much love.",
            "title_similarity": "0.8166821",
            "sentiment_compound": 0.9117
        },
        {
            "id": "hld070b",
            "score": 1,
            "text": "A man walks down the street wearing a hat like hat....",
            "title_similarity": "-0.00043144356",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hld0y7w",
            "score": 1,
            "text": "[Jayne Cobb](https://en.wikipedia.org/wiki/List_of_Firefly_(TV_series)_characters?wprov=sfti1) wore a knit hat his mother sent him. He wore it with pride and not a hint of self-consciousness. His Mom made him a hat so he was gonna wear it. Jayne wasn’t necessarily a good guy, but he was a good son.",
            "title_similarity": "0.7803042",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hld297e",
            "score": 1,
            "text": "Yes! I agree. My mom passed away recently and I found a pair of knitted socks she made in my sock drawer. I never wore them and I never will, but it's nice to see them every time a grab a pair of socks.",
            "title_similarity": "0.8109191",
            "sentiment_compound": 0.7644
        },
        {
            "id": "hld3epa",
            "score": 1,
            "text": " Ugh. Clearly your grandmother/mother l wasn’t a toxic presence in your life. LPT: toss it. It’s fine, she wasn’t a net positive in your life.",
            "title_similarity": "0.69037575",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hld4jvw",
            "score": 1,
            "text": "Who the fuck is out here throwing away shit their mom made them wtf",
            "title_similarity": "0.54563344",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hld5355",
            "score": 1,
            "text": "My mom crochets a scarf... it said... \"i wish he pulled out\"\n\nShould i keep it?",
            "title_similarity": "0.7957587",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hld5azy",
            "score": -1,
            "text": "You gotta be an asshole to throw out anything someone made for you, especially from your momma or grandma",
            "title_similarity": "0.535769",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld6cj2",
            "score": 1,
            "text": "It's so weird people automatically assume everybody loves their mom, as if they don't know how love actually works.",
            "title_similarity": "0.6488708",
            "sentiment_compound": -0.1682
        },
        {
            "id": "hldh50d",
            "score": -1,
            "text": "Is...is anyone throwing them away..? Wasn’t aware of this apparent issue because literally no one does that",
            "title_similarity": "0.3242977",
            "sentiment_compound": -0.296
        },
        {
            "id": "hldj0hz",
            "score": -1,
            "text": "If you're the type of person to throw stuff like that away you might just be a shit person.",
            "title_similarity": "0.25914305",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hldkaye",
            "score": -1,
            "text": "Who the fuck is throwing away a scarf that nana made them?",
            "title_similarity": "0.57266307",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hldkbgd",
            "score": 1,
            "text": "Do not get overly attached to material things. The gesture alone is what must really count. That will be with you forever.",
            "title_similarity": "0.5144946",
            "sentiment_compound": -0.25
        },
        {
            "id": "hldkbh3",
            "score": -1,
            "text": "Jesus who has to be reminded of this, the world’s biggest assholes?\n\n“If someone makes something for you, don’t shit on it. Life pro tip.”",
            "title_similarity": "0.43775573",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hldvf9x",
            "score": -1,
            "text": "Jesus Christ what kind of a monster doesn't keep a handmade item from their mom or grandma?\n\nThey just let you post anything to this sub nowadays",
            "title_similarity": "0.6937797",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldwp7t",
            "score": -1,
            "text": "What kind of heathen would get rid of that :/",
            "title_similarity": "0.27395263",
            "sentiment_compound": -0.34
        },
        {
            "id": "hle4yfq",
            "score": -1,
            "text": "Wtf? There’s people who wouldn’t keep that stuff without a LPT telling them?",
            "title_similarity": "0.3872829",
            "sentiment_compound": -0.6322
        },
        {
            "id": "hleoi23",
            "score": 1,
            "text": "Things are not memories and you don't need to keep an item to remember the person, this is bad advice.",
            "title_similarity": "0.40774953",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlf64un",
            "score": 1,
            "text": "Wrong. I’m 50s and always been cool.  Will never Change.  F you grandma sweater and crocks wearing fools.",
            "title_similarity": "0.6301193",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hlcpmqd",
            "score": 9,
            "text": "My late maternal grandmother, passed away in the late 90s, gave me a small bible when I entered the US Submarine Service back in 1992. It went with me on every underway on those submarines. I still have it and cherish it.",
            "title_similarity": "0.5481422",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hlcsuuj",
            "score": -2,
            "text": "I want to learn this kind of blur! Teach me.",
            "title_similarity": "0.40578702",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hlctbyi",
            "score": 2,
            "text": "My mom had homemade clothes for me and gave them away when I grew older. She lost everything in a war and sentimental feelings towards objects don't really come easy to her. I could've given it to my kid or sth",
            "title_similarity": "0.7579842",
            "sentiment_compound": -0.7588
        },
        {
            "id": "hlctr57",
            "score": 2,
            "text": "I have a whole collection of scarves my mom has crocheted for me, and I love them! I always get compliments from strangers. Mom thought I was just being nice until I told her she’s never allowed to stop making me them (you know, bless she wants to stop).",
            "title_similarity": "0.8542745",
            "sentiment_compound": 0.9096
        },
        {
            "id": "hlculv8",
            "score": 2,
            "text": "My mom made me a really long yellow scarf that I only take out to wear at Christmas because I don't ever want to lose it or wear it out.",
            "title_similarity": "0.8232337",
            "sentiment_compound": -0.4445
        },
        {
            "id": "hlcuozj",
            "score": 2,
            "text": "I’m still upset that I lost a scarf my mom gave me on the bus.\n\nShe didn’t make, she bought it at goodwill. But she gave it to me and by god it was my favorite scarf :(",
            "title_similarity": "0.8007841",
            "sentiment_compound": 0.09
        },
        {
            "id": "hlcwkii",
            "score": 2,
            "text": "As someone who crochets, I put a lot of love a little bit of my soul into what I make and I hope my friends and family keep them.",
            "title_similarity": "0.6826726",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hlcyb1u",
            "score": 2,
            "text": "This is important. I still have the ear warmer my grandma knitted me..shes gone now, but everytime I wear it I feel her energy, honestly get a lot of compliments too..\n\nShe also knitted a ton of baby beanies during her last year, and gave them to her daughters to pass on to their grandkids one day. My son will  get to wear it, born 7 years after her passing.",
            "title_similarity": "0.8014432",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hlcyskc",
            "score": 2,
            "text": "My wife spends months crocheting a blanket. I treat every one of them with respect because of all the hard work she put into them. We only give them to people we know will treat them well.",
            "title_similarity": "0.74589014",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hld083g",
            "score": 2,
            "text": "my mum is very sick, possibly terminally. my brother has this lovely green scarf she made him before she got sick. i am very very envious.\n\nEdit (like 5 minutes and a cry later): Oh my god I can't believe i forgot the beanie she made me. Only briefly but still. Mum made me this gorgeous beanie that's a casual version of the classic hat link wears. It's like, immaculate. Now I'm gonna cry happy tears instead",
            "title_similarity": "0.7283406",
            "sentiment_compound": 0.8879
        },
        {
            "id": "hld0z87",
            "score": 2,
            "text": "I have a blanket from my great-grandma, a blanket from my grandma, and a blanket they made together at different times of life -- my great-grandma crocheted the squares around 15 years ago when she was still had the dexterity, and last year, after my great-grandma passed away, my grandma found them and put them together as a blanket. \n\nTruth is they're scratchy as heck lol. But both grandmas have always told me that blankets are for keeping you warm, not for sitting in a memento box, so I use them with love anyways. :)\n\nPlus, my dad has one from my great-grandma that he got before I was born and it's actually nice and soft now, so I guess in a decade or so of washing and using maybe they'll get comfier. Lol.",
            "title_similarity": "0.8049658",
            "sentiment_compound": 0.969
        },
        {
            "id": "hld1de4",
            "score": 2,
            "text": "I wish I had a good grandma. She was a rich asshole who lost her money in Chicago and spent her dying days in a townhouse in Winnetka, IL. She still had some money, though. But when I was a kid, I got injured riding my bike down a hill and was profusely bleeding from my face. So obviously she didn’t want blood in her place, so she had me sit outside on a curb, bleeding, until my dad came and picked me up. All because she didn’t want blood on her carpet. Thanks Nana!",
            "title_similarity": "0.6487776",
            "sentiment_compound": 0.7133
        },
        {
            "id": "hld3mfd",
            "score": 2,
            "text": "My bitch whore of a grandma makes scarfs for my cousins but not side of my family. Not because she can't or she's old and decrepit but just because she's a piece of shit and knows we want the scarfs and takes satisfaction in not giving them. Not all old people are old and cute.",
            "title_similarity": "0.790833",
            "sentiment_compound": -0.4946
        },
        {
            "id": "hld9nnl",
            "score": 2,
            "text": "garbage tip, as usual",
            "title_similarity": "0.20082676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldsok6",
            "score": 2,
            "text": "This is shitty advice.\n\nBetter to detach yourself from the shackles of sentimentality and either toss or sell any handmade item you will not keep.",
            "title_similarity": "0.47362593",
            "sentiment_compound": 0.128
        },
        {
            "id": "hlcq8z4",
            "score": 63,
            "text": "As someone who knits and crochets, please don't ever get rid of something handmade. It's very much a labor of love.",
            "title_similarity": "0.7485682",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hlcxlgf",
            "score": 2,
            "text": "I dunno. I feel bad about getting rid of crocheted blankets, but I have sensory issues and that acrylic yarn might as well be sandpaper. I’m never going to let them touch my body so someone else should get some use out of them.",
            "title_similarity": "0.66540337",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hlcvh7o",
            "score": 25,
            "text": "This hit so so hard. My mom used to knit a lot but she gave up knitting in recent years because I wouldn’t wear them. She passed 12 days ago and yesterday I was ruffling through old boxes to find something she made for me.",
            "title_similarity": "0.73791206",
            "sentiment_compound": -0.1549
        },
        {
            "id": "hlcv7c5",
            "score": 16,
            "text": "This post has been rated \"W\" for wholesome as fuck",
            "title_similarity": "0.24346581",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlcwx8g",
            "score": 5,
            "text": "My mom still has the “scarf” I knit for her when I first learned when I was 12. It’s like 12 inches long, lumpy, and twice as thick at one end compared to the other but she’s held onto it for 20 years.",
            "title_similarity": "0.6810784",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hlcxjv0",
            "score": 7,
            "text": "I get sad when I see crocheted things at thrift stores. I have about a hundred doilies from my grandmas and my ex mother in law. I'll never get rid of them. Someday I'll make a tablecloth or a throw out of them  so I can put them on display instead of in my cedar chest.",
            "title_similarity": "0.7431227",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hlcuh8s",
            "score": 8,
            "text": "Love this. My mom got into crocheting about 6 years ago and I was one of the first people she crocheted for. I still have the thick purple and black scarf she made for me hanging up in my closet, although I live in Los Angeles and have yet to wear it. ❤️",
            "title_similarity": "0.71241343",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlcratr",
            "score": 10,
            "text": "My granny used to crochet blankets back in the 70's and 80s and back when I was a kid I thought they were the most uncomfortable ugly things ever (kids suck sometimes) and didn't know why my dad kept them all on the couches but he still has them at his home and I love them now, still uncomfy as heck so mostly for decoration, but they are one of a kind from the love of my late grandma  and I'm glad my dad always kept them out and didn't just put them away because they weren't fashionable",
            "title_similarity": "0.7445135",
            "sentiment_compound": 0.9585
        },
        {
            "id": "hlcro7b",
            "score": 10,
            "text": "I have two blankets mine made me 🙂",
            "title_similarity": "0.34968272",
            "sentiment_compound": 0.4033
        },
        {
            "id": "hlcubh1",
            "score": 11,
            "text": "I was once going through some old stuff in storage once and found a big plastic bag with an old baby blanket inside. Turns out it was *my* baby blanket since it had my birth year stitched on it and my grandma's signature. No one ever told me my (now passed) grandma made a blanket just for me, so that was a cool find.",
            "title_similarity": "0.7255089",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hlcy1m1",
            "score": 12,
            "text": "My grandma was diagnosed with dementia a couple years ago and has slowly been fading. She’s been working on crocheting an afghan (she’s been calling it “my blue”) for me for the past few months. Even though it may not be even close to perfect, I know that she’s put hours and hours of work into it, and I’m so excited to get it for Christmas!",
            "title_similarity": "0.734902",
            "sentiment_compound": 0.7969
        },
        {
            "id": "hld82k8",
            "score": 14,
            "text": "I can attest to this. Especially blankets can take hundreds of hours (and dollars) to crochet and they've put so much love into creating them only to come back and see the person has given it to the dog or charity shop, its a big reason no one quilts/knits/crochets anymore, people can be so ungrateful.",
            "title_similarity": "0.7594653",
            "sentiment_compound": 0.5287
        },
        {
            "id": "hlcqgof",
            "score": 20,
            "text": "I feel like this goes for any quilts or cross stitches too.",
            "title_similarity": "0.47995728",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlctm2j",
            "score": 25,
            "text": "I have a blanket my grandma Quilted for me, and a throw my aunt crocheted for me. I'll forever keep those. I have also made two baby blankets for friends and siblings.\n\nI did make myself a scrap yarn blanket that I loved, but my ex decided to rip it and throw it away.",
            "title_similarity": "0.762452",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hlcuaga",
            "score": 100,
            "text": "My mom has always crocheted like a mad woman. \n\nShe can make a large blanket in about 4 days. \n\nYou bet your ass my entire house is covered in her work. Scarves, blankets, tapestries, even washcloth type things for my dishes and my body.",
            "title_similarity": "0.65641606",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hlczt6x",
            "score": 107,
            "text": "Grandma, mom, or, you know, thirty year old uncle…\n\nIt’s not just the ladies who knit/crochet!",
            "title_similarity": "0.673223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcx5ev",
            "score": 42,
            "text": "My malmal (grandmother, mother's side) crocheted. I once asked her to make me a blanket, I was so excited even she agreed. Now, I was a dumbass kid and thought the end result would be like a comforter or something, you know? Of course, it's crochet so it ended up a petite scratchy and, well, you know, crocheted. I am ashamed to this day to say I was probably pretty openly disappointed. \n\nGod, I fucking hate that she probably thought I hated it. \n\nIt's the single most precious thing I own in the world. I fucking hate that she probably thought that I hated it.",
            "title_similarity": "0.773291",
            "sentiment_compound": -0.8007
        },
        {
            "id": "hlcqmmp",
            "score": 531,
            "text": "And don’t be a dick if someone gifts you a handmade item - they felt you were worth hours of their time. Be gracious, maybe take a photo to send them and tuck it away somewhere if you don’t like it.",
            "title_similarity": "0.67658985",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hlcx4dz",
            "score": 61,
            "text": "I just wanted to say that I crochet as a hobby, and the comments on this post game me the warm and fuzzies. It's really cool to see that so many people appreciate handmade things like this.",
            "title_similarity": "0.6686379",
            "sentiment_compound": 0.8384
        },
        {
            "id": "hlcu5zb",
            "score": 77,
            "text": "How timely is this. My Ma just finished making me her first ever beanie and scarf earlier this year. Beautiful set that I struggle to find clothes to suit.\n\nThis Monday she's getting brain surgery and I'm just so at peace knowing I have some of the best of her creative energy <3 I'm doing engravings for her to wake up to when I see her again.",
            "title_similarity": "0.7766384",
            "sentiment_compound": 0.9551
        },
        {
            "id": "hlcu3yu",
            "score": 111,
            "text": "I'm making a stegosaurus for my daughter right now.  I have one leg and the spikes for the Thagomizer, then, done.",
            "title_similarity": "0.5935403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcoynu",
            "score": 319,
            "text": "My grandma used to crochet so many blankets and my family was always trying to give them away. Especially later on when she only really made baby blankets because anything larger was unmanageable for her. When she died I couldn't find any of them. I wish I had one. Also, I wish I had the blanket she made me when I was a kid those were definitely awesome.",
            "title_similarity": "0.79613805",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hlcq1br",
            "score": 142,
            "text": "My mom made two covers for me on separate occasions and she asked why I still kept the old one and I said, \"Because I remember how frustrated you were and I had never heard you swear so often before the days you made it.\" Remembering that makes me chuckle fondly.",
            "title_similarity": "0.72865915",
            "sentiment_compound": 0.3287
        },
        {
            "id": "hlcmv1j",
            "score": 1615,
            "text": "Truth. Thanks to a d-bag first husband, I no longer have the afghan that my grandmother crocheted especially for me. But I do have one that she crocheted for my late parents, and I treasure it.",
            "title_similarity": "0.81485194",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hlcoy1g",
            "score": 902,
            "text": "My mom knitted blankets for each of her seven kids; each with a different color pattern.  I've had mine for over 50 years.",
            "title_similarity": "0.5287932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcqoep",
            "score": 270,
            "text": "A scarf can take weeks or months to knit, depending on how much time the person has available to knit and the complexity of the pattern. If someone makes something that time intensive especially for you, cherish it. It is a physical manifestation of their love for you.",
            "title_similarity": "0.6763245",
            "sentiment_compound": 0.7943
        },
        {
            "id": "hlcr37i",
            "score": 361,
            "text": "My mom crocheted my wife and I a blanket before she passed a couple years ago. It's been on our bed since she gave it to us. And we have both agreed that it will have to dissolve before it goes away. It's heavy, and its like getting a hug from her whenever I want :)",
            "title_similarity": "0.7315038",
            "sentiment_compound": 0.875
        },
        {
            "id": "hlcwfwi",
            "score": 1328,
            "text": "Here’s a story from the opposite side of the equation.\n\nMany years ago, I used to watch a friends little girl while he worked on the days he had custody. One day, I decided to crochet her a little poncho while we hung out. Not too long after, the parents reconciled and the family moved away.\n\nFast forward a decade-ish and I’m at a wedding reception and run in to the parents. The Mom told me how the little girl loved that poncho so much that she wore it until she couldn’t fit her head through the hole anymore - then she put it on her favorite teddy bear.\n\nI asked the parents to take a pic of the poncho on the sly so I could remember the color. I made that young lady a new poncho exactly like the old one so she can wear it again.\n\nIt amazes me how something small I made over the course of an afternoon touched someone’s life for years afterward. You never know how a small kindness can turn in to something big for someone else.\n\nUpdate: Thx so much for all the nice comments and awards! I hope you’re all safe and well.",
            "title_similarity": "0.76538754",
            "sentiment_compound": 0.9876
        },
        {
            "id": "hldaqwc",
            "score": 3526,
            "text": "So, one year for Christmas, my grandma asks me what I'd like. I tell her, \"actually, I'd love a scarf.\" To which she replies, \"ok, that's it?\" And I go, \"well, can you make it 15 feet long?\" She paused, then shook her head side-to-side and walked away. A few weeks go by, and my dad is all, \"you better wear that scarf. Your grandmother is at it every time I stop over!\" Christmas finally comes, and I'll be dammed if she did have a 15-foot-long, navy scarf. I was super excited as it was long enough to wrap around my neck twice and still just about touch the ground. In college, I would roll it up and use it as a pillow inbetween classes. I could wrap a few friends in it and walk to class together on cold days. The practical uses were great. This was all back in 2003. It's my favorite garment. Literally hanging in the corner of my room since the weather is getting colder. I get asked where I got it all the time. One-of-a-kind Grandma line.\n\nFigured this would just get buried in the comments, but I felt it was relevant.. thanks for reading.\n\nTop comment edit: Since everyone seems to love my grandma now, here's another anecdote about the scarf: after a pretty bad breakup with a long-term girlfriend, I thought I'd left the scarf at her place after getting all my stuff out. I was devastated to say the least. Without me saying anything, my sister had let mention I thought I'd lost it and my grandma went right back to work. So, about 8 years after making me the first one, she bangs out this second one no-questions-asked. I ended up actually finding the scarf later, but still. She's 93 now and still cooking Sunday Italian dinner. I know this thread is about scarves and what‐not but, thought it was a funny story to add. Cheers.",
            "title_similarity": "0.73124874",
            "sentiment_compound": 0.9761
        },
        {
            "id": "hlcvy9w",
            "score": 2,
            "text": "Great tip! Handmade has love woven right in",
            "title_similarity": "0.37946612",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hlcyemn",
            "score": 1,
            "text": "I got a sleeveless hoodie that adds +5 to lifting at the gym.",
            "title_similarity": "0.29985756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlcykuo",
            "score": 1,
            "text": "Even better learn how to from her. Practice making scarves, hats, etc for teachers, friends, family, shelters and after they pass you’ll think happily about the time they taught you each stitch.",
            "title_similarity": "0.76060474",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hlczbz6",
            "score": 14,
            "text": "Reading these posts and comments make me jealous that people have good relationships with their family. I wish I could relate to this.",
            "title_similarity": "0.5334952",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hlczxtl",
            "score": 1,
            "text": "I wish I had a mother and grandmother who made me things 😭 I would cherish that forever.",
            "title_similarity": "0.71031964",
            "sentiment_compound": 0.296
        },
        {
            "id": "hld14lq",
            "score": 1,
            "text": "My grandmother knitted a blanket for my son (her great-grandson). She passed away before he was born. It is the most valuable thing in our home.",
            "title_similarity": "0.73755676",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hld1f1q",
            "score": 1,
            "text": "Best way to clean said homemade knit items?",
            "title_similarity": "0.5493462",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hld1nlk",
            "score": 1,
            "text": "I literally have three scarves my mom knitted for me and my wife for this reason. Love this tip.",
            "title_similarity": "0.7036909",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hld1o84",
            "score": 1,
            "text": "Yes!!! We just had a house fire my grandma made me a horse sweater idk if it ok yet or not but I love it and want to wear it more then ever now my grandma passed less then 6 months ago so it means a ton 2 me",
            "title_similarity": "0.7554253",
            "sentiment_compound": -0.6628
        },
        {
            "id": "hld1r73",
            "score": 1,
            "text": "I crocheted a 2’x2’ blanket for all 3 of my kiddos to come home from the hospital in… pending me not having more kids, I’ll make another in my husband and my favourite colour to make stitched 4x4’ blanket.\nThis will sound a little funky— my husbands step-grandma’s sister — also just called grandma:) knitted each of them blankets and mailed them over once they were born, they’re my most used blankets for any outings— car rides, grocery store run, walk, etc.  I love how soft they are.\nI’ve got socks from my own gran (moms mom) who passed in 2017 & they’re my most treasured possession… I had 2 pairs that I’d ziploc’d to try keep her scent, and I gifted one pair to my sister for completing her masters degree in 2019, as she was primarily raised by our gran & wears all the socks she was given.  I did it in public so neither of us would cry.\nMy little sister knits and crochets and I’ve got a couple sweaters and scarves that I’ll keep for forever because she gave them to me.",
            "title_similarity": "0.80417585",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hld1sdf",
            "score": 1,
            "text": "Thank you so much.",
            "title_similarity": "0.15170851",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hld2v8i",
            "score": 1,
            "text": "To this day I have kept almost all of the birthday cards my nan has ever made me. They are a type of embroidered art style.",
            "title_similarity": "0.5859139",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld2zke",
            "score": 1,
            "text": "I crochet. When I see someone regift or throw away something I spent over 20 hours on it breaks me inside. Please hold onto the stuff crafters make you. They are pouring their heart and souls into it, and the fact they considered to make you something free of cost really is something. Most people won’t pay $500 for a crochet sweater, but in terms of materials and how many hours it takes to hand make one, you better be damn happy if you receive clothing for free",
            "title_similarity": "0.75967455",
            "sentiment_compound": 0.9646
        },
        {
            "id": "hld317r",
            "score": 1,
            "text": "My mum used to always knit jumpers for me and my brother for our school uniform and I was always a bit bleh that they weren't the regular store-bought ones. Once I got older I adored the knitted jumpers she'd randomly make for me (she LOVED knitting). Still got one left that I can't fit into at all but I give it a little hug every now and then when I miss her.",
            "title_similarity": "0.82510465",
            "sentiment_compound": 0.716
        },
        {
            "id": "hld3225",
            "score": 1,
            "text": "My mum knitted me a scarf and a hat when I was a kid I still have them now safely folded in my wardrobe",
            "title_similarity": "0.7232332",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hld33e2",
            "score": 1,
            "text": "My mother just passed away on Wednesday as i was driving states away to see her. Unfortunately i Didn’t make it in time  to say goodbye and she passed away the night before we arrived. She had crocheted some winter hats for me and my roommates a few years ago and asked what colors we wanted. When i said i wanted a like green/navy hat (Seahawks colors) she said she couldn’t imagine why i would want such an ugly hat but she made one for me anyway. I will never let go of that hat now knowing its something she made out of the kindness of her heart. RIP mom. We all miss you",
            "title_similarity": "0.77274287",
            "sentiment_compound": 0.8381
        },
        {
            "id": "hld35ji",
            "score": 1,
            "text": "My aunt died of cancer fairly recently. She wanted to meet my brothers and I's kids, but at the time none of us were in the stage of our life where we would have any. When she was diagnosed with cancer, it was around the time my brother was expecting his first kid, and by extension, our generation first grandson. She started knitting clothes for all the babies we would one day had, finished a few, started many more. One of the last things she did was instruct my mom on how to finish the rest so she would live on through us. It really sucks she didn't get to live longer, since now both my brothers have two kids each :(.",
            "title_similarity": "0.7604286",
            "sentiment_compound": -0.9412
        },
        {
            "id": "hld37ab",
            "score": 17,
            "text": "I knit and crochet and sew, but I don’t give as presents any more. They aren’t appreciated by my husbands family, infact one of them asked my why I do “old person things”. All the old ladies love seeing my daughter in the knitted and crocheted hats when were out walking! And they love the vibrant patterns on her clothes. I decided that if I’m going to make for others, they have to buy it. That way I’ll be able to tell who really wants something plus it will fun my fabric and yarn addiction!",
            "title_similarity": "0.8679033",
            "sentiment_compound": 0.9835
        },
        {
            "id": "hld3azt",
            "score": 5,
            "text": "Parkinson’s took my grandmother’s ability to do this. Please treasure these things. They mean so much more in hindsight.",
            "title_similarity": "0.5843526",
            "sentiment_compound": 0.729
        },
        {
            "id": "hld3cj3",
            "score": 1,
            "text": "My aunt knitted Keffe Fassett style jumpers in the 90's that we treat as heirlooms since she died.",
            "title_similarity": "0.6902697",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hld3h40",
            "score": 1,
            "text": "I have this huge blanket my mom crocheted for me when I was in middle school. It’s probably about a king size blanket and at the time I had a twin size bed lol",
            "title_similarity": "0.6208185",
            "sentiment_compound": 0.6625
        },
        {
            "id": "hld3p85",
            "score": 1,
            "text": "My mom has knitted/knitting blankets for all three of her kids and grand kids also all five of her siblings kids and grand kids, I lost count how many she made but everyone always looks forward to their baby getting their own blanket around Christmas",
            "title_similarity": "0.72451437",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hld3s0z",
            "score": 1,
            "text": "As a mum and a knitter, thank you for this.",
            "title_similarity": "0.64105076",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hld3vq5",
            "score": 1,
            "text": "I feel like more and more every day, maybe it has to do with growing up... And seeing the elders in your life grow up with you or maybe even just for me specifically, it's really help me cherish the small things from a home cooked meal to blanket you've had since birth.\n\n&#x200B;\n\nCherish any gift or anything that is given to you physically or even just mentally through advice or any life lessons.\n\nWe truly have to admire and appreciate everything around us before it's too late.",
            "title_similarity": "0.6867928",
            "sentiment_compound": 0.9693
        },
        {
            "id": "hld3vt8",
            "score": 1,
            "text": "I have two blankets my mom has crocheted. Absolutely never getting rid of them.",
            "title_similarity": "0.7416934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld3yea",
            "score": 1,
            "text": "But now that you say that, I feel even more terrible that I have lost these special items. Life happens and we should all try and take care of special scarves and all, but thanks for reminding me of all the special scarves and sweaters I will never see again! Dammit where did they go?!",
            "title_similarity": "0.70785844",
            "sentiment_compound": 0.916
        },
        {
            "id": "hld440t",
            "score": 1,
            "text": "100%. I have a sweater my grandmother made for my grandfather. Love that sweater",
            "title_similarity": "0.67356354",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hld45im",
            "score": 5,
            "text": "Why would I NOT keep something that someone MADE for me? Anyone. That's precious.",
            "title_similarity": "0.51841563",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hld49c0",
            "score": 1,
            "text": "I made sure to get my UofM blanket my grandma crocheted out of my house when I was forced to leave, heh 2 weeks ago. I've had the blanket since my freshman year of high school (25yrs ago), my sister has even repaired it for me.",
            "title_similarity": "0.6885202",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hld4coa",
            "score": 78,
            "text": "Christmas at the in-laws one year, it was a zoo -- bunch of kids, everyone's laughing and ripping open presents, making noise. Probably no one louder than my wife. Having a great time.  \n\nQuietly her ~90yo grandmother hands her a box and she flips it open -- and just bursts into tears at the sign of this beautiful afghan. And she didn't know it then but it would be the last one she'd ever make.",
            "title_similarity": "0.6677788",
            "sentiment_compound": 0.6611
        },
        {
            "id": "hld4gdp",
            "score": 5,
            "text": "This is the truth. My grandma crocheted about a dozen blankets for my cabbage patch dolls when I was little. My oldest daughter now bears my grandmothers name. I would give almost anything to have one of those blankets, for myself but also to share with my daughter. Some things are worth holding onto.",
            "title_similarity": "0.76415837",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hld4ihl",
            "score": 13,
            "text": "My grandmother has 9 grandchildren. We're within 11 years of each other. She started knitting blankets/afghans when we were little, and would work on them in secret.\n\nThe plan was to give them out as wedding gifts, but in typical millenial fashion nobody was getting married\n\nOne Christmas she brought out all the blankets and gave us each ours. Each a different colour. It was incredibly emotional, we all had the same link of Nana's thread.\n\nWe decided to pick the colour of my son's nursery to match the blanket well and it's hanging on a blanket ladder next to his crib. It's a fantastic keepsake that I'll never let go and I know none of my cousin's will either.",
            "title_similarity": "0.77878004",
            "sentiment_compound": 0.8717
        },
        {
            "id": "hld4x6s",
            "score": 1,
            "text": "So much this. My grandma used to make us socks every Christmas. I was always very enthusiastic about them because I wanted her to feel valued. And I do like the socks, just not quite as much as I pretend. A few weeks ago she informed me that we won't be getting any more socks. She is over 90 and her fingers hurt. And that's ok. I'm sad because the socks were something she could give us. Something she could do for us. I am so glad I have so many socks, they will still be there when she's gone one day.",
            "title_similarity": "0.8395467",
            "sentiment_compound": 0.7058
        },
        {
            "id": "hld4xmv",
            "score": 15,
            "text": "This is so true. When I was in high school, my mom, a scientist, knit me a scarf with a DNA double helix going down the middle. I thought it was cool at the time, but was careless and ended up losing it. Now that she's lost much of her cognitive abilities to dementia, I wish I still had that scarf as a reminder of how brilliant and caring she was...",
            "title_similarity": "0.8048049",
            "sentiment_compound": 0.8723
        },
        {
            "id": "hld4zcq",
            "score": 1,
            "text": "Very good advice. As a dad with three young kids, this rings very true to me.",
            "title_similarity": "0.31000993",
            "sentiment_compound": 0.742
        },
        {
            "id": "hld506j",
            "score": 5,
            "text": "As a crocheter, this post is both justifying and highly gratifying",
            "title_similarity": "0.39987057",
            "sentiment_compound": 0.5563
        },
        {
            "id": "hld515r",
            "score": 1,
            "text": "This is actually a huge reason I knit ❤️❤️ i also never sell because it’s never worth it. All my love goes into each project that I make",
            "title_similarity": "0.6912778",
            "sentiment_compound": 0.7035
        },
        {
            "id": "hld51op",
            "score": 1,
            "text": "My grandma cut up my late-grandpas old shirts and turned them into masks for us during the pandemic. Keeping it forever.",
            "title_similarity": "0.6987135",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hld53s1",
            "score": 3,
            "text": "I go to a lot of estate auctions, and it's always kind of sad to see those afghans, old worn out quilts, and blankets that someone's mom made by hand selling for $1 in box lots while all the surviving family and kids stand there showing zero interest in something their mom or grandmother spent hours making for them.   The same with things Dad made in his home wood shop, and art which even though it may not be professional quality and not worth any money to the public is still something unique that was created by someone's deceased relative.\n\n   I can't tell you how many old hand made quilts with holes in them I have bought for $1 just to cut up and put in old picture frames to sell for $40 a piece at antique shows, while the entire family stands there with no interest at the auction.",
            "title_similarity": "0.7066667",
            "sentiment_compound": 0.4139
        },
        {
            "id": "hld583v",
            "score": 1,
            "text": "I started crocheting about a year ago. This year for Christmas I am making all my gifts, which I started preparing three months ago. Really going for that last push and cranking out scarves, blankets, and stuffed animals with almost every waking hour. I know they’re still kind of wonky, but I really hope the recipients don’t straight chuck them in the bin 🥺",
            "title_similarity": "0.6969966",
            "sentiment_compound": 0.7677
        },
        {
            "id": "hld5cef",
            "score": 1,
            "text": "Also, stop taking pictures of places.  There are a billion pictures of those places already that are much better than yours and unless it's a glacier those places will be there long after your love ones kick.  Focus on your loved ones.  Take dozens of pictures and videos.  Those you'll have reason to cherish soon enough.",
            "title_similarity": "0.5879841",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hld5lnd",
            "score": 1,
            "text": "Just like time we can't get back lost items",
            "title_similarity": "0.31732666",
            "sentiment_compound": 0.5365
        },
        {
            "id": "hld5o5r",
            "score": 1,
            "text": "This goes for art too, if someone you love paints or creates something. Keep it! It will mean a lot to you later on.",
            "title_similarity": "0.45759645",
            "sentiment_compound": 0.7644
        },
        {
            "id": "hld5qju",
            "score": 1,
            "text": "I still have a little jacket my grandma from my dad's side knitted for me.\n\nIt doesn't even fit anymore because she made it when I was 14 but I will never throw it away",
            "title_similarity": "0.81358004",
            "sentiment_compound": -0.1419
        },
        {
            "id": "hld5r6f",
            "score": 6,
            "text": "My grandma loved knitting and she passed away last year. My girlfriend finished off all the blankets, scarves and pieces which my grandma never got the chance to. They became suprise presents for the family who all cherish them.",
            "title_similarity": "0.79493177",
            "sentiment_compound": 0.6966
        },
        {
            "id": "hld5vyp",
            "score": 1,
            "text": "Yup! My mom made used to give me things. Just little items because she was thinking of me. I was a stupid little shit that didn’t appreciate it, and I just wanna go back and say I’m sorry, but I can’t. \n\nChrist that hurts to write out.",
            "title_similarity": "0.69826365",
            "sentiment_compound": -0.7961
        },
        {
            "id": "hld61az",
            "score": 1,
            "text": "And you’ll leave that scarf there, at his sister’s house, and he’ll still keep it after all these years, cause it reminds him of innocence and it will smell like you.",
            "title_similarity": "0.8096801",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hld61sy",
            "score": 13,
            "text": "I had a baby 3 months ago. He spent 4 days in the NICU. Every baby that went into the special care nursery got a homemade blanket created with love by someone out there who cares. It is the most important baby thing I have right now. Knowing it was with him, keeping him warm his first few days of life is precious.",
            "title_similarity": "0.6212732",
            "sentiment_compound": 0.9674
        },
        {
            "id": "hld636k",
            "score": 1,
            "text": "My mum knitted both my sister and I blankets for our 21st birthdays. I don't use it, partly because I dislike the fabric as it makes my skin itch (my skin is super sensitive to fabrics), but if it got ruined, I wouldn't be able to forgive myself. She spent months and months making it.",
            "title_similarity": "0.78752375",
            "sentiment_compound": -0.1823
        },
        {
            "id": "hld679j",
            "score": 1,
            "text": "My grandmother used to make us knitted slippers every year for Christmas and I wish I still had them even though they wouldn’t fit.",
            "title_similarity": "0.82309234",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hld6j8t",
            "score": 52,
            "text": "I agree so much, but would like to offer a tip in case anybody reading this is sad because they lost a handmade item made for them by a loved one who’s now gone. I have lost a shit ton of irreplaceable handmade items over the years, and it made me feel really sad, like I’d *extra*-lost the person who made the thing. So I came up with the Shamu Method.\n\nWhat I do is designate a new thing to replace the lost thing. It has to be as like as possible (although if the lost thing had an annoying flaw, I don’t reproduce the flaw), and if I can, I make it myself. If I can’t, I try to find someone else to make it specially. \n\nI do have an amazing ability to lie to myself, which is a help with successfully Shamu-ing an item, but I also think you just have to have a backup plan sometimes, because life doesn’t always work out to be stable or linear, and things get lost. When my dad died, for example, a lot of stuff that had been handed down to me was still stored at his house, and his executor said I had to buy it all back if I wanted it. I was younger, and bereaved, and had no proof the stuff was mine, and at the time I wasn’t assertive enough to fight it or confident enough to navigate getting a lawyer. So I opted to cut my losses and not purchase my sentimental heirlooms. Years later, every so often I think, “oh I wish I had that afghan great-grandma made.” There’s no way to get it back now, so what am I going to do, mope forever about how it was irreplaceable? Or just replace it and assign the new afghan the same treasured status as the original. \n\nSo I make or obtain an approximation of the treasured afghan, except made of better yarn so it doesn’t weigh one thousand pounds and feel like scratchy acrylic, and then I’m happy and comforted.\n\nThe Shamu Method also works for severely depressed people or people with other mental illnesses that make them prone to not having a lot of wherewithal to control and keep track of their possessions over long stretches of time. It’s ok; just get a new thing and pretend it’s the old thing. Like Shamu!",
            "title_similarity": "0.6551639",
            "sentiment_compound": 0.302
        },
        {
            "id": "hld6wov",
            "score": 1,
            "text": "My Baba (Ukrainian) crocheted afghans for each grandkid. Of course I still have mine.  What’s even cooler; I ended up with all of the extras. I have about a dozen in different solid colors.  They’re beautiful to look at, nice & warm & cozy, and every single pet cat I’ve had has absolutely loved “Baba blankets”.  They just love the texture from the cool little stitches.  \nBaba taught me how to knit, but I never caught on to crochet.  I’ve been meaning to try it out. I have all of the supplies & I’m ready.  This post is probably what I needed to get everything going. Thank you for the reminder!",
            "title_similarity": "0.77157813",
            "sentiment_compound": 0.9496
        },
        {
            "id": "hld741a",
            "score": 1,
            "text": "My grandma gave me a small table cloth she hand embroidered some\nGrapes on. Its really simple design on one corner and I have absolutely zero use for it but, It’s one of my most cherished possessions. I have it stored away in a fireproof box.",
            "title_similarity": "0.7349497",
            "sentiment_compound": 0.7899
        },
        {
            "id": "hld7b1y",
            "score": 1,
            "text": "Can confirm. My great-grandmother knitted me a rainbow sweater when I was a kid. It still fits so I wore it the day I came out to my dad.",
            "title_similarity": "0.6914461",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld7ftx",
            "score": 1,
            "text": "You clearly haven’t really care about Seele.",
            "title_similarity": "0.26260093",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hld7hbx",
            "score": 6,
            "text": "My mum knitted me a jumper with a leopard pattern. It must be 35 years old. I passed it on to a younger cousin and she wears it with pride. It's older than she is. I get a joy every time I see her wear it.",
            "title_similarity": "0.69826484",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hld7hlx",
            "score": 6,
            "text": "My grandma would knit blankets and childrens clothes, cardigans and jumpers. \n\nShe passed away in august, but I always kept everything she knitted. \n\nA few days after the funeral I got a package, it was a whole bunch of blankets with a note from my grandma saying she knitted the blankets for my partner who works as a vet, to give to all the cats and dogs. \n\nI’m not afraid to admit that I didn’t donate them, I still have them, I cannot bring myself to let them go.",
            "title_similarity": "0.7665988",
            "sentiment_compound": -0.6295
        },
        {
            "id": "hld7zvu",
            "score": 2,
            "text": "I love these wholesome tips. Don't just keep it, tell them how grateful you are and how much you love them as often as possible, whether with words or with acts. Don't regret anything when the day comes that they're not with you anymore",
            "title_similarity": "0.5796908",
            "sentiment_compound": 0.9291
        },
        {
            "id": "hld885l",
            "score": 8,
            "text": "20+years ago My grandmother made all her grandkids a “quillow” - basically a blanket quilt that you could tuck into a little pocket on it and turn it into a pillow. \n\nWe moved and travelled a lot as a kid so it got heaps of use. \n\nMine is so threadbare and over loved that the fabric is starting to tear. But I love it too much to throw out.",
            "title_similarity": "0.69568944",
            "sentiment_compound": 0.85
        },
        {
            "id": "hld888h",
            "score": 2,
            "text": "I lost a crochet jumped my mum made me years ago and I think about it every day. Absolutely broke my heart and I learnt to crochet so that I could replicate it one day.",
            "title_similarity": "0.7228268",
            "sentiment_compound": 0.0183
        },
        {
            "id": "hld89up",
            "score": 1,
            "text": "can confirm, im still using a bed sheet my mom sew",
            "title_similarity": "0.6473453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld8ek0",
            "score": 1,
            "text": "My grandpa knitted socks exclusively still have a couple.",
            "title_similarity": "0.5818909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld8il8",
            "score": 1,
            "text": "The only thing I have is a brown satin heart pillow my grandma made, it is now 27 years old and I can't sleep without it. I wish I had known the value of these things, some were lost not due to me either. I also now have a special couple bins for my kid to preserve little moments of their childhood.",
            "title_similarity": "0.7341789",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hld8ip5",
            "score": 1,
            "text": "My grandma/mom never knitted but i always keep the last card they sent me. Lost my grandma a little over 2 years ago but I still have that last Christmas card she sent. Bless her soul",
            "title_similarity": "0.7430918",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hld8rs5",
            "score": 1,
            "text": "Lpt, if your grandfather or father knit do the same thing",
            "title_similarity": "0.49881223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld8t2w",
            "score": 1,
            "text": "LPT: appreciate the things that you got made by the person who loved you",
            "title_similarity": "0.38159913",
            "sentiment_compound": 0.765
        },
        {
            "id": "hld8thb",
            "score": 9,
            "text": "My mom hand made a teddy bear for me, wayyy back in the day. All the kids in my class were supposed to bring a homemade bear in for a teddy bear picnic or something like that.\n\nI was big into Fievel Goes West so she made me a cowboy bear, complete with cowboy hat, dashing red chaps, and a little dinosaur he carried around. Still have it, and it remains one of my most treasured possessions.\n\nShe hasnt sewn or made anything like this in a really long time. But the care and love she put into this bear can be felt to this day.",
            "title_similarity": "0.676141",
            "sentiment_compound": 0.9527
        },
        {
            "id": "hld8x2f",
            "score": 1,
            "text": "I think I'm a bit late to this party but my grandma knitted a whole set of cricket whites for my action man. I still have them in a box upstairs. I thought it was so goofy when she gave them to me 20~years ago,  ow she's slipped this mortal coil they're such a cool little reminder of how she always thought of me and the things she knew I liked.\n\nMiss ya granny xx",
            "title_similarity": "0.7448919",
            "sentiment_compound": 0.7791
        },
        {
            "id": "hld8yz9",
            "score": 1,
            "text": "I got all my grandmas cross stitching gear and patterns. I love it so much and makes me feel closer to her.",
            "title_similarity": "0.65454316",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hld90mc",
            "score": 1,
            "text": "My husband's grandma made pillows, blankets for family members and even an apron for me. We've kept everything. Before she passed she gave me one of her sewing machines since I like to sew too and used to make clothes. I want to carry on her tradition of sewing gifts.",
            "title_similarity": "0.76658475",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hld931p",
            "score": 1,
            "text": "You got that right. Nothing replaces that feeling",
            "title_similarity": "0.21024567",
            "sentiment_compound": -0.0951
        },
        {
            "id": "hld94e1",
            "score": 1,
            "text": "Even if they are prolific in their productivity! Surely I can donate a few bahaha",
            "title_similarity": "0.39574754",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hld97zs",
            "score": 1,
            "text": "Can confirm. My sister started getting into knitting a couple of years before she passed away from a freak heart defect. I still have the scarf she gave me. It’s truly terribly made, but it’s one of my favorite possessions to this day. I love it in all its asymmetrical funky glory. Thanks, Karla.",
            "title_similarity": "0.823177",
            "sentiment_compound": 0.9607
        },
        {
            "id": "hld9dh8",
            "score": 11,
            "text": "I was wearing a knitted beanie with pom pom on top. A co-worker started making fun of me. I just said “my grandma knitted this for me”.  He apologized and then mumbled “cool beanie” and walked off.",
            "title_similarity": "0.7687746",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hld9f3o",
            "score": 1,
            "text": "Yup; glad I kept it too",
            "title_similarity": "0.30574745",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hld9njk",
            "score": 1,
            "text": "Or ASAP Rocky will wear it one day at the Met Gala",
            "title_similarity": "0.39544243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hld9w19",
            "score": 1,
            "text": "My mom knits woolen socks. In my teens I hated them, in my twens I ignored them, now I LOVE them and wouldn't mind to get another pait for christmas :)",
            "title_similarity": "0.8458738",
            "sentiment_compound": 0.347
        },
        {
            "id": "hlda1ay",
            "score": 1,
            "text": "I still have et cherish a crocheted scarf from my arrière grand mère ( great grandmother) It is always a joy to wear",
            "title_similarity": "0.68079424",
            "sentiment_compound": 0.926
        },
        {
            "id": "hlda2c0",
            "score": 1,
            "text": "20 something years ago my mum knitted me the biggest and fuzziest scarf I've ever seen. It should have been the final thing she ever knitted for me or my sister.\nIt's beige and brown, made from thick wool and is so freakishly long.\nEven when wrapped around my neck, it still hangs down to my butt.\nAbsolutely love this thing and I can't wait for it to be winter again to wear it.",
            "title_similarity": "0.80225563",
            "sentiment_compound": 0.4813
        },
        {
            "id": "hlda7gj",
            "score": 1,
            "text": "joy total track late don't whole over out two change",
            "title_similarity": "0.39782083",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hldagn2",
            "score": 2,
            "text": "Yes. 20 years ago I was given crocheted full sized blanket my grandma made in the 70s. It’s green, and holey by design, but it smelled like her so I kept it in a bin just so I could remember. I finally took it out last year and tossed it on my couch, it no longer smells like her, but my babies get to enjoy something she made while they nest on the couch.",
            "title_similarity": "0.7233343",
            "sentiment_compound": 0.8705
        },
        {
            "id": "hldarem",
            "score": 4,
            "text": "This is so true. You'd really wish you could keep all of it.\nMy grandma became demented and when we moved her to her home we found small patches she'd knitted to turn into a blanket but each of the patch had become messier and messier until we found just one blob of yarn. Her dementia had made her lose the ability to knit and it was showing strongly in these patches. After the funeral we asked a friend to put these patches together into a blanket and when I look at it, it reminds me of my childhood when she would knit next to me while I watched cartoons.",
            "title_similarity": "0.7656697",
            "sentiment_compound": 0.751
        },
        {
            "id": "hldat9k",
            "score": 1,
            "text": "My late granny knitted a cardigan for me nearly 2 decades ago. She knitted a newborn set complete with booties when I had my firstborn slightly more than a decade ago.\n\nShe also knitted them for me and my brothers when we were born. She loves needlework and taught me how to sew and cook. \n\nShe passed away back in 2018 at the ripe old age of 93. While all those that she knitted is not compatible with our hot and humid climate, me and my Mum keep them as a loving remembrance of her. \n\n(She also sew most of our clothes growing up, that too are still kept by my Mum for nearly 40yrs now)",
            "title_similarity": "0.77953744",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hldau7d",
            "score": 1,
            "text": "I have two knitted caps from my grandma. One is grey and I wear it when cold. The other is blue with a red puffball on top, makes for an excellent stan cosplay.",
            "title_similarity": "0.67349315",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hldawop",
            "score": 2,
            "text": "It's not that they aren't 'cool', it's that they are too itchy!!",
            "title_similarity": "0.23839785",
            "sentiment_compound": -0.5641
        },
        {
            "id": "hldb2vs",
            "score": 1,
            "text": "As a knitter, here's an addition to this LPT - if you genuinely like the thing they made, use it!!\n\nMy mom simply collects the stuff I make, all of it, and never actually uses it because she's afraid something will happen to it. It makes me sad to see it just sitting there. I would personally rather she wears them even if they rip or whatever than just be a display piece. Our friends also have given us a hard time for using a quilt that my husband's late grandfather made because it's \"sentimental\". Of course it is, but we get to have a reminder of him daily rather than just a stashed away blanket we'll see once a year or whatever.",
            "title_similarity": "0.85146046",
            "sentiment_compound": 0.4184
        },
        {
            "id": "hldb3rh",
            "score": 1,
            "text": "“Let’s keep these diamonds in the rough.",
            "title_similarity": "0.32053742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldb3rm",
            "score": 1,
            "text": "My mum loves sewing and crocheting; she's made me several things over the years including two gorgeous blankets, and I've kept them all and I will always",
            "title_similarity": "0.68551135",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hldb8ql",
            "score": 2,
            "text": "This advice probably applies to many people, but not all.",
            "title_similarity": "0.22152138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldb9h4",
            "score": 2,
            "text": "My late great grandma knitted me and my brother wool blankets when we were each toddlers, and matching beanies when we were in high school age. \n\nWe both keep em to this day. My wife doesn't quite get why I have this (now sort of) gnarly, small blanket draped over my office chair but that's ok, she'll understand one day.",
            "title_similarity": "0.7854493",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hldbdhq",
            "score": 1,
            "text": "In the 80's my mum made me a reversible jacket. I don't have the jacket but I still have some of the material",
            "title_similarity": "0.7120424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldbf1o",
            "score": 3,
            "text": "I have a quilt that my mom started after I was born, and she didn't finish it until a few years ago. it's one of the only things in my house besides my dog that I'd grab and run out with in the event of a fire.",
            "title_similarity": "0.71580243",
            "sentiment_compound": -0.34
        },
        {
            "id": "hldbgb2",
            "score": 2,
            "text": "Unless your grandparents and parents were jerks.",
            "title_similarity": "0.3406781",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hldbh5k",
            "score": 1,
            "text": "My aunt knitted me a couple blankets and I both use and cherish them.  I use one and have the other folded over my living room couch for guests.  I use them all time and whatever I use them for, I’m always reminded of her.",
            "title_similarity": "0.6919096",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hldblzq",
            "score": 1,
            "text": "A friend of mine, whose marriage broke up badly, kept a stole her wife knit for him. He was very fond of that. Later she cheated him. One day he was found hanged using the same stole.",
            "title_similarity": "0.61446214",
            "sentiment_compound": -0.4228
        },
        {
            "id": "hldbork",
            "score": 4,
            "text": "The only reason I know what a \"Sloppy Joe\" is, is my Mother knitted me one in the very early 60's and I still have it. Reminds me of her every time I set my eyes on it. She has been gone 35 years.\n  To save you looking it up its not a Ground beef sandwich that comes up it's a extra large jumper worn back in the days of the teddy boys",
            "title_similarity": "0.7181851",
            "sentiment_compound": 0.25
        },
        {
            "id": "hldbuy7",
            "score": 6,
            "text": "My mother knits blankets for everyone. She uses to knit when she was younger but stopped because she didn’t have enough time for herself, she had meetings, work, taking care of her kids. So things cooled down and she was unpacking some old things and she found a blanket that my grandma and my mom knitted together (grandma taught her), when i first held it i was like “mom this is so nice, its so soft. Did you make this?” I was in disbelief because i never knew she used to knit. She then started to pick up the knitting hobby and made 7 blankets and 1 sweater for our dog. Ill never throw them away. Never.",
            "title_similarity": "0.79492915",
            "sentiment_compound": 0.8138
        },
        {
            "id": "hldc2xv",
            "score": 1,
            "text": "100% can related 💛",
            "title_similarity": "0.13067314",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hldc7kl",
            "score": 1,
            "text": "I actually have all the sweaters and blankets that my great grandpa made me. I absolutely love them.",
            "title_similarity": "0.6120755",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hldc9wq",
            "score": 1,
            "text": "I have these comfy socks my granny crocheted for me and I love them. Perfect to wear in bed or on a lazy Sunday",
            "title_similarity": "0.73162216",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hldckww",
            "score": 1,
            "text": "I still have things my grandmother made and I think about how many times I almost didn't keep them. They are now in a keepsakes box",
            "title_similarity": "0.68094087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldcodv",
            "score": 1,
            "text": "listen to this guy! it's too late for me :'( my aunt used to make wonderful wool sweaters when I was growing up but now she just isn't dexterous enough to do it and I wish I still had at least one",
            "title_similarity": "0.7861587",
            "sentiment_compound": 0.6643
        },
        {
            "id": "hldcotj",
            "score": 1,
            "text": "\"Days\" lol\n\nI guess technically months are made of days. But I'm also... slow.",
            "title_similarity": "0.33785844",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hldcpoj",
            "score": 1,
            "text": "I just had a baby and he has been gifted so many beautifully knit and crocheted blankets, booties, hats, and sweaters. The time that each of our family members put into these items is amazing and warms my heart that he is so loved by people who haven't even met him yet.",
            "title_similarity": "0.593806",
            "sentiment_compound": 0.9641
        },
        {
            "id": "hldcr9p",
            "score": 1,
            "text": "Truth. My grandmother used to make scars and hats. I don’t know where they ended up. She’s dead now.\n\nOne of my cousins had a baby recently and she has kept a baby hat that grandma had crocheted, and I’m a little jealous.",
            "title_similarity": "0.7402925",
            "sentiment_compound": -0.6915
        },
        {
            "id": "hldcwoo",
            "score": 1,
            "text": "i still have the wool socks my grandma made for me. she died years ago, and the socks are worn out and have holes, but they still are the most comfortable and warm socks i could wear on a cold rainy or snowy day at home\n\nlove and miss you oma<3",
            "title_similarity": "0.7771784",
            "sentiment_compound": 0.8953
        },
        {
            "id": "hldcxja",
            "score": 1,
            "text": "crochet in general… the shits are nice to touch",
            "title_similarity": "0.43462747",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hldd3vv",
            "score": 4,
            "text": "My grandmother often knitted me scarfs and hats throughout my childhood. \nAfter she passed my mum and I where going through some of her things to see if we wanted anything. I got a whole bag of scarfs and hats, mum asked why and all I said was “she can never knit me another one”",
            "title_similarity": "0.8236018",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldd8u1",
            "score": 1,
            "text": "I have a giant bright colorful crochet blanket my Gramma mailed to me from Hawaii when I lived in Chicago back in the 90s. And although the color patches and bright pink borders were kinda “old lady” for me in my 20s, I still used it a lot back then. But for probably 15 years now I have had it stored away. And although it’s super heavy, I brought it with me when I finally moved back home to Hawaii about 5 years ago, with all my earthly belongings whittled down to a few suitcases and carry ons. I will probably never use it again. But I just can’t bring myself to do anything but keep it. She was in her 70s when she made it and, although we weren’t close, I still feel her love in that blanket.",
            "title_similarity": "0.6407846",
            "sentiment_compound": 0.9437
        },
        {
            "id": "hlddbwx",
            "score": 2,
            "text": "I have a big basket full of the slippers my grandma crocheted me. She initiated my boyfriend into the family by making him stand on a piece of paper and drawing the outline so she knew what size he was. She always told me to throw them away once they gave out. I fix them. She died last year during covid and I couldn't say goodbye because I live in a different country. The slippers will be forever fixed.",
            "title_similarity": "0.77701163",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hlddecd",
            "score": 1,
            "text": "My grandma made 2 identical rainbow blankets, one for me, one for my brother. One messy divorce between my parents and a sudden move across the city, both were nowhere to be found.\n\nThey were all I could think about at her funeral. Burst into tears that I'd never have that physical piece of her time and love again. We weren't even close.",
            "title_similarity": "0.63884866",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hlddngm",
            "score": 1,
            "text": "My late grandma knitted me one scarf when I was a kid. A few years ago I looked for it and had to find out that my mom had thrown it away without asking for my permission. It hurts.",
            "title_similarity": "0.7661645",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hlddsck",
            "score": 1,
            "text": "Truth. I know this sounds weird, but with hand sewn gifts, whether they're embroidery, knitting, crochet, cross stitch, machine etc, you can feel the love the person had for you. You will reget getting rid of it.",
            "title_similarity": "0.72854584",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hlddvjh",
            "score": 2,
            "text": "Oh really? I always burn them and laugh in their face as their lovely heart-felt gift turns to ash. \n\nYour way is good too though! Thanks for sharing!",
            "title_similarity": "0.43006644",
            "sentiment_compound": 0.9611
        },
        {
            "id": "hlddx8z",
            "score": 1,
            "text": "My grandma knitted me slippers and they were the best things ever. Lasted for so many years.",
            "title_similarity": "0.6842754",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlde8b3",
            "score": 2,
            "text": "But not your brother or dad, cause fuck there knitting /s",
            "title_similarity": "0.55085486",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hlde8ev",
            "score": 1,
            "text": "The simple things in life are the best. You don’t need all the shit. Just people, love, smiles and memories",
            "title_similarity": "0.47146484",
            "sentiment_compound": 0.9477
        },
        {
            "id": "hldehzj",
            "score": 1,
            "text": "As a knitter and crocheter I wholeheartedly agree with this post! We put our love and creative energy into everything we make. If you're deemed \"knit worthy\" it's a big deal.",
            "title_similarity": "0.604176",
            "sentiment_compound": 0.9312
        },
        {
            "id": "hldej8o",
            "score": 1,
            "text": "I have a scarf my aunt made me right before she died. It's the closest thing I have to a hug from her. I would never throw it away",
            "title_similarity": "0.8131264",
            "sentiment_compound": -0.128
        },
        {
            "id": "hldek8g",
            "score": 1,
            "text": "I'm inclined to take photographs of sentimental items and then donate them. You still keep the memories, but you lose the clutter.",
            "title_similarity": "0.5194526",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hldeppp",
            "score": 1,
            "text": "My grandma knit me a blanket when I was a kid and I loved it then and still have it nearly 20 years later. So true.",
            "title_similarity": "0.65493864",
            "sentiment_compound": 0.8184
        },
        {
            "id": "hldes06",
            "score": 1,
            "text": "​swim include turn afraid quick ​require expect what trade winter",
            "title_similarity": "0.32847995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldf46k",
            "score": 1,
            "text": "So glad you said this!! I have comforters and crocheted throws my Gramma made for me. I look at them and realize again her love for me. As you get older things that may mean nothing to others are so important to keep. And tell your loved ones where it came from.",
            "title_similarity": "0.8001723",
            "sentiment_compound": 0.9481
        },
        {
            "id": "hldf5ax",
            "score": 2,
            "text": "Opposite view - If you want to forget about your family and move past the memory of them, make sure to get rid of anything connected to them!",
            "title_similarity": "0.47664112",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hldf5n6",
            "score": 1,
            "text": "Whenever I would facetime my mom she was making a blanket for me. When she passed away unexpectedly, the only thing I wanted out of all of her possessions was the unfinished blanket.",
            "title_similarity": "0.75465405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldf8sp",
            "score": 1,
            "text": "I’m currently knitting a cardigan for my daughter. Fingers crossed that she likes it and keeps it.",
            "title_similarity": "0.79396784",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hldf9m1",
            "score": 2,
            "text": "i haven't seen my grandmom since i was born (both of them actually) and both my granddads are dead sooo yh lol...",
            "title_similarity": "0.40189838",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hldfahv",
            "score": 1,
            "text": "This is so true, my mum passed 4 years ago and genuinely I'm wearing a jumper right now that she knitted for me 25-30 years ago. it reminds me of how much she loved me. It doesn't matter how old I get I still miss her so much.",
            "title_similarity": "0.7545849",
            "sentiment_compound": 0.7809
        },
        {
            "id": "hldfhtn",
            "score": 1,
            "text": "As a knitter and crocheter of 26 years I’ve told people this many times as far as blankets go-if someone knits/crochets you a blanket, they love you. They are time consuming and can become expensive to make. I’m talking with hooks and needles. Not the arm knitting.",
            "title_similarity": "0.7576846",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hldfp4o",
            "score": 1,
            "text": "My mom just started knitting, she's working on my Wu-Tang Christmas sweater now. I love you mom!",
            "title_similarity": "0.78879905",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hldft1u",
            "score": 6,
            "text": "My grandmother made me 2 blankets over the years. I always used them. She passed before I met my husband. Her blankets are his favorite we own. He uses them often and I always try to tell him a different childhood memory when he does. If it is a story I have already told sometimes he cuts in and tells the rest. He even tells the stories to our boys when they use the blankets. Now he says things like, \"I love this pink and white blanket Grandma made.\" It is almost like he knows her and I swear it keeps her alive in a way.",
            "title_similarity": "0.7298992",
            "sentiment_compound": 0.9023
        },
        {
            "id": "hldfz8r",
            "score": 1,
            "text": "As a knitter/crocheter, thank you!",
            "title_similarity": "0.57664794",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hldg5hp",
            "score": 1,
            "text": "I tell people to learn to make everything your mom cooks... No one will ever make it the same and you will miss it",
            "title_similarity": "0.7815582",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hldgg07",
            "score": 1,
            "text": "I have a wool scarf my grandmother knitted for my grandfather during WWII, for one of the coldest winters in recorded history. Then my father wore it and now it's mine. Both my grandparents passed away decades ago. We don't really get long or cold winters nowadays where I live, so I don't wear it that often anymore, but it's still in pretty good condition for an almost 80 year old scarf.",
            "title_similarity": "0.6895859",
            "sentiment_compound": 0.8462
        },
        {
            "id": "hldghw8",
            "score": 1,
            "text": "My grandma passed a decade ago, but the socks she knitted for me are still the most comfortable pair that I own today",
            "title_similarity": "0.73526466",
            "sentiment_compound": 0.7086
        },
        {
            "id": "hldgko0",
            "score": 1,
            "text": "Don't have a single picture with my grandma. She passed away a week ago. At least take pictures with them",
            "title_similarity": "0.49540332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldgo3a",
            "score": 1,
            "text": "my granda mused to knit. we have several bags of socks and mittens she made. she is gone now, but her pove keeps us worm even today",
            "title_similarity": "0.7814493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldgq5p",
            "score": 1,
            "text": "In my home office is the last item my mother made me before she committed suicide. It's an afghan that I proudly display on a chair in my background. \n\nAnytime that I miss her or want to talk to her, I sit in that chair and wrap myself up in it.",
            "title_similarity": "0.68534255",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hldgyut",
            "score": 1,
            "text": "That could really be said for anything your mom or your grandma makes you. Speaking from experience, one day, you won't have your mom or grandma anymore and you'll wish you still had that stupid scarf she she spent days making, or that painting she made next to you at paint night, or whatever it is. It was made with love and you can't put a price on that. Keep it forever.",
            "title_similarity": "0.8977393",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hldh147",
            "score": 1,
            "text": "I would like a blankie. I'm not even playing. Or a scarf or hat or even like a 1\" x 1\" soft thing. I've never experienced what you are saying so I'm trying to pick up what you are putting down with this wisdom but I can't.",
            "title_similarity": "0.5652633",
            "sentiment_compound": 0.5725
        },
        {
            "id": "hldhk9y",
            "score": 1,
            "text": "I have every blanket my mum has made me and I'll be damned if I get rid of any of them. One was the first she ever quilted and isn't perfect by any means. Each blanket demonstrates her growth in quilting over the years.  I've also kept any clothes she's made my kids and my grand babies will be wearing them down the line.  When my nan found out I was pregnant, she crocheted a gorgeous green cardigan and hat that was way too small as my daughter was larger than normal. But I kept it as it was one of the last things she was able to make. \nMy kids treasure everything that is handmade, regardless so quality or skill level. So much they have started to learn themselves. I wish I could sew but while I was born with the finger dexterity of a sloth, I have other crafty skills.",
            "title_similarity": "0.8161957",
            "sentiment_compound": 0.8339
        },
        {
            "id": "hldhqri",
            "score": 1,
            "text": "Especially blankets and quilts.  I ruined mine leaving them in treehouses and other spots when I was a kid… really wish I had that grandma square blanket now",
            "title_similarity": "0.65587693",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hldhwq8",
            "score": 1,
            "text": "Growing up my grandma would crochet these cute little handles w/ buttons onto kitchen towels.  We always had them in our house.  Before my grandma passed away, I made sure to ask my dad to have her crochet me some of her towels w/ handles.  I have them in my kitchen now hanging off of my fridge.  I don’t use them to wipe anything in particular, but I like having that small part of her with me.",
            "title_similarity": "0.77433646",
            "sentiment_compound": 0.7391
        },
        {
            "id": "hldhzw7",
            "score": 1,
            "text": "My grandma stitched my blanket I was gonna throw away. After that I never used a different blanket",
            "title_similarity": "0.7705288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldi11j",
            "score": 1,
            "text": "There was this shirt of my grand dad that I really liked. There wasn’t a single occasion I missed to compliment how good it looked on him. I’m about 20 years away in age to when I first saw it and liked it. My grand pa used to wear it on good days. When he was meeting special people or when he thought was a special occasion. He passed away like 10 years ago. I saw that shirt on him for 10 good years at least. It never faded, he did but the shirt didn’t. In his will he wrote me that shirt. Specially writing about where it will be if he passed away and who should own it. Me. \n\nI still do. I continued his tradition since then. It fit in the shirt. I wear it on my good days and special occasions. I have always felt his presence despite him gone for a good ole decade. \n\nOP is right. Hold on to those little things in life, that’s all you’ll have left sometimes to remember people who probably were better than us at many things but we never valued them. Y’all have a good weekend, I’ll find the person who has been chopping these onions.",
            "title_similarity": "0.5996758",
            "sentiment_compound": 0.987
        },
        {
            "id": "hldi1u1",
            "score": 1,
            "text": "Grandma died this year.\nBoth crocheted blankets from her, one from before the dementia when I was like 7 (I'm now 28) and one post diagnosisn (it was a mess, but inloved it) were both destroyed last year during our move into the new place.",
            "title_similarity": "0.58688104",
            "sentiment_compound": -0.765
        },
        {
            "id": "hldi5e4",
            "score": 1,
            "text": "I have a sweatshirt that both my brother and I got for Christmas 25 years ago from my grandmother. It had our names in it. I still have it. It is tight. I thought about getting buried in it because...ITS MY LIFE AND ILL DO WHAT I WANT AND I'LL BE DEAD BUT ILL RESPRESENT WHAT I LOVE IN LIFE. nuff said",
            "title_similarity": "0.7242949",
            "sentiment_compound": -0.1696
        },
        {
            "id": "hldi63e",
            "score": 1,
            "text": "Can confirm this is a good LPT.\n\nMy grandma died last year, but I still keep a Jesus crucifix pendant she gave me many years ago. I won’t ever throw it away, even though I am not religious any more.",
            "title_similarity": "0.74226767",
            "sentiment_compound": -0.09
        },
        {
            "id": "hldig8j",
            "score": 1,
            "text": "My grandma picked up crocheting so she could make Christmas present for her grandkids. I chose a throw blanket. She ended up have a stroke 4 months after giving it to me. It was the one and only gift she was able to make. I cherish it and my fiancée luckily understands the sentimentality. \n\nNow, she is still alive just handicapped. Whole right side is paralyzed. But she saw the blanket on my couch in my new home and cried Joyous tears that I kept it for the past 11 years. Of course I did Grandma, of course I did.",
            "title_similarity": "0.7445452",
            "sentiment_compound": 0.836
        },
        {
            "id": "hldince",
            "score": 2,
            "text": "Nice try Grandma",
            "title_similarity": "0.43028826",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hldinis",
            "score": 1,
            "text": "My Nan used to sew quilts for all of her grandchildren. Being that i am the youngest, I got mine last. It was the last one she ever made. They really do mean so much and you can get so much comfort from them. Hug your family, tell them you love them guys.",
            "title_similarity": "0.7872417",
            "sentiment_compound": 0.8773
        },
        {
            "id": "hldis42",
            "score": 1,
            "text": "My uncle kept trying to give me a hand made wallet. I thought it was ugly and knew I would never use it.  \n\nLet's talk about what I gave up vs what I liked. \n\nWhat I gave up as ugly.\nIt was leather hand stiched and engraved.\n\nWhat I had at the time. A nylon wallet with Velcro. \n\nMy point is I kick myself today for turning it down , I would have totally used it and loved it for a time, he would have loved to give it to me. (My current wallet style is a metal one) but I imagine that will change. I went through a few style changes over the years.",
            "title_similarity": "0.66218525",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hldit1w",
            "score": 1,
            "text": "I have a poncho that my nan knitted me before she died and I wear it ever year to festivals, it is my prized possession and it feels like I'm getting a hug from her every time I wear it",
            "title_similarity": "0.7489182",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hldj3xu",
            "score": 1,
            "text": "This is so true, I have 2 blankets that my mum crocheted  for me. She died unexpectedly 3 years ago and I now treasure them more than ever. I also have a delicate shawl she made the year before she died and when I wear it, it feels like a hug.",
            "title_similarity": "0.69166994",
            "sentiment_compound": 0.5293
        },
        {
            "id": "hldj5lg",
            "score": 1,
            "text": "And if someone leaves that special scarf at your place and you don’t give it back prepare for 10-minute musical retribution.",
            "title_similarity": "0.65217483",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hldj7bo",
            "score": 1,
            "text": "I've got a wooden stool my grandad made for me to sit at my small desk when I was little, I still have it and use it as a bed side table now, so glad I didn't throw it away like I was tempted a few times over the years as he's no longer with us.",
            "title_similarity": "0.6456268",
            "sentiment_compound": 0.6329
        },
        {
            "id": "hldjbvq",
            "score": 2,
            "text": "I dont think this is always the case. Some people have more of an ability to emotionally attach to objects than others. When my dad passed away I collected alot of his items that I thought would be important to me.\n\nI tried for a long time to make myself value those items a ton as memories of him. After a while I realized l just did not care about a bunch of inanimate objects. None of those things brought me any real connection to him",
            "title_similarity": "0.5557626",
            "sentiment_compound": 0.7299
        },
        {
            "id": "hldjkc5",
            "score": 1,
            "text": "I have about 5 jumpers my grandma knitted me before she passed a few years ago. We called them Dora originals, her signature on any garment was a massive random hole in any part of the jumper (could be next to the neck hole, under the armpit, or just lots and lots of little holes all over the place). I still wear them every Christmas holiday, I’m so glad I kept them! \n\nThe porcelain dolls she used to give us however, they didn’t last long!",
            "title_similarity": "0.7361443",
            "sentiment_compound": 0.7634
        },
        {
            "id": "hldjo1p",
            "score": 1,
            "text": "Keep the damn oven mitts Michael",
            "title_similarity": "0.376476",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hldjq6g",
            "score": 1,
            "text": "You are absolutely right. Mum died suddenly, and OMG that left a hole.",
            "title_similarity": "0.52020115",
            "sentiment_compound": -0.5945
        },
        {
            "id": "hldjw9e",
            "score": 1,
            "text": "One of the blankets my grandma made I used as a burial shawl for my childhood cat. He lived for 17 years and it was his favorite blanket. I have literally all the rest though, she knitted alot. Never made clothes sadly.",
            "title_similarity": "0.7025758",
            "sentiment_compound": 0.6522
        },
        {
            "id": "hldk2c7",
            "score": 1,
            "text": "The only thing that made it through the Great Purge unscathed for our intercontinental move was my collection of knits made by my mother and grandmother.\n\nOne of the most precious things I have is a tiny bit of knitting my grandmother made while in the Alzheimer's ward of her nursing home. She obviously was struggling but she was still there enough to understand I was pregnant with a baby boy and she started trying to make him an afghan. She died two weeks before he was born.",
            "title_similarity": "0.77550983",
            "sentiment_compound": -0.4124
        },
        {
            "id": "hldk582",
            "score": 1,
            "text": "Yeah, then when you get old and die, you can pass those things to your children who are now burdened with a pantry full of unused linens they feel guilty about using or throwing out, so they just sit around, taking up room and collecting dust. True story.",
            "title_similarity": "0.65632904",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hldk68h",
            "score": 1,
            "text": "True! I have several socks from my grandma and never worn them till this winter. They are superb and keep me warm like nothing other can do! Really appreciate it and is a good reminder to my lovely work my grandma did.",
            "title_similarity": "0.80308056",
            "sentiment_compound": 0.97
        },
        {
            "id": "hldk824",
            "score": 1,
            "text": "I still have my blankets my Grandma made me. I feel sad that one is always shoved into a closet, but I can’t bear the thought of getting rid of it.",
            "title_similarity": "0.7548861",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hldklao",
            "score": 1,
            "text": "My grand mother hand quilts. She made a quilt for one of my cousins. His wife threw it away bc she didn’t like the colors… makes me so mad and sad for my grandma.",
            "title_similarity": "0.66801226",
            "sentiment_compound": 0.0567
        },
        {
            "id": "hldkqmd",
            "score": 1,
            "text": "This is a good one. I’ve got a grandma and 2 aunties that all the do is knit and crochet when they’re together. Which is all the time at the moment because they’re living in the same house. One of my aunties is so bored she’s just itching for something to do. \n\nI mentioned it would be cool to have a bobble hat because it’s getting colder now. 2 days later without even asking, there’s a lovely bobble hat waiting for me. \n\nThink I might request a scarf next…",
            "title_similarity": "0.86294675",
            "sentiment_compound": 0.7398
        },
        {
            "id": "hldkxov",
            "score": 2,
            "text": "*or grandpa or dad",
            "title_similarity": "0.23844379",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldkyiw",
            "score": 1,
            "text": "My dad made furniture. Its old fashioned and enormous, but we cherish it. My daughter will inherit it and i hope she will pass it down. He was a true craftsman and we remember him daily because we love the art he left to us.",
            "title_similarity": "0.6515012",
            "sentiment_compound": 0.9592
        },
        {
            "id": "hldl06t",
            "score": 1,
            "text": "My grandmother passed 22 years ago. I still have the throw she knitted for me when I was a kid.",
            "title_similarity": "0.635141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldl0rc",
            "score": 1,
            "text": "When my grandpa was in a nursing home toward the end of his life, he used to take old hangers and cover them with yarn. Made them more colorful and thicker to avoid your shirts from getting obvious bumps in the shoulders that you’d get from just a wire hanger. \n\nI didn’t see the point of them, but he made them in the colors of the local high schools and the local college and pro sports teams.  People (other patients, staff, volunteers) paid him small amounts of money for his hangers and it also occupied his time. \n\nAgain, I never saw much use for them back when he was making them 20+ years ago, but now I have 5 of them in my coat closet and I think of him and smile every time I use one.",
            "title_similarity": "0.70918673",
            "sentiment_compound": 0.3919
        },
        {
            "id": "hldl5ys",
            "score": 1,
            "text": "To add to this, if you don't like it quietly donate it, or just tuck it away.\nDon't be like an ex friend of mine and tell them you tore up and threw away the blanket that they spent hours making.\n\nA few months after I gave it him he decided to tell me that the blanket he'd asked for and picked all the yarn and pattern for wasn't actually something he liked, and only pulled out when I visited, then got fed up of it and considered setting fire to it but couldn't because he was in a flat, so tore it up and threw it instead because it \"wasn't good enough for the homeless\"\nIt was a king-size giant granny blanket in various shades of blue 100% merino wool, my tension was as perfect as it had ever been, the ends were properly darned in (my most hated part of projects) I'd basically poured my heart and soul into it because he'd told me he really wanted it, and that the small throw I was working on that I'd left behind by mistake when I was visiting for a weekend made him feel loved. I'd already told him if he didn't like it I'd happily have it back and use it myself cos I'd fallen in love with it while making it. Pretty sure he only told me to upset me the most because I kept refusing to he upset during the argument. That was 4 years ago, and I'm STILL bitter and hurt. There's a reason he's an ex friend.",
            "title_similarity": "0.6534478",
            "sentiment_compound": -0.1465
        },
        {
            "id": "hldldod",
            "score": 1,
            "text": "Not quite the same, but I keep my possessions as lean as I can, no junk, but I'll still keep every nik nak my mum buys me",
            "title_similarity": "0.7113386",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hldldqt",
            "score": 1,
            "text": "This sounds like a really good advice. Thanks.",
            "title_similarity": "0.18932888",
            "sentiment_compound": 0.8341
        },
        {
            "id": "hldlf58",
            "score": 2,
            "text": "What if my Grandad knitted it?",
            "title_similarity": "0.54177976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldlih0",
            "score": 1,
            "text": "My grandma crotched me a large blanket. As a kid I just thought of it as nothing much, a regular blanket, but I kept it. Now, I have a kiddo of my own and we wrap up in the blanket and I tell him about my grandmother and how much she would have loved him. We pick out our favorite squares and talk about everything and nothing.",
            "title_similarity": "0.80843115",
            "sentiment_compound": 0.8847
        },
        {
            "id": "hldlqe7",
            "score": 1,
            "text": "I'm a crocheter(is that even a word?) I've always kind of regretted giving away some of the cooler stuff I've made but it makes me happy to know people do treasure them as much as I would.",
            "title_similarity": "0.7672342",
            "sentiment_compound": 0.8226
        },
        {
            "id": "hldlwkv",
            "score": 1,
            "text": "I still have the scarf my mom was in the MIDDLE of making when she was killed. It still has the hooks in it and everything. I'll never get rid of it.",
            "title_similarity": "0.7505233",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hldlxx4",
            "score": 1,
            "text": "My grandma crocheted me a bedspread out of tobacco twine that was left over from the tobacco crop one year. Kept it in my cedar chest because I was afraid  my steroids would ruin it. I went to get it out one day and it was gone. I asked the wife where it was and it was wadded up in the trunk of he old car where she used it as a fishing blanket. After my mini stroke went away I  went to get it and it was covered in grease, had holes tore in it and was just destroyed. Marriage didn't last 6 months after that. Bitch didn't care or respect bothing.",
            "title_similarity": "0.68001455",
            "sentiment_compound": -0.9431
        },
        {
            "id": "hldm2i8",
            "score": 1,
            "text": "And if you get a chance, make sure to write down your favorite recipes.  My mom died when I was in college, and that was one thing I hadn't gotten a chance to do.\n\nI'm trying to recreate her dressing/stuffing recipe this year.",
            "title_similarity": "0.75052017",
            "sentiment_compound": 0.2406
        },
        {
            "id": "hldm2q2",
            "score": 1,
            "text": "My father is 80. He wears this crocheted hat that is blue and red. Kind of ugly. My grandmother made this for him when he was a kid. This thing had to be about 70 years old and has been through hell but he loves it. It’s something his mother made for him. It’s something I asked for in his will. It’s something me and my sister might fight over. It’s that important to us all.",
            "title_similarity": "0.7425398",
            "sentiment_compound": -0.0635
        },
        {
            "id": "hldmhem",
            "score": 1,
            "text": "Yes and if 50 Cent makes you one, don’t just say “G U-nit?!” And put it in a box.",
            "title_similarity": "0.28998274",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hldmqeg",
            "score": 1,
            "text": "Yeap I agree. I have a shawl (pashmina) that mum gave me about 20 years ago, it is always  in the car with me and goes travelling with me. Would trade it in for anything ❤️",
            "title_similarity": "0.6171545",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hldmxlb",
            "score": 1,
            "text": "I wish I kept mine.\nI thought I'd just ask my grandma to make another one for me the following year, but she got dementia and started declining.\n\nI was devastated.  I wish I never threw it out.  Grandma died 4 months ago.",
            "title_similarity": "0.6157048",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hldn05v",
            "score": 1,
            "text": "My mum did some cross stitch until her eyes got too bad and then she taught herself how to crochet. She went to a crochet group once a week and It was all women of various ages. They ended up calling the evenings  “Stitch and Bitch Night”. She had a really great time with those girls until she got too sick to go and then passed away. I have a lot of the things she made and I can’t part with any of them. Her crochet pieces were “full of mistakes” as she said but they were all made lovingly by her two hands. I’m so grateful to have them as a reminder of her.",
            "title_similarity": "0.76374006",
            "sentiment_compound": 0.8749
        },
        {
            "id": "hldn4b8",
            "score": 1,
            "text": "My grandma made me a little cloth travel bag for jewelry but I use it now for my IVf meds and needles. She passed last year and it’s cool to have her feel so close to me as I try to make her great grand child.",
            "title_similarity": "0.788303",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hldn4v5",
            "score": 1,
            "text": "My dad started crocheting when he got sick and didn't have enough energy to be his usual active self. He crocheted many things for me. I love them all. I miss him so much.",
            "title_similarity": "0.6222104",
            "sentiment_compound": 0.2928
        },
        {
            "id": "hldna8e",
            "score": 1,
            "text": "Ah man, bought a tear to my eye. Back in the day my mum knitted me a oversized black jumper that completed my grunge look, was well know for it, it got stolen by a couple girls ( a friend's sister and her friend, good looking girls) who would take turns wearing it !! Eventually got it back but man that was so long ago now. Don't have that one but I do have a blue one my mum knitted that is folded up at the very bottom of my wardrobe. Never wear it but I will have it forever, unlike my mum who passed away coming up 15 years ago. Love ya mum ❤️",
            "title_similarity": "0.803219",
            "sentiment_compound": 0.8715
        },
        {
            "id": "hldnhm4",
            "score": 1,
            "text": "I use the old quilt my grandma made me as a Christmas tree skirt every year.  The quilt is definitely everyday-use, nothing particularly fancy, but I think my dad gets a kick from seeing it as part of an integral family tradition.",
            "title_similarity": "0.78992665",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hldni6i",
            "score": 1,
            "text": "I finally have a story to match a LPT, haha. \n\nMy mother loves to crochet. She's been doing it since I was a baby. I grew up with crochet blankets, so they've never been impressive to me. \n\nI started dating a wonderful Chinese girl and she's never known crochet in the western sense. When my mother came to visit, she brought a crochet blanket in my girl's favourite colours. The waterworks started and I've never seen someone so grateful for the hours of work in my life. To this day, my girl says it's the best gift she's ever received. She carried it around for months almost like a baby does a security blanket. Now, every winter, it's the first thing she pulls out. To her, it represents love. \n\nThey adore each other and I think that blanket solidified their amazing relationship. If I tried to toss it out, I'd be in the bin first. It truly is irreplaceable.",
            "title_similarity": "0.8308854",
            "sentiment_compound": 0.9897
        },
        {
            "id": "hldnj7c",
            "score": 1,
            "text": "Even if you never use it, your puppers or kitty might love it!",
            "title_similarity": "0.58388424",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hldno4e",
            "score": 1,
            "text": "I still have all the beautiful wool sweaters my immensely talented grandma knitted me. Sometimes i just take them out of my closet to look at them and they make me feel happy.",
            "title_similarity": "0.7559331",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hldno5c",
            "score": 2,
            "text": "Bold of you to assume I have any of those.",
            "title_similarity": "0.172613",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hldnoi3",
            "score": 1,
            "text": "My mums crochet blankets are cool",
            "title_similarity": "0.5852679",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hldnpuv",
            "score": 1,
            "text": "Oh man.\n\nMy mom knit me this giant, loud red sweater covered in cocker spaniels. She was so proud of it. It fits me horribly; makes me look about 20lbs heavier and is just not flattering. \n\nAt her funeral, I wore it proudly.",
            "title_similarity": "0.73284614",
            "sentiment_compound": 0.185
        },
        {
            "id": "hldnpzs",
            "score": 1,
            "text": "Growing up poor. This was a clear indication of it. My pride got in the way. I threw them all away. I’m an idiot.",
            "title_similarity": "0.41643715",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hldnyyg",
            "score": 1,
            "text": "I still have socks and mittens my grandma knitted for me. She died 20 years ago, more than 90 years old. She kept knitting till the end, although she was almost blind. Her mittens with a separate thumb and Index finger are my most precious piece of clothing.",
            "title_similarity": "0.7497386",
            "sentiment_compound": -0.2533
        },
        {
            "id": "hldo1cr",
            "score": 1,
            "text": "All the stuff my mom made me is still with me.\n\nThey are all one of a kind",
            "title_similarity": "0.56482506",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hldo224",
            "score": 1,
            "text": "Truth. My mom used to knit sweaters. She would make them for her grandkids, but never for her kids. \n\nShe made a sweater for my son. It was made of something that would keep someone in the arctic warm, with no other clothing. We lived in Cali. He never wore it. \n\nFast forward, she had made a sweater for herself, but didn’t like how it fit her, so she asked if I wanted it. I accepted it. \n\nIt sat in the closet, because it’s ugly. Seriously, it’s ugly. \n\nBut then, Ugly Sweater parties became a thing. I wore that sweater and I won contests. Mom was so proud!",
            "title_similarity": "0.798722",
            "sentiment_compound": 0.853
        },
        {
            "id": "hldoe5x",
            "score": 1,
            "text": "That’s so true. When I was a kid my mom spent all this time making a ….hmmm….what was it. Dang, I lost my thread",
            "title_similarity": "0.63757044",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hldoswk",
            "score": 1,
            "text": "I wear my slippers my grandma knitted me years ago every day when it gets cold out. She’s even has to repair them a few times which made her happy because she knows I wear them.",
            "title_similarity": "0.7843501",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hldox6t",
            "score": 1,
            "text": "I still have a few blankets my grandma knitted me from when I was a kid, including the first one she made me. But the ones that mean the most? During the last couple years of her life she lost a lot of mobility and almost all of her sight but she took up knitting again as something to do. The little things she knitted were so crooked and full of gaps, we all had a good time with them, including her. She actually did get a little better knitting blind. So all these little squares that look like someone's first time knitting are the things that my sisters and I cherish the most.",
            "title_similarity": "0.7835343",
            "sentiment_compound": 0.8319
        },
        {
            "id": "hldoze6",
            "score": 1,
            "text": "Yep.  My mom made a little knit cap for my future grandchild knowing she might not be here when my grandchildren were born. Mom passed 7 years ago but she lives on every time I see my granddaughter in that cap.",
            "title_similarity": "0.7722472",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hldp1ti",
            "score": 1,
            "text": "I lost my grams in February right before the vaccines started to become available. We always had a special bond, I was closer with her than most any other relative. Ever since I could remember she would knit me sweaters and hats and scarves.. Ever since i can remember those things she made weren't 'cool'. \n\nI'm thankful because my grams also knit blankets and during covid while she was all alone, she really went all out making blankets for people. I think it's the only way she felt she could help.\n\nFor Christmas (I was kinda broke this year vs other years) I ordered on eBay a 'lot' of yarn. It had all kinds of colors and was like 50 half used balls of yarn (for like $20.. yarn is real expensive people.. Those Grandma blankets aren't as cheap to make as you think) with all kinds of colors and styles of yarn. For my birthday (end of January) she gave me 'the biggest blanket' she ever made, for her 'favorite (only) grandson'.  It was really cool and colorful and kinda looked like vapor-wave on accident because of the colors she used.\n\nBy my sister's birthday at the end of February, grams had passed. The last time we visited her I got to tell her that I had a baby boy on the way (got a real look from my dying grams since I don't even have a girlfriend let alone wife lol).\n\nNow that I have a 4 month old and I'm a single dad.. my priorities changed quickly. Damn I wish I kept a scarf or a hat or something i can give to little Elliott to wear (and hate lol) himself someday.. but grams prepared me for this by knitting me that huge Beautiful blanket that I do have and can give to my son someday.\n\nGreat LPT op.",
            "title_similarity": "0.8156115",
            "sentiment_compound": 0.9554
        },
        {
            "id": "hldp2r9",
            "score": 1,
            "text": "I bought one that I pretend is from a family member.",
            "title_similarity": "0.4681795",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hldp3tz",
            "score": 1,
            "text": "I had a pillow my grandma gave me with my name on it, the name was spelled with an extra n but I didn't care, I loved it. I loved it so much as a child that I wore it out and it died, I was so sad when it could no longer be repaired.",
            "title_similarity": "0.73310107",
            "sentiment_compound": -0.9477
        },
        {
            "id": "hldp7uu",
            "score": 2,
            "text": "Unless mom is narcissistic and you have a shit ton. Goodwill to the rescue",
            "title_similarity": "0.5978339",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hldp8b3",
            "score": 1,
            "text": "Back in high school, I knitted a scarf for my first serious boyfriend. Later on, we broke up in a not so amicable way and I started dating the person who I am now married to. After a few years I reconciled with my ex. \n\nFlash forward to about a decade since the ex and I had dated, my husband and I host a get together with my group of old gaming friends, which included my ex. He wore the scarf I knitted him from a decade ago. It was weird, but I tried to brush it off. Then my husband made a comment about how he knew that was a scarf I knitted (and was perfectly cool with it, but thought it was weird to own something an ex gave to you a decade later).  Even our friends pointed out how awkward it was.",
            "title_similarity": "0.66555697",
            "sentiment_compound": 0.891
        },
        {
            "id": "hldpa19",
            "score": 1,
            "text": "Try and get her into doing blankets",
            "title_similarity": "0.42334765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldphgn",
            "score": 1,
            "text": "Not scarfs but my mom and grandmother both made quilts. Some are a pattern others are a mess of material with no rhyme or reason. I have around 7 or 8 quilts that I cherish. \n\nMy mom has been gone for 18 years. Having these quilts is indeed something special. Can't explain but it can feel like being a kid again when you would get tucked into bed. I know weird but something nostalgic about the quilts. Much like music and food feels.",
            "title_similarity": "0.72080505",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hldpjmf",
            "score": 1,
            "text": "What a good pro tip, usually i throw every gift away that i get.",
            "title_similarity": "0.45084065",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hldplvq",
            "score": 1,
            "text": "I have a woven wool blanket handmade in the early 1900s by (unknown) family members and was given to my great grandfather when he immigrated ALONE. \n\nAs a kid I hated this blanket and thought it was smelly, musty, and old. Now I look at it and think about how far that blanket came, and what a comfort it must have been throughout all his travels.",
            "title_similarity": "0.66201186",
            "sentiment_compound": -0.0857
        },
        {
            "id": "hldptg4",
            "score": 1,
            "text": "Is this even a common thing anymore?",
            "title_similarity": "0.11361169",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldpzrs",
            "score": 1,
            "text": "My grandma knit me a Star trek fleet uniform sweater one year,  she asked what I wanted and I had been looking for a classy discreet fleet pattern sweater so I asled if she'd make me one.\n\nHer hands cramped the entire time she made it and I believe it's the last thing she ever knit anyone before her health turned and she passed.\n\nI should really wear that sweater more often.\n\nClassic, \"I don't want to ruin it\" syndrom has kept it in the closet.... \n\nThis thread has me realizing I should wear it far more often.",
            "title_similarity": "0.8443933",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hldq28a",
            "score": 1,
            "text": "Man, this hurts my heart. Just lost my grandpa in a fucking terrible way (he missed my grandma) my grandma has been gone awhile. Even tho i always loved the stuff she would make me, now im really missing this blanket. She made me a quilt for my 11th birthday. Its a bunch of hearts and each heart says something about me in it. Birthday, accomplishments, things she loves about me. Just the sweetest thing anyone has ever done for me. I have it somewhere still im pretty sure. Im about to go find it. Love the people that love you, because they will be gone sooner than you think.",
            "title_similarity": "0.800138",
            "sentiment_compound": 0.9742
        },
        {
            "id": "hldqb5i",
            "score": 1,
            "text": "This is so right. When I see crocheted things that have been donated to a charity shop, I always feel sad how much time and love had been put into making it.",
            "title_similarity": "0.6609498",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hldqfdj",
            "score": 1,
            "text": "I have a crochet n7 hat from my cousin. She did a good job with it. Sadly it does not get cold enough in Georgia to wear it.",
            "title_similarity": "0.7681741",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hldqrqa",
            "score": 1,
            "text": "I see this all the time. I buy this amazing home made stuff at garage sales every week. It is sad how people put such little value on these homemade treasures but if they are going to offer them up I'll be glad to buy them.",
            "title_similarity": "0.69610584",
            "sentiment_compound": 0.7994
        },
        {
            "id": "hldr3zv",
            "score": 1,
            "text": "My grandmother crocheted and I had always wanted to learn. In my mid 20s I decided to start watching YouTube videos and figure it out. I told a friend that I was learning and she goes \"ew why would you want to do that? Please never make something for me or any of my future kids.\" Shortly after that, I realized she actually wasn't my friend and I was just convenient for her until she made her new friends. Everyone else in my life had been really supportive.",
            "title_similarity": "0.76818085",
            "sentiment_compound": 0.8301
        },
        {
            "id": "hldrfw0",
            "score": 1,
            "text": "give me the fucking app name",
            "title_similarity": "0.11569043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldrh3j",
            "score": 1,
            "text": "This is so true. In hs my g-mom got me a power rangers shirt. At the time I was pissed. When she died I wore it to the gym for about 5 years ripped and destroyed. It was sad when it went out of commission…",
            "title_similarity": "0.56895316",
            "sentiment_compound": -0.8881
        },
        {
            "id": "hldrmya",
            "score": 1,
            "text": "Yep. I’ve donated stuff that I’ve made after not using it anymore, but never something that my mom crocheted for me.",
            "title_similarity": "0.7163496",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hldrnkm",
            "score": 1,
            "text": "When I was kid my mother made me a jumpsuit out of 70s courderoy printed couch material.  \n\nI'm glad I didn't keep that.",
            "title_similarity": "0.681415",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hldrohk",
            "score": 1,
            "text": "My grandma would knit wool socks for my family every year for Christmas. We lived in the states and my grandma and family lived in Germany. We'd wait for the package every year. I never appreciated them much when I was a kid, always more into the chocolate they'd send us instead. Now I have a drawer full of these wool socks, wear them all the time, and my grandma passed away last year. She left me the last pair she ever made that she had trouble making in her final year. My mom ended up helping her finish this pair. I couldn't wear them for the longest time but eventually decided to because that's what she'd want. I love these socks and appreciate them immensely now. They last do long. I have pairs that she gave me as a kid still. Hopefully they all last me many many years more.",
            "title_similarity": "0.76455295",
            "sentiment_compound": 0.9224
        },
        {
            "id": "hldrw29",
            "score": 1,
            "text": "my grandma's scarves always smelled my like my grandpa's cigars.  i miss that smell.",
            "title_similarity": "0.5900353",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hldrzou",
            "score": 1,
            "text": "I wish I knew this earlier in my life. When I was a kid, my grandma used to crochet things. Scarves. Gloves. Afghans. And at the time. I couldn’t care less. Never kept track. Now that I’m older, and she’s since passed away, I wish I had all those back. In retrospect, they were so awesome. And she worked so hard to make them for me.",
            "title_similarity": "0.83751994",
            "sentiment_compound": 0.9182
        },
        {
            "id": "hlds0a6",
            "score": 1,
            "text": "As someone that knits and crochets I don't normally make stuff for my children and grandchildren since I don't have any. Hopefully my friends keep their stuff I made because it still took me 7,983 hours to make that blanket.",
            "title_similarity": "0.7447071",
            "sentiment_compound": 0.2124
        },
        {
            "id": "hlds5xo",
            "score": 1,
            "text": "A very sweet old lady that worked as a receptionist at one of my first jobs driving forklift for a cold storage place knitted me a scarf. She asked everyone else and no one else wanted one so she was so happy to make me one. I still have it and wear it 10 years later.",
            "title_similarity": "0.76516557",
            "sentiment_compound": 0.7804
        },
        {
            "id": "hldsj1q",
            "score": 2,
            "text": "What's up with people posting stuff that's not even a life pro tip?",
            "title_similarity": "0.30947128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldskx9",
            "score": 1,
            "text": "I’m always so nervous when my kids where their mittens to school. they tend to lose things. My grandma made them for me when I was a kids and they’re literally irreplaceable.",
            "title_similarity": "0.6521472",
            "sentiment_compound": -0.6642
        },
        {
            "id": "hldsohp",
            "score": 1,
            "text": "I’m 33 and just taught myself to crochet in the last lockdown. I’ve made a baby blanket for my good friend who is pregnant with her first baby and I am starting on a second blanket for another friend. Reading this I’m going to make my 14 and 9 year old something as a keep sake.",
            "title_similarity": "0.7389267",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hldsxk8",
            "score": 1,
            "text": "Save it for the apocalypse",
            "title_similarity": "0.26287338",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hldsy85",
            "score": 2,
            "text": "No thank you\n\nI don't keep all the shit in my house all my life that people give me.\n\nYou don't need to keep everything people give you... Live your life",
            "title_similarity": "0.6046773",
            "sentiment_compound": 0.4386
        },
        {
            "id": "hldt2v7",
            "score": 1,
            "text": "My mother knitted a big ass woolen scarf.\nThe colours are still not my thing but after wearing it a few times it softens up and is my go-to scarf, even when it's waaaay to big.\n\nI cherrish that scarf now even more as one of the few physical reminders I have from my mom after she passed away.",
            "title_similarity": "0.84566855",
            "sentiment_compound": -0.3071
        },
        {
            "id": "hldta57",
            "score": 1,
            "text": "I made the worst looking blanket in the world recently for a friend… he absolutely loves it. Homemade gifts usually last many many years with minimal maintenence and most blankets don’t need to be handwashed either, just throw it in with not boiling hot water and you’re good to go!",
            "title_similarity": "0.7692201",
            "sentiment_compound": 0.474
        },
        {
            "id": "hldtbla",
            "score": 1,
            "text": "Guy got one of those random care packages from a church group or somewhere while on deployment. Inside was a knitted cap. He was going to throw it out so I snagged it off of him. I still wear it all the time in the winter. The idea that someone took the time out of their life to knit that for you, a complete stranger, and you just throw it out never sat right with me. Whoever it was that knitted that cap, just know it’s got an appreciative home.",
            "title_similarity": "0.70589423",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hldto1m",
            "score": 1,
            "text": "This definitely hits home for me. This year I lost my grandma and my mom in one week. My mom and I weren't always on the best terms, especially following my parents' divorce, but in her later years we became very close. She called me on a Wednesday morning and had passed away from COVID in her sleep at home by the afternoon.\n\nI had asked her to knit me a scarf out of orange and black yarn, as I am a life long Naruto fan. I always wanted her to knit me a scarf so I could always have her with me, even if we were miles apart. She always promised me she would, but she was so busy with taking care of others and her puppy that it seemed like she never had enough time.\n\nAs my girlfriend and I cleaned out her house I found the scarf in a cabinet, completed. Don't know what I would do without it.",
            "title_similarity": "0.79350615",
            "sentiment_compound": 0.9481
        },
        {
            "id": "hldtpg3",
            "score": 1,
            "text": "And you keep my old scarf from that very first week…",
            "title_similarity": "0.5537638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlduawx",
            "score": 1,
            "text": "I haaaaate the ugly scratchy Afghan my mom made but I’ve held onto it for 20+ years. If it were softer I’d use it. \n\nI made a baby blanket for my daughter before she was born, nothing crazy just soft fleece on one side and satin on the other and some edging to match the rest of the nursery. She became so attached to it that I had to make a smaller travel version that’s like 12” x 12”. \n\nBig silky and baby silky are their names. She’s almost 7 and still needs one or the other. On her first day of kindergarten i found baby silky hidden in the bottom of her book bag 🥲",
            "title_similarity": "0.76190937",
            "sentiment_compound": 0.5653
        },
        {
            "id": "hlduohy",
            "score": 1,
            "text": "Have a man afghan my grandma made. It’s been in plastic for more than 15 years. I suppose I should break it out, she always liked us to use them.",
            "title_similarity": "0.641613",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hlduydn",
            "score": 1,
            "text": "I've got a super tiny sweater in the closet with the first letter of my name my late aunt knitted me when I was 2. Can confirm.",
            "title_similarity": "0.6978891",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hldv018",
            "score": 1,
            "text": "I still have the knit cap my Nana made for me when I was 16. That was more than 40 years ago now. One of my most treasured gifts...",
            "title_similarity": "0.6522006",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hldv25n",
            "score": 1,
            "text": "My grandma knitted all 4 of her kids blankets and started on knitting blankets for the grandchildren. She passed away before she was able to make me one. I cried and mentioned how I was never going to get one now. My aunt gave me hers. I love my grandma and my aunt.",
            "title_similarity": "0.7858616",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hldvb4o",
            "score": 1,
            "text": "I have a Grandmum that's given me several quilts. I can't put them out because my pets will destroy them but I will take them out and hug them just to feel something she worked on close to me. I miss her everyday 💗",
            "title_similarity": "0.8062935",
            "sentiment_compound": 0.8705
        },
        {
            "id": "hldvs4p",
            "score": 1,
            "text": "fuck me lpt has gone to shit",
            "title_similarity": "0.09140845",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hldvvd1",
            "score": 1,
            "text": "My mom passed 11 years ago, but I have everything she crotched and/or knitted for me. When I am feeling particularly down, I wrap myself in a beautiful crochet afghan blanket she made for me and I can still feel her love.",
            "title_similarity": "0.7762916",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hldw0mq",
            "score": 1,
            "text": "Ive felt that way about almost anything that someone made for me.",
            "title_similarity": "0.3605589",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldw2ch",
            "score": 1,
            "text": "My grandma saved our worn out clothing and used them to make a blanket for each of us grandkids. I love it—-it’s like a map of my childhood.",
            "title_similarity": "0.76342833",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hldwhpd",
            "score": 1,
            "text": "100% this is something that should never be ignored",
            "title_similarity": "0.25135815",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hldwja2",
            "score": 1,
            "text": "Really wish i would have taken care of mine. My grandmother's gave me a few nice blankets that were really old. Didn't match my room or couch but in a way it all worked cause nothing matched. I let dogs and rats ruin it while i was kinda depressed. Really wish i would have taken care of the house better",
            "title_similarity": "0.695066",
            "sentiment_compound": 0.7601
        },
        {
            "id": "hldwz2u",
            "score": 3,
            "text": "I make quilts and I don't gift them to ungrateful people I know even though they expect me to.",
            "title_similarity": "0.6640304",
            "sentiment_compound": -0.6604
        },
        {
            "id": "hldx56h",
            "score": 2,
            "text": "But if my dad crochets me a hat it should go right in the trash",
            "title_similarity": "0.6065527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldx7n1",
            "score": 1,
            "text": "I’m a knitter and for a while my son was at the age where he didn’t want a hand knit sweater.  He finally asked me if I could recreate the Kurt Cobain unplugged cardigan.  I ordered an alpaca blend yarn, I’ll have it done for his birthday in February.",
            "title_similarity": "0.6656815",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hldxa6f",
            "score": 1,
            "text": "Thanks, I needed that :-) Crocheting mom",
            "title_similarity": "0.68053484",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hldxa7u",
            "score": 2,
            "text": "But if your dad or grandpa knits you something you had better toss it, eh?",
            "title_similarity": "0.6582134",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hldxc8z",
            "score": 1,
            "text": "Oh my goodness every comment is either so good and heart-warming or really sad like I'll be dead by emotions in a hot minute",
            "title_similarity": "0.412156",
            "sentiment_compound": 0.2087
        },
        {
            "id": "hldxih2",
            "score": 1,
            "text": "When I was about 14, living with my father I found hidden in a cupboard this huge, gorgeous, thick grey cardigan. I immediately assumed it was shop bought and expensive because it was heavy, and the knitted patterns were so insanely intricate. It had different textures and knitting styles, from ribbing to woven, basic stockinette and cable stitches and it was just gorgeous.\n\nAsking my dad about it, he said it once belonged to my grandfather who had passed very recently at this point. I was blown away when he explained my grandmother hand knitted it for him, a good 20 years ago. By this point they'd been divorced for years, but my nan always popped around regardless, bringing him meals on Sundays and just caring for him in general so they always had a love together that never faded.\n\nI'll keep it forever, always in my travels it'll be with me. The love and time given into it from my nannas hands, and how it represents the respect and love she still held for my grandpa always, despite how their relationship ended.\n\nAnd when I do wear it on special occasions, I feel the hugs that I missed out on from my grampa too.",
            "title_similarity": "0.6734684",
            "sentiment_compound": 0.9924
        },
        {
            "id": "hldxjip",
            "score": 1,
            "text": "My coworker talked about how all the kids in her family got a crocheted blanket when they were born from their grandma. But, grandma has passed away with a new one without a blanket. I asked what the girl’s fav colors were (she was like 3-4), and she said pink, yellow, and white. It just so happened I had just finished a blanket in those colors! I love crocheting for people and hope they treasure them.",
            "title_similarity": "0.8083084",
            "sentiment_compound": 0.9682
        },
        {
            "id": "hldxozz",
            "score": 2,
            "text": "What if my dad knits me a scarf, you sexist git?\n\n/s ;)",
            "title_similarity": "0.638798",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hldxzek",
            "score": 1,
            "text": "I have three afghans my grandmother made me.  They are different sizes because she made me one when I was in 5th grade, 8th grade, and 12th grade.  I still use the largest one ( it's in my high school colors and she made it for me for graduation ) and my kids use the two smaller ones.  My grandma recently had a heart attack ( she's 79 ) and when I went to visit her all the pictures of my kids in her house were the ones I sent with my kids using the afghans she made.  I will keep them forever.",
            "title_similarity": "0.71943176",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hldy190",
            "score": 1,
            "text": "I knitted my dad a pair of socks close to 30 years ago.  He died in April, and when my husband and I cleared out his house, I found the socks on his bed - so he’d obviously still been wearing them.",
            "title_similarity": "0.5880752",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hldyjir",
            "score": 1,
            "text": "My grandma used to knit and crochet, and my mom always kept everything. She died about 8 years ago and we still keep the things she made for us in the family. Now I live with my brother and we use the crocheted carpets she made for the family :)",
            "title_similarity": "0.7646145",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hldync0",
            "score": 2,
            "text": "Can I get one of those grandmas or mom's? Mine only gave me crippling CPTSD and depression, I would like a refund.",
            "title_similarity": "0.62749904",
            "sentiment_compound": -0.296
        },
        {
            "id": "hldyufs",
            "score": 2,
            "text": "i love how it says \"grandma or mom\" - i could imagine that men that like crocheting usually feel neglected",
            "title_similarity": "0.692439",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hldzc00",
            "score": 1,
            "text": "I had to crochet a winter hat in my fifth grade class and I gave that hat to my dad.  It's bright red and has a big red puffy ball on top and everything.  That was thirty years ago, and my dad not only still has it, he still wears it every winter since I gave it to him.",
            "title_similarity": "0.5990796",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hldzk8y",
            "score": 1,
            "text": "My grandparents had 20 grandchildren and I was the second to go to college.  My grandmother had died by then but sometime during school my aunt made me an afghan.  I had it for years and I wish I still did.",
            "title_similarity": "0.6113157",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hldzwfo",
            "score": 2,
            "text": "Nah. Never saved any scarves or blankets my grandma made us. Don't regret it and now she's been gone for years. I appreciate her doing it but I can't stand the fabric she used. So itchy.",
            "title_similarity": "0.78891236",
            "sentiment_compound": -0.4519
        },
        {
            "id": "hle01n2",
            "score": 1,
            "text": "Iv got one wool knitted blanket, but my aunt had it stored somewhere hot so it's extremely brittle and basically disintegrates if you touch it.   While I'd love.to keep it, I dont see it as survives me even in a display.  And if you can't actually use a.blanket, it just seems pointless.  Sometimes things just get lost.",
            "title_similarity": "0.7512097",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hle05jx",
            "score": 1,
            "text": "I am so so glad I still have the pikachu sweater my nana made me when I was like 7.",
            "title_similarity": "0.6926879",
            "sentiment_compound": 0.7727
        },
        {
            "id": "hle05y5",
            "score": 1,
            "text": "I have a potholder that my grandma knitted and gave to me not long before she passed in 2000.  It's been used well, and that is what she would have wanted.  It reminds me of her and I'll keep it as long as I can.",
            "title_similarity": "0.73321366",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hle0e6o",
            "score": 1,
            "text": "I still have a really shitty scarf this girl made me in college one time. We barely talk anymore, but it's a nice memory of a really good friend I used to have",
            "title_similarity": "0.73810714",
            "sentiment_compound": 0.9054
        },
        {
            "id": "hle0tk0",
            "score": 1,
            "text": "I have a blanket my mom made me. Its worth ever bit of love she put in to it. RIP Mom i miss you.",
            "title_similarity": "0.7660253",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hle144h",
            "score": 1,
            "text": "I have my grandma’s crocheted bedspread. It took her over 2 years to make!",
            "title_similarity": "0.5754257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hle194l",
            "score": 4,
            "text": "Look, Michael, it's a going-away present so your hands won't get cold. It's almost done, but you can't get them wet, and they can't be dry-cleaned either. You have to hand wash without water, wring dry gently, and use a hair dryer on cool.",
            "title_similarity": "0.68021876",
            "sentiment_compound": 0.9052
        },
        {
            "id": "hle1ml8",
            "score": 1,
            "text": "Does your mother sew!? Boom! Get her to sew THAT!",
            "title_similarity": "0.6325968",
            "sentiment_compound": 0.0
        },
        {
            "id": "hle1ubv",
            "score": 2,
            "text": "My dad is the knitter of the family. Instructions unclear.",
            "title_similarity": "0.5450703",
            "sentiment_compound": -0.25
        },
        {
            "id": "hle2ezk",
            "score": 1,
            "text": "When I used to join cycling races, my dad who was also playing mechanic and coach made me this jersey. It was this bright yellow maillot jaune esque jersey and at the time I refused to wear it because it would make me look like such a poser (I was 15) I stashed it under my bed and it never saw the light of day. My dad passed away from cancer that had spread to his bones and we could never go biking. The last ride I did I wore it to the charity event and of course there were cyclists there who thought I was a prick for wearing a faux maillot jaune but I just wanted him with me on that ride. \n\nThis post fuckin hit home it hit home and now that I’m older with my own kids who are passionate about their sports, I can understand my dads feelings clear as day…love em because they aren’t around for ever",
            "title_similarity": "0.5993361",
            "sentiment_compound": 0.8701
        },
        {
            "id": "hle2h39",
            "score": 2,
            "text": "My mom threw away everything I left behind when I joined the army, including euthanizing my dog.  Fuck whatever she made for me.",
            "title_similarity": "0.5114789",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hle2wpj",
            "score": 1,
            "text": "Thank you for this. I'm not the greatest at knitting or crocheting but I love making stuff for my kids and grandkids.  I know they all wished they still had the items my mother made for them.",
            "title_similarity": "0.8365365",
            "sentiment_compound": 0.7481
        },
        {
            "id": "hle30s9",
            "score": 1,
            "text": "So for the past 10 years my grandmother's Christmas gifts to my brother and I have always included a crocheted afghan and they are always amazing. This extended to my wife once I got married. Over the past year she's developed dementia and it's gotten bad enough to the point where she doesn't remember how to crochet. When my mom told me this it broke my heart. Got some vacuum seal bags and put them all it there. Cherish these things.",
            "title_similarity": "0.72414434",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hle32fl",
            "score": 1,
            "text": "My grandmother used to spend all day, every day knitting baby blankets, hats, and stuffed animals to donate to hospitals.  She passed in 2012.  I had my first child, a daughter, in 2015.  She had left a box with a pink baby blanket and hat all wrapped up for me.  When I had my second daughter last month, my mom handed me another box from her with a different pink baby blanket and hat all wrapped up.  I don’t know how grandma knew she would have two great granddaughters one day but nothing means more to me than these.",
            "title_similarity": "0.75338924",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hle3ex2",
            "score": 1,
            "text": "Days? I've been working on knitting a scarf for literal years...",
            "title_similarity": "0.58043087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hle3h2p",
            "score": 1,
            "text": "My mom crocheted afghans like a madwoman. One of them is unnecessarily massive, and we’ve always called it “the big blue blanket”. \nWhen she passed I took that blanket and the one she always had on her armchair home with me. When I went to visit my Dad last, I took another one. \nThey’re priceless to me now.",
            "title_similarity": "0.72669506",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hle3k20",
            "score": 1,
            "text": "My great gran knitted a baby blanket for me when I was born and I'm still upset my mom got rid of it when I was 13. It been close to 20 years and I still feel a little put out about it.",
            "title_similarity": "0.7052227",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hle3k6r",
            "score": 1,
            "text": "I have a blanket made by my great grandmother. It was given to my mom than me. If I travel for more than months, it comes with me",
            "title_similarity": "0.6883248",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hle45z8",
            "score": 1,
            "text": "This reminds me of a friend recently, his dad and dad's gf was going through their condo and his dad was about to throw away bunch of handmade goods. I'm taking about quilts, knitted Afghan etc. My friend swooped in and took it all, in his words \"someone made these with love, I'll take them.\"",
            "title_similarity": "0.63607186",
            "sentiment_compound": 0.891
        },
        {
            "id": "hle48zc",
            "score": 1,
            "text": "Also, your friend, granddaughter, child, spouse..... Crochet and knitting is becoming hip with the youngins!",
            "title_similarity": "0.6868917",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hle4e9l",
            "score": 1,
            "text": "I asked my mom to make my wife and I a quilt for our bed for Christmas this last year. She had quilted my entire life and even had a quilt left unfinished from when I was a kid so I didnt expect her to actually do it. \n\nLow and behold she proudly gave it to us last Christmas. She even used our wedding colors as the primary pattern colors. It's beautiful.\n\nShe passed away three months later and I am so eternally grateful I asked her when I did bc otherwise I wouldn't have this momemto of her life's greatest hobby. I would almost even consider it her magnum opus because no other quilt I saw her quilt came close in quality or beauty.",
            "title_similarity": "0.753263",
            "sentiment_compound": 0.9475
        },
        {
            "id": "hle4hfe",
            "score": 1,
            "text": "I’m 29 and I’ve been crocheting for a few years. My first few pieces weren’t amazingly interesting but they took me a long time to make and I made them with specific people in mind. The one I made my brother is sitting in the bottom of the linen closet. I first one I made which is beautiful got destroyed by someone washing it so much. Another I made for my Mom\nshe uses to wrap around a plant for winter. Makes me laugh but makes me sad.",
            "title_similarity": "0.7388326",
            "sentiment_compound": 0.5854
        },
        {
            "id": "hle4pxy",
            "score": 1,
            "text": "I keep my grand dad's belt. I'll never wear it. But it meant something to my dad and it was given to me.",
            "title_similarity": "0.6105364",
            "sentiment_compound": 0.25
        },
        {
            "id": "hle4s51",
            "score": 1,
            "text": "I make quilts.  When they get used instead of stashed in a closet, that makes me happy. \n\nIf you don’t like it, give it to someone who could use a blanket. It’s meant to be used.",
            "title_similarity": "0.6534608",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hle4vhp",
            "score": 1,
            "text": "My grandmother died two years ago, I have a scarf she made me still. If I dig my face into it it still smells a little like her house. I miss her terribly, but when she was alive I didn’t visit, or call, and the last years of her life my grandparents stopped coming to family holidays. Keep the scarf, take care of it, tell your kids about it.",
            "title_similarity": "0.79105234",
            "sentiment_compound": 0.7546
        },
        {
            "id": "hle57ry",
            "score": 1,
            "text": "My mom died 40 years ago. \n\nI have a sweater she made me. And a baby blanket she crocheted that I used for both my children.",
            "title_similarity": "0.6438489",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hle5mby",
            "score": 1,
            "text": "My Mom is on the vent from COVID going on a month now. I can’t describe how much I’m cherishing every little thing she has ever given me or made for me. This is excellent advice.",
            "title_similarity": "0.71308017",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hle5uog",
            "score": 1,
            "text": "My mom doesn't knit or crochet, but she does paint. My three siblings and I are always fighting for the next one. I have several hanging in prominent locations in the house. And I love getting one as a Christmas present.",
            "title_similarity": "0.75053483",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hle65cv",
            "score": 1,
            "text": "Or dad and grandpa!!",
            "title_similarity": "0.23211567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hle6613",
            "score": 2,
            "text": "My mom made all of my sisters our baby blankets, it hasn't followed me everywhere but everytime I take it out of storage I'm so happy",
            "title_similarity": "0.7940218",
            "sentiment_compound": 0.823
        },
        {
            "id": "hle6jq0",
            "score": 2,
            "text": "There's something called the \"sweater curse\" in the knitting community where hand-knitting a sweater for a significant other leads to a break up. There are a lot of proposed mechanisms but the ones I like are:\n\n- the sweater took so long that the course of the relationship ran out\n\n- you spend a lot of time and money to make a garment and you realize the relationship is not reciprocal",
            "title_similarity": "0.6978791",
            "sentiment_compound": 0.34
        },
        {
            "id": "hle6o71",
            "score": 2,
            "text": "What I want to know is what psychopath throws something like that out",
            "title_similarity": "0.13183804",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hle75y9",
            "score": 2,
            "text": "Will attest to this. One of the final things my mom did before her accident was knit all of her kids beautiful scarves using very fancy merino wool she bought, which she had been planning to give to us that Christmas. Still something that makes me think of her when I wear it.",
            "title_similarity": "0.8200805",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hle7hp2",
            "score": 2,
            "text": "I needed to read this. My mom and my boyfriend's mom both are crafty ladies. And over the years I've accumulated so many scarfs...even though I'm not a scarf person unless it's negative degrees where I live. So I try to wear them every now and then and share a picture let them know I have/wear them.",
            "title_similarity": "0.7781452",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hle7l21",
            "score": 1,
            "text": "I mean...that ass though",
            "title_similarity": "0.04885557",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hle7tao",
            "score": 1,
            "text": "If there was ever a fire in my house, the FIRST thing I grab is the quilt my grandma made for me.  Not even close.",
            "title_similarity": "0.70823693",
            "sentiment_compound": -0.34
        },
        {
            "id": "hle80k9",
            "score": 1,
            "text": "If you have a relative who makes quilts totally get in on that and buy them supplies and maybe even help out. Quilts are amazing and will be both a story to tell and a cozy blanket.",
            "title_similarity": "0.6944263",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hle81r9",
            "score": 1,
            "text": "This.  My mother knitted us multiple “baby blankets” in hope that one day we’d have kids. I don’t use them obviously but I’ll always keep them since they have sentimental attachment and one of a kind.",
            "title_similarity": "0.86611074",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hle834s",
            "score": 1,
            "text": "My grandma knit my Christmas stocking when I was a newborn. It’s detailed and gorgeous with Santa on a green background with my name on top. Santa’s beard is angora or something. I’ve used it every Christmas since I’ve been alive. I’m middle aged and my grandmother gone nearly 25 years but she’s with me every Christmas when I put up that stocking. I crocheted my own kids’ stockings. Not nearly as detailed as mine because my skills will never match my grandma’s, but they’ll always know their mom made them.",
            "title_similarity": "0.7863543",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hle87th",
            "score": 1,
            "text": "When I graduated highschool, my grandmother gifted me a box that contained a pen, a keychain and a pair of cuffs. Nothing in that box was handmade but I will cherish it forever all because of the hand written note it contained.\n\nYou see, my grandmother was illiterate. She could never read or write but for my graduation present she spent months trying to learn so she could write that note. The hand writing looked like a child's but it clearly read \"Muaaadib, from grandma! Congratulations on your success!\"\n\nI still have the box, I open it from time to time and smile. I vowed to sign my first letter using the pen, use the keychain when I buy a home, and wear the cuffs on my wedding.\n\nRIP grandma.",
            "title_similarity": "0.77670455",
            "sentiment_compound": 0.9882
        },
        {
            "id": "hle8fyq",
            "score": 1,
            "text": "I was the first person in my Dad’s side of the family to go to college. I was accepted into pharmacy school at UNC in 1974. My grandma crocheted a bedspread in Carolina Blue and white. She died two years later before I graduated. I still have it and love it.",
            "title_similarity": "0.6128669",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hle8lf4",
            "score": 1,
            "text": "My mom knitted a blanket when I was a baby and when my first was born she has gave it to me. I plan to pass it down when I have a grandchild.",
            "title_similarity": "0.71209216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hle8oa5",
            "score": 1,
            "text": "My favorite Aunt, who's now passed away, knitted me a blanket and I wish I still had it but I gave it to a homeless man who was sleeping in his car, so it kind of all evens itself out.",
            "title_similarity": "0.71411705",
            "sentiment_compound": 0.431
        },
        {
            "id": "hle8xxk",
            "score": 1,
            "text": "this is why I've held on to the pot roast she cooked me 20 years ago",
            "title_similarity": "0.50086266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hle940o",
            "score": 1,
            "text": "My favorite wedding present is a set of crocheted placemats, potholders, and a blanket made for us by my great aunt. It was her last big project before she passed from cancer not long after I got married.\n\n22 years later, the one blanket still is at the foot of our bed, the placemats and potholders are in a memory frame in the kitchen.\n\nI also have the blanket she made for my grandma that I got when my grandma passed. I used it all the time when I was little and would snuggle it when I was sick or was tired on her sofa. It sits on the back of our sofa now, still being snuggled when I am sick or just tired :)",
            "title_similarity": "0.72590244",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hle9s89",
            "score": 1,
            "text": "Give your loved ones a life well lived and they will be whole.  If you lost the scarf or the card or the keepsake and that pain of guilt hits you, sit in that guilt, look into that guilt and inside it you’ll find all the love, the hope, the tears, the joy, the things that wake your soul from its deep slumber and push you through the struggle and beyond.  For everyone that’s ever loved you, consoled you, inspired you and held you close is etched into your heart and this is your opportunity to project that wonder back to the world where it does the most good.  Speak not of those who have hurt you, speak of those who have taught you how to turn pain to love.",
            "title_similarity": "0.63719046",
            "sentiment_compound": 0.9617
        },
        {
            "id": "hle9v99",
            "score": 1,
            "text": "My great aunt Florence crocheted a blanket for me. I cherish it. I’m now 60 and she passed away 35 years ago.",
            "title_similarity": "0.67745644",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hleagby",
            "score": 1,
            "text": "My mom got really into knitting for a few years. She did it with a group who would knit squares for baby blankets they would donate. One day she made a scarf for my sister. We don't wear scarves. Never really have. My sister started to pick up that look though. So when my mom made her a scarf.. I became her little bratty daughter begging for a scarf that she made. I don't wear it a lot. But it gives me so much comfort to have it when I now live so far away from her. When she passes it will be an even bigger treasure to me.",
            "title_similarity": "0.87934124",
            "sentiment_compound": 0.7556
        },
        {
            "id": "hleaw42",
            "score": 1,
            "text": "My aunt knit me a Batman afghan blanket ages ago I still use all the time.",
            "title_similarity": "0.7011298",
            "sentiment_compound": 0.0
        },
        {
            "id": "hleawie",
            "score": 1,
            "text": "Mom is alive and well, but I can confirm I want to keep some of the clothes she had made for me over the years, just to remember her. And she made tons of it.",
            "title_similarity": "0.75889164",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hleayd1",
            "score": 1,
            "text": "My mother passed away from cancer in 2017. I cherish everything she made for me because I know she can never make something for me again. She did so much for me to get me to where I am today and I could never repay her for it, so I cherish them to honor her memory.",
            "title_similarity": "0.7333443",
            "sentiment_compound": 0.507
        },
        {
            "id": "hleb8mx",
            "score": 1,
            "text": "My grandma got these mugs that she could crochet a pattern for and then stick it inside under the safety of the plastic outside. So she crocheted herself crocheting in a rocking chair and gave one to all of her grandchildren and their SOs. My boyfriend uses his all the time and now that she's gone, it's one of my most prized possessions.",
            "title_similarity": "0.7940021",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hlebt9j",
            "score": 1,
            "text": "Or if your dad or grandpa does it, too! Knitting, cross-stitching, etc. are a great way to pass time, especially while listening to an audio book. There’s nothing gendered about it inherently!",
            "title_similarity": "0.70447755",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hlec0dj",
            "score": 1,
            "text": "I’m in my 50s and still have the blanket my mom crocheted for me as a child. I also kept the blankets people made for my children; they’re grown up now (the children, not the blankets) but having a visual reminder of people’s joy at your existence is a precious thing.",
            "title_similarity": "0.7641854",
            "sentiment_compound": 0.9052
        },
        {
            "id": "hlecly0",
            "score": 1,
            "text": "LPT: don’t be an ass and throw away a handmade item from your family member \n\nThis isn’t a LPT, this is common decency. Stop with these useless “tips”",
            "title_similarity": "0.643072",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hlecn3h",
            "score": 1,
            "text": "My grandma quilted me 2 blankets when I was a kid, full size blankets got the first 20 years ago. It has started to come apart at the seams because it was used for so long. The second I still sleep with on cold nights. She even managed to sneak in a couple small ones for my kids before she passed. Can’t let that shit go, ever.",
            "title_similarity": "0.6431588",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hleeekq",
            "score": 1,
            "text": "Every year, my mother in law knits me a wool hat. They are the coolest and everyone asks me where I bought them.  \nI'll keep them forever :)",
            "title_similarity": "0.79158455",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hleerad",
            "score": 1,
            "text": "I agree, I still have a Quilt that my mother made 30 years ago. I used it for many years and when it became too weak for daily use I stored it in a closet.\n\nI feel very comforted every time I pull it out on those cold nights.",
            "title_similarity": "0.7122011",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hleeuwm",
            "score": 1,
            "text": "Just made an account to say thank you. I love seeing posts like this get popular. I am livid at how much belongings of my Grandmother's that my mother tossed after she passed. My Grandmother was everything to me!",
            "title_similarity": "0.6450783",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hlef55j",
            "score": 1,
            "text": "I knitted my husband a Harry Potter scarf. He never wore it so I gave it to Goodwill. The kids now wish I had kept it :( But he didn’t wear it!! I wasn’t going to have something take up closet space that was never worn!",
            "title_similarity": "0.7712244",
            "sentiment_compound": 0.4781
        },
        {
            "id": "hlefdk4",
            "score": 1,
            "text": "My grandma made all our sweaters (there were six grandchildren) and we wore them everywhere. My mom is a periodical purger (I love her to death but her sentimentality is more on photos and memories) and she donated them years ago. I'm glad they're somewhere out there being used since I couldn't anymore, but sometimes, I really really wish I had them to hold when I miss my grandma.",
            "title_similarity": "0.8181509",
            "sentiment_compound": 0.8874
        },
        {
            "id": "hlefnal",
            "score": 1,
            "text": "In the age of mass manufacturing... How is a hand knitted scarf not the coolest item? Where's your fashion sense from lol",
            "title_similarity": "0.5942669",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hlefui0",
            "score": 1,
            "text": "I still have an afghan knitted by my grandmother.",
            "title_similarity": "0.6463392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlegboy",
            "score": 1,
            "text": "Yes I lost a wool coat from my grandma. It wasn’t even that I got rid of it, I just lost track of it some how in all my moves.",
            "title_similarity": "0.6615771",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hlegxdu",
            "score": 1,
            "text": "I lost the blanket my grandma made for me in a move to a different state. There's still a hole in my heart from it. It was the only thing I had physically that connected to her. I'm getting teary just thinking about it. If you have something so precious, make sure it's somewhere noticeable and you are tracking it when you move.",
            "title_similarity": "0.68802464",
            "sentiment_compound": 0.8808
        },
        {
            "id": "hlehdcw",
            "score": 1,
            "text": "My mom started me a quilt when I was born. She finished it when I was 42. I still use it all these years later. Plus I have a crocheted throw that she made me. That thing must weigh a ton.",
            "title_similarity": "0.63324016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlehdzl",
            "score": 1,
            "text": "My mum was a phenomenal artist.  She could pick up any type of art and excell at it, oil, water color, bronze, pottery, stained glass, weaving, spinning on and on.  I never realized until she died that even though she made oh so much she never actually made something with me in mind and gifted it to me.  Going through her things and keeping what I wanted isn't the same as her lovingly making me something.  \n\nOP, I hope at least 1 person listens and keeps what their parent made specially for them.",
            "title_similarity": "0.79336226",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hleiauh",
            "score": 1,
            "text": "Amen, on that.  My grandma crochet 2 blanket 1 for my sister and 1 for me when we were you. Probably preteens. I am 44 now. I kept that blanket in perfect condition and still use it on cold nights, remembering how hard it must have been making it with arthritus in her hands.  I miss both of my grandmas, never had grandfathers. So having that blanket reminds me of both of them.",
            "title_similarity": "0.77730334",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hleicmv",
            "score": 2,
            "text": "My grandpa made me a shoehorn. Weird, I know. But it's made from a long slender piece of wood and polished with some kind of cinnamon oil. It smells great to this day and I really appreciated it last year when I twisted my back pretty hard lifting a heavy bag.",
            "title_similarity": "0.6640183",
            "sentiment_compound": 0.9422
        },
        {
            "id": "hleiqbq",
            "score": 1,
            "text": "My mom knits a whole lot, the two sweaters she made, along with gloves, socks and hats are my most prized things. I love them.",
            "title_similarity": "0.72344756",
            "sentiment_compound": 0.8357
        },
        {
            "id": "hlejhbv",
            "score": 1,
            "text": "The same can be said about any stupid shit your loved ones give you.",
            "title_similarity": "0.46611166",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hlejv7v",
            "score": 1,
            "text": "My grandmother knitted me a very nice blanket in my favorite color (purple) just a couple years before she passed. My mom accidentally put it in a donation bag instead of the keep bag and I still get sad thinking about that almost 20 years later",
            "title_similarity": "0.7424729",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hlejxxx",
            "score": 1,
            "text": "In sorry what, do people throw away that kind of stuff? Does it hold no sentimental value to people?",
            "title_similarity": "0.30758947",
            "sentiment_compound": -0.5659
        },
        {
            "id": "hlem600",
            "score": 1,
            "text": "My sister knits clothing for my and my parents’ dogs. It’s so cute!",
            "title_similarity": "0.6715583",
            "sentiment_compound": 0.632
        },
        {
            "id": "hlemyd6",
            "score": 1,
            "text": "In addition to that make sure you store it in a place where it won't rot out over time. I have a knit sweater from one of my aunties that she knitted for me when I was little. It's half rotted out right now and wish I had stored it better.",
            "title_similarity": "0.8580935",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hlemyrc",
            "score": 1,
            "text": "My grandma used to knit cable knit wool sweaters for us. Now that I’m older I know the value of a fancy cable knit sweater.",
            "title_similarity": "0.72953886",
            "sentiment_compound": 0.34
        },
        {
            "id": "hlen4it",
            "score": 1,
            "text": "I have a blanket my grandmother made me. If my house catches fire, I'm grabbing that first.",
            "title_similarity": "0.6508378",
            "sentiment_compound": -0.34
        },
        {
            "id": "hlennt5",
            "score": 1,
            "text": "One of my winter staples is a knit sweater made by a friend of the family that is older than me and got handed down from my dad.",
            "title_similarity": "0.59872615",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hleo38b",
            "score": 1,
            "text": "I crocheted a unicorn stuffy for my daughter, it was my second project I ever made. That Unicorn is her favorite friend, and it warms my heart how much she loves it.",
            "title_similarity": "0.71711046",
            "sentiment_compound": 0.9451
        },
        {
            "id": "hleo3go",
            "score": 1,
            "text": "I had a house fire 5 years ago. I lost everything. The only thing I truly miss is the afghan Grandma made for me.",
            "title_similarity": "0.6162256",
            "sentiment_compound": -0.34
        },
        {
            "id": "hleo61s",
            "score": 1,
            "text": "Luckily right before my grandmother passed away she busted out the cool gift, my great grandfather's pocket knife :D",
            "title_similarity": "0.5854635",
            "sentiment_compound": 0.9488
        },
        {
            "id": "hleopm0",
            "score": 1,
            "text": "My nanan knits my little girls a lot if jumpers and cardigans, and we have so many baby blankets, so so many.\nAnyway during the UK lockdown she'd get wool delivered whenever she could and knit my girls some cardigans and post them to me. She said she posted them because she didn't want them to grow out of them before she could see us and and everyone likes a surprise in the post.\n\nI think she got fed up of knitting and tried her hand at crochet. When I finally got to her she had done this blanket and it was a bit of a mish-mash of colours, but a lovely pattern. I asked if I could have it. She didn't think anyone would want it since she offered it my mum and my aunt and they both said the colours were a bit odd. I just wanted something made by her that I could cherish. When I asked her why it was a mish-mash of colours she said she used all the wool left over from knitting my girls cardigans because she was struggling to get more wool during lockdown. Which to me is a lovely sentimental bit of backstory to the blanket.\n\nShe has since crocheted a absolutely wonderful, heavy blanket that matches my room, but I still use the other blanket a lot.",
            "title_similarity": "0.7952262",
            "sentiment_compound": 0.9701
        },
        {
            "id": "hleotzx",
            "score": 2,
            "text": "I have two quilts my great grandmother made. They are fugly and I will never give them up.",
            "title_similarity": "0.78191197",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlepmcp",
            "score": 1,
            "text": "I made my sister a baby blanket when I first learned to crochet. Think she threw it away shortly after coz it was handmade instead of having a big brand label on it. \nBit upsetting but half expected it from her.",
            "title_similarity": "0.7748149",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hler2d5",
            "score": 1,
            "text": "My mother made me the most incredible Cable style afghan blanket one year about 30 years ago.  It's still the most beautiful and warm blanket, though it is warn and even has a hole or two. \n\nIt's a treasure now that she's gone.",
            "title_similarity": "0.74527264",
            "sentiment_compound": 0.7996
        },
        {
            "id": "hlest4t",
            "score": 1,
            "text": "What if gma buys you a tree skirt to wear?",
            "title_similarity": "0.48448676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlet0zx",
            "score": 1,
            "text": "This is good advice. It's important to think about the hours they spent making these items. The whole time they're thinking about you and making design and artistic decisions based on how they think and feel about you. These are very sentimental objects and if you're a spiritual person they would certainly be a confluence of cosmic energy (especially after the creator of the item has died).",
            "title_similarity": "0.6548995",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hletpje",
            "score": 1,
            "text": "Fuck that, my grandma did one better, she taught me to crochet.",
            "title_similarity": "0.74211377",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hleua4j",
            "score": 1,
            "text": "I lost my only blanket from my late grandma, my mother threw it away. It was worn and old, but I loved the unique wavy texture of it. I agree so much, keep things like that, still regret not hiding the blanket away somewhere a decade later...",
            "title_similarity": "0.7955945",
            "sentiment_compound": 0.8493
        },
        {
            "id": "hleugo8",
            "score": 1,
            "text": "I have a wonderful crocheted blanket my mom made that I asked for to use in my 71 Westy. Right after I got it we discovered the boxes she kept the other blankets she made got destroyed. I have the only surviving piece. One of her best works. Glad I asked for it.",
            "title_similarity": "0.8019216",
            "sentiment_compound": 0.872
        },
        {
            "id": "hlevivm",
            "score": 1,
            "text": "For my birthday one year my grandmother knitted me a full length replica scarf from the Tom Baker era of Doctor Who, I will always cherish the fact that she spent hours over several months to not only re-watch TV she hadn't really ever been interested in, but to actually put together a nearly 3m long scarf.",
            "title_similarity": "0.7406275",
            "sentiment_compound": 0.418
        },
        {
            "id": "hlevjps",
            "score": 2,
            "text": "When I was in art school, my grandma sewed me a large portfolio with little details like flaps to protect from rain, made from a random ugly fabric she had laying around, a sage green floral. Plus a matching tote. I loved it. \n\nFor my wedding she sewed me a peach floral apron and matching potholders. \n\nI went through an obsessive minimalism phase, trying to lessen my anxiety by donating everything in my home. I got rid of a few things I regret.\n\nBut the other day I found these things she made me and am SO grateful they survived the manic purge of ‘19. \n\nWhen I saw them I got choked up because it hit me what a blessing it is to have someone out there who loves you, and how that’s not always a given. I’m so glad I still have them.",
            "title_similarity": "0.8145653",
            "sentiment_compound": 0.9799
        },
        {
            "id": "hlewgkd",
            "score": 1,
            "text": "My grandma lives in Iran, well everyone I know does really. But whenever she used to come here she would knit everything for me. She even knitted a patch that went on my jacked with my initials because there was a tear on the jacket. Anyway, she knitted about 10-15 little things that we could’ve used to clean dishes with, she wanted to sell them. She gave them to me and asked me to sell them whenever I could (not for her just for fun to see if they would). I kept all of them.",
            "title_similarity": "0.7836709",
            "sentiment_compound": 0.8608
        },
        {
            "id": "hlezx0g",
            "score": 1,
            "text": "My grandmother died at the beginning of October, the only thing I wanted was one of the doilies she crocheted. I'm going to have them framed.",
            "title_similarity": "0.6996645",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hlf0ov3",
            "score": 1,
            "text": "As someone who makes and gifts a lot of knitted items, I would like to say that we appreciate people who appreciate hand-made items, but they're just items. Wear them, use them, re-home them if you're just going to stick it in a closet for 30 years. Most of us enjoy the making and the giving, but it's not a sacred pact.",
            "title_similarity": "0.7433693",
            "sentiment_compound": 0.9051
        },
        {
            "id": "hlf2buf",
            "score": 1,
            "text": "My great aunt is nearing the end, but whenever I see her she showers me with hand knitted hilo leis. I can easily just get rid of them because they're just clutter but the memory of her and my family and our history, nah.... I just can't.",
            "title_similarity": "0.82864875",
            "sentiment_compound": 0.8537
        },
        {
            "id": "hlf2gzc",
            "score": 2,
            "text": "Please take my poor person award. 🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆\n\nI crochet, sew, cross stitch, and paper craft. I'm very choosy about who I give those pieces to, because several of those pieces were quickly trashed or put out for yard sale (e.g., the gingham apron I made in 6th grade home ec class and proudly gave to my maternal grandmother, which she quickly threw away). I wish I had been given that back so I can at least see the progression of my sewing skills over the past 35+ years.\n\nI'm thankful my immediate family and closest friends are appreciative of my efforts. I still have the crocheted ripple afghan my mother made for me when I was a child. It barely covers my legs but with her now gone, it's a cherished piece.",
            "title_similarity": "0.766186",
            "sentiment_compound": 0.9343
        },
        {
            "id": "hlf2r38",
            "score": 1,
            "text": "My mother has taken up knitting in her retirement, she made me a hat that is too tight. I don't have the heart to tell her doesn't fit, but I still have the hat and shall cherish it to the end of time.",
            "title_similarity": "0.898926",
            "sentiment_compound": 0.1682
        },
        {
            "id": "hlf4e56",
            "score": 1,
            "text": "My gran has moved in to a home now for the elderly.  She's about to turn 97, and sold her house to help pay for it all.  Luckily her pension and the government and my Dad being as good with money as he is, means she's extremely well cared for now as much as she hates it as her independence is gone.\n\nBUT, she asked me if I wanted anything from her place as I was moving in to my own place almost exactly a year ago.\n\nI said I'd gladly take her lounge chair, she lit up and said there's another one upstairs too.\n\nSo now, I have 2 lounge chairs [similar to these](https://live.staticflickr.com/3678/13402507955_a4d30d0ff0_b.jpg) that are all the rage now, except these are true vintage.  ACTUALLY bought in the 60s, and while emptying the house and going through the paperwork my Dad found the receipt for them.  They're worth about £250 each in today's markets.\n\nThey're a bit creaky, and the cream upholstery I don't like, but put a throw over them and they blend right in.  They're some of the comfiest I've sat in too. I have one in my living room and one in my office behind me.  Ideally I'd change the covers to a grey or something, but they'll always be her chairs.  And there's only 4 of us left with our surname, so when she dies in a year or 2, a part of her will be here with me.",
            "title_similarity": "0.7150332",
            "sentiment_compound": 0.8489
        },
        {
            "id": "hlf4ptw",
            "score": 1,
            "text": "My grandma knitted a 3 piece picture of the blue ridge mountains that they lived in. They are maybe 18”x24” each. I always looked at it as a child and one of the few things I think of when I remember the house. She had them hanging up in her assisted living home and was asking me what I wanted from her in her will. I told her the only thing I wanted was those 3 pictures she knitted. She broke down and cried telling me no one wanted those and she was afraid they would go into the trash. I’m going to have them framed when I get them to try and preserve them longer. My other grandma crocheted \n a blanket the day I was born while she was waiting in the hospital. My mom REFUSES to let me have it and 30 years later I have never seen her sitting on the couch without it. That one is going to be hard one to inherit.",
            "title_similarity": "0.74929106",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hlf54o0",
            "score": 1,
            "text": "I have a knitted hat and mittens my grandmother made for me. At the time, I was a kid and was like..'eh thank you' but **now** I wear them all the time in winter. It's been about 30 years and in good condition and very warm.",
            "title_similarity": "0.7172229",
            "sentiment_compound": 0.8121
        },
        {
            "id": "hlf5p83",
            "score": 1,
            "text": "I sew—I’m not particularly good at it, but I like doing it. When each of the three grandkids were born, my other daughter and I made them baby quilts. Now that the kids are older, the quilts are packed up for the next generation of grandkids. \n\nNow, I make baby doll blankets for my youngest granddaughter. They’re only about a yard of fabric with some batting sandwiched in between and maybe some ribbon or lace decorating them, but I’ve made about half a dozen now. When she gets older and outgrows baby dolls, her mom will pack them up for storage and for the next generation.\n\nI wish I had something my grandmother had made. She used to quilt, but I was too far down the line to have gotten them when she died.",
            "title_similarity": "0.7443175",
            "sentiment_compound": 0.0229
        },
        {
            "id": "hlf7arn",
            "score": 1,
            "text": "I have some socks my grandma made me years ago that have holes in them but I'm never getting rid of them because she's got alzheimers and I'll never get another pair in my life, should try and get them fixed.",
            "title_similarity": "0.7842617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlf7kyq",
            "score": 1,
            "text": "This 100%. \n\nMy grandma told me one day that she used to crochet hats for her brothers and sisters as kids. She loved crocheting so I asked her to make me a hat. Even bought wool yarn and took it to her so she didn’t have to use her own stuff. She passed away shortly afterwards and my only gripe is I live in Florida. It only gets cold enough to wear those hats twice a year here. But they are some of my most prized possession. If my house caught on fire they would be one of the first things I’d save. I’d risk my life to save those hats. Also I don’t have a huge will to live but I would die if something happened to those beanies.",
            "title_similarity": "0.8192367",
            "sentiment_compound": 0.8376
        },
        {
            "id": "hlf7w7r",
            "score": 1,
            "text": "Dude, you made me emotional.",
            "title_similarity": "0.084064566",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hlf8yiz",
            "score": 1,
            "text": "Watch out for moths though. Use moth balls if it's bad, moth traps, store in a tight container. \nWash it occasionally, very gently. Moths are drawn to the grime, even if it's invisible. \n\nCheck for moths when accepting a hand me down. \n\nYou can patch the holes, if your careful. \n\nI've had issues with this, as you can tell.",
            "title_similarity": "0.51939964",
            "sentiment_compound": 0.5291
        },
        {
            "id": "hlf95wq",
            "score": 1,
            "text": "They're also a good memory, and reminder that someone cares enough about you to spend days of their time making something they'll hope you like.",
            "title_similarity": "0.50105214",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hlfdbwj",
            "score": 1,
            "text": "I now have hats and gloves that my great grandmother knit for my grandmother.",
            "title_similarity": "0.7255297",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlfdghi",
            "score": 1,
            "text": "I have a scarf a friend of mine made for me in college and it’s my favorite one!",
            "title_similarity": "0.6182147",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hlff4yi",
            "score": 1,
            "text": "My mother in law knitted a poncho for me. She died three years ago.\n\nI had recently brought it on vacation. The day after I got home and had unpacked, I briefly couldn’t find it, and nearly cried, thinking I had left it in another country. Felt the tears coming. Then found it and almost cried with relief. Now I’m almost crying again just at the thought of losing it.",
            "title_similarity": "0.6889993",
            "sentiment_compound": -0.8996
        },
        {
            "id": "hlffu9o",
            "score": 1,
            "text": "Quilts. My Grammy made quilts. For Christmas, cause you were 6, weddings, graduations, you\nBought a house… she has been gone 2 years. Some of the quilts of worn out from use ( she would say never to ‘save’ them but enjoy them). Hours and hours of love and labor. She taught me how to quilt as a kid/ teen and I have made a few simple ones but that was 20 years ago. One of my kids are graduating soon and I need to get his quilt started.",
            "title_similarity": "0.7130942",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hlfgb1r",
            "score": 1,
            "text": "Asked my grandma to stop making me boxers when I was a teen. She didn’t. She’s sense past away and I still have a few in my pj drawer. I’m glad she didn’t listen to 15 year old me.",
            "title_similarity": "0.70919645",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hlfi1xv",
            "score": 1,
            "text": "Oh man, my girlfriend just knit me a blanket a few weeks ago. It's the first knitted present I've gotten since my Nana knitted my hospital booties and I'm already sure ill be treasuring this blanket forever. Its smells like love.",
            "title_similarity": "0.7883129",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hlfkpp9",
            "score": 1,
            "text": "My late grandmother, Meemaw, handmade Christmas stockings for the whole family. I had my own, my mother's, and my sister's in my possession at a house I was renting with said little sister (nothing really official - no contract). The landlord turned out to be not only predatory, but VIOLENT. So, one morning, Sis and I decide to leave, get set up in a hotel, and come back for our belongings when we weren't alone. \n\nBut apparently, he was onto us, and we came back to bonfire of all our stuff. I realized Meemaw's stockings were in that fire, and I cried like a baby.  I was crushed to lose those.\nI remember every Christmas season, and get mad all over again.",
            "title_similarity": "0.74596107",
            "sentiment_compound": -0.9725
        },
        {
            "id": "hlfmc6x",
            "score": 1,
            "text": "My grandmother used to crochet blankets for just about everybody in the family. Over the years I’ve somehow managed to accumulate a good chunk of them. She passed away in 2002 I am so glad that I have them. I miss her but every time I pick one up I love wrapping myself up in them knowing it was made with her hands.  Those blankets are the most cherished items in my possession.",
            "title_similarity": "0.7491257",
            "sentiment_compound": 0.941
        },
        {
            "id": "hlfmdcj",
            "score": 1,
            "text": "I still have a blanket my great grandmother  crocheted for me. I have had it since I was a baby and it was my security blanket, always made me feel safe and loved. I could never dream of getting rid of it or losing it.",
            "title_similarity": "0.7633358",
            "sentiment_compound": 0.8738
        },
        {
            "id": "hlfpo9h",
            "score": 1,
            "text": "This is so true. Cleaned out my drawers today and found the slippers my Grandma made me. Full on ugly cried",
            "title_similarity": "0.66207135",
            "sentiment_compound": -0.3146
        },
        {
            "id": "hlfqkpc",
            "score": 1,
            "text": "I have a dresser that my great grandfather built. Every 5-10 years I’ll sand or strip it down and stain it. My daughter is using it now so it’s been handed down 5 generations.",
            "title_similarity": "0.5021157",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlftvq3",
            "score": 1,
            "text": "To generalize, the best gifts are personal.nothing to do with money",
            "title_similarity": "0.4332694",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlfz9ok",
            "score": 1,
            "text": "Truth...absolute and irrevocable truth",
            "title_similarity": "0.09985703",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hlg3srz",
            "score": 1,
            "text": "I just passed on baby clothes my mum knitted for my son, to my granddaughter!",
            "title_similarity": "0.7319107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlg5kha",
            "score": 1,
            "text": "My grandma loved to crochet, I have a lot of her blankets, pillow cases, etc. one time she knitted me a rainbow blanket and gave it to me completely out of the blue and told me she loved me. She’s gone now, and I’ve since come out. Her health had gone down hill out of the blue around the time I had decided to come out and I never got the chance to tell her. But something tells me she knew. That blanket never leaves my bed.",
            "title_similarity": "0.80124843",
            "sentiment_compound": 0.5469
        },
        {
            "id": "hlg7rna",
            "score": 1,
            "text": "Or a quilt!!!!! I absolutely LOVE the quilt my grandmother made. It’s all worn & has vintage fabric prints. Priceless, irreplaceable, & cozy. My favorite blanket.",
            "title_similarity": "0.6908963",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hlg910p",
            "score": 1,
            "text": "My mom knitted a scarf, a hat, and mittens when I was a toddler in the early 70s. I still have the scarf. It’s from the era when chocolate brown, avocado green, tomato red, mustard yellow were all in style. It’s all of of those and long enough that I sometimes refer to it as my Doctor Who scarf. Mom’s been gone ten years now. Miss you, mom.",
            "title_similarity": "0.7230115",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hlga4ln",
            "score": 1,
            "text": "Good advice to share in crochet/knit groups.",
            "title_similarity": "0.49367934",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlgby12",
            "score": 1,
            "text": "I still have the blanket my mom crocheted to wrap me in after I was born. I’ll never get rid of it ever",
            "title_similarity": "0.7825135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlgcm5g",
            "score": 1,
            "text": "Yep. My grandma crocheted all sorts of stuff for me. I love the memories they contain.",
            "title_similarity": "0.68559074",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hlgnek6",
            "score": 1,
            "text": "I'm a knitter, and I love when I see pictures of kids carrying around the blankets I made for them before they were born!  My grandmother was a knitter, and didn't have much money - but she made me an afghan for my birthday when I was 5 or so.  I still have that blanket and snuggle down underneath it during the winter, almost 20 years after she passed away.  I wouldn't sell or get rid of that afghan for anything, and it breaks my heart to see handmade scarves, afghans, etc. at the thrift shops for nominal amounts of money.  I know how much yarn and time went into those items, and you can't put a dollar amount on that.",
            "title_similarity": "0.79508376",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hlgzrz0",
            "score": 1,
            "text": "I'm 66 and still have a scarf my mom made me when I was 15. It's the only thing I have she touched. I will be buried with it.",
            "title_similarity": "0.7174366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlh3ok1",
            "score": 1,
            "text": "My grandmother was wonderful making clothes for me, knitting family jumpers I loved spending time with her sewing, passing on her skills. The last jumper she knitted me, as she was nearing the end of her life has one arm half the length of the other, and several sizes to big, bless her, and I at 56 yrs still have and wear that some 40plus years later. Washed and cared with love, and I presume made to last.",
            "title_similarity": "0.78577733",
            "sentiment_compound": 0.9545
        },
        {
            "id": "hlhu7rn",
            "score": 1,
            "text": "And so are you, Gramma. And so are you.",
            "title_similarity": "0.33187023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlijco9",
            "score": 1,
            "text": "My nana has made Swedish or huck embroidery afghans for all 9 of us kids and 2 for my mom. They’re huge and covered in intricate work and take her at least 6 months to a year to make. When she comes to visit for Christmas, she and I are going to pick out the yarn for her to make one for my son, her first great-grandchild. She’s also going to teach me how to make them so that skill isn’t lost when she dies. As someone who knits, crochets, sews, quilts, etc, I know how much work goes into them and the blanket is so precious to me. \n\nMy nana is the only person I will knit socks for because she just loves them so much and wears the dickens out of them. I will knit her a pair for her birthday and Christmas from now until the day she dies. That kind of appreciation is so hard to find.\n\nI also have a crocheted afghan that my great great grandmother made that’s still going strong and is on my couch right now. My mom has all the cross-stitch her grandma made. Both of our houses are covered in handmade items and it really brings me so much joy.",
            "title_similarity": "0.74249876",
            "sentiment_compound": 0.9816
        },
        {
            "id": "hlivwx4",
            "score": 1,
            "text": "And one point to prove you've been here before.",
            "title_similarity": "0.13743472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlk17d8",
            "score": 1,
            "text": "Of course i'm gonna keep it. Imagine throwing away something someone used great time and effort to make for you. What kind of a monster does that?",
            "title_similarity": "0.51799303",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlln2my",
            "score": 1,
            "text": "My grandmother knitted me a ski cap while I was in high school (late 1970s).  I still wear that cap regularly. It has outlasted numerous mass-produced caps that I've owned, and looks as good as new. I'm amazed at its durability across 40+ years...",
            "title_similarity": "0.6955166",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hlmdusl",
            "score": 1,
            "text": "The same goes when teenagers/parents throw out first drawings/pictures/highschool arts and crafts, OLD CLOTHING when doing their annual spring clean.  Don't throw those out.    \n\n\nI  even keep my old crumply wallets from primary and highchool",
            "title_similarity": "0.71835804",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hlo777m",
            "score": 1,
            "text": "As my grandmother got older, she had fun taking Post-it notes and writing a short note to the person she wanted to have said item after she died. So when she passed away, all the items that she had tagged were given to the people along with the notes she wrote to them. \n\n19 years later I still have and read the notes. Those are the most meaningful- Her quick little expressions of love she wrote to me in her own handwriting.",
            "title_similarity": "0.67795974",
            "sentiment_compound": 0.7375
        },
        {
            "id": "hm1z0ca",
            "score": 1,
            "text": "I have a little blanket, tiny, like 3 ft. long by 2.5 ft. wide, made by an aunt now passed as well as a few hotpads which aren't actually good for grabbing hot things because of the material, from my mom. Both are gone and I will cherish their gifts forever.",
            "title_similarity": "0.7879095",
            "sentiment_compound": 0.5469
        },
        {
            "id": "hmi1fkr",
            "score": 1,
            "text": "I crochet and my dad won't let me get rid of old bad looking projects. He says their special and one of a kind. I dknt know where I'd be without him :)",
            "title_similarity": "0.76622045",
            "sentiment_compound": 0.031
        },
        {
            "id": "hmxtsbu",
            "score": 1,
            "text": "Also applies to pretty much anything made by grandmas and moms or anyone special to you.  I have a quilt my grandmother made for me that she let me stitch on, I was probably about 5 years old and now several decades later it's in a place of honor in my bedroom.  It's too old to use now but seeing it takes me back to sitting with Granny and learning to quilt with her.",
            "title_similarity": "0.68715835",
            "sentiment_compound": 0.6187
        },
        {
            "id": "hn3mzb2",
            "score": 1,
            "text": "looking at my ragged scarf mom made, that i couldn't throw away.",
            "title_similarity": "0.83955693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnlya2o",
            "score": 1,
            "text": "I have a baby blanket (thats really the size of a large childs blanket) that my grandma made for me when I was born. 29 years later and through a house fire, at least 2 dozen moves, being stolen from blind and all its still with me. She passed last year around this time, and I think of her when I see that blanket. Its one of my most treasured possessions, and its comfy to boot!",
            "title_similarity": "0.6615268",
            "sentiment_compound": -0.5717
        },
        {
            "id": "hofhjqs",
            "score": 1,
            "text": "So true, my mom would knit me socks and I thought they're the ugliest things in the world but I'm so glad I kept them.",
            "title_similarity": "0.83300865",
            "sentiment_compound": 0.7137
        },
        {
            "id": "hoglwq2",
            "score": 1,
            "text": "Funny I come across this post just as I'm learning to crochet\n\nMy mom doesn't know how to crochet, but she told me she always wanted to learn so maybe I could teach her sometime",
            "title_similarity": "0.8041926",
            "sentiment_compound": 0.2382
        },
        {
            "id": "horptob",
            "score": 1,
            "text": "These stories are so touching. I hope that my gifts are so loved. Crochet and knitting take so much time, and some patterns can get tedious toward the end. I'm dropping off an \"ugly sweater\" hat, this morning to my cousin who had begged for it. I had to fight my mom off of it, so now working on hers. I hope they can cherish them as much as some of you have cherished your gifts",
            "title_similarity": "0.8531977",
            "sentiment_compound": 0.9012
        },
        {
            "id": "hoviioa",
            "score": 1,
            "text": "My mom actually crochets blankets and she, my sisters, and myself have given blankets to new parents like one time I actually gave a blue one to a former classmate of mine in high school, another example is my sister gave one to her band director who was about to become a dad, and in about a month I’m gonna give one to one of my best friends at her baby shower",
            "title_similarity": "0.67763424",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hoxbm9s",
            "score": 1,
            "text": "Hi. Long lộ gôd ih rrucb",
            "title_similarity": "0.13559565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxbwx8",
            "score": 1,
            "text": "Thĩ ikoguuotggghuocgojkbyvhjlkjppppedgrvh",
            "title_similarity": "0.22451264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp4dao3",
            "score": 1,
            "text": "I am using a blanket my grandma crocheted as I type this. She died when i was 20 and I am 52 now.",
            "title_similarity": "0.59345675",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hp87h1d",
            "score": 1,
            "text": "Grandma made me a scarf and two hand gloves, even though I'm allergic to the material if I wear it for prolonged periods of time but I cherish it anyways, it was the first scarf I've ever gotten too",
            "title_similarity": "0.8270744",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hp90luc",
            "score": 1,
            "text": "One hundred percent. I used to complain and be a general PITA whenever my mom dragged me to quilt/fabric shops when I was young. I usually ended up playing in the giant tub of buttons each shop invariably had. She was a prolific quilter and many childhood memories are of her sitting on one end of the couch under a pile of fabric, hoop in hand and thimble on finger, as she hand quilted something I cared little about when I was young. She gave quilts to me, family, and friends at important life milestones, and she made and quilted dozens to donate to Quilts of Valor - for veterans. I always thought of her “hobby” as a part of her but it wasn’t until after she died that I really learned to appreciate her as a highly skilled craftsperson, someone who was well regarded amongst her peers, and a mentor to other quilters. I treasure her quilts now, not just for their high quality, but for the care and life she put into them. We have some heirloom quilts that are probably around 150 years old and I hope we can keep my mom’s quilts that long.",
            "title_similarity": "0.7044927",
            "sentiment_compound": 0.9335
        },
        {
            "id": "hpb5i4l",
            "score": 1,
            "text": "I lost an afghan my grandmother made for me when I was young, during a college move. I would give anything for it. You are correct, totally irreplaceable.",
            "title_similarity": "0.78014886",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpz67uu",
            "score": 1,
            "text": "My step moms sunflower crochet blanket before she died in 2016",
            "title_similarity": "0.6384806",
            "sentiment_compound": -0.5574
        }
    ]
}