{
    "LPT : Don’t wait around for others. Make your own plans and stick to them. Don’t be the person who never gets out just because nobody else can go with you.\n": [
        {
            "id": "hlse9xr",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.53358114",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hlt7ul3",
            "score": -1,
            "text": "This gets posted every damn week. It's horrible advice too. It just encourages more anti social behavior. Most things in life need others to be done.  If you want to do something that your friends don't, then go find people that also want to do that thing.   It's the age of internet, forums, apps, instant messages...  Go find people!!",
            "title_similarity": "0.45549363",
            "sentiment_compound": -0.417
        },
        {
            "id": "hlsk04x",
            "score": 18,
            "text": "But people are confusing and unpleasant. And my house is good and worth spending time with",
            "title_similarity": "0.30165988",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hlt15nu",
            "score": 4,
            "text": "Yes. Instead be the person who drinks alone every friday.",
            "title_similarity": "0.40183628",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hlu1vud",
            "score": 0,
            "text": "Of all the life pro tips I've seen this is by far the worst. It is anti social to not be flexible and to insist you always are going to stick to your plan. \n\n\"My way or the highway\" is awful advice.",
            "title_similarity": "0.6406439",
            "sentiment_compound": -0.8769
        },
        {
            "id": "hlsr1i5",
            "score": 16,
            "text": "Bold of you to assume I want to get out of my apartment",
            "title_similarity": "0.4679649",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hltcuaf",
            "score": -1,
            "text": "if no body wants to go out with you. maybe its cause youre annoying af.",
            "title_similarity": "0.64508533",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hlufvep",
            "score": 1,
            "text": "I always try to go out on my own but it's so hard when you're an extrovert that also has clinical depression and anxiety especially this time of year when holiday Depression always hits you. \n\nAs much as I try to go out on my own, I always find that it, at times, makes me even more depressed.",
            "title_similarity": "0.4558821",
            "sentiment_compound": -0.95
        },
        {
            "id": "hlsyi0m",
            "score": 26,
            "text": "[deleted]",
            "title_similarity": "0.33615184"
        },
        {
            "id": "hlswddh",
            "score": 19,
            "text": "Imagine being broke",
            "title_similarity": "0.29260772",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hlsz6ij",
            "score": 4,
            "text": "Preach. Happily married but will still travel or do dinner or see concerts on my own if it's something I want to do.",
            "title_similarity": "0.45047837",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hlt4c4n",
            "score": -3,
            "text": "This. So much this!",
            "title_similarity": "0.15652618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt5ro5",
            "score": 4,
            "text": "Is this what this sub has become? Marginally a tip at best",
            "title_similarity": "0.30625433",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlsvpo5",
            "score": 5,
            "text": "This is the exact problem I was facing since 4 days and I really hate the fact that all my friends have time for their other friends but when I try to make plans with them they're always \"busy\". I haven't seen any friends since 10 months.",
            "title_similarity": "0.3790993",
            "sentiment_compound": -0.554
        },
        {
            "id": "hlsvuvd",
            "score": 6,
            "text": "Did this recently and began to meet many new interesting people who I talk with regularly.",
            "title_similarity": "0.16876614",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hlt2uyi",
            "score": 5,
            "text": "I just dont enjoy doing most things alone - is that unhealthy?",
            "title_similarity": "0.5148984",
            "sentiment_compound": -0.8077
        },
        {
            "id": "hlsij8l",
            "score": 71,
            "text": "Man. As a person who fights codependence...\n\nAttacked!",
            "title_similarity": "0.34190506",
            "sentiment_compound": -0.7177
        },
        {
            "id": "hlsusga",
            "score": 72,
            "text": "Doing things alone kind of sucks. But if I didn't, I'd never do anything. I've met a few people on the way. I'd still rather do things with friends. I've learned some things \"need\" to be done with friends like a football game or the fights. There are others that can be done alone. The LPT is correct. I just wish I realized this at 20 and not 40",
            "title_similarity": "0.6187531",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hlt9pk7",
            "score": 27,
            "text": "A movie isn't better because someone else is there. \n\nConcerts are fabulous.   Even if you're \"alone.\"  You're still at a concert with hundreds if not thousands of other  people who like/ love that music. \n\nA good meal is good,  whether with a book or a friend. \n\nSource?  I don't have friends.   I still do the things.",
            "title_similarity": "0.3982104",
            "sentiment_compound": 0.9207
        },
        {
            "id": "hlt0rdf",
            "score": 9,
            "text": "Honestly, I've noticed more people show up when you tell them what you're doing and when than if you try to plan something with them. Super weird but it works",
            "title_similarity": "0.37632656",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hlsh49c",
            "score": 11,
            "text": "You can file this under \"make yourself more interesting\".",
            "title_similarity": "0.29309112",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hlspfto",
            "score": 531,
            "text": "Social Anxiety Monster laughs hysterically",
            "title_similarity": "0.14581345",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlswk1e",
            "score": 16,
            "text": "This is a really good advice but it takes courage to do things on your own and majority of people have social anxiety",
            "title_similarity": "0.47184592",
            "sentiment_compound": 0.6538
        },
        {
            "id": "hlsxdu4",
            "score": 18,
            "text": "That doesn't help going to parties if no one wants to/can party",
            "title_similarity": "0.67680657",
            "sentiment_compound": 0.2363
        },
        {
            "id": "hlt1d1n",
            "score": 25,
            "text": "The problem with going alone is that you feel even more alone and, eventually, lonely. This in turn makes you feel like shit and you'll feel even worse than before you started...",
            "title_similarity": "0.42284065",
            "sentiment_compound": -0.9134
        },
        {
            "id": "hlsvfp7",
            "score": 62,
            "text": "This pertains to moving away from home too people. I moved out of my moms and my place a year and some change ago and it was the best thing i ever did. I struggled with guilt over not bringing them with me to a new better enviroment but i can help them better from where I am now and i call every week. Just because you have strong bonds with your family dont let that keep you from forming your own life.",
            "title_similarity": "0.4723748",
            "sentiment_compound": 0.9343
        },
        {
            "id": "hlss90r",
            "score": 31,
            "text": "Am I imagining things or is this like the third time this lpt is given in just a few days?",
            "title_similarity": "0.20758954",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hlsjvk7",
            "score": 430,
            "text": "I (F65) just started traveling solo.  Get to do exactly what I want, where i want and have made some great friends and good acquaintances. Pandemic has kept my travels domestic but am nervous but looking forward to solo international.  First stop Peru next fall.",
            "title_similarity": "0.4411367",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hlt1mot",
            "score": 33,
            "text": "I was a stir crazy kid post high school. Joined a hippie commune (not really, just a free house in the woods with a bunch of other high af teenagers) for a year, applied to several cruise ships to be a server with no bites, considered moving to Alaska, wanted to get my pilots license until I discovered the cost, and got as far as MEPS in Boston to join the Marines before learning I was disqualified medically. I was SO. Sick. And tired. Of things falling through.\n\nMy friends were planning on going to NOLA to live with a family member, and I was SO IN. Made preparations, packed, and called my friends to coordinate bus tickets. Nah. They weren't going through with it.\n\nThis time, I said fuck it. I'm going alone. I packed up my bicycle, bought my ticket, took a 2 day bus ride from NH to LA, and stayed in a hostel while looking for a serving job. I met people from dozens of countries, shared life stories, and learned the back-assery of the city. I panhandled on Bourbon Street, became a shot girl at a bar for a stint, and generally lived life super hard.\n\nIt only lasted 6 months, but I fit a lot of life in doing that trip solo.",
            "title_similarity": "0.30633533",
            "sentiment_compound": 0.6247
        },
        {
            "id": "hlt21vm",
            "score": 31,
            "text": "Life is more enjoyable in general when you grow accustomed to yourself, and develop a relationship with self to the point where you’re okay with going out on little dates with just you. Brooding on who’s here or there does nothing but swallow you in loneliness.",
            "title_similarity": "0.51796734",
            "sentiment_compound": -0.274
        },
        {
            "id": "hlt95ae",
            "score": 42,
            "text": "Some times it makes depression worse for me when I go out with no one. It’s nice every now and then but damn some times it just feels like lemon juice in the wound. But that’s just me, I guess every ones different tho",
            "title_similarity": "0.40109825",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hltcu8k",
            "score": 44,
            "text": "“I know there’s this impression of me out there but I’m not lonely. I don’t have a lot of close friends, but I like living quietly and being private. That’s the way I am and I have a lot of interesting projects going on that I’m very happy about.” Keanu Reeves  \n\n\nThere's also one I love that I can't find to quote where a reporter asks him if he's lonely since he doesn't have a GF/wife and he says something to the effect of, \"I'm never lonely because I always have the company of myself. When I go out to a restaurant I'm treating myself to a nice dinner because I love myself. So I don't need someone in my life to love me.\"",
            "title_similarity": "0.5552396",
            "sentiment_compound": 0.9924
        },
        {
            "id": "hlsg10f",
            "score": 125,
            "text": "This is actually a really good tip but very hard to apply. I’ve done big things like traveled to Europe and gone to music festivals to small things like had breakfast/lunch/dinner and watched movies all by myself because others didn’t want to or backed out last minute.",
            "title_similarity": "0.40632057",
            "sentiment_compound": 0.8862
        },
        {
            "id": "hlsh73h",
            "score": 1734,
            "text": "One thing that I learned with a friend that has an absurd number of friends is to not just go out by yourself, but also start conversation with random people\n\n I met him when he suddenly asked me if I was a drummer, I said \"no\", and then he proceeded to invite me to his band. Turns out he didn't even had a band and we're friends for like ~13 years",
            "title_similarity": "0.3978305",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hlsnuq7",
            "score": 777,
            "text": "I can’t tell you how many rounds of golf I’ve had to cancel because people bail last minute. Just this year I’ve started going solo and/or willing to be grouped up with random strangers. Why should I not have fun because of other people.",
            "title_similarity": "0.39153695",
            "sentiment_compound": -0.5722
        },
        {
            "id": "hlszsuh",
            "score": 94,
            "text": "on that note - it's okay to go to the movies solo, too.",
            "title_similarity": "0.4319373",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hlskti3",
            "score": 368,
            "text": "I love just doing stuff on my own. I love going to the cinema on my own, or going out for a nice meal on my own. I like feeling comfortable in my own company.",
            "title_similarity": "0.40677515",
            "sentiment_compound": 0.9552
        },
        {
            "id": "hlskya2",
            "score": 245,
            "text": "My life changed immensely when I decided to exercise and go out to eat by myself.",
            "title_similarity": "0.452775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt8xib",
            "score": 1148,
            "text": "There's a quote by Jim Carrey which goes, \"Solitude is dangerous. It's very addictive. It becomes a habit after you realize how calm and peaceful it is.\"\n\nI personally find the reverse is equally true. If solitude can become an addiction, companionship can become a shackle. When you never go anywhere because you can't handle being by yourself, you just jail yourself.",
            "title_similarity": "0.5418308",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlsfnf1",
            "score": 4191,
            "text": "You will wait your life away waiting for others.",
            "title_similarity": "0.64904445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlsf8d7",
            "score": 693,
            "text": "Sir we’re going to have to relocate you to a smaller table if the rest of your party doesn’t show up soon",
            "title_similarity": "0.48335773",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hlt4fx1",
            "score": 3651,
            "text": "The same goes for relationships. If your spouse has floundered and never wants to see anyone or do anything don't let that stop you from living. Keep up with friends/family and *get out*. Your world shouldn't consist of just one person.",
            "title_similarity": "0.8101394",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hlsr7it",
            "score": 29,
            "text": "Kinda needed this. Been living with my grandma while I wait for someone so we can get an apartment but at ever turn there's a new hiccup. I love them, they're my best friend, but I can't keep couch hopping while working just so they aren't left high and dry. It's hard to commit to myself in situations like this",
            "title_similarity": "0.51218283",
            "sentiment_compound": 0.9731
        },
        {
            "id": "hlsyz5m",
            "score": 5,
            "text": ". . . So *you'll* go see the new Ghostbusters with me, OP? :)",
            "title_similarity": "0.30348152",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hlt0nlm",
            "score": 8,
            "text": "This is incredibly important. I would not have went on all of the amazing vacations I've went on had I waited around for someone else to go with me. Life is just too short to waste time not doing things just because you have no one else to do them with. A very crucial life skill is knowing how to enjoy your own company.",
            "title_similarity": "0.6620907",
            "sentiment_compound": 0.624
        },
        {
            "id": "hlt298u",
            "score": 2,
            "text": "i realized this almost a year ago and i have been doing things on my own ever since and ive been so happy bc of it",
            "title_similarity": "0.3410123",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hlt2ao6",
            "score": 14,
            "text": "I finally went to Disneyland by myself because I got tired of waiting for people who kept backing out on me. I went in Feb of 2020.\n\nThen found out months later I was there with covid.",
            "title_similarity": "0.44098893",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hlt2q2l",
            "score": 2,
            "text": "So today I've been considering if going to a fetlife event by myself is a good idea. Worst case I suppose I'll pay like equivalent of $20, sit alone for an hour or two and go home.",
            "title_similarity": "0.3234005",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hlt2s18",
            "score": 12,
            "text": "Alright thats it, I’m going out for pizza :D",
            "title_similarity": "0.24058479",
            "sentiment_compound": 0.7213
        },
        {
            "id": "hlt3dk4",
            "score": 8,
            "text": "I have massive anxiety so for a lot of things, I **need** an anchor, so if you constantly agree-bail on me, I'm never going to try or want to do things with you, I'll try to find someone else who wont agree-bail.\n\nAnd if that means I can't go out, so be it.",
            "title_similarity": "0.7041242",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hlt3ojt",
            "score": 1,
            "text": "Damn laser tag is gonna be fun",
            "title_similarity": "0.25457662",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hlt40qr",
            "score": 8,
            "text": "Good tip.\n\nWe have a friend who never shows up to plans on time. We've tried telling them earlier times to get them to show up when we want, but hasn't quite worked. Now we say, \"We are leaving (the house) at X time. You are more than welcome to ride with us, but if you're running late then you can meet us where we're going.\"",
            "title_similarity": "0.56351507",
            "sentiment_compound": 0.8233
        },
        {
            "id": "hlt4ztc",
            "score": 3,
            "text": "Big thing. \n\nFind something you enjoy doing yourself. \n\nOthers can join you, but hell I love doing things solo. Concerts, movies, etc. It's a very nice experience.",
            "title_similarity": "0.38064328",
            "sentiment_compound": 0.7383
        },
        {
            "id": "hlt5dtm",
            "score": 1,
            "text": "Absolutely! Be the person you want to date e.g. the best you know - YOU! x",
            "title_similarity": "0.37136626",
            "sentiment_compound": 0.7256
        },
        {
            "id": "hlt5du3",
            "score": 1,
            "text": "Also don’t be the person who makes plans and then talks themself out of going.",
            "title_similarity": "0.77512777",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt5j2l",
            "score": 3,
            "text": "Absolutely this ! I've been to so many concerts and different events in different cities completely by myself simply because I thought \"just because no one else can go, why should I miss out ?\" It's changed my life for the better, I've had so many good experiences and met lots of new people that I now call friends. I frequent the cinema alone too, it's really not as bad as you might think it is; no one even looks at you !",
            "title_similarity": "0.4675082",
            "sentiment_compound": 0.783
        },
        {
            "id": "hlt6drv",
            "score": 2,
            "text": "This is how I met my wife. I just started doing stuff. I was sick of waiting around for other people. Started off big with getting my skydiving license. Then I started traveling around.",
            "title_similarity": "0.38567948",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hlt7mt4",
            "score": 1,
            "text": "Learn to be your own best friend.",
            "title_similarity": "0.49638736",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hlt7vy3",
            "score": 1,
            "text": "This is really REALLY important. I've had amazing experiences simply because I decided to do something when none of my friends wanted to leave their houses.",
            "title_similarity": "0.59248304",
            "sentiment_compound": 0.631
        },
        {
            "id": "hlt8mae",
            "score": 2,
            "text": "I FEEL CALLED OUT\nTIME TO GO OUT",
            "title_similarity": "0.39272556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt8x7y",
            "score": 1,
            "text": "Yes!! I started doing this 2019 with theme parks and it's been such a blast. Don't need to worry about anyone else, don't need to care about keeping anyone else happy or people bailing. \n\nFor my birthday recently, I invited a friend to a museum with me and honestly wish I'd just gone alone. Her not wanting to be there kinda ruined it.",
            "title_similarity": "0.5268163",
            "sentiment_compound": 0.8969
        },
        {
            "id": "hlt92ya",
            "score": 2,
            "text": "As a woman, I want to be around.",
            "title_similarity": "0.34310758",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hlt97iv",
            "score": 2,
            "text": "This is what I started doing for concerts and other performances. Felt like I had to go with people and a few years ago decided screw it I’ll go alone. It was a much more enjoyable experience when I didn’t have to worry if others were also having a good time.",
            "title_similarity": "0.5453961",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hlt9gr3",
            "score": 2,
            "text": "This is how I got a boat ($600 small one) and found a public body of water near me I never new existed. Changed my life forever",
            "title_similarity": "0.24941874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt9ic3",
            "score": 1,
            "text": "Trying so hard to get better at this.",
            "title_similarity": "0.3607128",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hlt9vbk",
            "score": 1,
            "text": "And where am I supposed to go alone? Get me a beer and sit on a bench?",
            "title_similarity": "0.40706527",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hltabys",
            "score": 2,
            "text": "Got heckled by someone in town once going, \"on yer own!\", who was in a group sat on some steps while I was walking past by myself, just going about my business. I wondered how the hell they got anything done, if not willing to be a big person and do shit by themselves.",
            "title_similarity": "0.5427872",
            "sentiment_compound": -0.8588
        },
        {
            "id": "hltafqv",
            "score": 1,
            "text": "Doing shit alone is so underrated.",
            "title_similarity": "0.47155315",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hltauo4",
            "score": 1,
            "text": "Also there is nothing wrong being out by yourself. \n\nIMO, you need to be comfortable with yourself and no better way to do this than to go out alone and make all the decisions for what you enjoy.",
            "title_similarity": "0.753182",
            "sentiment_compound": 0.6856
        },
        {
            "id": "hltavup",
            "score": 2,
            "text": "This was one of the biggest tips when i was first divorced and didnt know how to be alone\n\nEventually i discovered the joys of dining alone, going to sporting events alones,random trips\n\nIt was fucking cathartic",
            "title_similarity": "0.42544273",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hltavyx",
            "score": 1,
            "text": "I’ve started taking myself on dates. I’ll go to my favourite coffe spot, go to a museum, have fancy lunch and people watch. It’s my favourite day of the week! The freedom to do whatever I want and at my pace. Plus when I’m alone I’ll always end up in a conversation with someone who is also out alone, you’ll be surprised how many others there are!",
            "title_similarity": "0.4158327",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hltavzg",
            "score": 1,
            "text": "To add to this, if you do things you enjoy on your own, you're bound to meet people with similar interests.",
            "title_similarity": "0.44044697",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hltb00c",
            "score": 5,
            "text": "Why feel awkward and unhappy for free, when you can spend money to feel that way?",
            "title_similarity": "0.44430923",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hltb2yh",
            "score": 1,
            "text": "Just to clarify, this doesn't mean you can't want to have friends to do things with or that you can't be a bit sad you have to do stuff alone.\n\nIt only means you shouldn't let others participation set the phase of your life. Some experiences are better with friends for sure, but anything is better than nothing and a surprising amount of things can be enjoyed a lot even alone.",
            "title_similarity": "0.7037461",
            "sentiment_compound": 0.8233
        },
        {
            "id": "hltb9bt",
            "score": 1,
            "text": "Things are boring by myself tho",
            "title_similarity": "0.48828351",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hltbkg8",
            "score": 1,
            "text": "I used to go out alone a lot few years ago, but now its like I’m terrified to go to a restaurant/cafe alone",
            "title_similarity": "0.4762035",
            "sentiment_compound": -0.7391
        },
        {
            "id": "hltbwjx",
            "score": 1,
            "text": "Amen!  I went to a new bar in town by myself to watch a game because all my buddies were busy with their SO’s and I ended up getting laid.",
            "title_similarity": "0.33470312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltc4p6",
            "score": 2,
            "text": "Doing things on your own is VERY HARD at first. But once you make a couple positive experiences it is shocking how great it can be.",
            "title_similarity": "0.4280327",
            "sentiment_compound": 0.7858
        },
        {
            "id": "hltc9i0",
            "score": 2,
            "text": "Great advice. I'm going to the Indian restaurant I've always wanted to try by myself tonight because none of my friends like Indian food. More lamb vindaloo for me then, fuck those guys.",
            "title_similarity": "0.46905398",
            "sentiment_compound": 0.1396
        },
        {
            "id": "hltcnej",
            "score": 2,
            "text": "I recently got stood up for a date to see a movie.\n\nI went and saw the movie by myself cause fuck it why not.",
            "title_similarity": "0.40285313",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hltd163",
            "score": 1,
            "text": "I went to the theatre alone once, it sucked",
            "title_similarity": "0.40469447",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hltd54z",
            "score": 1,
            "text": "What if I don’t care about the activity itself but just to spend time with people?",
            "title_similarity": "0.6053847",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hltd5uj",
            "score": 1,
            "text": "I just went on a week long solo trip to LA and San Diego. Couldn’t find anyone that wanted to join, and I’m very happy that I did it",
            "title_similarity": "0.36383992",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hltda88",
            "score": 1,
            "text": "Learned this a while ago. As an avid concert goer, I would sometimes find that I couldn't find a friend to attend with me. Went to my first solo concert probably about 10 or so years ago, had an absolute blast! Now, I don't worry so much if no one wants to go, or can't go with to a concert or show. Plus, You get to make neat new friends!",
            "title_similarity": "0.42701876",
            "sentiment_compound": 0.735
        },
        {
            "id": "hltde4v",
            "score": 1,
            "text": "Instead of asking \"do you want to go to 'X' with me?\" Try saying \"I'm going to \"X\" at this time, you are welcome to join if you'd like.\"\n\nMaking a statement about going, not reliant on their company for you to go. Really changed how I approach asking people to do things.",
            "title_similarity": "0.6502298",
            "sentiment_compound": 0.767
        },
        {
            "id": "hltdjir",
            "score": 1,
            "text": "Easier said than done if you have zero money to do shit with + don't even know what to spend your time on in the first place",
            "title_similarity": "0.60431314",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hltdt4o",
            "score": 1,
            "text": "Yes! You'll be much happier, plus you'll have cool stories to tell those who didn't go.",
            "title_similarity": "0.39830646",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hltdvfs",
            "score": 1,
            "text": "Why would anyone follow a person to do anything if they aren't even willing to do it themselves.",
            "title_similarity": "0.6675106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlte5hl",
            "score": 1,
            "text": "I know I've had people ask me why I don't ask people to go with me when I go to Warhammer events and I just laugh since most of my friends aren't into it so I'd never go if I hadn't found the courage to just run solo.",
            "title_similarity": "0.55231494",
            "sentiment_compound": 0.6526
        },
        {
            "id": "hlte6fx",
            "score": 1,
            "text": "This was me until my first major breakup. Also doing thing on your own is pretty awesome!",
            "title_similarity": "0.45485952",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hlte9u6",
            "score": 1,
            "text": "Inviting others to your plan is a great way to make friends too. “Hey I am going to do XYZ and you are welcome to join if you like”",
            "title_similarity": "0.3430655",
            "sentiment_compound": 0.9287
        },
        {
            "id": "hltee7x",
            "score": 1,
            "text": "Yes! I started going to shows and festivals alone a few years ago because I loved EDM, but nobody in my social circle at the time cared for it. Fast-forward 1.5 years later, and this is how I met my husband. :D",
            "title_similarity": "0.35143775",
            "sentiment_compound": 0.9336
        },
        {
            "id": "hltegjg",
            "score": 1,
            "text": "I've played a lot more golf with this attitude.\n\nTrying to coordinate a 4some with friends can be a nightmare sometimes.",
            "title_similarity": "0.29507464",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hltehgp",
            "score": 1,
            "text": "Can I still be the person who never gets out because he feels sick all the time, has a hard time making conversation, and has nothing of value to say other than making people feel sorry for him over how shitty his life has become? Because I can make my own plans, I'm just not sure I can stop doing those other things.",
            "title_similarity": "0.5801015",
            "sentiment_compound": -0.9152
        },
        {
            "id": "hltehsc",
            "score": 1,
            "text": "I went to the museum the other day by myself, and some friends walked out as I was going on. They were totally weirded out that I was alone and asked if I wanted them to stay for the company. I wanted to say, \" If I wanted company, I would have called y'all,\" but I just said, \"No thanks. I prefer to visit alone bc I like to take my time in each exhibit.\"",
            "title_similarity": "0.52221704",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hltenad",
            "score": 1,
            "text": "Going to a concert by myself soon 😅",
            "title_similarity": "0.4682803",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hltevah",
            "score": 1,
            "text": "Thank you, I actually needed that tip",
            "title_similarity": "0.33290708",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hltf02u",
            "score": 1,
            "text": "Been doing this for awhile and it’s empowering in a way, I love it. Once you learn how to become comfortable with your own company nothing will get in your way.",
            "title_similarity": "0.57927686",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hltf1tb",
            "score": 1,
            "text": "Thanks, I needed this. It’s an obvious solution, but one I have to emotionally reconcile with myself.\n\nI’m being absolutely genuine, really thank you.",
            "title_similarity": "0.4490881",
            "sentiment_compound": 0.7707
        },
        {
            "id": "hltf44u",
            "score": 1,
            "text": "This is so true! I’m from Europe and went to Florida on my own in 2011 and 2013. I had a great time and met some nice people.\nBut everyone was like: you’re so brave, good on you for going alone, I could never do that…\nThese reactions really surprised me! If I want to go somewhere and none of my friends wants to come why should I stay home??? I mean, it’s Florida, not the middle of the jungle… if something was to happen there would be people around to help…",
            "title_similarity": "0.5453721",
            "sentiment_compound": 0.9574
        },
        {
            "id": "hltfjhl",
            "score": 1,
            "text": "People who rely on your attention get really pissed when you live your life this way. Fuck em.",
            "title_similarity": "0.38791594",
            "sentiment_compound": -0.8399
        },
        {
            "id": "hltfri9",
            "score": 1,
            "text": "I needed this energy.",
            "title_similarity": "0.29402655",
            "sentiment_compound": 0.3346
        },
        {
            "id": "hltg1zi",
            "score": 1,
            "text": "This was me to a T 2 years ago. I couldnt do anything without others and every time I had a  plan it fell through because of my need for companions. I started inviting people and setting times and heading out at that time. I've seen places in my city I've never been to before and met amazing people on trails. Best move I ever made for myself.",
            "title_similarity": "0.40266445",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hltg56a",
            "score": 1,
            "text": "I needed to see this today",
            "title_similarity": "0.37976724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltgagb",
            "score": 1,
            "text": "I love every time this tip comes up. Just do it!!!! I stepped out of my comfort zone and went to the movie theatre alone. It wasn’t as weird as I thought it’d be. Then I started talking to random people! Being social is still quite taxing but I overcame the hurdle that stopped me from taking the initiative.",
            "title_similarity": "0.5150237",
            "sentiment_compound": 0.3222
        },
        {
            "id": "hltgdi1",
            "score": 1,
            "text": "I had been wanting to go to a comedy show in Toronto for weeks. After my friends and girlfriend said no for the hundredth time I just went myself - best decision ever!",
            "title_similarity": "0.3344482",
            "sentiment_compound": 0.8356
        },
        {
            "id": "hltgghu",
            "score": 1,
            "text": "as an introvert, i approve this.",
            "title_similarity": "0.30140454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltgj8h",
            "score": 1,
            "text": "This is why I like to visit museums by myself...\n\nI could spend hours in certain sections that if I went with friends we probably would only spend minutes in...",
            "title_similarity": "0.3959882",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hltglp0",
            "score": 1,
            "text": "This is great advice that I finally took this past summer.  I've been planning a long trip to a very remote place for 5 years and I could never get the timing right with my family (as I wanted them to accompany me).  I had to resolve to go alone.  I was an amazing experience and being alone made it even more so (although I still wish my family could have experienced it with me). But the made me promise to make a video of the trip so they could share it with me when I got home. So it worked out amazingly!",
            "title_similarity": "0.35737163",
            "sentiment_compound": 0.9009
        },
        {
            "id": "hltgnkg",
            "score": 1,
            "text": "I went to a festival by myself last weekend because my friend pulled out, I ended up having the time of my life and made loads of new friends. Just be safe out there",
            "title_similarity": "0.36219072",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hltgnvw",
            "score": 1,
            "text": "Same goes for travel. I  canceled a trip once because the person I was supposed to go with canceled and I listened to the people saying that a young girl shouldn't travel alone.\nI regreted not going and planned my next trip alone even though my family tried to convince me not to.\nSince I have been to 7 countries alone  and love solo travel. You have a lot of options when you are alone and it allows you to meet new people.",
            "title_similarity": "0.5269116",
            "sentiment_compound": 0.4479
        },
        {
            "id": "hltgqc1",
            "score": 1,
            "text": "I needed this today. Booking a solo trip to a holiday party for a virtual club I’m part of and it’s a 6 hr drive away. I have some friends in the area but they’re being non committal about making plans while I’m in town (one has kids so I get it, the other is just kinda shitty about committing to plans more than 2 days in advance). Started getting cold feet about it and thought, “Oh no I’ll get there and have one full day of activities and then nobody to do stuff with!” WRONG! I’ll have me!",
            "title_similarity": "0.47073942",
            "sentiment_compound": -0.8905
        },
        {
            "id": "hltgtue",
            "score": 1,
            "text": "Yes, make your own plans. But at the same time don't forget to invite people to join you. That way, even if they can't make it, you still got to do the cool thing you wanted to do and you also reached out. They will remember that and invite you the next time they plan something.",
            "title_similarity": "0.6809612",
            "sentiment_compound": 0.8567
        },
        {
            "id": "hltgxsi",
            "score": 1,
            "text": "Hell is other people.  Be kind to others.  Involve them, but do not depend on any but a very select few.",
            "title_similarity": "0.6777841",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hlthgu2",
            "score": 2,
            "text": "Volunteer!\n\nPeople will be waiting you to show up, and happy to see you. ￼\n\nYou’ll feel good about your self,￼￼ and grow personal confidence and a feeling of self-worth￼ knowing you’re helping your community￼",
            "title_similarity": "0.37282",
            "sentiment_compound": 0.9168
        },
        {
            "id": "hlthhec",
            "score": 1,
            "text": "GO TO THE CINEMA AND CONCERTS ALONE! ITS GREAT",
            "title_similarity": "0.38401803",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hlthun2",
            "score": 1,
            "text": "That's so easy to say. Basically your advice is \"don't suffer from mental illness or anxiety\"",
            "title_similarity": "0.62758684",
            "sentiment_compound": 0.3905
        },
        {
            "id": "hlthvvr",
            "score": 1,
            "text": "I can remember putting up a post on facebook asking people if anyone wanted to come for food and for a movie with me, I got zero responses so I went anyway. I went to TGI fridays as it's my favourite and sat at the bar and ate my delicious meal, then I went to the cinema and looked at what was on, did a little youtube at some of the trailers as I hadn't heard of any of them, settled on the best one at the time being Don Jon (lol). \n\nI actually had a great time!",
            "title_similarity": "0.30688858",
            "sentiment_compound": 0.9441
        },
        {
            "id": "hlthw0b",
            "score": 1,
            "text": "I remember asking friends for years to go to Tulum with me. I even got to the point where i wouldve paid a friends way if they couldnt afford it. One thing after the next, noone was really able to go either it due to job, kids, whatever, things just never lined up. After a year went by i said screw it and went for my first solo trip out of the country. It ended up being the best vacation i ever went on. No need to entertain, could sleep for an entire day if i wanted to lay in bed and watch the waves. You 100% dont need others to make plans.",
            "title_similarity": "0.43476707",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hlthyjy",
            "score": 1,
            "text": "@ me next time haha",
            "title_similarity": "0.36983454",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hlti37r",
            "score": 1,
            "text": "This.\n\n I enjoy traveling around and seeing new places, eating out and experiencing new things. I'd always had someone to join me though..but now I don't.\n\n\nJust because I'll be going solo, doesn't mean I won't enjoy myself, and the sights to see will still be there and just as wonderful without a partner in tow.",
            "title_similarity": "0.59482276",
            "sentiment_compound": 0.7559
        },
        {
            "id": "hlti7n2",
            "score": 1,
            "text": "Youre right!\n\nIm finally going to try the teeter totter. Wish me luck!",
            "title_similarity": "0.43636215",
            "sentiment_compound": 0.7418
        },
        {
            "id": "hltie5s",
            "score": 1,
            "text": "I swear this tip keeps popping up on the top posts every 3-6 months",
            "title_similarity": "0.03682784",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hltifjo",
            "score": 2,
            "text": "I went to see Bowie in concert by myself because no one else wanted to go.\n\nEnded up being his last would tour and the best show I've ever seen to this day.",
            "title_similarity": "0.49646905",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hltikya",
            "score": 1,
            "text": "Met my wife because I went anyway. \n\nI tried to get a group together for a party at a local community center. \n\nNo one wanted to go... So i.went anyway.. \n\n3 years later. Married. \n\n10/10 always go.anyway.",
            "title_similarity": "0.36962485",
            "sentiment_compound": 0.128
        },
        {
            "id": "hltil4e",
            "score": 1,
            "text": "“Sorry kids, but dad cannot wait for you. I’m off to Disneyland!”\n\nLike that?",
            "title_similarity": "0.49587464",
            "sentiment_compound": 0.5487
        },
        {
            "id": "hltimg4",
            "score": 1,
            "text": "My friend group is very indecisive as a whole and it doesn't take much to have many of them bail one after the other or it's a challenge to have them commit to things until last minute once they know other people are going. It drove me up the wall for many years trying to organize outings to go camping or as simple as going to the bar for the game. I stopped asking who is in and trying to go from there and started saying I'm going here at this time or I'm going camping this weekend and you are all invited. It relieved much of my stress and frustration and resulted in more people showing up for things.",
            "title_similarity": "0.5158743",
            "sentiment_compound": -0.2006
        },
        {
            "id": "hltir4o",
            "score": 1,
            "text": "Ugh. I literally backed out of going to see the new Ghostbusters by myself today because I didn't want to go alone. So I've been doing NOTHING at home all day. Lame.",
            "title_similarity": "0.5885469",
            "sentiment_compound": -0.7732
        },
        {
            "id": "hltisvy",
            "score": 1,
            "text": "Went to a basketball game last night by myself. Got a little toasted, took an uber home solo. One of the best nights I've had in years. I was able to enjoy the game without feeling like I had to be someone in front of people.",
            "title_similarity": "0.33430773",
            "sentiment_compound": 0.7114
        },
        {
            "id": "hltiww9",
            "score": 1,
            "text": "It’s good advice but it still doesn’t feel great experiencing life alone. I try to do stuff by myself and it’s honestly kinda miserable most times. You try to have a good time but the whole time you are thinking “this would be better if there was people to share it with.”\n\nI’ve tried therapy and I just don’t believe that I can ever truly be comfortable with just myself. Life just feels so incredibly lonely even when you have people in it.",
            "title_similarity": "0.54420894",
            "sentiment_compound": 0.968
        },
        {
            "id": "hltj0ka",
            "score": 1,
            "text": "Doing this greatly improved my life",
            "title_similarity": "0.18483259",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hltj8ct",
            "score": 1,
            "text": "I agree, but I truly do enjoy doing things with other people a lot more!",
            "title_similarity": "0.23228455",
            "sentiment_compound": 0.8805
        },
        {
            "id": "hltjb5w",
            "score": 1,
            "text": "Add on to this, if you already have plans, don't change them just because other people are doing something else. Personal time is important too.",
            "title_similarity": "0.71438897",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hltjbvd",
            "score": 1,
            "text": "So just go out drinking on my own?",
            "title_similarity": "0.5497421",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltjeee",
            "score": 1,
            "text": "I'm new to a city and don't feel comfortable going out on my own without my boyfriend. But last Friday I said, heck, I want to go get a beer at this local dive and then go home. Went out alone, met some people playing pool there, stayed out for hours having a blast with now-new acquaintances, AND I am now the newest member of a pool league. DO IT FOLKS.",
            "title_similarity": "0.3821314",
            "sentiment_compound": -0.1781
        },
        {
            "id": "hltjt19",
            "score": 1,
            "text": "I will never understand the weird  problem Americans have with being out alone.",
            "title_similarity": "0.6351787",
            "sentiment_compound": -0.4909
        },
        {
            "id": "hltjxpu",
            "score": 1,
            "text": "I agree, but also after doing this forever it does tend to get lonesome",
            "title_similarity": "0.47629488",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hltk2js",
            "score": 1,
            "text": "This is how I met some of my closest friends and partner. Originally made plans with other friends to play some golf, the day came around and it was a bit colder than expected and they canceled on me. Decided I still wanted to play some golf and went by myself. Played a few holes by myself until I ran into a group  playing that invited me to play with them.  Ended up playing more than the half I expected and went out to dinner that night with them. 7 years later I consider them close friends, never would of met them if I decided to not go alone.",
            "title_similarity": "0.41211987",
            "sentiment_compound": 0.9649
        },
        {
            "id": "hltk3bi",
            "score": 1,
            "text": "I went to a concert 10 years ago by myself after a friend bailed. Now I go to all concerts alone. Nobody to hold me back and I have way more fun.",
            "title_similarity": "0.40298623",
            "sentiment_compound": 0.6997
        },
        {
            "id": "hltk5eh",
            "score": 1,
            "text": "I still won't go to a restaurant alone, wish I could get over that!",
            "title_similarity": "0.6917783",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hltk6pt",
            "score": 1,
            "text": "What am I going out for?",
            "title_similarity": "0.40196553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltk6zu",
            "score": 1,
            "text": "This goes for everything in life, not just recreation plans. I waited years for my friends/colleagues to be ready to leave our jobs and start our own business. When the business actually got started I ended up being the one doing all the work anyways, and found out I had probably been ready, to do it by myself, for years.",
            "title_similarity": "0.4976956",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hltk9ha",
            "score": 1,
            "text": "The plans that I make are to buy high and sell low!  It’s been working pretty well so far.\n\nSince the title wasn’t clear, I was thinking that it referred to life plans but apparent it refers more to making play dates with yourself.  LOL",
            "title_similarity": "0.4549291",
            "sentiment_compound": 0.9098
        },
        {
            "id": "hltkcw6",
            "score": 1,
            "text": "Anyone want to take this advice with me",
            "title_similarity": "0.39983195",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hltki17",
            "score": 1,
            "text": "I've started doing this since none of my friends want to make plans with me and although it's freeing, there's some things that just are more fun with friends.",
            "title_similarity": "0.6919813",
            "sentiment_compound": 0.8318
        },
        {
            "id": "hltkjt2",
            "score": 1,
            "text": "This is 100% solid advice. I used to be one of those people who was too afraid of doing things by myself, and holy shit did I miss out on a  lot of things! It started with something so small as going out to eat by myself. Taking road trips by myself. Camping and hiking more which I love to do, but no one ever wanted to go with me, or didn't invite me along because they thought I wasn't physically capable. I go to my local amusement park alone. I'm going to my first big concert alone in 2 weeks. I just registered for my first Spartan race, alone. \n\nBeing alone is not terrible, I actually quite enjoy it a lot of times. Missing out on the shit that makes you happy in life is the tragedy, so don't ever let anyone keep you from that, especially yourself.",
            "title_similarity": "0.4867049",
            "sentiment_compound": 0.116
        },
        {
            "id": "hltkkr8",
            "score": 1,
            "text": "Things I regret not doing by myself now that I have a family:\n\nSeeing a movie\n\nEating in a restaurant (especially if it’s expensive)\n\nGoing to the zoo/aquarium (I went to an art museum by myself and it was amazing)\n\nSeeing a live band\n\nI know I can do these things by myself but I would rather do it with my family, I genuinely enjoy their company. However, I wish I spoiled myself a little more back then.",
            "title_similarity": "0.41336566",
            "sentiment_compound": 0.8537
        },
        {
            "id": "hltkooz",
            "score": 1,
            "text": "Unless you're planning on playing tennis.",
            "title_similarity": "0.3717146",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hltkqqo",
            "score": 1,
            "text": "I'm all for this and I love doing things by myself, I even sometimes meet other people when going out alone... \\*but\\* the truth is that it can also get exhausting, having some people willing to go out with you is definitely a plus.",
            "title_similarity": "0.47186548",
            "sentiment_compound": 0.6542
        },
        {
            "id": "hltkrqe",
            "score": 1,
            "text": "For the most part This is way easier said than done . Im in college and had a few times where I could’ve gone to a party but didn’t had nobody to go with so I stayed in . What are u supposed to do in a situation like that where you don’t know anybody ? Op doesn’t even pose an solution to the very reason people choose not to go alone .",
            "title_similarity": "0.62141955",
            "sentiment_compound": 0.8767
        },
        {
            "id": "hltkx2u",
            "score": 1,
            "text": "I swear, this is the 20th time I've seen this this week.",
            "title_similarity": "0.16182338",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hltl1ax",
            "score": 1,
            "text": "“Do not walk behind me for I will not lead.\n\nDo not walk in front of me for I will not follow. \n\nSimply walk beside me and be my friend” \n\nAlbert Camus. \n\nThis is what I live by. I’ve Walked with many and walked alone much, much more.",
            "title_similarity": "0.7333574",
            "sentiment_compound": -0.25
        },
        {
            "id": "hltl8e3",
            "score": 1,
            "text": "i have a tough job with long hours, coupled with crippling anxiety and depression, makes things hard\n\ni started doing things again recently - 'stick to the plans' is so key... just DO IT and you will feel incredible afterwards",
            "title_similarity": "0.3844326",
            "sentiment_compound": -0.743
        },
        {
            "id": "hltla2h",
            "score": 1,
            "text": "I read something similar a few years back in r/travel. A guy was saying how him and his friend wanted to go to Australia but every time he made plans his friend would make up excuses time and time again. So finally he went alone because he didn’t want to miss out on the experience.  I took his story to heart and booked my first solo trip to Peru after that and had a blast! Now I make plans for things as small as going for a walk, movies, dinner to as big as international travel. If the person bails on me I still go. I don’t want to miss out on anything because someone else can’t commit to plans.",
            "title_similarity": "0.47995052",
            "sentiment_compound": 0.9168
        },
        {
            "id": "hltldrr",
            "score": 1,
            "text": "Thanks. I needed that.",
            "title_similarity": "0.27351034",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hltlf1o",
            "score": 1,
            "text": "OMG. Thanks so much.",
            "title_similarity": "0.19647902",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hltlgv2",
            "score": 1,
            "text": "I hope everyone can do this. Some people are just too dependent.",
            "title_similarity": "0.49947324",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hltljkl",
            "score": 1,
            "text": "Yep. I go to movies and sometimes dinner by myself. I mean, I have a wife and kids but if it's my turn to go out, I don't always go out with others. I'm too old now to care what people think of a dude watching a movie by himself.",
            "title_similarity": "0.39885563",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hltljoz",
            "score": 1,
            "text": "When I was 17 I booked a music festival with 2 others, and the night before they both backed out. I ended up going by myself because I wanted to see a few acts and I ended up meeting a group of lads at the Bus Station on the way and spent the weekend with them. Actually one of the best weekends of my life.",
            "title_similarity": "0.31457287",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hltlnc3",
            "score": 1,
            "text": "I was in Toronto with some friends and wanted to visit niagra but they had no money on the last few days so I went by my self, was superb!",
            "title_similarity": "0.3882038",
            "sentiment_compound": 0.7345
        },
        {
            "id": "hltlte7",
            "score": 1,
            "text": "Easier said than done especially if you have social anxiety and also introverted. I guess you just have to take the plundge and see what happens 🤷",
            "title_similarity": "0.43158287",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hltlthk",
            "score": 1,
            "text": "Yep. I started doing this a few years ago and now I am more independent and have more fun.\n\nIn general, the independently capable you are in every aspect of life, the happier you are.\n\nWe all need one another, but there's an insane amount we can accomplish in life solo. And it's good practice when you have to pick up the slack for others when times get rough with family, friends, a d relationships.",
            "title_similarity": "0.49333155",
            "sentiment_compound": 0.9331
        },
        {
            "id": "hltlx0f",
            "score": 1,
            "text": "Yep. I run by myself, lift weights by myself, and see movies at least once a week, often by myself (AMC A-List ftw). The only hobbies I 100% share w/ somebody else is mtn biking w/ my dad. I see my hobbies as my “me time”, to disconnect from the chaos and suffocation of work. Helps to be single also.",
            "title_similarity": "0.39473325",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hltlx8g",
            "score": 1,
            "text": "I needed to hear this today. Thank you for the reminder!",
            "title_similarity": "0.3971452",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hltm378",
            "score": 1,
            "text": "Though I would have liked going to concerts with friends in the past, I would have regret not going at all. It’s not my fault they didn’t want to listen to orchestral music.",
            "title_similarity": "0.6419296",
            "sentiment_compound": 0.6866
        },
        {
            "id": "hltm37f",
            "score": 1,
            "text": "100% this. When I was younger, I tried to convince some of my friends to go to concerts and they’d say no. I bought a ticket and went anyways. On 3 seperate occasions (by myself) I got to meet Motörhead, Dimebag Darell (only a few months before his death) and all of GWAR. Their loss. ¯\\_(ツ)_/¯",
            "title_similarity": "0.39348704",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hltm415",
            "score": 1,
            "text": "Learned it the hard way. Absolutely agree.",
            "title_similarity": "0.3678595",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hltm4ed",
            "score": 1,
            "text": "Feel like I see this post once a month on here",
            "title_similarity": "0.12429959",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hltm5i2",
            "score": 1,
            "text": "I started doing this within the past few months or so. I’ve gone to a handful of concerts, a few comedy shows, and just out to the bar quite a few times now, and I’m loving it. I usually just sit up at the bar if I can, I’ve gotten to know/meet quite a few people doing it too.",
            "title_similarity": "0.12788759",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hltm7lm",
            "score": 1,
            "text": "My friends and I had plans to go to a haunted house but they all bailed on me at the last minute. I thought, to hell with it, I'm gonna go by myself and have a fun time anyway. It was great because I wasn't a fifth wheel like usual and I actually made good conversation with the couple in front of me. 10/10 would do again.",
            "title_similarity": "0.4317763",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hltmapc",
            "score": 3,
            "text": "Always like seeing posts like this come back. Going to my first concert solo was one of my best decisions ever. You probably won't be the only one solo either. No one cares, everyone is there to see a good show and have a good time. I've had countless conversations that start over a band shirt. Go for it.",
            "title_similarity": "0.43447286",
            "sentiment_compound": 0.8839
        },
        {
            "id": "hltmco0",
            "score": 1,
            "text": "Rave by yourself. Sightsee by yourself.\n\nIt's super fucking nice to not have to care about what others want to do.",
            "title_similarity": "0.58306926",
            "sentiment_compound": 0.6873
        },
        {
            "id": "hltmd2a",
            "score": 1,
            "text": "Also don't let others ruin your plans. If others consistently miss your plans, just go find someone else who will not.",
            "title_similarity": "0.7914411",
            "sentiment_compound": 0.3553
        },
        {
            "id": "hltmpdw",
            "score": 1,
            "text": "As my dad would say, \"there's always something to do\". It took me awhile to understand, but he's right. Vacuum your car out, the house whatever. Clean windows, laundry. It's rewarding af, you sleep better. Nobody has to join you in these things. We are creatures of habit, best establish healthy ones.",
            "title_similarity": "0.59849995",
            "sentiment_compound": 0.978
        },
        {
            "id": "hltmqq0",
            "score": 1,
            "text": "My sister and I recently went on a trip together to Hawaii. I just learned how to scuba dive and was excited to go even though my sister doesn't dive. My spouse thought that I was crazy to book scuba excursions with just strangers but it turned out that the majority of the divers on the boat had left their loved ones back at the resort and were there alone. We had a great time and I got to meet new people who had great stories to share.",
            "title_similarity": "0.3548477",
            "sentiment_compound": 0.9636
        },
        {
            "id": "hltmu3j",
            "score": 1,
            "text": "I try to do things but when it's the day or time to actually do it I'm like meh",
            "title_similarity": "0.49178937",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hltn1cz",
            "score": 1,
            "text": "It drives my father (who thinks I will be kidnapped, murdered, etc for breathing in public) to madness that I now have a moped and just leave on nice days when my siblings won't bother to go with me places.\n\nThat said even with my dog it is terribly unnerving to go for hikes/walks in the woods alone. I did not enjoy it, which sucks, because I love nature.",
            "title_similarity": "0.4314785",
            "sentiment_compound": -0.8478
        },
        {
            "id": "hltn468",
            "score": 1,
            "text": "Agreed!!\n\nWhen I was with my ex, I stopped waiting around for him b/c I was constantly cancelling my plans simply b/c he would have this habit of waiting until the last minute to tell me he didn't want to. So I started doing stuff out on my own & eventually he caught on & tried inviting himself out with me & it was always a fight with him when I told him \"no\". In his mind, if he didn't want to go then I couldn't go either. He was really insecure & had this idea that I would talk shit about him with the people I was with or even not return back to the house so he wanted to \"keep an eye on me\". It was mentally exhausting. He finally broke things off saying I \"treated him like shit\" (when this actually translates into \"I need a woman that will do as I say\"). \n\nLast I recall, he was couch hopping before he moved in with his new girl & is giving her the same treatment he gave me.",
            "title_similarity": "0.60823405",
            "sentiment_compound": -0.9277
        },
        {
            "id": "hltn56w",
            "score": 3,
            "text": "Seems a bit awkward to invite someone to join me when I go to brothels.",
            "title_similarity": "0.45488292",
            "sentiment_compound": 0.296
        },
        {
            "id": "hltndhu",
            "score": 2,
            "text": "But what about if we just don't want to do anything. Like friends are the only reason you want to leave.",
            "title_similarity": "0.7895681",
            "sentiment_compound": 0.8029
        },
        {
            "id": "hltnjno",
            "score": 1,
            "text": "I started going to concerts by myself. You can often get a really good single seat. There have been several times when I got a single seat in the first few rows when the best available pair of seats was up in the nosebleeds.",
            "title_similarity": "0.28193033",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hltnn9a",
            "score": 1,
            "text": "Be prepared to leave people you love behind. It's going to hurt you and them. You're going to feel like you're betraying them. You're going to cycle through friends in every major venture you take on. If you can accept these terms, then you'll make it out the other side ok. If you can't, you're going to struggle immensely. \n\nIt's one of the hardest things to do in life imo",
            "title_similarity": "0.5304586",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hltnq5u",
            "score": 1,
            "text": "Great advice, I do this!\n\nI'll put a call out to some friends saying \"on x day, I'm going to do [cool thing]. You want to come?\" \n\nI'm totally ok to do it solo but like to invite good people",
            "title_similarity": "0.44025743",
            "sentiment_compound": 0.9375
        },
        {
            "id": "hltnrzd",
            "score": 1,
            "text": "This is why I got a dog! My anxiety leaving the house and going places without someone sends me into a panic. But now with my dog? Beyond easier than before and he is always a great topic",
            "title_similarity": "0.45287675",
            "sentiment_compound": 0.8459
        },
        {
            "id": "hltnuaf",
            "score": 1,
            "text": "But people scare me and I feel like I'm not good enough :(",
            "title_similarity": "0.39131206",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hltnwrq",
            "score": 1,
            "text": "This is easier said than done for people with social anxiety.",
            "title_similarity": "0.32235307",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hltnzyn",
            "score": 1,
            "text": "Learning to love doing things alone was one of the best things in my early 20s.\n\ngoing to the movies solo is fucking great.",
            "title_similarity": "0.36412898",
            "sentiment_compound": 0.9152
        },
        {
            "id": "hlto5l7",
            "score": 1,
            "text": "Learned to do this recently. Going to sporting events, concerts, movies, etc. by myself \n\nPeople like to BS when planning stuff (me included) so I never ended up going, not anymore",
            "title_similarity": "0.59969115",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlto7u5",
            "score": 1,
            "text": "Went solo traveling at 30 and the first day i was so scared and probably tired that i hid in my hotel room and only got out to get food next door in 7-11. \n\nNext day i went out and just did simple stuff like lunch, markets etc. Best decision in my life.",
            "title_similarity": "0.3944439",
            "sentiment_compound": -0.0878
        },
        {
            "id": "hltoght",
            "score": 1,
            "text": "This is fantastic advice and changed my life a few years ago. It’s amazing how many experiences I’ve had doing things on my own.",
            "title_similarity": "0.27221972",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hltogju",
            "score": 1,
            "text": "I ended up doing this for a year and now I know like everyone at my apartment complex, pool, everyone at the local bar, and a handful of people downtown and in a small bar district.\n\nJust like, go do stuff and people will talk to you.",
            "title_similarity": "0.18674102",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hltojuv",
            "score": 1,
            "text": "I think everyone should try this with real effort. If you enjoy it, awesome. But if you hate it then you hate it. I personally don't usually enjoy solo stuff. I do it anyways for some things because it's better than not doing it. But the majority of stuff I'd rather just not go. I've tried and I just don't enjoy it. I enjoy going to the movies with people I barely know a million times more than when I've gone by myself. The stuff I've done solo I honestly don't recall most of them. I remember almost every outing I've gone with others though.",
            "title_similarity": "0.5302949",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hltomzo",
            "score": 1,
            "text": "When I was 25 years old I realized there was a lot of the world to see and I barely saw any of it. I wanted a vacation and nobody could go with me. I decided to go on my own. I planned the entire vacation myself and flew across the United States to Washington state. I was scared shitless. Once I got in my rental car I said to myself \"wow I'm really doing this.\" It was one of the most freeing experiences of my life. I could do whatever I wanted and it was all up to me. Traveling solo was one of the best decisions of my life. I've done it multiple times in the past years and recommend to anyone. You can do it!",
            "title_similarity": "0.44890004",
            "sentiment_compound": 0.9335
        },
        {
            "id": "hltozzs",
            "score": 1,
            "text": "It took me many many years to come to this realization.  Over the last year I'm becoming concerned I'm enjoying being by myself too much and finding people annoying now haha.  \nI just love being able to do what I want, when I want, and just being free.",
            "title_similarity": "0.39471537",
            "sentiment_compound": 0.9153
        },
        {
            "id": "hltp1x8",
            "score": 1,
            "text": "I went to Aftershock, a rock music festival, alone and had a lot of fun. \n\nMy friend sold her tickets last minute and was my ride to the concert. I found a different ride and went alone. \n\nAfter she was being rude to me for no reason, I ghosted her. \n\nLive your life and have fun. Don't let anyone hold you back.",
            "title_similarity": "0.41933715",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hltp3pm",
            "score": 1,
            "text": "This is some \"gee thanks I'm cured\" bullshit.  I've lived alone for 7 years.  It fucking sucks.  You know what doesn't help?  Going to a concert or going to dinner and seeing everyone else there in groups.  Some of my most miserable experiences were when I tried to go do something alone.",
            "title_similarity": "0.4318551",
            "sentiment_compound": -0.9089
        },
        {
            "id": "hltp5f7",
            "score": 1,
            "text": "I’ve always been a proponent of this attitude. The woman I’ve been seeing wasn’t interested in seeing a band I like, so I told her that’s fine and went by myself. She couldn’t believe I went alone.",
            "title_similarity": "0.64605695",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hltpbf1",
            "score": 1,
            "text": "This is how you make friends with people who will go out with you.",
            "title_similarity": "0.3082037",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hltph7v",
            "score": 1,
            "text": "Thanks for the reminder! This is good advice that I need to keep in mind. I got reminded of this a few days ago regarding travel. It’s one of those things that I know is true but kind of scary to actually put into action.",
            "title_similarity": "0.48507714",
            "sentiment_compound": -0.303
        },
        {
            "id": "hltphtz",
            "score": 1,
            "text": "Also the case if you’re in a relationship. Don’t let it stop you from doing your thing.",
            "title_similarity": "0.60998535",
            "sentiment_compound": -0.296
        },
        {
            "id": "hltpmka",
            "score": 1,
            "text": "I go out to eat all the time alone. I go to the movies alone. Concerts, theme parks, the beach, vacation trips, etc... I don't do these alone ALL the time but you won't die if you're doing it solo. And no one is judging you if that's what your mental block is. \n\nFor example: I've seen so many amazing bands play live just because I decided to go to the show regardless of if anyone went with me. I started talking to people at all of these shows and the same people show up to the same shows so after a while you aren't really going to shows alone anymore because you know 2/3rds of the crowd.",
            "title_similarity": "0.49740306",
            "sentiment_compound": 0.6318
        },
        {
            "id": "hltpn01",
            "score": 26,
            "text": "I hate doing things alone. I feel like going with others makes the experience longer. For instance, if I go to a farmers market I end up walking the whole thing in 30 minutes. If I went with someone else the experience would last longer because we would converse on things we see at the market. Same thing goes for any kind of event. For the most part I enjoy going with others to build a common memory. A memory we can one day bring up in conversation.",
            "title_similarity": "0.3920849",
            "sentiment_compound": 0.0679
        },
        {
            "id": "hltpnjm",
            "score": 1,
            "text": "what's the point if no one wants to go with me\n\nI can only entertain myself for so long",
            "title_similarity": "0.6877003",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hltpp1s",
            "score": 1,
            "text": "I've done that with going to events or starting new hobbies. I wanted to try tennis--so I went to the local tennis club. I wanted to try racing (autocross)--so I looked up events and did some research and went out. \n\nThe cool thing is--when friends see how much fun you're having, they'll want to do it too! Passion and fun is infectious so jump in and usually your friends will start tagging along on their own.",
            "title_similarity": "0.28567252",
            "sentiment_compound": 0.9565
        },
        {
            "id": "hltppup",
            "score": 1,
            "text": "When is this sub r/GetMotivated, also \"some\" people have problems with that. Mental disorders and stuff. Sheesh...",
            "title_similarity": "0.3482133",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hltpwh8",
            "score": 1,
            "text": "Very good advice. I’ve been going to see all the movies I want to see by myself and I really enjoy it.",
            "title_similarity": "0.32695615",
            "sentiment_compound": 0.7897
        },
        {
            "id": "hltq21m",
            "score": 1,
            "text": "\"Leave the house before you find something worth staying in for\" - Banksy (maybe)",
            "title_similarity": "0.6208563",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hltq6ln",
            "score": 1,
            "text": "I went and saw Endgame alone. None of my friends were available, so I just went.",
            "title_similarity": "0.6479589",
            "sentiment_compound": -0.5505
        },
        {
            "id": "hltq6sz",
            "score": 1,
            "text": "Totally .... waiting for someone will be forever .... just go on with out them",
            "title_similarity": "0.5346062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltqgby",
            "score": 1,
            "text": "Never wait for the tide; Make your own wave.",
            "title_similarity": "0.7068241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltqirg",
            "score": 1,
            "text": "My friends made me wait three weeks to see TRON: Legacy with them. That was the movie I was looking forward to most that year. When we finally went, we went to the shitty theater in the town over to save on tickets, even though the difference in gas was the same or more than the difference in tickets, it was advertised at 3D but was not actually, my seat was behind a pillar, and the sound cut out halfway through the movie. It was on the way home from that that I decided I wasn't going to wait to see movies with anyone anymore. That was 11 years ago and I've seen hundreds of movies alone since.",
            "title_similarity": "0.3127887",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hltqjrc",
            "score": 3,
            "text": "I feel this one. I am such a socially motivated person that I literally sleep days away if no one else is avaliable.",
            "title_similarity": "0.42570096",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hltqkga",
            "score": 1,
            "text": "So many things that I used to do strictly as a party when I was younger that I've gained an appreciation for doing alone at this stage in my life: movies, concerts, shopping, driving, beating up my mom, restaurants... The list is huge.",
            "title_similarity": "0.32688338",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hltqm9m",
            "score": 1,
            "text": "This is a cheat code most people haven't figured out or don't have peace when doing it and I don't get why. Some things, yes, I want to share them with others but my life isn't for sharing with others. That's a perk that may or may not be utilized and for the big things I wanna share, I'll put in tremendous effort to do so BUT I enjoy sharing things with myself. Giving things to myself. Loving myself. I'll enjoy whatever I want and if ppl wanna tag along, maybe but bitch don't kill my vibe.",
            "title_similarity": "0.58932316",
            "sentiment_compound": 0.9719
        },
        {
            "id": "hltqmfi",
            "score": 2,
            "text": "I used to go to concerts all the time. And then I started lapping my friends for energy to go. More and more they bailed and that’s fine. I thought “oh I should bring an inanimate friend so I’m never alone.” And I kept going. \n\nThis is how I got into concert photography and this is how I turned that into a career in photography. Sneaking up on 25 years of taking photos…has I stayed home my life would be…well I don’t know.",
            "title_similarity": "0.378501",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hltqs03",
            "score": 1,
            "text": "I am like this... welp",
            "title_similarity": "0.17313372",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hltqt16",
            "score": 2,
            "text": "This 100%. Since lockdown my initial long term group of friends have never really recovered. We still meet up every now and then, and I’m thankful for that. But this summer, when lockdown ended in the UK and pubs were open again, I wanted to go out and enjoy myself in the sun! But no one else would come with me, at least not as often as I’d liked.\nSo I just started going out by myself. It was weird and uncomfortable at first. People thought I was strange (a girl asked me if I was on acid once just because I was staring at the sky listening to an audiobook). But gradually I started seeing some people I half-knew. And I’d see some more and more. \nNow I have a whole other friend group in my home town that I love. They’re not perfect, but neither was my initial group, and they’re there for me whenever I want to have a good time. I love them, and I wouldn’t have met them had I not made the choice to go out and enjoy myself for myself.",
            "title_similarity": "0.42291796",
            "sentiment_compound": 0.9793
        },
        {
            "id": "hltqubz",
            "score": 1,
            "text": "Put another way\nNone of your friends want to go to Bar A. You do. Guess what, all the other people that wanted to go to Bar A are there right now, go meet your new friends.",
            "title_similarity": "0.5915805",
            "sentiment_compound": 0.2134
        },
        {
            "id": "hltqx14",
            "score": 1,
            "text": "I read this as escaping an abusive situation, which it also applies to. As an abused child, I left home without my pets or sibling, I chose myself.",
            "title_similarity": "0.61049956",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hltqzz6",
            "score": 1,
            "text": "I need to do better about this",
            "title_similarity": "0.41181004",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hltr5w4",
            "score": 1,
            "text": "Yeah. I've done multiple backpacking overnights for the first time by myself this summer, and it was transformational.",
            "title_similarity": "0.17721987",
            "sentiment_compound": 0.296
        },
        {
            "id": "hltr961",
            "score": 1,
            "text": "That’s how I end up traveling so much. Sometimes I met people on the way who are like me and we’ll be travel buddies for a few days. It’s fun and you get to meet new people.\n\nBut…I still wish I have friends/partners who I can go places with consistently. It’s not about the destination, it’s about the memory you shared with them.",
            "title_similarity": "0.4064023",
            "sentiment_compound": 0.872
        },
        {
            "id": "hltr9vp",
            "score": 1,
            "text": "Agreed. Works for all settings, too. Movies, restaurants, museums, or traveling. Yeah, it's fun with other people, but if I can't convince friends or family to head to random places, that won't stop me. I've done some pretty wild solo trips, and since I'm chronically single, I'll probably go on plenty more. It's honestly really great.",
            "title_similarity": "0.4066106",
            "sentiment_compound": 0.9516
        },
        {
            "id": "hltrc4j",
            "score": 1,
            "text": "THIS. I had zero friends in college when I first moved into my dorm and was really upset about it. I enjoyed skateboarding but wasn't very confident in my abilities, and it felt awkward going by myself. I ended up popping in some headphones and just went and skated. Really enjoyed the process and became way more comfortable doing things on my own without the need of others. Go get after it!\n\nUpdate: I still suck at skateboarding.",
            "title_similarity": "0.4774729",
            "sentiment_compound": 0.7436
        },
        {
            "id": "hltrd68",
            "score": 1,
            "text": "Yeah but... the things I'd want to go out and do kind of require more than one person. Except for going to the Aquarium or Zoo, but going there alone is just depressing and I get inside my own head too much.",
            "title_similarity": "0.5535407",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hltrmbh",
            "score": 1,
            "text": "This is why I have a motorcycle. Most of the time you ride on your own, make your own plans. It also takes you places. Been saving money to travel the world but then COVID hit and everything got delayed...",
            "title_similarity": "0.46881008",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hltrqfl",
            "score": 1,
            "text": "Yup going to the museum tomorrow to catch a specific show before it’s gone.  Everyone is busy but I don’t want to miss it so alone it is!",
            "title_similarity": "0.54615796",
            "sentiment_compound": -0.5692
        },
        {
            "id": "hltrsqd",
            "score": 1,
            "text": "Damn it!!!  \n\nI’m literally waiting for my friend to join me at the park for biking \n\nHe said he’d be here by 5:15pm… It’s 5:31pm 😬\n\nAnd it’s only 61 and windy outside I’m freezing (I’m in Florida)",
            "title_similarity": "0.24830541",
            "sentiment_compound": -0.2444
        },
        {
            "id": "hlts4pb",
            "score": 1,
            "text": "That’s why I love traveling alone. I can do exactly what I want, where I want and how long I want. L\n\nIf I wanna have lunch at the same place for a week straight, I’ll just do it. I don’t like a city or village I’m staying at, I leave. I like it, I stay longer than planned. I wanna go to sleep at 9 pm or stay up until 4 am, I don’t it. I wanna drink a beer with the homeless person outside a 711, I just do it. \n\nAlso I meet way more new people when I’m traveling alone since I’m looking around more and making more eye contact with strangers instead of focusing on my friends or family.",
            "title_similarity": "0.40629637",
            "sentiment_compound": 0.9396
        },
        {
            "id": "hlts8eb",
            "score": 1,
            "text": "Took me way too long to realise this. Now I go out to the movies and eat out by myself every week. Way too many times I let my plans get ruined because no one would come.\n\nIt feels so natural now and taking yourself out feels therapeutic. Highly recommend!",
            "title_similarity": "0.46193227",
            "sentiment_compound": 0.2561
        },
        {
            "id": "hltsktc",
            "score": 1,
            "text": "Learning this the hard way. Friends bailed on me for infinity war. That didn't stop me going by myself as we already bought the tickets days before.",
            "title_similarity": "0.5027193",
            "sentiment_compound": -0.0803
        },
        {
            "id": "hltsnac",
            "score": 1,
            "text": "As an alcoholic in recovery I’m having to rebuild my life and learn how to do things by myself. So I’ve managed to travel, go to gigs and do other interesting things on my own. I don’t particularly enjoy being on my own (I understand why I am) but I do acknowledge the benefits of exploring places/things I wouldn’t have done if I was letting my addiction win.",
            "title_similarity": "0.5674466",
            "sentiment_compound": 0.9135
        },
        {
            "id": "hltsnau",
            "score": 1,
            "text": "Also, there are plenty of ways to meet people online that want to do the same things as you. \n\nAs long as you meet in public and do things in public, you should be fine. If you don't like them, just don't hang out with them again. \n\nHad a great time exploring a museum with someone I met up with just to do that. Other than 1 picture and their name, I didn't know anything about them. We hung out at the museum for 3 hours and went our separate ways. We didn't even exchange phone numbers, we just communicate via the app.",
            "title_similarity": "0.46598017",
            "sentiment_compound": 0.6237
        },
        {
            "id": "hltso21",
            "score": 1,
            "text": "Yep, fuck people. THEY ARE THE WORST",
            "title_similarity": "0.3071379",
            "sentiment_compound": -0.7983
        },
        {
            "id": "hltsow8",
            "score": 2,
            "text": "This is how 127 Hours started...",
            "title_similarity": "0.20893542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltsu1u",
            "score": 1,
            "text": "Thanks OP I was affected by your tip and just got arrested for stepping out on to my porch.\n\nI live in Australia.",
            "title_similarity": "0.28302908",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hltt28l",
            "score": 1,
            "text": "My boyfriend has always done this (forever, since before we met) \n\nHe is one of the happiest guys, and I wish he would speak at middle schools or something. He has performance anxiety, and didn’t have sex for 8 years coming out of college. He had one girlfriend before that, then the dry spell. \n\nHe never became angry or resentful.\n\nHe went to his doc thinking he had ED,(he could still masturbate, so doc debunked the ED theory real quick) and although he still had a sex drive, thought he may just be asexual, he just couldn’t make it happen in the bedroom. He says that he thinks the reason he never became angry or isolated is because he felt rich in friendships. He fell in love with going to shows or out to eat or coffee alone, or to meet with friends there. Sometimes they wouldn’t show up, but he’d just stay and maybe meet new people. He was never really part of a “group” and I think showing up to things solo actually helped him make all kinds of friends. \n\nHe likes going alone because he’s in charge of when he shows up and when he leaves, and he just floats around. I actually try to make sure I’m having my own time and talking to others and flying solo when we go out because it’s healthy for both of us, but he’s definitely more natural at it than I am. \n\nIt takes practice for sure!! But to anyone who is lonely or feeling bored and isolated, try it, and practice! Be patient with yourself. Sometimes I feel like I did great, and other times I might have a stressful time, feeling like my outing never quite felt comfortable, but I still pat myself on the back knowing that just putting myself out there was good for me, and I also allow myself to call it when I want, not forcing myself to stay out alone if I’m maybe too socially tired.",
            "title_similarity": "0.35453132",
            "sentiment_compound": 0.983
        },
        {
            "id": "hltt6yt",
            "score": 1,
            "text": "Thank you thank you thank you, I needed this today",
            "title_similarity": "0.36478692",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hltt9co",
            "score": 1,
            "text": "This is actually how I make my theatre/movie plans. I book my ticket and then tell one or two people when and where if they want to go.",
            "title_similarity": "0.32250428",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hltteei",
            "score": 1,
            "text": "And now I'm sad because this is exactly what I do, and I usually end up alone.",
            "title_similarity": "0.45982903",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hlttggm",
            "score": 1,
            "text": "the fuck does this mean",
            "title_similarity": "0.2649628",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlttjwi",
            "score": 1,
            "text": "I've been to the movies, concerts, trips and other events by myself and they have been the best moments I've had. DO NOT wait for anyone",
            "title_similarity": "0.40675655",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlttnj9",
            "score": 1,
            "text": "Can't play Racquetball alone.",
            "title_similarity": "0.44286743",
            "sentiment_compound": -0.0762
        },
        {
            "id": "hlttsmt",
            "score": 1,
            "text": "How many times is this gonna come up under LPT?",
            "title_similarity": "0.23349331",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlttze1",
            "score": 1,
            "text": "Doing something yourself and becoming comfortable doing things by yourself is freeing as hell.",
            "title_similarity": "0.54612756",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hlttzs8",
            "score": 1,
            "text": "I was 24 when I found out some people consider eating out and going to the cinemas alone are weird for them. Don't get me wrong, I knew it's better to go with friends. What I didn't know is that for some people that would REALLY make them cancel their plans if nobody would go with them. I'm always going with the attitude \"Hey, I wanna eat out at XX restaurant on Friday, wanna come and join?\". If nobody said yes, I'd just go by myself.",
            "title_similarity": "0.5198392",
            "sentiment_compound": 0.7802
        },
        {
            "id": "hltu0ko",
            "score": 1,
            "text": "This is how I got into solo travel.  All of my friends are married with kids and getting one of them to get the proverbial Hall Pass to go with me was an Act of Congress.\n\nNot wanting to sit on the couch and miss seeing the places that I wanted to see, I started exploring on my own.  That was 30 countries ago.",
            "title_similarity": "0.38452005",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hltu1xn",
            "score": 1,
            "text": "I would never go camping if I didn't plunge in solo. Too many hectic schedules, if you wait for the perfect opportunity to do something, you will miss several very fine moments in life.\n\nDon't wait, create that opportunity by taking the first step. Each step makes it that much more likely to achieve what you want from life.",
            "title_similarity": "0.6119541",
            "sentiment_compound": 0.8511
        },
        {
            "id": "hltu2qg",
            "score": 1,
            "text": "I cannot express this enough. Do not wait for people.",
            "title_similarity": "0.71943045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltu8t9",
            "score": 1,
            "text": "I have a bum knee and walk with a cane.  9 times out of 10, I’m going out by myself cause no one wants to walk anywhere.  They all drive and I don’t.  I need more car-less friends who enjoy a good stroll.",
            "title_similarity": "0.51090246",
            "sentiment_compound": 0.8062
        },
        {
            "id": "hltu9ym",
            "score": 1,
            "text": "I went to my first solo concert last month and had a blast!!",
            "title_similarity": "0.16603065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltuazx",
            "score": 1,
            "text": "I am learning this lesson at 27, and my god I wished I learned it earlier. I feel like I’ve missed out on so many cool things just because I couldn’t find anyone to do them with me",
            "title_similarity": "0.52482986",
            "sentiment_compound": 0.6096
        },
        {
            "id": "hltucuu",
            "score": 1,
            "text": "The only thing I'm waiting on others to do is cancel the plans we make so I can go do stuff alone.",
            "title_similarity": "0.7327088",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hltukrl",
            "score": 1,
            "text": "Yeah but going out without others isn't very fun, social anxiety exists for a reason, its part of an instinct of humans being pack animals. Why would I go out and spend $$$ to not have a good time?\n\nStorytime: when I was in college I went on study abroad in the UK. A large number of other guys in the group wanted to visit Amsterdam, and I planned a trip but everyone else but 1 guy flaked by the time the trip came up. It wasn't nearly as fun with less people.",
            "title_similarity": "0.48092887",
            "sentiment_compound": -0.8987
        },
        {
            "id": "hltup4u",
            "score": 1,
            "text": "Yeah lemme just go out by myself like a psychopath.",
            "title_similarity": "0.47175828",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hltuvyj",
            "score": 1,
            "text": "Yeah, I'd love to do this but I live in a place where itt isn't safe to be alone out there as a woman :/",
            "title_similarity": "0.5071061",
            "sentiment_compound": -0.6714
        },
        {
            "id": "hltv1rg",
            "score": 1,
            "text": "I friends are homebodies. It sucks not having anyone to do shit with. I needed this though. I’ll start just vacationing with out them",
            "title_similarity": "0.59869057",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hltv1v1",
            "score": 1,
            "text": "Basically cured my “depression” this way.",
            "title_similarity": "0.29305074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltv3hu",
            "score": 1,
            "text": "Jeeze, giving honest advice on this sub. /s",
            "title_similarity": "0.39121",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hltvadt",
            "score": 1,
            "text": "But it's so fucking boring being alone...",
            "title_similarity": "0.48045507",
            "sentiment_compound": -0.7719
        },
        {
            "id": "hltvema",
            "score": 1,
            "text": "I really want to go on a trip but im scared to go alone not because i dont have the encorage. I always have this littlw voice in my gead that tells.. \" you are going alone, no frienda, no gf, wow what a loser and this is what everyone arround you think\" i reall wish i can shup it out",
            "title_similarity": "0.6985347",
            "sentiment_compound": -0.9346
        },
        {
            "id": "hltvf57",
            "score": 1,
            "text": "I always wonder what this \"go out\" means. I'm not doing a meme either. Maybe it's my area and there isn't much to do. Or maybe I just don't know what activities there are to do. But besides going to a movie by myself, or other equally lame things, I'm not sure what I'm supposed to do by myself out of the house all of the time.\n\nThere's activities like exercising but I already do that by myself. So otherwise, I'm not sure what people do when they go out.",
            "title_similarity": "0.6432246",
            "sentiment_compound": -0.6526
        },
        {
            "id": "hltvhhr",
            "score": 1,
            "text": "Thanks. I really needed to hear this.",
            "title_similarity": "0.2766019",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hltvn32",
            "score": 1,
            "text": "This is very simple and very good advice.",
            "title_similarity": "0.2769925",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hltvtm9",
            "score": 1,
            "text": "So I have this anxiety and general attitude of not doing things on my own.\n\nNever been to the cinema on my own\n\nOr a restaurant\n\nHell when my partner is out I generally don't cook cos there's no point as it's just me.\n\n\nIt's stupid I know but I've never done anything on my own.",
            "title_similarity": "0.6344058",
            "sentiment_compound": -0.7217
        },
        {
            "id": "hltvvvp",
            "score": 1,
            "text": "This is something I struggle with, but worse since all my friends paired off and started doing things like having families.\n\nNow I have to go out and do things by myself if I want to do things at all.",
            "title_similarity": "0.6273389",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hltvwrr",
            "score": 1,
            "text": "1000% the amount of times I’ve gone to concerts alone because no one knew/listened the artist. Don’t regret it! Some of my favorite memories",
            "title_similarity": "0.45263466",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hltvwtv",
            "score": 1,
            "text": "Facts. 3 weeks and six countries alone was a great experience",
            "title_similarity": "0.12521212",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hltvx67",
            "score": 1,
            "text": "Alternatively, don’t keep offering your time to people that don’t value it or use you as the person to go out with. Value alone time and stop looking for crowd acceptance. You’re and individual for a reason.",
            "title_similarity": "0.77527916",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hltvxu6",
            "score": 1,
            "text": "I only make plans with others simply by stating that I'm gonna be at a place and a time and just tell people they can meet me there if they like.",
            "title_similarity": "0.55458486",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hltvzod",
            "score": 1,
            "text": "Great advice we can here over and over.",
            "title_similarity": "0.24907236",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hltw454",
            "score": 1,
            "text": "Also it only takes going somewhere once to potentially make a new friend who has the same interests as you",
            "title_similarity": "0.59312713",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hltw5pg",
            "score": 1,
            "text": "There's only that I would really like to invate people over and bake things for them (i really like to host). But usually I don't get invated to do anything with the people that I have invated so I just bake for myself or for couple of close friends",
            "title_similarity": "0.43539405",
            "sentiment_compound": 0.7872
        },
        {
            "id": "hltw9yt",
            "score": 1,
            "text": "Learning is life! Makes for great stories and laughs when you initiate random convos! Never been disappointed.",
            "title_similarity": "0.34596533",
            "sentiment_compound": 0.887
        },
        {
            "id": "hltwbqu",
            "score": 1,
            "text": "I'll go with you",
            "title_similarity": "0.36227882",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltwfb3",
            "score": 1,
            "text": "Yes! I went to a movie by myself for the first time a couple weeks ago. Never thought I'd enjoy the experience, but it was actually really nice having some time to myself outside of my house.",
            "title_similarity": "0.34588644",
            "sentiment_compound": 0.667
        },
        {
            "id": "hltwlki",
            "score": 1,
            "text": "I went camping (on a campground) by myself fir one night and it was the best trip ever. So many stories and scenes I’d love to share if anyone’s interested.",
            "title_similarity": "0.2909378",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hltwobh",
            "score": 1,
            "text": "I love going for classical music concerts alone— it's hard to find people my age interested in this kind of stuff. I usually end up sitting beside an old couple with whom I strike up a conversation before the concert begins and they're always good company.",
            "title_similarity": "0.36663246",
            "sentiment_compound": 0.836
        },
        {
            "id": "hltwxs4",
            "score": 1,
            "text": "It's surprising how often it just takes 1 person to say \"It's happen this time and place, go or don't\" for a bunch of people to join.",
            "title_similarity": "0.4242282",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hltwxy6",
            "score": 1,
            "text": "I think you’re more likely to get people to do things with you if you do this. I think people might say no to “do you want to go see a movie” but are likely to say yes to “I’m going to see this movie, do you want to come with me?”. Something about the plans happening regardless of their choice makes people not want to miss out. People just hate having to make plans.",
            "title_similarity": "0.63188297",
            "sentiment_compound": -0.2885
        },
        {
            "id": "hltwzzn",
            "score": 1,
            "text": "Also, stop thinking the deadbeats who say they will go or do shit with you, but never do, will change.  They don’t.",
            "title_similarity": "0.815864",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hltx7ok",
            "score": 1,
            "text": "As an only child I realized this at about 8-10 years old when I held up my birthday party (I say party but it was only like 3 kids) to wait for a friend to come and when I called 3 hours later he had never left his house and forgot to tell his mom. Never again Mike. Not only did I wait , but waited too long and now my other friends parents weren't bringing them. I cried for a day.",
            "title_similarity": "0.36978328",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hltxa56",
            "score": 1,
            "text": "*Leeroy Jenkins has joined the chat...*",
            "title_similarity": "0.24374115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltxcv0",
            "score": 1,
            "text": "I used to never like going out alone.  I started going to the cinema and concerts alone and its fucking awesome. I prefer it now actually.",
            "title_similarity": "0.48180422",
            "sentiment_compound": 0.0729
        },
        {
            "id": "hltxhfx",
            "score": 1,
            "text": "Absolutely!  And oddly, it often attracts others. It creates a gravity to it.",
            "title_similarity": "0.21748753",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hltxvwe",
            "score": 1,
            "text": "Years ago I planned a backpacking trip through Europe with my buddies.  I was super excited and they were to in the beginning.  I started planning and buying equipment,  sent them all the links on what to purchase etc.  It came time to buy the big ticket item, flight... they both backed out.  I was bummed for a day then decided to go solo.  BEST decision I ever made.  I saw amazing cities and history,  adventures with random people from all over the world and helped give me confidence to be myself, shaping who I am today.  I returned and shared my travel stories with my buddies, they regretted not going.",
            "title_similarity": "0.33930075",
            "sentiment_compound": 0.9667
        },
        {
            "id": "hltxwju",
            "score": 1,
            "text": "Yes! No more waiting to do what makes you happy, just because there isn't another person with you.",
            "title_similarity": "0.825215",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hltxxmr",
            "score": 1,
            "text": "I still struggle a lot with this. I also find having someone else makes it more interesting, well at least I find so. Maybe I just want to see people I know, that's probably it.\n\nDoing something solo can indeed feel good. But finding the motivation and the idea of what to do is where I really struggle ... I don't really want to do things alone. And some activities are hard to do alone. Like eating out, it feels so out of place in many cultures to be alone.\n\nOh, and. Social anxiety.",
            "title_similarity": "0.49127796",
            "sentiment_compound": -0.5736
        },
        {
            "id": "hlty6zo",
            "score": 1,
            "text": "As someone who has terrible social anxiety, made worse by the pandemic, I really needed to hear this, thank you. Almost a year ago after I was vaccinated, I felt more inclined to go places. I'm going to enjoy my life.",
            "title_similarity": "0.3525707",
            "sentiment_compound": -0.2083
        },
        {
            "id": "hltygdm",
            "score": 1,
            "text": "My anxiety holds me back from talking a lot but I still go out. Now if only there was more stuff open at 11 at night which is about the only time I get to go out by myself or with friends.",
            "title_similarity": "0.5350549",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hltygkg",
            "score": 1,
            "text": "Any Subaru owners out there?  They have trips all the time posted to FB, like mtnru ( mountain \"ru\"). We welcome all and most people are single. Also there are overland groups that don't care what vehicle you have. Don't worry if you're never gone off road. There are \" stock friendly\" rides or trails that are really fun, where ever you are located.",
            "title_similarity": "0.43071038",
            "sentiment_compound": 0.9016
        },
        {
            "id": "hltynvj",
            "score": 1,
            "text": "Sorry I would but I actually have separation anxiety and social anxiety, if I'm not with people I know I feel unsafe",
            "title_similarity": "0.42185533",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hltz3kj",
            "score": 1,
            "text": "This! I went on a trip to a city i know and had 3 people cancel plans on me. I still went and did them on my own. \nGot to meet new strangers & have great conversations, very fun\nIt was also easier to keep to my schedule because I wasn't waiting on anyone or being rushed.",
            "title_similarity": "0.5468703",
            "sentiment_compound": 0.8685
        },
        {
            "id": "hltzbvk",
            "score": 1,
            "text": "I take myself out quite often. Gets kinda depressing to be honest.",
            "title_similarity": "0.27133548",
            "sentiment_compound": 0.2484
        },
        {
            "id": "hltziv6",
            "score": 1,
            "text": "SLPT : Make others wait for you. \n\n  \nSpecifically if you are a drug dealer/management/older than them/lazy/or obviously narcissistic.  \n   \nYou're more important than their time, so just flake on them from time to time.   \nIt makes them miss you more.   \n\n\nWhen you get bored of them, Just ghost them until you need something from them.  \nMake sure to get mad when they don't reply instantly to your every whim.\n\n&#x200B;\n\n/ffs",
            "title_similarity": "0.52713096",
            "sentiment_compound": -0.8228
        },
        {
            "id": "hltzr7t",
            "score": 1,
            "text": "Yeah but I never want to do anything.",
            "title_similarity": "0.7020419",
            "sentiment_compound": 0.0688
        },
        {
            "id": "hltzxy1",
            "score": 1,
            "text": "Took me way to long to realise this.",
            "title_similarity": "0.29864174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltzylu",
            "score": 1,
            "text": "Learned this recently and it's been great. Though now I am usually the one organizing all of the plans for me and my friends, I'm having way more fun.",
            "title_similarity": "0.33415985",
            "sentiment_compound": 0.8955
        },
        {
            "id": "hlu02ks",
            "score": 1,
            "text": "I started this after Covid it was so nice to just go to do all the stuff I always wanted to do. I was the type of person who needed someone to go with me the share the experience. People always had other stuff or were to far away. This year I went to my first metal show and the van gogh experience already with out anyone. It’s a weight lifted off of my shoulders.",
            "title_similarity": "0.43621886",
            "sentiment_compound": 0.7019
        },
        {
            "id": "hlu09pz",
            "score": 1,
            "text": "As a 61 year old widow I absolutely agree with this. If I waited for others I’d die alone in my house.",
            "title_similarity": "0.37660354",
            "sentiment_compound": -0.4779
        },
        {
            "id": "hlu0d8p",
            "score": 1,
            "text": "Also, go out by yourself and do shit.  Go to a movie, go on a hike, go fishing, out to dinner, head to a street fair, whatever just go out and do it even if no one else is down.",
            "title_similarity": "0.51663274",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlu0e2r",
            "score": 1,
            "text": "Whenever there's a  concert I want to see I ask a few friends if they're interested.  If not I've gone solo quite a few times and it's fun. I'm not missing out on acts I wanna go see because nobody else wants to go.",
            "title_similarity": "0.524325",
            "sentiment_compound": 0.8831
        },
        {
            "id": "hlu0l3u",
            "score": 1,
            "text": "I made many plans with friends for international travel and it never panned out. Eventually I decided I needed to go by myself or I wouldn't and it was the best decision I could have made. I did what I wanted, sometimes met up with others and hung out with them for a little bit then went out on my own again.",
            "title_similarity": "0.61252916",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hlu0nag",
            "score": 1,
            "text": "You learn who your true friends are too.\n\nOnce I stopped being the one to always initiate plans that ended up getting canceled, or stopped having to weasel my way to certain invitations because they wouldn't invite me, I never heard from my \"friends\" again.",
            "title_similarity": "0.6807549",
            "sentiment_compound": 0.7818
        },
        {
            "id": "hlu0pen",
            "score": 2,
            "text": "Yeah but it's kind of weird to go to the pub alone because you're tired of waiting for your friends to get ready",
            "title_similarity": "0.544782",
            "sentiment_compound": 0.0414
        },
        {
            "id": "hlu0q0t",
            "score": 1,
            "text": "Getting drunk at the bar by myself right now",
            "title_similarity": "0.29688078",
            "sentiment_compound": -0.34
        },
        {
            "id": "hlu0tks",
            "score": 1,
            "text": "This post inspired me to buy concert tickets to the show I've been wanting to go to. Thank you OP!",
            "title_similarity": "0.26152512",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hlu0uzd",
            "score": 1,
            "text": "And to go a step further…never put your goals on hold for your friends. Don’t be afraid to leave them behind if it means elevating your life. FaceTime and airplane tickets exist. Go to that college across the country, or move to that new city for your dream job or even just a better opportunity.",
            "title_similarity": "0.60262847",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hlu0vgg",
            "score": 1,
            "text": "I will go to two concerts next year. Ive asked some other people if they want to join. But i will go no matter what :)",
            "title_similarity": "0.36562467",
            "sentiment_compound": 0.6847
        },
        {
            "id": "hlu102z",
            "score": 1,
            "text": "I feel this way about traveling. I took a solo trip last week, just me and my dog. There is something so freeing about just doing whatever you want and not having to rely on anyone else to accompany you.",
            "title_similarity": "0.4424913",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hlu11zk",
            "score": 1,
            "text": "I love this LPT! I’ve moved around so much and have been successful in finding friends & activity partners in every place I lived because I wanted to try new hobbies. \n\nHere is the strategy that works for me 100% of the time. Think of activities or sports that you want to try or continue doing. Go on meet up sites like bumble bff, meetup.com, Facebook local city meet up pages. Pick a day / time / location and invite people out to do the activity of choice. If you like them enough after the first meet up arrange to see them again the following week. \n\nPeople are always looking for friends and things to do but lack initiative to do anything about it. If you are the one to organize it and make the effort people will appreciate it. \n\nBe kind, polite, follow up, but don’t chase. If you don’t get a response or if they say no to you twice without providing back up plans, move on. \n\nThe best is when you start scheduling activities weekly because then it takes less effort to plan and you get to see people regularly over a shared interest which helps maintain the relationship. You end up bonding over a new hobby with new friends instead of convincing your current friends to try new things with you.",
            "title_similarity": "0.267919",
            "sentiment_compound": 0.9914
        },
        {
            "id": "hlu15eo",
            "score": 1,
            "text": "Goddamn right! I'll have my orgy even if I'm the only one there.",
            "title_similarity": "0.5161773",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hlu1dj9",
            "score": 1,
            "text": "Some friends used to lowkey blackmail me when theyre suddenly busy or late on the very day were supposed to watch a movie. Oh nope, I'll go on and watch on my own. Had a blast and could scare them with spoilers 😁",
            "title_similarity": "0.45867467",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hlu1eps",
            "score": 1,
            "text": "this... is a LPT?\n\nseriously what is happening to you people that THIS is a lpt?",
            "title_similarity": "0.35566872",
            "sentiment_compound": -0.264
        },
        {
            "id": "hlu1g9k",
            "score": 1,
            "text": "I used to plan around others for going to see movies in theaters, because I felt weird for some reason about seeing a movie alone, then one day it hit me that I don't even really interact with people while watching movies. Now I make the plans for myself and if someone wants to tag along cool but I really don't mind watching them alone anymore.",
            "title_similarity": "0.539752",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hlu1xnk",
            "score": 1,
            "text": "Hah, bold of you to think I know people who I can go out with.",
            "title_similarity": "0.31995744",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hlu20zd",
            "score": 1,
            "text": "I go to the movies alone a lot because I want to see something and ive had a friend say thats weird but whenever i ask them if they wanna go with me they say no or make an excuse. So I go anyway lol. Seeing the movie isnt conditional to going with someone and it just blew their mind up that it is an option.",
            "title_similarity": "0.58295107",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hlu2438",
            "score": 1,
            "text": "Does anyone use Meetup.com anymore? I feel like it's perfect for some people in this thread. Lots of low commitment groups that you can join to try out a new hobby or meet friends.",
            "title_similarity": "0.35630935",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hlu25pu",
            "score": 1,
            "text": "idk man, my agoraphobia says i shouldnt",
            "title_similarity": "0.54477245",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hlu2efi",
            "score": 1,
            "text": "My issue is my anxiety, though. I know I'm pretty much making up excuses but I went to a car show by myself last weekend and it was nice until about an hour later when my anxiety decided to go crazy and I had to dip out and have a pretty big mental breakdown. I've tried to go to a couple different things by myself but I always leave early because of my anxiety.\n\nWhat's a good way to help with that? If it wasn't for my anxiety it wouldn't be too bad",
            "title_similarity": "0.40517244",
            "sentiment_compound": 0.9451
        },
        {
            "id": "hlu2gnk",
            "score": 1,
            "text": "After a few years of doing stuff alone you realize that is the rest of your life. I can't imagine it gets easier to meet people the older you get. Some people are just not people you want to spend time with, like me. I look presentable, have hobbies, places I enjoy and have a job but in the end everyone goes away.",
            "title_similarity": "0.52473575",
            "sentiment_compound": 0.4835
        },
        {
            "id": "hlu2jzu",
            "score": 1,
            "text": "That’s why I’m building my own Mars ship",
            "title_similarity": "0.2638343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu2k7h",
            "score": 1,
            "text": "Thats why I am going to BMTH concert alone. Don't blame anyone for not coming with me, as it is quite expensive",
            "title_similarity": "0.5883287",
            "sentiment_compound": 0.0093
        },
        {
            "id": "hlu2rtx",
            "score": 1,
            "text": "I call this masterdating",
            "title_similarity": "0.32761145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu2s1i",
            "score": 1,
            "text": "I consider that whole way of doing things (socially-fixated) is a weakness. Don't rely upon others for contentment, happiness, comfort, or anything like that.",
            "title_similarity": "0.7473624",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hlu2tzn",
            "score": 1,
            "text": "I am in my 40s and married.  Let me tell you something:\n\nThere are movies that will come out that none of your friends or life partner will want to see.\n\n**Go see them yourself.**\n\nIt's not weird.  Heck, you may even enjoy not having to explain things.\n\nWith a new Ghostbusters out and a Matrix sequel coming soon, if you can't convince someone to go see them with you, go alone, and enjoy the shit out of them.",
            "title_similarity": "0.5941988",
            "sentiment_compound": 0.786
        },
        {
            "id": "hlu3bcx",
            "score": 1,
            "text": "Can confirm this is great advice. I've seen so many concerts by not waiting around for friends to find money or the want to go. Get out and live safely with a mask.",
            "title_similarity": "0.59770525",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hlu3bvb",
            "score": 1,
            "text": "Best thing I’ve done was say fuck it and go to places solo.",
            "title_similarity": "0.5584557",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hlu3d1i",
            "score": 1,
            "text": "You'd be surprised the people who you might strike up interesting convos with or befriend when you go out by yourself.",
            "title_similarity": "0.5195621",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hlu3hd3",
            "score": 1,
            "text": "learning to be alone is a superpower",
            "title_similarity": "0.4534964",
            "sentiment_compound": -0.25
        },
        {
            "id": "hlu3ibi",
            "score": 1,
            "text": "Easier said than done. Only so many things you can do on your own.",
            "title_similarity": "0.525372",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hlu3qpi",
            "score": 1,
            "text": "I took a vacation to Universal Studios by my damn self because the day on which we all agreed to have cash in hand to buy tickets came nobody else had cash in hand. Best vacation I've ever had.",
            "title_similarity": "0.3663012",
            "sentiment_compound": 0.875
        },
        {
            "id": "hlu3x5y",
            "score": 1,
            "text": "And don't be afraid to do things by yourself. I go to movies alone, eat out alone, I keep inviting a friend to pub crawls but even when she doesn't want to go I'll still go by myself. Met some friends that way.",
            "title_similarity": "0.5503806",
            "sentiment_compound": 0.6775
        },
        {
            "id": "hlu3y2l",
            "score": 1,
            "text": "Easier said than done when you're an introvert 😕",
            "title_similarity": "0.41326708",
            "sentiment_compound": 0.128
        },
        {
            "id": "hlu448n",
            "score": 1,
            "text": "I’ll say this is a double edged sword as the “other” person. I lost touch with a good friend because he lives by this rule. \n\nCouldn’t wait until the weekend to watch a new movie, it had to be the midnight Thursday release.\n\nWould ask to make plans and if you asked for another time or date they would do it anyways and you just had to deal with missing out.\n\nEventually we fell out of being friends because I couldn’t keep up.",
            "title_similarity": "0.45548064",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hlu49sm",
            "score": 1,
            "text": "I take myself out on dates when my bf is out of town and buy myself fancy meals. Only once was I stared at by an old couple that kept looking my way. Not sure if they were impressed by how much I could chow down or if they were confused about why I was alone. But yep, I've traveled alone many times because my friends couldn't get their shit together. No regrets. I've made new friendships along the way and have some cool anecdotes to share.",
            "title_similarity": "0.3828662",
            "sentiment_compound": 0.9616
        },
        {
            "id": "hlu4fpl",
            "score": 1,
            "text": "An asterisk for this: this can kinda work, but if it's a social kinda place, and you aren't a social kinda person, you may just end up bored and lonely.           \nYou need to have a plan, objectives even, if you plan to travel alone. \n\nAnd for the love of God: if you usually take medicine for mental health, DONT FORGET THEM!\n\nJust did a solo trip to New York.             \nI had some fun going to a museum, liberty island, and Broadway in the first few days.           \nHowever after those couple of days I guess the meds in my system wore of. I couldn't enjoy going to an anime convention, and completely skipped on going to the MET museums.\n\nTLDR, some places need to be done with others. Also don't forget your meds.",
            "title_similarity": "0.43770593",
            "sentiment_compound": 0.9146
        },
        {
            "id": "hlu4gpp",
            "score": 1,
            "text": "Good tip why u not post this 10 years ago?",
            "title_similarity": "0.26853153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hlu4lrd",
            "score": 1,
            "text": "I'm going to see Encanto all by myself",
            "title_similarity": "0.535054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu4p7y",
            "score": 1,
            "text": "Also, if you're always being left out if your friend group, do some introspection, and probably find a friend group that fits you better.",
            "title_similarity": "0.54787797",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hlu4sb2",
            "score": 1,
            "text": "I’ve really wanted to watch The Eternals and the new Ghostbusters but can’t agree on a time and date with friends. I was so close to going to the cinema by myself today but had a meeting, tomorrow I try again",
            "title_similarity": "0.4902174",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hlu52u5",
            "score": 1,
            "text": "One thing I’ve regret was listening to my mom about how dangerous traveling alone. I wish I travelled more before I have my financial commitments and pregnancy",
            "title_similarity": "0.5316117",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hlu5dbx",
            "score": 1,
            "text": "The best part of this is, others are more likely to join you if you are going to do your thing regardless of their presence. \"I'm going to the movies. Anyone else want to go as well?\" is more likely to get people to commit than \"Does anyone want to go to the movies?\".",
            "title_similarity": "0.50175524",
            "sentiment_compound": 0.8984
        },
        {
            "id": "hlu5flq",
            "score": 1,
            "text": "A buddy and I had been going to blockbuster movie premiers since high school.  As adults, he began cancelling on me as life got in the way.  I’d end up waiting to see the movie after opening night, which is a far less enjoyable experience.  One day, it dawned on me to just go by myself.  One of the most liberating moments of my life.  While I’d much rather experience life in the company of friends and family, I now have no issue experiencing life on my own (and meeting new friends along the way).",
            "title_similarity": "0.52680504",
            "sentiment_compound": 0.866
        },
        {
            "id": "hlu5ilh",
            "score": 1,
            "text": "Seriously?  This *again?*  I swear something along these lines gets posted at least once a month.\n\nStop trying to pretend there aren't people who don't enjoy doing things alone.  It's *fine* to prefer having company and other humans to interact with.  It's normal, even.  You need to get over this.",
            "title_similarity": "0.5655477",
            "sentiment_compound": -0.7709
        },
        {
            "id": "hlu5liz",
            "score": 1,
            "text": "Real easy to say when you’re not introverted or have anxiety 😂",
            "title_similarity": "0.3793076",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlu5sd8",
            "score": 1,
            "text": "I’m still trying to figure this out….",
            "title_similarity": "0.48094448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu5z6w",
            "score": 1,
            "text": "Going to a bar or club solo was the most ancienty inducing thing i ever tried. Maybe some people can do that but not all or even most.",
            "title_similarity": "0.41808492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu60cn",
            "score": 1,
            "text": "I am currently struggling with this. Also making slave wages so I cannot afford fun things outside of eating to survive",
            "title_similarity": "0.43048614",
            "sentiment_compound": -0.6707
        },
        {
            "id": "hlu69pe",
            "score": 1,
            "text": "I've never had a problem going out and doing stuff on my own, but it seems *other* people always have a problem with me doing it.\n\nRecently I went to a show with my family but somebody had to sit alone.  I immediately volunteered and everyone started to pity me and feel bad for me.  I had to tell them a million times that I'm more than fine sitting alone.\n\nSo as an extension to this LPT I would say that just because someone is out doing stuff alone it doesn't make them lonely, friendless or unhappy.",
            "title_similarity": "0.6099193",
            "sentiment_compound": -0.962
        },
        {
            "id": "hlu6bt1",
            "score": 1,
            "text": "Went to iceland by myself because no one ever wanted to travel (say they want to and then don't)\n\nThen I went back a few more times.",
            "title_similarity": "0.5762636",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hlu6flt",
            "score": 1,
            "text": "I don’t like myself tho",
            "title_similarity": "0.3865292",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlu6vj6",
            "score": 1,
            "text": "I don’t disagree with this sentiment, but maybe make new friends too. Don’t keep friends just because you were once friends. If you grow apart cut them loose and find new ones.",
            "title_similarity": "0.6580924",
            "sentiment_compound": 0.7935
        },
        {
            "id": "hlu6xah",
            "score": 1,
            "text": "Going to another country over the weekend by myself (for the first time) to get a tattoo. I’m excited and nervous all at once but I’ve been embodying this philosophy lately!!",
            "title_similarity": "0.39399135",
            "sentiment_compound": 0.1862
        },
        {
            "id": "hlu712l",
            "score": 1,
            "text": "Learned this through force. Moved across the country with 2 friends. If they couldn't do something, it was go by myself or don't go. I now love doing things myself. Been to like 300 concerts alone, it's the best. Not to say I don't love doing stuff with my friends or girlfriend or whatever. But if I wanna do something, I do it. It's so liberating.",
            "title_similarity": "0.40699825",
            "sentiment_compound": 0.7481
        },
        {
            "id": "hlu74fw",
            "score": 1,
            "text": "Welllll what if you have no one to begin with.",
            "title_similarity": "0.58810663",
            "sentiment_compound": -0.296
        },
        {
            "id": "hlu79f1",
            "score": 1,
            "text": "100%. I backpacked around Europe by myself because none of my friends could go with me. It was an adventure.",
            "title_similarity": "0.49456227",
            "sentiment_compound": -0.0654
        },
        {
            "id": "hlu79wd",
            "score": 1,
            "text": "Unfortunately movies and books have encouraged people, especially women, to look for their soul mate. Once found that person is to be everything. So many people stay in bad relationships because they're scared to be alone. Or they jump from one relationship to another all because they can't be alone. They've forgotten who they were because their identity is tied up in their SO.\n\nSo many women are scared of being judged if they go to dinner/a movie alone. \nPartially because they judge the women they see that do it. It's a self defeating circle. Learn to love/ like yourself, cultivate your own life's interest, don't just assume your SO's. If you love the life you have you'll look for someone to enhance/add to it, not replace yours with theirs.\n\nLadies, stop submerging your identity in your relationships. A good partner should appreciate the person you are and not try to muffle your light. Respecting your relationship doesn't mean giving up your interest or friends. For any person, male or female, the fact that someone expects this of you or does it for you is a humongous red flag. It's not showing you how much they love you. It's either going to be to control/isolate you or to smother you.\n\nThat doesn't mean there's anything wrong if you've chosen to be that 24/7/365 couple. But it has to be a natural choice for both of you, not one person's sacrifice to make the other happy. In a healthy relationship the partners should encourage each other's interest.",
            "title_similarity": "0.4084307",
            "sentiment_compound": 0.9793
        },
        {
            "id": "hlu7an5",
            "score": 1,
            "text": "I wish I knew about this years ago",
            "title_similarity": "0.4268175",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hlu7my7",
            "score": 1,
            "text": "My group of friends have really leaned into what I call \"selfish group activities\". Rather than trying to plan someone post something like \"playing disc golf at 10 at x park\" or \"grabbing dinner at x place\". Anyone in the group is welcome to go. We've all gained new hobbies and actually have been doing a lot more together since using this method. If no one shows up still do the thing and have fun. If everyone is there do the thing and have fun.",
            "title_similarity": "0.4218058",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hlu883g",
            "score": 1,
            "text": "Needed to read that. I was contemplating not going to a concert because Im new to the city. Buying the ticket now. Thanks my friend",
            "title_similarity": "0.5438957",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hlu8gyw",
            "score": 1,
            "text": "Thanks, I needed this today. Feeling pretty low and lonely tbh.",
            "title_similarity": "0.44355583",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hlu8ppw",
            "score": 1,
            "text": "Wait...I could've sworn people keep posting this sentiment.",
            "title_similarity": "0.42052728",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu8x7c",
            "score": 1,
            "text": "I already do this, but it sucks being alone doing things alone all the time",
            "title_similarity": "0.6143025",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hlu9680",
            "score": 1,
            "text": "My dad gave similar advice. ‘If you play to travel, plan to travel alone.’  \n\nMany people back out of the ‘let’s go to Europe’ or ‘Drive to Florida’ trips. \n\nBest thing about traveling alone, meeting new people. Friends can hold you back. Hostels are essential in meeting people.",
            "title_similarity": "0.52543014",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hlu9l8n",
            "score": 1,
            "text": "Slightly related, I had a friend that was always late. Always. I liked them but not waiting for them.\nSo I changed how I made plans. Movie? Sure, I’ll meet you there. \nI’ve always been fine doing stuff on my own. \nI’d go the the theatre or whatever and if and when he showed didn’t really matter. \nHe kind of hated it but it was the only way I’d spend time with him. \nFirst time I came up with idea he was supposed to pick me up and was really late. I put a note on my door and went to destination. \nNo more waiting, dude.",
            "title_similarity": "0.5779752",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hlu9lwf",
            "score": 1,
            "text": "I just bought tickets to a band I like to go by myself.  Best case I'll meet someone who likes the same music I do. Worst case I get to enjoy the music.\n\nCan't wait to see them",
            "title_similarity": "0.49000603",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hlu9qgj",
            "score": 1,
            "text": "Yes!!! This was me until I decided that I’d regret missing out more than I’d regret being alone. I booked an entire European holiday and went on my own. As a result I have a bunch of new friends around the world, and we still meet years later.",
            "title_similarity": "0.43660215",
            "sentiment_compound": -0.3484
        },
        {
            "id": "hlu9rkc",
            "score": 1,
            "text": "Yes for the love of god. GO EAT AT YOUR FAVORITE RESTAURANT BY YOURSELF. SEE THAT DAMN MOVIE YOU ARE DESPERATE TO SEE! STOP WAITING FOR PEOPLE.",
            "title_similarity": "0.44223383",
            "sentiment_compound": 0.5612
        },
        {
            "id": "hlu9sl3",
            "score": 1,
            "text": "I did this for the first time the other week It was nerve racking, Invited some people to an event, could'nt make it, no problem, however when I went to buy the tickets, It felt awkward being alone they saw me come in alone and in the ticket office of the arena they was like ''Is there any particular seat you would like? Is there anyone you might want to sit next too later on''?  and I was like no which made me feel a bit bad inside, in my head I was like just sell me the ticket please so I can just watch something I will enjoy and not feel any worse about my day.\n\nany particular fighter that you are supporting? I was like nope, any seat will do I just want to watch the sport.\n\nI did enjoy the event, because I liked what I was watching but not going to lie, It did feel slightly lonely for a while.. I mean there was a good atmosphere regardless but someone random did start speaking to me however halfway through the event, so had a bit of a chat with that person, where they was from, what they do in life etc\n\nthere was some trouble makers in my stand though who was abusing random people, did not like those people, the whole situation was escalating through the night until drinks started being thrown everywhere etc, chaos ensured..\n\ncrowds divided from one another like the red sea.. I could see the Police up above filming the incident and moving in (but not getting rid of anybody for the time being even as bottles were being thrown) the finale fight had ended and I was still there for a good five minutes, Security was removing people down below, some woman flashed at us, I saw everything.\n\nI thought to my self Okay this has all ended the night is over, what good is going to come from staying here? I thought nothing.\n\nI thought in a few minutes time the Police are going to make a move, and I likely would have got lumped in with the trouble makers..\n\nI thought forget that and got out of there, (I mean even if I somehow ended up arrested, the footage would prove I was not joining in on the trouble making attacking other innocent people just there to enjoy the sport)\n\nso I slowly made my way through the crowd to the right.. stood there for a while then got out..\n\nIt was an experience\n\nespecially earlier on halfway through the night when I was on TV in a crowd of people who were saying F\\*\\*\\*\\* the area that I happen to work in, I just had a grin on my face, and thought how funny it would be if someone I knew actually saw me on tv with a crowd chanting how much they hate the area I work in.",
            "title_similarity": "0.46283907",
            "sentiment_compound": -0.2569
        },
        {
            "id": "hlua1i6",
            "score": 1,
            "text": "I.e. fuck everyone",
            "title_similarity": "0.32840872",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlua8lh",
            "score": 1,
            "text": "Additional LPT: it’s okay to do things on your own like go to a restaurant and enjoy a nice dinner, or a movie. In fact, it can be much better on your own (sometimes company can suck).",
            "title_similarity": "0.37229672",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hluaola",
            "score": 1,
            "text": "If no one wants to hang, I go shoot pool alone. I always run into someone I know so it’s straight!",
            "title_similarity": "0.5711293",
            "sentiment_compound": -0.5738
        },
        {
            "id": "hluapdr",
            "score": 1,
            "text": "I'll be at (where I want to go) at (the time I want to be there, and possibly an end time if that's relevant).  If you want to join here's my number.\n\nThis has saved me so much headache making plans.",
            "title_similarity": "0.5087203",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hluaphj",
            "score": 1,
            "text": "My favourite thing in life is going to rock concerts, alone. It's one of the few times I truly feel free to be me and just dance to my heart's content.",
            "title_similarity": "0.44584095",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hluawgu",
            "score": 1,
            "text": "*Or because they won't go with you",
            "title_similarity": "0.67843676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlub1ed",
            "score": 1,
            "text": "It's perfectly legal to have dinner and a movie by yourself. And sometimes it's even more enjoyable",
            "title_similarity": "0.41972446",
            "sentiment_compound": 0.8357
        },
        {
            "id": "hlub3bh",
            "score": 1,
            "text": "True. I think people, including myself, need to take control of their own lives.",
            "title_similarity": "0.5908927",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hlubjv1",
            "score": 1,
            "text": "The most life changing adjustment I ever made was when I",
            "title_similarity": "0.22874348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlubtyz",
            "score": 1,
            "text": "I have no friends",
            "title_similarity": "0.48915356",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hluc1ul",
            "score": 1,
            "text": "Nope.  Hit a wall last month.  Tired of always being the one making plans and pushing for shit to happen. Stopped and have spent a total of 2 evenings since the first of October not on the sofa.  Sadly don’t even gaf anymore.\n\nEdit. On the sofa. Not ‘in’ the sofa",
            "title_similarity": "0.41915452",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hluc56b",
            "score": 1,
            "text": "I’ve been married for 10 years and after we had our daughter my wife didn’t want to travel anymore. I was going solo traveling for the max of 5 days to watch baseball and football games. My wife just told me that I can’t travel anymore. I saidI was going to stop, but the travel bug just bit me, and I’m planing my trip to Minneapolis to catch a ball game next year. Life is short as long as you aren’t falling behind in bills and taking care of the essentials. Go have fun take pictures and if you can travel alone instead of going with someone will mess up your plans it’s happened to me before.",
            "title_similarity": "0.35556465",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hlucbg5",
            "score": 1,
            "text": "I’ve always been willing to go to concerts alone, and it’s the fucking bomb. Never have to help a drunk friend home, never have to find your friend that got lost in the crowd, if you want acting stark raving mad in the pit no one you know is there to judge you, and you just fucking party with a bunch of other people that want to do the same - and if they don’t, you can just move and find people who do.\n\nLove a good solo concert",
            "title_similarity": "0.6059398",
            "sentiment_compound": 0.3054
        },
        {
            "id": "hluchg6",
            "score": 1,
            "text": "This was me until about a year ago. I kept feeling like I needed friends to do literally any activity outside my house. Well, years of few to no friends will force your hand, and now I don’t let that stop me from experiencing the world.",
            "title_similarity": "0.621099",
            "sentiment_compound": 0.7681
        },
        {
            "id": "hluchyr",
            "score": 1,
            "text": "I feel attacked! :D",
            "title_similarity": "0.17805207",
            "sentiment_compound": 0.3237
        },
        {
            "id": "hlucmz7",
            "score": 1,
            "text": "This! I would recommend travelling solo if you can. When I was younger always asked my friends to go places with me but they were always busy with something else. I got fed up waiting and decided to go to a foreign country on my own. The first time was hard but after that it was like a door unlocked. Now I feel comfortable going anywhere alone. It's kind of freeing not to have to check other people's schedules.",
            "title_similarity": "0.6196265",
            "sentiment_compound": 0.9082
        },
        {
            "id": "hlucu14",
            "score": 1,
            "text": "bbb got dinged peddling past",
            "title_similarity": "0.22179866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlucw5i",
            "score": 1,
            "text": "That's nice but some of us don't go out because it's expensive.",
            "title_similarity": "0.45134708",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hluduhj",
            "score": 1,
            "text": "I usually have the opposite problem that I can have so much fun doing things by myself, I have to remind myself to hit up my friends",
            "title_similarity": "0.5361022",
            "sentiment_compound": 0.6096
        },
        {
            "id": "hlueepw",
            "score": 1,
            "text": "LPT: Stop reposting LPT's for Karma farming.",
            "title_similarity": "0.51389813",
            "sentiment_compound": -0.296
        },
        {
            "id": "hluetal",
            "score": 1,
            "text": "As I just came back from my second solo trip to LA in 2 years. Wasn’t awkward at all. A few stares and that’s about it.",
            "title_similarity": "0.26714504",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hluez9g",
            "score": 1,
            "text": "I made plans with a bunch of friends to travel a month in Europe after college. One by one they flaked. I never wavered and went alone. Had a great time! Robbed in Nice, hooked up with a fun Australian girl in Vienna, and made tons of great memories. \n\nIm so glad I did it.",
            "title_similarity": "0.26797503",
            "sentiment_compound": 0.9664
        },
        {
            "id": "hluf32w",
            "score": 1,
            "text": "I’m probably going to straight up ignore this for now but… you have planted a seed.",
            "title_similarity": "0.59472626",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hluf7uc",
            "score": 1,
            "text": "This is how I discovered going to the movies solo. Highly recommended.",
            "title_similarity": "0.40964478",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hlufa93",
            "score": 1,
            "text": "I absolutely LOVED going to the movies or dinner by myself. It was so liberating and you get to just, well, be free to think (or not!) for a bit.",
            "title_similarity": "0.3637721",
            "sentiment_compound": 0.8914
        },
        {
            "id": "hlufarj",
            "score": 1,
            "text": "This is something I struggle with a lot. I HATE doing things by myself. I don’t care what I’m doing but if it’s with other people I have fun. I don’t hardly play video games solo anymore. It just feels really weird to do stuff by myself. The only thing I like doing by myself is shopping.",
            "title_similarity": "0.5912206",
            "sentiment_compound": 0.7653
        },
        {
            "id": "hlufdvq",
            "score": 1,
            "text": "Also applies when going to the gym. Don’t constrain by the schedules of others when it comes too improving your health.",
            "title_similarity": "0.65942514",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hlufg1j",
            "score": 1,
            "text": "yes but What if you keep waiting on yourself?",
            "title_similarity": "0.56177276",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hlufiw2",
            "score": 1,
            "text": "Thanks for the LPT but how. I just went out by myself and it was so depressing. At least at home I can pretend everyone else is home too.",
            "title_similarity": "0.5038306",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hlug00q",
            "score": 1,
            "text": "If I weren't willing to do things alone I would never have stopped being a virgin",
            "title_similarity": "0.5441585",
            "sentiment_compound": -0.0859
        },
        {
            "id": "hlug2ul",
            "score": 1,
            "text": "I’m going to Mexico tomorrow by myself for my birthday. I went last month too. I had a blast.",
            "title_similarity": "0.29362988",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlug8jj",
            "score": 1,
            "text": "no more spectating",
            "title_similarity": "0.66272473",
            "sentiment_compound": -0.296
        },
        {
            "id": "hlugg9n",
            "score": 1,
            "text": "Be a leader if the only person following you is yourself.",
            "title_similarity": "0.6268946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlugs4y",
            "score": 1,
            "text": "This is my motto and it has paid off immensely.  If I'm there with my friend great, if not, I'll make a new one at the event.",
            "title_similarity": "0.36955753",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hlugtdy",
            "score": 1,
            "text": "LPT. Keep fucking reposting this over and over every week for some reason.",
            "title_similarity": "0.33820495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hluh3yt",
            "score": 1,
            "text": "I did this exact thing today. I decided yesterday that I'm going to travel different states and first one I went to was Nevada. I spent the whole day sight seeing and hiking. If I didn't go, I probably would have wasted the day at home. I did feel alone for a bit, but it's better than feeling alone at home wasting time. I'm glad I went out and it was worth it.",
            "title_similarity": "0.40016758",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hluh4cc",
            "score": 1,
            "text": "My birthday is tomorrow and I needed to read this. Thank you",
            "title_similarity": "0.35105035",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hluhco6",
            "score": 1,
            "text": "Hostels are a great way to meet solo travelers.",
            "title_similarity": "0.42105794",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hluhrba",
            "score": 1,
            "text": "Life is so funny sometimes. I just got done having a conversation with my dad an hour ago about going out by myself for the first time because I got tired of waiting on others to get their schedules in order, stack their money, only go if certain people go, or cancel the last min. I will be going to a city I've never been to tomorrow. nervous but excited",
            "title_similarity": "0.45241922",
            "sentiment_compound": 0.4626
        },
        {
            "id": "hluipdl",
            "score": 1,
            "text": "How do I plan to play a game of football at the park if I don't wait for others? How do I play my Battlestar Galactica board game if I don't wait for others? How do I have deep intellectual conversation walking on the beach if I don't wait for others?",
            "title_similarity": "0.36450344",
            "sentiment_compound": 0.8243
        },
        {
            "id": "hluiqbq",
            "score": 1,
            "text": "People are always surprised when J say I like to go to movies and restaurants by myself to have a relaxing/good time.\n\nRestaurants kinda make sense but what do you even do when you go to a movie with friends? You can't talk or anything in the theater anyways.",
            "title_similarity": "0.45841378",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hluivqf",
            "score": 1,
            "text": "Another LPT:\n\nLearn to love going out by yourself. \n\nTrust me, you will won't feel as bummed out when plans fall through, if you are already out, it an opportunity for an adventure or to make new friends.",
            "title_similarity": "0.6630316",
            "sentiment_compound": 0.9403
        },
        {
            "id": "hluj0qs",
            "score": 1,
            "text": "I really need to learn and internalize this. The fear of missing out is so much worse than the fear of going out alone",
            "title_similarity": "0.59383",
            "sentiment_compound": -0.9182
        },
        {
            "id": "hlujfhc",
            "score": 1,
            "text": "This is why I divorced my ex, got my first passport at 52, and went to Scotland by myself for 10 days.",
            "title_similarity": "0.20407972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlujkz0",
            "score": 1,
            "text": "This. Going to concerts or movies alone seemed daunting but now I quite enjoy them.",
            "title_similarity": "0.4254198",
            "sentiment_compound": 0.6416
        },
        {
            "id": "hlujuwy",
            "score": 1,
            "text": "Sounds obvious, but it's great to hear",
            "title_similarity": "0.2178207",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hluk1p3",
            "score": 1,
            "text": "Camping alone isn't quite the same",
            "title_similarity": "0.45450646",
            "sentiment_compound": -0.25
        },
        {
            "id": "hlukf74",
            "score": 1,
            "text": "I can agree with this statement but at the same time , it's boring going to certain places alone (like hiking , going to night club , bowling , ext)",
            "title_similarity": "0.53352433",
            "sentiment_compound": 0.296
        },
        {
            "id": "hlukoho",
            "score": 1,
            "text": "My plans aren’t to get out",
            "title_similarity": "0.71992576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlukuci",
            "score": 1,
            "text": "As an adult with most of my friends having moved away this is a brutal part of life. I make effort to see my best friends but that requires trips, at home I essentially have no social circle anymore. The idea of forming new friendships seems like more work than I have time for. Pretty much just me and my wife these days. Seeing friends is practically a luxury to me.",
            "title_similarity": "0.49680027",
            "sentiment_compound": 0.9323
        },
        {
            "id": "hlul7ge",
            "score": 1,
            "text": "Sex club here I cum",
            "title_similarity": "0.20060915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlulgft",
            "score": 1,
            "text": "Cool thanks, you know what. Fuck it, I'm booking a flight. I don't care anymore. Thanks for the motivation.",
            "title_similarity": "0.51959276",
            "sentiment_compound": -0.2344
        },
        {
            "id": "hlulm5v",
            "score": 1,
            "text": "No one wants to go to the thanks giving parade with me. Fuck it ill do it alone",
            "title_similarity": "0.7001064",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hlulouh",
            "score": 1,
            "text": "The perfect tip. Years ago, when I was studying abroad, I would pick the places I wanted to visit on our school breaks, then tell my friends where I was going and ask if anyone wanted to come. Sometimes they did. Other times I ended up going solo. But I had an absolute blast - and learned I can go it on my own and be ok.",
            "title_similarity": "0.41602525",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hlulq66",
            "score": 1,
            "text": "The first time I traveled by myself was for this reason. People waffled on decisions, couldn't go, didn't reply back, so I decided to go to Chicago and Boston on my own. It was so freeing and exhilarating. It gave me the boldness I needed to travel outside the country with or without someone. I make the plans and send my flight info to friends. If they wanna come... great! If not, that's fine. I'll make my own itinerary and choose what to do without conflicting opinions.",
            "title_similarity": "0.56689286",
            "sentiment_compound": 0.9559
        },
        {
            "id": "hlulsio",
            "score": 1,
            "text": "I bought tickets late September to take my then girlfriend and I to a Halloween concert/gathering type thing.\n\nEnded up breaking up and having to sell our house. 🤷\n\nWent by myself. Got buzzed. Smoked a joint with some old dude and vibed to good ass music. \n\nDon't regret it one bit.",
            "title_similarity": "0.26690674",
            "sentiment_compound": 0.1857
        },
        {
            "id": "hlulxo3",
            "score": 1,
            "text": "True. Have a couple motorcycle buddies and in the beginning it would be “let’s go at 1”, then 1 would come and go, they might show at 3, or cancel. Things like this happened often. So, now, if they text I say “1 and I’m gone either way boys” and stick to it. Often means solo rides. But, I’ve done over 20,000kms in a year and had a blast. they’ve done about 4000kms.",
            "title_similarity": "0.22972447",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hlulzxi",
            "score": 1,
            "text": "One of the best things I ever learned to do is to be comfortable going to the movies by myself.\n\nI got to see what I wanted, when I wanted.\n\nIt was glorious for a time.",
            "title_similarity": "0.40950668",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hlum9ow",
            "score": 1,
            "text": "Agreed!! I applied this lifestyle change a few years ago and it has made me a much happier and self-satisfied person. It also helped to increase my confidence which is a bonus I did not consider. Don't let anyone keep you from doing what you want to do! They're YOUR experiences and memories to make",
            "title_similarity": "0.45310247",
            "sentiment_compound": 0.9411
        },
        {
            "id": "hlumpbn",
            "score": 1,
            "text": "my goodness now this LPT is for me.",
            "title_similarity": "0.273385",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hlun7yg",
            "score": 1,
            "text": "Learned this advice after finding myself single after 20+ years of marriage. Got used to going out to dinner alone, movies alone, etc. But in spite of loving live music, I couldn’t bring myself to see a concert alone. Finally cracked that one in September. Now I have tickets for shows in February and April too.",
            "title_similarity": "0.35510916",
            "sentiment_compound": -0.4118
        },
        {
            "id": "hlun92b",
            "score": 1,
            "text": "But I am an introvert",
            "title_similarity": "0.39093125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlunk7a",
            "score": 1,
            "text": "Oh yah let me just get over the crippling depression and agoraphobia I think I developed during quarantine 😊",
            "title_similarity": "0.28955966",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hlunliq",
            "score": 1,
            "text": "Was waiting for my boys to go watch Venom, they always had excuses. Finally went by myself, all of a sudden they start talking smack. Nah man, I actually enjoyed going alone.",
            "title_similarity": "0.45297116",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hlunq5e",
            "score": 1,
            "text": "Why wait for people? They suck.",
            "title_similarity": "0.49334016",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hlunsfz",
            "score": 1,
            "text": "The issue I take with this is that without having someone to chat with or talk to about it while it is happening, I'll never remember much about it. I may recall a couple facts and that I did something, but everything else fades quickly. \n\n\nSo for me, not having anyone to share it with almost makes it like it didn't happen.",
            "title_similarity": "0.6759424",
            "sentiment_compound": 0.6863
        },
        {
            "id": "hlunxei",
            "score": 1,
            "text": "I really needed this tonight. A few weeks ago I spontaneously booked a (very expensive) ticket to go and watch a production of the Nutcracker in London alone as I’ve always wanted to see a ballet, but no one I know would be very interested. I’ve been panicking all night about it, wondering if it was stupid of me to go ahead with it, whether I’ll look like an idiot showing up by myself, and I even nearly cancelled my hotel. But this made me feel better.",
            "title_similarity": "0.44458187",
            "sentiment_compound": -0.823
        },
        {
            "id": "hluo1fi",
            "score": 1,
            "text": "Always tried inviting people to do things. Movies/ dinner even concerts. When my favorite band had a show coming up a few years ago and everyone was silent. I said fuck it snd bought one for myself. Went managed to meet see chad smith walking into his managers car in the parking lot. I saw flea casually riding his bike and got an insanely good spot up front. Had one of the most incredible experiences of my life. Don’t wait for anyone that won’t wait for you. And don’t deprive yourself of living when others don’t want to with you.",
            "title_similarity": "0.48091975",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hluo43w",
            "score": 1,
            "text": "I make my own plans and do them by myself at home :)",
            "title_similarity": "0.5630705",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hlupy8v",
            "score": 1,
            "text": "You know how lonely it is going out by yourself",
            "title_similarity": "0.48515964",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hlupz1x",
            "score": 1,
            "text": "It’s almost bizarre coming across this because I literally just started doing this for myself. I would often feel sad and lonely because I couldn’t find people that wanted to do the same things as me but I’ve decided I’m done waiting. I’ll watch all of the movies I’m interested in by myself. I’ll get coffee or go thrift shopping. It’s been absolutely liberating.",
            "title_similarity": "0.49897245",
            "sentiment_compound": 0.0635
        },
        {
            "id": "hlupzn1",
            "score": 1,
            "text": "Truth I’ve been to a few concerts and sporting events on my own cuz I wanted to go but no one else did. Maybe a little awkward at first but worth it if it’s something you enjoy",
            "title_similarity": "0.527226",
            "sentiment_compound": 0.6174
        },
        {
            "id": "hluq67f",
            "score": 1,
            "text": "This is me man , none of my mates hang out with me anymore :(",
            "title_similarity": "0.6189458",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hluqvtb",
            "score": 1,
            "text": "I started to just make announcements like “going to ______ if you want to go meet me at ______ by ______ or I’ll see you there, if not y’all be safe”. And that’s how I ended up planning most of our friend outtings.",
            "title_similarity": "0.4775919",
            "sentiment_compound": 0.7402
        },
        {
            "id": "hlurdq1",
            "score": 3,
            "text": "i totally agree, but what i enjoy about doing new things is sharing it with someone i care about. that new restaurant that looks amazing? if i go by myself, it ends there. i ate, i enjoyed, i left. but if i go with my spouse or my best friend, we'll dissect every piece of the evening, what we like, what we don't like, and we'll talk for years about that evening. \n\ni went to Berlin by myself once and although it was enjoyable and i don't regret going, i was missing someone to share it with. there was no one to make the stupid sarcastic joke to during the walking tour, and no one to be like \"dat you\" at a weird looking statue in the museum. i don't want new experiences, i want new experiences through the human interactions from that experience\n\nso this always feels like a cookie cutter ~inspiring~ quote that shames me for waiting for someone to be available to do things with me",
            "title_similarity": "0.4480053",
            "sentiment_compound": 0.9907
        },
        {
            "id": "hlut54a",
            "score": 1,
            "text": "But how to overcome the \"awkwardness\" of going out alone, sitting at a restaurant dinner table alone, shop alone? I think the problem is that I think too much about what other people might be thinking - \"oh he has no friends\". I know worrying too much about what others think of you is a stupid way to live, but it's sometimes hard to not.",
            "title_similarity": "0.5330312",
            "sentiment_compound": -0.9742
        },
        {
            "id": "hlutgvd",
            "score": 1,
            "text": "Dont tell me what to do",
            "title_similarity": "0.5728011",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlutnyw",
            "score": 1,
            "text": "I learned this from my son. He wanted to go out and do something and all of his friends couldn’t go. So I kept asking if he really wanted to go and he kept saying yes. I dropped him off and he had a blast. Didn’t matter that he didn’t know anyone there. He went out and had fun on his own. After I picked him up I was like, man, I’m jealous that he was able to do that at his age. I couldn’t and didn’t do that when I was his age.",
            "title_similarity": "0.5603483",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hluto3x",
            "score": 1,
            "text": "I do this. I make plans and stick to them, it’s okay if life messes up others plans but my ass is using my/our  skydiving Groupon. Someone couldn’t make it?Shit I go twice!",
            "title_similarity": "0.49381697",
            "sentiment_compound": -0.68
        },
        {
            "id": "hlutons",
            "score": 1,
            "text": "Had to tell myself this years ago. I always planed things to do and no one would pull through, so I would go solo dolo baby.",
            "title_similarity": "0.71070087",
            "sentiment_compound": -0.296
        },
        {
            "id": "hlutt0x",
            "score": 1,
            "text": "This has basically been my whole life and while I agree with you, doing things alone gets old pretty quick",
            "title_similarity": "0.4319619",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hluu6iu",
            "score": 1,
            "text": "Agree with this. I love going to the movies but every time I would attempt to get a group to go, I would either not end up going on the day I wanted to go or after a long discussion, I end up not watching the movie I actually wanted to see. \n\nI started just having movie days for myself. Now I’m married and go to the movies often with my husband but sometimes when he doesn’t want to watch, I still go alone. I enjoy myself and my time.",
            "title_similarity": "0.49916008",
            "sentiment_compound": 0.765
        },
        {
            "id": "hluuczu",
            "score": 1,
            "text": "Just came back from a week long solo vacay for this very reason.",
            "title_similarity": "0.28222352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hluumyp",
            "score": 1,
            "text": "I’m 34, I’ve only been the movies alone one time.   I definitely want to do it more.  I feel like I’ve missed out on so much.",
            "title_similarity": "0.40501142",
            "sentiment_compound": 0.3744
        },
        {
            "id": "hluuqf5",
            "score": 1,
            "text": "I never understand why some people are like, \"I want to go to (insert event here) but there's no one to accompany me\". If you want to go, just go.",
            "title_similarity": "0.7328696",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hluuu67",
            "score": 1,
            "text": "On the flip side, know yourself. \n\nIf no one at the office ever shows then maybe don’t prepurchase that paintball package for 10, Daryll, then be mad/depressed when per usual no one shows.",
            "title_similarity": "0.47239614",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hluv5ba",
            "score": 1,
            "text": "I realized this right before the pandemic hit and shut everything down. I wanted to get better at bowling, but had the toughest time finding consistent partners. I started going by myself and found out that I actually really enjoy doing things by myself. \n\nI’ve also noticed that friends are actually much more down to hang or tag along once they see that you’re going to go do whatever your plan is regardless of whether or not they join",
            "title_similarity": "0.56749785",
            "sentiment_compound": 0.8425
        },
        {
            "id": "hluwmpo",
            "score": 1,
            "text": "Not going out *is* my plans.",
            "title_similarity": "0.73360974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hluwny0",
            "score": 1,
            "text": "But social anxiety keeps me from going alone to places I want to go :(",
            "title_similarity": "0.6786982",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hlux6sa",
            "score": 1,
            "text": "I'm implementing this, I already went to two different new places by just sticking to my OWN plans and I just booked a hotel in a touristic city. Great LPT.",
            "title_similarity": "0.40616778",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hluxyv5",
            "score": 1,
            "text": "Replace \"Do you want to go X?\" with \"I'm going X, want to come with?\"",
            "title_similarity": "0.3936813",
            "sentiment_compound": 0.2406
        },
        {
            "id": "hluy7fw",
            "score": 1,
            "text": "I don’t enjoy doing anything.  I would enjoy even less by myself.",
            "title_similarity": "0.63109577",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hluybo4",
            "score": 1,
            "text": "40 something year old me wishes I had this information back when i was a kid.",
            "title_similarity": "0.29693168",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hluyjns",
            "score": 1,
            "text": "I wish I’d learned this years before my divorce, but it’s something I’ve been doing better for myself since. Do the fun thing. Make memories for yourself. It might feel weird at first, but doing something you want to do alone is infinitely better than doing nothing alone and wishing you were doing something.",
            "title_similarity": "0.5773958",
            "sentiment_compound": 0.9003
        },
        {
            "id": "hluylo2",
            "score": 1,
            "text": "Who wants to be my fren?",
            "title_similarity": "0.46585453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hluyucu",
            "score": 1,
            "text": "wow i needed this",
            "title_similarity": "0.22054544",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hluz2vt",
            "score": 1,
            "text": "I try this but when I do things alone I always think to myself this could be better with a friend or partner",
            "title_similarity": "0.59955424",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hluz81m",
            "score": 1,
            "text": "This is why I bought a motorcycle and a 55L backpack. Not used simultaneously, of course",
            "title_similarity": "0.35162905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hluzent",
            "score": 1,
            "text": "That is why I booked a solo trip, no regrets… living my best life..",
            "title_similarity": "0.585041",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hluzmgc",
            "score": 1,
            "text": "This is so true. I didn’t realize this (probably still don’t action it as much as I should) until I was in my 30s, but this is truly the best advice. Do you, time goes too fast",
            "title_similarity": "0.41825914",
            "sentiment_compound": 0.9179
        },
        {
            "id": "hlv05fx",
            "score": 1,
            "text": "Yes! I figured this out several years ago and have done quite a few things alone I never thought I would do.",
            "title_similarity": "0.44709933",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hlv08c0",
            "score": 1,
            "text": "I got out of a 3.5 year relationship where we did everything together so I had to adjust to being alone. It’s actually really nice! I love dining out by myself with a book.",
            "title_similarity": "0.28399128",
            "sentiment_compound": 0.7813
        },
        {
            "id": "hlv0c3j",
            "score": 1,
            "text": "If I’d have waited for other people to join me on my trips, I would have never gone. Ended up traveling to 12 countries and countless American cities solo and had some of the best moments of my life. Don’t let other people dictate your experiences.",
            "title_similarity": "0.578408",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hlv1tvd",
            "score": 1,
            "text": "I feel personally attacked ;;;;;;;; this is me in a single lpt post",
            "title_similarity": "0.33301294",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hlv202d",
            "score": 1,
            "text": "True, started doing this and I feel better",
            "title_similarity": "0.19131541",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hlv29zd",
            "score": 1,
            "text": "Great advice in theory, not always possible when you're disabled.",
            "title_similarity": "0.37920326",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlv2gwc",
            "score": 1,
            "text": "Go to the movies by yourself, it's worth it!",
            "title_similarity": "0.45309645",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hlv2lbi",
            "score": 1,
            "text": "Really struggling with this at the moment.",
            "title_similarity": "0.30303293",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hlv2lwp",
            "score": 1,
            "text": "It’s definitely a learning process but so worth it. I’ve noticed my days are exponentially more enjoyable when I just do my thing without waiting on my friend or sibling or partner to decide whether they want to join along. Your time is precious, you better act like it.",
            "title_similarity": "0.50807035",
            "sentiment_compound": 0.9835
        },
        {
            "id": "hlv37hr",
            "score": 1,
            "text": "It's me, I am that person",
            "title_similarity": "0.25646985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv3egm",
            "score": 1,
            "text": "Agreed. I took my first trip this past august for my birthday. Just me and a new city.",
            "title_similarity": "0.27211273",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hlv3irt",
            "score": 1,
            "text": "Love this LTP. I’ve had some of the best interactions with strangers while being out alone. One time a man I I were the only two people dining alone in a restaurant. I can’t remember how we started talking, but we eventually joined each other and he told me his fascinating life story. I’ll never forget that conversation. Sometimes going out along sucks too. Especially when everyone else knows each other and you feel like a spare wheel. I get anxiety sometimes and this can really make it worse. It’s so worth taking the risk though. I met my best friend of 20 years now while alone in a bar. You never know where life will take you.",
            "title_similarity": "0.3521374",
            "sentiment_compound": 0.92
        },
        {
            "id": "hlv3wkr",
            "score": 1,
            "text": "I will forever be jealous of my pal u/jakall01 for being able to do this exact thing!",
            "title_similarity": "0.36036065",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hlv4c2s",
            "score": 1,
            "text": "This sounds so nice.. I really do need to start doing things and just flow!",
            "title_similarity": "0.3820551",
            "sentiment_compound": 0.6005
        },
        {
            "id": "hlv4kuf",
            "score": 1,
            "text": "Ah yes, the \"just do it\" advice of an someone who doesn't understand how hard it is for an introvert to show up even when its at the insistence of friends with plans.",
            "title_similarity": "0.6343249",
            "sentiment_compound": 0.7266
        },
        {
            "id": "hlv4n0e",
            "score": 1,
            "text": "I’ll do lots of things alone, but not go to the movies alone.",
            "title_similarity": "0.6478337",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hlv4pxt",
            "score": 1,
            "text": "So is this sub just a bunch of fortune cookies or there any actual pro tips?",
            "title_similarity": "0.2127243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv4qg2",
            "score": 1,
            "text": "Recently decided to stop waiting on people to invite me to things, especially people who I know won't reach out. There are plenty of others who actually want to see me who I can text and set something up with.",
            "title_similarity": "0.64102924",
            "sentiment_compound": -0.0961
        },
        {
            "id": "hlv4ta5",
            "score": 1,
            "text": "well said, thank you",
            "title_similarity": "0.20982562",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hlv53qd",
            "score": 1,
            "text": "We’ve applied this line of thinking to group trips as well. We used to try to schedule trips with friends and family and it’s extremely difficult to find a good date for everybody. Now we just plan our trip and let everyone we want to go know and if they can make it awesome if not no biggie.",
            "title_similarity": "0.4816192",
            "sentiment_compound": 0.8909
        },
        {
            "id": "hlv53r2",
            "score": 1,
            "text": "I swear this is posted weekly",
            "title_similarity": "0.16124056",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hlv5og6",
            "score": 1,
            "text": "If u only knew how much that this was needed for me. It was almost like a God Smack!",
            "title_similarity": "0.3483786",
            "sentiment_compound": 0.5164
        },
        {
            "id": "hlv5pyd",
            "score": 1,
            "text": "Like it sucks how many people suck at making their own plans.",
            "title_similarity": "0.48964113",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hlv6kf2",
            "score": 1,
            "text": "Just went to dinner and saw a Broadway show by myself. Felt so liberating.",
            "title_similarity": "0.29094368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv71p0",
            "score": 1,
            "text": "I was doing so well for the few years before covid. Now we've had to stay home and I'm back into old habits. I keep telling myself I'm going to get out but I haven't yet.",
            "title_similarity": "0.45362198",
            "sentiment_compound": 0.2193
        },
        {
            "id": "hlv7u2t",
            "score": 1,
            "text": "i like this advice but it’s kind of scary when i am a small female and am scared of being kidnapped and sold into human trafficking",
            "title_similarity": "0.38883334",
            "sentiment_compound": -0.8334
        },
        {
            "id": "hlv85lo",
            "score": 1,
            "text": "This sounds great but after the fifth or sixth time going out by yourself to do somthing it really gets old imo",
            "title_similarity": "0.38193452",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hlv8j7j",
            "score": 1,
            "text": "this is the key to everything.",
            "title_similarity": "0.3506129",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv8nri",
            "score": 1,
            "text": "My friends have labeled me a “control freak” due to this philosophy. We make plans together and when the follow through of others fails I stick to the game plan and always have a great time. Some friends get left at home and others are pissed that these friends couldn’t participate. Not my problem.",
            "title_similarity": "0.5361794",
            "sentiment_compound": 0.8252
        },
        {
            "id": "hlv91fz",
            "score": 1,
            "text": "Im the person that never gets out because that's my plan, and I stick to it",
            "title_similarity": "0.7855639",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv9g5d",
            "score": 1,
            "text": "I won a 1 week hotel stance in Orlando, i asked a lot of people to come with me and for one thing or another no one could , I'm about to go by myself low key scared but fuck it can't let that prize go to waste🤞🏻",
            "title_similarity": "0.45718792",
            "sentiment_compound": -0.9294
        },
        {
            "id": "hlvc0qh",
            "score": 1,
            "text": "I'm sorry but as a girl it's just hard to feel safe going out to places alone. Last concert I went to it was with a friend, but we talked to a random guy while we waited in line and he said he went to concerts alone all the time. I couldn't fathom the idea of doing that myself, going into the city especially at night alone is terrifying.",
            "title_similarity": "0.48961046",
            "sentiment_compound": -0.6752
        },
        {
            "id": "hlvdbkv",
            "score": 1,
            "text": "What if it’s my dog",
            "title_similarity": "0.28536627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvebif",
            "score": 1,
            "text": "I wish I could do this, but with not being able to drive and no public transport, I have to rely on others if I want to go anywhere",
            "title_similarity": "0.64971936",
            "sentiment_compound": -0.128
        },
        {
            "id": "hlveg7d",
            "score": 1,
            "text": "I love that I learned this not long ago and have been going to SO many things. I love going to a movie theater more than anything, and I’ve been to over 70 this year so far. Only about 6 with other people.",
            "title_similarity": "0.1684235",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hlvejr2",
            "score": 2,
            "text": "My favorite is to go to art walks alone. I can spend time on what I'm into, don't have to rush and can move on to the next exhibit when I'm ready to.",
            "title_similarity": "0.60294837",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hlvgp6y",
            "score": 1,
            "text": "I hate life so much.",
            "title_similarity": "0.36965823",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hlvgz4x",
            "score": 2,
            "text": "One of the greatest decisions I've ever made!",
            "title_similarity": "0.20505178",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hlvgzne",
            "score": 2,
            "text": "And that's also how you'll makes friends- by getting out there and doing the things you love",
            "title_similarity": "0.4619156",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hlvhizm",
            "score": 1,
            "text": "I needed to hear this , my last 2 dates didnt happen and I just sat at home doing nothing for the rest of the day . Next time this happens I'll just go alone and have fun by myself ^^",
            "title_similarity": "0.56725043",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hlvihv4",
            "score": 1,
            "text": "good philosophy, i live a lot like this, every holiday i booked in the last 10 years i booked alone but i only actually went on 3 alone, other people jumped on board pretty quickly after i booked most times. if you want to do something dont hang about waiting for an excuse, just do it",
            "title_similarity": "0.32276416",
            "sentiment_compound": 0.775
        },
        {
            "id": "hlvk95t",
            "score": 1,
            "text": "But I want to go stargazing - and that is best done where and when it is dark and I'm terrified of the dark...",
            "title_similarity": "0.48471808",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hlvl0v5",
            "score": 1,
            "text": "I needed this advice 20 years ago.",
            "title_similarity": "0.19092226",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvmmp6",
            "score": 2,
            "text": "Great advice. A majority of my twenties were spent planning big trips with friends that never happened. We could never agree on a location or something came up that made it “not a god time”. At 30 years old I just said fuck it, I’m going where and when I want. I bought a plane ticket to meet my now wife. If you wait for everyone to be ready, you may never do it.",
            "title_similarity": "0.45647383",
            "sentiment_compound": 0.7572
        },
        {
            "id": "hlvn097",
            "score": 1,
            "text": "I started doing this when I play pool. I used to ask \"Is anyone available to play some games this Friday?\". Now I say, \"I'm playing pool at 5 pm, let me know if you want to go\". If no one is available, I'll go by myself and ask other solo players if they want to play a few games. Most of the time, someone there is free for a few games.",
            "title_similarity": "0.34535322",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hlvogyl",
            "score": 1,
            "text": "This pro-tip also applies to cave diving, hiking, anything away from civilization.",
            "title_similarity": "0.4413462",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hlvqnvz",
            "score": 2,
            "text": "Very nice tip which I used for myself. Since covid era I stopped travelling but before that I visited 2/3 of Europe major cities via solo travel. I have so many sweet memories,interesting places,people,food etc... Every time I asked my friends to travel with they almost never had time/money/family issue etc... And if i would have to wait them,I would have been stuck with my home city forever.",
            "title_similarity": "0.43885496",
            "sentiment_compound": 0.8255
        },
        {
            "id": "hlvraug",
            "score": 1,
            "text": "Let’s get real. No one likes that feeling of going somewhere alone only to see groups of people having fun while you sit by yourself with your head down in your phone. It’s such an awkward experience.",
            "title_similarity": "0.5469438",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hlvrrxi",
            "score": 2,
            "text": "You say this but on the flip side - I do just go ahead and do stuff regardless and it means I do a lot of things by myself and that wears on you in its own way.",
            "title_similarity": "0.6240101",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvru3p",
            "score": 1,
            "text": "The first 25 years of my life, I was always the guy in the group who’d suggest something only to have everyone else reject it and say we do something else, so I’d just go along with the group.  \nThen the same thing happened in my first serious long term relationship.  I’d suggest things to do, dates, but my gf at the time would be pretty “bleh” about the things I wanted to do. Then when she wanted to do things, I would almost always oblige.  Needless to say that relationship ended. \nThen finally I just said fuck it, and stopped asking people if they wanted to do things and I just started doing them, often times by myself.  This would include going to the movies, going kayaking, trips into the city/downtown, going shopping at the mall.  Once I realized I didn’t need other people to do shit with me, I started living quite literally my best life.  \nNow 5 years later I’m happily married, my wife and I love to plan road trips and vacations together, and I still like to catch a movie by myself every now and again.",
            "title_similarity": "0.50537133",
            "sentiment_compound": 0.9252
        },
        {
            "id": "hlvud29",
            "score": 1,
            "text": "Took me 27 years to learn this LPT. I agree though. I’ve made plans many times where someone canceled or I would wait around for them to come through on the plans. Sometimes waiting 10 or more hours for them. \n\nShit hurt deep down in my soul. I began cutting people off and breaking friendships off because of it. One of those relationships that I ended started again. I stopped talking to one of my closer friends because he would frequently be too tired or he would forget we had plans. Only to find out he went out drinking with co-workers or some shit. \n\nAfter not talking for 4 months he randomly text me one night and apologized. Telling me he understood why I didn’t want to be his friend anymore. He promised he would do better if I have him another chance. \n\nThat was 4 years ago now. He’s currently my BFF for sure. His mom and dad call me their son now. We’re very close and have seen each other through some very very low times. \n\nI’m glad I set boundaries though. Some people aren’t self reflective. Those people are still not in my life and never will be again.",
            "title_similarity": "0.34930515",
            "sentiment_compound": 0.8709
        },
        {
            "id": "hlvuq8u",
            "score": 1,
            "text": "I’ve always struggled with this. But what if the idea of going alone to a concert, festival/rave, zoo, movie theater, or whatever else sounds truly un-fun? I’d honestly rather just stay home than go to events alone. But if I go with my partner or friends, it creates memories that I cherish for years. Why is that? Am I missing something?",
            "title_similarity": "0.5621257",
            "sentiment_compound": 0.902
        },
        {
            "id": "hlvuysb",
            "score": 1,
            "text": "Relying on someone/others is a disease which will eat you up slowly.",
            "title_similarity": "0.4120574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvvwxr",
            "score": 1,
            "text": "what if i dont wanna leave home",
            "title_similarity": "0.61969125",
            "sentiment_compound": 0.0382
        },
        {
            "id": "hlvwdz1",
            "score": 1,
            "text": "On behalf of the introverts please, please go do things without us. If you find enough joy in it we might come later but for the love of god do not tell us we need to \"go out and experience life to the fullest\" by trying *your* new outdoor hobby or \"experiencing\" the new restaurant with *your* acquaintances.",
            "title_similarity": "0.7082432",
            "sentiment_compound": 0.9209
        },
        {
            "id": "hlvwq5y",
            "score": 1,
            "text": "I literally havent gone outside for two months… maybe Ill take this as a sign",
            "title_similarity": "0.30665058",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hlvy74a",
            "score": 1,
            "text": "Thank you. Needed to see this",
            "title_similarity": "0.2412301",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlvyige",
            "score": 1,
            "text": "Very true LPT. \n\nI used to go to the Wacken Festival with friends from my former town but when I moved across the country they - for various reasons - didn't want to go, so I was like, damn, but then said fuck it and bought my own ticket and busride. \n\nLiterally the first two strangers I spoke to at the festival are still my friends 10+ years later.\n\nJust go, dudes",
            "title_similarity": "0.38306612",
            "sentiment_compound": 0.8252
        },
        {
            "id": "hlvz2qs",
            "score": 1,
            "text": "This was me trying to get my friends to go camping and backpacking with me. Wasted ten years waiting around for them until I said, \"Fuck it\" and started going out by myself and having a blast.",
            "title_similarity": "0.36136183",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hlvzhhx",
            "score": 1,
            "text": "That's me.. I pretty much live as a hermit now.",
            "title_similarity": "0.44361472",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hlw07tq",
            "score": 1,
            "text": "Nah buddy, going ALONE to clubs or similar activities are a 2+ person must",
            "title_similarity": "0.5070655",
            "sentiment_compound": -0.4824
        },
        {
            "id": "hlw2cua",
            "score": 1,
            "text": "I used to be like this. I spent most of my 20s wanting to go out and do stuff but could never get anyone else who was interested to go along. Then I turned 30 and realized not going out > going out. There's nothing wrong with being the person who never goes out and does stuff.",
            "title_similarity": "0.64294714",
            "sentiment_compound": 0.8239
        },
        {
            "id": "hlw53td",
            "score": 1,
            "text": "This works unless you have documented medical social anxiety. 😓",
            "title_similarity": "0.40282816",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlw6vgg",
            "score": 1,
            "text": "This is an amazing piece of advice. \nFortunately I embraced this at an early age, and pretty much did as I chose. Travel, adventure etc.  I was fortunate to find someone to go through life with who also had this view. \n\nNo regrets. \n\nNever wait for others. They will let you down.",
            "title_similarity": "0.5183213",
            "sentiment_compound": 0.9233
        },
        {
            "id": "hlw72wd",
            "score": 1,
            "text": "\"Make your own plans\" they say. \"Get out there\" they say. \n\nI live in a God damn retirement community ffs(not my choice). No drivers license because driving makes me panic, public transportation here sucks, there's barely anything to see or do and there's hardly anyone my own age.\n\nFor some it's not as simple as just \"gEt oUt ThErE\". Even if I wanted to, theres no plans to be made in a hole like this.",
            "title_similarity": "0.58914375",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hlwc202",
            "score": 1,
            "text": "It took me almost 30 years to realize how true this is. Good LPT is good.",
            "title_similarity": "0.21628451",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hlwcjk0",
            "score": 1,
            "text": "Sometimes it's fun to go out by yourself. You tend to meet new people, and see old friends too. Its great!",
            "title_similarity": "0.33495095",
            "sentiment_compound": 0.8955
        },
        {
            "id": "hlwe7sy",
            "score": 1,
            "text": "I started that this year because I was sick of waiting. Took a fun trip out of state, went swimming more and learned new skills, jumped out of a damn plane. Been a good year",
            "title_similarity": "0.32344761",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hlwf3fl",
            "score": 1,
            "text": "To get my friends to agreed to go out I woyld have to lie and say everyone is going.  \n\nThey would all go unless they were already busy. Fucking weird I had to do that.",
            "title_similarity": "0.61078835",
            "sentiment_compound": 0.4951
        },
        {
            "id": "hlwfp98",
            "score": 1,
            "text": "When I was 21 I went on a six week backpacking trip through Southeast Asia by myself. It was genuinely the best time of my life and it was crazy how many people I met who were doing the same\n\nr/solotravel for anyone interested",
            "title_similarity": "0.23181261",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hlwge1x",
            "score": 1,
            "text": "I feel like it sounds better if you’re already out doing something when someone calls to invite you somewhere instead of saying you’re at home doing nothing.",
            "title_similarity": "0.67204833",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hlwi6yj",
            "score": 1,
            "text": "I took myself out for my birthday (almost a month late) this year. I'm still kinda disappointed that nobody went with me, but fuck it, I'm glad I treated myself.",
            "title_similarity": "0.38390517",
            "sentiment_compound": -0.3926
        },
        {
            "id": "hlwix69",
            "score": 1,
            "text": "I don’t go out because people fucking suck",
            "title_similarity": "0.6128156",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hlwj74o",
            "score": 1,
            "text": "I really feel this, but also, goddamn if it isn't so hard. I'm shy as hell and have terrible anxiety 99% of the time, and I just really wish I could grow past it and start enjoying life without needing to use other people as a crutch. \n\nI went on vacation a couple months ago, went two hours away and stayed at the beach. It ended up being incredibly exhausting because I was alone the entire time and had no one to talk to. I ended up being harassed and stalked by some other girls around my age, and decided to cut my week long trip short after just 3 days because I felt terrified and unsafe.    \nIt's hard doing everything alone. Cooking alone, driving alone, going to places I love, but not being able to point at something and say 'wow look at that!' and have a discussion about it.\n\nI have a vacation planned for next year, down to florida, and I'm terrified my friend will bail on me and that I'll end up alone. I'm renting a huge house (through my work; see one of my previous posts in momforaminute for deets) that takes up to 11 adults, for 8 days. I don't want to be one of those creepy adults that goes to Disney alone. If I end up there alone I'm so afraid of what could happen or go wrong.",
            "title_similarity": "0.4393157",
            "sentiment_compound": -0.9896
        },
        {
            "id": "hlwjykf",
            "score": 1,
            "text": "But I can’t afford to go out so I would need friends with money to pay for me",
            "title_similarity": "0.4687329",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hlwkw3n",
            "score": 1,
            "text": "Hey. Not doing anything is response to being turned down is a coping mechanism that I tell myself works great every time. Now let me get back to holding my head between my knees *closes closet door*",
            "title_similarity": "0.61484605",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hlwlkqy",
            "score": 1,
            "text": "At 34, still learning how to do this.",
            "title_similarity": "0.25987682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlwll8t",
            "score": 1,
            "text": "It's a good message but sadly some of us aren't so fortunate. Ive been diagnosed with agoraphobia, generalized anxiety disorder and panic disorder. I find it extremely difficult to go out on my own let alone with others.",
            "title_similarity": "0.41286814",
            "sentiment_compound": -0.979
        },
        {
            "id": "hlwp3vd",
            "score": 1,
            "text": "I second this. Your youth won't last forever. Your SO may never come around to it.",
            "title_similarity": "0.60150295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlwr4tx",
            "score": 1,
            "text": "I learned this mid way thru college, and life felt so much better. I used to think I’d look like a loser doing activities like bowling, watching a band or going to the movies by myself. I found it just as fun! That’s when I learned to prioritize yourself because you deserve to have fun and someone not going shouldn’t stop that.",
            "title_similarity": "0.47834924",
            "sentiment_compound": 0.9111
        },
        {
            "id": "hlwrqsd",
            "score": 2,
            "text": "For the last two weeks ive been debating on whether or not to rent this little hut in the woods that is 6 hours away from my place and this post has made me do it. Thank you.",
            "title_similarity": "0.29851878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlwrxqv",
            "score": 1,
            "text": "Eh, I don't like to do things outside, but will be more than happy to do them with other people.\n\nIt's more about the company than the activity. I don't get excited about going places. So being \"the person who never gets out just because nobody can go with them\" is who I am at my core. I'd never leave my house if I didn't have to.",
            "title_similarity": "0.7812655",
            "sentiment_compound": 0.5545
        },
        {
            "id": "hlwyaap",
            "score": 1,
            "text": "Except things are way less fun alone",
            "title_similarity": "0.47446543",
            "sentiment_compound": 0.315
        },
        {
            "id": "hlwyc3c",
            "score": 1,
            "text": "I needed this reminder",
            "title_similarity": "0.3811341",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlwymfr",
            "score": 1,
            "text": "The other part is always make your plans, and never tell them to nobody. \nIf nobody can go, you are prepared to do your own thing. If they go out with you, that's fine but never be dependent on the plans of other people.\n\nEdit:\nIt seems there is a lot of people who value friends over everything in the world, but there is a catch. Friends are also people with flaws you most of the time you don't see, because of the relationship.\n\n\nIt's a very good idea to have balance and priorities. Family should be the first on the radar, and then friends if they deserve such a high place in your life. \nYou set the standards, or others will set them for you.\n\nIf you ask why family first, just look around yourself and find people who decided to have kids. Who cares about those kids the most? Friends? Maybe relatives? \nThey care the most about their own kids, if their mental configuration is fine and perhaps grandma and grandpa on either side. Other than that, don't be fooled by the false smiles and parties.\n\nNo, I am not bitter just speaking from great deal of experience.",
            "title_similarity": "0.7681672",
            "sentiment_compound": 0.9957
        },
        {
            "id": "hlx0cvx",
            "score": 1,
            "text": "Yeah this doesn't always work as well as it sounds. \n\nDoing a lot of things alone is just awkward. \n\nTry going to a fancy restaurant and sitting at a table by yourself",
            "title_similarity": "0.42534643",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hlx1csy",
            "score": 1,
            "text": "But I don't like doing things by myself though. It's just not fun for me if I can't enjoy or experience it with someone else. I can't be the only one",
            "title_similarity": "0.65049577",
            "sentiment_compound": -0.8645
        },
        {
            "id": "hlx1n9j",
            "score": 1,
            "text": "I will say as a 6'4, 240 pound guy it's alot easier for me to go out by myself then it is for 5'0 tall girlfriend. I use to tell all my friends to go out by themselves and never took in account the reality of the statement, not everyone is safe by themselves.",
            "title_similarity": "0.482867",
            "sentiment_compound": 0.5414
        },
        {
            "id": "hlx3dvt",
            "score": 1,
            "text": "Thanks, I really needed this today! I’m going to try the restaurant I wanted, alone, and I’m going to have a good time!!",
            "title_similarity": "0.5067984",
            "sentiment_compound": 0.6884
        },
        {
            "id": "hlx5x0n",
            "score": 1,
            "text": "I planned a solo trip to New Orleans and met three girls from the UK in a jazz bar who had a spare ticket to see Beyoncé at the Superdome. Definitely glad I went.",
            "title_similarity": "0.21771048",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hlxef9v",
            "score": 1,
            "text": "Facts. Sometimes you just gotta go do your own thing. Cant wait forever...otherwise you are missing out on life\\~",
            "title_similarity": "0.7497927",
            "sentiment_compound": -0.296
        },
        {
            "id": "hly0fs8",
            "score": 1,
            "text": "Been doing this more and more as I get older. Not going to say no to things I want to do just because friends don’t want to do them!\n\nAnd choose friends carefully too. A few close, true friends is 10 times better than a large circle of acquaintances.",
            "title_similarity": "0.4616836",
            "sentiment_compound": 0.9348
        },
        {
            "id": "hpr7xgd",
            "score": 1,
            "text": "Agree. This is what led to me taking my first solo trip and now I’m never waiting for friends to travel with me. I’m booking my flight, you’re welcome to come, but if you can’t I’m still having a good time 😎",
            "title_similarity": "0.5796706",
            "sentiment_compound": 0.8697
        }
    ]
}