{
    "LPT: Instead of buying a dog as a Christmas present, buy accessories such as a leash, collar, and bowl. Your child can open these and get excited on Christmas morning. Then, when things have settled down, you can take your child to the shelter to pick out a pet together.\nAnimal shelters fill up with unwanted \"presents\" in January. If you hold off just a little, you can be a part of the solution AND find a pet that jives with you and your family's personality.": [
        {
            "id": "hm7bjgj",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.50997967",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hm7zfm2",
            "score": -2,
            "text": "Adopt dogs instead of “buying” them. 😓",
            "title_similarity": "0.49359882",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hm86659",
            "score": -2,
            "text": "Shelter dogs are the best, never going back.",
            "title_similarity": "0.31866646",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm8dnl6",
            "score": 5,
            "text": "I’d rather go through a respectable breeder. I don’t need an animal with a questionable history around children.",
            "title_similarity": "0.39813167",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hm8hso9",
            "score": 8,
            "text": "Just don't get a pitbull. Not even a 1/4 pitbull",
            "title_similarity": "0.20250943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ggxc",
            "score": -2,
            "text": "Never get a rescue dog",
            "title_similarity": "0.18745995",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hm8ht5x",
            "score": 9,
            "text": "Fuck that.\n Don't bring home a Pitbull.",
            "title_similarity": "0.21254304",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hm7zydu",
            "score": -10,
            "text": "Whatever you do, keep in mind: there's no such thing as an ethical breeder. Some are less reprehensible than others.",
            "title_similarity": "0.28031448",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hm89uff",
            "score": 14,
            "text": "The real LPT is never get a shelter dog for a child.",
            "title_similarity": "0.38813168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7gbtw",
            "score": 3,
            "text": "NGL I thought this was going to be a joke about also buying a dog for your child, and, while they're distracted by the new dog, you then present the other gifts to your significant other and get your kink on...\n\nHelp me.",
            "title_similarity": "0.8174486",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm83s3s",
            "score": 11,
            "text": "Better LPT: Don't buy a pet for a gift, are you goddamn insane?",
            "title_similarity": "0.3396364",
            "sentiment_compound": -0.0
        },
        {
            "id": "hm87fyv",
            "score": 21,
            "text": "I'm tired of people shaming others for buying instead of adopting.  Fuck the \"Adopt, don't shop\" crowd.",
            "title_similarity": "0.41228145",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hm7wggs",
            "score": 4,
            "text": "What shelter is open on Christmas day lol",
            "title_similarity": "0.5604576",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm81rtc",
            "score": 2,
            "text": "YES!  And same with cats.  AND, don't dismiss the adults! They might already be housetrained, and you can find out their personalities too, for a good match.",
            "title_similarity": "0.5657023",
            "sentiment_compound": 0.7856
        },
        {
            "id": "hm7fjbu",
            "score": 5,
            "text": "Also you know.. The whole putting a pet in a box a possible suffocating it",
            "title_similarity": "0.45788103",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7izky",
            "score": 1,
            "text": "Or you can do what my parents did which was this AND brought you to pick out a puppy, watch them put a deposit down and schedule a pick up time. And then say “joking!” On the day you were supposed to get the puppy.\n\nI was 19 and my brother was 21 at the time and I can’t believe we fell for it.",
            "title_similarity": "0.7634148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8aqlz",
            "score": 0,
            "text": "No kid out there is saying \"to the pound with you mongrel!\" There might be some shitty girlfriends that didn't get exactly what they wanted or some shitty boyfriends that are trying to lock their girl down by manipulation with a pseudo child in what otherwise would be a dieing relationship and those pets might get returned but no kid would do that. Don't ruin the magic of your kid seeing a cute little puppy under the tree with a freaking bow for a collar that he's trying to bite but can't reach and it's just so adorable and now he's trying to bite the Christmas tree ornament for fuck sakes. Don't ruin Christmas.",
            "title_similarity": "0.7260474",
            "sentiment_compound": 0.4627
        },
        {
            "id": "hm84o3i",
            "score": 3,
            "text": "If you see any lab mixes, ask what their mix is. If you see any that need a quiet environment or to be the sole pet in the house, ask why.",
            "title_similarity": "0.5924675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8a88d",
            "score": 3,
            "text": "This is so lame, what kid would be excited to receive a leash on Christmas morning",
            "title_similarity": "0.7068931",
            "sentiment_compound": -0.2996
        },
        {
            "id": "hm8e9ua",
            "score": 9,
            "text": "Pick out a dog at the shelter. lol right . Nice dream land OP lives in. All my local shelters are full of Pit Bulls and Chihuahua with behavioral problems. No one is taking a lovely Christmas jaunt down the shelter to get little Timmy a new BFF.",
            "title_similarity": "0.65681523",
            "sentiment_compound": 0.9029
        },
        {
            "id": "hm7m729",
            "score": 16,
            "text": "Terrible tip.  Here’s some presents you can’t use.",
            "title_similarity": "0.27481997",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hm7g8ul",
            "score": 28,
            "text": "These LPTs, if you can even call them that, have gotten ridiculous. Nothing more than karma farming",
            "title_similarity": "0.25482878",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hm7yx8s",
            "score": 3,
            "text": "Pretty sure many children would cry after seeing pet supplies and no pet. Why not a card to let it be known later shopping for pet supplies and a pet. Along with other gifts that they get to enjoy instantly.",
            "title_similarity": "0.67243326",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hm87jwk",
            "score": 1,
            "text": "Nah fuck this there’s too many shitty dog owners out there. Less dogs is a better time in this world.",
            "title_similarity": "0.38410157",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hm8d0no",
            "score": 4,
            "text": "Also, request to see the animals full file. Some instances of animals having previously bitten children are not openly documented. Some shelters prioritize rehoming the animal over full disclosure of the animals past behavior.",
            "title_similarity": "0.6006114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8gptx",
            "score": 3,
            "text": "You might get lucky with a dog from the shelter but I think that's bad advice too. All the sheltered dogs is sad and if you want your mission to be to adopt one then great; but, if you truly want a 10-15 year commitment for your family you should be doing research on the proper breed then finding a reputable breeder for it. Getting a pet from a shelter because it makes you feel better gives you a dog with possibly behavior issues, bad genes and unknown origin. AGAIN, if this is your goal are you are ok with the extra training and/or rehabilitation then great but buying a dog on a whim as a gift AND from a shelter is a terrible idea.",
            "title_similarity": "0.766189",
            "sentiment_compound": 0.9442
        },
        {
            "id": "hm86okg",
            "score": 0,
            "text": "you can also stretch this out for some time to make the children do your bidding, for example \"to win the reward dog you must wash yourself each day for the next 5 months without complaining\"",
            "title_similarity": "0.65844846",
            "sentiment_compound": 0.8439
        },
        {
            "id": "hm881ai",
            "score": -4,
            "text": "Wow this!!! If only more people thought like this.",
            "title_similarity": "0.07073409",
            "sentiment_compound": 0.8146
        },
        {
            "id": "hm8c9u5",
            "score": 0,
            "text": "Or just buy a dog and give it to them on Christmas",
            "title_similarity": "0.7610931",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8eebc",
            "score": 0,
            "text": "This may be more practically but there is truly nothing like the joy of a child receiving a puppy on Christmas morning. Worth it, 100%",
            "title_similarity": "0.65726995",
            "sentiment_compound": -0.1464
        },
        {
            "id": "hm8fxbn",
            "score": 0,
            "text": "Excellent advice.",
            "title_similarity": "-0.016765479",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hm8i4cn",
            "score": 0,
            "text": "This is such great advice. Don’t shop, adopt!",
            "title_similarity": "0.30389684",
            "sentiment_compound": 0.7263
        },
        {
            "id": "hm8iocp",
            "score": 0,
            "text": "This sounds like a great way to have a grumpy kid for a long time",
            "title_similarity": "0.39560464",
            "sentiment_compound": 0.765
        },
        {
            "id": "hm8m1xn",
            "score": 0,
            "text": "This is one of the dumbest posts",
            "title_similarity": "0.019502211",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hm8m6k9",
            "score": 0,
            "text": "That would be a huge let down for a child on Christmas to get dog accessories \nI understand it’s smart but for a child this would be so shit haha",
            "title_similarity": "0.6916665",
            "sentiment_compound": -0.1298
        },
        {
            "id": "hm8ndj3",
            "score": 0,
            "text": "Fuck that. We all know who's going to be feeding and cleaning up after the dog. The kids will be excited about anything, pick the dog that you think is best.",
            "title_similarity": "0.54866576",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hm8o6vv",
            "score": 0,
            "text": "This is so fucking stupid, you bored mfers, real, life",
            "title_similarity": "0.090885855",
            "sentiment_compound": -0.7457
        },
        {
            "id": "hmbmbw5",
            "score": 0,
            "text": "Better protip, put a replica dog skeleton in a box wrapped as a present under the tree too.",
            "title_similarity": "0.6555581",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmbtk0z",
            "score": 0,
            "text": "Here's a pack of batteries. We can pick your toy later when store is open. Isn't that exciting?!",
            "title_similarity": "0.5770142",
            "sentiment_compound": -0.4442
        },
        {
            "id": "hm816uv",
            "score": -5,
            "text": "Best advice ever!",
            "title_similarity": "0.11210418",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hm86sqr",
            "score": 5,
            "text": "I hope OP doesn’t have kids",
            "title_similarity": "0.27119347",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm7ggzn",
            "score": 26,
            "text": "Why does it matter as long as you're getting them from the shelter exactly?",
            "title_similarity": "0.35974962",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hm8buae",
            "score": 1,
            "text": "If your child wants a dog. Have it pick up dogshit off the street for a month before the decision is finalised. If they do it then they really want the dog and it will never be an issue. If they won't then they aren't likely to do it for their dog and it's just a toy in their mind, it would become the parents dog and their responsibility to do this.",
            "title_similarity": "0.7506623",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hm8c3rn",
            "score": -1,
            "text": "Or, buy the dog. Then when it turns 6 months old and is nice and fat and still tender, eat it. Dog is tasty",
            "title_similarity": "0.5807151",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hm8cx2f",
            "score": 1,
            "text": "Buy me a fork and a knife and we'll go pick out a steak together",
            "title_similarity": "0.3874762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8da8t",
            "score": -1,
            "text": "For my daughters 8th bday, she really wanted a lizard. We spent a month before her bday checking out books she could read from the library and watching fun videos about various lizards that make good pets.  So for her bday, I bought her the 40 gallon tank (they are really big!), heating lamps, cool stuff to make the cage fun, etc. \n\nShe opened it all up. No lizard. I explain to her that she will need to use her own money to buy the lizard. She looked so overwhelmed with all the stuff. \n\nShe came up to me a couple days later, crying. She told me she didn’t think she was responsible enough to care for the lizard. And she felt so bad!!\n\nBut I told her it was one of the most responsible things she could do— put aside her own desires for the benefit of another living thing. I took back all the stuff when she went back to school. \n\nAnd we went to build-a-bear for the first time. I’ve never been so happy to spend too much cash on a plush!!!",
            "title_similarity": "0.6268048",
            "sentiment_compound": 0.9671
        },
        {
            "id": "hm8evhh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12519442"
        },
        {
            "id": "hm8g8a7",
            "score": 1,
            "text": "I think someone going to a shelter instead of buying a puppy is way more likely to be responsible, an animal lover, and know what they're getting into.",
            "title_similarity": "0.68397593",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hm8geku",
            "score": -1,
            "text": "Is there really a difference between a dog Christmas morning and one a week later when “things have settled down”??",
            "title_similarity": "0.6308634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8mdd1",
            "score": 1,
            "text": "r/shittyprolifetips \nKids don’t want a bowl for Christmas \nDon’t let kids pick out a dog",
            "title_similarity": "0.6622254",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm8mxi6",
            "score": 1,
            "text": "Significantly better life pro tip (SBLPT), a pet should never be a gift.",
            "title_similarity": "0.40645236",
            "sentiment_compound": 0.1265
        },
        {
            "id": "hm8r9at",
            "score": 1,
            "text": "Please adopt and don't buy. Also research breed before. That pretty breed might take way more work than you'd expect. Also some rescues lie about dogs, if you see a pretty dog that has been around awhile he might need some(extensive) work past an amateur owner.",
            "title_similarity": "0.6773595",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hm7kw8s",
            "score": 7,
            "text": "How's the shelter market these days?  We wanted a dog last spring, but because covid, the shelters were out of acceptable dogs.  We need up getting one from a breeder, and had to travel 1500 miles to get it.",
            "title_similarity": "0.6301169",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hm7p8f0",
            "score": -8,
            "text": "Don’t buy a dog they’re trash pets 😒😂",
            "title_similarity": "0.35221565",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8inef",
            "score": 6,
            "text": "My parents did this and I was mauled by my kid approved shelter pick within 24 hours of bringing him home. This advice is dangerous. Most shelter pets are not for beginners or children.",
            "title_similarity": "0.67234194",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hm7jv6h",
            "score": 15,
            "text": "That’s what I got my wife last year.",
            "title_similarity": "0.3580544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7du8h",
            "score": 72,
            "text": "That sounds like a cruel joke",
            "title_similarity": "0.05699753",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hm7e9i3",
            "score": 80,
            "text": "That’s a shit idea.",
            "title_similarity": "-0.10948414",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hm81aw2",
            "score": 2,
            "text": "I like to give puppies to friends as gifts cause nothing shows your appreciation more than an animal they have to take care of.",
            "title_similarity": "0.6676228",
            "sentiment_compound": 0.7268
        },
        {
            "id": "hm847ns",
            "score": 2,
            "text": "How about dont do this at all? Its a responsibility and should not be represented as a present, period",
            "title_similarity": "0.09852113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8bjfl",
            "score": 2,
            "text": "Who gets rid of a dog because their kid didn’t like it? Also bringing a kid to an animal shelter ensures they are only going to want the puppy or whatever is cutest and not the dog that actually makes the most sense for the family. This is not good advice at all.",
            "title_similarity": "0.6621697",
            "sentiment_compound": 0.6362
        },
        {
            "id": "hm8demo",
            "score": 2,
            "text": "Or let people do what they want?",
            "title_similarity": "0.07392971",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm8g95c",
            "score": 2,
            "text": "I see you've never met a child.",
            "title_similarity": "0.08741852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8o1a9",
            "score": 2,
            "text": "Do you honestly think you just walk down to the shelter and pick out a dog anymore OP, or are you a time traveler from the 80’s unaccustomed to our way of life in the 21st century. It might work that way if you’re looking for a Pit Bull or some other large breed your insurance will hate you for if you adopt it, but generally speaking “rescuing” a dog is a massive ordeal that’s more involved than taking out a mortgage. \n\nThe same people who have made it that way are also the same ones trying to shame you into “adopt don’t shop”, not realizing their prohibitively restrictive standards for adoption are precisely what is driving many people to breeders and pet stores in the first place.",
            "title_similarity": "0.67716336",
            "sentiment_compound": -0.631
        },
        {
            "id": "hm7hglj",
            "score": 131,
            "text": "“Where’s the dog?”\n\n“Oh, we don’t have him yet!”\n\n*cue massive disappointment*\n\nGreat job now you’ve ruined Christmas.",
            "title_similarity": "0.55143356",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hm7lkzf",
            "score": 246,
            "text": "LPT: Instead of trying to buy a PS5 for your kids this Xmas, just buy them the games and tell them you'll go get the console when they are readily available. Bonus: This also allows you to skip the necessary updates on Christmas day.",
            "title_similarity": "0.7896998",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hm8bk5e",
            "score": 19,
            "text": "What in the fuck, that’s a terrible tip",
            "title_similarity": "-0.06352619",
            "sentiment_compound": -0.765
        },
        {
            "id": "hm7i87n",
            "score": 81,
            "text": "This is such a weird \"tip\". You do what's best for your individual family, and please let no one else pressure you or guilt you.",
            "title_similarity": "0.46036988",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hm7ixs8",
            "score": 3,
            "text": "Dogs adopted in the afternoon have a 47.3% better chance of not being returned to the shelter.",
            "title_similarity": "0.53773725",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hm85wz9",
            "score": 3,
            "text": "A leather choker? Thanks, daddy!",
            "title_similarity": "0.25575528",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hm87s95",
            "score": 2,
            "text": "We did something similar last year-got my oldest a hamster habitat. She did not get the actual hamster until she did research on how to take care of a hamster, made a spot in her room for the hamster, and kept up the level of responsibility she had been showing for our other pets. Like almost all the LPTs, it really depends on your family and personal dynamic.",
            "title_similarity": "0.7625741",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hm8bxuj",
            "score": 3,
            "text": "Better yet, skip the dog and get a cat.",
            "title_similarity": "0.3416888",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8caqw",
            "score": 2,
            "text": "Fuck this. Get the puppy",
            "title_similarity": "0.30820823",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hm7qvjv",
            "score": 46,
            "text": "Please don’t buy pets as gifts, high chance they will end up in the shelter after a month, especially if they are for children.",
            "title_similarity": "0.6434505",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm888ca",
            "score": 24,
            "text": "This is the dumbest fucking tip I've ever read. Surprise a kid on Christmas morning with a bunch of dog stuff...AND NO DOG??? Are you insane, have you ever met a child",
            "title_similarity": "0.67446387",
            "sentiment_compound": -0.8112
        },
        {
            "id": "hm87434",
            "score": 5,
            "text": "LPT: take child to shelter and swap for a pet. You've demonstrated you can look after something that can't take care of itself so you're entitled to an upgrade.",
            "title_similarity": "0.64895844",
            "sentiment_compound": -0.0643
        },
        {
            "id": "hm87szc",
            "score": 4,
            "text": "Sorry little Timmy I was sure this place was open today",
            "title_similarity": "0.26866606",
            "sentiment_compound": 0.25
        },
        {
            "id": "hm8koxm",
            "score": 5,
            "text": "All the closest shelters to me charge MINIMUM $700 adoption fee for any dog under 5 years old.\n\nPlus you have to provide proof that you've signed the dog up for insurance AND professional training prior to them releasing the dog to you.\n\nThen they wonder why someone goes and spends $500 on a Golden Retriever puppy instead.",
            "title_similarity": "0.6225591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7c9pb",
            "score": 243,
            "text": ">Your child can open these and get excited on Christmas morning. \n\nYes, children often get excited when they think they're getting a dog, and all they get is a collar and leash.",
            "title_similarity": "0.7524301",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hm845fj",
            "score": 14,
            "text": "This is a terrible, cruel idea. Don't do this.",
            "title_similarity": "-0.02344236",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hm8ldca",
            "score": 15,
            "text": "This is what my parent's did!\n\nI had been begging for a kitten since before I could talk and for Christmas when I was 8 they gave me a wrapped up box with cat supplies (including the litter box lol) and a card with a homemade voucher for one kitten.\n\nWe went to the shelter the next week and I found the world's cutest little orange tabby named Noël.\n\nThe only problem is that she was on a 48 hour  hold while the other people made up their minds if they wanted her or not.\n\n8 year old me was outraged at them, how could they be so cruel and heartless to that little angel??? Make up their minds?????? Pure evil.\n\nI asked when the hold came off and they said 5pm the next day. I turned to my mom and told her that we had to be back at the shelter the next day at 4:50pm. (Because what if the kitten thought she was abandoned?!?!?! Not on my watch lol)\n\nWe got there at like 4:30 and I waited with my heart in my throat while my poor mom tried to managed my expectations.\n\nThe second the clock ticked over to 5:00pm I went running for a shelter employee and dragged her back to the kitten.\n\nI told her those people's time was up and that they clearly didn't care about her like I did, and that she would be much better off with me where she would be loved.\n\nThe employee was like well, we usually give people a little more grace then the policy which is when I broke the crazy eyes out and said No! They left her behind! The rules say she's free to adopt NOW!\n\nThe employee was like shit alright damn, the cat's yours.\n\nI renamed her Buttercup but kept Noel as her middle name to \"honor her birth family\" \n\nLater we were told by the same shelter employee (when we came back to have Buttercup fixed when she was old enough) that the couple who had been interested in her came in about an hour after we left and were so sad she wasn't there (Wow guilt trip much lady?)\n\nAnd I told her \"Too bad so sad, they should have thought of that before they were late.\"\n\nMy mom was torn between laughing and being embarrassed but didn't try and scold me so I think she agreed 🤣",
            "title_similarity": "0.701427",
            "sentiment_compound": -0.6781
        },
        {
            "id": "hm7i9ze",
            "score": 48,
            "text": "If you are getting a pet for a child, the parents should be prepared anyway for what to expect. Go before Christmas to pick out a pet together at the shelter and have the basic necessities. Save the fancy pet bed and toys for Christmas morning. Never gift a pet to someone. People need to be prepared and actively participate in getting ready for a pet that works for their lifestyle. Pet parents do enjoy getting gifts for their pets though. My mom sends my cat a little treat basket every holiday, much appreciated.",
            "title_similarity": "0.8782188",
            "sentiment_compound": 0.9584
        },
        {
            "id": "hm81xn8",
            "score": 73,
            "text": "Or just avoid animals for Christmas. A pet is a responsibility, not a present.",
            "title_similarity": "0.5719399",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm8kwr9",
            "score": 5,
            "text": "Our shelter is full of pitbulls but thanks for the idea.",
            "title_similarity": "0.45908093",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hm7uhmn",
            "score": 38,
            "text": "I think the problem is not solved. Usually kids want a dog not knowing what caring for it actually entails and thus send it back. Waiting a few months won’t change that.",
            "title_similarity": "0.6679838",
            "sentiment_compound": -0.7043
        },
        {
            "id": "hm8cs9d",
            "score": 5,
            "text": "Shelters have been power tripping. I understand they want dogs to go to a good home, but its a little much. I was not able to look at a dog without making an appointment online. I also was only able to look at one dog at a time. They turned me down on a dog because they said it needed another dog. I ended up going thru a breeder for the first time and very happy.",
            "title_similarity": "0.6967244",
            "sentiment_compound": 0.822
        },
        {
            "id": "hm8b0ss",
            "score": 54,
            "text": "Holy fuck do you know how sad my son would be if I did this!?",
            "title_similarity": "0.31174713",
            "sentiment_compound": -0.784
        },
        {
            "id": "hm86cs6",
            "score": 11,
            "text": "Not a life pro tip",
            "title_similarity": "0.067292005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8bm3o",
            "score": 36,
            "text": "This is a terrible idea and helps land dogs back into the shelter system which is magnifying the issue not solving it. \n\nThe real solution, people face the music that dogs need training as an expected and budgeted expense and then actually do it. Most young dogs in shelters 6-18 months old, are there because of a lack of training or behavior issues brought on by careless or inappropriate husbandry. Dogs literally in there due to not being potty trained, because they're insecure messes due to socialization issues (Covid puppies are filling shelters now) and many other things that get MAGNIFIED in shelter environments. \n\nDogs and puppies are cute but there are extremely real consequences to owning one. Dogs that get dumped back into the shelter system have a much smaller chance of making it out alive and if they do their potential has been permanently damaged and there is a high likelihood of lingering echoes of past issues.\n\nLastly, most shelter staff do not know very much about the dogs that are up for adoption. I hate to break it to you but a lot of the times descriptions are a misrepresentation of the dog that you're adopting, as well as downplaying known issues. Every animal in a shelter or rescue is a product, and it is in the best interest of the organization to move them sooner rather than later. It's a very very mixed bag of what you'll get from a shelter dog and shelter/rescue organization. Some are great, some are shit.",
            "title_similarity": "0.6289396",
            "sentiment_compound": 0.5693
        },
        {
            "id": "hm7ivqu",
            "score": 15,
            "text": "But give them something they can play with on Christmas morning too. “Yay! We’re getting a dog…in a month…aight. Guess I’ll have breakfast now.”",
            "title_similarity": "0.7769113",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hm7ewtx",
            "score": 2823,
            "text": "Maybe I’m missing something but I’m failing to see how this will prevent gift animals from ending up back at the shelter. I don’t think the issue is the parents picking out an animal the kids don’t like, but rather people don’t realize that owning and taking care of a pet takes work and they get tired of it after a month. A pet is not a good gift idea, get a pet because you want a companion animal and are willing and ready to take care of it. And a child should never be held responsible for taking care of and training a dog, I know people get their kids a pet and say “you have to take care of it since you wanted it” and of course they don’t because they’re kids and they don’t know how to take care of themselves let alone an animal and then the animal suffers. Cats are easier pets but I still think it’s a bad gift idea.",
            "title_similarity": "0.6998387",
            "sentiment_compound": 0.9192
        },
        {
            "id": "hm7ygtr",
            "score": 44,
            "text": "don't get a pet for holiday/birthday",
            "title_similarity": "0.41816032",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8b7wi",
            "score": 57,
            "text": "Please just don’t ever “gift” pets.",
            "title_similarity": "0.18519422",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hm7yz61",
            "score": 2127,
            "text": "If your kids are young, do NOT let them pick the dog. They won't use useful criteria. They'll pick an aggressive monster with rabid diarrhea just because it looks like Marshall from Paw Patrol or something stupid",
            "title_similarity": "0.5561779",
            "sentiment_compound": -0.6002
        },
        {
            "id": "hm7euvd",
            "score": 418,
            "text": "I thought you were gonna say \"and when things have settled down, you can tell them you'll never buy them a dog anyway\" \n\nOr something savage like that",
            "title_similarity": "0.4820677",
            "sentiment_compound": -0.128
        },
        {
            "id": "hm7vthv",
            "score": 876,
            "text": "I’d also add DO NOT get a pet for your kid. Only get a pet if YOU want a pet. Kids may or may not lose interest, especially if you are not interested. But if your kid is not responsible enough to walk or feed or play with the pet consistently, you are responsible for the physical and emotional well-being of the animal not the kid.",
            "title_similarity": "0.6452944",
            "sentiment_compound": 0.6016
        },
        {
            "id": "hm7vya9",
            "score": 2411,
            "text": "After you take the leash out for a walk and fill the bowl with food every day for a month, we'll think about getting that dog.",
            "title_similarity": "0.6884829",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7sud3",
            "score": 4264,
            "text": "My parents got me a book of dog breeds to tell me we were getting a dog",
            "title_similarity": "0.660026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm7y6l6",
            "score": 2,
            "text": "Or just be like, \"siiiiiike!\"",
            "title_similarity": "0.007196769",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hm81qp4",
            "score": 1,
            "text": "This is also helpful as it’s hard to keep a dog wrapped in a box for few days before Christmas happens.  Also, I’d think the barking would be a dead giveaway of the present inside!  \n\n/s",
            "title_similarity": "0.81591797",
            "sentiment_compound": -0.4926
        },
        {
            "id": "hm82zb6",
            "score": 2,
            "text": "But what about all those sweet, sweet karma i can farm from the video of my kids crying when they see the dog pop out of the box? /s",
            "title_similarity": "0.5893043",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hm8329t",
            "score": 1,
            "text": "Wow thank you for this one.  News of this after Christmas always breaks my heart.",
            "title_similarity": "0.53471065",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hm86g04",
            "score": 7,
            "text": "Well 1. Make sure you can actually take care of a pet (kids and parents) and 2. Don't be a fucking tease on Christmas morning? Put yourself in the kids shoes... be an adult and know whether or not you can have a pet or not.",
            "title_similarity": "0.8047812",
            "sentiment_compound": 0.6133
        },
        {
            "id": "hm875cj",
            "score": 1,
            "text": "I was expecting you to do a full out gotcha moment and get the kid a stuffed animal.",
            "title_similarity": "0.5964942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm889pi",
            "score": 3,
            "text": "My girlfriend did this for me. It was a great decision. Gave us plenty of time to pick the right one for us.",
            "title_similarity": "0.352818",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hm889yk",
            "score": 3,
            "text": "another good thing: Your child will get to pick out the dog. \n\nSurprising a child with a pet is cool, but I often think that the kid might have liked to choose the dog.",
            "title_similarity": "0.68029034",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hm88hww",
            "score": 3,
            "text": "They are also full before the holidays. It seems pointless to wait like that. Go save a dog now.",
            "title_similarity": "0.68226695",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hm89cld",
            "score": 2,
            "text": "If you're getting your kids a pet, you should probably adopt one that you want and are prepared to deal with, not your kid's preference. No matter how responsible you think your kid is, chances are you'll still be doing most of the work to take care of the dog",
            "title_similarity": "0.67963374",
            "sentiment_compound": 0.8452
        },
        {
            "id": "hm8a7s6",
            "score": 1,
            "text": "Every winter this fact comes out",
            "title_similarity": "0.2290065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8a8vj",
            "score": 2,
            "text": "Who the hell wants to get their kids a used dog?  /s",
            "title_similarity": "0.54946136",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hm8adpv",
            "score": 3,
            "text": "This is so true! It upsets me so much people think animals of any kind are good presents! Full stop no! Perhaps only if it is for an adult and you know they genuinely full on want one. Even then though I would say otherwise.",
            "title_similarity": "0.52850544",
            "sentiment_compound": 0.798
        },
        {
            "id": "hm8bbqb",
            "score": 2,
            "text": "Thirteen years ago, my kids wanted a dog.  We got a shelter dog.  As the dad, I knew that I had taken on another life form that I was totally responsible for.  Oh, the kids walked her, and made sure she was fed-most of the time....but YOU are getting a dog.  No regrets, our dopey dactshound is everyone's favorite member of the family and last one out of the lifeboat.  I cannot imagine the thought processes in sending one back, nor the damage it would do to the child...it's a life bond.",
            "title_similarity": "0.7098025",
            "sentiment_compound": 0.8917
        },
        {
            "id": "hm8bcyd",
            "score": 3,
            "text": "Pets should not be gifts. If the kid gets the animal on Christmas, or finds out on Christmas that they are getting an animal, that animal will be seen as a gift.",
            "title_similarity": "0.71374494",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8bov2",
            "score": 2,
            "text": "LPT: Don't give live animals as gifts.",
            "title_similarity": "0.23568201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8br8n",
            "score": 1,
            "text": "We were only supposed to go look at the puppies. They were all called for, my parents said. I was in tears when they told me I could pick one of two. Best christmas present ever, I picked the one that liked to play with my hair. Teaching a puppy to open christmas presents is the best thing ever and she still loves it, and playing with hair. Puppies are a classic christmas present, with a lot of problems.\n\nPeople get impulsive during the holidays and buy things without thinking. And when you think of dogs as *things* it's relatively easy to buy one and throw it away. But you have to really want a dog before you get it. It's not a thing. It's a living creature that is dependent on you for survival, much like the child that you bought it for. If you havent been thinking about getting a dog and talking about getting a dog for the last few months, don't get one.",
            "title_similarity": "0.8313847",
            "sentiment_compound": 0.9342
        },
        {
            "id": "hm8bvqe",
            "score": 1,
            "text": "But I already wrapped the puppy",
            "title_similarity": "0.45971864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ca9v",
            "score": 1,
            "text": "No dogs in shelters here.",
            "title_similarity": "0.108787686",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm8cowb",
            "score": 28,
            "text": "Don't ever buy someone a pet as a present",
            "title_similarity": "0.3287073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8ct9q",
            "score": 2,
            "text": "I'll fix this for ya!  \n\n\nLPT: Instead of having to deal with the puppy and picking it out without your loved one, get the accessories first and pictures of puppies. Then you can go pick it out together over the next month and have a fun time.   \n\n\nAltruism Pro Tip:  \nIf you want to do some altruism donate $50 to a shelter while you're at it to help with their overload if you want to support their cause but **don't** get a shelter dog.",
            "title_similarity": "0.7905952",
            "sentiment_compound": 0.3857
        },
        {
            "id": "hm8dofh",
            "score": 1,
            "text": "Shelter? Yuck. Who wants a *used* pet?\n\n^^^^^/s",
            "title_similarity": "0.4677094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8es7m",
            "score": 3,
            "text": "Also, winter is the absolute worst season to train a new dog.\n\nSource: own dogs. Its cold outside. Neither party wants to be out there",
            "title_similarity": "0.5015724",
            "sentiment_compound": -0.7475
        },
        {
            "id": "hm8fwp4",
            "score": 1,
            "text": "My dog was a rejected Christmas present. I got him at 5 months old and it was perfect because I skipped all of the awful, needy early potty training stuff, which I couldn't do with my job anyway.",
            "title_similarity": "0.6848988",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hm8g4az",
            "score": 2,
            "text": "You’re a real joy at Christmas aren’t you? Also STOP BUYING PETS AS GIFTS.",
            "title_similarity": "0.7430011",
            "sentiment_compound": 0.2185
        },
        {
            "id": "hm8ghd8",
            "score": 1,
            "text": "If you do this, be very clear and early that they are getting a dog, and that you want their help picking it out.\n\nWhen I was 8 I told my parents how much I wanted a hamster, they wrapped up a cage, toys and food. I tore those open and got super excited. Then they deadpan told me that they \"forgot the hamster\". Cue the waterworks and me running off to my room for 30m until I finally calmed down enough to understand they were joking and they hadn't forgotten it.",
            "title_similarity": "0.7150824",
            "sentiment_compound": 0.9465
        },
        {
            "id": "hm8gl28",
            "score": 1,
            "text": "I was sure this was going to end in not getting them the dog at the end",
            "title_similarity": "0.3346452",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hm8gtpu",
            "score": 1,
            "text": "After 10 years asking for a dog, my parents got me a book about taking care of a dog for Christmas and then didn’t get me a dog. 20 years later I still can’t get a straight explanation out of them as to what they were thinking.",
            "title_similarity": "0.68684953",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hm8h1p1",
            "score": 3,
            "text": "We did just this very thing.\n\nBut it [was cat on her birthday](https://youtu.be/ChxVh723O0o)\n\n[To the shelter](https://youtu.be/Jro2Vqd0-eg)",
            "title_similarity": "0.58221126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8h2y0",
            "score": 2,
            "text": "This isn't just for kids! My partner once bought a hamster water bottle as a symbol of 'we are getting a pet'. In the moment he could tell I wasn't excited, though awkward It actually gave me the opportunity to say I wasn't ready and didn't want this responsibility yet. Years later we talked about it and chose the right one for us.",
            "title_similarity": "0.6938304",
            "sentiment_compound": -0.1068
        },
        {
            "id": "hm8hp45",
            "score": 1,
            "text": "If you are going to give a dog to your family as a family gift, be prepared to be the one walking, feeding, and cleaning up after it.   If you aren't willing to do that for the dog, then your family isn't ready for it. For children and first time dog owners, make sure to include a dog care book and/or breed specific book, make sure to sit down and read it with them and talk about it.  \n\nThat being said,  gifting an experienced dog owner who had lost an old and beloved dog months prior a puppy might be the greatest gift ever. But, make sure to talk to a few of their friends and family members to see if they think they are ready for it emotionally, financially, and/or physically able to keep up with a puppy, because it would be downright awful to put a puppy in their arms and have them tearfully give it back.",
            "title_similarity": "0.7886024",
            "sentiment_compound": 0.9397
        },
        {
            "id": "hm8i01t",
            "score": 1,
            "text": "So get a dog bowl, then?",
            "title_similarity": "0.3713016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8i2n4",
            "score": 5,
            "text": "Pro tip: Only buy that pet if you're okay with the sole responsibility of taking care of it. Don't assume your kids will. If you can't be okay with that, you shouldn't have a dog.",
            "title_similarity": "0.6297374",
            "sentiment_compound": 0.5321
        },
        {
            "id": "hm8if8z",
            "score": 1,
            "text": "I think using a child to pick a dog is not the best way to do this. Pick the one that needs love but is not guaranteed to get it.",
            "title_similarity": "0.50917095",
            "sentiment_compound": 0.1068
        },
        {
            "id": "hm8ipu3",
            "score": 3,
            "text": "Adoption isn't right for many people esp novice pet owners, and adopting doesn't solve the overbreeding problem which is mostly pitbulls",
            "title_similarity": "0.5011133",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hm8iw61",
            "score": 2,
            "text": "This is kind of stupid. Especially if you are going to a shelter and don't know what size or type of dog you're getting.  \n\nI guess you could keep the receipts.",
            "title_similarity": "0.61922884",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hm8ixhs",
            "score": 2,
            "text": "Just make sure your SO doesn't misinterpret the leash and collar thing.",
            "title_similarity": "0.35913116",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hm8iysp",
            "score": 1,
            "text": "I remember my 10th birthday my parents had their friends over as well as mine. All of my gifts were cat related. I got cat litter, cat food, cat treats, cat toys. I was so sad and too stupid to realize. I kept saying I didn't have a cat and what was mildly annoying at first become very frustrating. Then at the end of the night my parents surprised me with my first kitten. Still feel pretty dumb to this day.",
            "title_similarity": "0.70004684",
            "sentiment_compound": -0.8066
        },
        {
            "id": "hm8j7u5",
            "score": 1,
            "text": "Yeah, friend of mine bought a puppy for his kids for christmas. Poor thing suffocated to death in the box and the kids got a dead puppy for christmas.",
            "title_similarity": "0.6989821",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hm8j87q",
            "score": 1,
            "text": "My parents did this except had dogs picked out for us to pick up later that day. Turns out I had no idea my sibling had been bugging them  for months to get a dog. I had a full on meltdown because Santa thought I was a dog.",
            "title_similarity": "0.7350571",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm8jy0c",
            "score": 1,
            "text": "We decided to get a dog last summer. Started researching rescues and deciding what breed we wanted. We decided then to surprise our kids at Christmas. We found a puppy that would be ready in November so our kids got surprised then instead.",
            "title_similarity": "0.8423717",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hm8kbmv",
            "score": 1,
            "text": "But then I can't post a cute, festive video to the 'gram... and that's half the reason I was going to buy them one in the first place!",
            "title_similarity": "0.49456024",
            "sentiment_compound": 0.2668
        },
        {
            "id": "hm8l4l6",
            "score": 1,
            "text": "This dog collar is for you, Tommy! Merry Christmas!\n\n\nPut it on, see how it feels!",
            "title_similarity": "0.6854463",
            "sentiment_compound": 0.6571
        },
        {
            "id": "hm8lt7o",
            "score": 1,
            "text": "This is such a great idea",
            "title_similarity": "-0.042723466",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hm8lvvx",
            "score": 2,
            "text": "Better life pro tip: go the week or month after Christmas because a lot of dogs gifted on Christmas eventually end up there",
            "title_similarity": "0.7751658",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8m897",
            "score": 1,
            "text": "I get the feeling you don't have kids.\n\nIf you're gonna buy em a dog, go choose and buy them a dog. Don't fuck with em. The dog is your responsibility as the adult.",
            "title_similarity": "0.5869783",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hm8mgl5",
            "score": 1,
            "text": "To hell with that. Get a fish bowl and some gravel. Better yet, get a snake. Eats once a week, fun to handle, and if it escapes, at least you won't have mice!",
            "title_similarity": "0.56338906",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hm8msb5",
            "score": 1,
            "text": "It's also a good opportunity to start learning about dogs and get used to the idea of having responsibility over a living thing before you actually adopt it",
            "title_similarity": "0.5864866",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hm8n0v5",
            "score": 1,
            "text": "Sounds good on paper, very impractical in practice. Espicially since then after you get the dog, those things you bought like the leash, harness, might be useless. And then letting the kid pick the dog? You have to pick one that works with the family lifestyle. Meaning dont get a golden doodle when nobody is home for hours.",
            "title_similarity": "0.77967745",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hm8n4at",
            "score": 1,
            "text": "It also could be a good idea to get some pictures printed out of doggos in local shelters or a listing of events you can attend to see some dogs.",
            "title_similarity": "0.5868405",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm8namr",
            "score": 1,
            "text": "I did that for my nephew and it was hilarious. His parents thought it was such a good gift I don't have to buy anything else again.",
            "title_similarity": "0.5433534",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hm8ngu6",
            "score": 1,
            "text": "I can't up this enough!!!!!!!!!!\n\nEdit: don't forget the pee pads.",
            "title_similarity": "0.2928545",
            "sentiment_compound": 0.428
        },
        {
            "id": "hm8ns10",
            "score": 1,
            "text": "That is an incredible thought! A Great Life Pro Tip",
            "title_similarity": "0.119946495",
            "sentiment_compound": 0.6864
        },
        {
            "id": "hm8o7up",
            "score": 1,
            "text": "Be careful. If you get someone a collar and leash this Christmas you might be sending them the wrong signals.",
            "title_similarity": "0.67698914",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hm8olqf",
            "score": 3,
            "text": "OP doesn’t have kids.",
            "title_similarity": "0.016759928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8om3j",
            "score": 6,
            "text": "I would be disappointed. Still. And I am an old.",
            "title_similarity": "0.068682104",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hm8pi33",
            "score": 1,
            "text": "100% approve. It's like giving your girlfriend or wife a gift card for somewhere like Victorias Secret instead of buying them random lingerie; what dog or cat is appropriate is as much a very personal choice.",
            "title_similarity": "0.64959806",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hm8pq2g",
            "score": 1,
            "text": "Just buy the accessories and tell them to use their imagination.",
            "title_similarity": "0.33035246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8pyk2",
            "score": 1,
            "text": "BTW, harnesses are way better than collars when it comes to walking. Can’t recommend them enough.",
            "title_similarity": "0.3518982",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hm8qnfj",
            "score": 1,
            "text": "OUTSTANDING idea, TWO thumbs up!!!",
            "title_similarity": "0.027575448",
            "sentiment_compound": 0.7656
        },
        {
            "id": "hm8qy3b",
            "score": 1,
            "text": "When I was 5 and my parents wanted to get me a kitten for Christmas,  I got accessories for the cat and a note from Santa saying it was too cold for a kitten to ride in the sleigh so he had given my parents money to buy me one.\n\nWe went after New Years. It was a great way to handle it and I still remember that note from Santa.",
            "title_similarity": "0.8004001",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hm8rjtl",
            "score": 1,
            "text": "This is a pre covid tip.  I've been trying to adopt a dog for 6 months but the shelters have a ten page waiting list of people wanting dogs.",
            "title_similarity": "0.63032824",
            "sentiment_compound": 0.09
        },
        {
            "id": "hm8rrgq",
            "score": 1,
            "text": "\"Kinky! Thanks mum!\"",
            "title_similarity": "0.18347785",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hm8s4dv",
            "score": 1,
            "text": "That sounds awful for the kid, id hate that. get the pet and let the kid pick the accessories. A kid isn't gonna know what pet to get",
            "title_similarity": "0.4968938",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hm8savg",
            "score": 1,
            "text": "If I got a leash, bowl and collar, it may be confused for… something else",
            "title_similarity": "0.42721853",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hm8sd4u",
            "score": 1,
            "text": "Because you know the look on a child’s face Christmas morning when they get a collar is totally the same as when they get a puppy…",
            "title_similarity": "0.67716265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8sg4v",
            "score": 1,
            "text": "You probably don't want to buy things like a leash, collar, or bowl until you get the dog.  Different dogs will need different sized leashes, collars, and bowls.",
            "title_similarity": "0.58983165",
            "sentiment_compound": 0.3134
        },
        {
            "id": "hm8slhu",
            "score": 1,
            "text": "Ok. That’s just as magical, and the pictures on Xmas morning will be just as special",
            "title_similarity": "0.43141824",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm8sn4f",
            "score": 1,
            "text": "What an excellent idea!",
            "title_similarity": "-0.043019965",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hm8td3j",
            "score": 1,
            "text": "My parents did this for my 6th birthday and I’ll never forget it :,). Picked up my girl Socks, had her for 12 years.",
            "title_similarity": "0.57167804",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hm8tdvw",
            "score": 1,
            "text": "My best friend adopted a dog that had been left at the shelter by his last humans and he’s such a good boy.",
            "title_similarity": "0.5766353",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hm8tdyo",
            "score": 1,
            "text": "People raise kids like puppies in the city.",
            "title_similarity": "0.6015167",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm8tm7o",
            "score": 1,
            "text": "Don't just get any dog try to find a breed that's fits your lifestyle, training and owning experience.",
            "title_similarity": "0.45584452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8tnl9",
            "score": 1,
            "text": "When I was a young girl my gift was a saddle blanket. In January I got my horse. It was the best Christmas ever.",
            "title_similarity": "0.6390314",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hm8tthe",
            "score": 1,
            "text": "That's a terrible idea for a different reason. Imagine being the kids that open up dog accessories only to be told \"and we're going to go get a dog! ...some other time.\"\n\nHow about pets aren't gifts at all.",
            "title_similarity": "0.64010537",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hm8ubtk",
            "score": 1,
            "text": "My SO and I did this for each other a few years ago 100% intending to adopt a puppy that had been a Christmas present that was too much work. We got denied for several of these doggies all the way up to February. This was fine because we ended up adopting Annie who was in an unexpected litter born Dec 23rd... The day before Christmas Eve\n\nWe got our Christmas puppy",
            "title_similarity": "0.8217455",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hm8uhto",
            "score": 3,
            "text": "While I share the sentiment of adopting in jan, don’t buy your kids accessories for a pet they don’t have…that’s just weird",
            "title_similarity": "0.60799193",
            "sentiment_compound": 0.128
        },
        {
            "id": "hm8upa4",
            "score": 1,
            "text": "Also, this might be an unpopular opinion, but seriously considering not adopting from a shelter, especially for your first dog. You don’t know what your are getting. I’ve adopted and gotten lucky. I’ve also adopted and got very unlucky. If you have the resources, buying from a reputable breeder can be a much less risky option for you and your kids. Good breeders will breed for health and temperament so you know what you are getting into.",
            "title_similarity": "0.73832566",
            "sentiment_compound": 0.6946
        },
        {
            "id": "hm8vi8j",
            "score": 1,
            "text": "Thanks for an actual pro tip that is not something super specific that happened once to someone.",
            "title_similarity": "0.25350958",
            "sentiment_compound": -0.0634
        },
        {
            "id": "hm8vj9z",
            "score": 1,
            "text": "Depending on their age, you can also buy a life-size-ish toy dog for them to use the new accessories with while they wait, and practice being a dog owner.",
            "title_similarity": "0.7245232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8vk12",
            "score": 1,
            "text": "OP has not been to a typical shelter in probably a decade or longer.\n\nShelters in most large or mid-sized cities are fucking filled with **pitbulls and mixed pitbull dogs.** I went to a shelter about 3 years ago and out of about 45 mid to large sized dogs, *three* were not pitbulls. \n\nAlso, OP obviously hasn't had children or apparently remembers being one - kids have very definite ideas of what they want and parents who don't want to disappoint their children that they usually feel they don't spend enough time with to begin with will do everything to make that happen.",
            "title_similarity": "0.6097356",
            "sentiment_compound": 0.576
        },
        {
            "id": "hm8vsma",
            "score": 1,
            "text": "Kid picks the coyote in the corner. Always interesting when you let the kid choose.",
            "title_similarity": "0.5834052",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hm8vu4i",
            "score": 1,
            "text": "Umm do you have kids? What a terrible idea. \"Hey here's all the stuff you need for a dog that I'll get you soon.\" Sounds reasonable to an adult but imagine being a kid....",
            "title_similarity": "0.6987945",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hm8vz7c",
            "score": 1,
            "text": "So fucking liberal lol. Oh adopt adopt adopt! Ffs some people can get a puppy it’s not the end of the god damn world lol you think everyone’s gonna go to the shelter and rescue a dog, you have no idea how people will cheer that idea on and then go get a puppy it happens ALL, THE TIME.",
            "title_similarity": "0.74227595",
            "sentiment_compound": 0.8602
        },
        {
            "id": "hm8w7ii",
            "score": 1,
            "text": "Dogs and dog accessories",
            "title_similarity": "0.17880872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8wkxf",
            "score": 1,
            "text": "Or instead of shaming people who wanna get their own dog from a breeder, ya’ll adoption nazis can mind your own business and go shame the people who actually abandoned their pets.",
            "title_similarity": "0.5753654",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hm8wrlg",
            "score": 1,
            "text": "I adopted both my dogs under the age of 3. One was abandoned twice by the time I got to him. The other was abandoned at least once. If you're not willing to commit to a pet's entire life then don't even consider getting one. I'm sick of hearing about these \"owners\" who probably can't even wipe their own ass properly. Pets should never be a gift. They should be a well thought out idea that you make a reality once you understand what you're getting into.",
            "title_similarity": "0.63283634",
            "sentiment_compound": -0.9324
        },
        {
            "id": "hm8x7ph",
            "score": 1,
            "text": "also: a lot of shelters have free or discounted adoptions when they have more animals coming in than usual",
            "title_similarity": "0.5769454",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hm8x8kk",
            "score": 1,
            "text": "Lol these are always the worst  and out of touch tips",
            "title_similarity": "0.08636639",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hm8y452",
            "score": 1,
            "text": "LPT:\nYou don’t “gift” an animal.",
            "title_similarity": "0.09479821",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8z68d",
            "score": 1,
            "text": "this was how i finally got adopted. i only pee'd in the corner twice.",
            "title_similarity": "0.41113585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8zi16",
            "score": 1,
            "text": "I once gave an ex-girlfriend a can of dog food as a birthday present. She almost killed me before she discovered the puppy that came with it. Perhaps I should have led with a collar and leash.",
            "title_similarity": "0.6945285",
            "sentiment_compound": -0.6378
        },
        {
            "id": "hm8zqix",
            "score": 1,
            "text": "I can’t wait until I can get a dog. I’m so going to be that person that brings them EVERYWHERE.",
            "title_similarity": "0.4370826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm8zu1k",
            "score": 1,
            "text": "Like 25 years ago Santa got me a puppy. But my mom's best friend was allergic to animals. So after having it for like a week my parents made me give it to the pound... yeah.",
            "title_similarity": "0.7057829",
            "sentiment_compound": 0.9442
        },
        {
            "id": "hm90cy1",
            "score": 1,
            "text": "Generally don't buy pets as presents or surprise anyone with a pet (or stuff that implies a pet). Having a pet is a big decision. It is expensive and a lot of work and is a decision for the next decade or more. It must be openly discussed and decided by the whole family with everyone having a realistic picture of what it is like",
            "title_similarity": "0.64280593",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hm90hyb",
            "score": 1,
            "text": "Merry Christmas, son. Here's a PlayStation control pad. Now let's wait for January for a cheap console to come up on eBay.",
            "title_similarity": "0.65327144",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hm90v1q",
            "score": 1,
            "text": "My mom basically became the goto person to pawn unwanted animals off on because she was pretty good at finding them a good home. Despite my dad constantly telling my mom no more pets, that's pretty much how we got most of our pets growing up. \n\nThe most ridiculous example I can think of being when one of my mom's coworkers spent I think something like $900 on a ragdoll cat, then immediately coming to my mom complaining how much hair she shed. So that's how we ended up with Sophie, who I like to give little haircuts to whenever I'm over at my parents house.",
            "title_similarity": "0.7174566",
            "sentiment_compound": 0.8878
        },
        {
            "id": "hm90w2p",
            "score": 2,
            "text": "Honestly, walking down the stairs when I was 5 years old and seeing a dog sitting there was something I'll never forget. So yeah, go ahead and make whatever decision you want.",
            "title_similarity": "0.5668434",
            "sentiment_compound": 0.7803
        },
        {
            "id": "hm91x4c",
            "score": 3,
            "text": "Don't buy pets as presents",
            "title_similarity": "0.31930476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm92535",
            "score": 2,
            "text": "But if you adopt it before Christmas and keep you are still part of the solution. We have my dad a cat for Christmas and that cat is the most loved thing in my dads house",
            "title_similarity": "0.64050424",
            "sentiment_compound": 0.8954
        },
        {
            "id": "hm92vty",
            "score": 1,
            "text": "Why would you get a dog from the shelter? If I'm getting a dog, I'm getting it for 10-15 years, and I want the perfect dog, with gene tests and reputable parents.",
            "title_similarity": "0.6860471",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hm93dcq",
            "score": 1,
            "text": "I breed reptiles and lemme tell ya, so many parents wanna buy from me around this time of year. I explain to them ad nauseum that this is going to become your pet very very soon. Ball pythons, geckos etc are boring as shit and your 9 year old will get bored. They never listen, and just a few months later I'm having to explain to explain to them why I'm not interested in buying the animal back, even tho I could \"just resell it'. I'm gonna stop selling over the holidays lol.",
            "title_similarity": "0.693906",
            "sentiment_compound": -0.7234
        },
        {
            "id": "hm93h98",
            "score": 1,
            "text": "hmm if my parents did this idk if i would be confused or not. depends on the age",
            "title_similarity": "0.38329285",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hm93n5n",
            "score": 1,
            "text": "Also instead of neck leash please consider harness instead",
            "title_similarity": "0.28227633",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hm93smj",
            "score": 1,
            "text": "This is such a shitty tip.",
            "title_similarity": "-0.019430738",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hm94cx5",
            "score": 1,
            "text": "Just don't gift animals. Getting a pet is a decision a household can make together if they feel up to the task. It's not something you should gift to an individual person, let alone a kid.",
            "title_similarity": "0.51703525",
            "sentiment_compound": -0.1295
        },
        {
            "id": "hm94f7e",
            "score": 1,
            "text": "80% of the way through that title I was 90% sure this was a SLPT.",
            "title_similarity": "0.16557537",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hm94jcb",
            "score": 1,
            "text": "This assumes you want a shelter dog rather than one where you can carefully control the animals genes to avoid medical issues, training to avoid behavior issues, age to if you want a puppy or an older animal, and history to avoid things like abuse and injury.\n\nAlso I don’t think this would reduce the issue you want fixed. These are likely families not able to care for the animal correctly rather than families who didn’t like the exact animal they got.",
            "title_similarity": "0.5925591",
            "sentiment_compound": -0.8329
        },
        {
            "id": "hm94m91",
            "score": 1,
            "text": "Here is some batteries. Go pick the toy out that it may fit.",
            "title_similarity": "0.38731813",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm957ud",
            "score": 1,
            "text": "I read, \"Instead of buying a dog a Christmas present\" and wondered why the hell I'd let my child open it when my dog loves ripping the paper off things.",
            "title_similarity": "0.73242515",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hm95hk5",
            "score": 1,
            "text": "There are no shelters open on Christmas",
            "title_similarity": "0.27287456",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm95t9e",
            "score": 1,
            "text": "Buy a dog? Why? Why not adopt one?",
            "title_similarity": "0.47619617",
            "sentiment_compound": -0.2635
        },
        {
            "id": "hm965c5",
            "score": 1,
            "text": "I'm not getting a kids hopes up like that.  Kids care very much about what their pets look like and I'm sorry for the abandoned pets in the shelter but I care more for my kid.  Maybe when they are mature enough to actually care for another creature, we can start at the shelter.  \n\nPeople that buy pets as presents should be shot.  Far to many shelters end up with the unwanted presents.  Many reputed breeders I've heard of won't sell between Nov and Feb and make sure to not have litters near then.",
            "title_similarity": "0.78573406",
            "sentiment_compound": 0.9535
        },
        {
            "id": "hm96o0y",
            "score": 1,
            "text": "But then how would I give my child and mostly myself instant gratification? Plus a leash and bowl won’t get any views on social media from other degenerate parents.",
            "title_similarity": "0.5703472",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hm97a8q",
            "score": 1,
            "text": "I unwrapped a hamster care guide book one Christmas. I was really upset that my parents would get me a book like that when they wouldn’t even let me have a pet and cried until they explained that I was allowed to pick a hamster a few days later. Then it was the best Christmas ever. \n\nThis is a good idea, but maybe add a note or something that the kid will see right away that the dog will be coming soon if you’ve been very explicit before that your kid cannot have one so they don’t think you’re just rubbing it in their face.",
            "title_similarity": "0.8088",
            "sentiment_compound": 0.5652
        },
        {
            "id": "hm982oa",
            "score": 1,
            "text": "This can’t be done anymore. The bureaucratic bullshit it takes to adopt from a shelter is out of control. I wanted to go visit so I checked the website of my local county shelter for info. I had to fill out a 10 page form to be considered for eligibility to adopt. I would have to agree to a home visit from an agent of the shelter. The whole process was too much. I adopted my little illegal smol grrl right off the street instead. I still wonder what could have been and where that shelter soul that I would have been paired with ended up.",
            "title_similarity": "0.6576462",
            "sentiment_compound": -0.4951
        },
        {
            "id": "hm98bep",
            "score": 1,
            "text": "Maybe don't buy pets as a chrismtas present. Just maybe.",
            "title_similarity": "0.53401583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm98c31",
            "score": 1,
            "text": "Unfortunately the people that make thoughtless decisions like that would either never read this post or ignore it completely.",
            "title_similarity": "0.3068666",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hm98ks9",
            "score": 1,
            "text": "Best one I’ve seen on this sub so far",
            "title_similarity": "0.11224636",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm98q9f",
            "score": 1,
            "text": "My tired and flu impaired brain didn't expect the last sentence to end like that \n\n> Then, when things have settled down, you can take your child to the shelter ~~to pick out a pet together~~ and get s dog instead.",
            "title_similarity": "0.7601473",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hm98vk5",
            "score": 1,
            "text": "Hhaha that is genius!",
            "title_similarity": "-0.09209709",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm994l5",
            "score": 1,
            "text": "Wow mom, thanks for the leash. Who gets excited over a leash??\n\nGet your kid some toys for Christmas. The pet can be an addition done on Boxing Day. \n\nShaking my head. A leash and a bowl. No.",
            "title_similarity": "0.8957307",
            "sentiment_compound": 0.8299
        },
        {
            "id": "hm99etn",
            "score": 1,
            "text": "Never buy a pet for your children regardless what holiday it is. Easter? Don't buy a fucking rabbit. Birthday? Don't buy a hamster. Anything else? Just don't. They need to make this decision and they need to become attached before the animal comes in the house otherwise it will wind up neglected in some fashion. Happens way too often. They're not toys, they're living creatures.",
            "title_similarity": "0.66881657",
            "sentiment_compound": -0.3049
        },
        {
            "id": "hm9a266",
            "score": 1,
            "text": "Ya fk you,  don't tell me how to Xmas.",
            "title_similarity": "0.31296295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9a5by",
            "score": 1,
            "text": "If you don't want to adopt, make sure you are ready to take the dog. Don't be part of the problem",
            "title_similarity": "0.5106649",
            "sentiment_compound": 0.0926
        },
        {
            "id": "hm9ai2q",
            "score": 1,
            "text": "Lpt : don't buy a dog as a present at all. They are not presents and need care, it's not a toy",
            "title_similarity": "0.29265252",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hm9aikq",
            "score": 1,
            "text": "This is brilliant, thank you",
            "title_similarity": "-0.042262834",
            "sentiment_compound": 0.743
        },
        {
            "id": "hm9aka4",
            "score": 2,
            "text": "Who are you to tell people where their next pet should come from or when and how they should acquire their next companion.   Amazing how so many stigmatize reputable breeders and pure bred dogs.   Generations of work and care have gone into these dogs and if someone decides they prefer to not have all the problems that come with adopting a pet from the shelter, they should do just that and not have people like you telling them  what, when and where!",
            "title_similarity": "0.69491386",
            "sentiment_compound": 0.5396
        },
        {
            "id": "hm9apgh",
            "score": 1,
            "text": "This is the best tip I've seen in a long time",
            "title_similarity": "0.15747538",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hm9ba4u",
            "score": 1,
            "text": "LPT: don't buy pets as a Christmas present.",
            "title_similarity": "0.4756276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9bdzr",
            "score": 1,
            "text": "LPT:not this one.",
            "title_similarity": "-0.13428383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9bfxc",
            "score": 1,
            "text": "animals as presents usually don't end well. I've seen shelters and pet stores refuse to sell or put rabbits up for adoption around Easter cause they are statistically more likely to get abandoned or neglected",
            "title_similarity": "0.66368127",
            "sentiment_compound": -0.856
        },
        {
            "id": "hm9bqvu",
            "score": 1,
            "text": "A pet is a present that comes with years of responsibility (think a decade or two for a dog or a cat) of life-changing time-investment. \n\nDo you want to give a “present” that limits the kids options for a decade?\n\nPlease only do this if you stand at the ready to take on the responsibility and care for the entire lifetime of this animal.",
            "title_similarity": "0.6651777",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hm9c8qv",
            "score": 1,
            "text": "Please do not gift pets to your kids. Ever. Thank you.",
            "title_similarity": "0.41507995",
            "sentiment_compound": 0.3387
        },
        {
            "id": "hm9co9k",
            "score": 1,
            "text": "I take it you don't have kids. Hilarious.",
            "title_similarity": "0.16680443",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hm9d60a",
            "score": 1,
            "text": "As someone who doesn’t have children, how much do you expect them to “calm down” when they know they are imminently getting a dog? I feel like the all-consuming question would be “can we go to the shelter now?”",
            "title_similarity": "0.63284296",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hm9d8xp",
            "score": 1,
            "text": "Okay that went in a more wholesome direction than it first looked like. I've heard of child leashes but that would have been a bit much.",
            "title_similarity": "0.45895872",
            "sentiment_compound": 0.296
        },
        {
            "id": "hm9d9mx",
            "score": 1,
            "text": "its a shit idea to delay the dog so the kid just gets accessories and no dog, and its an **even shitter** idea to have given the kid the expectation that they are getting a dog for christmas in the first place.",
            "title_similarity": "0.74264497",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hm9dezl",
            "score": 1,
            "text": "Those cries and screams of joy will turn to agony when the family realised getting a cute little puppy is like taking care another child both mentally and monetary.",
            "title_similarity": "0.6444435",
            "sentiment_compound": 0.6743
        },
        {
            "id": "hm9drkp",
            "score": 1,
            "text": "Or better.. Stop normalising giving puppies as presents",
            "title_similarity": "0.5323729",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hm9dvw7",
            "score": 1,
            "text": "A dog is for life not just for dinner",
            "title_similarity": "0.36779755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9fxov",
            "score": 1,
            "text": "This is terrible advice. There’s no guarantee you’ll find a suitable dog for your family in a shelter, and you’ll have to leave empty handed a few times. Also, shelters tend to ferociously vet who they home animals with, again making it likely your kid will be disappointed. Find the animal you want before you let your kid know you’re even looking.",
            "title_similarity": "0.6178007",
            "sentiment_compound": -0.867
        },
        {
            "id": "hm9g9g3",
            "score": 1,
            "text": "Imagine if everyone was this boring for Christmas 🤣",
            "title_similarity": "0.51010144",
            "sentiment_compound": 0.1469
        },
        {
            "id": "hm9ges2",
            "score": 1,
            "text": "This is a good advice for lonely people who need a companion, more so often for elderly.\n\nA child should have a young animal friend to grow up with them and get accustomed to them from the very beginning. As much as I admire pet shelter pets, you would never know what kind of pet it is and it will **always** bear danger to your child.",
            "title_similarity": "0.69671404",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm9gqhm",
            "score": 2,
            "text": "I disagree I think the parent is better off picking the pet. If you let the kid choose they are going to choose the most high energy “friendly” dog, which will always end up being an alpha male thats super hard to train. Pick a more submissive dog without your kid there",
            "title_similarity": "0.5826998",
            "sentiment_compound": 0.5552
        },
        {
            "id": "hm9gwm5",
            "score": 2,
            "text": "Uh life tip it's basically impossible to get a dog from a shelter these days. In NYC it takes months and up to 9k.",
            "title_similarity": "0.46829566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9hf78",
            "score": 2,
            "text": "That's like dog blue balls.",
            "title_similarity": "0.08801387",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hm9hjf3",
            "score": 1,
            "text": "Better LPT: ***Wait until mid-January to buy a dog.***\n\n1. Lots of dogs need home after people get them as thoughtless \"presents\" and dump them, like they're a bottle of bad perfume and not a living, sentient being who deserves love and a home. \n\n2. You don't want to be one of them, do you? Maybe wait until after the present-buying mood to get a new animal.",
            "title_similarity": "0.80707574",
            "sentiment_compound": 0.0716
        },
        {
            "id": "hm9hsga",
            "score": 1,
            "text": "Be responsible. Me as a adult wonder for a long time if it is good time to get a dog. To be funny, I want a dog for a few years. Now I even know which one - Staffy.",
            "title_similarity": "0.5786396",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hm9hv1x",
            "score": 1,
            "text": "I'm sure it's been said. But only get a dog if you are willing to accept the responsibility of having a animal with the permanent mind set of a child. \n\nThey are living beings with personalities, emotions and can feel pain and sadness. \n\nLove them fully",
            "title_similarity": "0.48833272",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hm9iqql",
            "score": 1,
            "text": "We have a dog shaped Christmas door stop that we call Christmas dog, He always appears on December 1st and marks the beginning of the run up to Christmas.\n\nLast year we told the children that Xmas dog would soon be here and our 3yo spent the morning sobbing because he thought we were getting a real dog.",
            "title_similarity": "0.7850932",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hm9isri",
            "score": 1,
            "text": "Or don't give a pet as a gift at all",
            "title_similarity": "0.16669032",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hm9j1w7",
            "score": 2,
            "text": "America's relationship to pets is beyond fucked up. Don't buy pets for other people, and just don't buy a fucking pet if you don't know you can take care of a fucking pet.",
            "title_similarity": "0.44365376",
            "sentiment_compound": -0.296
        },
        {
            "id": "hm9jnyh",
            "score": 1,
            "text": "Where I'm from the shelters don't even adopt out pets from middle of November until middle of January to avoid people getting animals as presents",
            "title_similarity": "0.6550923",
            "sentiment_compound": -0.4055
        },
        {
            "id": "hm9k15i",
            "score": 1,
            "text": "Depends on the age and temperament of the child. 3-4 year old will day \"doggy?\" endlessly until you go get it.\n\n\"Can we get the dog now, can we get the dog now?\"\n\nTemper tantrum because the shelter is closed.\n\nOlder child researching breeders because they want the dog they saw in a certain movie or tv show and getting mad when you say you're going to the shelter.",
            "title_similarity": "0.68556374",
            "sentiment_compound": -0.7757
        },
        {
            "id": "hm9k82v",
            "score": 2,
            "text": "This is honestly awful advice. You should know the pet you wanna adopt before taking a trip to the shelter. Randomly picking a dog to fit your life is such an unnecessary risk. Do some research and adopt a dog that will jive with your life’s. This post is a joke.",
            "title_similarity": "0.67656505",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hm9k8vu",
            "score": 1,
            "text": "Isnt this just getting a dog for Christmas with extra steps?",
            "title_similarity": "0.74399143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9lhnc",
            "score": 2,
            "text": "This happened to me as a child and I didn't get the dog for another 5 years. \n\nThis post is hate speech.",
            "title_similarity": "0.4826765",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hm9mrl1",
            "score": 3,
            "text": "A bit awkward when you buy your child a dog feeding bowl for Christmas.",
            "title_similarity": "0.79838485",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hm9or6y",
            "score": 2,
            "text": "Tell me you don’t have kids without telling me you don’t have kids",
            "title_similarity": "0.28449756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9outn",
            "score": 1,
            "text": "Don't get pets as a Christmas present at all, the holidays are a different time of the year with them being more hectic, you're going to scare the poor critter and ruin any sense of expected schedule they'll have",
            "title_similarity": "0.59352016",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hm9ow0w",
            "score": 1,
            "text": "Just don't buy an animal as a Christmas gift, it's not a gift, it's a responsibility to have an animal.\n\nSo please, stop gifting animals on birthday / Christmas / whatever. Pick an animal if you feel comfortable with the responsibilities which come with the animal.",
            "title_similarity": "0.66191006",
            "sentiment_compound": 0.6493
        },
        {
            "id": "hm9pq0f",
            "score": 1,
            "text": "Or accidentally forget the last part 😂",
            "title_similarity": "0.11728172",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hm9prs7",
            "score": 1,
            "text": "I did this for my wife. \n\nYou've never seen a woman so happy to open a box of cat litter.",
            "title_similarity": "0.57313204",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hm9qazx",
            "score": 1,
            "text": "Or maybe just don't get dog accessories either as a proxy for getting a dog at Christmas. You're basically just suggesting moving the day.\n\nA lot of places don't allow people to secure dogs for Christmas because of high abandonment rates.\n\nYour LPT avoids the real issue behind why people shouldn't get pets for Christmas. That main reason is they're bought for kids who ultimately don't bare responsibility for the raising and care of a pet. It falls to the parents who can't always maintain or care to maintain the pets health and wellbeing.\n\nAs such I think its a poor LPT. It fails to tackle the real issue of why pets should not be gifts and seems like its offered as a solution for not buying a dog for Christmas. A Dog is not just for Christmas and it's a bit irresponsible imho to promote buying accessories as a LPT in this manner.\n\nSome comments do acknowledge the responsibility issues and that pets  should only be bought if the parents are ready to take on that responsibility which is nice to see in the face of a concerning LPT. Many see the real issue and that is  reassuring.",
            "title_similarity": "0.7676728",
            "sentiment_compound": 0.8241
        },
        {
            "id": "hm9qign",
            "score": 1,
            "text": "If you are buying a dog for your child, I’d suggest a verified breeder as appose to an animal shelter.",
            "title_similarity": "0.74458426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm9qx3o",
            "score": 1,
            "text": "Thats a great idea!",
            "title_similarity": "-0.06146213",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hm9scpm",
            "score": 1,
            "text": "This worked great with my sister. She opened a bag of dog food Xmas morning and broke out crying. Took an hour to calm her down",
            "title_similarity": "0.597167",
            "sentiment_compound": 0.128
        },
        {
            "id": "hm9sjkf",
            "score": 1,
            "text": "This is exactly what we did. I got it all on video and my daughter cried for about ten minutes.",
            "title_similarity": "0.3631854",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hm9t1c8",
            "score": 1,
            "text": "No way dog is way cooler this is lame",
            "title_similarity": "0.13882059",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hm9t8ld",
            "score": 1,
            "text": "this is such a terrific suggestion, adopt don't shop! I bought a purebred Husky 20 years ago, he was a nice boy but the pitbull mix I got from the shelter and have now is so loving and so smart. No regrets!",
            "title_similarity": "0.6642885",
            "sentiment_compound": 0.9654
        },
        {
            "id": "hm9tg3e",
            "score": 1,
            "text": "I have friends who work at shelters in my area as volunteers, and they get people all the time post Xmas who didn't think to buy anything but the dog. They complain the puppy wouldn't stop barking out in the freezing cold garage with water and food in recycled plastic Chinese food containers and an old towel to lie on. Our area also sees rescues coming from larger cities to try to redistribute them. Our local pet stores only host shelter days, none sell puppy mill pets. Still are lots of private breeders though so lots of people buy expensive dogs and then give them up.",
            "title_similarity": "0.7257205",
            "sentiment_compound": 0.3574
        },
        {
            "id": "hm9u15u",
            "score": 1,
            "text": "Don't be bullied or pressured into a shelter animal. Sure, it's quite noble, but you inherit other people's problems and unknown issues.  Make sure you are well prepared before you do so!",
            "title_similarity": "0.5841761",
            "sentiment_compound": 0.8012
        },
        {
            "id": "hm9uq8k",
            "score": 1,
            "text": "I asked for a dog every year for Christmas since I was able to write a Christmas list. When I was finally old enough to actually be of help (ten or eleven) my parents INFORMED me on Christmas that they were willing to adopt a dog. But they said that I had to wait until summer break when I had time off to get one. When we finally did find our Snickers pup at the shelter, I had all summer to walk him daily and bond with him. Great parenting decision, I think.",
            "title_similarity": "0.82002914",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hm9vg54",
            "score": 1,
            "text": "This explains why shelters have like a sale of animals after Christmas. I got a cat in June a few years ago. Found him outside. Took him in because he was limping. When I learned I wasn’t allergic (turns out I’m allergic to the stuff pets bring in from outside) we decided to keep him. Then felt he was lonely. So after Christmas we decided to get him a sibling to play with. We went to a shelter and they were having a “sale “ I forgot how much baby pets were, but 5 month and older were like $5, which they would give the pet all their shots and, if age appropriate, neutered/spayed.",
            "title_similarity": "0.7809156",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hm9vmq2",
            "score": 1,
            "text": "My sister got a puppy for her and my nephew, she got a job 3 weeks later and now she is trying to get rid of the puppy. My nephew didn’t really care about the puppy after the first two days.",
            "title_similarity": "0.6652477",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hm9xp90",
            "score": 1,
            "text": "Wtf is this true?  \n\nPeople buy lots of unwanted dogs as Christmas presents each year that get taken right to the pound in January?",
            "title_similarity": "0.8121403",
            "sentiment_compound": -0.504
        },
        {
            "id": "hm9z1fd",
            "score": 1,
            "text": "Read this as “instead of buying a dog a Christmas present” and I’m like, good luck convincing me not to buy my dog presents. Lol",
            "title_similarity": "0.7553618",
            "sentiment_compound": 0.9169
        },
        {
            "id": "hma0bnf",
            "score": 1,
            "text": "And if you gift this to your SO, the pet becomes a nice plan B after you realize they aren’t into pup play.",
            "title_similarity": "0.6529528",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hma0fbc",
            "score": 1,
            "text": "This. Great LPT that I can vouch for. I bought my nephews a box of mice for Christmas to unwrap. The next day we went to the shelter to pick out the python.",
            "title_similarity": "0.7274221",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hma1x6f",
            "score": 1,
            "text": "If I ever have kids I ain’t getting them a dog, but instead chickens. They easy to take care of and I can get 10 hens and a rooster for less than $50",
            "title_similarity": "0.55305684",
            "sentiment_compound": 0.8462
        },
        {
            "id": "hma26uo",
            "score": 1,
            "text": "Adopt… adopt… adopt… not buy",
            "title_similarity": "0.17854632",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma3tc0",
            "score": 1,
            "text": "I prefer buying the dog a week before, boxing and wrapping.  Better surprise Christmas Day",
            "title_similarity": "0.7682148",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hma596a",
            "score": 1,
            "text": "Because that would go over well with children.",
            "title_similarity": "0.24587074",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hma6evl",
            "score": 1,
            "text": "This is a horrible idea",
            "title_similarity": "-0.06812671",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hma7u43",
            "score": 1,
            "text": "Minus the collar since you have no idea what size this pup gonna be.",
            "title_similarity": "0.4226616",
            "sentiment_compound": -0.296
        },
        {
            "id": "hma862n",
            "score": 1,
            "text": "An animal never should come as a present. That's disrespectful.",
            "title_similarity": "0.14259332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma8jwt",
            "score": 1,
            "text": "I'd rather get one from a breeder than a shelter.",
            "title_similarity": "0.35680085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma8kkq",
            "score": 1,
            "text": "Whoever wrote this 100% does not have a kid",
            "title_similarity": "0.08633482",
            "sentiment_compound": 0.0
        },
        {
            "id": "hma8vsi",
            "score": 1,
            "text": "LPT ANIMALS ARENT PRESENTS THEY ARE 15 YEAR LONG COMMITMENT",
            "title_similarity": "0.40859473",
            "sentiment_compound": 0.516
        },
        {
            "id": "hma8vzz",
            "score": 1,
            "text": "Opening up pet accessories before the reveal that you're getting a dog is the perfect way to go. My parents had my sister and I open up tennis balls, bowls, leashes, etc on Christmas morning (confused in the process), then announced we were each picking out a dog after lunch. We were so excited, and it still remains one of my family's most treasured memories 20 years later. The best Christmas ever!",
            "title_similarity": "0.8084837",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hma9d8a",
            "score": 1,
            "text": "LPT: just rescue a dog, doesn’t matter what month you do it. One rescue out of a shelter and in a forever home is always a good thing. \n\nYes there will be an influx of dogs in January, but waiting until January is arbitrary unless you’re hoping to get a purebred puppy from a shelter and aren’t willing to take anything else which is almost as bad as not rescuing in the first place.",
            "title_similarity": "0.79625005",
            "sentiment_compound": 0.6723
        },
        {
            "id": "hma9wbn",
            "score": 1,
            "text": "Animal are not gifts. Gifts are things you like and put away when you are no more interested in it.",
            "title_similarity": "0.37388134",
            "sentiment_compound": -0.3074
        },
        {
            "id": "hma9ypl",
            "score": 1,
            "text": "Great advice, unless you’re a kid",
            "title_similarity": "0.30495596",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmaa52c",
            "score": 1,
            "text": "Before presenting the leash and collar,make sure they are innocent ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "title_similarity": "0.3800098",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hmaa99k",
            "score": 1,
            "text": "And what if we DONT have kids? Can I still get myself a dog leash et accessories. What if I’m bad? Do I still get myself a pet?",
            "title_similarity": "0.642264",
            "sentiment_compound": -0.6174
        },
        {
            "id": "hmaaoo4",
            "score": 1,
            "text": "This isn’t a LPT. It’s just an idea.",
            "title_similarity": "0.053254835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmaaqr8",
            "score": 1,
            "text": "Off to a strong start, but instead of a shelter go to a reputable breeder and get a good pure breed that meets your needs. Shelters might have pit mixes and you don't want their inferior genetics.",
            "title_similarity": "0.55451447",
            "sentiment_compound": 0.8203
        },
        {
            "id": "hmabb5i",
            "score": 1,
            "text": "Also…. adopt don’t shop! There are plenty of rescues for breed specific animals and the shelters are always full.",
            "title_similarity": "0.49554518",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hmabc0m",
            "score": 1,
            "text": "This is the dumbest “tip” I’ve seen in a while. getting a leash for christmas will make your kid excited for about 15 minutes before they realize they can’t wait and will absolutely throw a tantrum and ruin everyone’s day. Plus, unwanted pets don’t make it back to the shelter for at least a month so you’re not even winning there.",
            "title_similarity": "0.6840018",
            "sentiment_compound": -0.9089
        },
        {
            "id": "hmabu2o",
            "score": 1,
            "text": "I fail to understand how purchasing a pet after Christmas as opposed to before Christmas is somehow supposed to magically make there be less animals in the shelter.",
            "title_similarity": "0.7541884",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmaczde",
            "score": 1,
            "text": "Then the little shit picks one out that doesn't fit all the gear",
            "title_similarity": "0.25038952",
            "sentiment_compound": -0.6616
        },
        {
            "id": "hmadlsi",
            "score": 1,
            "text": "Seconding this. Especially if you're getting a pet from a shelter, it is SO important to see how the animal will interact with you and your family before bringing it home, and getting helpful tips and knowledge from the shelter staff, as a family. Many (not all, but many) returns can be prevented this way. Much easier for you, the shelter, and the dog.",
            "title_similarity": "0.7544835",
            "sentiment_compound": 0.784
        },
        {
            "id": "hmadosx",
            "score": 1,
            "text": "Okay but don’t buy pets as a gift unless you plan on owning one anyway otherwise poor thing will end up at the shelter in a month when both parents and kids realize how much responsibility it is and both realize how much work it actually is—and because the kid won’t do it, and the parents don’t want to it’ll go back to the shelter.\n\nOnly get a pet if you’ve looked for a while and think it’s time to get one and make sure you have researched into what fits your lifestyle (even if it is a mix from a shelter you can visit and see the temperament).\n\nDon’t get any pet (but more specifically any dog breed) just because it looks like this cute pet from that movie/show. Some people are not prepared for the amount of grooming, exercise, play and attention these breeds need and end up neglecting them \n\nSource: someone gifted us a husky pup, we knew what was in store (HOUR*S* of exercise and play) and did further research to better take care of this dude. Nothing could have prepared us for the infinite amount of shedding, and at least for the first couple years, the amount of energy was more than even we prepared for. Meanwhile I see people in my neighborhood that keep their huskies on a balcony because they’re too vocal or shed or rip furniture apart because the owners work all day and want to make do with a one hour walk morning and another at night—bitch please! Those dogs need *minimum* 1 hour run morning and another afternoon plus all the play they can get in-between.",
            "title_similarity": "0.78595525",
            "sentiment_compound": 0.985
        },
        {
            "id": "hmae5qn",
            "score": 1,
            "text": "The accessories you need to buy will depend on the size and breed of the dog... puppy or small dog = small accessories, etc. Doesn't that pose another complication if you don't know what dog you're getting?",
            "title_similarity": "0.5642445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmaegmz",
            "score": 1,
            "text": "Actual LPT: Don't buy a dog for Christmas",
            "title_similarity": "0.52380896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmaendr",
            "score": 1,
            "text": "My kid would be so bummed out if I got them all this shit and no dog. Wtf kind of Christmas you trying to make for me OP? This is awful advice lol.",
            "title_similarity": "0.59446347",
            "sentiment_compound": -0.5541
        },
        {
            "id": "hmaep4o",
            "score": 1,
            "text": "\nOr get your kid what they want",
            "title_similarity": "0.28547904",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hmaexh3",
            "score": 1,
            "text": "And if that doesn't work, you can always use the collar and leash on your wife",
            "title_similarity": "0.537904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmaf0cn",
            "score": 1,
            "text": "Shelters where I live actually suspend adoptions for the month of December to help resolve the issue of returns.",
            "title_similarity": "0.5906589",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmafkg6",
            "score": 1,
            "text": "i wanted purebred german shepherd so badly whole year and when my father brought it home in the morning i thought it was a dream someboydy walking like an awkward ret near my bed\n\nit was puppy",
            "title_similarity": "0.6985882",
            "sentiment_compound": -0.2712
        },
        {
            "id": "hmaguha",
            "score": 1,
            "text": ":,) aww this is a really good LPT",
            "title_similarity": "-0.00235153",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hmai32u",
            "score": 1,
            "text": "Absolutely NO, never ever give a dog as a gifts, neither on Christmas or (if Hispanic) January.\n\nThe only exception is if you know the person have a history of good care to past dogs, and has expressed the wish for another get one. \n\nTo get a dog is a responsability that's needs to be well talked among the family members, and be well aware about the responsability of getting a living being.\n\nMy gosh, every day LPT success to surpass themselves with even worse and very bad tips each time.",
            "title_similarity": "0.6746377",
            "sentiment_compound": 0.8319
        },
        {
            "id": "hmaip8m",
            "score": 1,
            "text": "Shelter dogs are meh. Better off going to a breeder and getting good genes",
            "title_similarity": "0.56450284",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hmal0xt",
            "score": 1,
            "text": "This is not a good LPT. A collar, bowl, and leash? Seriously?\n\nBetter idea: Get your child a “How to Care for a Dog” book and have them read it as a conditional to getting a dog.\n\nDoesn’t even have to be Christmas lol",
            "title_similarity": "0.77349144",
            "sentiment_compound": 0.7314
        },
        {
            "id": "hman3qg",
            "score": 1,
            "text": "Animals are NOT presents. Not any type of animal, not for children, not for adults, not at any time of year. This is solid advice for every pet, every person, every day.",
            "title_similarity": "0.32836944",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hmang74",
            "score": 1,
            "text": "My wife wanted a dog but I didn't want to choose it for her. So I bought her a stuffed animal that matched the description she had mentioned. \n\nShe opened her present on Christmas two years ago and she INSTANTLY knew she was getting a dog. \n\nEveryone was excited and we got to toss the stuffed animal around so they can pretend to hold the animal, etc. It worked for us very well. \n\nWe adopted a few days later.",
            "title_similarity": "0.8163462",
            "sentiment_compound": 0.5942
        },
        {
            "id": "hmaodqi",
            "score": 1,
            "text": "This is what my parents did when I was a child! 100% recommend! You get the same joy on Christmas knowing that you’re getting a dog, but then the whole family still gets to go out and pick out the right dog for the family, which can really be important, especially if dealing with rescues",
            "title_similarity": "0.7602548",
            "sentiment_compound": 0.852
        },
        {
            "id": "hmaqqcq",
            "score": 1,
            "text": "I accidentally miss-read this as “instead of buying your dog a Christmas present.” And was about to get upset at the bringing them to a shelter, part. Because I only realized at the “pick out a pet part.” That child was referring to the one of humans kindred. And now I laugh about myself.\n\nBur yes this, not just for children but also when buying a pet for an adult.",
            "title_similarity": "0.82606006",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hmary2r",
            "score": 1,
            "text": "Situation around here, and I'm not exaggerating, is that shelters won't even consider people who can't have access to a vet. Covid put a lot of restrictions so consults take longer to do. Also as people start heading back to the office,  a lot are returning dogs, cats and even bunnies...",
            "title_similarity": "0.626248",
            "sentiment_compound": 0.1326
        },
        {
            "id": "hmb3vp8",
            "score": 1,
            "text": "Once things settled down take the child to the rock quarry to pick out their very own, pet rock.",
            "title_similarity": "0.59962416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmb58s8",
            "score": 1,
            "text": "Cant do this in the UK they will be waiting til next Christmas to get a rescue",
            "title_similarity": "0.5932658",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmbgwse",
            "score": 2,
            "text": "I started waking them up early and when it's raining and snowing to make sure they really want a dog, with full responsibility 😂",
            "title_similarity": "0.6694808",
            "sentiment_compound": 0.6997
        },
        {
            "id": "hmblcfs",
            "score": 1,
            "text": "Yeah we’ve done this with fish, hamsters and birds over the years. Works well. Time to set up the new habitats and then a family event going to get the actual animal. ❤️",
            "title_similarity": "0.6046526",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmblwlp",
            "score": 1,
            "text": "My mom did this when I asked for a computer. She bought me a mouse pad for it. I never saw the computer though but I was excited.",
            "title_similarity": "0.59796643",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hmbmxdj",
            "score": 2,
            "text": "My parents did this with my first goldfish. I got the tank and decor for my birthday. A few days later, we went to the pet store so I could pick out the fish. Great memories both!",
            "title_similarity": "0.6771835",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hmbob7h",
            "score": 1,
            "text": "*Child opens presents*\n\n\"OMG DAD, ARE WE GETTING A DOG???\"\n\n\"No son, these are for you. Now get back in you kennel\"",
            "title_similarity": "0.7158326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmcm3cj",
            "score": 1,
            "text": "Recently lost my own dog and this was exactly how my parents surprised my siblings and I! We got him a few days after Christmas and he was the most loving, protective, and the bests dog we could’ve asked for. Thank you for the reminder of him!",
            "title_similarity": "0.67330265",
            "sentiment_compound": 0.7831
        },
        {
            "id": "hmdccm0",
            "score": 1,
            "text": "Buying animals as a gift is for shitheads anyway. So much of them end up im the shelter after the holidays.",
            "title_similarity": "0.71156853",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hmgtkxr",
            "score": 2,
            "text": "When I was a kid, my dad never trained our dog (besides some very basic puppy training), and I was mostly in charge of her. She turned out ok, as she never attacked anyone or any dogs, but also jumped on people, mouthed people, barked at everything (sounded super aggressive), dug holes, pulled on the leash to the point of coughing, etc..   \nI taught her tricks, but never knew about behavioral training or how important it was (I was a kid).",
            "title_similarity": "0.60644925",
            "sentiment_compound": 0.7677
        },
        {
            "id": "hoot57e",
            "score": 1,
            "text": "My parents did this.. I at the time was hamster-sitting. I opened gifts such as cage, bowl, etc.. and at first I thought those were for me to use for the temp hamster, then my parents told me I was getting my own, I was super excited. Then I got to pick out which one I wanted.",
            "title_similarity": "0.7292254",
            "sentiment_compound": 0.743
        },
        {
            "id": "hos5uvx",
            "score": 1,
            "text": "We need to have a record so if they get a dog a return it to soon they are on a black list for getting animals",
            "title_similarity": "0.4997796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hprz0ij",
            "score": 1,
            "text": "I never understood getting someone a dog for a present. I would rather get coal that get a dog for Christmas.",
            "title_similarity": "0.62071884",
            "sentiment_compound": 0.0
        }
    ]
}