{
    "LPT: You will be forgotten when you leave. Whether it's a job, a relationship, or even life. People will move on. Accepting this will free your mind and let you discover yourself rather than making you attach your identity to a job, a belief, or a sect.\n": [
        {
            "id": "hmiqjp8",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.70258546",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hmiue47",
            "score": 1,
            "text": "Wow. Lots of people are afraid of the truth in this.",
            "title_similarity": "0.36149925",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hmit9le",
            "score": -6,
            "text": "Okay, well how about hitler? Ohhhh bet u remember that guy. Remember kids.. be like hitler. Unforgettable.\n\nYo bro, that’s really bad advice. Fucks wrong wit you?\n\n…A lot",
            "title_similarity": "0.4108583",
            "sentiment_compound": -0.7283
        },
        {
            "id": "hmixuwp",
            "score": 2,
            "text": "People are shitting on this but it’s not really wrong. Maybe what this is getting at is that people don’t think about you nearly as much as you worry they do so relax and don’t beat yourself up over dumb shit. \n\nAlso I remember loads of people I’ve worked closely with but I’ve forgotten way more people that I had less interaction with. I don’t see the problem here.",
            "title_similarity": "0.6407333",
            "sentiment_compound": -0.8842
        },
        {
            "id": "hmiskcw",
            "score": 14,
            "text": "Do you suffer from dementia?",
            "title_similarity": "0.32062328",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmjma0b",
            "score": 0,
            "text": "I've not forgotten a single person I've ever had any kind of relationship with. I talk to them all.",
            "title_similarity": "0.36102104",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hmizhky",
            "score": 0,
            "text": "You really die the last time anybody says your name",
            "title_similarity": "0.44880563",
            "sentiment_compound": -0.6361
        },
        {
            "id": "hmj260m",
            "score": 1,
            "text": "Thank you OP, You have inspired me to become the next Austrain artist",
            "title_similarity": "0.4462781",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hmjgbcg",
            "score": 0,
            "text": "The only people who will never forget or forgive you are debt collectors.",
            "title_similarity": "0.47739768",
            "sentiment_compound": -0.3915
        },
        {
            "id": "hmjh3kg",
            "score": 0,
            "text": "This is the functional nihilism-lite I live by",
            "title_similarity": "0.38022214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjw7rc",
            "score": 0,
            "text": "To go even further, people dont think about you or care about you as much as you think they do.",
            "title_similarity": "0.62305903",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmj2qsj",
            "score": 29,
            "text": "I agree. We all live and die. Most of us won’t be remembered 100-200 years from now. It’s a freeing thought to have to help you navigate and truly enjoy life. If you took offense to the OP’s post, you think you’re way more important than you really are. I once saw a man stabbed with a screwdriver at a bus stop by another man multiple times, police responded pretty quickly. A friend and I drove past the crime scene only 20 minutes later, it looked like nothing happened. The world moved on, despite being short one less human. You are important to yourself and, to a lesser extent, your family or loved ones. In the end you’re just a memory for them to look back on fondly or negatively. It’s a depressing thought, but it’s reality.",
            "title_similarity": "0.49698156",
            "sentiment_compound": 0.848
        },
        {
            "id": "hmj8ony",
            "score": 2,
            "text": "We care about our jobs, our employer and coworkers.  What we don’t realize is a company has no feelings - it can’t care about you.  Right there starts an issue - you thought you mattered.  We as coworkers and employees only matter as long as we are in place and performing the services we were hired for.  The minute we step out of that role the entire dynamic and social contract is finished.  If you expect otherwise you will be very hurt and disappointed",
            "title_similarity": "0.6940589",
            "sentiment_compound": -0.0404
        },
        {
            "id": "hmjl0wq",
            "score": 1,
            "text": "Unless you get divorced and have to pay for your spouse for 14 more years because she peeked at mall jobs before tapping out to be a stay at home mom.",
            "title_similarity": "0.42006886",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmjo5ql",
            "score": 1,
            "text": "If you quit a job or get fired, the job will find a replacement, or get someone to do your work as well.  \n\nIf you leave a relationship or get dumped, the ex will probably find someone new.  \n\nNo point in stewing over those things -- move on, and your priority should be on you.",
            "title_similarity": "0.8289858",
            "sentiment_compound": -0.765
        },
        {
            "id": "hmjfykm",
            "score": 4,
            "text": "This is advice for unambitious normies",
            "title_similarity": "0.5424155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmj98n1",
            "score": 6,
            "text": "I will never be forgotten",
            "title_similarity": "0.40786874",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hmjj68m",
            "score": 7,
            "text": "No. People just don't forget others like that. This sub fucking sucks, Jesus.",
            "title_similarity": "0.59653383",
            "sentiment_compound": -0.5002
        },
        {
            "id": "hmiwxhb",
            "score": -3,
            "text": "This is the advice I need. I've been feeling something along the lines of this but couldn't quite articulate it. Thanks OP I really needed to hear this. I'm gonna write it on a post it note and stick it on my wall next to my desk!",
            "title_similarity": "0.5019666",
            "sentiment_compound": 0.6992
        },
        {
            "id": "hmj8f1a",
            "score": -5,
            "text": "Thank you, OP. I NEEDED TO SEE THIS TODAY.",
            "title_similarity": "0.4742614",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmjmcx3",
            "score": 0,
            "text": "There is no hill worth dying on.",
            "title_similarity": "0.42334312",
            "sentiment_compound": -0.434
        },
        {
            "id": "hmjmvan",
            "score": 0,
            "text": "One hundred years from now, no one will care about anything you ever did, anything you ever said... \n\nAnd if by chance they do, you were probably a jerk. Or likely even worse, kept people down by force.",
            "title_similarity": "0.6047169",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hmjt3r5",
            "score": 0,
            "text": "God will remember you however so seek Him while you still have breath. This life is our only opportunity to choose our afterlife.",
            "title_similarity": "0.67098916",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hmk02vc",
            "score": 0,
            "text": "Not always true.\n\nI left my job 3 years ago, and my former boss flew across the country for my wedding and gave me $1000 gift.",
            "title_similarity": "0.26382646",
            "sentiment_compound": 0.1451
        },
        {
            "id": "hmlk0g4",
            "score": 0,
            "text": "Speak for yourself.  Some of us have rules/policies with our name in them",
            "title_similarity": "0.4847164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmit3s1",
            "score": 235,
            "text": "So, do you just like...not remember your grandparents? Or are you 15 and trying to make something profound?",
            "title_similarity": "0.44770485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmj91kl",
            "score": -1,
            "text": "Some see this as a negative, but I see it as an opportunity for a personal inventory of where my identity lies. If it’s in anything temporal (i.e. a job, relationship, title, appearance, etc.), I’m constantly under threat of losing it. \n\nThis is one reason why I believe in the eternal. If my identity is tied to something beyond this life, I’ll be less likely to succumb to cynicism or an identity crisis when something in this life changes.",
            "title_similarity": "0.75876814",
            "sentiment_compound": -0.9664
        },
        {
            "id": "hmjak1m",
            "score": -1,
            "text": "Yeah most people don't give a fuck",
            "title_similarity": "0.39309543",
            "sentiment_compound": 0.6187
        },
        {
            "id": "hmjbg1x",
            "score": 1,
            "text": "Free your mind, and the rest will follow",
            "title_similarity": "0.61151093",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmjctb4",
            "score": 1,
            "text": "degaf was the best advice we ever got as kids.",
            "title_similarity": "0.2657694",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hmjfygn",
            "score": -1,
            "text": "Ahhh, this one hit home right in the beginning of the work week lol",
            "title_similarity": "0.30105057",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmjgt24",
            "score": 1,
            "text": "Untrue.  I got depressed during a pandemic job and let some work slide.  I got laid off and had to do a bunch of shitty office jobs because I don't have good references anymore.",
            "title_similarity": "0.45731923",
            "sentiment_compound": -0.8521
        },
        {
            "id": "hmjofhj",
            "score": 1,
            "text": "I needed this today",
            "title_similarity": "0.39882073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk8hus",
            "score": 1,
            "text": "I finnally agree with one of these stupid posts",
            "title_similarity": "0.40943632",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmkbild",
            "score": 1,
            "text": "Completely agree with this, and when I express this to friends/family I’m often met with combative opinions. I’ve always found it easy to detach from crappy human relationships, jobs etc but apparently I’m in the minority here? The people Ive met that are defined by their employer/what they do for work/their social circles are typically the most unhappy and toxic people I’ve come across. It’s bizarre",
            "title_similarity": "0.4999941",
            "sentiment_compound": -0.642
        },
        {
            "id": "hmkfou8",
            "score": 1,
            "text": "Old lady here....these are wise words from the OP.\n\nThings happen in life you never, ever expect. Love with your whole heart, don't hold back, but remember that those you love the most can abandon you for a reason or *no* reason at all. Lover, parents, siblings----even your own children can and do throw you out like garbage. Then blame you for it....is it your fault? Yes. No. Maybe. That's not what matters, what matters is trying to be the best human being you can be, treating people with kindness and empathy. Learn not to blame others for their shortcomings, but also do not accept being treated like crap. Being uncomfortable with change or dealing with the excruciating pain of loss is natural, where you take that is up to you. \n\nIf the people in your life move on, do not become bitter. However painful people have their reasons. You don't have to understand. Move on. Live. Life doesn't last long enough to wallow. Learn what you can for all experiences, build yourself back better.",
            "title_similarity": "0.66239434",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hmiqrtj",
            "score": 428,
            "text": "This is neither pro, nor a tip, and isn't true either.",
            "title_similarity": "0.37907565",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmjipoa",
            "score": 14,
            "text": "This isn’t a “pro-tip”, this is a really boring, unremarkable person trying to make themselves feel better.",
            "title_similarity": "0.5849945",
            "sentiment_compound": 0.079
        },
        {
            "id": "hmj8562",
            "score": 2,
            "text": "So true, I noticed that a few guys I worked with were forgotten 5 minutes after they retired. That realization helped me decide to retire early. Job doesn’t care about me, so why do I care so much? Not sure what I want to do when I retire next month, I only know right now that I never want to go back to work.",
            "title_similarity": "0.59742403",
            "sentiment_compound": 0.754
        },
        {
            "id": "hmj90wg",
            "score": -2,
            "text": "This was good timing to read!\n\nI love my job, great company and a great team I work with.\n\nAnother job offer has come along, same job but nearly 50% better salary. On paper its a no brainer to take it, right?",
            "title_similarity": "0.36010873",
            "sentiment_compound": 0.8748
        },
        {
            "id": "hmji8sz",
            "score": 2,
            "text": "Honestly that thought just makes me think \" why bother,  then?\" If nothing matters and everyone forgets you.",
            "title_similarity": "0.7603968",
            "sentiment_compound": 0.1346
        },
        {
            "id": "hmjkev8",
            "score": 2,
            "text": "Have you never heard of... trauma???",
            "title_similarity": "0.3949551",
            "sentiment_compound": 0.4352
        },
        {
            "id": "hmjl0bj",
            "score": -2,
            "text": "yep. realized none of this shit mattered a few years ago, so i stopped investing my emotions into it and ever since i’ve been 100x happier.",
            "title_similarity": "0.58448297",
            "sentiment_compound": -0.2091
        },
        {
            "id": "hmjl42w",
            "score": 2,
            "text": "Thank you. I needed to read this today, thank you very much.",
            "title_similarity": "0.46837482",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hmjm46a",
            "score": 2,
            "text": "Especially work, no matter how loved and respected you were, people stop caring after a few months. Everyones replaceable, no one is as special as think they they are.\n\nI don’t agree with family and friends though. They never disappear from your thoughts. I lost my dad 5 years ago. I still think about him every day, not every moment of the day, but everyday. You don’t ever forget your loved ones.",
            "title_similarity": "0.5030155",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hmjrsa7",
            "score": 2,
            "text": "See this is a little depressing to me. I think about people in my past all the damn time. Basically if you were even kind of close to me at any point past...I dunno...age 16, you probably cross my mind once every couple weeks.",
            "title_similarity": "0.3534646",
            "sentiment_compound": -0.6133
        },
        {
            "id": "hmiyzn2",
            "score": 4,
            "text": "As Tyler Durden (chuck palanhiuk)said “You are not your job, you’re not how much money you have in the bank. You are not the car you drive. You’re not the contents of your wallet.”",
            "title_similarity": "0.4425702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjkrdr",
            "score": 3,
            "text": "No, YOU will be forgotten. Don't project onto the test of us.",
            "title_similarity": "0.6824542",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmiubdp",
            "score": 49,
            "text": "Yes and no.  \n\n\nYou are correct that your identity should not be attached to a job, belief, or sect.\n\nWhether or not you are forgotten, depends on how strong of a relationship you had with those around you.  Whether it's a job, relationship, or a \"sect,\" they will remember you if you put effort into the relationship.  Even a small gesture of kindness or consideration can go a long way and really impact someone and make them remember you.",
            "title_similarity": "0.803606",
            "sentiment_compound": 0.8647
        },
        {
            "id": "hmiycn2",
            "score": 345,
            "text": "Ah, thank you. Now I can finally kill myself in peace without bothering anyone",
            "title_similarity": "0.6472629",
            "sentiment_compound": 0.3578
        },
        {
            "id": "hmjczgp",
            "score": 4,
            "text": "No sure how true this is... I suppose eventually you will be, but you everyone is forgotten eventually even by their closest loved ones.   \n\n\nWe have had multiple people pass away from my workplace who even after a decade are still talked about and remembered for their work.   \n\n\nThat being said, no you shouldn't tie your identity to things like that... but I would also include other things like sexuality, gender, or race. Identity is the person you are, not the surface layer.   \n\n\nI would argue that job, relationship, belief or sect is much better to tie an identity to than sex, gender, or race. There is much more depth there.",
            "title_similarity": "0.6718869",
            "sentiment_compound": 0.8711
        },
        {
            "id": "hmjk0or",
            "score": 5,
            "text": "I’ll be honest it doesn’t “free my mind” or whatever bollocks you put. It just makes me want to fucking get it over with and end it. If no ones going to even notice what’s the fucking point.",
            "title_similarity": "0.7312648",
            "sentiment_compound": 0.34
        },
        {
            "id": "hmjk9x5",
            "score": 4,
            "text": "it seems like many people are missing the point of the OP.  \n\nthe point is that life moves on. the world moves on. people move on. it doesn't mean that you are completely wiped or removed from memory.",
            "title_similarity": "0.75346684",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hmiv9t7",
            "score": 86,
            "text": "They said I was the best manager they ever had...it's been only a month or so and I feel like all my coworkers forgot about me..or they are just lazy at being friends",
            "title_similarity": "0.4486321",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hmj3e2i",
            "score": 6,
            "text": "People will remember you if you're grossly incompetent at your job. You'll be a warning story for new hires or the subject of safety briefings.",
            "title_similarity": "0.64017093",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmjntcb",
            "score": 22,
            "text": "this sounds like the mindset of someone who thinks ghosting is a good way to handle relationships.",
            "title_similarity": "0.58089864",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hmjihat",
            "score": 7,
            "text": "A reminder for work, school or any other \"forced\" social environment.  Remember that there is a difference between work friends and actual friends.  A forced social environment is one in which you socialize with people you wouldn't normally, but do because you are stuck with them due to work, school, ect.\n\nThese friends are fleeting.  You may socialize with them in this environment, and may even socialize off and on outside with others.  However, when the forced portion is gone (graduate, change jobs, ect), you'll find you have little in common with them.  Don't stress over it, and don't force an attachment when little is there.  It can lead to more stress, forcing yourself to keep in touch out of some sort of self imposed responsibility or guilt.",
            "title_similarity": "0.72160447",
            "sentiment_compound": -0.8054
        },
        {
            "id": "hmjxrw7",
            "score": 9,
            "text": "I broke up with my girlfriend on Saturday, I will not forget her. I'm pretty devastated. I know it gets better but I'm trying not to break down at work.",
            "title_similarity": "0.5466863",
            "sentiment_compound": -0.0044
        },
        {
            "id": "hmjjp97",
            "score": 85,
            "text": "r/im14andthisisdeep. This isn’t even remotely true. I remember coworkers from 30 years ago, all of my exes, and all loved ones who have passed away.  That’s a pretty dismal outlook on life, man.",
            "title_similarity": "0.4537466",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hmjepk8",
            "score": 28,
            "text": "This isn't true at all for the relationship part. My and my ex were over many years ago and she still messages me quite often. And i don't ever see her forgetting me in her life because I was her first boyfriend.",
            "title_similarity": "0.46695992",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmjmj4o",
            "score": 7,
            "text": "Well, I have grown older, but I often still remember some of my teachers very fondly (a few of them are no more). \n\nSo to the teachers & professors out there, making a difference, thank you! Your work has impacted many 😊",
            "title_similarity": "0.45830142",
            "sentiment_compound": 0.9391
        },
        {
            "id": "hmj28vx",
            "score": 12,
            "text": "I sure hope I'm not forgotten.",
            "title_similarity": "0.5597532",
            "sentiment_compound": 0.7065
        },
        {
            "id": "hmjvjv5",
            "score": 11,
            "text": "Reminds me of my favorite Benjamin Franklin quote: \n\n\n“If you would not be forgotten, as soon as you are dead and rotten, either write things worth reading, or do things worth writing.”",
            "title_similarity": "0.56877553",
            "sentiment_compound": -0.281
        },
        {
            "id": "hmjgdr4",
            "score": 82,
            "text": "After 25+ years of service to the state, every supervisor thinks the place will fall apart without them after they retire. \n\nTruth?  Ain’t nobody give a shit you ain’t here anymore.  Not even a little bit.",
            "title_similarity": "0.435056",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmjogs5",
            "score": 14,
            "text": "Wrong sub, this should be a shitty pro life tip.  Narcissistic POV and a sad life if you are only concerned about yourself.",
            "title_similarity": "0.49233496",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hmjhnfo",
            "score": 336,
            "text": "[deleted]",
            "title_similarity": "0.42044348"
        },
        {
            "id": "hmkajna",
            "score": 30,
            "text": "Be careful with this advice. It's very depressing to think about being forgotten when this life comes to an end. Or a relationship. While true. Try not to think of life this way.",
            "title_similarity": "0.731047",
            "sentiment_compound": -0.101
        },
        {
            "id": "hmiupk6",
            "score": 1709,
            "text": "I remember the boyfriend I had when I was like 13 and my first coworker and my childhood friends, stuff doesn't just disappear. It's more like... you stop thinking about it until something stirs it up, but it's still there and still comes up, at least for me",
            "title_similarity": "0.53171873",
            "sentiment_compound": 0.5102
        },
        {
            "id": "hmiz0tj",
            "score": 1288,
            "text": "Then why my ex keep calling me 10 years later?",
            "title_similarity": "0.3537355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjhqok",
            "score": 76,
            "text": "People will move on, sure, but if you make any semblance of an impact it'll be a looooong time before you're totally forgetten.",
            "title_similarity": "0.7988572",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hmj3yg9",
            "score": 306,
            "text": "I've seen a lot of people come and go at my current job. You don't want to be remembered after you leave. It seems we don't remember the people who aced everything and put in extra hours. We remember the people who messed everything up.",
            "title_similarity": "0.5823182",
            "sentiment_compound": -0.4257
        },
        {
            "id": "hmispmn",
            "score": 3566,
            "text": "Workplaces can be just as toxic as people. I've learned that once I reach the point where I'm continuously dreading going to work, it's time to fill out applications and move on. Same goes with careers. We all change as we age; if you don't love/like your career anymore, do some soul searching and make plans to switch careers. Life's too short to be miserable 40 hours a week, 52 weeks a year, year after year.",
            "title_similarity": "0.6181931",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hmjmut8",
            "score": 1979,
            "text": "Good and mediocre employees get forgotten, but awful employees are remembered forever. Bob still gets blamed for things 10 years later.",
            "title_similarity": "0.40004972",
            "sentiment_compound": -0.8248
        },
        {
            "id": "hmj8u2i",
            "score": 1,
            "text": "Yeah but what if I make such a big impact like really fuck some shit up. I can think of a couple names that did a little trolling before kicking it.",
            "title_similarity": "0.45814702",
            "sentiment_compound": -0.8241
        },
        {
            "id": "hmj9l0s",
            "score": 1,
            "text": "People remember heroes that do great deeds and villains that cause great harm.\n\nFilm studios also love to make movies and TV series about both these groups and that will keep the memory alive.",
            "title_similarity": "0.36266023",
            "sentiment_compound": 0.886
        },
        {
            "id": "hmjf16q",
            "score": 1,
            "text": "Hopefully we can all do enough good in our lives to be remembered at least by our families, and if we're lucky have a wide enough beneficial impact to be remembered by others as well.",
            "title_similarity": "0.5422692",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hmjf7zs",
            "score": 13,
            "text": "You're now banned from /r/Genealogy",
            "title_similarity": "0.5717708",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmjgwdp",
            "score": 1,
            "text": "I have such a problem with this. I dive really deep into things inevitably getting attached. Jobs, relationships, habits. I just got out of a two year relationship and am trying to accept this mentality. It seems like such a cold and lonely reality on the contrary though, so I'm just in a weird back and froth. Any good tips on embracing this philosophy? Meditation is a pretty big part of my daily routine already.",
            "title_similarity": "0.55347717",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hmjhb36",
            "score": 1,
            "text": "Learnt this from the darkest dungeon. Yeah, we need to move on and don't cling to any material entity",
            "title_similarity": "0.66012824",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmjhxvp",
            "score": 1,
            "text": "Yah, the kids wont remeber. Just leave the little bastards.",
            "title_similarity": "0.6603612",
            "sentiment_compound": -0.5513
        },
        {
            "id": "hmjigra",
            "score": 1,
            "text": "I dunno I've had a seizure in front of multiple cooks and been taken out of multiple restaurants by ambulance mid shifts. I'm pretty sure folks remember me, if it isn't entirely positive lol..",
            "title_similarity": "0.29324013",
            "sentiment_compound": -0.0461
        },
        {
            "id": "hmjiixr",
            "score": 1,
            "text": "Is it really that important for people to be \"remembered\"? Personally, I don't care if nobody thinks about me or remembers me as long as I have fun. It's not like being remembered by people will somehow make you powerful in the afterlife if there is one... or does it?!",
            "title_similarity": "0.73547196",
            "sentiment_compound": 0.624
        },
        {
            "id": "hmjiz5y",
            "score": 3,
            "text": "Truth. Especially about jobs. The place I got laid off from, we were a tight-knit team. After I got laid off, I didn't hear from a single one of them. I was really hurt. \n\nBeing comfortable in your self and place in the universe makes things like this easier to deal with.",
            "title_similarity": "0.60111356",
            "sentiment_compound": 0.7858
        },
        {
            "id": "hmjj7wv",
            "score": 1,
            "text": "Pro-er tip: they forget you when you leave the room",
            "title_similarity": "0.67762566",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmjjcrs",
            "score": 5,
            "text": "Everything included this planet will be forgotten eventually. There will be nothing to even show that we were ever even here so don’t worry about being remembered, you can be the most iconic person in history and eventually nothing will ever know that you existed",
            "title_similarity": "0.582467",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hmjjmf7",
            "score": 1,
            "text": "I know, people many people forget I'm actually another human being while I'm with them, surely they have no memory of me after I leave.",
            "title_similarity": "0.6138418",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmjjqpo",
            "score": 1,
            "text": "Keep in mind thay it's not all bad, though. Imagine if someone didn't forget you, hold a grudge against you (for whatever reasons), and try to ruin your life based on such.",
            "title_similarity": "0.668578",
            "sentiment_compound": -0.0731
        },
        {
            "id": "hmjjzhn",
            "score": 2,
            "text": "Not to mention live your life without trying to satisfy the expectations of others",
            "title_similarity": "0.73924506",
            "sentiment_compound": -0.357
        },
        {
            "id": "hmjkr7k",
            "score": 2,
            "text": "Worked at a job 7 years. The day I left the only guy who said bye was the security guard.",
            "title_similarity": "0.33062917",
            "sentiment_compound": 0.34
        },
        {
            "id": "hmjkv2n",
            "score": 5,
            "text": "Frankly cannot agree at least for the relationships - good or bad, I remember all",
            "title_similarity": "0.50370455",
            "sentiment_compound": -0.4039
        },
        {
            "id": "hmjkyek",
            "score": 3,
            "text": "LPT: To avoid being forgotten, start a religion or burn down a famous temple.",
            "title_similarity": "0.581213",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hmjl6ou",
            "score": 1,
            "text": "Ah nothing like intentionally misconstruing a post to bring up…Hitler 😒? Some of you need to go outside",
            "title_similarity": "0.5630754",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hmjlnx6",
            "score": 2,
            "text": "My man Carl from ATHF would say - \"It doesn't matter.  None of this matters.\"",
            "title_similarity": "0.56084025",
            "sentiment_compound": 0.0132
        },
        {
            "id": "hmjlo31",
            "score": 1,
            "text": "No way.  They talked about Kirsten for years as an example of why you shouldn't steal from the company and how they will always find out and take action no matter how long you've been with them. (She was stealing a few candy and 20 oz pops a week.)",
            "title_similarity": "0.45811337",
            "sentiment_compound": -0.5181
        },
        {
            "id": "hmjm0ty",
            "score": 1,
            "text": "Did you not watch the events of Coco????",
            "title_similarity": "0.44590515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjnlay",
            "score": 1,
            "text": "Except for me. I’m now on the “be prepared” PowerPoint slide for all trainees going into my old job. I’m wearing a black trash bag I cut out to be a poncho because I forgot my rain gear.",
            "title_similarity": "0.4232857",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmjnmpn",
            "score": 3,
            "text": "It happens quickly, too. I used to DJ at big outdoor shows and while I was on stage, hundreds of people were holding up signs and heart symbols and all that jazz. Then my set ended and I went out into the crowd and all those people went right back to having no idea who I was and not caring at all lol.",
            "title_similarity": "0.29770938",
            "sentiment_compound": 0.4891
        },
        {
            "id": "hmjohp3",
            "score": 1,
            "text": "it feels like this could be turned into one of those quote setups with some random famous person that embodies the sentiment of the quote, but didn't necessarily say it, but it's not really clear because the pic doesn't clarify that information.",
            "title_similarity": "0.5669021",
            "sentiment_compound": -0.3294
        },
        {
            "id": "hmjp4oe",
            "score": 1,
            "text": "Bruh, are you projecting?",
            "title_similarity": "0.30479842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjplti",
            "score": 2,
            "text": "That's some Seneca shit right there.",
            "title_similarity": "0.25672156",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmjpsut",
            "score": 1,
            "text": "“They say you die twice. One time when you stop breathing and a second time, a bit later on, when somebody says your name for the last time.” ~Banksy",
            "title_similarity": "0.46716294",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hmjq5rl",
            "score": 2,
            "text": "Then explain why I still remember decades worth of slightly annoying people who I still complain about and make fun of in causal conversation? You don't tell Karen stories or talk about that one kid from school?\n\nThe problem isn't that other people will remember me making a public mistake or acting like a goof ball at an inappropriate moment, it's that I remember that I could have done things a better way. I think \"man, I wish I could have done it different\" not \"oh geez, I hope those people don't remember the time I messed up\".\n\nThis is some serious \"other people get better, why don't you?\" tier advice with a splash of \"not quite an expert on atheism\". A classic combo, but a bad flavor, regardless of which apocalyptic cult you follow.",
            "title_similarity": "0.5663769",
            "sentiment_compound": -0.8805
        },
        {
            "id": "hmjqa91",
            "score": 1,
            "text": "A job is a job. You are a human being. Your priorities come first before the workplace. Jobs can be replaced, toxic managers and companies can be sued for enormous and obscene amounts of money.\n\nMy former employer just paid for my fully loaded 2019 raptor.",
            "title_similarity": "0.501721",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hmjqurf",
            "score": 1,
            "text": "You're saying cheat on everyone in a relationship, it has no impact.\n\nSteal from people when you can, they'll forget.\n\nBe a complete ass hole any time you want, doesn't matter.\n\nAt the end of the day it affects nothing.",
            "title_similarity": "0.6488246",
            "sentiment_compound": -0.7748
        },
        {
            "id": "hmjqyyl",
            "score": 1,
            "text": "They don't even know i exist, let alone forgotten.",
            "title_similarity": "0.47399598",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hmjr4l4",
            "score": 1,
            "text": "Actually if I go to my local Target right around opening (I used to unload the truck in the morning) there's usually at least one employee who recognizes me\n\nFor example apparently my old boss died and one of my coworkers is the overnight shift manager now, familiar faces at the registers\n\nLast time I was there an employee who definitely recognized me, girl who stocks the toy department, while I was shopping but we didn't exchange any words, they just did a double take\n\nNow, it doesn't end there. I look very similar to my younger brother in appearance, hair style, and dress, only difference between us is I'm a little taller and wear glasses, but people outside our family can't really tell us apart. He worked at the local Stop and Shop for almost 10 years, hasn't worked there in at least 5 and moved several towns over, but once or twice a year an employee stops me, says hello, thinking I'm my brother, and I always get a laugh out of it, give them the 5 minute spark notes version of how he's doing and then move on.\n\nSo no, you're wrong, people will remember you, you just need to do something to be memorable.",
            "title_similarity": "0.4562062",
            "sentiment_compound": -0.3497
        },
        {
            "id": "hmjr6oh",
            "score": 1,
            "text": "Something I really do wish I can forget. Remembering is my curse.",
            "title_similarity": "0.54229563",
            "sentiment_compound": -0.3446
        },
        {
            "id": "hmjr7he",
            "score": 1,
            "text": "On one hand, sure. \n\nOn the other hand... suicide fuel. \"Nothing really matters, because nobody will remember me anyway.\"\n\nHow do I know this? \n\nBecause I've known this POS \"LPT\" for a very, very long time, and I battle it every day.\n\nNothing matters, in the end; be it a few years from now, decades, millenniums, whatever. At the end of the universe, does anything really matter, what happened before? \n\n\"Look upon my works, ye mighty, and despair.\"\n\nOnly thing that keeps me going is the fact that life must be enjoyed, and I can't fully enjoy Life if I put an ending in the middle of the book, metaphorically speaking.",
            "title_similarity": "0.6140709",
            "sentiment_compound": -0.1473
        },
        {
            "id": "hmjr7mo",
            "score": 1,
            "text": "Here's me still hanging out with my ex (he's one of my besties) and a bunch of colleagues from 15 years ago...",
            "title_similarity": "0.31475288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjrbmr",
            "score": 1,
            "text": "(coughs) Teachers save yourselves",
            "title_similarity": "0.5155351",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmjrigz",
            "score": 1,
            "text": "I’m really waiting for this to kick in for me. Sometimes I feel I haven’t really gotten over my ex enough.",
            "title_similarity": "0.57488143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjrqd2",
            "score": 1,
            "text": "When I was in the military there were so many times a person would not take leave bc they felt the place wouldn’t manage without them. But they need to remember everyone is replaceable and you need to look out for yourself first. There have been stories where someone didn’t go home for the 2 weeks aloud during deployment and ended up being killed. It’s so sad but goes to show that the mission will go on so take the leave, they will manage without you.",
            "title_similarity": "0.53104234",
            "sentiment_compound": -0.9255
        },
        {
            "id": "hmjrsi3",
            "score": 1,
            "text": "I guess you're right. I might as well follow in my father Genghis's footsteps.",
            "title_similarity": "0.49163064",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hmjrt8a",
            "score": 1,
            "text": "Unless you are either really good or reeeeeally bad historically.",
            "title_similarity": "0.41469252",
            "sentiment_compound": -0.079
        },
        {
            "id": "hmjs126",
            "score": 1,
            "text": "That is, unless 10 years later, someone digs up a comment you made while you were a different person and tries to make it like you're the absolute worst human to have existed for ever having an opinion that could have and will always be able to be changed because people are capable of learning and growing and deciding for themselves whether or not they want to still be part of this ever changing world.",
            "title_similarity": "0.57321036",
            "sentiment_compound": 0.1225
        },
        {
            "id": "hmjs3un",
            "score": 1,
            "text": "Also I think a lot of people assume it’s meant to be in your lifetime. \nNo you will die and 100 years later nobody will be alive to have ever known you. \n\nIt’s a very nihilistic thought, but I frees up the mind by so much",
            "title_similarity": "0.5311503",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hmjs5q0",
            "score": 1,
            "text": "I would have been all over this advice early in my life. Now I find it sad because of course I did attach much of myself to my job and the coworkers I considered friends.",
            "title_similarity": "0.5659121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjsaae",
            "score": 1,
            "text": "Sux when you allow yourself to think you are not alone",
            "title_similarity": "0.50286055",
            "sentiment_compound": 0.0361
        },
        {
            "id": "hmjscok",
            "score": 1,
            "text": "Tell that to my ex from 12 years ago. Actually she's backed off a bit the past couple years.\n I personally never forget anyone whose been apart of my life. It's detrimental and sucks. Making my current situation fucking hell.",
            "title_similarity": "0.51879936",
            "sentiment_compound": -0.7668
        },
        {
            "id": "hmjsf1n",
            "score": 1,
            "text": "I've wondered for a while how the internet has changed this - we've been able to keep in touch a lot longer with people who in the past would have drifted out of our lives. In some ways, this has been great - connecting with people we maybe never would have found or would have otherwise lost. But it also means we have a lot of pressure - pressure to keep in touch with people, to present a certain life if on social media, to remember names, important things, dates, which we could have left behind and moved on from in the past. I feel like this isn't so healthy. Maybe I'm just an inveterate introvert, but I struggle with it.",
            "title_similarity": "0.60223407",
            "sentiment_compound": -0.5131
        },
        {
            "id": "hmjsfck",
            "score": 1,
            "text": "I'm not so sure about that. There are plenty of people I've dated that I'd love to forget, but it never seems to happen.",
            "title_similarity": "0.5255906",
            "sentiment_compound": 0.1061
        },
        {
            "id": "hmjsipo",
            "score": 1,
            "text": "Unless you wrote most of the support documents and log book entries and how to fix stuff sheets. Then you'll be a legend after you're gone. Still don't attach your identity to your job.",
            "title_similarity": "0.66045994",
            "sentiment_compound": 0.4522
        },
        {
            "id": "hmjsj5n",
            "score": 12,
            "text": "Life pro tip where?",
            "title_similarity": "0.47760656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjslcq",
            "score": 1,
            "text": "My dad always taught it to me the best when leaving a job: “When you’re dead you’re gone, when you’re gone you’re dead”. \n\nIf you can help them anymore you might as well be dead.",
            "title_similarity": "0.68871963",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hmjso82",
            "score": 3,
            "text": "That’s probably a good thing lol. I was “let go” (politely fired) from a job, and people saw me run out crying lol. Plz forget that, that was not one of my best moments",
            "title_similarity": "0.59395057",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hmjspaq",
            "score": 1,
            "text": "When you said leave I thought you mean death",
            "title_similarity": "0.55022925",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hmjswfl",
            "score": 1,
            "text": "This is why I agreed to help the Mycenians wage war on Troy, this way I'll never be forgotten!",
            "title_similarity": "0.4689201",
            "sentiment_compound": 0.2163
        },
        {
            "id": "hmjswgc",
            "score": 1,
            "text": "You're not the main character in anybody else's story",
            "title_similarity": "0.5627539",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjsx5v",
            "score": 1,
            "text": "Personally none of that matters to me. I could care less what other people think. Treating people well as much as possible is all you have to do no matter if you remembered or not. But treating them well could help some to remember you even longer.",
            "title_similarity": "0.7302611",
            "sentiment_compound": 0.7701
        },
        {
            "id": "hmjt0wp",
            "score": 1,
            "text": "I never get why people say they want to be remembered. Who gives a fuck? Do or dont Im likely too dead to know either way so what does it matter.",
            "title_similarity": "0.61176974",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hmjt43g",
            "score": 1,
            "text": "I read this advice a lot but it doesn't make sense... if you have to post a LPT like this it means you want to change thinking/habits in some (or maybe a lot of) people... \n\nSo... if everyone will forget you when you leave there's no need to post this... because nobody is thinking about their past \"relationships\" with people.... the fact it's posted, and a lot of people agree with the LPT, shows more people than you expect don't forget and think about past experiences, relationships, friends and colleagues. I almost want to say everyone does, except for a few sociopaths. \n\nThis LPT makes you feel like you are the weak, nostalgic, emotional one thinking about others... but everyone does lol.\n\nDoesn't mean I don't agree with the LPT to enjoy your life the way you want and to build YOUR future.",
            "title_similarity": "0.7074376",
            "sentiment_compound": 0.9407
        },
        {
            "id": "hmjt4d0",
            "score": 1,
            "text": "“Out of sight, out of mind”",
            "title_similarity": "0.4393889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjt5p6",
            "score": 3,
            "text": "It's a wild ride to go from \"We're a family and we take care of each other no matter what\" to being locked out of your email account 3 minutes after turning in your resignation.",
            "title_similarity": "0.4969111",
            "sentiment_compound": 0.2325
        },
        {
            "id": "hmjtbsx",
            "score": 1,
            "text": "Why I don't forget people when they leave?",
            "title_similarity": "0.77734214",
            "sentiment_compound": 0.1195
        },
        {
            "id": "hmjthkg",
            "score": 1,
            "text": "This....is a .... \"Pro tip\"? Haha",
            "title_similarity": "0.38245755",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmjtl6f",
            "score": 1,
            "text": "Ahhhh yes, I too am a part of r/acid",
            "title_similarity": "0.23766518",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hmjtleh",
            "score": 1,
            "text": "Lemme tell you what frees my mind. Don’t sweat the small stuff, because almost everyone forgets even the big stuff after enough time. 20 years ago at a local school someone skinned an animal from the school farm and hung it up in the principals office. No one has mentioned it for 17 years. I can’t even remember if they caught the person. No one cares or bothers to remember because so much other stuff has happened in that time. Life moves on. Only toxic people will hold tiny stuff against you. Give yourself as many opportunities as you can in life and fail. Failures are what teach you.",
            "title_similarity": "0.4724244",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hmjtmvl",
            "score": 1,
            "text": "A belief, or a sect? Are you atheist?!",
            "title_similarity": "0.4163425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjtpi3",
            "score": 1,
            "text": "Wow! I really needed to read this today. A truth bomb that made me realize that too many people live in my head rent free!",
            "title_similarity": "0.5209005",
            "sentiment_compound": 0.7772
        },
        {
            "id": "hmjts5d",
            "score": 5,
            "text": "I dunno. People have left me and I'll never, ever, *ever* forget them.",
            "title_similarity": "0.63333666",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hmjtux7",
            "score": 1,
            "text": "I will be forgotten",
            "title_similarity": "0.616575",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmju2i5",
            "score": 1,
            "text": "Ekdum sahi baat bola hai bhidu",
            "title_similarity": "0.28910914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmju8ts",
            "score": 1,
            "text": "Depends on how you leave.",
            "title_similarity": "0.4967486",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hmjuhvt",
            "score": 1,
            "text": "This is an awful tip. What’s the point of anything if “you’re forgotten?” Geez.",
            "title_similarity": "0.4974684",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmjukkq",
            "score": 1,
            "text": "Idk I don’t realize like this tip. Maybe “move on from the past” or something better. I still remember all the relatives and friends and even past coworkers who’ve passed. \n\nMaybe this is good advice only for the workplace, sect, or cult but idk about relationships, especially personal ones.",
            "title_similarity": "0.73250055",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hmjurig",
            "score": 1,
            "text": "My workplace was entirely dependant on one woman. People joked that we couldn’t get by without her. \n\nShe had a chance at early retirement and left with only two weeks notice. It’s been six weeks and almost no one even says anything about her anymore. \n\nYou’re not important.",
            "title_similarity": "0.5206091",
            "sentiment_compound": 0.2025
        },
        {
            "id": "hmjuw5s",
            "score": 1,
            "text": "Work never forgets you. You become the scapegoat for years to come after you leave.",
            "title_similarity": "0.54862404",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hmjuym4",
            "score": 1,
            "text": "My soul mate who died eleven years ago? I don’t think i’ll ever stop grieving. I can’t move on, i’m taking that shit to the grave.",
            "title_similarity": "0.44388574",
            "sentiment_compound": -0.936
        },
        {
            "id": "hmjv2rd",
            "score": 1,
            "text": "I still talk to some of the people at my last job. One coworker said after I left the entire atmosphere changed and they still talk about me… a year later. It made me feel good hearing that",
            "title_similarity": "0.43707004",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmjv3mh",
            "score": 1,
            "text": "If you're forgotten after a relationship, you should probably worry about it. Either your ex has brain damage or you were a shitty lay.\n\nErrr... partner.",
            "title_similarity": "0.6560501",
            "sentiment_compound": -0.891
        },
        {
            "id": "hmjv44m",
            "score": 1,
            "text": "That’s gonna be a hard disagree from me, dawg.",
            "title_similarity": "0.42349106",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmjv9fk",
            "score": 1,
            "text": "And the speed at which people are forgotten by 95% of those they knew is scary.  So take special care of those you know will remember you the longest.",
            "title_similarity": "0.3925895",
            "sentiment_compound": 0.3274
        },
        {
            "id": "hmjvb79",
            "score": 1,
            "text": "Speak for your self. I know for a fact that if I ever leave my current job that they will remember me forever and tell new-comers of my legend.\n\nI even know what they will say.\n\n\"We had this one guy, Stealfur. Really wierd. Nice guy, but just real weird. Use to keep Triscuits in his pocket. And if you see any Jobs done by him double check it. Great guy but gotta mistakes.\"",
            "title_similarity": "0.60025495",
            "sentiment_compound": 0.5088
        },
        {
            "id": "hmjvxa2",
            "score": 1,
            "text": "Accept this LPT, but beware the existential crisis that comes with it.",
            "title_similarity": "0.6582628",
            "sentiment_compound": -0.705
        },
        {
            "id": "hmjvzi5",
            "score": 1,
            "text": "Idk. I left my old job at the start of this year and I still have people complaining to me about the guy that replaced me",
            "title_similarity": "0.49217856",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmjw6e4",
            "score": 1,
            "text": "I wish I could forget people that forget me.   \nIs there something wrong with me?   \nI always think of people who were once part of my life and sometimes even try to find them online to see what they are up to.",
            "title_similarity": "0.608989",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hmjwqtu",
            "score": 1,
            "text": "We just had a guy retire at my work. After a long winded announcement respectfully thanking him for his years of service and well wishes in his next chapter, another announcement keyed up about movement on the floor and life moved on in an instant. In that moment I realized this was special for him, but life doesn't stop and I've already forgotten his name.",
            "title_similarity": "0.59978366",
            "sentiment_compound": 0.5472
        },
        {
            "id": "hmjwuan",
            "score": 1,
            "text": "This single thought freed me over a decade ago, my life has been blessee since. Oh yeah the after life is just nothingness no heaven no hell just nonexistence.  Be well strange internet people.",
            "title_similarity": "0.49829257",
            "sentiment_compound": 0.7935
        },
        {
            "id": "hmjwuvm",
            "score": 1,
            "text": "She can forget me, I won't forget her 😊",
            "title_similarity": "0.6487825",
            "sentiment_compound": 0.0736
        },
        {
            "id": "hmjwvpi",
            "score": 1,
            "text": "All this thinking does is put me into an existential crisis where noting has meaning.",
            "title_similarity": "0.5357199",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hmjwyge",
            "score": 1,
            "text": "Noooo that’s what I’m scared of though!!!",
            "title_similarity": "0.41658407",
            "sentiment_compound": -0.5826
        },
        {
            "id": "hmjx30b",
            "score": 1,
            "text": "I'm not sure it's as clear cut as you're making it out to be. We had a colleague who died and 3 years later we still talk about her.",
            "title_similarity": "0.4191673",
            "sentiment_compound": -0.6202
        },
        {
            "id": "hmjx4r3",
            "score": 1,
            "text": "Strange.. I regularly wonder about people I haven't seen for a long time and who I've lost touch with since.\n\nIt's one thing to accept the notion of life changing and things never going back to how they were. It's a whole different story (and much more meaningful) if you can have a deep and impactful influence on someone that will last a lifetime. \n\nFor better or for worse, it makes part of who you are today.",
            "title_similarity": "0.6989176",
            "sentiment_compound": 0.2247
        },
        {
            "id": "hmjx58q",
            "score": 1,
            "text": "False: Source Jim \"Oh, *that* asshole\" Smith.",
            "title_similarity": "0.35552928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjx79q",
            "score": 1,
            "text": "This is bullshit. When I published my first paper as a grad student, my highschool physics teacher congratulated me, sent me a gift, and said he uses me as an example for his female students. My ex from highschool/undergrad messaged me for my birthday last month, we catch up occasionally. I'm still in touch with my undergrad physics professors, and when I get my first high paying job I'm going to donate to the department. I think of most of my exes fondly, and I definitely haven't forgotten about the bad one. Every relationship we have changes both parties in some way, and we carry a part of the other person with us for the rest of our life whether we know it or not. It's good to accept when people move on, and it's good to move on yourself when it's in your best interest. But don't discount the impact you can have on others.",
            "title_similarity": "0.36252964",
            "sentiment_compound": 0.7864
        },
        {
            "id": "hmjx9uz",
            "score": 1,
            "text": "Im pretty sure if you got up on your bosses desk and took a big shit, you'll be remembered for quite some time",
            "title_similarity": "0.42406777",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hmjxa44",
            "score": 1,
            "text": "I've learnt to just do whatever I want. I don't remember dumb stuff people did a week later. Why am I so special that people would remember me? Do what you want because in the end no one cares",
            "title_similarity": "0.691857",
            "sentiment_compound": 0.479
        },
        {
            "id": "hmjxfc6",
            "score": 1,
            "text": "I needed to see this today. Thank you 😊",
            "title_similarity": "0.4777522",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hmjxh7t",
            "score": 1,
            "text": "Live a good life. If there are gods and they are just, then they will not care how devout you have been, but will welcome you based on the virtues you have lived by. If there are gods, but unjust, then you should not want to worship them. If there are no gods, then you will be gone, but will have lived a noble life that will live on in the memories of your loved ones.",
            "title_similarity": "0.70159405",
            "sentiment_compound": 0.8326
        },
        {
            "id": "hmjy3d3",
            "score": 1,
            "text": "Upvoting at the same time hating this LPT because I know this is true yet I cannot help myself but to attach to anyone because I hate changes. But who am I? Change is inevitable and constant. I can accept changes but it will be a loooooong way.",
            "title_similarity": "0.6351734",
            "sentiment_compound": -0.5467
        },
        {
            "id": "hmjy4ij",
            "score": 1,
            "text": "Thank you, I really needed this today!!!",
            "title_similarity": "0.38402903",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hmjy519",
            "score": 1,
            "text": "Love what you do, love who you're with. Nothing else matters.",
            "title_similarity": "0.48193136",
            "sentiment_compound": 0.8529
        },
        {
            "id": "hmjy8xf",
            "score": 1,
            "text": "This is... uh, bad advice. You won't be forgotten, and you don't need to believe you will be in order to not attach your identity to a job. This kind of thinking will just leave you believing that your actions don't matter since after you're gone it'll be like you were mever there.",
            "title_similarity": "0.85900617",
            "sentiment_compound": -0.1551
        },
        {
            "id": "hmjycp7",
            "score": 1,
            "text": "Or a country/geographical area",
            "title_similarity": "0.2206816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmjyfkb",
            "score": 1,
            "text": "Do you think my ex  has forgotten me because she is all I think about",
            "title_similarity": "0.6676688",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmjyjx6",
            "score": 1,
            "text": "All true. 20 years on a job. Let go after going on long term disability. Not a peep from most of my coworkers to check on me. The job never acknowledged that I was let go. It's like I was Thanos snapped out of existence and no one cares. But i really dgaf. Just bolstering OP's post and to show a real world example for this thread.",
            "title_similarity": "0.57565093",
            "sentiment_compound": 0.0798
        },
        {
            "id": "hmjyla7",
            "score": 1,
            "text": "This loner shit isn't true, nor is it a great mindset to have",
            "title_similarity": "0.50017357",
            "sentiment_compound": -0.4822
        },
        {
            "id": "hmjysid",
            "score": 1,
            "text": "Where I used to work there were employees who were hard workers who did everything possible to help the company. Then the employees left (for other jobs), retired, moved to another state, died, etc. They all were quickly forgotten. Time moves on. Same with people. An unfortunate truth.",
            "title_similarity": "0.599404",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hmjyt49",
            "score": 1,
            "text": "I was in a restaurant the other day that had a wall covered with photos of famous actors from the early days of film. I didn't know who any of them were.\n\nThat's the reality. Very few people are remembered for more than a generation or two. I know nothing about my family past my great grandfather.",
            "title_similarity": "0.3624004",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmjz829",
            "score": 1,
            "text": "Yes! My gf and I were 2 weeks away from each other, when she started an affair. We were still in the relationship and didn't had a rough last time. The distance made it so easy for her to cheat. Now she is my ex and getting my mind of of her is so damn hard.",
            "title_similarity": "0.4592026",
            "sentiment_compound": -0.2548
        },
        {
            "id": "hmjzba4",
            "score": 1,
            "text": "You might be, but you might not be. There is no perfect replacement for you even if your role can be replaced. People will remember you, people do remember you, you matter. Just, that shallow version of you only fulfilling a role? They'll probably forget that.",
            "title_similarity": "0.7611978",
            "sentiment_compound": -0.7349
        },
        {
            "id": "hmjzhod",
            "score": 1,
            "text": "Ngl I think I missed the “move on and forget” gene bc I have never forgotten or moved on in my life. Everyone still has my undying loyalty or eternal grudge even if we don’t talk anymore",
            "title_similarity": "0.5442894",
            "sentiment_compound": 0.4526
        },
        {
            "id": "hmjzi0e",
            "score": 1,
            "text": "I saw Coco, fuck being forgotten!",
            "title_similarity": "0.45119375",
            "sentiment_compound": -0.69
        },
        {
            "id": "hmjzl4d",
            "score": 1,
            "text": "There is a comfort for me in knowing how insignificant we really are in the enormity of the universe, we are a speck in time. Therefore we should spend our time enjoying life and loving each other, because nothing really matters when you consider how insignificant we all are! We may as well enjoy ourselves during our fleeting moments.",
            "title_similarity": "0.6454673",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hmjzm00",
            "score": 1,
            "text": "I literally had this realization 2 days ago. I am 25 and I haven’t figured out “what I want to do” both of my brothers are successful by societies standards whereas I’ve been jumping from job to job. Experiencing new things and living in different places. Over the last couple of years I’ve been putting an unhealthy amount of pressure on myself to settle down into a career. \n\nI started working on a farm a little over a month ago and it has been a life changing experience. I have learned more about myself and my identity in the last month than I have in my adult life. I’ve learned there’s a much larger picture than what society leads on. I was always told success means owning a house, owning a car, having a career, and all that. That’s not the lifestyle I feel like I’m meant to live and I’ve been trying to force myself into this mold.\n\nI have drastically simplified my lifestyle, canceling all subscriptions, selling anything I didn’t need, no eating out, and getting to sleep early. No tv, no processed food, no unnecessary spending. I bike everywhere I go, a majority of the food I eat is from the farm, and my living situation is extremely cheap. \n\nI have never been happier in my life. I wake up and go to sleep fulfilled every single day. This attitude, mentally, philosophy, or whatever you want to call it is the true key to happiness and success in my opinion.",
            "title_similarity": "0.3801744",
            "sentiment_compound": 0.9083
        },
        {
            "id": "hmjzugf",
            "score": 1,
            "text": "Worst feeling in life is thinking about people that you know arent thinking about you.",
            "title_similarity": "0.5709996",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmjzw4l",
            "score": 1,
            "text": "Not if i forget them first",
            "title_similarity": "0.5862568",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hmk05sf",
            "score": 1,
            "text": "Eh, not really true at my last job. I was a restaurant manager that was well liked. Now as a brewery sales rep that has that restaurant in my territory. I am a huge distraction even 3 years later any time I have to stop in. Kinda sucks, but also good to be remembered fondly for a bit I suppose.",
            "title_similarity": "0.3807496",
            "sentiment_compound": 0.7919
        },
        {
            "id": "hmk0bjo",
            "score": 1,
            "text": "Good philosophy to live by, but not really true. Legends are made every day.",
            "title_similarity": "0.533563",
            "sentiment_compound": -0.3342
        },
        {
            "id": "hmk0mh9",
            "score": 1,
            "text": "[Simple solution](https://m.youtube.com/watch?v=AYURxfaTdpY)",
            "title_similarity": "0.42464948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk0nou",
            "score": 1,
            "text": "so i can just die right now? people will just move on and i dont have to ccare about them at all and just go ahead with it? damn thanks thats such a good DieProTip!",
            "title_similarity": "0.7633781",
            "sentiment_compound": -0.351
        },
        {
            "id": "hmk0q8f",
            "score": 1,
            "text": "Who I have sects with is none of your business, OP.",
            "title_similarity": "0.51259863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk0rmd",
            "score": 1,
            "text": "I graduated high school in 2001. I'm hyper attentive to some things so I remember so many people as if it were yesterday. When I bump into someone I remember them as if it were yesterday. I have yet to meet a single person from high school that remembers me. Not one (other than the few I've kept in touch with).\n\nWe're all the main characters in our own story, but our significance in others' stories is so much lower than we realize.",
            "title_similarity": "0.43002474",
            "sentiment_compound": -0.145
        },
        {
            "id": "hmk0tmy",
            "score": 1,
            "text": "Ok so I stopped working at Starbucks 4 years ago, and only 2 baristas that I worked with still work there and yet for some reason, almost all the baristas that I’ve never even worked with seem to know my name when I go there...\n\nI would like to think it’s true that no one remembers me and often I do to feel better but I think spending every day with people over a long period of time has got to leave some form of lasting impact unless you’re silent and antisocial and even at that point it turns into, “remember that weird kid that never talked to anyone for the 6 months he was here?”",
            "title_similarity": "0.48796642",
            "sentiment_compound": 0.1682
        },
        {
            "id": "hmk0ucc",
            "score": 1,
            "text": "I disagree, people that are exceptional (for good o for bad) tend to be remembered; so: shure relax (unless you want to actually made a difference in the world)",
            "title_similarity": "0.69030964",
            "sentiment_compound": 0.0717
        },
        {
            "id": "hmk15po",
            "score": 2,
            "text": "Nobody thinks of you as much as you think of yourself.\n\nI love being a nobody",
            "title_similarity": "0.5379104",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hmk16dh",
            "score": 1,
            "text": "this sub has the worst advice ever holy shit.  \n\nLPT dont worry about raising your kids, one day they'll forget all about you.  Forget about those artistic pursuits, your creations will never have any amount of permanence or influence.  That guy drowning in a river?  Why try to save em, one day it'll be like they never existed, might as well speed it up.",
            "title_similarity": "0.60911787",
            "sentiment_compound": 0.0788
        },
        {
            "id": "hmk1g6q",
            "score": 1,
            "text": "Wow this is such great advice. I’ve been making many many choices in my life based on duty to others and loyalty, and ignoring / suppressing what I really want for many years. Thank you 🙏",
            "title_similarity": "0.43952706",
            "sentiment_compound": 0.9152
        },
        {
            "id": "hmk1j0n",
            "score": 1,
            "text": "This isn't really a protip. I mean it applies to everything. If taken to its logical extreme then why even try because when you die you're going to be forgotten.  Even a famous person isn't really going to be remembered. People are just going to remember a few facts that might not even be true.\n\nI would offer a counter protip. If you're going to do something, do it. Don't half ass things.\n\n I'm not saying you have to invest a 100% of your energy in any single thing. That's obviously stupid and impossible. \n\n But if you're going to get a job or career or whatever, do it.  If you're going to do something, do a good job doing it.  If you're not even going to bother, then don't waste everyone's time.",
            "title_similarity": "0.7298984",
            "sentiment_compound": 0.1172
        },
        {
            "id": "hmk1o6r",
            "score": 1,
            "text": "not if you build a giant pyramid monument for everyone to remember you by",
            "title_similarity": "0.37632293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk1qx4",
            "score": 1,
            "text": "I'm forgotten when I'm still in the room lol.\n\nI live my life in a way that when I'm gone I'm a pleasant memory that puts a smile on my friends/families faces.",
            "title_similarity": "0.5568074",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hmk283c",
            "score": 1,
            "text": "But people will never forget if you are an asshole all the time.",
            "title_similarity": "0.5008947",
            "sentiment_compound": 0.2498
        },
        {
            "id": "hmk2g8b",
            "score": 1,
            "text": "You're right. Still havent fully moved on from my old job. I just thought that people would not forget me, we worked 7 years together...\n\nThat is the worst feeling. I have not let them go, but they have let me go.",
            "title_similarity": "0.5706901",
            "sentiment_compound": -0.2422
        },
        {
            "id": "hmk2gpw",
            "score": 1,
            "text": "All things must pass",
            "title_similarity": "0.38504305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk2j9d",
            "score": 1,
            "text": "This is somewhat true. Sometimes I think of and hear a great pun and want to share it with one of my friends out of habit. He's been dead for years. I think a sad thought when that happens.",
            "title_similarity": "0.4818833",
            "sentiment_compound": 0.5868
        },
        {
            "id": "hmk2v1a",
            "score": 1,
            "text": "Somewhat related: fuck two weeks notice, if you're not planning on using your employer as a reference, and you aren't satisfied there, just leave when you want. You owe them literally nothing.",
            "title_similarity": "0.6852814",
            "sentiment_compound": -0.6655
        },
        {
            "id": "hmk32fi",
            "score": 1,
            "text": "I wish my old boss would forget me.  I quit March 2020 and moved to another state.  He has asked me to come back a half dozen times.",
            "title_similarity": "0.46375075",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hmk34a5",
            "score": 1,
            "text": "or, much more commonly, another person.",
            "title_similarity": "0.3709788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk38cy",
            "score": 1,
            "text": "Toxic workplaces are just as common as toxic employees. My experience has taught me that once I am continuously dreading going to work, it's time to apply for new jobs. The same is true for careers. As we age, we all change; if you don't enjoy your career anymore, you may wish to change careers.There is no reason to be miserable for 40 hours a week, 52 weeks a year, year after year.",
            "title_similarity": "0.6173266",
            "sentiment_compound": -0.7121
        },
        {
            "id": "hmk3i1u",
            "score": 1,
            "text": "\"No one cares\".\n\nAsk yourself this question: How many times do you think about past work relationships?\n(that's the amount of time people are thinking about you).\n\nSo live your life.",
            "title_similarity": "0.67576027",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmk3jxj",
            "score": 2,
            "text": "ITT: People who don't want to be forgotten",
            "title_similarity": "0.6718154",
            "sentiment_compound": -0.2783
        },
        {
            "id": "hmk3l1a",
            "score": 1,
            "text": "It made me realise that ultimately I’m of no worth to anyone and I should just stop trying to get people to care",
            "title_similarity": "0.7004278",
            "sentiment_compound": 0.0859
        },
        {
            "id": "hmk3wui",
            "score": 1,
            "text": "This LPT is completely wrong and it’s a dangerous mindset",
            "title_similarity": "0.30158046",
            "sentiment_compound": -0.7574
        },
        {
            "id": "hmk42zc",
            "score": 1,
            "text": "Damn this hit hard",
            "title_similarity": "0.1461494",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hmk4am3",
            "score": 1,
            "text": "Every relationship you have, there is a small piece of your heart that will always remember that person.",
            "title_similarity": "0.39283764",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hmk4bfv",
            "score": 1,
            "text": "yeah it doesn't work for me i guess  \nstarted chatting with my ex recently and she couldn't stop telling others 'bout me for like 2 years or so when i was trying to forget about her",
            "title_similarity": "0.49531546",
            "sentiment_compound": 0.5702
        },
        {
            "id": "hmk4d64",
            "score": 1,
            "text": "Good advice, but not buying that you will be forgotten; at least not immediately. There are many former co-workers, relationships, and deceased friends and family I still think about, some everyday.",
            "title_similarity": "0.6143843",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hmk4h0q",
            "score": 1,
            "text": "I fuckin' love Buddhism",
            "title_similarity": "0.35485277",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hmk4oe7",
            "score": 3,
            "text": "you’re insignificant in every single way, in other news the sky is blue. people who need things or fairy tales to identify with to make them believe they’re part of “something bigger” just simply can’t cope with the reality of being insignificant. not their fault, leave them be.",
            "title_similarity": "0.511186",
            "sentiment_compound": -0.3387
        },
        {
            "id": "hmk4s8v",
            "score": 1,
            "text": "needed this today .. thank u",
            "title_similarity": "0.4660461",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmk5621",
            "score": 1,
            "text": "I left a job in IT where I had made an excel sheet that formats SQL insert statements. Years after I left I bumped into an ex collegue, they still use \"u/Special_KC's excel sheet\".\n\nNot sure where OP is coming from, but legacy also eint a bad thing.",
            "title_similarity": "0.44335306",
            "sentiment_compound": -0.4991
        },
        {
            "id": "hmk5947",
            "score": 1,
            "text": "Welcome to depression! A place where nothing matters anyways...",
            "title_similarity": "0.55961585",
            "sentiment_compound": -0.2654
        },
        {
            "id": "hmk5bfh",
            "score": 1,
            "text": "Or a political party  god knows how many fools attach themselves to politicians that only see them as a vote every 2 to 4 years.",
            "title_similarity": "0.2658652",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hmk5hoi",
            "score": 1,
            "text": "Cool. So I'm completely inconsequential. Thanks.  I can't wait to keep living.",
            "title_similarity": "0.6330143",
            "sentiment_compound": 0.6682
        },
        {
            "id": "hmk5i7u",
            "score": 1,
            "text": "If you are my ex, know that this doesn't apply to you.",
            "title_similarity": "0.68695486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk5rzg",
            "score": 1,
            "text": "Um no, not always. There are plenty of people i met decades ago, haven't seen for ages but still think about them randomly. I would agree with rephrasing \"don't care much about what your up to\", but not always completely forgotten. But your core message still holds up one way or another specifically for job contacts",
            "title_similarity": "0.5314176",
            "sentiment_compound": 0.2806
        },
        {
            "id": "hmk5z69",
            "score": 1,
            "text": "Saving this so I can read it again every once in a while. Needed this shit.",
            "title_similarity": "0.547699",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hmk65xj",
            "score": 1,
            "text": "Unless you're really famous. People will talk about how they worked alongside you or the time they were friends with you. When you die, many strangers will continue to consume what you left behind.",
            "title_similarity": "0.558157",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hmk663u",
            "score": 1,
            "text": "This might be true for a workplace or even a friend or ex significant other. However I will never forget my mom, I will never forget my dad. And I truly hope I’m doing a good enough job that my children will never forget me.",
            "title_similarity": "0.5748909",
            "sentiment_compound": 0.9552
        },
        {
            "id": "hmk6fb9",
            "score": 1,
            "text": "Dude 2 job hops in a year and the mf who i was trying to get away from litterly message me within a week asking about it. Must be nice getting people to ignore you.",
            "title_similarity": "0.50371206",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hmk6fcb",
            "score": 1,
            "text": "When you think: \"I cant quit for a different job, they need me here etc etc...\"\n\nJust remember the last time you took time off and how it just kept going without you.",
            "title_similarity": "0.7036414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk6fh5",
            "score": 1,
            "text": "This is good wisdom. We are all dust in the wind.",
            "title_similarity": "0.3613177",
            "sentiment_compound": 0.743
        },
        {
            "id": "hmk6kwx",
            "score": 1,
            "text": "Company loyalty in your professional life is the number one way to ensure you stay underpaid and over worked. Don’t ever hesitate to jump ship for better pay, benefits, and/or hours\n\nA business will almost never be loyal towards you if it benefits them to do otherwise. There’s no reason to be loyal to them if it would benefit you to do otherwise",
            "title_similarity": "0.66430223",
            "sentiment_compound": 0.9275
        },
        {
            "id": "hmk6q3b",
            "score": 1,
            "text": "I mean...it depends, especially for work in my experience at least,people from a previous job I had still miss me and that's because it was a nice job with mostly  nice people and still is with some issues that I was having personally so that's why I left,but they miss me and I am lucky enough to have those people in my life and go out with them from time to time which I enjoy and appreciate",
            "title_similarity": "0.5345982",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hmk6usa",
            "score": 1,
            "text": "This is not true. Many, many people don't forget anything. Ever.",
            "title_similarity": "0.47141737",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hmk6xyl",
            "score": 1,
            "text": "Idk, my job still talks about people who e left like high school kids",
            "title_similarity": "0.49657384",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hmk705v",
            "score": 1,
            "text": "This advice is a double edge sword. For example: let's say you're married with children, probably not a great idea to simply focus on yourself and not worry about what the other people who are immediately involved in your life think of you. As a child of parents who got divorced, please worry about what your children think of you. \n\nThis advice is a great way to have continuously shitty jobs without pay increases.\n\nThis advice is great if you don't like having friends. \n\nI personally would like to think that people will remember who I am. \n\nBased on how I treat my family and friends. Based on my work ethic and reliability. Based on my willingness to help others. \n\nOf course focusing on yourself is incredibly important but yeah, going through life doing whatever you want because you think nobody will remember is going to get you just that. Nothing.",
            "title_similarity": "0.6801145",
            "sentiment_compound": 0.8783
        },
        {
            "id": "hmk746c",
            "score": 1,
            "text": "Live your life for yourself! The trick to make empathy a self-centered trick. You don’t live others, you live a self-centered life where helping others is a boon to your own well-being.",
            "title_similarity": "0.714611",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hmk76w9",
            "score": 1,
            "text": "Everyone has two deaths:\n\n-The death of their body\n\n-The last time someone talks about them",
            "title_similarity": "0.37993073",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hmk799v",
            "score": 1,
            "text": "That’s why I print out giant posters of myself in black and white and put them up in places I’m leaving.",
            "title_similarity": "0.25691643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmk7e6x",
            "score": 1,
            "text": "But there’s social media.  Always a chance to post an update and count the votes.",
            "title_similarity": "0.3490362",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmk7f2s",
            "score": 1,
            "text": "Yeah, I forgot about my dead dad so long ago. \n\nDad, if you’re reading this I moved on and don’t even think twice about you. /s\n\nLol what fucking nonsense to tell someone they’ll be forgotten after they die.",
            "title_similarity": "0.69404364",
            "sentiment_compound": -0.8439
        },
        {
            "id": "hmk7mzt",
            "score": 1,
            "text": "Absolutely false. I've worked in some great places years ago and continue to have friendships with my former coworkers to this day.\n\nIf you work in a cancerous shithole then I agree, but not every workplace is one.",
            "title_similarity": "0.44591975",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmk7rfg",
            "score": 1,
            "text": "So, you’re advocating classical Epicureanism. Not a bad idea.",
            "title_similarity": "0.47581276",
            "sentiment_compound": 0.431
        },
        {
            "id": "hmk84ml",
            "score": 1,
            "text": "It's funny how much people will argue against this when you point it out.",
            "title_similarity": "0.52763903",
            "sentiment_compound": 0.128
        },
        {
            "id": "hmk8hod",
            "score": 1,
            "text": "commenting to show this to my partner later who's on month 8 of maternity leave and feeling down about how her colleagues haven't reached out much to see how she and the baby are doing.",
            "title_similarity": "0.4790699",
            "sentiment_compound": 0.001
        },
        {
            "id": "hmk8kc2",
            "score": 1,
            "text": "What about those of us who are incapable of forgetting, then what?",
            "title_similarity": "0.61958516",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hmk94ci",
            "score": 1,
            "text": "Nah, not really. Good and bad people are remembered by those around them, question is ehy do they remember you? For the good you brought into their lives or for the bad.",
            "title_similarity": "0.5361113",
            "sentiment_compound": -0.8119
        },
        {
            "id": "hmk9bzm",
            "score": 1,
            "text": "Absolutes are so fucking useless. \n\nI left a religion more than a decade ago and the members still reach out to my family to ask how I'm doing. \n\nI don't understand why people post such useless universals to LPT. This shit doesn't follow the rules",
            "title_similarity": "0.4992412",
            "sentiment_compound": -0.8839
        },
        {
            "id": "hmk9hii",
            "score": 1,
            "text": "Nah, once a Catholic always a Catholic baby",
            "title_similarity": "0.32975093",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmk9lpt",
            "score": 1,
            "text": "People forget me when I’m still there",
            "title_similarity": "0.68950427",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmk9mdd",
            "score": 1,
            "text": "Yup.  Everybody is unimportant and replaceable.  Everybody.",
            "title_similarity": "0.3891285",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmk9vf6",
            "score": 1,
            "text": "If I can remember, they can too",
            "title_similarity": "0.36843833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmka1ec",
            "score": 2,
            "text": "How many people remember their great-grandparents' name? I can't, to be completely honest. For me, that really puts things in perspective.",
            "title_similarity": "0.49633378",
            "sentiment_compound": 0.5563
        },
        {
            "id": "hmka1x8",
            "score": 1,
            "text": "This actually is painful truth i learned and I am depressed that I moved on so easily than i thought when i lost a dear family member. I thought i was dying with sorrow when it happened, but i moved on. I wonder if I disappear, people will be sad but will move on eventually. and I would not matter anymore. This is probably true, and it is eating me inside out.",
            "title_similarity": "0.6492337",
            "sentiment_compound": -0.6545
        },
        {
            "id": "hmka5p3",
            "score": 1,
            "text": "I think people will remember you. It’s just you won’t know when they talk about you or think about you.",
            "title_similarity": "0.731359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmka712",
            "score": 1,
            "text": "This is… just not true? People don’t just ‘forget’ about you constantly. People remember. Just because someone has moved on with their life doesn’t mean they’ve forgotten you, that’s not how people work.\n\nSure people will forget you in like, 100 years… but that’s not in the here and now. That’s later.\n\nReading this post just made me feel bad and quite frankly, like nothing matters. Which isn’t true. You have an impact on people, and life moving on doesn’t change that.\n\nI don’t think I’m important, and I never did, but I’m still alive. As long as you’re alive you’re leaving an impact on someone. What should motivate you to creating an identify outside of jobs and beliefs is exactly that, people can SEE you. People will ALWAYS see you. There is no ‘removing yourself’ from things completely unless you never leave the house and never interact with anyone again. You can’t hide away and birth anew. You have to do things and experience things because no one else will do it for you. No one else is going to change you for you.",
            "title_similarity": "0.78177714",
            "sentiment_compound": 0.8081
        },
        {
            "id": "hmkadbh",
            "score": 1,
            "text": "I have a hard time understanding why anyone cares about this fact. Make the most of your time hear, how you treat others and carry yourself, nothing matters after you’re dead. That’s the beauty of being dead.",
            "title_similarity": "0.7339959",
            "sentiment_compound": -0.1466
        },
        {
            "id": "hmkafs7",
            "score": 8,
            "text": "Dope, I'ma go hit that bridge nearby, it's been needing a little attention.",
            "title_similarity": "0.486677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmkahp1",
            "score": 1,
            "text": "I did some self exploration when I was younger, and one thing that helped me a lot is similar to this:\n\n>The only person that is guaranteed to be there for my whole life is myself, so I better do my best to take care of myself in order to ensure I can be healthy and happy.\n\nIt helped me a lot with detaching my identity from the people and things I had in my life, and really allowed myself to open up and explore what I really wanted in life.\n\n\nI also love the poem by Shel Silverstein:\n\n> He had blue skin, and so did she\n\n>She kept it hidden, and so did he.\n\n>They searched for blue their whole lives through\n\n>Then passed right by, and never knew.\n\nTake care of yourself. Be yourself. And the rest will fall into place.",
            "title_similarity": "0.55317354",
            "sentiment_compound": 0.9721
        },
        {
            "id": "hmkalp0",
            "score": 1,
            "text": "Helps me move closer to ending everything ✌️",
            "title_similarity": "0.6894039",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmkb8jq",
            "score": 1,
            "text": "Thought I had been forgotten but apparently I’ve had 3 visits to my classmates profile in the past year.",
            "title_similarity": "0.35830626",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hmkbowl",
            "score": 1,
            "text": "No, you won't be. I assure you I remember and miss people from old jobs, old relationships, and people who died.",
            "title_similarity": "0.64396465",
            "sentiment_compound": -0.738
        },
        {
            "id": "hmkc3ln",
            "score": 1,
            "text": "I absolutely love this piece of advice.\n\nI went through my 20's working for a local government agency in IT with quite a high level of responsibility.  It made me feel like I was valued and important and I stayed there far too long stalling my career progression.\n\nThe people that sat around doing the least amount of work possible were always jealous because I was given decent projects for the effort and systems I delivered and often tried to sabotage or make various things difficult.\n\nWhen government cuts came, all of this was worthless.  In fact I was less than worthless because I was a greater saving than those that sat at their desks for the last decade doing the least amount of work possible.\n\nI took my redundancy, was in a new job before my redundancy date and didn't really stay in a role for more than 3 years following this and my career, finances and family life was much better for it.\n\nI keep in touch with a few people from time to time and the place carried on perfectly fine without me, albeit delivering things a little slower, which suited their new budget.\n\nThis was a lesson I wished I'd learned in my 20's.  Everywhere will be absolutely fine without me.  They'll carry on differently.  Don't put all your effort into things that don't put the effort back into you.  That's your family, friends, your house, hobbies and all the proper important things.",
            "title_similarity": "0.39699867",
            "sentiment_compound": 0.8925
        },
        {
            "id": "hmkcgpn",
            "score": 1,
            "text": "Bold of you to assume I'm not going to have all of the members who are level 6 and below drink the Kool-Aid before I do.",
            "title_similarity": "0.47169453",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmkcxff",
            "score": 1,
            "text": "Thanks, I really wanted an existential crisis today.",
            "title_similarity": "0.5064835",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmkcyfm",
            "score": 1,
            "text": "Truly I don’t give a single fuck if people remember me or not. The two main things I care about are being the best dad I can be to my girls and hopefully leaving them with a good inheritance when I pass.",
            "title_similarity": "0.5858163",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hmkcz75",
            "score": 1,
            "text": "I disgree.. There are people in my life that I'll remember forever. Some good, some bad.  The good ones, I'll remember fondly. The bad ones, I'll learn from.",
            "title_similarity": "0.57495433",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmkd0hs",
            "score": 1,
            "text": "I cant get out of a relationship because i do think and i cant let people feel bad for my actions or in this case breaking up with her…",
            "title_similarity": "0.6636059",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmkd27y",
            "score": 1,
            "text": "I can vouch for this LPT 100%. I recently left a job of seven years at a small company (~25 people), many of whom I got on with very well and would consider friends. The only person I've heard from since I left is the colleague I was closest to, as we just kept chatting on social media outside of work like we've done for years. Not a single other person reached out to see how I was getting on. The owner of the company didn't even reply to my notice email, not a single word for my efforts over the last seven years.\n\n\nDon't waste a moment thinking about the people you leave behind.",
            "title_similarity": "0.40280056",
            "sentiment_compound": 0.8599
        },
        {
            "id": "hmkd8xp",
            "score": 1,
            "text": "I disagree. Loved ones will not be forgotten if they leave life.",
            "title_similarity": "0.69901556",
            "sentiment_compound": 0.4149
        },
        {
            "id": "hmkdb2v",
            "score": 1,
            "text": "I WII NOT GO QUIET INTO THAT DARK NIGHT!\n\n(Yes it is not the Dylan Thomas quote but damn near)",
            "title_similarity": "0.47062293",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hmke0x5",
            "score": 1,
            "text": "Alternatively, understand that community and relationships are an essential part of a healthy existence for most people. Yes, you need to be able to move on when necessary. But also, value those things for what they are. Communities aren’t always easy to find and grow to be a part of.",
            "title_similarity": "0.53771573",
            "sentiment_compound": 0.8686
        },
        {
            "id": "hmke4ai",
            "score": 1,
            "text": "Thanks. Just left a relationship. Feelsbadman.jpg",
            "title_similarity": "0.6082364",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmke5ow",
            "score": 1,
            "text": "*\"I wish I'd spent more time in the office\"*, said no-one on their deathbed.",
            "title_similarity": "0.519928",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hmke67m",
            "score": 1,
            "text": "Ozymandias does not agree",
            "title_similarity": "0.2829669",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hmke9o0",
            "score": 1,
            "text": "I was born and raised in Toronto, spent 35+ years of my life there until I moved west. I had friends there, my favorite pubs and restaurants and still I knew the very large city like the back of my hand.\n\nI went back when my Mother passed and I attended the funeral. I was like a stranger in the very place I grew up in. Restaurants had changed. Shopping malls had been torn down and replaced by housing. The GM factory which employed many of my friends was now an outlet mall. The list goes on. The pub where I used to spend too much time and money in, the one \"where every one knows your name\" didn't know me.\n\nI think everyone seems to think that as *your* life changes, everything else in the world is going to remain static. I don't know which was actually sadder, burying my Mother or seeing my childhood buried as well.",
            "title_similarity": "0.3257917",
            "sentiment_compound": 0.8971
        },
        {
            "id": "hmkefa6",
            "score": 1,
            "text": "Already feeling forgotten by some people. Even with some of my friends. It's harsh for people like me who tend to get attached to others. Like, really hard. Moreso when you don't manage to make any new acquaintances.",
            "title_similarity": "0.56945366",
            "sentiment_compound": 0.4779
        },
        {
            "id": "hmkeh5y",
            "score": 1,
            "text": "Lol relationships? I think about my first love every day whether I want to or not.",
            "title_similarity": "0.44110066",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hmkehjb",
            "score": 1,
            "text": "How about family? Even if I slice my parents out of presence around me, the memories will be there forever.",
            "title_similarity": "0.6411836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmkelfs",
            "score": 1,
            "text": "That is exactly what I came up with! It's a freeing experience to actually understand that a) you will die and b) life will *not* stop after that \nIt gives you a perspective to actually live a life you want, because other people don't really care how you look or what you do. Only you matter",
            "title_similarity": "0.75708187",
            "sentiment_compound": -0.3917
        },
        {
            "id": "hmkeopi",
            "score": 1,
            "text": "Just left a job of 8 years that I poured myself into and after 3 days it's like I was never there. It makes me feel a bit silly that I was trying so hard only to be forgotten within literal days.\n\nMove on to a better workplace though so that's a positive!",
            "title_similarity": "0.5758306",
            "sentiment_compound": 0.7839
        },
        {
            "id": "hmkevwo",
            "score": 1,
            "text": "You've clearly never been the guy who took a dump in the fish tank.",
            "title_similarity": "0.38661307",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hmkexlg",
            "score": 1,
            "text": "LPT: live your life before retirement\n\nEvery single colleague that retired in the last years didn‘t made it trought his first year.",
            "title_similarity": "0.48730814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmkfe62",
            "score": 1,
            "text": "My former employer hasn't forgotten me.  All of my replacements have quit.",
            "title_similarity": "0.5456223",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hmkfohv",
            "score": 1,
            "text": "I made a Tinder last week and almost immediately matched with an ex from years ago. I remember her existence (we dated 9ish years ago and I've been in two serious relationships since then) but otherwise I don't remember a thing about her.\n\nDuring our conversations though I realized she remembers everything about me. Even really unimportant details. I'm talking about like my favorite deli to get breakfast. Again we broke up around 8-9 years ago and I honestly can't even remember why or how. I told her I can't remember anything about our time together and she understands. She just said I made such an impact on her. She's had one serious relationship since then and I wouldn't even consider what we had serious.\n\nSo yeah, some people remember relationships and some people don't. This LPT is kind of crap unless you're talking about a job.",
            "title_similarity": "0.42730463",
            "sentiment_compound": 0.4714
        },
        {
            "id": "hmkfwoc",
            "score": 1,
            "text": "Fuckkk. This hits like a brick.",
            "title_similarity": "0.20992324",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmkggqe",
            "score": 1,
            "text": "I feel bad for OP. this person has some real social issues. We still talk about people we use to work with and how much we miss them or how some things went to shit without them.If you are a good fun person people will always miss you.",
            "title_similarity": "0.5463545",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hmkgrvn",
            "score": 1,
            "text": "No offense to OP, but I feel like this is really bad advice, and just not true. Everyone has lasting legacies, and they do matter.",
            "title_similarity": "0.56414336",
            "sentiment_compound": -0.6616
        },
        {
            "id": "hmkgsa8",
            "score": 1,
            "text": "What are you talking about? My last job put a framed picture of me up so they wouldn't forget me. \n\n^I'm ^no ^longer ^allowed ^on ^the ^premises.",
            "title_similarity": "0.63374114",
            "sentiment_compound": 0.2334
        },
        {
            "id": "hmkh6eg",
            "score": 1,
            "text": "Funny, i always seem to be the one to forget old colleagues, friends, whatever first and be the one to let down the other. TIL IATA.",
            "title_similarity": "0.5994525",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmkh9w5",
            "score": 1,
            "text": "Then why can’t I forget?",
            "title_similarity": "0.5577989",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmkhjff",
            "score": 1,
            "text": "thank you. I really needed to hear this today.",
            "title_similarity": "0.42464793",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmkhumj",
            "score": 1,
            "text": "It's true that we are replaceable at work and in many other settings.  But we're not replaceable in our families.  There is no way I'm going to sacrifice family time for work.",
            "title_similarity": "0.71013206",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmkijqk",
            "score": 1,
            "text": "Normal people have maybe 50-70 years of *anyone* really remembering them after they die. Most of us will be forgotten in less time than we lived. \n\nSo maybe it’s ok to care a little less about the stressful things.",
            "title_similarity": "0.5743098",
            "sentiment_compound": -0.4892
        },
        {
            "id": "hmkil2y",
            "score": 1,
            "text": "Normal people have maybe 50-70 years of *anyone* really remembering them after they die. Most of us will be forgotten in less time than we lived. \n\nSo maybe it’s ok to care a little less about the stressful things.",
            "title_similarity": "0.5743098",
            "sentiment_compound": -0.4892
        },
        {
            "id": "hmkio7w",
            "score": 1,
            "text": "Some people are not forgotten.",
            "title_similarity": "0.38419205",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hmkiyds",
            "score": 1,
            "text": "Exactly. Given those premises you should jump off a bridge too. Holy shit. Get your depression a blowjob.",
            "title_similarity": "0.3906515",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hmkj5a1",
            "score": 1,
            "text": "Let go your earthly tether. Empty, and become wind.",
            "title_similarity": "0.54141086",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hmkjdwg",
            "score": 1,
            "text": "been on this tip for a long time. Pride is the devil. In 1,000,000 years NOTHING will be here. This planet would have cleansed itself from the virus we humans are to it. We may not make it as a civilization that long. All there will be is a spec in all of space that's just floating around. All this trying to leave a name behind that will mean nothing in the life span of this universe.",
            "title_similarity": "0.5202412",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hmkjkl9",
            "score": 1,
            "text": "You could have just stopped at “you will be forgotten”. Nothing else.",
            "title_similarity": "0.71741945",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmkjltb",
            "score": 1,
            "text": "PFT, I'm already forgotten in most ways. We are but a vapor and our time on earth very brief.",
            "title_similarity": "0.4696802",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hmkjpz9",
            "score": 1,
            "text": "Without question one of the worst posts I've seen in over a decade on this site.",
            "title_similarity": "0.3090405",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hmkjt7k",
            "score": 1,
            "text": "I retired in 12/19 from 32 years of service.  it was way hard to not care about the program anymore. But, from watching 32 years of people leaving and the program marching on, I was ready to disconnect. \n\nNow all I care about is my little household.",
            "title_similarity": "0.5793515",
            "sentiment_compound": 0.7605
        },
        {
            "id": "hmkjtnu",
            "score": 1,
            "text": "Eventually, maybe. But this year, when my ex-OH commited a crime because of his depression at the 2nd anniversary of me leaving him, I’m guessing it’s going to take a while. Plus we’ve got two kids so as much as I would like to forget about him, I doubt I ever will.",
            "title_similarity": "0.5044488",
            "sentiment_compound": -0.9209
        },
        {
            "id": "hmkjvxl",
            "score": 1,
            "text": "Sometimes I feel like the people say this are just actually quite alone. You will of course be forgotten about in the future if you leave your job. But you can still make great connections while you're still there. It's not like you just live in the gaps between jobs, you have a life to build. Make friends.",
            "title_similarity": "0.7778642",
            "sentiment_compound": 0.8266
        },
        {
            "id": "hmkkwc4",
            "score": 1,
            "text": "Unless you become someone who's hard to forget.",
            "title_similarity": "0.59115934",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmklflb",
            "score": 1,
            "text": "I actually really needed that today.. I just left an apprenticeship today due to toxic work environment and I've been struggling a bit with accepting my new path in life without having to deal with all that.\n\n\nSo, thanks!",
            "title_similarity": "0.6586157",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hmklgeg",
            "score": 2,
            "text": "This isnt true in the least.",
            "title_similarity": "0.27973652",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmkly7o",
            "score": 1,
            "text": "People will forget, unless you do something they can't forgive.  Don't burn any bridges as you leave.",
            "title_similarity": "0.7803128",
            "sentiment_compound": -0.443
        },
        {
            "id": "hmkmacf",
            "score": 1,
            "text": "Trumpmeme *wrong.gif*",
            "title_similarity": "0.32110426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmkmkfn",
            "score": 1,
            "text": "In relationships - ppl never forget me. I leave an impressions babyyyyy!!",
            "title_similarity": "0.49128532",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hmkmq2e",
            "score": 1,
            "text": "Not the best thing when you feel depressed",
            "title_similarity": "0.38735378",
            "sentiment_compound": -0.7696
        },
        {
            "id": "hmkmyr9",
            "score": 1,
            "text": "Try to tell that to my mum",
            "title_similarity": "0.46195388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmkmyy1",
            "score": 1,
            "text": "Thanks. Needed to hear this. Currently hating my job. Been arguing with myself on wether to stick it out or start applying.",
            "title_similarity": "0.5601277",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hmknkzb",
            "score": 1,
            "text": "Not entirely.  There are several people I worked with that even today I remember fondly.  \n\nAnd also Sheila, she was kind of batshit.",
            "title_similarity": "0.3159266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmkor6x",
            "score": 1,
            "text": "I like to tell my coworkers “like a fart in the wind.” Of course I’ll remember so and so but sometimes they’ll just be forgotten.",
            "title_similarity": "0.51565313",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hmkowr8",
            "score": 1,
            "text": "Attaching your identity to the things you do is totally natural lmao",
            "title_similarity": "0.38619772",
            "sentiment_compound": 0.7889
        },
        {
            "id": "hmkp8du",
            "score": 1,
            "text": "This really isn’t true. How you hold yourself at a job makes a big difference once you leave - both when trying to recruit other coworkers, and trying to get recruited by them years down the line.\n\nAt least in professional settings.",
            "title_similarity": "0.64596796",
            "sentiment_compound": 0.4364
        },
        {
            "id": "hmkpd8y",
            "score": 1,
            "text": "Jesus buddy, I get what you're saying buy that's pessimistic asf. I still have friends on the other side of the continent I regularly keep in touch with after working with them for a few years a decade ago. Make better friends maybe?",
            "title_similarity": "0.5110067",
            "sentiment_compound": 0.765
        },
        {
            "id": "hmkpdmc",
            "score": 1,
            "text": "But, legends never die, bro.",
            "title_similarity": "0.5050951",
            "sentiment_compound": 0.6392
        },
        {
            "id": "hmkpukc",
            "score": 1,
            "text": "lmao i wish they would forget about me. i left my job after a manager had thrown a roll of tape and hit me with it because i couldnt come in early, they all know this but still ask me to come back whenever im fiending for nuggets",
            "title_similarity": "0.59869087",
            "sentiment_compound": 0.431
        },
        {
            "id": "hmkpw7x",
            "score": 1,
            "text": "I always had people like me at every job I've worked And almost every job I've been to I've gained friends along the way 🤷",
            "title_similarity": "0.23463222",
            "sentiment_compound": 0.802
        },
        {
            "id": "hmkqhgw",
            "score": 1,
            "text": "The quote \"The Graveyards Are Full of Indispensable Men\" & [Ozymandias](https://www.poetryfoundation.org/play/75866) by Shelley come to mind.",
            "title_similarity": "0.2087447",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmkqmdu",
            "score": 1,
            "text": "I might be an edge case but I do miss the homies",
            "title_similarity": "0.53229165",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmkqncr",
            "score": 1,
            "text": "Well, not really the case for relationships. At least not in my experience for close enough relationships, even after years.\n\nThat said, don't let a relationship prevent you to move on with your life. Keeping someone back isn't something you should expect from a healthy relationship anyway.",
            "title_similarity": "0.6875174",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hmkqq9x",
            "score": 1,
            "text": "Thank you I needed this",
            "title_similarity": "0.3625491",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmkr4th",
            "score": 1,
            "text": "Forgotten?! Speak for yourself!",
            "title_similarity": "0.5203846",
            "sentiment_compound": -0.3578
        },
        {
            "id": "hmkrgcl",
            "score": 1,
            "text": "unless! You blow a giant rocket into space and use the debris to threaten everything scientists of ever worked for for generations to come!",
            "title_similarity": "0.21296635",
            "sentiment_compound": -0.4912
        },
        {
            "id": "hmkroj3",
            "score": 1,
            "text": "Man, I'm out of this sub. Y'all have gotten way too jaded an cynical. I'd be miserable if I followed the advice posted here daily.",
            "title_similarity": "0.6062477",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hmkruov",
            "score": 1,
            "text": "I am having an existential crisis thank",
            "title_similarity": "0.31066066",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hmksa7z",
            "score": 1,
            "text": "Although this is good advice,  I forget no one I've been in a relationship with or have been friends with. I think of childhood friends often and look them up to be sure they're okay. Not everyone is forgotten. Still,  do what's best. Your company will likely forget you though.",
            "title_similarity": "0.69068",
            "sentiment_compound": 0.9211
        },
        {
            "id": "hmkt3yn",
            "score": 1,
            "text": "Think of it like an apartment you used to live in. Not your responsibility anymore, and the new tenants don't care who you are or what you did to the carpet.",
            "title_similarity": "0.6796824",
            "sentiment_compound": -0.033
        },
        {
            "id": "hmktgpd",
            "score": 1,
            "text": "I feel more and more western philosophy is turning towards Eastern, specifically Indian, philosophical teaching of detachment and peace.",
            "title_similarity": "0.50903416",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hmktnde",
            "score": 1,
            "text": "I used to worry about stuff. Now no matter what happens I just say “don’t worry you will forget about this” or “I wonder how many weeks until I forget about this” I would give examples but I forgot",
            "title_similarity": "0.76381874",
            "sentiment_compound": -0.5909
        },
        {
            "id": "hmktyl3",
            "score": 1,
            "text": "Well i just went through this moment of clarity myself.",
            "title_similarity": "0.43364823",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hmku2qu",
            "score": 1,
            "text": "This is true but also you have the chance to make a lasting impact. Every job I do I make a point to make at least one permanent improvement that will help future employees. I never understood the idea that you have to leave the planet as a hero. The fact of getting through life or simply overcoming the day itself is quite enough to be proud of, but it is also a nice feeling to see the impact you can have.",
            "title_similarity": "0.63362855",
            "sentiment_compound": 0.978
        },
        {
            "id": "hmkwkzv",
            "score": 1,
            "text": "I got fired today for essentially having cancer so this really helps, thank you.",
            "title_similarity": "0.4404006",
            "sentiment_compound": -0.4705
        },
        {
            "id": "hmkwrou",
            "score": 1,
            "text": "This is raw, this is straight to the point and i agree. Good post OP",
            "title_similarity": "0.47135243",
            "sentiment_compound": 0.743
        },
        {
            "id": "hmkwtkx",
            "score": 1,
            "text": "By my exes still cant forget me ffs",
            "title_similarity": "0.48337105",
            "sentiment_compound": 0.5773
        },
        {
            "id": "hmkx5jw",
            "score": 1,
            "text": "Not if Im a very successful serial killer",
            "title_similarity": "0.37979436",
            "sentiment_compound": -0.1206
        },
        {
            "id": "hmkxjre",
            "score": 1,
            "text": "Not 100% true.  I worked my ass off this year to be listed in the inaugural award they will be now presenting yearly.  Top 1% of the agency.  Listed on a plaque.  My name will remain on the plaque on the building even after I retire.  \n\nNot rah-rah company man or anything, but also not going to fade away.",
            "title_similarity": "0.4491092",
            "sentiment_compound": -0.0685
        },
        {
            "id": "hmkxl9t",
            "score": 1,
            "text": "Mmm I don't necessarily believe this but ok",
            "title_similarity": "0.38670015",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmkxn3m",
            "score": 1,
            "text": "Hah. I WISH I was forgotten when I leave a work/project. I've gotten calls/emails about documentation/designs/systems I created many years ago. But it's been quite profitable since several of these became several week long consulting gigs so I can't complain too much.",
            "title_similarity": "0.4879221",
            "sentiment_compound": 0.8596
        },
        {
            "id": "hmkyi6g",
            "score": 1,
            "text": "Lots of terrible LPT's today for anyone with a mental illness.",
            "title_similarity": "0.2942706",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hmkz16z",
            "score": 2,
            "text": "Not sure about all you but I remember my relationships.",
            "title_similarity": "0.49204522",
            "sentiment_compound": -0.1232
        },
        {
            "id": "hmkz4wv",
            "score": 1,
            "text": "I like to kid myself otherwise, but this is the truth.\n\nFrom the friendly mailman who adjusted your tie on your first day, to the ruthless, polarizing genius of a CEO - everybody is expendable, replaceable, and ultimately forgotten.\n\nIt might hurt your ego to accept this, but it absolutely helps any work place anxiety or stress you might have :)",
            "title_similarity": "0.59002995",
            "sentiment_compound": 0.8196
        },
        {
            "id": "hmkzajh",
            "score": 1,
            "text": "I don’t really see why this is a LPT. I think the point you should think about is making an important, positive impact on people’s lives. You won’t always be forgotten by people. I think I see where this is coming from to have a sort of distanced perspective and not be too attached to things but I don’t think that needs to be exclusive from being a positive influence and being remembered.",
            "title_similarity": "0.66721356",
            "sentiment_compound": 0.836
        },
        {
            "id": "hmkzfqq",
            "score": 1,
            "text": "That’s absolutely correct. I respect the realism of this post.",
            "title_similarity": "0.29813915",
            "sentiment_compound": 0.5209
        },
        {
            "id": "hml13hx",
            "score": 1,
            "text": "Completely completely disagree\n\nIt’s on you if people don’t remember you\nAwful Advice OP\n\nYes, You can be replaced at work. But to  be completely forgotten and to leave no impact is solely on you",
            "title_similarity": "0.75106144",
            "sentiment_compound": -0.7978
        },
        {
            "id": "hml1l59",
            "score": 1,
            "text": "Suns will explode and whole galaxies will become forgotten.",
            "title_similarity": "0.34992683",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hml1yht",
            "score": 1,
            "text": "Nah bro, I mentally scar the shit out of people and nuke every bridge after I cross. People still wake in fear in the middle of the night years later.",
            "title_similarity": "0.2811151",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hml23je",
            "score": 1,
            "text": "Not the kids whose fathers went to get milk.",
            "title_similarity": "0.42291275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hml2fld",
            "score": 1,
            "text": "So true!  Many workplace issues are ego-based (my division, my program, etc.) and not personal. This seems to be particularly prevalent by our more senior staff and takes on the appearance of fearing irrelevance. In trying to make/leave their mark, it’s more detrimental than complimentary.",
            "title_similarity": "0.57762414",
            "sentiment_compound": 0.4308
        },
        {
            "id": "hml2px9",
            "score": 1,
            "text": "And also it’s important to remember that it’s okay to forget things, people, etc. it isn’t an insult, it isn’t personal. We all do it. The only people that you should want to remember you are your family and friends. That’s all you need.",
            "title_similarity": "0.7498043",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hml2qam",
            "score": 1,
            "text": "This is super good advice that must be used very carefully. I adopted this way of thinking a long time ago and it has since morphed into something far less healthy. I took it too far and I do shit that is very risky not only to my physical and mental health but to my personal relationships as well. I use the knowledge that no one will remember my actions in 100 years and I could be very easily summed up in a few short, not very nice yet accurate sentences so why not have fun in whatever way I can? I know it's not the healthiest thing to do but I do it anyways because no one is going to remember my actions in 100 years. See what I mean?",
            "title_similarity": "0.6215725",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hml2sd0",
            "score": 1,
            "text": "Very nihilistic. I mainly disagree",
            "title_similarity": "0.3347212",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hml2xli",
            "score": 1,
            "text": "Thanks, my suicidal ideation needed to hear this",
            "title_similarity": "0.5195994",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hml38vu",
            "score": 1,
            "text": "I get what you’re trying to say but this is just false.",
            "title_similarity": "0.55435807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hml3w5q",
            "score": 1,
            "text": "I think this is such a genuine and insightful statement. True globalisation means that we will go through life always shedding relationships both work and personal. People who meant a lot at one time will fade in the distance and lead their lives in their own separate trajectories.",
            "title_similarity": "0.71638364",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hml419a",
            "score": 1,
            "text": "I like to think of that quote that when you die, no one will say \"I wish I spent more time in the office.\"  Unless of course you are a sociopathic workaholic.",
            "title_similarity": "0.67530584",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hml460j",
            "score": 1,
            "text": "Why then am I stuck remembering vividly my past jobs, relationships, and lives when they all get to forget about me?",
            "title_similarity": "0.6890821",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hml4sbo",
            "score": 1,
            "text": "Yeah Not so sure about relationships, I have never forgotten any exes or platonic friends. They all were important in my life and their memories are always with me.\n   But yeah needed this reminder for work, the \"I feel guilty leaving when they need me\" is just silly and is something I need to stop saying to myself. Especially since I work for a big corporation.",
            "title_similarity": "0.61335856",
            "sentiment_compound": -0.1917
        },
        {
            "id": "hml57jl",
            "score": 1,
            "text": "You may be forgotten, but your impact can ripple through space and time indefinitely.",
            "title_similarity": "0.36993018",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hml5bj2",
            "score": 1,
            "text": "Tomorrow, and tomorrow, and tomorrow,\nCreeps in this petty pace from day to day,\nTo the last syllable of recorded time;\nAnd all our yesterdays have lighted fools\nThe way to dusty death. Out, out, brief candle!\nLife's but a walking shadow, a poor player,\nThat struts and frets his hour upon the stage,\nAnd then is heard no more. It is a tale\nTold by an idiot, full of sound and fury,\nSignifying nothing.",
            "title_similarity": "0.4572637",
            "sentiment_compound": -0.9712
        },
        {
            "id": "hml61p6",
            "score": 1,
            "text": "Yea still hurts tho",
            "title_similarity": "0.3167209",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hml62ci",
            "score": 1,
            "text": "My favorite boss of all time had his last day with the company on the 24th. God, this place sucks now.",
            "title_similarity": "0.40108192",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hml6h77",
            "score": 1,
            "text": "Looks like R/buddhism is leaking in here and I'm very much all for it",
            "title_similarity": "0.42372146",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hml6p56",
            "score": 1,
            "text": "\"We're like a family here!\"\n\nBoy, what a crappy way to treat family.",
            "title_similarity": "0.50430137",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hml6psc",
            "score": 1,
            "text": "Of thats so why haven't I moved on? Huh? I'm constantly reminded of people from my past. Checkmate LPT person.",
            "title_similarity": "0.60151243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hml8fxl",
            "score": 1,
            "text": "Or, reject OP's fatalism and do something so useful or beautiful that people will *want* to remember you.",
            "title_similarity": "0.71542317",
            "sentiment_compound": 0.71
        },
        {
            "id": "hml8k30",
            "score": 1,
            "text": "People that I’ve been with and have since left, though break up are definitely not forgotten. In fact they each left an inedible mark on who I am in many mostly positive ways.",
            "title_similarity": "0.56852424",
            "sentiment_compound": 0.7885
        },
        {
            "id": "hml92q4",
            "score": 1,
            "text": "Whole lotta people have forgotten me...",
            "title_similarity": "0.44499284",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hml9x8p",
            "score": 1,
            "text": "…seeing this with this literally being my last week at my current workplace….true I guess…*cue stifled sob",
            "title_similarity": "0.5017202",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hmlapvz",
            "score": 1,
            "text": "Make a fucking mark.",
            "title_similarity": "0.28962046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmlatmi",
            "score": 1,
            "text": "That's why being a community activist is useless.",
            "title_similarity": "0.5942633",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hmlbyum",
            "score": 1,
            "text": "\"My name is Ozymandius. King of kings. Look upon my works ye mighty and despair.\"\nNothing beside remains",
            "title_similarity": "0.2813459",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmlbzkc",
            "score": 1,
            "text": "I sure hope so! It would make kms easier.",
            "title_similarity": "0.4468484",
            "sentiment_compound": 0.807
        },
        {
            "id": "hmld8bt",
            "score": 1,
            "text": "I've been very lucky to out last the jerks in my dept. Now work is a great place for me. I enjoy coming in & seeing the same people I've seen for the last 19 years",
            "title_similarity": "0.34445232",
            "sentiment_compound": 0.8516
        },
        {
            "id": "hmldqgl",
            "score": 1,
            "text": "I know this and its the reason i cant wait to die.",
            "title_similarity": "0.44744354",
            "sentiment_compound": 0.4847
        },
        {
            "id": "hmle8iz",
            "score": 1,
            "text": "The most depressing shit, OP.  \n\\[ELI5\\]   \nIt's about passing onto others something of yourself.  \nEvery living thing dies. FY",
            "title_similarity": "0.48872215",
            "sentiment_compound": -0.7764
        },
        {
            "id": "hmle9m8",
            "score": 1,
            "text": "I became a father of twins a couple of months ago and this message makes me very sad...",
            "title_similarity": "0.3311432",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hmlf1or",
            "score": 1,
            "text": "I’ve already forgotten about you and your tip op.",
            "title_similarity": "0.6194162",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmlf3tl",
            "score": 1,
            "text": "Thank you. I needed to hear this. Recently changed jobs and I have been having a difficult time letting go of the old job and team.",
            "title_similarity": "0.55036944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmlg47i",
            "score": 1,
            "text": "Don’t think if this is exactly true. I get the sentiment. But sometimes friendships are made.",
            "title_similarity": "0.53932935",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hmlgfu0",
            "score": 1,
            "text": "How can I forget those I am no longer in a relationship with?!",
            "title_similarity": "0.66917765",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hmlgsxm",
            "score": 1,
            "text": "Yeah unless you have a stalker",
            "title_similarity": "0.52971184",
            "sentiment_compound": 0.296
        },
        {
            "id": "hmlgx2k",
            "score": 1,
            "text": "We’ll all be forgotten when we die",
            "title_similarity": "0.63511205",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hmlh098",
            "score": 1,
            "text": "“Free your mind and your ass will follow.”",
            "title_similarity": "0.5836296",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmlhnch",
            "score": 1,
            "text": "Maybe you will be.",
            "title_similarity": "0.40689033",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmliroc",
            "score": 1,
            "text": "Unless you leave as in move away from home and become successful. People suddenly remember you a lot.",
            "title_similarity": "0.6833385",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hmlj4ji",
            "score": 1,
            "text": "I needed to read this today",
            "title_similarity": "0.44255948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmljfjb",
            "score": 1,
            "text": "Tell that to the fucking bailiffs",
            "title_similarity": "0.35474434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmlk625",
            "score": 1,
            "text": "This is true in most cases but not 100% true. There are many people which will be remembered pretty much forever. Good examples are people like Steeve Jobs and Nelson Mandela. I don’t need to tell about bad examples, right?",
            "title_similarity": "0.48874575",
            "sentiment_compound": 0.6759
        },
        {
            "id": "hmlkoen",
            "score": 1,
            "text": "Actually…heroes get remembered…and legends never die",
            "title_similarity": "0.51501423",
            "sentiment_compound": 0.4847
        },
        {
            "id": "hmll18m",
            "score": 1,
            "text": "I disagree with this, as a one of a kind person I expect to be remembered and this is how i strive to make a difference. I think what you're trying to say is do what you want to do and don't worry about what others think or say.",
            "title_similarity": "0.7840949",
            "sentiment_compound": 0.5432
        },
        {
            "id": "hmllo6o",
            "score": 1,
            "text": "Well this is a lie. It's a cute attempt at something meaningful and unfortunately many think it is.",
            "title_similarity": "0.45501065",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hmlloc7",
            "score": 1,
            "text": "The same can be said of life",
            "title_similarity": "0.40536284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmlmfrj",
            "score": 2,
            "text": "I don't know how this passes for a tip.\nLearning to move on and forgetting someone / something are completely different things.\n\n\nIf you force yourself to forget you're not moving on, you're not learning shit, you're getting nothing from the experience. \n\nTo move on from someone you need to accept that some things are not meant to be, you need to remember your mistakes and recognize yourself and others as flawed, but not broken. Some times two pieces make a whole, sometimes they are just pieces that don't fit. You need to remember these things so they don't repeat themselves the next time. \n\nWith a job is similar, sometimes you're just not the right fit, sometimes priorities change, sometimes you're not good enough, sometimes whoever is in charge are assholes. You just need to focus on the factors you can control and accept the fact that that's the nature of things. You're not your job.",
            "title_similarity": "0.77981734",
            "sentiment_compound": -0.8124
        },
        {
            "id": "hmlmw9n",
            "score": 1,
            "text": "this is already too popular a post for me to impart how dangerously wrong you are. some careers matter emphatically (you're probably just too young or inexperienced. don't take it personally, please). as does every job as a parent. some people have an absolutely larger responsibility to those around them. this is not blanket advice.",
            "title_similarity": "0.65211093",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmlnfhz",
            "score": 1,
            "text": "My ex-gf just told me that her dad asked her how I was doing. He apparently wasn’t told we were friends again, he just asked out of the blue. I broke up with her 8 years ago. So this isn’t necessarily true.",
            "title_similarity": "0.45223024",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hmlngi3",
            "score": 1,
            "text": "We’re all on a rock floating through infinite space for a blink of an eye in the drop of time. Nothing done before, during or after human civilization will mean anything. \n\nLike Rihanna said, just live ya life.",
            "title_similarity": "0.4309287",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hmlnl46",
            "score": 1,
            "text": "I've been told this mixes well with depression and suicidal ideation.\n\nNihilism can be dangerous.",
            "title_similarity": "0.356839",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hmlns3v",
            "score": 1,
            "text": "Another way of saying this is that everyone is replaceable and no one is indispensable.",
            "title_similarity": "0.6423973",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmlntak",
            "score": 1,
            "text": "but my ex from years ago messaged me that she had a dream about me 😤",
            "title_similarity": "0.3954072",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmlo1do",
            "score": 1,
            "text": "Thanks!\n\nI kinda needed to remember that today!",
            "title_similarity": "0.5258626",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hmloa0w",
            "score": 1,
            "text": "Jokes on you I don't have an identity",
            "title_similarity": "0.44395864",
            "sentiment_compound": 0.25
        },
        {
            "id": "hmlp4p8",
            "score": 1,
            "text": "Not if you are Alexander the Great",
            "title_similarity": "0.33622113",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmlq2uf",
            "score": 1,
            "text": "LPT you wanna be remembered? \nBe an A$$hole. Just the worst.  Like actively and openly monstrous. \n\nKeep a journal and just give your thoughts on current events. Paper is good, but rock is better. Before you die send that crap to a museum. They love that stuff.\n\nGo make some art. Writing, painting, sculpting, or anything beautiful.\n\nThere three ways to be remembered that might last for all human history.",
            "title_similarity": "0.5351267",
            "sentiment_compound": 0.8422
        },
        {
            "id": "hmlrpie",
            "score": 1,
            "text": "Been there and I am in better place right now. But outside of job or a belief, I try to never forget family and friends who passed away, it's smallest thing I could do for them, for being thankful that they were once here",
            "title_similarity": "0.69741124",
            "sentiment_compound": 0.9209
        },
        {
            "id": "hmls0gt",
            "score": 1,
            "text": "I needed this today. Thank you.",
            "title_similarity": "0.4755522",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmls9vo",
            "score": 1,
            "text": "Thanks for posting",
            "title_similarity": "0.36310038",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmlsetl",
            "score": 1,
            "text": "An old supervisor of mine used to say, \"The graveyard is full of irreplaceable people.\"",
            "title_similarity": "0.31883124",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmlt438",
            "score": 1,
            "text": "People don't forget, but they die next.  So the new generation who didn't grow up with you around, don't know you enough to even forget you. \n \nFamily, relationship, company... made of people who dies soon. Replaced by people who didn't meet you.",
            "title_similarity": "0.7119274",
            "sentiment_compound": -0.8109
        },
        {
            "id": "hmltk68",
            "score": 1,
            "text": "You may well be forgotten when you leave... but if you comment your code (or equivalent), you reduce the chances of this significantly. I once had someone tell me I saved them days/weeks of work because I commented both my process and my results, something no one else on the project had done.\n\nThat said, it is true that people \"move on.\" Don't expect too much.",
            "title_similarity": "0.7116455",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hmltqm5",
            "score": 1,
            "text": "At my work, after you leave everything that goes wrong is blamed on you for 6 months whether you had anything to do with it or not.",
            "title_similarity": "0.42457017",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hmlv0pt",
            "score": 1,
            "text": "Nah nah nah, What do is I already have every bridge in my *LIFE* drenched in gasoline so when I light the match to burn it down it's quite the spectacle. I want to be remembered that's the whole point of that, but I already know long term I won't be but just knowing that you're a story in someone else's head in whatever way is funny as hell.",
            "title_similarity": "0.4013748",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hmlvmsj",
            "score": 1,
            "text": "i donno dudeski, i still havent forgotten my mom or my dead friends and for lots of em its been a while",
            "title_similarity": "0.4686025",
            "sentiment_compound": -0.1366
        },
        {
            "id": "hmlw4f7",
            "score": 1,
            "text": "On the flip side find something to believe in or your life will seem empty and/or pointless.",
            "title_similarity": "0.7273095",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hmlw6zz",
            "score": 2,
            "text": "I was the founding president/chair of board of a non profit. Ran it for 5 years and left them with 5 years worth of funding. Did absolutely everything from make the bylaws , logo, mission statement, ect.. I left on great terms but the Executive director I hired at the time didn't get me a plaque or anything when I left because she didn't believe they were important to people. She watched me give every board member a plaque for their years of service.   10 years later when I visit no one knows who I am. It stings I have to say.",
            "title_similarity": "0.3398673",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hmlw9yy",
            "score": 1,
            "text": "This is so true, dad worked at a place for 40 years, the day after he left no one ever messaged him even on his death bed, co-workers are not friends or family.",
            "title_similarity": "0.35019368",
            "sentiment_compound": -0.6172
        },
        {
            "id": "hmlx13c",
            "score": 1,
            "text": "r/youdontmattergiveup",
            "title_similarity": "0.40874654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmly2my",
            "score": 2,
            "text": "My ex hasn't forgotten me, that bitch is crazy.",
            "title_similarity": "0.41828448",
            "sentiment_compound": -0.674
        },
        {
            "id": "hmlyjmk",
            "score": 1,
            "text": "Please please someone give more awards since I can’t afford to.",
            "title_similarity": "0.5575675",
            "sentiment_compound": 0.7841
        },
        {
            "id": "hmlymfp",
            "score": 1,
            "text": "this just makes me feel depressed :(",
            "title_similarity": "0.33772016",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hmlyvl0",
            "score": 1,
            "text": "Yeah and god and Santa aren't real",
            "title_similarity": "0.32011384",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmlz6az",
            "score": 1,
            "text": "“How many after being celebrated by fame have been given up to oblivion; and how many who have celebrated the fame of others have long been dead” - Marcus Aurelius",
            "title_similarity": "0.4931481",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hmlzq6v",
            "score": 2,
            "text": "My coworker died a year and a bit ago. No one forgot him. This is not always true.",
            "title_similarity": "0.50058717",
            "sentiment_compound": -0.7982
        },
        {
            "id": "hmm05ou",
            "score": 1,
            "text": "I needed this, I'm so tied to my job and I need to be going in a few months. I am going to do as much turnover as I need for my replacement but I the idea of how my organization will handle without me is always in the back of my mind.",
            "title_similarity": "0.54065037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmm09mg",
            "score": 1,
            "text": "It actually still terrifies me and i don't know why",
            "title_similarity": "0.352387",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmm0sld",
            "score": 1,
            "text": "This has made my life a lot less stressful tbh. Also helps me be more present.",
            "title_similarity": "0.55203044",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hmm2xsu",
            "score": 2,
            "text": "Depends, I remember a lot of people even people that just did small things in my life or nothing at all",
            "title_similarity": "0.4765312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmm3e6e",
            "score": 1,
            "text": "Yeah but what about my dog? Will they forget about me?",
            "title_similarity": "0.5615535",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hmm3ivy",
            "score": 1,
            "text": "Now THIS is an LPT.",
            "title_similarity": "0.295164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmm4635",
            "score": 1,
            "text": "Exactly what’s does it all even mean at this point.",
            "title_similarity": "0.29580718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmm4d40",
            "score": 1,
            "text": "How is hearing this supposed to help one discover themselves?",
            "title_similarity": "0.5193618",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hmm4gdd",
            "score": 2,
            "text": "Meh, I dunno. I still remember friendships and ex's....",
            "title_similarity": "0.5060115",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hmm4md1",
            "score": 1,
            "text": "People get attached to their job? I have been counting the days till retirement for years. Only 9years 11months and 26 days left. That place is the worst part of everyday",
            "title_similarity": "0.37613386",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hmm4u0g",
            "score": 1,
            "text": "You can also pick people to keep as friends outside of that job/group! You won’t necessarily lose them just because you leave the environment :)",
            "title_similarity": "0.75646085",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hmm50fm",
            "score": 1,
            "text": "Sometimes this idea makes me sad and sometimes I feel very happy about it. I want to be remembered, of course, but I also want the people I know to be happy and not wallow in sadness. Thinking that second part helps me accept this idea and even be happy about it",
            "title_similarity": "0.5847883",
            "sentiment_compound": 0.9721
        },
        {
            "id": "hmm63if",
            "score": 1,
            "text": "It's interesting to read the responses to this.  I agree with it, but it is cold hard truth that very few people can face, or maybe even comprehend.  Most people reacting in this thread relate it to their jobs or their love/family, but to me what the OP meant was that ALL our lives are small.  Humans as a society or organism are powerful and resilient but as individuals we're specks, ants.  Like how many generations can you go back and name the names of father, grandfather, great-grandpa, great-great-etc...  I can name 4 generations of names but I know nothing of my great grandfather, who he was, what his ambitions and dreams are, etc.\n\nMost people seem to react with despair or fear at the \"pointlessness\" of existence (ok but hold on why does someone ELSE'S thoughts/memories/opinions form any basis of your own worth?), but to me it's almost an exciting thought, that the only meaning in life is the meaning you create for yourself.  Eating a good meal, watching a sunset, a good kiss, a funny joke, any of these things give life meaning.  Affecting the lives of billions and hoarding vast resources is the fantasy of tyrants and villains... So what if our lives are small?  Who cares.  \n\nA lovely day, filled with enjoyment awaits all of us tomorrow and that's more than enough to live for.  When we die the universe continues on without us, and how selfish it would be to wish otherwise.  My own non-existance didn't bother me before I was born, and the concept of my non-existence after death doesn't bother me either.  The present moment, and how that same present moment will feel in the future is way more important to having a good life than any thought anyone will have of me.  I'm the one who lives my own life, not someone else.",
            "title_similarity": "0.47809726",
            "sentiment_compound": 0.9889
        },
        {
            "id": "hmm65qp",
            "score": 1,
            "text": "Accepting impermanence is equal parts tragic and empowering. You're always just fine though.",
            "title_similarity": "0.44712126",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hmm696q",
            "score": 1,
            "text": "It’s been 15 years and I think about my ex every day",
            "title_similarity": "0.19888435",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmm6n45",
            "score": 2,
            "text": "This is not always true and sometimes for the best.\n\nI taught biology to freshman for just one year at a charter school, and then had to move to a different city.\n\n3 years later I returned to see those kids graduate. And the valedictorian mentioned me as her favorite teacher during her speech without knowing I was on the audience.  She said I inspired her to continue on to study biology in college.\n\nIt is to this day my greatest achievement as a teacher.",
            "title_similarity": "0.36024702",
            "sentiment_compound": 0.9227
        },
        {
            "id": "hmm74ye",
            "score": 1,
            "text": "This is very true when I left my hometown after joking the military and only returning once a year or so I was forgotten by pretty much everybody except for family. Then as I changed duty stations all my just of my friends moved on. There are a few people who I start in contact with regularly and by a few I mean less than 5 everyone else has forgotten me as I have forgotten them",
            "title_similarity": "0.5002104",
            "sentiment_compound": 0.7453
        },
        {
            "id": "hmm8gc4",
            "score": 1,
            "text": "The last job I quit with no notice ended up so understaffed that they can't stay open half the week.\n\nIt's honestly satisfying af to drive by the increasingly decrepit building knowing it's going to shit because I'm not there to clean everything.",
            "title_similarity": "0.52906895",
            "sentiment_compound": -0.2635
        },
        {
            "id": "hmm8i85",
            "score": 1,
            "text": "Ive been calling in sick almost all month and at least once a month all year just so I can spend quality time with my daughter. Her dad gets her most weekends so when I do have a day off she is usually with her dad and it sucks. So far we have been to trampoline pads, multiple arcades, water park, beach, shopping, etc. Its been great because its usually during the week and the places are usually empty. Her dad is stingy and I know he never takes her the places I do. If I get fired tomorrow I honestly wont care I'll just work at Taco Bell Im good at saving and have a side hustle. I just want to make good memories with her while I can",
            "title_similarity": "0.4039836",
            "sentiment_compound": -0.3022
        },
        {
            "id": "hmm8s5j",
            "score": 1,
            "text": "Keep that identity or continue to develop your own. True",
            "title_similarity": "0.596761",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmmdrq2",
            "score": 2,
            "text": "Still talk about a guy who was caught live on camera. On a show called to Catch a Predator. Yep a Pedophile. No one talked about the retired guy who did a great job.",
            "title_similarity": "0.4206393",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmme6kr",
            "score": 1,
            "text": "What about friends?",
            "title_similarity": "0.4704875",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hmmfbb9",
            "score": 1,
            "text": "Spouses, siblings and other family take note.  You won’t be remembered.",
            "title_similarity": "0.73404914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmmh8fr",
            "score": 1,
            "text": "That's what I want, to be forgotten so I can rest in peace.",
            "title_similarity": "0.7099872",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmmiwe5",
            "score": 1,
            "text": "This quote about death always stands out firmly in my mind:\n\n>> They say we die twice - once when the last breath leaves our body and once when the last person we know says our name",
            "title_similarity": "0.36068845",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hmmj4zj",
            "score": 1,
            "text": "That didn’t work for Alexander the Great",
            "title_similarity": "0.41124535",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmmjpqc",
            "score": 1,
            "text": "That's the beauty I find of living in a bit city. Watching people go by and just live their lives. When you realize that you're one in 10 million, then you feel small and therefore your problems feel small. You're already being forgotten in the moment and its freeing",
            "title_similarity": "0.53863806",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmmlztk",
            "score": 1,
            "text": "If you have good relationship with kids, they’ll remember you.",
            "title_similarity": "0.41525275",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmmnmct",
            "score": 1,
            "text": "And I will forget this thread.",
            "title_similarity": "0.63401496",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmmottc",
            "score": 1,
            "text": "nah, jealous haters never forget",
            "title_similarity": "0.40270033",
            "sentiment_compound": -0.7126
        },
        {
            "id": "hmmovvz",
            "score": 1,
            "text": "Therapy isn't as expensive as it once was.",
            "title_similarity": "0.43655992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmmruvv",
            "score": 1,
            "text": "Bruh, this is literally the example used in the sidebar to show was is not an LPT.  \n \nWhat happened to all the \"Put your middle name when registering for a website so you know who sold your info\" and the \"store your avacados with lemons to keep them longer\"?",
            "title_similarity": "0.538702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmmulzn",
            "score": 1,
            "text": "Beautifully said.   I thought I couldn’t live without certain people in my life but once we stop communication - it’s just a faint beautiful memory.  Life is so special and I embrace every second of it.",
            "title_similarity": "0.5762226",
            "sentiment_compound": 0.9214
        },
        {
            "id": "hmmwvr2",
            "score": 1,
            "text": "Meh, i'd say it depends. Some people sometimes are gemstones which are really hard to find, to put it simple and not go too deep into it imagine someone makes the best chocolate cake in the world, or at least the best chocolate cake in the world for you. When that person is gone, who's going to make it for you? maybe yea you will find some good ass chocolate cake but the odds of finding one better or equally as good are very rare realistically speaking.",
            "title_similarity": "0.3564983",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hmn17iz",
            "score": 2,
            "text": "The flip side of this is you never know when one thing you say, even to a total stranger, may impact their life significantly for better or for worse — and they never forget for the rest of their life",
            "title_similarity": "0.68307525",
            "sentiment_compound": 0.1195
        },
        {
            "id": "hmn36ie",
            "score": 2,
            "text": "Pretty sure my previous employer remembers me, his business has lost the majority of his customers when I left.",
            "title_similarity": "0.42635548",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmn6huz",
            "score": 1,
            "text": "Ive accepted this now i cant stop leaving",
            "title_similarity": "0.5176481",
            "sentiment_compound": 0.4567
        },
        {
            "id": "hmnexah",
            "score": 2,
            "text": "Well then why don't I forget?",
            "title_similarity": "0.5780434",
            "sentiment_compound": 0.4149
        },
        {
            "id": "hmnfbhd",
            "score": 1,
            "text": "[🎶I Remember You🎶](https://youtu.be/qjuEXKwnkLE)",
            "title_similarity": "0.40223908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmnfk0w",
            "score": 1,
            "text": "Yep...people don't care about you at work. Two people passed away at my company within a year, didn't even make it to retirement. Parts are still being made without you.",
            "title_similarity": "0.50484985",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hmngj3m",
            "score": 1,
            "text": "As someone who just lost several family members this past week to cancer & suicide, this \"LPT\" brought out more anger, frustration and sadness than I could ever convey in this comment.\n\n Coming from /r/all, this is the worst way to start a day. Thanks a lot.",
            "title_similarity": "0.3638608",
            "sentiment_compound": -0.9741
        },
        {
            "id": "hmnh4kn",
            "score": 2,
            "text": "The timing of this post...that you, Jack Dorsey?",
            "title_similarity": "0.3469255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmnqdn8",
            "score": 2,
            "text": "Similarly, realize all things are temporary. Realize your love relationship, your family, your job, etc. are all temporary. Knowing that all things, including life are temporary gives the same perspective and allows us to detach from worldly things",
            "title_similarity": "0.64106214",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hn4yxrh",
            "score": 1,
            "text": "I've had people say to me they didn't like the job we were doing but they stayed because they liked working with me and other colleagues.  Just go!  If we get on well we can always meet up again in the future and you could be doing a job you enjoy then too.",
            "title_similarity": "0.70444393",
            "sentiment_compound": 0.8857
        },
        {
            "id": "hpitade",
            "score": 2,
            "text": "This made everything worse for me to be honest, I really don't like the idea of people one day forgetting me completely.",
            "title_similarity": "0.5526551",
            "sentiment_compound": -0.2933
        }
    ]
}