{
    "LPT: If they’re “always hiring,” just know that they also always firing.\nAnd having people quit.\n\n😗\n\n👉👈\n\n🦵 🦵": [
        {
            "id": "hmuy6lx",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.44782075",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hmv020x",
            "score": 16,
            "text": "I'm a recruiter and this is not true",
            "title_similarity": "0.47138405",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmv0okp",
            "score": -1,
            "text": "Or people are always quitting.",
            "title_similarity": "0.7632868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmv7i1s",
            "score": 4,
            "text": "Always hiring means very often they are just collecting CV's and profiling you, when they have position that fits you, they'll find you.\n\nRegarding always firing, i'd rather say, there's big attrition. Some jobs have big demand and corpo strategies are fucklogic so it's easier to get pay rise in another company, so people jump from one to another",
            "title_similarity": "0.78044367",
            "sentiment_compound": -0.0571
        },
        {
            "id": "hmv7r4j",
            "score": 15,
            "text": "Or there's a labor shortage",
            "title_similarity": "0.45112646",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmv4o0p",
            "score": -5,
            "text": "File this in the filing cabinet under \"D\" for \"Duh\"",
            "title_similarity": "0.30769804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmv81wr",
            "score": 5,
            "text": "That's actually not true.",
            "title_similarity": "0.17801936",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmv1i50",
            "score": 6,
            "text": "Or their management practices are constantly making people quit to avoid putting up with the bullshit",
            "title_similarity": "0.816997",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hmv6eoq",
            "score": 1,
            "text": "And it's probably a shitty place to work.",
            "title_similarity": "0.4596338",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmvdbjg",
            "score": 2,
            "text": "This indicates a high-turnover rate, which in simple terms means stay the fuck away from it.",
            "title_similarity": "0.5911437",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmwiy64",
            "score": 2,
            "text": "Amazon. Listened to a great Daily episode today. They had 150% turnover rate this past year. They are legitimately concerned about burning through the entire American workforce.",
            "title_similarity": "0.53769356",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hmv2jbp",
            "score": 197,
            "text": "When I was younger I was told “If a place is always hiring, it usually means something is wrong with the management.” Glad I got that advice early on.",
            "title_similarity": "0.71484125",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hmvc8vn",
            "score": 0,
            "text": "I live near a hydraulics factory that's constantly hiring. Probably because the inside of it is a miserable, hot, humid, sweat box on the factory floor. It's just 1 giant room that has the assembly line workers in the same room as the paint line. And the roof vents only turn on when the temperature gets up to like 120degF",
            "title_similarity": "0.5932878",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hmveqvl",
            "score": 0,
            "text": "\"Always hiring\" is a red flag larger than the old Soviet Union flag!",
            "title_similarity": "0.51595676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmver7o",
            "score": 0,
            "text": "If they're always hiring it's because the job sucks.",
            "title_similarity": "0.7328201",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hmvezq9",
            "score": 0,
            "text": "Well in my industry we have a 0.8% unemployment rate. So it’s more about always needing talent. We can never stay fully staffed because we always need more people to replace retirees or people that move up. Like any job people quit, but a company always having open positions isn’t always an indicator of a toxic work environment.",
            "title_similarity": "0.71183443",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hmvgq0i",
            "score": 0,
            "text": "There's a very-well-known company that keeps hiring for a new cybersecurity exec every 12-to-18 months.  I stay clear;  I view that (constant churn + hiring) as a bad indicator.",
            "title_similarity": "0.68727815",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmvgs4o",
            "score": 0,
            "text": "Or people are always quitting.",
            "title_similarity": "0.7632868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvgz2y",
            "score": 0,
            "text": "...or there's a reason people are leaving.",
            "title_similarity": "0.5115043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvhbyy",
            "score": 0,
            "text": "I'mma steal this one",
            "title_similarity": "0.48492554",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hmvimv0",
            "score": 0,
            "text": "Or they're impossible to work for",
            "title_similarity": "0.31233206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvjh7z",
            "score": 0,
            "text": "Well timed. Just got a message on slack, that \"We're always hiring\" for a job that I am in my second last day",
            "title_similarity": "0.6449058",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hmvjskn",
            "score": 0,
            "text": "It’s more like people are always quitting",
            "title_similarity": "0.7899271",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hmvkh9o",
            "score": 0,
            "text": "Or people always quit",
            "title_similarity": "0.7164419",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvks0v",
            "score": 0,
            "text": "More likely, people are always quitting.",
            "title_similarity": "0.8115965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvlbj2",
            "score": 0,
            "text": "My last job was always hiring. Still are. It was not a good job.",
            "title_similarity": "0.70262015",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hmvn7nb",
            "score": 0,
            "text": "Or have trouble keeping employees.",
            "title_similarity": "0.5184381",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hmvu726",
            "score": 0,
            "text": "Or they’re growing…. Useless LPT",
            "title_similarity": "0.5014068",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hmvv1zb",
            "score": 0,
            "text": "Tech companies are always hiring. You think they suck? They sure pay quite alot",
            "title_similarity": "0.7459147",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmw1k0f",
            "score": 0,
            "text": "I disagree with this due to lack of context. Some are always hiring because there's always new work. This statement doesn't hold up in industries where new projects/growth are common",
            "title_similarity": "0.646624",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hmwi9rs",
            "score": 0,
            "text": "Ya or no one wants to work anymore. Why work when you can get handouts from the state. All paid for by hardworking businesses getting taxed to hell. I have two employees at a high end digital fabrication shop for construction stuff “staying anonymous” we pay our guys 25-30 an hour. Our signs have been up for four months. “Hiring now. Will train. Bring a good attitude and we will do the rest” i have had one person stop in and never called back. We are a little family of hardworking Americans that respect and care for one another. My shop is the cleanest and most effective while keeping overhead low to keep paying well as well as providing tools and necessary equipment/ppe. Im on one if the busiest roads in Portland. Meanwhile all I hear about on the ciities page is waa waa need more help and funding waah wAA. How about get off the couch and go to work. Im getting a little of track but regardless a lot of places need help right now from the pandemic caused shit show. Go talk to the owners and feel the place out theres a lot of good small businesses out there looking for people that want to actually work for 8 hours. Trust your gut instincts. If the signs are up at a large corporate company then ya that might be a little different.",
            "title_similarity": "0.55629224",
            "sentiment_compound": 0.901
        },
        {
            "id": "hmx2o1n",
            "score": 0,
            "text": "‘OPEN INTERVIEWS’ is a red flag. There’s a reason — likely *several* — that they can’t keep people.",
            "title_similarity": "0.6359183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxrlma",
            "score": 0,
            "text": "Good to get a start; better than nothing.",
            "title_similarity": "0.28340352",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hmv0bsf",
            "score": 3,
            "text": "Absolutely true, I work for a big medical company and the smaller clinics have been having huge turnovers because of low pay and toxicity.",
            "title_similarity": "0.5575148",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hmv0msx",
            "score": -7,
            "text": "Wow this is so smart",
            "title_similarity": "0.051725924",
            "sentiment_compound": 0.8069
        },
        {
            "id": "hmv3s2h",
            "score": 41,
            "text": "Or the job is grueling.",
            "title_similarity": "0.47919026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvn1a9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.28675127"
        },
        {
            "id": "hmvp9te",
            "score": 1,
            "text": "Jumping on this LPT: If a job advertisement says it’s “paying up to $xx.xx/hr”, then assume they’re going to pay you much closer to minimum wage. It’s not illegal what they’re doing, but it’s a bit misleading to people with poor reading comprehension and a great way to sucker people in if they think they’re getting more money per hour.",
            "title_similarity": "0.5793999",
            "sentiment_compound": -0.7085
        },
        {
            "id": "hmvpvu7",
            "score": 1,
            "text": "Solid advice, any job that is always consistently hiring, has those signs like those truckers/bus drivers have in the back (Call this number if you want to join) , or has a kiosk at the front at Walmart, Target indicates high-turn over. \n\nThere's nothing wrong with those jobs, those jobs are meant to fill a void",
            "title_similarity": "0.48243546",
            "sentiment_compound": 0.819
        },
        {
            "id": "hmw55m4",
            "score": -1,
            "text": "no. big disagree. the company im at is mad successful so we are constantly growing, therefore hiring. this advice could make you miss out on an awesome job.",
            "title_similarity": "0.6933323",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmw9ff7",
            "score": -1,
            "text": "With the government giving out stimulus cash, people are just being lazy. I see signs on so many doors that they are hiring part or full time employees. Who cares if it’s a shit company. Do your job, build your resume, all while looking for a better opportunity. You ain’t gonna land your dream job on your first shot. People willing to give you that big job want to see your tenacity. Sometimes, you gotta fight through a mud pit to get to the high the pasture.",
            "title_similarity": "0.6996131",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hmwp33r",
            "score": -1,
            "text": "This is a dumb LPT that doesn't tip anything.",
            "title_similarity": "0.17041351",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hmv65x9",
            "score": 12,
            "text": "As a Wal-Mart employee, I feel like this is somewhat true but it's more because management can be very terrible and treat you like shit and so a lot quit. My store is always hiring but never seem to have enough people staffed because it's almost not worth the trouble/drama the company puts you through. Especially the pay..",
            "title_similarity": "0.7082884",
            "sentiment_compound": -0.5251
        },
        {
            "id": "hmv29zh",
            "score": 25,
            "text": "Not really. It probably means people are always quitting.\n\nThe penalty for layoffs and hiring happening simultaneously isn’t worth it for unemployment insurance.",
            "title_similarity": "0.73749363",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hmv7qgm",
            "score": -2,
            "text": "I recently started my own business, prior to that i was in the restaurant industry for about 15 years. I was a GM for about the last 5. You get ALOT of people who just want to collect a paycheck and skate by with the minimum. After about the first two weeks the other servers or other cooks have showed them what they can and can not get away with. I always paid well and gave raises according to performance pretty regular. \n\nAll that being said, out of about 6 people you hire, youre going to get one “keeper”. The keepers are the ones that get the good shifts and make the most money. The others are going to quit, steal, or get themselves fired within three months. \n\nThe last place I took over was a shitshow, i probably fired 40 people in the first three months. Took about a year to get the place right. Once i accomplished this, business was booming, which meant tips were more, cooks were making about $9/hr when i got there and the average was about $14/hr when i left. My bonuses increased along with my salary. \n\nBut for the first year i am sure there were plenty of things like this being said about my place.\n\nMy favorite job I ever had was a line cook at a BBQ joint. Most people would hate it, but for me it was a time id love to gi back to. Finding the job that is perfect for you is what matters.",
            "title_similarity": "0.44121766",
            "sentiment_compound": 0.9539
        },
        {
            "id": "hmvewim",
            "score": 2,
            "text": "If a job has a high turnover rate, you don't want to work for them.",
            "title_similarity": "0.5946847",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hmvkxcf",
            "score": -2,
            "text": "The amount of anti corporate rhetoric on this platform has reached a state of disgust. It isn’t a you vs them for almost employers out there. Nothing in life is nearly as combative as the internet makes it out to be.",
            "title_similarity": "0.49517614",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hmvwvlz",
            "score": 2,
            "text": "Every company is both always firing and always hiring. It is the frequency which matters",
            "title_similarity": "0.7788017",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmv9orv",
            "score": 9,
            "text": "Major red flags also if you sense you’re hired the second you sit your butt in the interview chair. Happened quite often in the sales jobs I interviewed for",
            "title_similarity": "0.69745326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmveljr",
            "score": 22,
            "text": "Former restaurant manager here.  There are 2 reasons that we are \"always hiring.\" And that includes times when we are fully staffed or overstaffed.\n\n1. We want to avoid letting a rock-star employee slip through the cracks.  Even if I was fully staffed, I'm still taking apps just in case I get one that is amazing.\n\n2. If a manager tells someone that we are NOT hiring, they run the risk of it being interpreted as discrimination.  Maybe (while fully staffed) I answer the phone and tell a man that we are hiring.  2 hours later a different manager tells a woman that we aren't.  Even if the other manager just said that cause we are fully staffed, if those 2 know each other we can be in big trouble.\n\nSo, OP is technically correct, but really everywhere should be \"always hiring.\"",
            "title_similarity": "0.7035425",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hmuzx0p",
            "score": 56,
            "text": "Amen to that. I joined a small company and realized how toxic and asss backwards the culture was there , me coming from a bigger more professional company. Huge turnover, I went in in the midst of an employee class action lawsuit I found out about.",
            "title_similarity": "0.6987442",
            "sentiment_compound": 0.1689
        },
        {
            "id": "hmv3n39",
            "score": 17,
            "text": "If it is just for a limited time, it could just be a growth phase.  I worked for a small firm that tripled their head count over the course of a year.",
            "title_similarity": "0.3696301",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvh8t1",
            "score": 18,
            "text": "TIL it's impossible for companies to grow.",
            "title_similarity": "0.39860827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvrlev",
            "score": 16,
            "text": "They’re desperate for workers, not desperate for you to stay long.",
            "title_similarity": "0.5753928",
            "sentiment_compound": -0.0869
        },
        {
            "id": "hmv7iqh",
            "score": 5,
            "text": "Eeeeeeeehhh... I've worked at two places that were \"always hiring\", and it was mostly because of growth.\n\nHiring (properly) is a slow process depending on the job, so any growing company is always going to be behind the curve on how many people they have vs. need.\n\nBoth of the companies in question had constant advertising and recruiting contracts, and didn't have awful turnover. And they'd generally (try to) hire 2 new people for every 1 that did leave.",
            "title_similarity": "0.6234374",
            "sentiment_compound": 0.7058
        },
        {
            "id": "hmvhemn",
            "score": 6,
            "text": "Likely a high turnover rate due to bad work cultures.",
            "title_similarity": "0.6396844",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmvhq8a",
            "score": 5,
            "text": "I had a job once. They where always hiring due to dozens of people getting too old and retiring each year. 600ish employed. Most over 60. A lot over 65.",
            "title_similarity": "0.62842655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvjcjr",
            "score": 6,
            "text": "I work in manufacturing, and whenever I interview for a job the only metric I care about is their turnover rate on the shop floor. It’s all you need to know.",
            "title_similarity": "0.56496274",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmw0pfc",
            "score": 5,
            "text": "Context is everything here. If you’re trying to work for an accounting firm, that could be a red flag because generally the pay is good, the job is coveted, and the work is specialized. If you can’t get accountants to stay, then the workplace is likely compromised. \n\nHowever, a very large portion of the American economy is built on business that typically “always hire”. Walmart, Target, and Best Buy are generally always hiring, as are fast food joints and theme parks. This is because that kind of work is 1) plentiful—there can never be too many stockers at Target, or maintenance workers at Disneyland; 2) transitory—there are few permanent workers, most are high school kids wanting a summer job or college kids trying to make extra cash or what have you; and 3) are generally open most days of the year, so you have to compensate for the folks that want to take time off, especially during the hot seasons like Christmas or the Spring months. \n\nThis LPT is good in theory but in practice it does fall a little short. At the end of the day, most people applying to a company which is “always hiring” likely need the job to begin with, and don’t mind the nature of that given business.",
            "title_similarity": "0.5228823",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hmvaxa4",
            "score": 30,
            "text": "If you're from Texas and know about Buccee's you always see the now hiring sign with all the great pay and benefits (you probably see it on your way to the bathroom). I always suspected if they have to have this sign up then there's a lot of people leaving.",
            "title_similarity": "0.64771825",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hmv99ul",
            "score": 119,
            "text": "Not necessarily true in today's markets, or even certain areas .There are plenty of quality workplaces that simply don't get enough applications. Look anywhere and everywhere and there is someone hiring. Especially in the hospitality and food industry, there will always be a need for more people as circumstances are constantly changing. \n\nNow it certainly can mean there is an issue with the employer, whether that be management or something else, but it's not necessarily law!",
            "title_similarity": "0.6484264",
            "sentiment_compound": 0.2206
        },
        {
            "id": "hmv3dvw",
            "score": 11,
            "text": "Or always quitting or stacking up applications, just in case.",
            "title_similarity": "0.7733534",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvmzth",
            "score": 11,
            "text": "Not necessarily; however, it does mean you should be asking why they are always hiring. Sometimes it means a toxic work environment,  sometimes it means major growth, sometimes it means that they are picky and always looking for the right fit.",
            "title_similarity": "0.773028",
            "sentiment_compound": 0.659
        },
        {
            "id": "hmv6sgu",
            "score": 403,
            "text": "I think this is meant to illustrate turnover in undesirable places to work, like fast food, but, even the best places in the world to work are always hiring.\n\nIf you go to Google’s career page at any given time, they have tons of openings. Google is a fantastic place to work. The company grows and jobs get created, also people leave. People\nLeaving isn’t a bad thing, even the best employers have turnover as people advance their careers and get poached by other companies that match their ambitions or needs better.\n\nA company that is always hiring is not always firing and they are not always bad places to work.",
            "title_similarity": "0.66850466",
            "sentiment_compound": 0.9775
        },
        {
            "id": "hmuz1nz",
            "score": 682,
            "text": "Or they could be experiencing dramatic growth.",
            "title_similarity": "0.31812447",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmv98ij",
            "score": 1219,
            "text": "Always hiring can mean they have standard positions and accept resumes in case good candidates apply. It may still be difficult to get an offer.",
            "title_similarity": "0.5436024",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmvct9e",
            "score": 2598,
            "text": "Not always true.  Saw a company growing at 20-30% a year that was always hiring because they couldn't keep up with needing new employees.",
            "title_similarity": "0.56273824",
            "sentiment_compound": -0.1611
        },
        {
            "id": "hmv52ww",
            "score": 8297,
            "text": "I would say it's more likely that people are quitting.",
            "title_similarity": "0.59998006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmv74t0",
            "score": 3,
            "text": "The only exceptions are places like McDonald’s where turnover is expected, and *maybe* a large organization where it is in their best interest to always be looking for good candidates.",
            "title_similarity": "0.50225604",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hmv7m36",
            "score": 3,
            "text": "The company I worked for was always hiring. They really rarely fire, but they fail to keep most people there.",
            "title_similarity": "0.6400229",
            "sentiment_compound": -0.624
        },
        {
            "id": "hmvcek1",
            "score": 24,
            "text": "We had a now hiring ad stuck on the electronic message center for 5 years, still didn’t find anyone",
            "title_similarity": "0.3427583",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmvd2ic",
            "score": 3,
            "text": "What about entry level jobs? People shouldn’t stay in one spot forever?",
            "title_similarity": "0.57467556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvdxac",
            "score": 1,
            "text": "Or they are growing and you need to get in before they go public.",
            "title_similarity": "0.5102291",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvfzz3",
            "score": 3,
            "text": "The nudie bar down the street is \"always hiring\" lolol",
            "title_similarity": "0.49593005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvgpem",
            "score": 2,
            "text": "It's possible that they are just growing.",
            "title_similarity": "0.23860529",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvjoif",
            "score": 2,
            "text": "Or they are always expanding",
            "title_similarity": "0.43050787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvkdhk",
            "score": 3,
            "text": "This isn't always true.  My company has been growing by leaps and bounds, especially lately.",
            "title_similarity": "0.41361752",
            "sentiment_compound": -0.1611
        },
        {
            "id": "hmvl3ay",
            "score": 3,
            "text": "& they will avoid trying to help you have a better working environment if you’re dealing with harassment.\n\nI recently had a job with Frito-Lay, not even a full two weeks in and I got sexually harassed by a long time employee and harassed by a team lead. I tried to notify my manager and he never addressed my needs. So, I went to HR and they are avoiding my requests to investigate and move me to a different shift. At this point, I don’t even know if I currently have a position. I’ve emailed, called, and came into person to speak to HR. I haven’t received a response yet. \n\nIn orientation and training, they encourage you to report any forms of harassment. But when it happens to you unexpectedly they act like their not responsible.",
            "title_similarity": "0.65488946",
            "sentiment_compound": -0.5489
        },
        {
            "id": "hmvlmpy",
            "score": 8,
            "text": "Or they've got more than say 50 employees...",
            "title_similarity": "0.2520376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvlyb8",
            "score": 1,
            "text": "Or they are growing a ton.",
            "title_similarity": "0.3489329",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvm6dt",
            "score": 3,
            "text": "I'm going to say that's not always the case. My company is always hiring but we've also gone from 60 people to 300 in the past couple of years.",
            "title_similarity": "0.48788872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvmxym",
            "score": 1,
            "text": "Balance is the key",
            "title_similarity": "0.11975267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvnx4c",
            "score": 1,
            "text": "Nonsense. Many companies are just growing and therefore always hiring. OP doesn’t know what they’re taking about.",
            "title_similarity": "0.72512066",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmvo8zl",
            "score": 3,
            "text": "Price's law mother fuckers.\n\nThe sqrt(company size) is useless after.\n\nWe force a mandatory 5% turnover year after year, precisely because people get complacent in a corporate setting and become absolutely worthless and useless to the company.",
            "title_similarity": "0.56275964",
            "sentiment_compound": -0.9179
        },
        {
            "id": "hmvocoz",
            "score": 1,
            "text": "Just put in my two weeks 🙌",
            "title_similarity": "0.36022836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvoff6",
            "score": 3,
            "text": "While certainly true sometimes, you have to take into account the growth of the company. The company I work for has been growing consistently for the last 10+ yrs and is always hiring because of it. If the company is something like a restaurant where there a pretty solid upper limit for the amount of employees they would need, always hiring is definitely a red flag. If it’s a tech company you’re talking about, not necessarily.",
            "title_similarity": "0.5421842",
            "sentiment_compound": 0.9477
        },
        {
            "id": "hmvowp9",
            "score": 2,
            "text": "This isn't necessarily true. Some businesses can only grow when they get more workforce.",
            "title_similarity": "0.44692898",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmvp0wf",
            "score": 1,
            "text": "Or promoting people.  Or it’s a highly recruited from position from outside the firm.",
            "title_similarity": "0.49399817",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmvp7e3",
            "score": 1,
            "text": "Or, they simply can't find people willing to take on that level of responsibility for the pittance they're willing to pay.",
            "title_similarity": "0.4032197",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmvpqm6",
            "score": 1,
            "text": "Or they’re growing. It’s pretty common in successful startups to grow a lot in the first ten years.",
            "title_similarity": "0.3514338",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hmvq931",
            "score": 1,
            "text": "There's so many job postings in the tech sector like this right now.",
            "title_similarity": "0.5026951",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmvqczu",
            "score": 1,
            "text": "Or people are always leaving",
            "title_similarity": "0.66081524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvqfxe",
            "score": 1,
            "text": "not necessarily though! our company has a lot of leads coming in and we have to turn away potential clients if we don't hire new folks",
            "title_similarity": "0.7678822",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvqifv",
            "score": 1,
            "text": "Yeah its kinda true but it also depends on management and there hiring policy. My company is forever hiring, people quit not becuase it is a bad job, it real easy and for pretty good pay, but they tend to hire uni students part time. They quit once they finish uni leading them to hire more people who are often uni students. I would dump the place in a heartbeat if I got offered something with similar pay and work for like a bank or a gov job easy.",
            "title_similarity": "0.6919736",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hmvqkxg",
            "score": 1,
            "text": "Not always. We are always hiring cause we have an old workforce and most of our attrition is retirements.",
            "title_similarity": "0.6862433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvqky4",
            "score": 1,
            "text": "A good tip to question the perpetual hiring but just because a company is always hiring, it could speak to their growth and not a reflection of poor work culture. Always good to do your homework just in case.",
            "title_similarity": "0.6071239",
            "sentiment_compound": 0.6187
        },
        {
            "id": "hmvqpoh",
            "score": 3,
            "text": "If they're always hiring, they might be always firing, people might be always quiting, or they might be in an extended high growth phase.",
            "title_similarity": "0.8396286",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hmvqrzw",
            "score": 1,
            "text": "It's possible that they are expanding. That was the case at a firm where I worked that was \"always hiring\". It was due to growth, not attrition.",
            "title_similarity": "0.5204416",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmvqwfy",
            "score": 1,
            "text": "Manage multiple restaurants, the busier ones are always hiring regardless of how much staff we have.  You get to a point where statistically you are just going to lose people for various reasons all the time.  And if your trying to build your staff, you can hire 3 and 1 works out, so it takes a lot of hiring to grow your team.",
            "title_similarity": "0.73836625",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hmvqwye",
            "score": 1,
            "text": "Vet tech here. There’s one clinic in my city that is constantly hiring. They message me via Indeed every few months even though I’m not actively looking to change jobs. No way I’d ever work for them. Something horrific must be going on over there.",
            "title_similarity": "0.5913986",
            "sentiment_compound": -0.8206
        },
        {
            "id": "hmvrzro",
            "score": 1,
            "text": "I used to work for a plastic car parts factory that I quit with prejudice. I have the most smug satisfaction seeing the sign out front advertising walk in interviews at four o'clock  every Tuesday and Thursday. No resume required.",
            "title_similarity": "0.46767464",
            "sentiment_compound": -0.0589
        },
        {
            "id": "hmvs23g",
            "score": 3,
            "text": "We're always hiring because we can't keep the people that we hire cuz they don't make it.  We don't want to fire anybody.",
            "title_similarity": "0.6687446",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hmvsfsy",
            "score": 3,
            "text": "McDonald’s in my town changed their signs from “Always Hiring” to “Now Hiring”. Someone must have realized the implications.",
            "title_similarity": "0.5583896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvsgt0",
            "score": 1,
            "text": "I watched a job with a major Canadian company come up every year.  The job itself is a great fit for me but there is no way in hell that I ekild consider a move to a company that can't keep people for more than a year.",
            "title_similarity": "0.40464312",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hmvsng8",
            "score": 1,
            "text": "Not true. It could be expanding",
            "title_similarity": "0.33509234",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmvszrr",
            "score": 1,
            "text": "C1 Cafe in Christchurch NZ,  was hiring for 9 years straight.  Then  a huge thing blew up in the news when a university student who was part timing there, spoke out about abuse,  and hundreds of stories came to light.",
            "title_similarity": "0.54198647",
            "sentiment_compound": -0.25
        },
        {
            "id": "hmvt3mj",
            "score": 1,
            "text": "I work in 911 dispatch, a field that is pretty much always hiring just about everywhere in the country.\n\nWe get a lot of turnover, but it's fairly rare for anyone to get fired here if they make it through training.\n\nIt's obviously a high-stress job, so people do quit. Others use it as a springboard to other law enforcement/public safety/etc. careers. Still others get promoted internally, a lot of our office staff started out on dispatch.\n\nOverall, for people who can handle the types of stress involved, it's a pretty nice job, depending on how your agency is structured there is prob6 room for promotion, pay isn't the greatest in many jurisdictions but the benefits usually are.\n\nSo the fact that there's turnover shouldn't always be a red flag so much as why there is that turnover.",
            "title_similarity": "0.67743325",
            "sentiment_compound": 0.3502
        },
        {
            "id": "hmvtfx5",
            "score": 3,
            "text": "Just to play devil's advocate, I would still say do your research of the company.  \n\nMy own strictly promotes from within so our constant hiring is a large effort to bring in talent as backfill for many people that are still with us, just in higher capacities.  \n\nWhile we do have those that leave for other opportunities, our demand for solid people grows each year, and this is all new growth.",
            "title_similarity": "0.6334871",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hmvtfz7",
            "score": 3,
            "text": "That could be good or bad, it could mean ita a shit place to work, or it could mean (especially right now) noone wants to fucking work so people are constantly getting shit canned. You can't call in 3 days a week and not do fuck all the other 2 and expect to stick around.",
            "title_similarity": "0.78906715",
            "sentiment_compound": -0.714
        },
        {
            "id": "hmvthwl",
            "score": 1,
            "text": "An indicator of \"revolving door\".",
            "title_similarity": "0.33051074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvthzu",
            "score": 1,
            "text": "Not 100% true. I worked at a place with a giant 10 foot NOW HIRING sign up front. It was a great job, paid well, but no one wanted to do the work. People who got hired stayed, but it was hard to get time off sometimes with limited staff. There were competitors in the area and we paid the best BY FAR and seemed to have a good work culture, so it wasnt like the pay was a factor.",
            "title_similarity": "0.4991714",
            "sentiment_compound": 0.6925
        },
        {
            "id": "hmvtifx",
            "score": 1,
            "text": "Depends. Some startup companies do grow consistently for the first 10+ years of their existence.",
            "title_similarity": "0.304273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvtlc0",
            "score": 1,
            "text": "That is true but some jobs just have high turnover no matter the circumstance because they are entry level and some people are not cut out for it.  But, it can definitely be a red flag but not 100% of the time.",
            "title_similarity": "0.5340054",
            "sentiment_compound": 0.7622
        },
        {
            "id": "hmvtmp1",
            "score": 1,
            "text": "Or their environment is so nightmarish that people are constantly quitting in order to flee the place.",
            "title_similarity": "0.6484003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvto05",
            "score": 1,
            "text": "Something I always see…permanent hiring signs",
            "title_similarity": "0.54616284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvtz1i",
            "score": 3,
            "text": "When I was a convenience store manager, I told my team that if someone asked if we were hiring, the answer was \"We're always looking for good people.\"  My team could be fully functional and non-toxic, but people would still leave because of  being promoted, planning a family, retiring, injury or illness (even if temporary,) transferring for easier commute, or the rather common practice of young people that never held a job before putting in a good few months and getting enough experience to find something that paid better.  Some situations lend themselves to \"rolling admissions.\"",
            "title_similarity": "0.6606251",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hmvu4o2",
            "score": 1,
            "text": "This explains Starbucks.  I feel super bad for the baristas.",
            "title_similarity": "0.5543349",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hmvu8kd",
            "score": 3,
            "text": "Not always cut and dry, we literally have had a string of bad luck. One guy never showed up, another absolutely refused to learn, got one that turned out to be bat shit insane, another immediately left for another job closer to home, etc, etc.",
            "title_similarity": "0.61348",
            "sentiment_compound": -0.8166
        },
        {
            "id": "hmvulss",
            "score": 1,
            "text": "And that's the truth",
            "title_similarity": "0.08473725",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hmvv1d3",
            "score": 1,
            "text": "I'm a recruiter, this can definitely be true for some positions and companies. But I know of some managers that always accept candidates because of backlogs in projects and such.\n\nIt's best to look up the company and take reviews with a grain of salt.",
            "title_similarity": "0.71632373",
            "sentiment_compound": 0.9178
        },
        {
            "id": "hmvv8l5",
            "score": 1,
            "text": "Hey look another “LPT” that’s not true and potentially harmful for impressionable people who take it seriously.\n\nSincerely… this is bad advice.",
            "title_similarity": "0.37280974",
            "sentiment_compound": -0.7455
        },
        {
            "id": "hmvvbxp",
            "score": 1,
            "text": "Maybe they are expanding and very selective?",
            "title_similarity": "0.44348148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvver3",
            "score": 1,
            "text": "I once took a job that hired me on the spot. I thought it was just because my resume made me perfect for the job (decade of experience doing hospitality and serving at performance venues, waitress at a comedy club). O sweet summer Awyastark 😭",
            "title_similarity": "0.41952193",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hmvviji",
            "score": 1,
            "text": "Yeah I kinda expected this one. Especially the 'actively recruiting' tags, they seems fishy lately. I saw a multimedia position opening on a job posting website last year  that I fail to meet requirements for that is why I did not proceed with my application. They do have the 'actively recruiting' tag. This year on the same website the same position is posted several times a row in a span of four months. I'm bewildered. The company does not seem too big to begin with, a medium startup, even, so expansion is not a possibility. The amount of people removed or has left must be very high.",
            "title_similarity": "0.483912",
            "sentiment_compound": 0.3774
        },
        {
            "id": "hmvvm6x",
            "score": 1,
            "text": "There’s a small shop/factory that I drive by in my town and they have a wooden carved sign that looks basically like a realtor sign that says “Now Hiring.”\n\nEvery time I drive by it I imagine what a shitty place it is to work that they need a permanent *Now Hiring* sign.",
            "title_similarity": "0.5255755",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmvvnqv",
            "score": 1,
            "text": "Disagree. In an expanding company, or a company with plans of expansion, you should constantly be searching for talent and encouraging applications.",
            "title_similarity": "0.5505965",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hmvvqe3",
            "score": 1,
            "text": "Often true, but not always.\n\nThe company I work for has been on double digit growth for the past several years.  So… we’ve always been hiring. \n\nIn the last three years, we’ve gone from ~600 people to ~1250 people.",
            "title_similarity": "0.4182449",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hmvvseb",
            "score": 1,
            "text": "This pretty sums the call centers in my country (Colombia) everyone joins because they are always hiring, then realize",
            "title_similarity": "0.5968674",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmvvtgt",
            "score": 1,
            "text": "We are always hiring with very little turnover. Growth is good",
            "title_similarity": "0.3082109",
            "sentiment_compound": 0.6689
        },
        {
            "id": "hmvvtlu",
            "score": 1,
            "text": "Or have steady growth.",
            "title_similarity": "0.24631482",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmvvzug",
            "score": 1,
            "text": "Or worse, they are horrible employers and burn their employees out constantly.",
            "title_similarity": "0.6636553",
            "sentiment_compound": -0.765
        },
        {
            "id": "hmvw2oy",
            "score": 1,
            "text": "My previous job would go through over 350 new hires a year; they only employed about ~600 people at a time, and it was an established union job. They wondered at why they were spending hundreds of thousands of dollars on overtime pay each year while the place was never even close to \"full employment\".",
            "title_similarity": "0.45219132",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmvwfcz",
            "score": 3,
            "text": "Not always. Could also be always quitting. Truck driving industry has a 120% annual turn over rate, people rarely fired.",
            "title_similarity": "0.57988715",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hmvwfu4",
            "score": 1,
            "text": "There is a restaurant here famous for its funny signs that has “now hiring” on it about every 2 weeks.  I’ve always wondered how much it must suck to work there.",
            "title_similarity": "0.66148555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvwigl",
            "score": 3,
            "text": "U dumb or something??    People aren’t getting fired they are quitting",
            "title_similarity": "0.5065288",
            "sentiment_compound": -0.8053
        },
        {
            "id": "hmvwinq",
            "score": 3,
            "text": "Currently on my third week of working at valvoline and so far the lack of proper training seems to be a huge reason why people are quitting or leaving jobs.",
            "title_similarity": "0.641717",
            "sentiment_compound": -0.0679
        },
        {
            "id": "hmvwju7",
            "score": 1,
            "text": "Or they’re growing?",
            "title_similarity": "0.22347075",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvwl2o",
            "score": 3,
            "text": "hmmm...  in today's market, I see it as we're hiring.\n\n1. you have to pass a drug test\n2. you get paid to work\n3. see points 1 and 2",
            "title_similarity": "0.59129816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvwq60",
            "score": 1,
            "text": "Or the company is successful and growing, what awful advise",
            "title_similarity": "0.44583738",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmvwtev",
            "score": 1,
            "text": "Or people keep quitting because they’re horrible bosses.",
            "title_similarity": "0.7217692",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmvwx5z",
            "score": 1,
            "text": "I work in nursing and while I work on a floor with some of the best management ever(they actually support us and don't micromanage at all) and we get paid pretty well, there's just always never enough staff so we're always hiring despite no one having been fired in the few years I've worked here.",
            "title_similarity": "0.5066917",
            "sentiment_compound": 0.8586
        },
        {
            "id": "hmvx2iw",
            "score": 1,
            "text": "My kids learned this on their first job. Restraint always hiring. They took dishwashing jobs at 10.00 an hour. Both worked 2 days. My youngest walked out when the boss came back and screamed at him about not moving fast enough. My middle never heard back on next day to come it.\n\nThey got their paychecks for 9.50 an hour. I explained to them, when someone is always hiring, either the job sucks or the bosses do.",
            "title_similarity": "0.63898337",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hmvx7d3",
            "score": 3,
            "text": "more likely people are always quitting",
            "title_similarity": "0.797367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvx9av",
            "score": 2,
            "text": "True! But it's not always a bad thing like it sounds. It often is but it really depends on the kind of employment it is. Let me explain. The event industry in much of the country is seasonal and can only provide the most work when it's most busy. Much of the staff are younger and/or only needing seasonal work. For my company, I have long-term veterans but I often have people stay about a year or less then bounce because life doesn't  allow them to keep this job anymore. That's okay. I'm happy to have had them and seen them go on. I run a 30 person operation but only 3 are full-time. The rest work events for us. Many are in school, many have their own businesses, and all have normal 9-5 jobs.",
            "title_similarity": "0.5497992",
            "sentiment_compound": 0.9289
        },
        {
            "id": "hmvxg0m",
            "score": 1,
            "text": "That's what I think every time I drive past this one pizza place. It has a hiring sign up every other week and has since before covid.",
            "title_similarity": "0.46526858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvxiug",
            "score": 1,
            "text": "and that they pay garbage.  I don't know any places that pay well that're always hiring",
            "title_similarity": "0.5895818",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hmvxmva",
            "score": 1,
            "text": "Or they have high turn over because they are awful to work for.",
            "title_similarity": "0.6343009",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmvxscw",
            "score": 1,
            "text": "Or they’re growing.",
            "title_similarity": "0.23673984",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvxvgl",
            "score": 1,
            "text": "Every level of Amazon.",
            "title_similarity": "0.30488163",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvxxai",
            "score": 1,
            "text": "I worked at a major retailer and we had to keep up our now hiring signs. My location was very much not hiring and was fully staffed which was hard to explain standing in front of a 3 foot tall now hiring sign.",
            "title_similarity": "0.61318254",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmvy0dy",
            "score": 1,
            "text": "Always hiring doesn't actually mean they're always hiring, it normally means they're always accepting applications",
            "title_similarity": "0.55146354",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmvy2rn",
            "score": 1,
            "text": "From my experience it's either explosive growth or piss poor management",
            "title_similarity": "0.58991694",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hmvy4md",
            "score": 3,
            "text": "Idk when you employ 500 to 1000 people and have been around for a long time you're going to have around 20 to 30 people finishing their career per year and probably 50 to 150 people moving up in their career based on average turnover rates anywhere from 17-30% which is not unheard of across nearly all industries.",
            "title_similarity": "0.38218337",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmvy4q8",
            "score": 1,
            "text": "I think this is more true for mature small companies but less true for companies that re growing quickly.",
            "title_similarity": "0.30768168",
            "sentiment_compound": 0.812
        },
        {
            "id": "hmvyi1d",
            "score": 3,
            "text": "Not always true. Smaller companies that are growing quickly are adding staff at a far greater rate than they're letting them go.",
            "title_similarity": "0.47803888",
            "sentiment_compound": 0.2187
        },
        {
            "id": "hmvykcn",
            "score": 1,
            "text": "Or they is growing",
            "title_similarity": "0.2207426",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmvym8u",
            "score": 1,
            "text": "This! I worked for a company dispatching couriers for medical supplies in Portland/Boise (Michaels messengers service) and I was there for 6 months and these fuckers fired me for zero reason. I did take all their dispatchers with me so kind of a win but fuck those guys",
            "title_similarity": "0.55130416",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hmvyrez",
            "score": 1,
            "text": "Always a pleasure doing business with the l’ourson company 😏 mighty fine like women! 😂👊",
            "title_similarity": "0.38150167",
            "sentiment_compound": 0.8805
        },
        {
            "id": "hmvyt51",
            "score": 1,
            "text": "Hey this is exactly how Hobbico was",
            "title_similarity": "0.2255329",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvyw35",
            "score": 1,
            "text": "People don’t understand that businesses get huge tax breaks for showing that they are hiring a lot of people. What is insane about this tax break is that it doesn’t matter how many people they fire. They can literally fire everyone and get new hires and end up saving money. \n\nAnother example was when covid happened and there was that “small business credit” whatever. Many large companies decided to lay off hundreds of people so they could apply for this credit then immediately hire right after.",
            "title_similarity": "0.6907407",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmvz8ez",
            "score": 1,
            "text": "I work for a company that's always hiring. Part of that is that is growth, and part of it is that we need people with a specialized skill set.\n\nAnd part of it is that everyone doesn't work out. Nearly everyone works from home and that isn't an arrangement that works for everyone. Some people don't do well without the supervision.",
            "title_similarity": "0.63629544",
            "sentiment_compound": 0.1989
        },
        {
            "id": "hmvz8ou",
            "score": 2,
            "text": "I manage a retail store. Small. Pay is fixed for part time team members at $11/hr (pay based on market and not set by me). Work is minimal. Average about 30-35 transactions a day. Straighten store. Clean. No big shipments. Hours of downtime. Freebies and a huge discount. On the clock breaks. People still quit. It is what it is. Retail and service jobs are always hiring because very rarely does anyone apply and say, “you know what I want to be here forever.” These are summer jobs, after school jobs, in between jobs, pocket money jobs. That’s all.",
            "title_similarity": "0.5203379",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hmvzcs5",
            "score": 1,
            "text": "Or people are always quoting.",
            "title_similarity": "0.58963895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvzieb",
            "score": 3,
            "text": "Kinda agree but at the same time my company is always hiring and it's also impossible to get fired from here. Most of our turnover is quiting not fired.",
            "title_similarity": "0.6563513",
            "sentiment_compound": -0.1054
        },
        {
            "id": "hmvzj9f",
            "score": 1,
            "text": "This post fascinates me. I get it, but that’s also how workplaces work in general. Corporate retail is a perpetual cycle of hiring, while the private sector has struggled immensely over the past year and a half - because people chose to make more on benefits than a measly pay rate (In Canada). Outside of entertainment and corporate, most industries have been perpetually hiring because no one wants the mediocre pay that most business’ offer. \n\nSo yeah, always hiring… isn’t necessarily a sign that the job its self sucks, or that the management is shoddy - It’s typically due to wage disparity and the schism surrounding cost of living.",
            "title_similarity": "0.626112",
            "sentiment_compound": 0.4528
        },
        {
            "id": "hmvzkqj",
            "score": 1,
            "text": "Yea in my experience those sorts of places arent firing people so much. The job is just so miserable that they cant keep people there.",
            "title_similarity": "0.5806043",
            "sentiment_compound": -0.4732
        },
        {
            "id": "hmvzpra",
            "score": 1,
            "text": "Or people are always quitting.",
            "title_similarity": "0.7632868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvzq2d",
            "score": 1,
            "text": "Or they’re growing and constantly need to add staff. Just be mindful of that. Of course if there’s 7 jobs and they’re always firing you’re likely correct.",
            "title_similarity": "0.75759846",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hmw00tl",
            "score": 3,
            "text": "Or they hit the thing my organization did a few  years ago-100% senior management retirement in the span of 18 months. They all held on to finish a special project and after they succeeded they all popped off to retirement land in that time. Very nice time to be in the organization since they wanted to promote from within as much as reasonable. We were hiring for a solid two years into leadership positions due to that. \n\nNow it is due to retirements, expansions, and pandemic recruiting difficulties.",
            "title_similarity": "0.5445121",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hmw00zz",
            "score": 1,
            "text": "LPT: Don't listen to an OP who cannot form coherent sentences.",
            "title_similarity": "0.4047083",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hmw034m",
            "score": 1,
            "text": "They may be growing as well",
            "title_similarity": "0.20607023",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmw045t",
            "score": 1,
            "text": "and they have the audacity to never respond to applications and require a lifetime of experience lol",
            "title_similarity": "0.53727627",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmw04u0",
            "score": 1,
            "text": "Or it's just so terrible to work there nobody stays",
            "title_similarity": "0.49334657",
            "sentiment_compound": -0.6113
        },
        {
            "id": "hmw057f",
            "score": 1,
            "text": "However, in some fields there are stepping stone jobs that people go to in order to get needed hours for another degree or program. My business is always hiring because our primary employees use us for experience before moving on to a master's degree program.",
            "title_similarity": "0.62156194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw05uv",
            "score": 3,
            "text": "People quitting at an alarming rate is also more like right now.",
            "title_similarity": "0.7006303",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hmw08zu",
            "score": 1,
            "text": "Or they just underwent a major organizational change. Just started with a company like that now. It’s not necessarily a negative. Just like when a CEO or high ranking boss leaves, people start leaving and some people who have worked under those people for a long time go with them. It’s an understandable process and could take several years for things to actually settle. But that doesn’t mean it’s a bad situation, just one that is constantly fluctuating. And that might not be for everyone.",
            "title_similarity": "0.66865945",
            "sentiment_compound": -0.3074
        },
        {
            "id": "hmw0hqi",
            "score": 1,
            "text": "Or maybe they're growing",
            "title_similarity": "0.224239",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw0l9t",
            "score": 1,
            "text": "Often hiring is not zero sum game. It could also mean they’re always growing.",
            "title_similarity": "0.4442812",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw0mjk",
            "score": 1,
            "text": "Or loosing people because they suck",
            "title_similarity": "0.52276194",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hmw0ni3",
            "score": 3,
            "text": "where I work, people are always hiring because of promotions and retirements. nobody ever gets fired.",
            "title_similarity": "0.5892161",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmw0pe9",
            "score": 2,
            "text": "True story….\nOn more than one occasion, pre-pandemic work from home at my previous employer, I literally watched people get the perp walk escorted out of the office treatment (99.9% of the time when my old employer let someone go it wasn’t for cause it was because they were trimming fat off the books) then seconds later watch as the person in the office who took people on tours after their interview bring someone through in full view of the entire office on their tour. \n\nThe same company told me on multiple occasions they couldn’t give me more than a 5% raise….then post new job postings for the same role looking for fresh out of college people with a listed starting salary anywhere from 4 to 6 THOUSAND above what I was making. \n\nNeedless to say last November when a job offer came along from a similar - but smaller - company that offered me $16,000 MORE a year on my base salary than what I had been making I couldn’t get out the door fast enough. \n\nIn short; fuck that company.",
            "title_similarity": "0.562497",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hmw0s3y",
            "score": 1,
            "text": "In my industry there is a lot of turnover because a large portion of the early career staff/management consider it a stepping stone to other things. Get their experience and get out.",
            "title_similarity": "0.77011",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw0uhm",
            "score": 1,
            "text": "Any business that forks over the money for a permanent now hiring sign is not a good business",
            "title_similarity": "0.5902885",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hmw0ws5",
            "score": 1,
            "text": "And? I work in a sales job, we regularly cut people who can’t hack it for not bringing in revenue. We are also always hiring to find good talent and fill support roles while training.",
            "title_similarity": "0.7587796",
            "sentiment_compound": 0.743
        },
        {
            "id": "hmw0zne",
            "score": 1,
            "text": "Not exactly true. My workplace is a hard place to work. Commercial fish production and processing. It's cold and wet and it smells like fish. Not many people can stand it. It's an environment that not everyone would be willing to work in. I've had some people come in and walk out within minutes due to the smell. So yeah.....",
            "title_similarity": "0.5657164",
            "sentiment_compound": 0.3888
        },
        {
            "id": "hmw114d",
            "score": 1,
            "text": "I work for a warehouse that is always hiring (training new hires is a full time position here). It’s 100% cause the job sucks (picking boxes all day for 8 hours and they expect you to pick 300+ boxes in an hour). So tons of ppl either don’t make it passed probation or quit.",
            "title_similarity": "0.6850323",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hmw11cx",
            "score": 1,
            "text": "That’s not true at all, a lot of places simply have quotas to receive applications and they must meet them regardless of hiring and firing",
            "title_similarity": "0.7154427",
            "sentiment_compound": -0.5764
        },
        {
            "id": "hmw19qw",
            "score": 1,
            "text": "Unless you're talking about the gas station I work at. We're always hiring but in the three years I've been here I've seen like two people get fired, and it was only because they did some really stupid shit that the boss couldn't ignore.\n\nMost people quit because they either get a better job or were useless to begin with.",
            "title_similarity": "0.6887835",
            "sentiment_compound": -0.9041
        },
        {
            "id": "hmw1e7i",
            "score": 1,
            "text": "Funnily enough, not at my place.. Yeah I know, \"everyone says that\" but honestly out of the last 12 ejections I can remember,  only 3 got *actually* fired, 7 quit properly (2 week notice and everything) and 2 just kind of stopped showing up and got auto-terminated cause they had 3 no-show/calls",
            "title_similarity": "0.5696619",
            "sentiment_compound": -0.2823
        },
        {
            "id": "hmw1ef0",
            "score": 1,
            "text": "A career in sales really is a great way to meet A LOT of ppl",
            "title_similarity": "0.36969578",
            "sentiment_compound": 0.6557
        },
        {
            "id": "hmw1m60",
            "score": 1,
            "text": "This is a pretty off base LPT. Boooo",
            "title_similarity": "0.22095105",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmw1qb0",
            "score": 1,
            "text": "That's not even true all the time. Sometimes you got jobs that are frequented by a certain sect of people. At my local Drafthouse, most employees are college kids and they don't stay all the time and I don't blame them. The restaurant business is a tough gig with little reward and no pay off. So no, there's any number of reasons really.",
            "title_similarity": "0.52891743",
            "sentiment_compound": 0.6179
        },
        {
            "id": "hmw1rbz",
            "score": 1,
            "text": "Or the industry is in high demand (expanding market or labor shortage due to high barrier of entry/skillset: think developer/veterinarian)",
            "title_similarity": "0.5495535",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmw1v35",
            "score": 1,
            "text": "I would say that this doesn’t hold true across all industries. I manage a healthcare facility and I will ALWAYS hire a promising, talented nurse or nursing assistant even if there is not an immediate need. While there HAS consistently been that need over the last couple of years, that holds true in other times as well. If I have 11 reliable staff for 10 positions and I’m impressed by a new applicant, I will hire them and carry the extra payroll. These people are worth their weight in gold and I would rather have them on hand in anticipation of a potential need.",
            "title_similarity": "0.54178333",
            "sentiment_compound": 0.9652
        },
        {
            "id": "hmw1v7q",
            "score": 1,
            "text": "We are always hiring developers, even though we have very low turnover in that position, mainly because there is so much competition for good developers in the job market as a whole",
            "title_similarity": "0.50567776",
            "sentiment_compound": 0.1298
        },
        {
            "id": "hmw1vfi",
            "score": 2,
            "text": "'Always hiring' could also mean that they're open to new applicants, it's just that they might not necessarily be looking for new staff so 100 people could apply, but none of them get selected for interviews/hiring.",
            "title_similarity": "0.48757923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw1zcs",
            "score": 2,
            "text": "Maybe pre-COVID, but we've been hiring a lot and only maybe 3 people I know got fired in the last year.",
            "title_similarity": "0.45052314",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hmw228x",
            "score": 1,
            "text": "\"Just because something rhymes, doesn't mean its true.\"\n\nThis is called the \"rhyme as reason\" effect. [explained](https://en.m.wikipedia.org/wiki/Rhyme-as-reason_effect).",
            "title_similarity": "0.37984878",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmw231u",
            "score": 1,
            "text": "Or it just means everyone is quitting. My job is a revolving door of new hires and quitters",
            "title_similarity": "0.85650516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw25m4",
            "score": 1,
            "text": "I work for a restaurant that has over 150 people on staff, we take open interviews every single Wednesday and are \"always hiring\" but we have great staff retention, and seldomly fire people. but when somebody who's a perfect fit for the restaurant doesn't apply because they don't know if you're hiring, you might miss out on a great opportunity to have them. we have hundreds of resumes in our resume folder, but it would be a shame to turn down a perfect candidate just because you don't need somebody at the moment. most of our need for employees isn't turnover rate, but people that work less shift during school, and most of our turnover is because people finish school and move into the field they have been in school for rather than the restaurant industry. and often times once people get settled into their new career, they often come back to work for a couple nights a week serving because they missed the work family so much.",
            "title_similarity": "0.5641768",
            "sentiment_compound": 0.9657
        },
        {
            "id": "hmw25nc",
            "score": 1,
            "text": "Depending on the role this could mean nothing or be a red flag\n\nWe had a team of like 90 financial analysts spread across the Midwest. You have to always be interviewing because people will quit. I don’t know what a normal turnover rate is but even 8% annual is still like 7 people you’d need to backfill which is a lot",
            "title_similarity": "0.5866537",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hmw29v9",
            "score": 1,
            "text": "There are a lot of small business owners in the world that we shouldn’t demonize because they are a counterweight to mega corporations!",
            "title_similarity": "0.5271574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw2e7y",
            "score": 1,
            "text": "Or mfs is always quitting 😮‍💨🤝💀",
            "title_similarity": "0.72207725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw2f9a",
            "score": 1,
            "text": "I'm always hiring, however, it's due to our department becoming twice as busy over the past few years ...I work in cancer care.",
            "title_similarity": "0.5899282",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmw2gtq",
            "score": 1,
            "text": "More likely people are always leaving. Hard to fire people",
            "title_similarity": "0.8162949",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hmw2i67",
            "score": 2,
            "text": "We can't keep people at my job.  I mean its to the point where they aren't even trying to enforce attendance points because there's no reason to.  Its ridiculous.",
            "title_similarity": "0.53264296",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hmw2kvf",
            "score": 1,
            "text": "reasonable, but as with most everything anyone ever says about anything there are exceptions.  We are always hiring, but there are probably only 10000 people in the country we would be interested in hiring, and they probably aren't interested in us or informed about us.  I think we've only ever fired one person and my understanding was that they were a big problem.",
            "title_similarity": "0.5397731",
            "sentiment_compound": -0.8311
        },
        {
            "id": "hmw2xmx",
            "score": 1,
            "text": "As someone that has been involved  in the hiring process of tons of people over many years, there are so many dumb fuckers out there, it’s definitely a win when a new hire actually shows up to work each day.",
            "title_similarity": "0.68347526",
            "sentiment_compound": -0.3054
        },
        {
            "id": "hmw2xpx",
            "score": 1,
            "text": "Or they post they're always hiring and accept applications\n\n\nRight into file 13",
            "title_similarity": "0.56237334",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmw2yx8",
            "score": 1,
            "text": "Orrr they are scaling/growing/expanding. Just because you thought your thought sounded cool doesn't make it true",
            "title_similarity": "0.36591226",
            "sentiment_compound": -0.0083
        },
        {
            "id": "hmw2z7z",
            "score": 1,
            "text": "Maybe but not always the case. In my town a lot of the jobs such as retail are stepping stones while people try to get into the trades or are waiting for a job opportunity to pop up to go back to work into the trades. Most places are always hiring because they lose a lot of workers to high paying oil industry related jobs/trades.",
            "title_similarity": "0.7378807",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hmw3fdp",
            "score": 1,
            "text": "As a business owner, the positions we offer are not for everyone. Some jobs, it’s just unpredictable and if someone is not a fit then they and we both know. Always hiring is what successful businesses do.",
            "title_similarity": "0.6113229",
            "sentiment_compound": 0.3999
        },
        {
            "id": "hmw3ga6",
            "score": 1,
            "text": "More and more places are trying to be subtle about posting for jobs and are looking for people directly instead for this reason. The company I'm at has hired 3 recruiters in the last 6 months since we saw a lot of people quit over the new changes made earlier this year.\n\nCould not find a single posting for the company on any job recruitment sites when they used to be littered with them.",
            "title_similarity": "0.6218084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw3jlv",
            "score": 1,
            "text": "Maybe the company is growing?",
            "title_similarity": "0.22099817",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw3lca",
            "score": 2,
            "text": "Or the company is growing fast. +15% per year growth in employee count. Not saying no one is quitting, but our company is getting more business/contracts than ever before.",
            "title_similarity": "0.39378536",
            "sentiment_compound": 0.3806
        },
        {
            "id": "hmw3lwk",
            "score": 1,
            "text": "Also could mean they have seasonal workers who are coming and going.",
            "title_similarity": "0.41201878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw3oxs",
            "score": 1,
            "text": "Only if its a shit tier job/company. I work for a company that is always hiring, and I mean it, the company is four times the size from when I started.",
            "title_similarity": "0.47645107",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmw3rai",
            "score": 1,
            "text": "Or the job really sucks so anyone smart is quitting",
            "title_similarity": "0.6894072",
            "sentiment_compound": 0.0478
        },
        {
            "id": "hmw3wxa",
            "score": 1,
            "text": "Not really. I work for a start up that is expanding rapidly throughout the country and is pretty much always hiring. No one leaving though (as far as I know anyway).",
            "title_similarity": "0.52713",
            "sentiment_compound": 0.25
        },
        {
            "id": "hmw3wzk",
            "score": 1,
            "text": "Not where I work. People are leaving the building like superheroes wearing capes. My cape is ready and waiting.",
            "title_similarity": "0.430465",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hmw3xac",
            "score": 1,
            "text": "Dumbest catchall ever. You have to consider the industry. It may be people always deciding its hard and they would rather sit in a chair. \n\n\nOORRRRRR its such an insanely in demand job that they need more people than will ever apply. But nah, its a shit job, according to LPT. Like ,100k truckers? Never enough of them,  never get fired... but LPT assumes you fire them constantly. Or nursing? Very well paid, and we are ALWAYS in demand.. nah, LPT is because we fire them all, which is basically never. \n\n\nHeres the real LPT, dont generalize all businesses without any context",
            "title_similarity": "0.7359952",
            "sentiment_compound": -0.7773
        },
        {
            "id": "hmw3xzv",
            "score": 1,
            "text": "Except for 911 Dispatch no one wants to do the job haha",
            "title_similarity": "0.3712996",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hmw47a9",
            "score": 1,
            "text": "The United States Postal Service, the 2nd largest employer in the country, is proof that you are wrong.",
            "title_similarity": "0.46459398",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hmw4esd",
            "score": 1,
            "text": "Wish I could say this about UPS but if you quit they won’t even bother looking at your application and immediately disqualify you if you try applying in 40+ years lol",
            "title_similarity": "0.6542683",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hmw4mhb",
            "score": 1,
            "text": "A business near me that is in my field has a fancy, expensive, permanent sign out front that says \"Now Hiring!\".\n\nBig red flag for me.",
            "title_similarity": "0.4831704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw4oko",
            "score": 1,
            "text": "Call centers are always hiring, wonder why",
            "title_similarity": "0.7573648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw4peo",
            "score": 1,
            "text": "Some companies are legally required to say always hiring like cvs for example.",
            "title_similarity": "0.5791079",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmw4r9b",
            "score": 1,
            "text": "That is a patently false statement.",
            "title_similarity": "0.25522724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw4rrf",
            "score": 1,
            "text": "I mean some of the trades are always looking for techs/installers",
            "title_similarity": "0.58449125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw4vrw",
            "score": 1,
            "text": "Im14andthisisLPT",
            "title_similarity": "0.23422709",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw4xdh",
            "score": 1,
            "text": "Unless it's a growing business.",
            "title_similarity": "0.33694094",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw4zaq",
            "score": 1,
            "text": "Or people are always quitting, either way its a red flag. I asked my current job employees and a lot have been there over 10 years. Green flag",
            "title_similarity": "0.65670824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw5gb5",
            "score": 1,
            "text": "I've seen major retail stores that are always hiring but barely giving hours so that they don't have to give benefits. The turnover is probably insane.",
            "title_similarity": "0.61162573",
            "sentiment_compound": 0.3634
        },
        {
            "id": "hmw5kh0",
            "score": 1,
            "text": "Or they haven't had any applications in months.",
            "title_similarity": "0.24772751",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw5ouq",
            "score": 1,
            "text": "That’s with many low class/ odd jobs. Pay sucks so employee loyalty isn’t there.",
            "title_similarity": "0.55223036",
            "sentiment_compound": -0.3657
        },
        {
            "id": "hmw5rqv",
            "score": 1,
            "text": "I take exception to that. We are always hiring. \n\nOur high school employees leave for college and our local college employees leave for full time jobs. Unfortunately there is little to no way to move up and I make all my hires aware of this. We are what we are, and just because we’re always hiring, doesn’t make us a bad place to work. \n\nI encourage growth with my employees and I’m only allowed part timers. So if they find a better job or change their life path I support that. In my 7 years there I’ve seen a lot of people come and go but maybe two have left on bad terms.",
            "title_similarity": "0.64545405",
            "sentiment_compound": -0.559
        },
        {
            "id": "hmw5xfr",
            "score": 1,
            "text": "Sometimes they have a rotating temp pool for certain positions. Like, tge kind of work that isn't a full time job but the kind where you can pick up extra hpurs here and there filling in when people go on vacation.",
            "title_similarity": "0.45867646",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hmw61uf",
            "score": 1,
            "text": "I mean, it depends. A large enough operation with a small percent of turnover will still have consistent openings.",
            "title_similarity": "0.32985902",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw62ur",
            "score": 1,
            "text": "Sometimes… my company has 1,300 employees. 10 years ago they had about 100. They hire about 100 new people a year these days. People quit obviously, but it’s probably 10 for every 100 new employees. \n\nBig companies tend to start small",
            "title_similarity": "0.40244377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw643z",
            "score": 1,
            "text": "Especially for sales roles. They hire quick and fire quick",
            "title_similarity": "0.5885813",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmw64me",
            "score": 1,
            "text": "Or they’re expanding, or people are moving up the ladder internally. Handful of alternate answers to explain this phenomenon",
            "title_similarity": "0.5500803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw6542",
            "score": 1,
            "text": "This is a terrible tip. I work at a “start-up” that just got acquired by a corporate giant. We are CONSTANTLY hiring and have one of the highest retention rates for employees. There are many factors that go into “always hiring” - for example, growth or expansion. This is honestly just a stupid “tip”",
            "title_similarity": "0.69353014",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmw6746",
            "score": 1,
            "text": "This is my company. People don’t quit but it’s so hard to find people capable of doing the job that they’re always being let go after 4-6 months of trying to teach them what to do. \n\nWe could use another 10 employees but no such luck. There’s only 3 companies in our city who do the same work and all of us are struggling to find people who can handle it.",
            "title_similarity": "0.5736649",
            "sentiment_compound": -0.8234
        },
        {
            "id": "hmw68nm",
            "score": 1,
            "text": "I own a healthcare business with my wife that is a 1:1 client to employee ratio. 1 year ago we had 8 clients and today we have 40, for a 400% growth rate. We’re always hiring and have virtually no turnover.",
            "title_similarity": "0.36063582",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hmw6ij8",
            "score": 1,
            "text": "Or, as where I worked previously, people are always quitting because they hate it.",
            "title_similarity": "0.784185",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hmw6k0p",
            "score": 1,
            "text": "Or they are in a rapid growth stage. Just do your homework.",
            "title_similarity": "0.4797647",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmw6lam",
            "score": 1,
            "text": "I just left my job, a friend who was training for my department left the same day he went live. My departments a mess, I sent a goodbye message to everyone in the main chat and I had 2 girls reach out to ask me why and I plainly spelled it out for them. \n\nOne said she was looking for a different job when I posted that 🤷🏻‍♀️",
            "title_similarity": "0.6947278",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hmw6oxl",
            "score": 1,
            "text": "Just left a job with incredible turnover due to culture and management. The writing was on the wall but I was too stubborn to read it. The guy I had my second interview with (who had just started) was gone by my 3rd…\n\nThe worst part is, this could’ve been a really cushy, fun job. Those in power just needed to justify their existence",
            "title_similarity": "0.7506803",
            "sentiment_compound": -0.6522
        },
        {
            "id": "hmw6tyy",
            "score": 1,
            "text": "aka high turnover rate",
            "title_similarity": "0.51820254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw6uar",
            "score": 1,
            "text": "\"We encourage you to apply even you don't fit all the qualifications\" basically translates to  \n\n\nWe hire unqualified candidates primarily to pay them below market, and have them work endless hours to \"learn\" and \"grow\".   \n\n\nAlso if the any founder's/management's twitter/linkedin has keywords like productivity, hustle, hard work, etc., it really means they want people to put in more hours. Founders at the best companies never needed to worry of \"productivity\" because the working conditions and culture automatically resulted in better productivity among team members to the extent where you don't have to vomit BS onto your Twitter.",
            "title_similarity": "0.6176473",
            "sentiment_compound": 0.9179
        },
        {
            "id": "hmw6zg5",
            "score": 1,
            "text": "Huh? They may just be growing the business",
            "title_similarity": "0.32626656",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw7a04",
            "score": 1,
            "text": "Hey listen man..sometimes employees fucking go to college and move on to new beautiful things which should be what most jobs encourage people to do. I've lost at least 8 highschool seniors to college. Which is fucking awesome and I'm proud of all those little shits. And older people I push to get a degree so they can get skills to do whatever they find passion in with life. and when they get a job with there degree I try to stay in touch. I literally have helped these assholes with there homework to get a better job and leave where there working..you can only pay so much in the food industry but you can always help people gain self confidence and intelligence..so yes even decent human employers still go through labor shortages. This mindset is kinda fucking goofy and not thought out.",
            "title_similarity": "0.55550086",
            "sentiment_compound": 0.9699
        },
        {
            "id": "hmw7akb",
            "score": 1,
            "text": "Given today's employment market, this lpt is not very good. Most companies are always hiring in one way or another. However, no company is firong much these days because you cant find anybody to replace the employee you lost.",
            "title_similarity": "0.59081626",
            "sentiment_compound": -0.7288
        },
        {
            "id": "hmw7jzr",
            "score": 2,
            "text": "Yeah and it’s a shit job",
            "title_similarity": "0.41844356",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmw7k3h",
            "score": 1,
            "text": "Yeah this isn't even true often enough to be a useful saying.",
            "title_similarity": "0.25883484",
            "sentiment_compound": 0.4153
        },
        {
            "id": "hmw7l5c",
            "score": 1,
            "text": "That is only really true for stores/ restaurants, a lot of industries are just honestly always hiring. In construction every company offers huge incentives to get people, and my company never fires anyone to a fault (that is how desperate we are for workers) even if you suck you just get shuffled around to work with a new crew until they complain about it then on to the next crew.",
            "title_similarity": "0.67091775",
            "sentiment_compound": 0.0754
        },
        {
            "id": "hmw7pj3",
            "score": 1,
            "text": "High turnover - The business views those employees as replaceable, and you'll be viewed the same way.",
            "title_similarity": "0.7330171",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw7wfx",
            "score": 1,
            "text": "Another stupid generalization that sounds witty but is just that — witty sounding and not actually useful",
            "title_similarity": "0.31583616",
            "sentiment_compound": -0.6496
        },
        {
            "id": "hmw7znq",
            "score": 1,
            "text": "Always hiring usually means employees are always walking off the job because it sucks so bad. Can't fire them if they keep quitting.",
            "title_similarity": "0.7899449",
            "sentiment_compound": -0.6899
        },
        {
            "id": "hmw81ue",
            "score": 2,
            "text": "Or it's absolutely awful to work there...",
            "title_similarity": "0.5350333",
            "sentiment_compound": -0.5095
        },
        {
            "id": "hmw82fx",
            "score": 1,
            "text": "More like they can't keep employees because they treat them like shit.",
            "title_similarity": "0.55860347",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hmw82u8",
            "score": 1,
            "text": "Or successful and growing....",
            "title_similarity": "0.2194892",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hmw86u6",
            "score": 1,
            "text": "Texas people: if they have to put a sign out front advertising their wages, the job probably sucks ass. (Looking at you Bucees, the absolute worst job I’ve ever had)",
            "title_similarity": "0.6180923",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hmw89ha",
            "score": 1,
            "text": "Or growing steadily.",
            "title_similarity": "0.27586",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw89ik",
            "score": 1,
            "text": "I’m sure this works in some cases, however\nmy job is always hiring to fill staff retiring or leaving for education or to care for a family member rather than being fired or quitting. \nMost of the workforce for my job description are casual and come back during holidays, or work between the holidays. \nBesides paying $31 AUD an hour with flexible shifts and penalty rates, we have long lunch breaks, no strenuous work without using machines and excellent job cover since it’s all fairly unionised. \nManagement are super nice, and all round it’s a great community. \n\nDon’t apply this tip for everything because you could be missing out on something brilliant. You only really know once you start working for a place whether they have a good culture or not.",
            "title_similarity": "0.5721193",
            "sentiment_compound": 0.9738
        },
        {
            "id": "hmw8q5t",
            "score": 1,
            "text": "My company is always hiring and we didn't have anyone quitting in ~2 years now, only one person retiring. Your LPT is generalized and bad.",
            "title_similarity": "0.6204333",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmw8qcc",
            "score": 1,
            "text": "Or they’re a growing and ambitious company….",
            "title_similarity": "0.3604811",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hmw8w05",
            "score": 1,
            "text": "Definitely quitting. I used to work at a clinic that deals with turnovers almost every month. Now that I’ve moved on, Indeed has been sending me notifications for job offers and guess which company is hiring right now? That one crappy clinic that I left.",
            "title_similarity": "0.6660516",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmw8wrf",
            "score": 1,
            "text": "what about at trader joes?\n\nthought about getting a job there.",
            "title_similarity": "0.40467858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw8x2l",
            "score": 2,
            "text": "This is not always true. Major companies will often have open jobs to give the illusion that everything is OK. They just never fill those jobs or respond to people asking for the job.",
            "title_similarity": "0.56189114",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmw92x9",
            "score": 1,
            "text": "The fold will buckle quickly, trust me, they will wanna chat. Talk to your coworkers. If the turnover in your position is fast you’ll know why real fucking quick.",
            "title_similarity": "0.7622815",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmw93wo",
            "score": 1,
            "text": "It wouldn’t work.” You’re in!”",
            "title_similarity": "0.4353878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmw94qk",
            "score": 1,
            "text": "First of all, in the sentiment you mean, this isn't remotely true at all. Some companies are picky about who they hire and conduct long searches. Second, all companies have turnover all the time.",
            "title_similarity": "0.7705828",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmw9646",
            "score": 1,
            "text": "Not true at all. \n\nSome companies are at the forefront of developing industries (tech, alternative energy, for instance) and they can undergo years of growth",
            "title_similarity": "0.43311307",
            "sentiment_compound": 0.3331
        },
        {
            "id": "hmw98sw",
            "score": 1,
            "text": "Or they are constantly growing as a company. The position also matters. A call center job will suck almost any company (although some may pay well) for example, but can be found in companies that are growing.",
            "title_similarity": "0.6279742",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hmw9arq",
            "score": 1,
            "text": "Not necessarily true. \n\nSoftware engineers have been in high demand for the past 20 years. I've never worked at a company that's been able to find enough good ones to meet the contractual demand.",
            "title_similarity": "0.43989933",
            "sentiment_compound": -0.1109
        },
        {
            "id": "hmw9dlb",
            "score": 1,
            "text": "My job is always hiring home health nurses, but that is a bit different. There is a very high demand for home health, and we often have to turn down referrals because we don’t have enough nurses. We will always welcome more nurses since more nurses mean we can take on more patients.",
            "title_similarity": "0.6148479",
            "sentiment_compound": 0.4277
        },
        {
            "id": "hmw9f1e",
            "score": 1,
            "text": "Even with a very low 20% annual attrition rate, you talk about 1000-1500 people a year just to backfill in a company with over 5k employees. Sometimes it's just hard to find the right candidate.",
            "title_similarity": "0.3498752",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hmw9q8u",
            "score": 1,
            "text": "or growing rapidly.",
            "title_similarity": "0.3434685",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmw9rr6",
            "score": 1,
            "text": "not the way positive growth typically works, but should go over well at anti-work",
            "title_similarity": "0.3768916",
            "sentiment_compound": 0.3586
        },
        {
            "id": "hmw9tme",
            "score": 1,
            "text": "I work for a Giant Multinational company, been there 6 years. \nMy branch has been hiring the whole time, the issue is finding qualified applicants. \nUnion, good pay, benefits, company vehicle. \nActually I'm pretty sure all the Ontario (Canada) branches have always been hiring.",
            "title_similarity": "0.46215937",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hmwa2jf",
            "score": 1,
            "text": "As a recruiting exec, I once had a candidate continually ask about why the position had continually been open. I let them know about the growth of the company and consistently growing the team to scale with growth. They asked again about turnover, I let them know, of course we've had people move on for a variety of reasons, we have a tenured team, new members due to growth, and beat industry averages for turnover by (specific percent). They would not concede that it was a concern to them despite me pointing out they could look at company headcount growth on platforms like LinkedIn, Glassdoor, or Crunchbase. \n\nJust want to share this LPT is not always true and holding firm on this belief can make you unattractive to high-growth companies you may want to be a part of.",
            "title_similarity": "0.60145307",
            "sentiment_compound": 0.8798
        },
        {
            "id": "hmwa9p6",
            "score": 1,
            "text": "Definitely try and find out the employee turnover rate before joining a company. Had I known that 2 people left before I joined my current company I may have made a different decision.\n\nThey've also been trying to find extra developers for months now. They are just struggling to find the right candidates, but the job ad being up so long may create the wrong impression.",
            "title_similarity": "0.6444796",
            "sentiment_compound": 0.0504
        },
        {
            "id": "hmwafgn",
            "score": 1,
            "text": "What a bullshit takes. Companies grow, you know? And hiring takes months to fill a position.",
            "title_similarity": "0.6223321",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hmwahp0",
            "score": 1,
            "text": "Or ... the business is growing and they need more people.",
            "title_similarity": "0.4293561",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmwaiyn",
            "score": 1,
            "text": "Unless it's the army, then check it's not someone else who's firing.",
            "title_similarity": "0.2923314",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmwalhg",
            "score": 1,
            "text": "If the company is large enough, and has a healthy attrition rate, then it's a good thing that it's always hiring as that means the company is dynamic and getting fresh people with fresh ideas in the door.",
            "title_similarity": "0.54141605",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hmwam6x",
            "score": 1,
            "text": "Not necessarily. There's a lot of jobs out there that will ALWAYS be hiring people with good qualifications or skills.  Quality employees pay for themselves. \n\nA lot of companies will have people that aren't ideal for the job working there. They're not immediately fire-able but the company may be looking for upgrades.",
            "title_similarity": "0.6306122",
            "sentiment_compound": -0.0356
        },
        {
            "id": "hmwanld",
            "score": 4,
            "text": "Or they treat employees like shit and they quit. That’s more likely the reality these days.",
            "title_similarity": "0.7667285",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hmwantu",
            "score": 1,
            "text": "Not the best tip. Our company is constantly hiring because we're growing like crazy.",
            "title_similarity": "0.76670796",
            "sentiment_compound": -0.3753
        },
        {
            "id": "hmwao2s",
            "score": 1,
            "text": "This is just some \"I hate capitalism\" post.  I mean, there's a million ways to say it huh.",
            "title_similarity": "0.6182642",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hmway06",
            "score": 1,
            "text": "Nah my company is always hiring. But that's because it's a growing field, and it's hard to find qualified people. And we are stringent about hiring people. Nobody likes foreign people, much better to just take care with hiring and be more certain.",
            "title_similarity": "0.7264258",
            "sentiment_compound": 0.945
        },
        {
            "id": "hmwb1tg",
            "score": 1,
            "text": "Not true in this covid climate friend. Always hiring means always hiring because noone wants a fucking job lmao.",
            "title_similarity": "0.8040639",
            "sentiment_compound": 0.7224
        },
        {
            "id": "hmwb6gh",
            "score": 1,
            "text": "Or, people is always quitting…js",
            "title_similarity": "0.78654206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwbbck",
            "score": 1,
            "text": "Or in some instances the company is going through rapid growth. I work for one of those companies.",
            "title_similarity": "0.39300078",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmwboyc",
            "score": 1,
            "text": "Always quitting is more accurate.",
            "title_similarity": "0.5211252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwbqcx",
            "score": 1,
            "text": "I work in hospitality. Busser/food runner positions is are largest turnover position and it’s not even close. \n\nWe hire mostly smart capable adults that maybe haven’t worked in restaurants before or are looking for something part time to complement their already full time job. We can’t hire under 18 and don’t have many 18-21 year olds applying.\n\nMost the people that quit, are moving on to better jobs, server/bartender position that we can’t offer everyone, or they get burnt out of working a part time job in addition to their full time job.",
            "title_similarity": "0.59093624",
            "sentiment_compound": 0.802
        },
        {
            "id": "hmwbs18",
            "score": 1,
            "text": "Always interviewing could be a better sign for some kinds of companies. If you find the right talent, figure out how to add them to your company, whether you knew you needed them or not.",
            "title_similarity": "0.5182339",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hmwbxxu",
            "score": 1,
            "text": "Not always true in Silicon Valley startups they are always short staffed",
            "title_similarity": "0.3598975",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmwc0uv",
            "score": 1,
            "text": "Or they're a startup with a good growth factor.",
            "title_similarity": "0.1669235",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hmwcmew",
            "score": 1,
            "text": "This sounds like Amazon. I always keep getting emails every week from their HR folks saying that they are always hiring folks.",
            "title_similarity": "0.64301366",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmwctm3",
            "score": 1,
            "text": "After the performance improvement plan and now this LPT, it sounds like some folks are experiencing the quarter 4 Thanksgiving-ish layoff cycle for the first time and taking it personally.\n\nMany companies lay off around this time and usually look to consolidate roles or trim low performers if they need to improve their Q4 and end of year Financials. Why this has to be done at the holidays (from my experience) has always been the part that is inhumane.",
            "title_similarity": "0.6095594",
            "sentiment_compound": 0.836
        },
        {
            "id": "hmwd3m1",
            "score": 1,
            "text": "You also have to take into account what age group their staff is made up of. If they have a lot of high school or college age workers there is bound to be extra turnover from them graduating and moving on to their next chapter in life.",
            "title_similarity": "0.6157563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwd8nt",
            "score": 1,
            "text": "Yea I have to disagree. I work in a school for children with special needs. It is always hiring but we have alot of people quit for many reasons.  Probably most often it is a money issue, but we do get a lot who get grossed out by different aspects, can't figure out how to have a relationship with the students, or have trouble with the positive policies that the school employs when dealing with maladaptive behaviors.  I remember a very slim time period in which we were fully staffed, but we had A TON of people just retire and the school gave them a really retirement package.  Not all workplaces are the same, I promise.",
            "title_similarity": "0.6896194",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hmwddff",
            "score": 1,
            "text": "This is not always the case, a business could be expanding rapidly, thus hiring a lot of people.",
            "title_similarity": "0.4160912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwdhd9",
            "score": 1,
            "text": "This is simply wrong. The agency I am working for is always hiring good people but we can't find some.",
            "title_similarity": "0.6023435",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hmwdi30",
            "score": 1,
            "text": "Not always the case. My company is always hiring bc we have grown from 300 to 1400 in two years.",
            "title_similarity": "0.44839552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwdl8k",
            "score": 1,
            "text": "The organization I work for is always hiring but it’s because it is constantly growing",
            "title_similarity": "0.59853506",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hmwdxc7",
            "score": 1,
            "text": "If the ad says “explosive growth”, “uncapped commissions” and/or “work hard, play hard”…run.",
            "title_similarity": "0.6721855",
            "sentiment_compound": 0.25
        },
        {
            "id": "hmwdzp3",
            "score": 1,
            "text": "That's assuming they're *really* hiring in the first place, and not just lying about that in order to bilk COVID aid out of the government.",
            "title_similarity": "0.4277436",
            "sentiment_compound": 0.4168
        },
        {
            "id": "hmwe2bw",
            "score": 1,
            "text": "If it's a very clearly seasonal sort of occupation, might not necessarily be a red flag.",
            "title_similarity": "0.2488639",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hmwe4j6",
            "score": 1,
            "text": "Not necessarily? \nI was at a startup which was “always hiring” because we were at a growth stage with funding coming our way. Plus the higher ups believed that if we could find talent, we should hold on to them and create positions if there already wasn’t one.",
            "title_similarity": "0.51798576",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hmweaqc",
            "score": 1,
            "text": "Not necessarily true! It could also mean it's a high turnover rate where employees just choose to not stay long or they can't fill quick enough because the hiring process is too long and strenuous (for example, government jobs). Not many people pass the hiring process for whatever agency they are applying for. I could think of a few more scenarios.",
            "title_similarity": "0.63405263",
            "sentiment_compound": -0.3867
        },
        {
            "id": "hmwefcx",
            "score": 1,
            "text": "Local guy owns a small biz - always has the Were Hiring sign out.  \nTells me he does not want his staff to think there not replaceable.  \nI quit working for him doing IT work last year- because he was such an ase.",
            "title_similarity": "0.5765687",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hmwemi8",
            "score": 1,
            "text": "Yep probably just means there’s an issue with the work culture",
            "title_similarity": "0.5224397",
            "sentiment_compound": 0.296
        },
        {
            "id": "hmweuz6",
            "score": 1,
            "text": "Sometimes there’s just not enough qualified applicants applying. But that depends on the industry, and as far as the restaurant and retail industries that’s not the case at all.",
            "title_similarity": "0.46346837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwf13f",
            "score": 1,
            "text": "Or the their business is expanding.",
            "title_similarity": "0.2888887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwf9un",
            "score": 1,
            "text": "Companies can always hire due to constant growth…",
            "title_similarity": "0.4581179",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwfazg",
            "score": 1,
            "text": "I doubt it's firing and more like people quitting",
            "title_similarity": "0.5291851",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hmwfcjq",
            "score": 1,
            "text": "There's a mom n pop burger place nearby l that can't be more than 200 square feet and is permanently hiring. I can only assume the new hires are going into the sandwiches",
            "title_similarity": "0.35040915",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmwfj7e",
            "score": 1,
            "text": "Or their hiring skill tests are asinine and their panel of interviewers turn everyone down for more than a year.\n\nI've seen happen often on LinkedIn.",
            "title_similarity": "0.6650357",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwfu7d",
            "score": 1,
            "text": "Lol, just got contacted by one with the exact \"always hiring\" while fixing my bike and I thought, \"you're not always hiring, you just don't  measure & review your resources\"",
            "title_similarity": "0.6241753",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmwg3cv",
            "score": 1,
            "text": "Proof of this is that (in my experience) Costco in my area has a wait list and Amazon will give you a $3000 bonus to work 3 months.",
            "title_similarity": "0.43419307",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hmwg74k",
            "score": 1,
            "text": "Or people are always quitting because it's so toxic",
            "title_similarity": "0.7178175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwg7ca",
            "score": 1,
            "text": "Or bad at employee satisfaction",
            "title_similarity": "0.48151168",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hmwg87c",
            "score": 1,
            "text": "Yeah I worked at a place that was always hiring. It wasn't fun. Lucky I got another job, so quitting was easy.",
            "title_similarity": "0.67793375",
            "sentiment_compound": 0.0848
        },
        {
            "id": "hmwgab5",
            "score": 1,
            "text": "My transit location is the lowest paid in the region, theres plenty of open slots and work but high turnover and short-staffing abound. \nIts a retention problem so they give incentives.(bonuses for OT) \n\nThey burned their bridges with me and get the bare fucking minimum. I'm wringing every certification in the form of ASE tests and paid travel to the testing location with a company vehicle. I accomplish what I can in 8 hrs, we're 4 techs in a 12 tech shop. \nTheres plenty of projects for us to get caught up on but not enough time or man power. Just dont have the knowledge and wisdom of experience to accomplish more in a timely manner. \n\nThey owe us more and give us pizza every few months. Fucking boomers. We're barely a union.\n\nAcross the street starting wage is 22.00 to operate a forklift, but they dont hire from my business for some reason even with a CDL B and various lift truck experience. I'm making 17.55ish/hr and have to invest in tools for my trade. Fuckers. \nThe further east you go the higher the starting pay even at same company shops. So I gotta save for a better car but fuck these current prices. \n\nI'll grind and grow and learn before I eventually move on.",
            "title_similarity": "0.5700006",
            "sentiment_compound": 0.67
        },
        {
            "id": "hmwgfk9",
            "score": 1,
            "text": "I’m in the Social Work field and it’s a huge red flag when a company is always hiring. It usually means something about the organization or program is a problem. Typically a lack of boundaries and/or high caseload. \n\nNobody wants to work for low pay and be abused by their workplace.",
            "title_similarity": "0.6985833",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hmwgoux",
            "score": 1,
            "text": "Or they area growing. Source: am business owner of 10 years.",
            "title_similarity": "0.26270646",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmwgted",
            "score": 1,
            "text": "also, if there's \"opportunity for advancement\" it probably means they can't get/keep sups and managers",
            "title_similarity": "0.47634315",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmwgyyt",
            "score": 1,
            "text": "Reading the comments on r/LPT. So brilliant!",
            "title_similarity": "0.28237757",
            "sentiment_compound": 0.7318
        },
        {
            "id": "hmwh0dk",
            "score": 5,
            "text": "And/or can't get people to stay long",
            "title_similarity": "0.37681967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwhfyi",
            "score": 1,
            "text": "because managers are stupid",
            "title_similarity": "0.49414212",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hmwhyc2",
            "score": 1,
            "text": "Not necessarily true. Some companies or teams are growing due to the company growing!",
            "title_similarity": "0.3880551",
            "sentiment_compound": 0.0926
        },
        {
            "id": "hmwi4kw",
            "score": 1,
            "text": "Not where I work.",
            "title_similarity": "0.23333816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwid1n",
            "score": 1,
            "text": "Either that or people are always quitting. That's true for the school I work at currently. We've lost someone about once a month on average since August.",
            "title_similarity": "0.6400124",
            "sentiment_compound": 0.128
        },
        {
            "id": "hmwiz50",
            "score": 1,
            "text": "I work at a design firm - and we are \"always hiring\". we are not always firing- in fact - i honestly can't remember the last time someone was fired... I mean... there was this one guy like 14 years ago who got canned... and when the 2008 recession hit, we had some layoffs, just like every other firm in the country. Always Hiring just means - we are always looking for talented and quality employees - because they are always an asset to the firm - even during leaner times. The truth is - we often have to turn down work, due to our own limited capacity -  we are always hiring because quality design personnel are not exactly a dime a dozen... we can't just ramp up hiring and take in anyone - that won't help any of our project teams... you always need to be selective about who you are hiring in order to ensure smart and steady growth, during which you can maintain the quality of your work.",
            "title_similarity": "0.65328306",
            "sentiment_compound": 0.9257
        },
        {
            "id": "hmwj8ko",
            "score": 2,
            "text": "Lol clicked because of the title to say or quitting",
            "title_similarity": "0.57604265",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmwjdmw",
            "score": 1,
            "text": "Take this \"LPT\" with a spoonful of salt. Some companies are actually always growing.",
            "title_similarity": "0.4946092",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmwjntl",
            "score": 1,
            "text": "Not even remotely true",
            "title_similarity": "0.16099206",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmwjwyz",
            "score": 1,
            "text": "Never work in a workplace whic has high rotation of employes. 99,99% of the time its for a reason that managment sucks ass and you are in for a real treat.",
            "title_similarity": "0.6292262",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hmwk5th",
            "score": 1,
            "text": "You are not thinking about companies that are growing really fast. Pretty much every startup with a half decent product 4x their budget every year and are not able to hire fast enough.",
            "title_similarity": "0.4604233",
            "sentiment_compound": 0.6344
        },
        {
            "id": "hmwkbwu",
            "score": 1,
            "text": "Room temperature isn’t even know her 😭😭",
            "title_similarity": "0.32133234",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hmwken3",
            "score": 1,
            "text": "One company I worked me and my two three others trained hundreds of people because most most of the time they wouldn't come back after the first day and sometimes they'd just leave at lunch.",
            "title_similarity": "0.5473507",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hmwkjyx",
            "score": 1,
            "text": "Not true.  They're mostly quitting.",
            "title_similarity": "0.5647822",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmwl9a3",
            "score": 1,
            "text": "Very well put OP.",
            "title_similarity": "0.20421612",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hmwla0z",
            "score": 1,
            "text": "yeah but its not always the work places fault, its hard to find good workers who are local. I've been working at my job for a bit over 3 months and have seen a few faces come and go, some are complete drop kicks who didnt make it past the first day, some are over qualified but cant get to work because of distance and some just have bad attitudes and think they're too good for the work and act like they dont want to be there.",
            "title_similarity": "0.58293724",
            "sentiment_compound": -0.0857
        },
        {
            "id": "hmwlnld",
            "score": 1,
            "text": "That’s not exactly true, google/Facebook/other tech companies were always hiring for a long time, and it was because they were growing so fast. Eventually what you’re saying does usually become more or less true, but a significant number of tech companies in California were able to basically be always hiring for ~10 years. More than long enough to have a huge chunk of your career even if you don’t get in at the beginning.",
            "title_similarity": "0.51816833",
            "sentiment_compound": 0.7327
        },
        {
            "id": "hmwlqwq",
            "score": 1,
            "text": "A sufficiently large organization will always be hiring. My employer is almost always hiring, and almost no one is fired or quits; the openings are primarily due to retirements.",
            "title_similarity": "0.5782399",
            "sentiment_compound": -0.6712
        },
        {
            "id": "hmwlync",
            "score": 1,
            "text": "Crap that's my job currently!",
            "title_similarity": "0.45732695",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hmwmlt6",
            "score": 1,
            "text": "Not true. The employees could be always quitting as well.",
            "title_similarity": "0.78141624",
            "sentiment_compound": -0.0598
        },
        {
            "id": "hmwmpex",
            "score": 1,
            "text": "Yes yes yes it's true",
            "title_similarity": "0.07644418",
            "sentiment_compound": 0.872
        },
        {
            "id": "hmwn687",
            "score": 1,
            "text": "Not true. \nSometimes, people just don’t show back up to work. \nMoved on.  \nOr moved back down to lazy.",
            "title_similarity": "0.5137529",
            "sentiment_compound": -0.5903
        },
        {
            "id": "hmwnnxt",
            "score": 1,
            "text": "Or there is a reason that there is a quick turn around",
            "title_similarity": "0.29911986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwno6n",
            "score": 1,
            "text": "Or they're not actually hiring people. Just always looking.",
            "title_similarity": "0.4664169",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwnpci",
            "score": 1,
            "text": "I wouldn’t agree, I’d say if they are “always hiring”, they are “always treating their staff shitty” so they are “always quitting” 😊",
            "title_similarity": "0.85597366",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hmwob2l",
            "score": 1,
            "text": "While this is true, I know my workplace is “always hiring” but that’s also because it’s a temp job for many staff so every year we lose people who are moving on",
            "title_similarity": "0.7560966",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hmwp7v0",
            "score": 1,
            "text": "I’ve been in my position for roughly 8 years and some of the roles are permanently advertised for. \n\nTrouble is when they do hire someone (there’s a shortage of trained staff, NHS role) they often stay long enough to become fully trained and then leave.\n\nCan’t blame them. Our area just can’t compete with the lifestyle offered by the city hospitals. Plus the work is mind numbingly boring to a lot of people. Their job consists of one thing repeated over and over where as other places involve a variety of jobs so people don’t get bored and build their skills. \n\nTry telling senior management that though!",
            "title_similarity": "0.6588527",
            "sentiment_compound": -0.906
        },
        {
            "id": "hmwpj38",
            "score": 1,
            "text": "Well in the Tech industry, mostly software development, this is due to the fact that everyone with atleast 2 years experience or at the fringe of being 2 years into a company are poached left and right.\n\nBUT customer service, there's a high turnover of employees as people are hired left and right and fired at will. \n\n\nP.S. I live in an Scandinavian Country.",
            "title_similarity": "0.6371154",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hmwprcl",
            "score": 1,
            "text": "We have a fair bit of turnover on shop floor. Some last less than 2 hours. We have however found the root cause and HR managed to resolve it promptly. \nWe now have permanent hiring signs on both sides of the corner as to enable all drivers to see them.",
            "title_similarity": "0.59726685",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hmwpu4a",
            "score": 1,
            "text": "This isn’t true. We’ve grown from about 20 to 80 over 3 years, we’re always hiring because we’re always growing.",
            "title_similarity": "0.5737987",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hmwq38t",
            "score": 1,
            "text": "Nah not really. Shitty life tip. Stick it in the bin.",
            "title_similarity": "0.39149755",
            "sentiment_compound": 0.41
        },
        {
            "id": "hmwqc9k",
            "score": 1,
            "text": "Or they're just filling their talent pool. Job offers can be a long shot.",
            "title_similarity": "0.57335496",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hmwqi2h",
            "score": 1,
            "text": "We are always hiring because we keep getting offered more projects than we can handle and we have to reject them because we need to grow first.",
            "title_similarity": "0.7415738",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hmwqmw2",
            "score": 1,
            "text": "…they don’t pay a lot so people take the job till they get something else…",
            "title_similarity": "0.5399379",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmwr9l2",
            "score": 1,
            "text": "I had a former boss nearly throw a rage-fit when I explained to him that people getting quit was part of employee turnover. He thought it was only when people were fired.. no dude, it’s people entering and leaving the position, regardless of if they quit, fired, or died.\n\nThe place would rarely fire you. You had to fuck up exceptionally bad, multiple times for that to happen. Once I very accidentally (legit was a mistake) caused close to $10k in property damage and called to notify my boss and this scumbag tried to get me to flee the scene before anything happened. Nah dude, aside from the fact that this would turn an accident into a felony if I was found out, we live in the age of cameras everywhere. I would have definitely been found if I fled. Guy was a complete fucking moron.",
            "title_similarity": "0.7354247",
            "sentiment_compound": -0.9908
        },
        {
            "id": "hmwrbi1",
            "score": 1,
            "text": "The place I work at uses temp agencies to find employees, but the management here is so piss poor that within the last three or four months I'm one of the very few on my shift that aren't relatively new, the management drives everyone to quit, and this is a very large factory that's in the process of moving to a much bigger facility that will require more than triple the workers we're supposed to have now.",
            "title_similarity": "0.6509633",
            "sentiment_compound": -0.8835
        },
        {
            "id": "hmwrz8v",
            "score": 1,
            "text": "And a few deaths :D",
            "title_similarity": "0.33447495",
            "sentiment_compound": 0.6166
        },
        {
            "id": "hmws0ib",
            "score": 1,
            "text": "Some occupations have high turnover.  It doesn't mean that they're bad, they just are like that.  Warehouse work, for example has about a 6 month turnover regardless of pay.  Agricultural/seasonal work, very high turnover.  Field technician, high turnover.  Marketing people get poached all the time so you never know how long people will stay.\n\nHowever, if you've been working at your job for a year and they're still hiring for your job, they're pipelining because they assume that you're going to quit.",
            "title_similarity": "0.61667156",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmws8up",
            "score": 1,
            "text": "Reading the comments on r/LPT. So brilliant!",
            "title_similarity": "0.28237757",
            "sentiment_compound": 0.7318
        },
        {
            "id": "hmwskhr",
            "score": 1,
            "text": "or are fast growing.",
            "title_similarity": "0.31758475",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmwso20",
            "score": 2,
            "text": "A company named after a jungle comes to mind",
            "title_similarity": "0.08068934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwstdb",
            "score": 1,
            "text": "That might be true, but in our case it's the lack of people to recruit from in our region combined with the steady growth of the company that makes us keep that \"hiring...\" sign up.",
            "title_similarity": "0.5721512",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hmwszri",
            "score": 1,
            "text": "People are retiring, quitting on their own, going to maternity/sick leave... all the time.\n\nA mid to big size company that is not hiring is necessarily shrinking. Many state own companies actually use this trick instead of laying off people when they need to save money.\n\n\"Always hiring\" is a nothing but a sign of healthy, growing business.",
            "title_similarity": "0.68802387",
            "sentiment_compound": 0.7561
        },
        {
            "id": "hmwt2sv",
            "score": 1,
            "text": "Or just expanding.",
            "title_similarity": "0.26306638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwteaa",
            "score": 1,
            "text": "Or they could be expanding the business",
            "title_similarity": "0.2956725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwtuxk",
            "score": 1,
            "text": "There’s a reason they’re advertising that they’re hiring.",
            "title_similarity": "0.5248802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwui66",
            "score": 1,
            "text": "Somewhat related. In the USAF (not sure about other branches, sorry) we had an \"office job\" on top of our normal combat occupation. People are constantly doing so sorts of shit to put on their performance reports, but occasionally there is a spot that seems to change hands every few weeks. \n\nWhen a leadership personnel tells you that it will be good for your performance report if you can \"handle it\", is not only an emotional manipulation of pride, but it also means that the \"tasks required in this position have impossible standards and this will break you spiritually.\"\n\nI did four of those job's before I realized my error. Don't make my mistake and sacrifice your life energy for corporate/ military assholes. Even if you relatively succeed they'll still treat you like shit.",
            "title_similarity": "0.634224",
            "sentiment_compound": 0.1963
        },
        {
            "id": "hmwuobp",
            "score": 1,
            "text": "Surely been said but if they also mention \"rockstar employee\" in the listing, run the other direction. Lastly check Yelp reviews in certain industries.",
            "title_similarity": "0.63648",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hmwurt5",
            "score": 1,
            "text": "Not true. Some companies grow bigger and hire more people.",
            "title_similarity": "0.47837877",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmwv9kq",
            "score": 1,
            "text": "I mean, I’m always hiring. I’m in a business that has grown from 200 people to 550 in 2 years. I’m not firing anyone, but I’m literally always interviewing. Every week. \n\nThis is probably more true for retail for example than all business",
            "title_similarity": "0.48861703",
            "sentiment_compound": 0.6866
        },
        {
            "id": "hmwvber",
            "score": 1,
            "text": "We always hire but it’s a field of burnout. I actually have great coworkers. Just no one works mental health field long term and our calls are emotionally intense. Many people around here hate typing in their calls. My only gripe is needing more pay. I have great benefits and vacation time.",
            "title_similarity": "0.6946279",
            "sentiment_compound": 0.8053
        },
        {
            "id": "hmwvvor",
            "score": 1,
            "text": "Amazon is always hiring, firing and having people quit, but I wouldn’t say don’t try to work there (other than maybe warehouse).",
            "title_similarity": "0.7445184",
            "sentiment_compound": -0.09
        },
        {
            "id": "hmww8n8",
            "score": 1,
            "text": "That's actually shitty life pro tip.\n\nI work for a company that is always hiring. Not because we fire people. We fire people rarely simply because there are steps for that including multiple warnings followed by correction plan.\n\nMeaning if you for example are late for meetings and it becomes a problem you get a warning. Then another one. Then you will get plan to not be late for meetings during next two months for example. And if you fail that then maybe company will decide to fire you. So like I said firing almost never happen and most cases are around mobbing or harassment. Someone with bad attitude behave inappropriately and we throw them away.\n\nSo why we always hiring? Because it takes months to find programmers. Several months. And we grow so even when we fill positions we have new one to be handled. And we are in a process of purchasing a building to fit all current and future employees.\n\nIt's only true if company number of employees is constant. Otherwise it's a shitty tip.",
            "title_similarity": "0.76845646",
            "sentiment_compound": -0.9673
        },
        {
            "id": "hmwwm4i",
            "score": 1,
            "text": "This is not always true. Simple as that.",
            "title_similarity": "0.21253312",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hmwwp5c",
            "score": 1,
            "text": "Not necessarily true.\n\nMy employer has been increasing their workforce by 800 people a year, every single (non covid) year since I joined them 8 years ago.\n\nWe are indeed always hiring, and very rarely firing.",
            "title_similarity": "0.46061146",
            "sentiment_compound": -0.0046
        },
        {
            "id": "hmwx5jo",
            "score": 1,
            "text": "I was once fired from teaching English because I accidentally broke some glass during a lesson. I’m pretty sure they just had a few teachers too many and weren’t making a profit. It was okay I got a better job two weeks later.",
            "title_similarity": "0.6074553",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hmwxa40",
            "score": 1,
            "text": "My business always has vacancies just from natural turnover. Got 35 vacancies and will always have around that as people retire, leave, die etc.",
            "title_similarity": "0.6668177",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hmwyvok",
            "score": 1,
            "text": "Or always loosing, both are bad.",
            "title_similarity": "0.5054455",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmwz6y0",
            "score": 1,
            "text": "Hire and fire was the motto of my last manager. Saw about 20 different people go through that shithole in the few months I was there.",
            "title_similarity": "0.4841948",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmwznm9",
            "score": 1,
            "text": "My work is always hiring cause they can't keep people from quitting due to being understaffed, overworked, zero communication from higher ups, manager isn't allowed to actual manage anything without \"asking -insert higher up- who hasn't been here in 3 weeks\". \nManager was even afraid to okay a dress code question saying we had to ask the \"store manager\" who works at the office and doesn't even come to the store unless they have to.... Thinking about finding a new job but they work around my mental health issues so afraid somewhere else won't.\n\nEdit: And the pay sucks. Could get more working at McDonald's.",
            "title_similarity": "0.65981114",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hmwzwc1",
            "score": 1,
            "text": "In the case of my last job people just kept leaving. Nobody wants to work in the worst work conditions regardless of pay so they leave and usually find better jobs with equal or better pay.",
            "title_similarity": "0.6589526",
            "sentiment_compound": -0.1477
        },
        {
            "id": "hmx0dbx",
            "score": 1,
            "text": "Buses, round my way, have an ad on the back of them advertising for new drivers. All the time.",
            "title_similarity": "0.5179087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx0e5g",
            "score": 1,
            "text": "That's why I decided to work for amazon over the summer. I knew I would have to quit when school started back up but they dont give a shit and I don't give a shit so it was a win win",
            "title_similarity": "0.52922285",
            "sentiment_compound": 0.9662
        },
        {
            "id": "hmx0lc9",
            "score": 1,
            "text": "Thats why I get weekly job opening emails from Intuit.  I had an interview with them once. Total assholes.",
            "title_similarity": "0.7234675",
            "sentiment_compound": -0.624
        },
        {
            "id": "hmx0spx",
            "score": 1,
            "text": "They could also be always growing and/or staff are quitting for benign reasons. For example, a restaurant may have an excellent work environment but the turnover rate is high because staff are mostly college students who move on to better jobs when they graduate.",
            "title_similarity": "0.63094234",
            "sentiment_compound": 0.802
        },
        {
            "id": "hmx16lb",
            "score": 1,
            "text": "Depends. Consulting is always hiring as their biggest asset is the people. Generally also has a higher turnover (employees moving to industry for better pay for skills acquired) so they need to always hire to account for the turnover and double digit growth they’re usually striving for",
            "title_similarity": "0.6813867",
            "sentiment_compound": 0.765
        },
        {
            "id": "hmx1e5x",
            "score": 1,
            "text": "I see a sign like that and it immediately makes me think it's a shitty place to work with extremely high turnover.",
            "title_similarity": "0.69927585",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmx1uvv",
            "score": 1,
            "text": "Depends on the field. My boss is always hiring carpenters. Actual good ones are few and far between but everyone gets a shot",
            "title_similarity": "0.64481974",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hmx1zba",
            "score": 1,
            "text": "This is a really stupid thing to post on LPT. You quite literally don't know that for sure and have no basis for declaring it like you're somehow correct. Go to bed.",
            "title_similarity": "0.41322184",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hmx20ws",
            "score": 1,
            "text": "Yup. I worked with Qatar Airways, and they’re the most abusive, retrograde, bizarre company in aviation industry. Working with them was so stressful, we had pressure from our abusive managers from every flight and also from the many rules we had to follow, such as having to come home by 4am (not allowed to sleep anywhere other than your company owned apartment), we needed to ask for permission from them to get married, rules for women were more severe than for men. To name a few. It was a nightmare.",
            "title_similarity": "0.6727113",
            "sentiment_compound": -0.9665
        },
        {
            "id": "hmx231j",
            "score": 1,
            "text": "Not really. I mean, most of the time that's the case, but sometimes companies just grow very rapidly and are always hiring while growth is happening(could last for couple of years). And sometimes company is always hiring but are very rigorous who they hire. Company i work for is constantly looking for new candidates but only 1 person left in last year(around 80 employees) and maybe 5 new arrived.",
            "title_similarity": "0.59652066",
            "sentiment_compound": 0.0799
        },
        {
            "id": "hmx28zc",
            "score": 1,
            "text": "Or people are routinely quitting. Both are a bad sign",
            "title_similarity": "0.6666929",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmx2ekp",
            "score": 1,
            "text": "Not always. They're collecting resumes and do interviews to keep KPI high",
            "title_similarity": "0.5957789",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx2q57",
            "score": 1,
            "text": "Not really, I work for a company that’s always expanding, great to work for, but always looking for new great employees.. although I do see your point as well!",
            "title_similarity": "0.576388",
            "sentiment_compound": 0.903
        },
        {
            "id": "hmx31i6",
            "score": 1,
            "text": "Or people are always leaving",
            "title_similarity": "0.66081524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx4b7j",
            "score": 2,
            "text": "I've been trying to get a job at a vet office in my town forever now but there's one place I refuse to even apply for anymore. They're ALWAYS hiring.\n\n I got an interview once and the girl that interviewed me said they don't allow you to shit talk the animals.. like even when the parents are gone you can't say \"aww you're such a fattie\" or anything along those lines. Not even playfully or endearingly. Any shelter I've worked at thats like 70% of what we talked about to each other and any friend who worked at a clinic said the same thing. That HER policy..\n\nThen when I asked how they handle things like doctors appointments because they operated long hours all week long, she didn't know how to answer. She said they just don't take time off, which tells me no one can go to a doctor and no one has kids. I slipped up and mentioned I have to see my psychiatrist every three months for anxiety meds (It was turning into a bad interview and I slipped up, don't do this) and she said they can't have someone who's going to break down at the slightest pressure and cry if they have to put an animal down. I was pissed, I have worked many high pressure jobs including at a shelter where I helped euthanize animals. The logic was just so skewed. She assumed anxiety meds= unstable. \nI get why they always have openings if that woman was the manager.",
            "title_similarity": "0.56013584",
            "sentiment_compound": -0.9844
        },
        {
            "id": "hmx4d9w",
            "score": 1,
            "text": "Maybe not always firing, sometimes it's also people always leaving.",
            "title_similarity": "0.6775067",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hmx56ul",
            "score": 2,
            "text": "Or aren't really hiring, in Canada companies need to advertise for a certain time ( to show that they have tried to hire Canadians first) so they can get work permits for foreign workers.",
            "title_similarity": "0.44617718",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hmx5b00",
            "score": 1,
            "text": "This is incorrect in so many ways.",
            "title_similarity": "0.33962432",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx5bxm",
            "score": 1,
            "text": "A high turnover rate in a company is always a major red flag.",
            "title_similarity": "0.636194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx5p25",
            "score": 1,
            "text": "Or they are growing",
            "title_similarity": "0.2135425",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmx5pp3",
            "score": 2,
            "text": "Senior positions in IT are always open. But if all of the positions are always open that's a huge red flag for the company.",
            "title_similarity": "0.60034",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hmx66w1",
            "score": 1,
            "text": "Just because people are quitting doesn’t mean they are unhappy, people might have gained a lot of skills in a company but are moving onto another position.\n\nThis is a bad take.",
            "title_similarity": "0.59344935",
            "sentiment_compound": -0.705
        },
        {
            "id": "hmx6esn",
            "score": 1,
            "text": "Nothing screams that better than a PERMANENT SIGN that says NOW HIRING",
            "title_similarity": "0.5122494",
            "sentiment_compound": -0.1326
        },
        {
            "id": "hmx74rq",
            "score": 1,
            "text": "I'm actually always hiring because I have excessive demand and a lacking labor pool. That combined with a seasonal flow of employees, students graduating and moving to jobs in their desired fields leaves me in a constant state of hiring.\n\n\n\n\nIt's a good job, pays well enough, but isn't seen as one with a future for most people. Entry level work.\n\n\n\nYes, I am always hiring, it's certainly not because I am always firing people.\n\n\n\n\nIn the last year I have fired 4 people for legitimate reasons, the worst reason among them dishonesty, absenteeisn was 2 of them, the last was for underage smoking inside of my building. I have hired 33 people, of those people only 11 of them still work for me. I have also rehired an additional 7 people.",
            "title_similarity": "0.7175093",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hmx76js",
            "score": 1,
            "text": "Or it's a restaurant in a college town during a pandemic that's lasted for 2 years and there's no sign of it ending anytime soon. \n\nMost employees are hired temporarily due to graduating and moving soon, or they quit because they realize they can't work and also make good grades. On top of that not as many people have been putting in applications since the beginning of the pandemic. \n\nHence, we have been extremely short staffed and always hiring for the past 2 years and it sucks. But it's still a really good work environment, the manager is amazing and the customers are generally great.",
            "title_similarity": "0.5245287",
            "sentiment_compound": 0.9527
        },
        {
            "id": "hmx7nf4",
            "score": 1,
            "text": "Another usual red flag is being hired the same day. 2/3 of my jobs have been awful and I was hired the same day as my interview. My current job i s great and while they also hired me the same day, it looks more like they had the time to meet and discuss at length and pulled the trigger.",
            "title_similarity": "0.705077",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hmx7nju",
            "score": 1,
            "text": "Or can't retain help...",
            "title_similarity": "0.2709009",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hmx7v2l",
            "score": 1,
            "text": "Or the turnover rate is super high because the work itself is terrible or kind of niche. I worked in debt collection and cold call sales  for a while and saw so many quit because they weren’t cut out for it. I sucked at it too but couldn’t afford to leave. Good times",
            "title_similarity": "0.7132932",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hmx93ve",
            "score": 1,
            "text": "The local Wendy's has this displayed on their sign. Should I apply within?",
            "title_similarity": "0.260338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx9424",
            "score": 1,
            "text": "Or could be a pyramid scheme",
            "title_similarity": "0.1239322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmx968f",
            "score": 1,
            "text": "If you sit for an interview in a place like this, a polite way to ask about this fact is to say something like, \n\n\"I noticed there's a great deal of new positions available. What is driving the growth of the company?\" \n\nEven if you're pretty sure it's rapid turnover, this question lets you gauge that for sure. \n\nThe content of the response isn't as important as the delivery. \n\nDid you surprise them? Did it seem like a pleasant surprise? Did they mumble through a non-answer? Did the answer seem canned?\n\nI asked this question in an interview once for a place that was described as an \"engineering sweatshop\". The interviewer seemed surprised and said basically \"We're growing but we're not\"\n\nI feel like that question is part of the reason why I didn't get a call back.",
            "title_similarity": "0.5784448",
            "sentiment_compound": 0.9193
        },
        {
            "id": "hmx9rjj",
            "score": 1,
            "text": "Not always - my company has this problem that we are open for applications, but apart from technical skills you need specific qualifications to be able to work in certain places that we send our workes to. Mainly high value or strategic buildings, with certain security clearences. If we found such person meeting all these points he/she would be hired right away and kept as long as possible.\n\n&#x200B;\n\nEdit: typo",
            "title_similarity": "0.6329046",
            "sentiment_compound": 0.8569
        },
        {
            "id": "hmxal31",
            "score": 1,
            "text": "Or they are growing extremely quickly (very common in the tech world when companies are running on angel investment).",
            "title_similarity": "0.3575319",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxbk78",
            "score": 2,
            "text": "Not really.. some companies just expand consistently and need more staffs. I work in a place where the staff retention is 90% over 10 years. Not a small company either, the biggest in the industry in sydney australia for 10 years straight. They just treat their staffs nicely and pay well above average and are successful in their business to keep expanding slowly and consistently over 10 years and always keep the \"always hiring\" sign on. They pay even the cheapest dumbest entry level positions 3 times minimum wage and get best persons for the job all around because of that and keep growing and expanding. You just need to find a good company to work for, \"always hiring\" signs dont mean shit",
            "title_similarity": "0.43054628",
            "sentiment_compound": 0.9653
        },
        {
            "id": "hmxblen",
            "score": 2,
            "text": "You want a free life pro tip? Never work for Sherwin Williams. They're always hiring. Because people quit on their first break it's so shitty.",
            "title_similarity": "0.7077106",
            "sentiment_compound": -0.2538
        },
        {
            "id": "hmxbqys",
            "score": 2,
            "text": "In software, \"always hiring\" is the default. There's just not enough capable employees to go around.",
            "title_similarity": "0.57983524",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hmxbssj",
            "score": 1,
            "text": "or always have people running screaming ...",
            "title_similarity": "0.6119056",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hmxbt4w",
            "score": 2,
            "text": "My job has had a now hiring banner across the entire side of the building for almost 10 years now. When Covid started the decided to get 2 more now hiring signs to put across the entire front side.",
            "title_similarity": "0.4283021",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxca60",
            "score": 1,
            "text": "No it doesn't -- but it likely means there is high turnover, which is something you should look into.",
            "title_similarity": "0.5608252",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hmxcd5c",
            "score": 1,
            "text": "pretty sure i read something that companies would have to pay back their PPE loans if they weren’t actively hiring",
            "title_similarity": "0.5653088",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hmxckt7",
            "score": 1,
            "text": "Depending. Some are seasonal or use a lot of \"student workforce\" that want to round their finance a bit when the deadlines are less demanding.",
            "title_similarity": "0.49053767",
            "sentiment_compound": -0.079
        },
        {
            "id": "hmxcoty",
            "score": 2,
            "text": "For larger companies, 5-10% annual culling also isn't a bad thing. You get a lot more out of your high performers if underperformers are cycled out in favor of potentially better talent. It also ensures you bring in new ideas regularly without needing to increase budget / headcount, which is a good thing.",
            "title_similarity": "0.3917135",
            "sentiment_compound": 0.904
        },
        {
            "id": "hmxcpqc",
            "score": 1,
            "text": "This may be true for some companies but definitely not ours. I have been “continuously looking for good people” for over 10 years but our turnover rate is well below 8% and we have all the original people we have hired over the years. Many have been with our company since day one when we opened the doors 15 years ago.",
            "title_similarity": "0.46108186",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hmxcrj2",
            "score": 1,
            "text": "Yea, and this is not always a bad thing.  I work for a software company that employs a couple thousand people.  The company is growing and new positions are always being added.  Additionally, when you get to a company of that size, there is always going to be a trickle of people leaving for one reason or another.  There are usually a couple dozen positions being hired at any given time.  I would say this is perfectly normal for most companies this size, and not indiciative of any particular problem.",
            "title_similarity": "0.53285587",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hmxd50m",
            "score": 1,
            "text": "This is not always true. I've worked for a large provider till recently (I quit because I got the chance to work for the goverment) and we're always hiring, because you were unable to find decent people.",
            "title_similarity": "0.76839095",
            "sentiment_compound": -0.0854
        },
        {
            "id": "hmxdcio",
            "score": 1,
            "text": "Or can’t keep good workers",
            "title_similarity": "0.40240765",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmxdene",
            "score": 1,
            "text": "Ehh not true at all companies due it to make it look like there is growth in the company. Most company make fake job posting to make the company look like it's doing better than it is.",
            "title_similarity": "0.6116204",
            "sentiment_compound": 0.5865
        },
        {
            "id": "hmxe7q5",
            "score": 1,
            "text": "If they are always hiring, they are always underpaying.  If you pay enough, you can fill positions fast.  Unless a position requires an uncommon specialty, always hiring means they are putting a lot of effort into trying to keep labor costs down so they will probably be paying badly.",
            "title_similarity": "0.71709085",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmxeesa",
            "score": 1,
            "text": "Mostly true. However I work at a home healthcare company. It's very hard to keep aides because the job sucks for the money. Unfortunately our profit is tied to the rates the government will reimburse us at so it's not very lucrative but very important. \n\nOutside of outliers like this, I agree with you.",
            "title_similarity": "0.49129075",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hmxfa4x",
            "score": 1,
            "text": "It's not always about the money. Having gone through the rat race myself (as practically all of us,) I'm looking more for something that I want to do and would enjoy for the next 20-30 years left remaining of my life (God willing..) Graduate degree definitely in the works, but no flipping burgers or waiting tables or installing roof or solar panels out there in the hot sun for me. Hey, bless those that are doing such. Much respect. Hard work there. Hey, have to earn a living somehow, right?",
            "title_similarity": "0.5305768",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hmxffbl",
            "score": 1,
            "text": "Or people are always quitting \n\nBut I did work at a place once where the owner had an always hiring policy, he would just keep all the best resumes on file",
            "title_similarity": "0.76451683",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hmxfnxc",
            "score": 1,
            "text": "Yet another stupid ass LPT that speaks in absolutes that it doesn’t understand…",
            "title_similarity": "0.4171165",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hmxgc2f",
            "score": 1,
            "text": "One of the best places I ever worked had a zero tolerance policy for tardiness. I missed my alarm one day and that was over. Super high turnover rate, I'd say 1/3 the factory was old-timers and the other 2/3 was people who had been there a few months or less.",
            "title_similarity": "0.60882944",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hmxgmjc",
            "score": 1,
            "text": "My company took a really bad hit from lockdowns. Thankfully most people came back. There is a movie production boom right now and they have literally doubled the vfx team. It's no sign of slowing down and they've literally hired 60+ people in the last 6 months",
            "title_similarity": "0.514244",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hmxh5g4",
            "score": 1,
            "text": "Sometimes the company is also growing really fast.",
            "title_similarity": "0.41274822",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxi1qf",
            "score": 1,
            "text": "Any company that's large enough will always be hiring anyway. If you've got a department of a thousand and 1% quit per year, that's still nearly one per month. If it takes you a month to find a replacement for each employee that leaves (which is not uncommon), then you'll have job ads out pretty much constantly. Add to that any growth the company is experiencing, the need to fill gaps at the bottom as people are promoted up, and usual vacancies arising from retirement, parental leave, long-term illness, sabbaticals, and whatever else, and it doesn't take much for there to be a steady stream of new hires.",
            "title_similarity": "0.64867276",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hmxid3y",
            "score": 1,
            "text": "Or people are just quitting",
            "title_similarity": "0.5179957",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxieso",
            "score": 1,
            "text": "Or experiencing explosive growth.\n\nIn which case, concerns for legacy teams are left by the way side.\n\nI was once at a company where a I, a database and server admin, was paid less than someone manning a payment line for a product that wasn't even our flagship.\n\nThat was an interesting time once everyone got wise and found out as everyone started negotiating 50% to 100%+ wage increases lmao.\n\nOf course, the company was not about that. Offering benefits and hours instead of increasing the wage. The only course was to jump ship.",
            "title_similarity": "0.5537301",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hmxihle",
            "score": 1,
            "text": "If it's from minimum wage jobs it's because people are quitting all the time or it's a sign corporate makes them put up and they aren't really hiring.",
            "title_similarity": "0.715016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxirlg",
            "score": 1,
            "text": "my company hires probably 20 new people a month\n\n70 total people doing said job tho",
            "title_similarity": "0.37970954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxjahn",
            "score": 1,
            "text": "Maybe those people quit because they can't handle the job. Just because a company is always hiring doesn't mean that they fire anybody.  I worked for 3 years in a human resources position where I was \"always hiring\", yet I fired no one. People quit because they could not handle the job.",
            "title_similarity": "0.6709781",
            "sentiment_compound": -0.802
        },
        {
            "id": "hmxjnks",
            "score": 1,
            "text": "It could also be that they are expanding really quickly. My work doubled staff in like 3 years, from 40 to 80.",
            "title_similarity": "0.42927644",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmxk7d5",
            "score": 1,
            "text": "In the industry I work in, it’s very difficult to get skilled people, and often companies are turning down work because they simply can’t get enough staff, they’ll permanently require new employees.",
            "title_similarity": "0.64775217",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hmxktus",
            "score": 1,
            "text": "Never thought about it in that way. Always hiring is now a red flag, thanks!",
            "title_similarity": "0.66312695",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hmxky2z",
            "score": 1,
            "text": "Hired on at a place with such a sign. \"Don't bother signing on unless you can work 12 hour days six days a week!\"\n\nTwo weeks later, \"We're redoing all this, you get 8 hour days, 5 days a week\".\n\n\"Oh yeah, you can only have a break when it doesn't disrupt the schedule.\"\n\nWhat disrupts the schedule?\n\n\"Taking breaks.\"",
            "title_similarity": "0.5379504",
            "sentiment_compound": 0.5466
        },
        {
            "id": "hmxl043",
            "score": 1,
            "text": "My job is always hiring. Not because of poor business practices, low pay, or treating employees bad, though. \n\nMost of the regular need for employees is because we require a good bit of basic tradesmen, and waaaaay too many of them end up having substance abuse issues. In the last year, we’ve gotten rid of nearly 20 people who would do great work sometimes, but then also not show up Monday mornings because of hangovers, or be nodding off on the job from some substance or another. \n\nBy no means am I trying to imply anything about trade workers and substance abuse. In this particular case, it seems to be more related to the city/county location, and not the job itself. \n\nHigh turnover rate USUALLY isn’t a good sign, but it’s also good to remember how incompetent a lot of people can be and realize just how many of them probably shouldn’t have the job they have.",
            "title_similarity": "0.6247128",
            "sentiment_compound": -0.7486
        },
        {
            "id": "hmxlcvm",
            "score": 1,
            "text": "I wish that certain kinds of jobs were more realistic about their employee retainment.\n\nNobody wants to work retail or fast food type jobs forever anymore, unless maybe you're management. They don't pay a thriving wage, they're miserable, and they're mind-numbing. Yet you have to go interview and pretend like you want to McRetire in your 70s and pass down your beloved uniform to your grandchildren.\n\nTraining takes like a couple weeks for jobs like that, why can't you just go in and be like \"yeah I need a job to hold over while I look for another job/save up for a downpayment on a car/pay off some debt/pay for school\"?\n\nHire all entry level employees on a six month basis, if they stick around for another six months they get a bump in pay, rinse and repeat.",
            "title_similarity": "0.6763364",
            "sentiment_compound": 0.9312
        },
        {
            "id": "hmxlwqm",
            "score": 1,
            "text": "Yea, idiot LPT again. Take it from a head of HR, this is fucking not true. Maybe they are so profitable that they just keep growing.",
            "title_similarity": "0.63835245",
            "sentiment_compound": -0.1202
        },
        {
            "id": "hmxm8oa",
            "score": 1,
            "text": "Nah, it's just a revolving door of employees being abused and not putting up with their bullshit.",
            "title_similarity": "0.69403064",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hmxmoxm",
            "score": 1,
            "text": "Thats why premium fire protection ALWAYS has an ad on indeed",
            "title_similarity": "0.5366311",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmxmso1",
            "score": 1,
            "text": "Some companies are simply growing. Whenever I interview for a position, I always ask why the position is open.",
            "title_similarity": "0.55848765",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxn22j",
            "score": 1,
            "text": "This is pessimistic. Lots of placing hiring now to deal with unprecedented growth. Sweeping, wrong, generalization",
            "title_similarity": "0.71300143",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmxnppm",
            "score": 1,
            "text": "Or quiting. Or in the case of EVS and transport in a hospital always graduating and moving up.",
            "title_similarity": "0.61946666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxod8n",
            "score": 1,
            "text": "or just growing and expanding staff",
            "title_similarity": "0.3839311",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxovzi",
            "score": 1,
            "text": "Most people dont care is pretty much everywhere.  Nobody gives a shit.\n\nGet 30 bery large flat panel tv sized boxes and label it DELICATE-MUST STAY VERTICLE WITH ARROW POINTING UP  and tell someone to load up the displays into the back of a small pickup truck.  Out of 10 people every fucking one of the dipshits loaded the boxes wrong.  Took the eleventh person doing the job to actually stop and question me that they wont fit if he followed the instructions on the boxes.  People are really clueless.",
            "title_similarity": "0.5521752",
            "sentiment_compound": -0.954
        },
        {
            "id": "hmxp4zy",
            "score": 1,
            "text": "You can always tell when there is a change in management as well. When a company is suddenly hiring a crap ton of people.",
            "title_similarity": "0.8052256",
            "sentiment_compound": -0.128
        },
        {
            "id": "hmxpzqu",
            "score": 1,
            "text": "In the case of my very VERY large defense company, there are a LOT of people retiring.",
            "title_similarity": "0.62714136",
            "sentiment_compound": 0.4095
        },
        {
            "id": "hmxqeml",
            "score": 1,
            "text": "Or never firing their problem employees and the competent staff all leave regularly.",
            "title_similarity": "0.6765542",
            "sentiment_compound": 0.6591
        },
        {
            "id": "hmxqiqy",
            "score": 1,
            "text": "Fml,  this hits me deep!",
            "title_similarity": "0.42033994",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxqk5v",
            "score": 1,
            "text": "Seeing factories and warehouses with a \"NOW HIRING!\" sign that is literally part of a permanent fixture outside their building is always promising.",
            "title_similarity": "0.4542318",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hmxqnui",
            "score": 1,
            "text": "I disagree. I work in healthcare and we are constantly hiring. Rarely fire. In this field at least you have many positions that people take while in school or as entry jobs (receptionist, medical assistants) so they take it for a year or two and then move on. We always need positions like that even though we aren't firing our existing staff.",
            "title_similarity": "0.6061199",
            "sentiment_compound": 0.4537
        },
        {
            "id": "hmxqq7a",
            "score": 1,
            "text": "This is more of a shower thought than actual advice",
            "title_similarity": "0.34692085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxrvqk",
            "score": 1,
            "text": "Or a company is rapidly expanding…",
            "title_similarity": "0.3808028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmxryq3",
            "score": 1,
            "text": "See one of these posts near me and almost applied.\n\nA year or so later when I was looking to see some options they were hiring again \n\nThe job description is always the same, \"if you don't have common sense don't apply\" type bullshit. The job was just pulling apart wood pallets. They have been hiring for this position since 2015 at least \n\nAlways the same ridiculously condescending job posting.",
            "title_similarity": "0.6027558",
            "sentiment_compound": 0.171
        },
        {
            "id": "hmxsdcg",
            "score": 1,
            "text": "Or it could mean they are rapidly expanding. Lots of successfull startups have a hiring spree, when they secured enough VC for the next phase.",
            "title_similarity": "0.488284",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hmxsirg",
            "score": 1,
            "text": "You better bring Kevlar vest with you on the first day.",
            "title_similarity": "0.25582767",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmxt0ux",
            "score": 1,
            "text": "I interviewed a long time ago for a job as chef in a semi-nice place. During the interview I asked the Manager, \"How come you always have Help Wanted signs up and advertised on Craigslist?\"...\n\nShe replied because people just don't understand how to work anymore. during the interview She stopped talking to me to yell at 2 servers to stop talking in the break area and go back to work.  - The place was empty....\n\nAt the end of the interview she offered me a job, I refused and told her it's because she's a bitch and No one likes working with her.\n\nNext interview I had, the manager talked to me about it because she called everyone she knew and tried to blacklist me (smaller community). We had a great laugh and I worked for him for 2 years ;)",
            "title_similarity": "0.6694525",
            "sentiment_compound": -0.2805
        },
        {
            "id": "hmxt493",
            "score": 1,
            "text": "I previously worked at a medical lab. we had roughly a little less then 300 employees.   \nPart of my job was to make sure anyone who left the company had all permissions and security clearances canceled. I cleaned up the folder where these documents where kept to make it easier to navigate. Found we where going through over 100 employees a year so basically we where replacing 1/3 of our workforce every year. And just so you know, these where mostly people who would be sticking needles in your arm and drawing multiple tubes of blood.",
            "title_similarity": "0.52813435",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hmxt4va",
            "score": 1,
            "text": "Or… they’re going through a period of growth and need people?",
            "title_similarity": "0.46939135",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmxt8wo",
            "score": 1,
            "text": "They could also be growing",
            "title_similarity": "0.23613739",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxtwv6",
            "score": 1,
            "text": "Even if you try to keep a low profile and fly under the radar, there is a toxicity that is 100% airborne.",
            "title_similarity": "0.39708298",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmxu4uw",
            "score": 1,
            "text": "Or always growing. I work for a tech firm that is widely regarded as a great place to work, and it's constantly growing. So fast we can't hire as fast as we'd like to.",
            "title_similarity": "0.55087465",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hmxubc8",
            "score": 1,
            "text": "Yet another fucking brain dead “tip”. God this sub is awful.",
            "title_similarity": "0.52800775",
            "sentiment_compound": -0.7564
        },
        {
            "id": "hmxusbh",
            "score": 2,
            "text": "This is rash overgeneralization",
            "title_similarity": "0.44093126",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hmxv0hs",
            "score": 1,
            "text": "All companies are always firing. Does OP think some don't fire for theft or harassment?",
            "title_similarity": "0.8528388",
            "sentiment_compound": -0.5946
        },
        {
            "id": "hmxv6ds",
            "score": 1,
            "text": "My team is always hiring because we hire well and people get promoted/poached by other teams =/ Great for the organization but hell on the hiring managers (I.e me)",
            "title_similarity": "0.7053764",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hmxw3xp",
            "score": 1,
            "text": "It’s most likely that people are dying on the job and they are just good at hiding the bodies.",
            "title_similarity": "0.5666305",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxw575",
            "score": 1,
            "text": "The often unasked question of employers should be \"What is your turnover rate?\" If they fall to give you a straight answer, it's probably very high.",
            "title_similarity": "0.6555168",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hmxwh4d",
            "score": 1,
            "text": "Or, you know.... The company is in a growth phase.  Context matters a lot here.",
            "title_similarity": "0.40794802",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hmxwo6u",
            "score": 1,
            "text": "Or the firm is growing quickly",
            "title_similarity": "0.35961443",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmxwz9m",
            "score": 1,
            "text": "Ahhhh yes, Call Centers. The epitome of the workplace binary jungle: It's either a spawning pool of hyperaggressive middle management losers trying to enforce every rule with a zero tolerance policy, or bleak wasteland where you're handed expectations and can accomplish literally nothing while still getting a paycheck because the chain of command is too long for anyone in the building to give a shit.\n\nEither way, the turnover rate is astonishingly high.",
            "title_similarity": "0.6968796",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hmxxkqq",
            "score": 1,
            "text": "Or such a shitty place to work people always quitting.",
            "title_similarity": "0.74682295",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmy014w",
            "score": 1,
            "text": "For anyone thinking they might change jobs in the next year - 6 months, take the time to look around at jobs now, odds are you'll see the same job come up at the same places over that time. It's an excellent way to know to avoid working there - either someone saw a trash fire and got out of there in that short of time, or they were let go. I've even seen the same job go up 3 times in < a year at one place I thought I would be interested in. It's saved me a lot of grief!",
            "title_similarity": "0.63330615",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hmy01gm",
            "score": 1,
            "text": "Goes double if they say anything passive aggressive in their posts about previous hires.",
            "title_similarity": "0.62232256",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hmy1fe4",
            "score": 1,
            "text": "Well, not necessarily. The retail location I work at can't hold on to anyone, even after raising our base pay. And our team is great. Pay could still be better, obviously. Everyone's pay could still be better.\n\nBut our last new hire couldn't handle her first day because... I dunno. The workload really isn't that bad, my team is really good at supporting eachother. To me, she seemed to have the attitude that she wouldn't need to do much.\n\nThe guy before her lasted maybe 2 weeks, and was late to 4 out of his first 5 scheduled shifts. He had a go-getter attitude, and begged that he needed the job after being 2 hours late for one of his shifts. He ended up getting fired for \"saying something he shouldn't have\". Which, honestly, is really hard to do. You have to blatantly break a company policy doing something that is just common sense wrong. Even then, it takes about 2 weeks to be escalated and sent through the proper channels.\n\nRetail now is a shitshow because there are actually people who just \"don't want to work\". And those rotten apples spoil the bunch. We know this isn't a career, but we try to make it an environment that you're not just gonna say \"fuck it\" and walk out within a few weeks.\n\nSome people just can't handle working retail, and somehow flip the blame on us. You still have to have a work ethic. You accepted the offer.\n\nNo, I'm not management. I'm just tired of seeing my team suffer because a weak link was only thinking about themselves.",
            "title_similarity": "0.5567118",
            "sentiment_compound": -0.9667
        },
        {
            "id": "hmy460t",
            "score": 1,
            "text": "Or also just never actually hiring.",
            "title_similarity": "0.30702817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmy5hqb",
            "score": 1,
            "text": "Or people are always quitting....",
            "title_similarity": "0.769452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmy5ngu",
            "score": 1,
            "text": "Thank you telling me that!",
            "title_similarity": "0.2268353",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hmy9eig",
            "score": 1,
            "text": "We had a place called PRC nicknamed \"people recycling center\"",
            "title_similarity": "0.33562627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmybiwf",
            "score": 1,
            "text": "Yeah, usually means their door is for a revolving shithole.",
            "title_similarity": "0.5669701",
            "sentiment_compound": 0.296
        },
        {
            "id": "hmybn4v",
            "score": 1,
            "text": "No... no no.\n\nPeople show up for one day and are never heard from again.",
            "title_similarity": "0.46909618",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmye9az",
            "score": 2,
            "text": "basically amazon",
            "title_similarity": "0.1812688",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hmyegba",
            "score": 1,
            "text": "No doubt. It's ture but there are some reasons. In some cases that is. My place, I have our hiring sign up all the time. How many applications I get. Well. Not all too many. Not sure why, very comfy work not like the food service. Still no degrees needed.🤷‍♂️ I just need these lil crack heads and Meth Bunnies to stop thinking I'm going to keep them. \nI am disappointed in all these people saying, \"we are understaffed and can't find anyone.\" Go and fill out their applications just for the fun of it. See if you get a call back. You don't, target, Walmart and all those people are just pumping that cock like an old man in a book store.",
            "title_similarity": "0.6944107",
            "sentiment_compound": -0.5931
        },
        {
            "id": "hmygl77",
            "score": 2,
            "text": "I worked for a guy for a while who always kept the sign up \"because you can always find someone better than your worst employee\".\n\nAnd you'd know he thought you were the worst employee when you were the one whose hours got cut as soon as a new person was trained. Sometimes, he'd even schedule the \"worst\" employee for these pointless short cleaning shifts, so that when they no showed, they weren't even scheduled for something he'd have to cover.",
            "title_similarity": "0.70538616",
            "sentiment_compound": -0.9287
        },
        {
            "id": "hmygzb3",
            "score": 1,
            "text": "Yes to a certain point but there’s some positions that are insanely hard to hire for I have taken months to hire some niche positions in a tough market. Sometimes even after a year I don’t find what I need",
            "title_similarity": "0.5542413",
            "sentiment_compound": 0.0129
        },
        {
            "id": "hmyid1p",
            "score": 1,
            "text": "I see more people quitting. My Dunkin is perpetually hiring because we just have so little staff, and since I've started working their, the only two new people left for one reason or another. I've had to call out of numerous shifts (most of which were due to a lot of personal bullshit I've gone through this fall) and I still have my job.\n\nFortunately it seems the massive bullshit has ended and I can finally stick to my shifts again. My boss is also really nice and everyone who works there is really nice to so I definitely count my stars with my job.",
            "title_similarity": "0.7069683",
            "sentiment_compound": 0.1442
        },
        {
            "id": "hmykgub",
            "score": 1,
            "text": "USPS is pretty much always hiring. Carrier positions have very high turnover due to the hours for new carrier assistants, getting called in for weekends and holidays and management issues.   You just have to not screw up in the first 90 days and have no major issues when they do your 1 year review. With overtime some newer carrier assistants are on track to make over 70k.",
            "title_similarity": "0.5769187",
            "sentiment_compound": 0.5988
        },
        {
            "id": "hmylth3",
            "score": 1,
            "text": "Yeah not true. Always watch out for red flags but this should not be a blanketed statement. My most recent position I was hired for was extremely difficult to fill. It took forever for them to get a good candidate. I am now in working with an excellent team and making more money than I ever have. If I went by why I thought this wasn't filled, I would have never gotten the job.",
            "title_similarity": "0.620419",
            "sentiment_compound": 0.7306
        },
        {
            "id": "hmyogfy",
            "score": 1,
            "text": "Or it's just a shitty place to work, thus it has a high turnover.",
            "title_similarity": "0.61593807",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hmysno9",
            "score": 1,
            "text": "I have never seen someone use the leg emoji before, and you’ve made your post at least 20% more cursed by doing so",
            "title_similarity": "0.4917413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmyu7lc",
            "score": 1,
            "text": "That's not anyways true. I work for one of the best companies in my market, and we are always hiring because we have so many full life employees that are now retiring - which is a big factor. Also, we are growing, so we are recruiting for that too.\n\nOur challenge is the above problems (good to have, right?) mean that we need more than 5% of our headcount in new recruits in the next 12 months. Close to 100 per month. \n\nSuch a good company that after I left (for a little more money - whoops) it took me over 10 years to get recruited back in. I won't make that mistake again.",
            "title_similarity": "0.5197973",
            "sentiment_compound": 0.8403
        },
        {
            "id": "hmz9ylu",
            "score": 1,
            "text": "Unless you in the UK then its more likely employees resigning",
            "title_similarity": "0.5803188",
            "sentiment_compound": -0.2878
        },
        {
            "id": "hmzby5i",
            "score": 1,
            "text": "The hospital that I just got hired on is a great place to work(per family and friends). They’re hiring like crazy and paying out sign-on bonuses for pretty much every role.\n\nIt’s a combination of growth, and getting good quality applicants.",
            "title_similarity": "0.54515666",
            "sentiment_compound": 0.9618
        },
        {
            "id": "hmzh11e",
            "score": 1,
            "text": "What if they're just successful???",
            "title_similarity": "0.21214522",
            "sentiment_compound": 0.6531
        },
        {
            "id": "hmztnvt",
            "score": 1,
            "text": "If they’re always hiring, it *could* mean people in that particular position are getting poached or promoted. OP is usually right, but not always. Would be a bummer to miss a great opportunity because you assumed they were always firing, rather than offering good enough training that promotions and offers are going to happen.\n\nEveryone should ask why the position is open in your interviews. Every single time.",
            "title_similarity": "0.7927043",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hn01oup",
            "score": 1,
            "text": "Or… they’re just growing a lot?",
            "title_similarity": "0.36424124",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hn02dbf",
            "score": 1,
            "text": "Im 22 and have worked about 20 jobs now. I know someones going to think oh he must have been fired a lot. Never been fired. As a short explanation I worked in high school then moved to college worked moved back home after a semester cause of financial problems then worked then moved to Georgia to be meet my dad who just got sober for the first time in my life and worked multiple jobs at a time and moved out of his apartment to another place in Georgia my own place then worked a different set of jobs then moved to NC to be with my girlfriend who id been dating for 4 years at that point and started working another set of jobs and have moved from some of those jobs onto owning my own company and working part time elsewhere. \n\nSo having a bit of experience in lots of different environments at different types of jobs i can honestly say it really depends on the company. I can walk in the door of a business and talk to one person that works there and tell you exactly what the problems are. Sometimes a business is always hiring because of bad turnover rates, could be a college town, could be a bunch of people quit all at once and they hired a big group of people after who also quit all at once and that keeps happening because the business is run very poorly. Could be that the managers have unrealistic expectations for their staff and they keep firing people because they cant live up to their expectations. It could also be that the company is growing at such a rapid pace and is really in need of people all the time.\n\nThese are just a few more common examples. You never really can know for sure why some place is always hiring so I suggest to anyone who is thinking about not inquiring about a job somewhere because they are always hiring just to go in and talk to some of the employees or the business owner. Go ahead and try to get a job there work there for a week and be ready to quit.\n\nLooking for a job is a lot like dating nowadays. If you look at a picture of them and decide off of their looks you could be really disappointed or miss out on a really good one. But what i see most is people are afraid to hop one job to another or even work multiple jobs. To find the right one for them. A lot of times this is why the shitty business are still going too. Businesses get away with treating people like garbage cause people keep going to work for them and staying in these jobs.",
            "title_similarity": "0.4938063",
            "sentiment_compound": -0.5676
        },
        {
            "id": "hn13dil",
            "score": 2,
            "text": "True story. I was “seasonally” laid off from my serving job two weeks ago. I asked them if they’d give me hours when they had them and manager said “probably.” When I finally got to talk to HR they were surprised I was surprised the lay off was permanent and I had to be rehired and go through training all over again in the spring. They have a “Now Hiring” sign outside, and have had one there all Spring, summer, and fall.",
            "title_similarity": "0.6319395",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hn2ctsr",
            "score": 1,
            "text": "Sometimes it's just a high churn industry. My current employer (restaurant/casino) only fires for gross misconduct, like using illegal drugs on site, on shift, or being terrible to a customer. But it's hard to find kitchen staff without severe substance abuse issues. We've hired folks who live in a homeless shelter, knowing many will leave as soon as their first check arrives.",
            "title_similarity": "0.661713",
            "sentiment_compound": 0.4172
        },
        {
            "id": "hn7kqxu",
            "score": 1,
            "text": "It depends on what you do and where you work. I’m an engineer and our company literally cannot hire enough people.",
            "title_similarity": "0.5344169",
            "sentiment_compound": 0.0
        }
    ]
}