{
    "LPT: If you have a kid who wakes up everyone way too early on Christmas, wrap a small lego set for them in their room. They can wake up and start their Christmas early with building a toy while everyone else can get some extra time to sleep\nEdit: thanks for the awards kind strangers! I was absolutely a day/week late with this but while I don’t have kids I wanted to share something my dad did for me growing up that made the day really special- the Lego set was something I always looked forward to and thought others might like to try as well- happy holidays!": [
        {
            "id": "hpxaup2",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.42871678",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hpxn7cv",
            "score": 1,
            "text": "That's a great LPT to get your kid to choke on Lego while everyone else is asleep",
            "title_similarity": "0.6655854",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpxhjmf",
            "score": 6,
            "text": "More like wake up to the sound of your kid choking on Legos.",
            "title_similarity": "0.56271935",
            "sentiment_compound": -0.0534
        },
        {
            "id": "hpxhvqv",
            "score": -16,
            "text": "Alternative solution: condom/abortion. Don't let social pressure or your primitive instincts lead you down a path of servitude to small humans. LPT!",
            "title_similarity": "0.35123825",
            "sentiment_compound": 0.5393
        },
        {
            "id": "hpxj941",
            "score": 12,
            "text": "I don’t get why yall just can’t get up. It’s supposed to be their morning, not your morning to sleep in.",
            "title_similarity": "0.5824834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxqxko",
            "score": 13,
            "text": "LPT: Be a parent and tell the little crotch-goblin to go back to bed.",
            "title_similarity": "0.60279346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxp32q",
            "score": 5,
            "text": "Or tell that little idiot to go back to bed? Or just get up",
            "title_similarity": "0.47368938",
            "sentiment_compound": -0.4601
        },
        {
            "id": "hpxgviv",
            "score": 3,
            "text": "Padlock also does the trick",
            "title_similarity": "0.24361756",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpxq7mo",
            "score": 3,
            "text": "Did this, my 1 year old choked on a Lego and now I can sleep in as late as I want. Great tip op.",
            "title_similarity": "0.75669974",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpxousq",
            "score": 2,
            "text": "Girlfriends little brother set alarms at 5:00am and every 5 minutes the snooze would go off which he didn’t wake up too or turn off until we went in an yelled at him. So, I spread a bunch legos all over his bedroom so when he gets out of bed he will have to step on them to get out of his room. Little fucker is 24 years old",
            "title_similarity": "0.7520623",
            "sentiment_compound": -0.7044
        },
        {
            "id": "hpxfn9d",
            "score": 56,
            "text": "Instead of teaching them to be patient, let's just fuck them off so we don't have to be responsible parents.\n\nAs I was a kid in a house with 4 adults and 7 additional siblings, it took 2-3 hours for everyone to get up and be in the living room. Waking up early for christmas is not new. You know how my parents handled it? Not allowed to wake people up. If you are a parent, you have the authority. Also, she would find little things to delay you till everyone was up and ready. Take out the trash so we have somewhere to put wrappers, if coffee pot was low, make a new one. That will save 5 minutes of coffee brewing for the people just waking up. Start to separate presents into piles for everyone. Is your bed made?\n\n\nDon't give them what they want just to get them off your back. Make them work for it or make them wait like everyone else.  I'm glad my parents raised me this way. I don't expect anything untill I have done something for deserve it. \n\nYou want a bratty kid that whines when they don't get what they want when they want it? wrap a Lego present so they can build that feeling of entitlement from a young age instead of making them wait...",
            "title_similarity": "0.79251504",
            "sentiment_compound": 0.7652
        },
        {
            "id": "hpxgbkw",
            "score": 166,
            "text": "Or you could just tell your kid to go back to bed and wait a little while.  Kids don't have to be constantly tricked and/or appeased, they're not bored gods.  \"Shut up, go back to bed\" has been working just fine for centuries.",
            "title_similarity": "0.70402133",
            "sentiment_compound": 0.443
        },
        {
            "id": "hpxy5mp",
            "score": 0,
            "text": "Or.. tell the child to lay back down.",
            "title_similarity": "0.12508121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxyxrh",
            "score": 0,
            "text": "LOL, my parents had a rule of shut up until they get up or we'd get an ass beating *and* no gifts.",
            "title_similarity": "0.4855356",
            "sentiment_compound": -0.633
        },
        {
            "id": "hpy1eya",
            "score": 0,
            "text": "Or, begin parenting your child so they don't become codependent, narcissistic, or both.\n\nChildhood is when humans learn the self-soothing mechanisms which they will carry for the rest of their lives.\n\nParenting is a full-contact activity, and literally anything you do that allows instinct to run afoul of social norms is damaging your child's future, and the lives of everyone they come into contact with. Raw human instinct is very, very contrary to what is absolutely necessary to become a contributing member of a society. The ability to receive that training is only available for a tiny window at the very beginning of our lives.\n\nPlease, please, please - don't screw your child over by simply catering to whatever makes them easier to parent.",
            "title_similarity": "0.66546196",
            "sentiment_compound": 0.7903
        },
        {
            "id": "hpy2ul2",
            "score": 0,
            "text": "This post brought to you by Lego ^^^^TM",
            "title_similarity": "0.37145376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy43bi",
            "score": 0,
            "text": "Or just... Don't have kids and sleep in for the rest of your life",
            "title_similarity": "0.30402702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxhnxm",
            "score": 70,
            "text": "This is such a specific and over-the-top solution to a complete non-issue, it's almost surreal.\n\nIf I were to define \"first world problems\" I'd show people this.",
            "title_similarity": "0.4395345",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpxrqlc",
            "score": 6,
            "text": "Hey everyone, if you have a kid with bad habits dont try and break them reinforce them!",
            "title_similarity": "0.4031194",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hpxig81",
            "score": 38,
            "text": "Make them wait like everyone else. Teach your kids patience. Do not try and manage them like this… LPT is not P what-so-ever.",
            "title_similarity": "0.43816477",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpy28bs",
            "score": 3,
            "text": "Or you could you know, teach your kid some discipline. God forbid.",
            "title_similarity": "0.35686198",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpxw13f",
            "score": 1,
            "text": "ULPT: Keep the little bastards up until 1am waiting for santa, you'll be able to sleep until noon.",
            "title_similarity": "0.6760013",
            "sentiment_compound": -0.5729
        },
        {
            "id": "hpxypuj",
            "score": -1,
            "text": "Gonna be honest, if I ever have a kid that likes legos I’m gonna die. Legos always stressed me out as a kid lol",
            "title_similarity": "0.6805211",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hpxzmwv",
            "score": -1,
            "text": "Haha exactly why I'm not having kids you fucks, don't have to worry about any of this on christmas.",
            "title_similarity": "0.4485867",
            "sentiment_compound": 0.3195
        },
        {
            "id": "hpy0vhs",
            "score": 1,
            "text": "\"If you have a kid who wakes up early on Christmas....\"\n\n\n\n\n\n\n\nYou mean, if you have a kid? This is such a silly tip. Kids are going to wake up early on Christmas and it's not a big deal.",
            "title_similarity": "0.76862395",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hpy2gwf",
            "score": -1,
            "text": "Or even better protip: Buy a set from a brick company other than lego, so you get \n\n- prettier sets and \n\n- more bricks \n\n- in better quality \n\n- for a lower price\n\nthan from LEGO®",
            "title_similarity": "0.539598",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hpxlig3",
            "score": 24,
            "text": "LPT: don’t get kid advice from people who don’t have kids",
            "title_similarity": "0.24007621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxd2lm",
            "score": 60,
            "text": "Or they could literally play with any other toy in their room.\n\nOr you can tell them the night before to stay in bed.",
            "title_similarity": "0.650075",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpxypl4",
            "score": 4,
            "text": "LPT: Reward your children for being impatient.",
            "title_similarity": "0.41537595",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpxznfv",
            "score": 0,
            "text": "Thanks for posting this 3 hours ago, jfc I’ve been up since 6 am",
            "title_similarity": "0.45707548",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpxzx1n",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.11819923"
        },
        {
            "id": "hpy17ve",
            "score": 0,
            "text": "My daughter did NOT wake me up, I woke up at 8am on the dot to a mess.  I’m just grateful that I’m no longer exhausted anymore so sleeping in for one hour is all I need.",
            "title_similarity": "0.6899033",
            "sentiment_compound": 0.1053
        },
        {
            "id": "hpy1ixv",
            "score": 0,
            "text": "If you have kids that would wake up early you already know this would not work for you.",
            "title_similarity": "0.46158084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2dsu",
            "score": 0,
            "text": "Lock the door from the outside",
            "title_similarity": "0.14302224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2lyt",
            "score": 0,
            "text": "This isn’t as feasible to do these days but my parents used to set the clocks in our house back an hour or two. Worked like a charm.",
            "title_similarity": "0.65313506",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hpy41fn",
            "score": 0,
            "text": "Instructions unclear- I now have a Lego piece stuck up my nose.",
            "title_similarity": "0.43266365",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpy46ob",
            "score": 0,
            "text": "So pay an additional 50 bucks per small child, no thank you.",
            "title_similarity": "0.35615003",
            "sentiment_compound": -0.422
        },
        {
            "id": "hpy4kis",
            "score": 0,
            "text": "Or the kid goes berserk",
            "title_similarity": "0.0683611",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyn9ku",
            "score": 0,
            "text": "Or just dont have kids",
            "title_similarity": "0.06020925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyv984",
            "score": 0,
            "text": "Folks did this for me every year when I was a kid, it worked.",
            "title_similarity": "0.52875555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz9lnu",
            "score": 0,
            "text": "Should have gotten a Lego set for my 8 month old who wakes up at 5 am evert morning",
            "title_similarity": "0.66557246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxm7b0",
            "score": -7,
            "text": "Let's all let children play with choking  hazards unsupervised.   Genius.",
            "title_similarity": "0.47565204",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hpxp5ol",
            "score": -1,
            "text": "I though they OP was going to suggest to open some Legos and let them in the floor ski the kid ateo on them XD",
            "title_similarity": "0.65100276",
            "sentiment_compound": 0.6739
        },
        {
            "id": "hpxpjbo",
            "score": 1,
            "text": "Make sure the kid likes Legos first. Buying me a Lego set when I was a kid would've been a waste.",
            "title_similarity": "0.6740929",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpxrz81",
            "score": 1,
            "text": "Growing up, my dad was a baker and would work all night the 23rd so Santa came Christmas Eve. Thus allowed him to sleep on Christmas.",
            "title_similarity": "0.78876793",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpxsf07",
            "score": 1,
            "text": "Where I live (Sweden) we have something called “Christmas sock”, hanging on the kids room door. The idea is that Santa puts one present there during the night for the kids to open early and keep them occupied until Santa finally comes back.  \nIt’s genius, surprised to hear it isn’t the same where you live!",
            "title_similarity": "0.8351004",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hpxwo5n",
            "score": 1,
            "text": "Or just get a lock on your door so they can’t come in and tell them ahead of time that if they open their presents before we wake up, then I’m taking them all back to the store and they won’t get any next year",
            "title_similarity": "0.6429109",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxy3ic",
            "score": 1,
            "text": "Or they can just wait like everyone else.",
            "title_similarity": "0.2383828",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpy0oia",
            "score": 1,
            "text": "Get them back to sleep and make them learn what is waiting. And you, parents, learn what is good parenting.",
            "title_similarity": "0.5874975",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy0r81",
            "score": -1,
            "text": "This was written by someone with no kids I presume. Great in theory, no chance in reality.\n\nMerry Xmas to those who celebrate!",
            "title_similarity": "0.6151593",
            "sentiment_compound": 0.8642
        },
        {
            "id": "hpy15ec",
            "score": -1,
            "text": "LPT: Always make sure you have kids before you submit LPTs about kids.",
            "title_similarity": "0.4835013",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpy1ut1",
            "score": -1,
            "text": "Given when this was posted this is good info (maybe) for those in Australia and it's environs.\n\nOr, the rest of us to possibly remember 365 days from now...",
            "title_similarity": "0.38505974",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy28c4",
            "score": 1,
            "text": "This post sponsored by LEGO®!",
            "title_similarity": "0.3438039",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2mcx",
            "score": -1,
            "text": "I take it you don't have kids then.",
            "title_similarity": "0.08092362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy3abd",
            "score": 1,
            "text": "I told the kids that our house was late on santa's route, and if they got up before 7:30, Santa may see them and not leave their toys.",
            "title_similarity": "0.7898395",
            "sentiment_compound": 0.0382
        },
        {
            "id": "hpy3ni2",
            "score": 1,
            "text": "Or don’t encourage behavior that can be managed better.",
            "title_similarity": "0.053477224",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpy3nx9",
            "score": 1,
            "text": "One year We were going by the stocking rule. My brother got Majora's Mask and I got Banjo Tooie in our stockings and it was awesome except that in Majora's mask you can't save the game until the first 3 in game days are over and that broke the '1 hour each rule' but also it was really magical watching my brother play it and I wish I could go back in time and not be such a little shit.",
            "title_similarity": "0.7400883",
            "sentiment_compound": 0.256
        },
        {
            "id": "hpy4vem",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.11819924"
        },
        {
            "id": "hpy51gv",
            "score": 1,
            "text": "Teach them about [Krampus](https://www.britannica.com/topic/Krampus). Then tell them that anyone who wakes you up before you're ready, Krampus will come for them.\n\nThen you just tailor it to your liking. I always told the kids that we'd open presents at 10 am. Earlier if mom woke up earlier. Breakfast would be made, scarfed down and kids sorting presents under the tree in piles. \n\nThe only problem I ever had was my youngest getting scared and crawling into bed with us at 2 am or so. But then the bugger would try to sleep till noon! LOL \n\nMaybe the trick is to buy the kids really good comfortable mattresses?",
            "title_similarity": "0.8406428",
            "sentiment_compound": 0.9408
        },
        {
            "id": "hpy6wi3",
            "score": 1,
            "text": "Or be a parent and not let them open till everyone is up",
            "title_similarity": "0.42982435",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyfkoy",
            "score": 1,
            "text": "Or, be a parent and tell them not to leave their room until Mom, or Dad gets them. I realize that's a tough thing to ask these days.",
            "title_similarity": "0.512373",
            "sentiment_compound": -0.0905
        },
        {
            "id": "hpxl351",
            "score": 8,
            "text": "Bro that is some wishful thinking. Ain’t no kid gonna unwrap a Lego set and then immediately start building it quietly without waking everyone up to see their other gifts 😂",
            "title_similarity": "0.6985825",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpxjhu3",
            "score": -2,
            "text": "Buy a PS5.\n\nMy mom did it with a PS1, and totally worth it. I woke up to play, my mom slept all morning. It was a win-win.",
            "title_similarity": "0.72015285",
            "sentiment_compound": 0.5563
        },
        {
            "id": "hpxqmua",
            "score": 2,
            "text": "Or parent your kids and teach them respect instead of punting your duties with a toy...",
            "title_similarity": "0.448955",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpxvtzb",
            "score": 2,
            "text": "Or just teach your kids some patience and manners",
            "title_similarity": "0.29414788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxzlh8",
            "score": 2,
            "text": "Rewarding undesireable behaviour?",
            "title_similarity": "0.07198248",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hpy234y",
            "score": 2,
            "text": "This LPT brought to you by the 10 year old gang",
            "title_similarity": "0.42711735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy23r0",
            "score": 2,
            "text": "Just act like a parent and set boundaries then discipline them if they break them. It's times like these that are teachable moments for creating functional members of society so try not to sidestep them",
            "title_similarity": "0.46550313",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpy2thm",
            "score": 2,
            "text": "Spread the legos on the floor of their bedroom. That'll slow em down",
            "title_similarity": "0.6636957",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy37rq",
            "score": 2,
            "text": "LPT, get control of your household. It's a much better time than resorting to compromising with your child like they are an adult.",
            "title_similarity": "0.5422369",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hpyccts",
            "score": 2,
            "text": "Or just teach your kid patience, and not to be materialistic",
            "title_similarity": "0.2601183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpycg4d",
            "score": 2,
            "text": "Or you can teach your children patience and respect",
            "title_similarity": "0.2611503",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpxs5x1",
            "score": 10,
            "text": "This is terrible",
            "title_similarity": "-0.07141641",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpxjv9k",
            "score": 3,
            "text": "Better yet, strew it around the bedroom and that will teach him.",
            "title_similarity": "0.516248",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy096b",
            "score": 3,
            "text": "Or just wake up with your kids and enjoy their excitement. It's 1 time a year, one day you'll wish you had those days back. :(",
            "title_similarity": "0.652913",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpy0wn4",
            "score": 3,
            "text": "Brooooo that’s so smart I hope I remember this if I have kids",
            "title_similarity": "0.4514419",
            "sentiment_compound": 0.7687
        },
        {
            "id": "hpy2nm0",
            "score": 3,
            "text": "lol no wonder so many kids are shits. LPT: Raise you child to be respectful enough that when you tell them to stay in bed until 7, they do.",
            "title_similarity": "0.6939832",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpxtufm",
            "score": 13,
            "text": "Lol reward your child for undesired behavior. Great plan.",
            "title_similarity": "0.45396155",
            "sentiment_compound": 0.891
        },
        {
            "id": "hpxco3g",
            "score": 77,
            "text": "We would unwrap one present the night before then play with that. No kid should unwrap their gift alone",
            "title_similarity": "0.60654634",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpxkpkk",
            "score": 4,
            "text": "Here in Finland, Santa visits children in-person on Christmas Eve, and gifts are opened.\n\nThat way, parents get to sleep in on Christmas Day.",
            "title_similarity": "0.7726747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxtqts",
            "score": 4,
            "text": "This isn’t an LPT because results will vary dramatically. If anything, when I was young, I certainly wouldn’t have stopped waking people up because I already had a toy in my room when I awoke, lol. I’d want them to see my gift(s). Can we get some better content here?",
            "title_similarity": "0.80559075",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hpxu05o",
            "score": 5,
            "text": "Is this something you’ve done or is this a dumb idea that you just came up with and haven’t tested",
            "title_similarity": "0.23940927",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hpy2jkh",
            "score": 5,
            "text": "Or teach them restraint",
            "title_similarity": "0.043310795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxgcao",
            "score": 19,
            "text": "My family used to just let us open some presents on Christmas Eve right before bed and then we could play with those toys in the morning.\n\nIt’s too much anticipation for a lot of kids to be able to really get a good night sleep, and then you expect them to spend the day with family and potentially staying up later than usual.",
            "title_similarity": "0.8997334",
            "sentiment_compound": 0.7152
        },
        {
            "id": "hpxq6ux",
            "score": 5,
            "text": "that's not how kids or Christmas work",
            "title_similarity": "0.23444721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy1zk4",
            "score": 6,
            "text": "Just get up, eventually they won't even care to get up early and you'll be missing those days when they were that excited. \n\nSource: Father of kids getting older and missing the old days big time.",
            "title_similarity": "0.6732105",
            "sentiment_compound": -0.5615
        },
        {
            "id": "hpxg64d",
            "score": 22,
            "text": "For whatever reason I never got into Lego. Does one build the set one time and then play with that forever, or is disassembling and reassembling it part of the fun?",
            "title_similarity": "0.64608765",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hpxm7v8",
            "score": 6,
            "text": "I thought this was going to say set up a Lego at their bed side so they wake up and step on it to immobilize them",
            "title_similarity": "0.70760393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxmiz4",
            "score": 7,
            "text": "Yeah right. They come down screaming about how Santa left them a gift in their room and see the rest. There's no stopping this. Good thought though",
            "title_similarity": "0.71206975",
            "sentiment_compound": 0.7044
        },
        {
            "id": "hpxujvt",
            "score": 7,
            "text": "I did this with my daughter (minus the wrapping) while she was growing up every weekend. Leave Legos, coloring books, anything really on the living room table and she'd be busy while we slept. It really got her brain working and she'd be much happier throughout the day. Gotta stimulate those young minds.",
            "title_similarity": "0.8344605",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hpxr8hk",
            "score": 18,
            "text": "[deleted]",
            "title_similarity": "-0.11819924"
        },
        {
            "id": "hpxrmhi",
            "score": 27,
            "text": "Or tell them to go back to bed",
            "title_similarity": "0.27977622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxgfff",
            "score": 215,
            "text": "That ain't halting my kids.",
            "title_similarity": "0.1918155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxemtq",
            "score": 245,
            "text": "This is what I did this morning… but for myself.. I’m 31",
            "title_similarity": "0.4125142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxloaf",
            "score": 333,
            "text": "Smart but getting up early is as part of the tradition as anything for me",
            "title_similarity": "0.54126644",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hpxg97r",
            "score": 150,
            "text": "A small lego set? You want them to be distracted for about 10 minutes lol?",
            "title_similarity": "0.5845549",
            "sentiment_compound": 0.264
        },
        {
            "id": "hpxj05u",
            "score": 39,
            "text": "Incorrect. Everyone will wake up and step on Legos.",
            "title_similarity": "0.5266843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxk5t2",
            "score": 41,
            "text": "A BIT LATE DONT YOU THINK",
            "title_similarity": "0.15218526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxmlyd",
            "score": 103,
            "text": "not necessary in germany. we open gifts at 4 pm dez 24th. when kids awake, they go to the livingroom, eat chocolate and play with the gifts.",
            "title_similarity": "0.74873877",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpxnvd8",
            "score": 48,
            "text": "So funny story - when we were kids my brother woke up SUPER early before anyone else… snuck downstairs and picked a gift out and unwrapped it. Turned out to be a Lego set and he built the whole thing before anyone else woke up and didn’t tell our parents either. So fast forward to everyone being awake and opening gifts and we’re wrapping up and my mom and dad look at each other and were like hmm something is missing. Well, they figured it out and he definitely got yelled at BUT at the same time, my parents were super impressed that he built the whole thing so quickly",
            "title_similarity": "0.87068576",
            "sentiment_compound": 0.9578
        },
        {
            "id": "hpxilji",
            "score": 121,
            "text": "My partner is from the UK, and told me they would get their stockings at the end of their bed. So as kids, they'd wake up, open their stocking and play with whatever was in there for awhile, letting their parents sleep in.",
            "title_similarity": "0.7197616",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpxh2rc",
            "score": 407,
            "text": "We had the rule that nobody could go downstairs until everybody was ready to go downstairs, and people couldn't be woken up until at least 7am. On years when we had a one story house, you had to stay in your room until the parents said it was okay to come out. My parents justified this by saying dad wanted to film home movies of us finding stuff from Santa, so we had to wait lest we make him sad.\n\nEdit: My original one-story description inaccurately said rooms instead of bedroom-side of the house. As long as we kept to the hallway linking the bedrooms/bathroom and stayed out of the kitchen/living room, we were okay as far as Christmas morning rules went.",
            "title_similarity": "0.70765746",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpxoou7",
            "score": 100,
            "text": "LPT: Construct an entire decoy home and family. Cut a new door in the kid's bedroom that leads to the decoy home and plaster over the old door. Enjoy extra sleep year-round.",
            "title_similarity": "0.74031574",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpxb4az",
            "score": 2358,
            "text": "I would also like a small lego set. Thank you.",
            "title_similarity": "0.45004666",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpxj6vb",
            "score": 208,
            "text": "It's no worry here, both my young kids and wife will sleep until noon if I don't wake them up. I went to bed after 3am and was up at 7 watching the news waiting to wake everyone up at 8:00.\n\nSo weird, my siblings and I would argue over who would be awake first Christmas morning and we'd always be up at like 6 waiting to wake our mom up. Not my kids lol.",
            "title_similarity": "0.7779678",
            "sentiment_compound": -0.2657
        },
        {
            "id": "hpxbkis",
            "score": 4649,
            "text": "Now make sure you remember this a year later, because OP is a day late with this post.",
            "title_similarity": "0.47879404",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpxetpp",
            "score": 1967,
            "text": "Santa always took the stocking from wherever they were hung, and after filling them, left them at the foot of our beds…. When we woke, we could play with/open anything in the stocking until mom and dad were ready for us to come out of our rooms and go to the tree….  Worked great for us.    edited: forgot a",
            "title_similarity": "0.8167299",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hpxintx",
            "score": 385,
            "text": "Tried this last night. Woken up at 6am to see the Lego set that they were about to build.",
            "title_similarity": "0.69122446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxhasw",
            "score": 8528,
            "text": "My mum and dad told us that our presents would turn to coal if we opened them before 7am",
            "title_similarity": "0.5882238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxhm12",
            "score": 31,
            "text": "When I was a child, we were allowed to open and play with whatever was in our Christmas stockings as long as we were quiet and didn’t wake up Mom or Dad.",
            "title_similarity": "0.66402125",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpxiytl",
            "score": 7,
            "text": "I used to put Christmas stockings on their beds.",
            "title_similarity": "0.5589865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxjqis",
            "score": 106,
            "text": "A coloring book also works, depending on your kids preferences.",
            "title_similarity": "0.49513802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxlsuy",
            "score": 3,
            "text": "Are you the kid that woke up with the Lego set? Cuz you’re late with this!",
            "title_similarity": "0.675148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxm7oe",
            "score": 3,
            "text": "I’m an adult, and this would have been nice (visiting home for Xmas /wakes up at 6am)",
            "title_similarity": "0.5442624",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpxma8s",
            "score": 1,
            "text": "Maybe one with big pieces though. Stepping on those fuckers when you have to clean up their attempt at cleaning is no fun",
            "title_similarity": "0.3738331",
            "sentiment_compound": -0.5996
        },
        {
            "id": "hpxmoma",
            "score": 1,
            "text": "LPT about Christmas morning posted on Christmas morning 👍",
            "title_similarity": "0.49090692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxn4ua",
            "score": 1,
            "text": "Now wait until he wakes everyone to show off his present early",
            "title_similarity": "0.57532316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxn7lv",
            "score": 5,
            "text": "My parents could’ve definitely used this tip for my brother and I. Every year we devised a plan to wake up at 5am and see if my parents were awake, and then if they weren’t, we would play board games or something until they were. We even wrote the steps of the plan down 😂",
            "title_similarity": "0.7156409",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hpxnodq",
            "score": 1,
            "text": "Good one!  Thanks",
            "title_similarity": "-0.018332154",
            "sentiment_compound": 0.7263
        },
        {
            "id": "hpxobll",
            "score": 1,
            "text": "Where was this information last night?!",
            "title_similarity": "0.18833284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxoi9c",
            "score": 6,
            "text": "Nah, the Christmas nap is part of the tradition when watching movies later that day!",
            "title_similarity": "0.68691486",
            "sentiment_compound": -0.1759
        },
        {
            "id": "hpxoiwn",
            "score": 1,
            "text": "We let the kids open their stockings on their own and included a little toy for them to play with.",
            "title_similarity": "0.53580034",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpxpc66",
            "score": 2,
            "text": "I was just quiet under threat of insults from parents.",
            "title_similarity": "0.3914247",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hpxpcsd",
            "score": 1,
            "text": "This tip is about 14 hours too late",
            "title_similarity": "0.34324354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxpgwl",
            "score": 1,
            "text": "Lego aisle completely cleaned out this year. What Lego set?",
            "title_similarity": "0.55798817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxql0f",
            "score": 2,
            "text": "!Remind me 364 days",
            "title_similarity": "0.0724103",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxr2aw",
            "score": 1,
            "text": "This does not work. \n\nHave tried it.",
            "title_similarity": "0.022905244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxr7og",
            "score": 1,
            "text": "Nah not gonna work. I woke my whole family up every single year no matter where they hid the presents when I was a kid",
            "title_similarity": "0.67977893",
            "sentiment_compound": -0.2201
        },
        {
            "id": "hpxrbjg",
            "score": 2,
            "text": "LPT: If you have a LPT about Christmas morning, post it before Christmas morning.",
            "title_similarity": "0.531646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxrdik",
            "score": 1,
            "text": "Got any life tips on how to afford Legos?",
            "title_similarity": "0.52169615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxrkzu",
            "score": 1,
            "text": "Nice try, son. Now go to bed",
            "title_similarity": "0.47732985",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpxrosl",
            "score": 1,
            "text": "!remindme 364 days",
            "title_similarity": "0.070268095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxs4mt",
            "score": 1,
            "text": "SO THAT'S WHY my parents would hide Lego in my room.",
            "title_similarity": "0.62258756",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpxsdke",
            "score": 1,
            "text": "\"Mum! Dad! How I do put this together?\"",
            "title_similarity": "0.33645338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxshei",
            "score": 1,
            "text": "my parents just locked me in the bedroom.",
            "title_similarity": "0.4943103",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxsndq",
            "score": 16,
            "text": "Hi! I'm that kid, except I'm 33 and still wake up the entire family including my own wife and kid now. Sometimes the magic of Christmas keeps you up amd excited no matter how old you get. I'd love a new Lego set to have while waking everyone else up, though! (My family instituted a no waking before 7 am rule haha)",
            "title_similarity": "0.87184024",
            "sentiment_compound": 0.8364
        },
        {
            "id": "hpxsr5r",
            "score": 3,
            "text": "Or do presents on Christmas Eve and make the condition that they can get up and play with whatever they want, it just has to be quiet.  That was how my parents did it.",
            "title_similarity": "0.7482804",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpxt4gx",
            "score": 1,
            "text": "LPT Buy them a giant lego set and don't see them until after new year's day",
            "title_similarity": "0.7036396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxt77p",
            "score": 1,
            "text": "Lmao this isn't how kids work",
            "title_similarity": "0.10695262",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpxtc3h",
            "score": 1,
            "text": "Unless the kid is like my little siblings\\* who kick the door off its frame every time they go to the bathroom and cause earthquakes when they stomp around at three in the morning. We've tried to teach them to use the handle to gently and quietly open and close doors like normal people. By the Nine, have we tried.\n\nWe traditionally open presents in the evening some time after dinner on the 24th in Finland, so at least we don't have excited kids screaming and ripping them open in the morning, and we can all sleep in a bit. In my family little children would get to open a single present in the morning, the rest in the evening, but save one or two to be placed back under the tree and opened on the 25th.\n\n\\* They're nearly adults already, but they've been doing it for at least ten years. Hard to crash on the living room sofa without hearing protection.",
            "title_similarity": "0.83130026",
            "sentiment_compound": 0.3252
        },
        {
            "id": "hpxtd4v",
            "score": 3,
            "text": "My parents always told me I was allowed to get my stocking and open/play with everything that was in it until at least 7. I was never able to sleep on Christmas and used to get my stocking at 5. I had to wake my kids up at 9 to open theirs so I could make it to lunch on time lol",
            "title_similarity": "0.7792952",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpxthub",
            "score": 1,
            "text": "They’d just wake up everyone telling them what Santa got them.",
            "title_similarity": "0.5551077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxtkbm",
            "score": 2,
            "text": "So funny I saw this because my nephew has been at it since 730 its 1030 now. He hasn't said a thing about opening presents lmao",
            "title_similarity": "0.58734846",
            "sentiment_compound": 0.796
        },
        {
            "id": "hpxto4r",
            "score": 2,
            "text": "My parents always let us look through our stockings at 5am. I used to watch the clock from 3am on. We weren't allowed to wake them up till 7",
            "title_similarity": "0.6530975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxtorv",
            "score": 1,
            "text": "Isn’t this what Xmas stockings are for? My folks always hung one on my bedside after I fell asleep",
            "title_similarity": "0.65085155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxttzp",
            "score": 3,
            "text": "Or just suck it up and do the Christmas parent thing.  Getting to wake everyone up is part of the fun, as a kid.",
            "title_similarity": "0.75714993",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpxtxm4",
            "score": 1,
            "text": "Lol. Thanks for telling us this after everyone is awake",
            "title_similarity": "0.4074493",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hpxty3x",
            "score": 1,
            "text": "Lpt: stockings are free game if you wake up early anyone can unload there stocking and open any presents in there until regular presents are a go.",
            "title_similarity": "0.6753832",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpxu8ve",
            "score": 1,
            "text": "If they can afford a Lego set",
            "title_similarity": "0.4197347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxudix",
            "score": 1,
            "text": "Lmao ok.\n\nMy kid woke up at 5:45. This pro tip would have allowed me to sleep until 5:47 maybe.",
            "title_similarity": "0.58042276",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpxudnx",
            "score": 1,
            "text": "My toddler slept in until 8:45 this morning. That is a Christmas treat that I know will not be happening again for years to come.",
            "title_similarity": "0.7491412",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpxuhjb",
            "score": 1,
            "text": "Great advert Lego!",
            "title_similarity": "0.37685987",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hpxunkx",
            "score": 1,
            "text": "Stealing this idea for my son. Thanks!",
            "title_similarity": "0.3800711",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hpxuoxk",
            "score": 1,
            "text": "There’s no way I would quietly set up a Lego as a child. I was down the stairs and jumping on my parents bed at 5:45 AM come hell or Highwater.",
            "title_similarity": "0.66714823",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hpxuu4t",
            "score": 1,
            "text": "Santa always came to our house in the evening of the 24th... while we were at mass or playing outside while my mom \"napped\" on the couch. \n\nWas my mom's gift to herself lol.",
            "title_similarity": "0.7617301",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hpxuw1a",
            "score": 1,
            "text": "We were allowed to open our stockings before the adults were up.",
            "title_similarity": "0.40513408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxuy1y",
            "score": 1,
            "text": "Do you have kids? They want to show you EVERYTHING.",
            "title_similarity": "0.42314768",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpxv08d",
            "score": 1,
            "text": "Am adult. Would still love Legos for Christmas.",
            "title_similarity": "0.6778953",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpxv1s6",
            "score": 1,
            "text": "What? Just wake up early on Christmas to be with the kids.. who cares?",
            "title_similarity": "0.7338991",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hpxv30j",
            "score": 1,
            "text": "You’ve never met any of the children in my family. That Lego would occupy them for years. 35 seconds at a time.",
            "title_similarity": "0.5372406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxv570",
            "score": 1,
            "text": "This was literally posted at the exact worst time of year.",
            "title_similarity": "0.22415921",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hpxvf2m",
            "score": 1,
            "text": "Just explain that Santa needs until 8am in every time zone to get to all those millions of homes.",
            "title_similarity": "0.58329725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxvttt",
            "score": 1,
            "text": "LPT: If you have a date-specific LPT, post it *before*  that date.",
            "title_similarity": "0.21680063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxvu2g",
            "score": 1,
            "text": "!remindme 360 days",
            "title_similarity": "0.064916216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxvulc",
            "score": 2,
            "text": "would've appreciated seeing this tip YESTERDAY, OP... 😩",
            "title_similarity": "0.4101119",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpxw4bu",
            "score": 1,
            "text": "The second the child wakes up: \"Mom! Dad!  Look what Santa left me!   \n Wake up and help!!!!\"",
            "title_similarity": "0.6652248",
            "sentiment_compound": 0.5951
        },
        {
            "id": "hpxw4el",
            "score": 1,
            "text": "We always had the stockings be the thing the kids can open as soon as they wake up.",
            "title_similarity": "0.55179036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxw5mt",
            "score": 1,
            "text": "LPT: post Christmas themed LPTs prior to Christmas.",
            "title_similarity": "0.46276942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxw7na",
            "score": 2,
            "text": "I used to wake up insanely early as a kid on Christmas, like 3 or 4 am. My mom started putting snacks and a colouring book in my room so I could entertain myself and have a snack before the family woke up at 8. This is a really really good idea",
            "title_similarity": "0.8367114",
            "sentiment_compound": 0.8193
        },
        {
            "id": "hpxw8bc",
            "score": 1,
            "text": "Nice try Timmy. You ain't getting shit and that's exactly what you deserve. Now go make me a bacon sandwich.",
            "title_similarity": "0.52125084",
            "sentiment_compound": 0.6931
        },
        {
            "id": "hpxw9mj",
            "score": 1,
            "text": "Who the fuck actually thinks of this?",
            "title_similarity": "-0.033237763",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpxwfnb",
            "score": 1,
            "text": "Follows instructions. Proceeds to get woken up every 5-minutes being asked to separate small pieces stuck together. Source - me, currently trying to nap while my four kids build Lego’s.",
            "title_similarity": "0.6647878",
            "sentiment_compound": -0.25
        },
        {
            "id": "hpxwhey",
            "score": 1,
            "text": "In the house I grew up in, we used to open gifts on Christmas Eve, and stockings were done on Christmas day.\n\nI'm a single adult with 5 cats. No presents in my house Christmas Day, other than the kind my cats leave me in their litter box.",
            "title_similarity": "0.6614145",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpxwipx",
            "score": 1,
            "text": "This post brought to you by LEGOS",
            "title_similarity": "0.3065002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxwols",
            "score": 1,
            "text": "Or keep them in their cages",
            "title_similarity": "0.19676897",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxwpq5",
            "score": 1,
            "text": "Thought this was gonna have something to do with stepping on legos… disappointed",
            "title_similarity": "0.5115076",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpxwq0y",
            "score": 1,
            "text": "What if your wife wakes up at 6:30am before the kids??",
            "title_similarity": "0.54749537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxwque",
            "score": 2,
            "text": "This is either 24 hours late or 364 days early.",
            "title_similarity": "0.24396643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxwsdr",
            "score": 11,
            "text": "Or books for your book kid",
            "title_similarity": "0.3293003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxww35",
            "score": 3,
            "text": "The rule in my house is the kids can get up and open their stockings. There's always some chocolate and candy and a small Lego set. Sometimes a small book or activity/game. Depends on what Santa can come up with.\n\nBut, it helps keep them busy until 8 when they are allowed to come get mom and dad!!",
            "title_similarity": "0.85232925",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hpxwxfh",
            "score": 1,
            "text": "Kids will definitely open a present and play with it for HOURS when they know there are 50 more unopened waiting for them. Come on. They won't build those legos. You'll be lucky if they spend 30 seconds looking at them. They will instantly want to open more.",
            "title_similarity": "0.7426831",
            "sentiment_compound": 0.802
        },
        {
            "id": "hpxx47y",
            "score": 1,
            "text": "A LPT from someone who clearly doesn't have kids.",
            "title_similarity": "0.102961555",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpxx80a",
            "score": 2,
            "text": "My parents do this by putting my little brothers stockings in his room this works really well and gets him to not wake me up",
            "title_similarity": "0.75428826",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hpxx8uy",
            "score": 1,
            "text": "Give 1 year old a lego set, noted",
            "title_similarity": "0.5040374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxx9oe",
            "score": 1,
            "text": "Well meaning but this is a tip non parents give parents. Maybe 1 out of 100 kids will quietly play in their room while you sleep on Christmas.",
            "title_similarity": "0.7823449",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hpxxc5n",
            "score": 1,
            "text": "This seems like a decent idea, but I'd suggest wrapping the Lego set elsewhere, and then leaving it in their room.",
            "title_similarity": "0.6716411",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hpxxku4",
            "score": 1,
            "text": "I and my brother used to execute an elaborated plan to go downstairs earlier without waking up other people. One of us flushed the toilet, while the other one turned off the alarm and opened the noisy door",
            "title_similarity": "0.63879955",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpxxmo9",
            "score": 1,
            "text": "My mom always put my stocking at the foot of the bed before I woke up. It would have a little Lego in it, some chocolates, and a couple other stocking stuffers. It’s always been one of my favorite parts of Christmas. Sometimes my sister would come in with hers and we’d trade chocolates and play with the legos together. It definitely worked to keep us occupied.",
            "title_similarity": "0.8578445",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hpxxpyi",
            "score": 1,
            "text": "Growing up, Santa didn't wrap presents, so we could play with them while mom and dad still slept. We couldn't open presents until they were up.",
            "title_similarity": "0.7270471",
            "sentiment_compound": 0.5209
        },
        {
            "id": "hpxxrkn",
            "score": 1,
            "text": "My sister did this well into high school... she didn't like Legos lol",
            "title_similarity": "0.5594167",
            "sentiment_compound": -0.2656
        },
        {
            "id": "hpxxuvk",
            "score": 1,
            "text": "My 5YO sees a present from Santa in his room- *goes absolutely apeshit*- then runs into our room screaming cuz of how excited he is. More sleep? No. Still a great win? Absolutely",
            "title_similarity": "0.7417502",
            "sentiment_compound": 0.7825
        },
        {
            "id": "hpxxyja",
            "score": 1,
            "text": "This has a 0.6% chance of working.",
            "title_similarity": "0.18821731",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpxxzkp",
            "score": 1,
            "text": "My mom would always leave a video game sticking out of my stocking so I could open that and play Xbox until everyone else woke up.",
            "title_similarity": "0.61648357",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpxy11b",
            "score": 1,
            "text": "Well played Lego",
            "title_similarity": "0.3314285",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hpxy3qs",
            "score": 1,
            "text": "But don't forget to never buy Lego but brands like bluebricks instead!",
            "title_similarity": "0.5655202",
            "sentiment_compound": 0.6748
        },
        {
            "id": "hpxy6w8",
            "score": 1,
            "text": "You think kids are satisfied to stop at one present?",
            "title_similarity": "0.3485791",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpxy9zp",
            "score": 1,
            "text": "I do this with my kids. I remove a few pieces so I get even more peace and quiet.",
            "title_similarity": "0.5036067",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hpxybmk",
            "score": 1,
            "text": "“Hey everyone, look what I got!”",
            "title_similarity": "0.12852374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxycjb",
            "score": 1,
            "text": "I used to wake up to a new beanie baby in my bed lol",
            "title_similarity": "0.66845965",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpxydph",
            "score": 1,
            "text": "This LPT was written by someone without kids",
            "title_similarity": "0.17623805",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxyj14",
            "score": 1,
            "text": "We were allowed to open our stockings and one present before my parents got up.",
            "title_similarity": "0.52699983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxyjrd",
            "score": 1,
            "text": "Or you could open your present at midnight and get all the sleep you want on 25th",
            "title_similarity": "0.58826864",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpxynln",
            "score": 1,
            "text": "At my grandparents when I was little we used to have to wait until after breakfast. Once the number of grandchildren started hitting double digits that wasn’t a thing anymore lol",
            "title_similarity": "0.62612695",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpxynrt",
            "score": 1,
            "text": "My grandfather said If I couldn’t get presents until 7am. What I didn’t realize at the time was he went around and set all the clocks in the middle of the night to give everybody extra time to sleep",
            "title_similarity": "0.7316522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxyo92",
            "score": 1,
            "text": "Or just let them open presents christmas eve so they wake up and just start playing on christmas day.",
            "title_similarity": "0.7473483",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpxyois",
            "score": 1,
            "text": "Yeah but the problem is that now they will wake me up to help them build it.",
            "title_similarity": "0.47811496",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpxyoy2",
            "score": 1,
            "text": "Or just give them some gin the night before so they sleep longer.",
            "title_similarity": "0.50135213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxyp1m",
            "score": 2,
            "text": "But half the fun is waking up so early.!",
            "title_similarity": "0.5452423",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hpxyw5m",
            "score": 2,
            "text": "We Open up presents at midnight.",
            "title_similarity": "0.43510622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxz7iv",
            "score": 2,
            "text": "My parents tried this. I woke up at 4am, saw my presents, and ran into their room to tell them Santa had been",
            "title_similarity": "0.7663192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpxza98",
            "score": 2,
            "text": "We were always allowed to play with what Santa brought us as soon as we woke up. We had to wait to open stuff from mom & dad.",
            "title_similarity": "0.721079",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpxzdh2",
            "score": 1,
            "text": "What if they hate Legos?",
            "title_similarity": "0.26479137",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpxzmhn",
            "score": 2,
            "text": "I wake up READY like buddy the elf on Christmas. I woke my kid up today because I wanted him to open his shit.",
            "title_similarity": "0.80692",
            "sentiment_compound": 0.2808
        },
        {
            "id": "hpxzort",
            "score": 2,
            "text": "My sisters and I would go through stockings while my parents slept in. Our stockings were absolutely stuffed full of random cheap shit, like toothbrushes and dollar store toys, and candy, but enough to keep us occupied. \n\nOne year my sister woke up first and found bags of coal instead. Everyone woke up to “ OH HELL NAH” and she went straight to parents door knocking demanding her stockings.",
            "title_similarity": "0.7233106",
            "sentiment_compound": -0.8764
        },
        {
            "id": "hpxzukj",
            "score": 1,
            "text": "We just leave our kids stockings in their room so they can dig through those for an hour when they wake up. Load em up with lots of tiny things and it takes them forever to go through it all.",
            "title_similarity": "0.7281727",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpxzxw3",
            "score": 22,
            "text": "My parents did this my whole childhood. 4 boys in the house, four Lego sets got hidden in our rooms. No one was allowed downstairs until all four kits had been found and assembled. \nLego tradition (without the hiding) continued until covid Christmas last year, I'm 41",
            "title_similarity": "0.7508012",
            "sentiment_compound": -0.0803
        },
        {
            "id": "hpy00nv",
            "score": 1,
            "text": "Better yet, spread the small pieces all over the floor being sure to keep the room dark.  This works best if the presents and stocking are in another room.",
            "title_similarity": "0.42303395",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hpy0a5d",
            "score": 1,
            "text": "Could have used this LPT a week ago. 4am today...",
            "title_similarity": "0.36845273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy0d35",
            "score": 2,
            "text": "That's what my parents did. We had a little tree in our room and santa would leave a Lego set in there for me. As I got older, the set got more complex",
            "title_similarity": "0.8016347",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpy0j50",
            "score": 1,
            "text": "Implying my kid can focus on a sitting-still task for 5 minutes straight. That kid is sweating pure cocaine",
            "title_similarity": "0.430434",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpy0jji",
            "score": 1,
            "text": "This is how you teach kids to get whatever they want whenever they want. Essential getting you few more hours of sleep and a life time of shit the rest of us get to deal with. LPT my arse lol",
            "title_similarity": "0.6550187",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpy0w2j",
            "score": 2,
            "text": "I wish I would have known about this 8 hours ago at 4:30am.",
            "title_similarity": "0.4909218",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy0ytc",
            "score": 2,
            "text": "Lol, that wouldn't have stopped me at all when I was a kid.",
            "title_similarity": "0.38179576",
            "sentiment_compound": 0.5371
        },
        {
            "id": "hpy1235",
            "score": 2,
            "text": "I'm the youngest of six kids and my oldest sibling is almost exactly 20 years older than me. By the time I was born, the parents had already set up a system - everything in the stockings were fair game to open and play with (usually cheap dollar store toys sort of thing) before the actual time to unwrap presents. It usually was able to tide me over, lol.",
            "title_similarity": "0.7362705",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hpy14j7",
            "score": 2,
            "text": "I’m grown and I’d like someone to wake me up with a lego set to start my day with",
            "title_similarity": "0.6559093",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpy18l4",
            "score": 5,
            "text": "*laughs in exchanging gifts on christmas eve*",
            "title_similarity": "0.58969617",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpy1c3x",
            "score": 4,
            "text": "Ah, yes. Just on time after Christmas has just passed.",
            "title_similarity": "0.3291227",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy1emj",
            "score": 2,
            "text": "Lol My parents told us we weren’t allowed out of our rooms before 7:30 am.",
            "title_similarity": "0.54979306",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpy1hlv",
            "score": 1,
            "text": "What if they’re Christmas present is the small Lego set…",
            "title_similarity": "0.5459059",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy1nqu",
            "score": 1,
            "text": "Information that would have been useful 6 hours ago!\n\n\n\nThanks. Saving this.",
            "title_similarity": "0.4249475",
            "sentiment_compound": 0.7263
        },
        {
            "id": "hpy1o5d",
            "score": 1,
            "text": "Does this work on a 14-year-old?? LOL our son got in bed at 7:30 last night and tried to get us up at 5:45 this morning.",
            "title_similarity": "0.68912506",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hpy1oor",
            "score": 4,
            "text": "My fondest Christmas gift memory is building a LEGO X-Wing while everyone was still sleeping. This is such good advice",
            "title_similarity": "0.8018191",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hpy1rfi",
            "score": 1,
            "text": "Someday someone will have a big realization when they learn why they get Legos early every Christmas...",
            "title_similarity": "0.78008074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy1vo8",
            "score": 2,
            "text": "A little late NOW!! ;-) mine were up at 5.30am!",
            "title_similarity": "0.3841136",
            "sentiment_compound": 0.3843
        },
        {
            "id": "hpy206z",
            "score": 3,
            "text": "Great tip but from a different point of view and with someone with a 3 year old. Is getting up extra early really that hard to do on literally one of the most exciting days of the year for a child? I get 5 am is too early but its one day suck it up and take a nap later.",
            "title_similarity": "0.7210027",
            "sentiment_compound": 0.3447
        },
        {
            "id": "hpy239r",
            "score": 2,
            "text": "Yea Day late. I’m not sure what my dream was but my kids came in at 6:45 this morning to say Merry Christmas and I started awake, frightening all.",
            "title_similarity": "0.79840505",
            "sentiment_compound": 0.1202
        },
        {
            "id": "hpy23um",
            "score": 1,
            "text": "My husband would always want to wake up early to do the presents.  It was so cute. I put a trail of “hustlers” to the longing room and that was enough to destruct him for a few hours until the rest of us woke up",
            "title_similarity": "0.8415823",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hpy26qi",
            "score": 2,
            "text": "Might have been helpful yesterday…",
            "title_similarity": "0.32950497",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpy28x4",
            "score": 3,
            "text": "...or get up and enjoy Christmas morning with them that kind of feeling doesn't last for very long",
            "title_similarity": "0.6490323",
            "sentiment_compound": 0.5279
        },
        {
            "id": "hpy2cmk",
            "score": 1,
            "text": "What if your child is a girl? Any recommendations?",
            "title_similarity": "0.20276701",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2d7p",
            "score": 2,
            "text": "My kids are still In the choking hazard age for Legos. Will gladly try this in a couple of years!!",
            "title_similarity": "0.74703085",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hpy2dot",
            "score": 2,
            "text": "Where I am from we open our presents late on Christmas eve, but in the morning we have a sock on the children door that has a small gift inside of it and boatloads of candy",
            "title_similarity": "0.7753272",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hpy2frk",
            "score": 2,
            "text": "When I was little, PS1 game under the pillow. Kept me in my room indefinitely",
            "title_similarity": "0.64396846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2g2x",
            "score": 2,
            "text": "this way you’ll still get woken up early but the jolt from stepping on lego will get your day going!",
            "title_similarity": "0.7057556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2gcf",
            "score": 2,
            "text": "My kids have always gotten up at 4:00am on Christmas.  This morning, I heard them wake up and just chill out talking to each other in their room until 5:30am.  I love my kids.  They are so awesome.",
            "title_similarity": "0.7854071",
            "sentiment_compound": 0.887
        },
        {
            "id": "hpy2mz7",
            "score": 2,
            "text": "Small LEGO set == 30 min extra sleep time or less",
            "title_similarity": "0.48076335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2v5s",
            "score": 1,
            "text": "RemindMe!  357 days",
            "title_similarity": "0.09805325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy2wql",
            "score": 1,
            "text": "When I was growing up my parents let us open our stockings as soon as we woke up.  We had to wait until after breakfast to open anything under the tree",
            "title_similarity": "0.7158382",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpy2zer",
            "score": 1,
            "text": "My parents always allowed me to open stockings whenever I woke up. After that, I had to wait until after breakfast.",
            "title_similarity": "0.68933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy31k9",
            "score": 1,
            "text": "This brings back memories when I was really young. I'd wake my mom up at 5:30 on Christmas. She'd let me open a present then turn on the tv and I'd watch the Arthur Christmas special while I built my new Lego set. Good times.",
            "title_similarity": "0.79567516",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hpy33xj",
            "score": 5,
            "text": "Everything in the stockings is fair game but they have to wait for parents to open anything under the tree. They get to be excited and open up a few small toys while we get to sleep a little more",
            "title_similarity": "0.8131742",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hpy36zz",
            "score": 1,
            "text": "My mom would lay our stockings near our beds. The rule was that we could open and play with anything in the stockings, but had to wait and keep quiet until she woke up before opening anything else",
            "title_similarity": "0.6182548",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpy374c",
            "score": 1,
            "text": "I feel like either you don’t have kids or we have very different children. lol",
            "title_similarity": "0.32960212",
            "sentiment_compound": 0.6771
        },
        {
            "id": "hpy37v5",
            "score": 2,
            "text": "My daughter would still come wake me up to show me that’s its Lego but I also need to put it together with/for her.",
            "title_similarity": "0.7083117",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy3a18",
            "score": 2,
            "text": "Nah, that's the time to get up. It's all *for* them to be super hyped about.",
            "title_similarity": "0.35173425",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hpy3c94",
            "score": 1,
            "text": "Eh... not sure what holy levels patience your children have but when I was a kid, the only thing I wanted to do was open **all** the presents, not just one. And I didn't care to play with the toys until all of them were opened, either.\n\nJs, I'd be way too excited to build Legos / I'd still be waking their asses up lolol.",
            "title_similarity": "0.80711806",
            "sentiment_compound": -0.5231
        },
        {
            "id": "hpy3e8j",
            "score": 1,
            "text": "Remind me!364days",
            "title_similarity": "0.0664186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy3jyc",
            "score": 2,
            "text": "Just do it the latino way: everyone stays up until midnight the 24th, when midnight arrives you set off the fireworks, give everyone a hug and open the presents. No one's waking up early next day cuz everyone is tired. Win win.",
            "title_similarity": "0.70700395",
            "sentiment_compound": 0.765
        },
        {
            "id": "hpy3l56",
            "score": 1,
            "text": "This would’ve been spectacular to know yesterday...",
            "title_similarity": "0.3422547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy3o3x",
            "score": 1,
            "text": "!remindme 340 days\n\nRubbish timing of this post to be fair",
            "title_similarity": "0.31800824",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hpy3sze",
            "score": 1,
            "text": "My parents did this for me on my sixth birthday. I woke up super early to find a box on the end of my bed. I switched on my little bed side light and the bulb exploded over me and the bed. I just quietly cried there until my parents came to check on me when they woke up. I still hate light bulbs to this day >_<",
            "title_similarity": "0.7751211",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpy3ufg",
            "score": 1,
            "text": "As a kid, after we woke up 2 hours after the adults went to bed, the next year they instituted the rule that we could get up, get our stockings, and go back to our bedroom. Always something to play with and something small to eat, and it bought another hour for the parents.",
            "title_similarity": "0.72137237",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpy3vvw",
            "score": 1,
            "text": "This is next level parenting… GREAT idea!",
            "title_similarity": "0.34630486",
            "sentiment_compound": 0.729
        },
        {
            "id": "hpy3ycz",
            "score": 1,
            "text": "This is not so much a LPT as what Santa is for. \n\nWhen I was a kid we woke to a stocking that had in it peanuts in shells, tangerines, a juice box, gold coins, a selection box and something to do for a couple of hours (nothing as expensive as Lego in those days). I got one of those water puzzle toys one year. Kept me quiet for hours! The grown ups didn't want to be awake before 7am and the stocking from Santa was the fix.\n\nI hate how some kids get expensive presents from Santa when it's a universal myth that makes some children feel there's something wrong with them because their parents can't afford to play Santa that way.",
            "title_similarity": "0.8074991",
            "sentiment_compound": -0.8537
        },
        {
            "id": "hpy3ygn",
            "score": 1,
            "text": "I used to do this with PS2/3 games. I could always tell if one was under the tree so I’d open that and play until everyone else woke up.",
            "title_similarity": "0.61728334",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpy3zeb",
            "score": 2,
            "text": "I skimmed over the text initially and thought it was about setting up lego brick traps in the kid's room.\nProbably works too though.",
            "title_similarity": "0.6935059",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy46v9",
            "score": 3,
            "text": "Just get up with them, before you know it they will be teens with an attitude",
            "title_similarity": "0.32567638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy497f",
            "score": 1,
            "text": "Why wasn't this on here yesterday?!?!?! Ksjdsbaj sbns",
            "title_similarity": "0.34174633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy4anp",
            "score": 1,
            "text": "BS those kids can practice their patients! Doing that only enforces the bad behavior. Don’t be an enabler!",
            "title_similarity": "0.45785838",
            "sentiment_compound": -0.6229
        },
        {
            "id": "hpy4b35",
            "score": 8,
            "text": "What are you talking about? I’m 53 and still up at 5:30 waking everyone. It’s Christmas. \n\nWell, someone needs to get me a Lego I guess.",
            "title_similarity": "0.7342105",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpy4mgo",
            "score": 1,
            "text": "This LPT is about 16 hours too late.",
            "title_similarity": "0.36997345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy4t4u",
            "score": 1,
            "text": "A day too late or 364 days too early",
            "title_similarity": "0.3024477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy4tfs",
            "score": 1,
            "text": "I let my kids open their stockings as soon as they wake up. There are breakfast sweets they wouldn't normally get, nuts, beef jerky, boxes of Yoo-hoo soup they can have a little nibble. There are also games and a couple small lego sets. All of this occupies them for awhile. It's awesome.",
            "title_similarity": "0.7549217",
            "sentiment_compound": 0.8505
        },
        {
            "id": "hpy4uxf",
            "score": 2,
            "text": "In Germany we usually open presents in the evening on 24th December. So we are good XD",
            "title_similarity": "0.5937738",
            "sentiment_compound": 0.827
        },
        {
            "id": "hpy4xad",
            "score": 1,
            "text": "This is genius and I totally woulda loved it as a kid",
            "title_similarity": "0.42517868",
            "sentiment_compound": 0.6344
        },
        {
            "id": "hpy4y4k",
            "score": 1,
            "text": "This sounds like it’s written by a person who’s definitely dealt with kids on Christmas morning",
            "title_similarity": "0.5781126",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpy50xk",
            "score": 1,
            "text": "Good idea but my kid would probably come back five minutes later saying he can’t get the box open, then five minutes later saying he can’t find a missing lego piece etc etc.",
            "title_similarity": "0.6253766",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hpy51od",
            "score": 1,
            "text": "In b4 the kid turns out to be someone who would tear through the house screaming \"MOM MOM LOOK WHAT SANTA GOT ME\"",
            "title_similarity": "0.58131915",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hpy54vw",
            "score": 1,
            "text": "Or just cover their doorway with wrapper",
            "title_similarity": "0.19894882",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5775",
            "score": 1,
            "text": "This person obviously isn't a parent. This isn't how it works.",
            "title_similarity": "0.066530034",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy58tn",
            "score": 1,
            "text": "Real LPT: don't have kids",
            "title_similarity": "0.097093135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy59la",
            "score": 1,
            "text": "Nice try, Lego Marketing Team.",
            "title_similarity": "0.44437122",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpy5b0o",
            "score": 1,
            "text": "Are the ones waking everyone up even old enough to do lego",
            "title_similarity": "0.58638966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5chp",
            "score": 1,
            "text": "We would get our stockings at the foot of the bed overnight so we had something to do",
            "title_similarity": "0.5291002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5ekr",
            "score": 2,
            "text": "Nice idea but you clearly dont have kids",
            "title_similarity": "0.18910065",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hpy5i89",
            "score": 1,
            "text": "You think my adhd ass would have the patience to sit through a Lego set while everyone else sleeps more? Hahaha",
            "title_similarity": "0.67522883",
            "sentiment_compound": 0.101
        },
        {
            "id": "hpy5mh8",
            "score": 1,
            "text": "Oh you haven't met my daughter. That set will be brought into my room quicker then Sonic after a chilli dog! \n\nCourse I had to get her up at 8.45 today after my tea and playing a bit of Resi so I can't complain",
            "title_similarity": "0.713233",
            "sentiment_compound": 0.537
        },
        {
            "id": "hpy5mve",
            "score": 1,
            "text": "My parents put the child safety gates outside our rooms so we couldn't get out to wake them up lol",
            "title_similarity": "0.5976546",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hpy5mxy",
            "score": 1,
            "text": "We let the kids raid their stockings on their own, and usually put things like that in there.",
            "title_similarity": "0.4884179",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpy5nvf",
            "score": 2,
            "text": "So you get five minutes of extra sleep? Lmao",
            "title_similarity": "0.37954402",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpy5nzv",
            "score": 1,
            "text": "We always got a small comic or book wrapped and left at the foot of our beds for the morning for just this purpose",
            "title_similarity": "0.6610697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5prx",
            "score": 1,
            "text": "Where was this advice 8 hours ago... or 8 years ago?",
            "title_similarity": "0.21430221",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5tu3",
            "score": 1,
            "text": "This was obviously written by somebody with no children. There's no stopping or delaying the human buzzsaws that are children on Christmas morning. They will snatch up that floor present without even a pause in their stampede to the tree, have it unwrapped in motion, and back forgotten on the floor somewhere in their general vicinity as they tear into the tree presents with the frenzy of a school of mako sharks.",
            "title_similarity": "0.6494515",
            "sentiment_compound": -0.7754
        },
        {
            "id": "hpy5uf2",
            "score": 1,
            "text": "Klemmbausteine from other companys do also fit, Lego is here used as a Gattungsbegriff",
            "title_similarity": "0.46038038",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpy5v0r",
            "score": 1,
            "text": "Little late for this one ?",
            "title_similarity": "0.15836479",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5vhe",
            "score": 1,
            "text": "My parents would turn the clock back in my room but probably harder to pull off with all the iPads and iPhones these days",
            "title_similarity": "0.6852326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5yyk",
            "score": 2,
            "text": "Or just parent your children to not do this or deal with it by getting up.",
            "title_similarity": "0.38466346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy5zj9",
            "score": 1,
            "text": "Do not try this idea with a vuvuzela, you will be the most hated person on that house.",
            "title_similarity": "0.26916322",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hpy62sw",
            "score": 1,
            "text": "Until they call the bluff",
            "title_similarity": "0.103403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy64un",
            "score": 1,
            "text": "Bruh ☠️spend time with your kids, it’s Christmas morning.",
            "title_similarity": "0.6198258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy674q",
            "score": 1,
            "text": "Great idea! Next year post this one day earlier???",
            "title_similarity": "0.3707169",
            "sentiment_compound": 0.7124
        },
        {
            "id": "hpy67oi",
            "score": 1,
            "text": "OP clearly does not have kids. They’re just going to come get you to HELP US BUILD THE INFINITY GAUNTLET DADDY!!!!!!",
            "title_similarity": "0.50804114",
            "sentiment_compound": 0.8075
        },
        {
            "id": "hpy68gm",
            "score": 1,
            "text": "I have an 8 year old wakes up at 5am and a 13 year old who doesn’t want to get up before 10am",
            "title_similarity": "0.56006265",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpy69e1",
            "score": 1,
            "text": "Waking up is the easy part (if a bit miserable). It's getting them to sleep so they don't see Santa arrive that's the hard part.",
            "title_similarity": "0.62090415",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpy69mm",
            "score": 1,
            "text": "Todays life pro tips are brought to you by LEGO(R)",
            "title_similarity": "0.5408512",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy69t1",
            "score": 1,
            "text": "I had to wake my kids up at 9am this morning, got sick of waiting",
            "title_similarity": "0.6567836",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hpy6akz",
            "score": 1,
            "text": "You can also drug them.",
            "title_similarity": "0.094597675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy6c8c",
            "score": 1,
            "text": "Congratulations on discovering what Stockings are for. smdh",
            "title_similarity": "0.24833192",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpy6ctt",
            "score": 1,
            "text": "We let the kids open the stuff in their stockings without everyone being awake, and this year everyone got a little Lego set, even the seventeen and nineteen year olds, and I think it's something we'll continue. It was nice for everyone to have something they could do immediately.",
            "title_similarity": "0.7985872",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpy6hjh",
            "score": 3,
            "text": "Or, you know, get your ass out of bed early once a year when your kid is excited.",
            "title_similarity": "0.7033237",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpy6l6k",
            "score": 1,
            "text": "Wow what a absolutely pro tip thanks a lot",
            "title_similarity": "0.18408242",
            "sentiment_compound": 0.7884
        },
        {
            "id": "hpy6o6x",
            "score": 2,
            "text": "Or how about just getting up with your kid and have quiet quality time together.",
            "title_similarity": "0.43659323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy6qa9",
            "score": 1,
            "text": "We had to wake our kids up, it was 930 this morning. I had a nice quite coffee and baileys this am 👍🏼",
            "title_similarity": "0.5836828",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpy6rvl",
            "score": 1,
            "text": "Better tip - hang a stocking on their door with small gifts and snacks that will keep them busy until everyone else gets up",
            "title_similarity": "0.7060262",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy6trj",
            "score": 1,
            "text": "Who would he dumb enough to give a small child legos unsupervised",
            "title_similarity": "0.45971763",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hpy6unp",
            "score": 1,
            "text": "My parents used to put a DVD or a new game in my Santa Sack. Always keept me occupied before they got harrased too early.",
            "title_similarity": "0.8052886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy6ve7",
            "score": 2,
            "text": "Or just tell them they can't open presents until a specific time or event happens Iike normal people.",
            "title_similarity": "0.3984048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy6w2t",
            "score": 1,
            "text": "Or do what my family does.\n\nStockings are fair game right away, make sure there are a few small things in there.",
            "title_similarity": "0.5018663",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hpy6wo9",
            "score": 1,
            "text": "My brother and I were able to open anything in our stockings on Christmas morning. We would always get a small lego set each. So I can confirm this is a good LPT.",
            "title_similarity": "0.797281",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy6yyp",
            "score": 2,
            "text": "This is how you create a monster child",
            "title_similarity": "0.25879878",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpy6zb6",
            "score": 1,
            "text": "My mom used to wrap the entry way to the living room in wrapping paper. She told us it was Santa and if we broke through too soon (before they woke up, had coffee, and grabbed the camcorder) Santa wouldn't give us anything. Worked pretty well, plus we got to smash through a wall of paper.",
            "title_similarity": "0.7553246",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpy6zi5",
            "score": 1,
            "text": "Small Lego set? So what 200 bucks or something? Lego has gone off the rails with pricing",
            "title_similarity": "0.43838024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy6zri",
            "score": 3,
            "text": "Get up early for one day and make it a special memory for your kid ffs.",
            "title_similarity": "0.6254891",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpy71d9",
            "score": 1,
            "text": "my dad just yelled at me until i stopped crying",
            "title_similarity": "0.47232044",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hpy71p5",
            "score": 1,
            "text": "This is literally what stocking stuffers are for",
            "title_similarity": "0.0888921",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy72fi",
            "score": 1,
            "text": "Or just make your kid behave",
            "title_similarity": "0.20662081",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy72wp",
            "score": 1,
            "text": "How does this post help anyone today?",
            "title_similarity": "0.21848077",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy73qt",
            "score": 1,
            "text": "LPT if you coddle your children too much, they will most likely fail at life.",
            "title_similarity": "0.4430711",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hpy7437",
            "score": 1,
            "text": "terrible tip. this is how Affluenza happens",
            "title_similarity": "0.05653001",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpy749n",
            "score": 1,
            "text": "My mom would put a stocking stuffed with toys on my bed to wake up to... kept me busy long enough.",
            "title_similarity": "0.7691425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy76qw",
            "score": 1,
            "text": "You waited a fucking year to tell me?",
            "title_similarity": "0.25916636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy77kb",
            "score": 1,
            "text": "Brought to you by a Lego representative",
            "title_similarity": "0.33478525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy78d2",
            "score": 1,
            "text": "Did you actually wait until Christmas afternoon to post this? Lmaoooo you're evil",
            "title_similarity": "0.50240386",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hpy79l4",
            "score": 1,
            "text": "The kid can wait…..",
            "title_similarity": "0.17269218",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy79xg",
            "score": 1,
            "text": "My sister in law let her son open his gifts before me (his uncle) and my wife (his aunt) wake up.  Also, me and the wife got him nice gifts, and she gave him a pair of socks….",
            "title_similarity": "0.61975694",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpy7am0",
            "score": 1,
            "text": "One year I HAD to open a present before mom and dad woke up.  My excuse was that Santa forgot to wrap it.  I was 10.",
            "title_similarity": "0.6999223",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpy7c4p",
            "score": 1,
            "text": "My LPT is if you wrapped the gifts don’t put any to and from stickers on it or writing. When kids learn how to read it’s game over. Just write a letter or use a code for making a mark on the gift. That way they can’t just start opening gifts and will have to wait.",
            "title_similarity": "0.5956818",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy7cxc",
            "score": 1,
            "text": "Where were you with this tip 12 years ago?",
            "title_similarity": "0.17483255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy7dzu",
            "score": 1,
            "text": "My parents did this.  There was always an “open me first” gift clearly set just aside a bit from the tree - something that would keep us occupied for a couple of hours until mom and dad woke up.",
            "title_similarity": "0.69210744",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hpy7hj4",
            "score": 1,
            "text": "Wow. This is a great tip!",
            "title_similarity": "0.07227361",
            "sentiment_compound": 0.8478
        },
        {
            "id": "hpy7kg9",
            "score": 1,
            "text": "My husband and I called my mom the phone babysitter. She lived far away but I would get up and call her, put my child on the phone and go back to bed. She would keep my child on the phone for hours. God rest her soul, she was awesome!",
            "title_similarity": "0.6928951",
            "sentiment_compound": 0.8622
        },
        {
            "id": "hpy7mv6",
            "score": 1,
            "text": "Captain hindsight strikes again",
            "title_similarity": "0.1990271",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hpy7sjj",
            "score": 1,
            "text": "Nope. My son is three and if I don’t go in and take him downstairs he will scream until his brother and mother wake up.",
            "title_similarity": "0.64342415",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpy7tah",
            "score": 1,
            "text": "Get your ass up earlier. Why tf is everyone so lazy? You get one Christmas a year, don't you wanna be awake to enjoy it? I don't even celebrate Christmas and I fully sympathize with the children on this one",
            "title_similarity": "0.7387791",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hpy7tka",
            "score": 1,
            "text": "our rule was when the youngest (my brother) wakes up, they get to wake everyone else up and start christmas. we had one christmas begin at 6am cuz he was so excited. it was awful lol",
            "title_similarity": "0.82540715",
            "sentiment_compound": 0.4435
        },
        {
            "id": "hpy7wrf",
            "score": 2,
            "text": "We always talked on Christmas Eve to decide what time we could all get up (aka what time we could wake up mom). Once we were old enough, we would get up ~15 minutes before that time and make her coffee. She got to wake up every year to her kiddos singing “We Wish You a Merry Christmas” while bringing her coffee in bed.",
            "title_similarity": "0.7651078",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpy7yqa",
            "score": 1,
            "text": "Yeah its all gravy until the little shit piles into my bedroom yelling, \n\n# \"I can't get this bit to fit this bit. Daaaaaaaaaaad!!!\"",
            "title_similarity": "0.54078853",
            "sentiment_compound": 0.3114
        },
        {
            "id": "hpy7zet",
            "score": 1,
            "text": ">Daddy wake up, I need help with figuring out where this piece goes",
            "title_similarity": "0.42140827",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy80he",
            "score": 1,
            "text": "I zip tied the baby gate at the top of the stairs shut to keep them all from going downstairs. Still has 3 kids wake us up between 11 and 3 to tell us that Santa had come.",
            "title_similarity": "0.6616939",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpy84pd",
            "score": 1,
            "text": "Did my mom write this??",
            "title_similarity": "0.22858122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy85zm",
            "score": 1,
            "text": "Its gonna buy you 20 seconds extra, because the kid wont build it asap, and a way more excited kid then i would like to handle at 6 am.\n\nI would suggest making breakfast on the evening before, ready to get put out in the morning together with a new movie, our kids watvhed both encanto and The robot ron movie, at 10 am we were ready ti begin the day and The kids didnt need any attention other then starting the movies and The breakfast put out together with some cookies, youngest is 3, older is 5 oldest is 7.",
            "title_similarity": "0.77204466",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hpy86fa",
            "score": 1,
            "text": "And who pays the other gifts?",
            "title_similarity": "0.09988704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy86jk",
            "score": 1,
            "text": "My mum used to just turn the clock back two hours",
            "title_similarity": "0.38128603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy88b9",
            "score": 1,
            "text": "Or they can wait and build delayed gratification skills.",
            "title_similarity": "0.28242993",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpy88o7",
            "score": 1,
            "text": "Wow, kind of late tip. Nonetheless,  we would try this next year.",
            "title_similarity": "0.42493936",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpy89y2",
            "score": 1,
            "text": "We would have unwrapped presents under the tree from \"santa\" that were always puzzles or games that kept us occupied for quite a while ealy Christmas morning.",
            "title_similarity": "0.7851131",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy8b2s",
            "score": 1,
            "text": "Works for birthdays as well. Most birthday parties are later in the day. They get a present when they wake up.",
            "title_similarity": "0.64726645",
            "sentiment_compound": 0.6222
        },
        {
            "id": "hpy8b43",
            "score": 1,
            "text": "Give em the UCS Millenium Falcon and enjoy a entire weekend getaway\n\nProbably not to the Bahamas after buying that set though",
            "title_similarity": "0.5808449",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpy8bl8",
            "score": 1,
            "text": "I was that kid. My parents always gave us a book with our stocking and I have great memories of reading for hours Christmas morning before the rest of the family woke up",
            "title_similarity": "0.71323454",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpy8em3",
            "score": 1,
            "text": "you clearly dont have kids.",
            "title_similarity": "0.044295065",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy8hvn",
            "score": 1,
            "text": "We always open up gifts on New Years on my mom’s side. I think it’s a cultural tradition that never died out starting with my great great Grampa from Europe. Kinda cool",
            "title_similarity": "0.62000054",
            "sentiment_compound": 0.9206
        },
        {
            "id": "hpy8iiv",
            "score": 1,
            "text": "My mom always left one gift unwrapped and that was from Santa and we could play with that immediately.  This was probably to stop us from waking them up at 6am to open gifts.",
            "title_similarity": "0.76125896",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpy8m26",
            "score": 1,
            "text": "This is definitely the kind of life pro tip a person without kids gives to those with kids.",
            "title_similarity": "0.47953123",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy8pvf",
            "score": 1,
            "text": "That's exactly what my parents did 40 years ago.  Soap done Legos or puzzles in the stocking along with some cocoa, and we were set until a reasonable time (instead of 4:30 AM)",
            "title_similarity": "0.7096949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy8rma",
            "score": 1,
            "text": "Our rule was you can open your stocking whenever you want, but you had to wait to open the gifts until everyone was there",
            "title_similarity": "0.5666832",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hpy8vlg",
            "score": 1,
            "text": "We always had a stocking rule. The stockings were ok for us to get into in the morning while my mom slept in but we had to wait till she woke up for us to open the rest of the gifts. But definitely a good suggestion keeps them busy for a time and allows for parents to sleep in when they often may not have a chance.",
            "title_similarity": "0.8009909",
            "sentiment_compound": 0.7839
        },
        {
            "id": "hpy8x9k",
            "score": 1,
            "text": "My family had stockings in the hallway so that we could grab them without seeing the presents under the tree. My siblings would gather in one room and fantasize about what gifts we got while eating our candy and coloring in coloring books.\n\nIt was the best.",
            "title_similarity": "0.76231253",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpy94tq",
            "score": 1,
            "text": "Cool. What about the other 364 days a year?",
            "title_similarity": "0.2248206",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpy96zk",
            "score": 1,
            "text": "LPT: post Christmas tips before Christmas",
            "title_similarity": "0.4931898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy97kz",
            "score": 1,
            "text": "Yea fuckin right. They will just wake you up to help them with their new Lego set.",
            "title_similarity": "0.6921662",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpy97xk",
            "score": 1,
            "text": "We always allowed our early risers to get into their stocking gifts ONLY until everyone else woke up. This worked out so well.",
            "title_similarity": "0.663604",
            "sentiment_compound": 0.4101
        },
        {
            "id": "hpy99mb",
            "score": 1,
            "text": "Once again...things that could've been brought to my attention YESTERDAY!",
            "title_similarity": "0.36521524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy9ch2",
            "score": 1,
            "text": "I told my kids I'd give them $20 each if they woke up after 7. Best $40 I ever spent. (Last year they were up at 4am and I was playing some Christmas Eve warzone with the boys till 1am).",
            "title_similarity": "0.6601802",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hpy9fe5",
            "score": 1,
            "text": "LPT: Don't lie to children.\n\n(They can still do the whole thing. Write letters to Santa, have cookies for Santa and so on, without factually believing it's true, but rather knowing it is a game).",
            "title_similarity": "0.6863397",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpy9g9c",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.11819924"
        },
        {
            "id": "hpy9hat",
            "score": 1,
            "text": "I had a stocking at the foot of my bed. Little toys and such. Kept me occupied for a good hour or so.",
            "title_similarity": "0.6113069",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpy9jz1",
            "score": 1,
            "text": "Kid unwraps gift, sees its legos throws it to the side to go see what else they got.\n\nPeople actually type this shit out thinking they’re a “life pro” and offering some life hack tip they just have to share?",
            "title_similarity": "0.6654459",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hpy9nzk",
            "score": 1,
            "text": "This is hilarious. This would never work. If a kid is one to wake up everyone on Christmas, a single lego set isn’t going to contain their excitement. Laughable “pro tip.”",
            "title_similarity": "0.7317822",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hpy9pl7",
            "score": 1,
            "text": "There goes another 50 bucks.",
            "title_similarity": "0.108284995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy9pn6",
            "score": 1,
            "text": "This reminds me of the when my son was little and he was an early riser. We would wake up to the sounds of him rifling through a plastic container of legos, looking for that one piece.",
            "title_similarity": "0.7107706",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpy9w3d",
            "score": 1,
            "text": "Unless your kid hates Legos. Then you're just screwed.\n\nSource: was once a kid, never liked Legos.",
            "title_similarity": "0.5147939",
            "sentiment_compound": -0.8142
        },
        {
            "id": "hpy9wk8",
            "score": 1,
            "text": ".... Kids starts screaming through the entire house \"looook my new lego set!! Everyone look!!\"",
            "title_similarity": "0.62600124",
            "sentiment_compound": -0.5815
        },
        {
            "id": "hpy9xkq",
            "score": 1,
            "text": "When I was a kid a small lego set would take me approximately 10 minutes. Gotta get them the millennium falcon.",
            "title_similarity": "0.5881252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpya11t",
            "score": 1,
            "text": "Then you get to find and step on small Lego’s weeks later and will curse the day you brought Legos into the house",
            "title_similarity": "0.7656174",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpya62l",
            "score": 1,
            "text": "Yeah… lego… so shell out a small fortune for a kid who should learn some patience..",
            "title_similarity": "0.5918877",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyaa7h",
            "score": 1,
            "text": "So, \"let the wookie win...\"",
            "title_similarity": "0.26168063",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpyab91",
            "score": 1,
            "text": "I like how this engages instead of punishing.",
            "title_similarity": "0.18024343",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hpyac7d",
            "score": 1,
            "text": "My mom would allow us to open our stockings without being supervised. Just some candy, small toys, and LOTTERY TICKETS. \n\nShe'd put up to 4 of the bingo and crossword lottery tickets in each of my sister's and I's stockings. So we'd take some time scratching those off while she slept in.",
            "title_similarity": "0.69368935",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpyacni",
            "score": 1,
            "text": "I don't think that would work with my 20 year old daughter who still wants to wake us up at 5am to do presents. 😁",
            "title_similarity": "0.6245822",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpyad3t",
            "score": 1,
            "text": "what if the kid doesn't have any arms",
            "title_similarity": "0.042781368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyadl8",
            "score": 1,
            "text": "My brother and I had stockings outside our door in the morning. We could open those an play with them when we got up. Not allowed downstairs until parents were up.",
            "title_similarity": "0.7592047",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpyahot",
            "score": 1,
            "text": "Am I the only one who has to wait until after dinner to open presents?",
            "title_similarity": "0.5748591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyai0p",
            "score": 1,
            "text": "Or, you could realize that Christmas is a holiday for your kids and get up whenever they do for the ultimate Christmas joy. There's not a single day of the whole year more exciting than Christmas. You can suck it up for your kids",
            "title_similarity": "0.7924187",
            "sentiment_compound": 0.796
        },
        {
            "id": "hpyapnu",
            "score": 1,
            "text": "Or you know, you can just wake up early the one day of the year kids actually want to wake up early.",
            "title_similarity": "0.63908684",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpyaup5",
            "score": 1,
            "text": "You’ll wake em up ok with a step or two on top of one.\n\nI couldn’t link it but do Google ‘shark steps on lego’ .. hysterical",
            "title_similarity": "0.55017114",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hpyaw0l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.11819924"
        },
        {
            "id": "hpyawiu",
            "score": 1,
            "text": "Or you can teach your kid discipline",
            "title_similarity": "0.23188378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyb2d9",
            "score": 1,
            "text": "My parents used to put one present on my bedside table that I could open before we were allowed up at 7am. One year they picked one at random, they didn't know what it was. It was a cricket ball. They were really not happy about me throwing that against the wall at 5am. Lego is a good idea....",
            "title_similarity": "0.7671506",
            "sentiment_compound": -0.0967
        },
        {
            "id": "hpyb3j3",
            "score": 1,
            "text": "When I started reading this and got to “Lego” I went back to check if this was r/UnethicalLifeProTips and would be finishing with pranking hour kid by making them step on Lego pieces.",
            "title_similarity": "0.6659944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyb3xs",
            "score": 1,
            "text": "My parents would hang a Christmas stocking on the outside of our door filled with small puzzles, cards, candy, etc.\n\nThe rule was that on Christmas morning, you take your stocking downstairs quietly and try to solve all the puzzles before mom got up at 9. My dad would come down early and queue up Christmas movies for us to watch to help keep us occupied. \n\nIt was the perfect solution. Mom gets some much needed rest (she always insists on wrapping everything the night before to make it more exciting) and the kids have some fun/light competition. \n\nI’m 31 and we still keep the same traditions when I visit.",
            "title_similarity": "0.865591",
            "sentiment_compound": 0.9184
        },
        {
            "id": "hpyb4cj",
            "score": 1,
            "text": "Or a bottle of brandy.",
            "title_similarity": "0.038256966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyb5lc",
            "score": 1,
            "text": "That’s what stockings are for",
            "title_similarity": "-0.027924247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyb98a",
            "score": 1,
            "text": "My mom used to have Santa leave a designated \"early\" present under the tree when I was really small, and I would get up as soon as I saw the first small sliver of sunlight on the horizon, get all excited unwrapping that first present and then fall asleep on the couch until the rest of the house woke up.",
            "title_similarity": "0.8643123",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpybang",
            "score": 1,
            "text": "Not sure there's much mileage in this... My almost 7 year old is responsible enough to not wake up anyone else Christmas morning, yet my 5 year old wouldn't be able to assemble the legos by himself (depending on the difficulty) or would wake up everyone to show them what he found in his room or completed...",
            "title_similarity": "0.8089537",
            "sentiment_compound": -0.2644
        },
        {
            "id": "hpybayy",
            "score": 1,
            "text": "Yea but as anyone with kids knows, waking up early is an everyday occurrence.",
            "title_similarity": "0.5506028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpybbfa",
            "score": 1,
            "text": "!remindme 265 days",
            "title_similarity": "0.11004919",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpybjzb",
            "score": 1,
            "text": "Kids up at 6am this morning, fml.",
            "title_similarity": "0.49766713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpybkgv",
            "score": 1,
            "text": "What do you think stockings are for?",
            "title_similarity": "0.003707856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpybldt",
            "score": 1,
            "text": "I had my sister sleep over and bunk with my daughter, so she got woken up at 7am instead of me 😈",
            "title_similarity": "0.6071781",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpybm0t",
            "score": 1,
            "text": "This would backfire and I would be up helping build a Lego set.",
            "title_similarity": "0.6217575",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpybm93",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.11819924"
        },
        {
            "id": "hpybq8l",
            "score": 1,
            "text": "Developed countries have christmass at night.",
            "title_similarity": "0.4237539",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpybv4c",
            "score": 1,
            "text": "Dammit, this is smart. Thank you. My kids are adults now, and wish I had this tip years ago",
            "title_similarity": "0.5368712",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpybw9m",
            "score": 1,
            "text": "LPT: don’t procreate",
            "title_similarity": "-0.030014822",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpybwa0",
            "score": 1,
            "text": "Wish my parents would see this before I grew up. I was waking up at 4 on christmas and tried very hard to make as little noise as possible opening those plastic bags that separated legos.",
            "title_similarity": "0.81443745",
            "sentiment_compound": 0.2516
        },
        {
            "id": "hpyc2bj",
            "score": 1,
            "text": "...Or you could teach your kids not to be obnoxious brats  ...",
            "title_similarity": "0.41693938",
            "sentiment_compound": 0.357
        },
        {
            "id": "hpyc44t",
            "score": 1,
            "text": "!remindme 364 days",
            "title_similarity": "0.070268095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyc5vb",
            "score": 1,
            "text": "Sounds like a bad idea honestly",
            "title_similarity": "0.016955327",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpyc6bb",
            "score": 1,
            "text": "My sister and I could go out and open the stockings whenever we woke up (usually when it was still dark), but we couldn't wake my parents up for presents until 7. We learned how to run the coffee machine as kids so we could have their coffee ready by the tree and start opening presents immediately. 😅",
            "title_similarity": "0.76240677",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hpyc6fy",
            "score": 1,
            "text": "That's what stockings are for!",
            "title_similarity": "0.001408929",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyc7w1",
            "score": 1,
            "text": "We always opened on Christmas Eve so we can sleep in and play with everything in the morning instead of being forced to watch everyone else open theirs and not touch yours until 4 hours of boring family stuff",
            "title_similarity": "0.8206917",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpycbc3",
            "score": 4,
            "text": "I just got beat and told to go back to sleep 🤷‍♀️",
            "title_similarity": "0.33631295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpych92",
            "score": 1,
            "text": "This is what my parents did! We always woke up to a toy at the end of the bed—Lego’s or a puzzle or something that occupied our time until Dunkin’ Donuts opened",
            "title_similarity": "0.80402625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyckyh",
            "score": 1,
            "text": "My mom always coerced my dad into individually wrapping all the stocking stuffers. Soap, shampoo, toothpaste, bag of M&Ms, all kept me and my sister occupied for hours while they slept later and then got breakfast ready. The fact that this tradition has kept going into our young adult years... maybe concerning haha.",
            "title_similarity": "0.73085546",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpycn2i",
            "score": 1,
            "text": "Latinos just wait until midnight to open our presents.",
            "title_similarity": "0.6280148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpycnt6",
            "score": 3,
            "text": "I mean, it sounds like a good idea but most kids are excited to open presents.  Not open one present and play with it for 2 hours while a big stack under the tree remains untouched lol",
            "title_similarity": "0.7486015",
            "sentiment_compound": 0.9185
        },
        {
            "id": "hpycout",
            "score": 1,
            "text": "In the UK, the whole point of Christmas stockings is that you sneak them into the kids' rooms so that they're there when they wake up and they can play with that stuff until the parents get up.\n\nAmerica seriously needs to get on board with this. It removes a whole lot of stress from Christmas mornings!",
            "title_similarity": "0.8275863",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hpycov7",
            "score": 1,
            "text": "I managed the fine skill of removing tape off wrapping paper without damaging the paper at *all*- and I had a scary high success rate.\n\nSoooo before Christmas, when no one looked..\n\nAnd it was great ammo to use to control my little sister with bc u had the knowledge 😎",
            "title_similarity": "0.6742529",
            "sentiment_compound": 0.8721
        },
        {
            "id": "hpycqg1",
            "score": 1,
            "text": "My parents left me a small note, my gameboy, and two of the cookies left over from Santa's visit. The note said that I was to leave my parents alone so they could sleep and when they wake up we could start Christmas. He said something about an extra gift in it for me which turned out to be something my parents were already doing for me, just now called a gift. They made my favorite for dinner.",
            "title_similarity": "0.7967727",
            "sentiment_compound": 0.765
        },
        {
            "id": "hpycrrf",
            "score": 1,
            "text": "We used to put their Christmas stocking on their bed before we went to bed. They could stay in bed and open all the little things in there and we could sleep a bit longer.",
            "title_similarity": "0.75864077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyctz1",
            "score": 1,
            "text": "I know some families that make a Christmas obstacle course outside of their kids rooms. Kids have fun, and it stalls for time.",
            "title_similarity": "0.7421591",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpycvf8",
            "score": 1,
            "text": "Why are all r/LifeProTips so damn stupid?",
            "title_similarity": "0.26693276",
            "sentiment_compound": -0.8003
        },
        {
            "id": "hpycwlv",
            "score": 1,
            "text": "I mean, or just wake up with them once a year and enjoy it?  Kids aren’t little forever and Christmas morning is one of the most magical with little people.",
            "title_similarity": "0.77275354",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpyd0i7",
            "score": 1,
            "text": "I been waking up on Christmas 5 or early when I was a kid. No way I'm denying my kid that kind of fun.",
            "title_similarity": "0.7093965",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hpyd11p",
            "score": 1,
            "text": "We do stockings so the kids can get up, get their stocking and keep quiet until the adults are up. Don't wake up the adults and play with your stocking stuffers. Its been passed down through the generations. When my Dad was a kid, when I was a kid, and now my kid.",
            "title_similarity": "0.61812973",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpyd2ge",
            "score": 1,
            "text": "My son would be bugging me every 15 mins asking why this didn’t work",
            "title_similarity": "0.5247411",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyd67p",
            "score": 1,
            "text": "My family opened up presents Christmas Eve and Santa’s were never wrapped. I could get up at 3 am or 10 am, it was all the same to them and the gifts",
            "title_similarity": "0.6507107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyd7tn",
            "score": 1,
            "text": "Better LPT - swap the child's bedroom door-knob-lock to the outside and you'll have all the time in the world",
            "title_similarity": "0.62796646",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpyd8zf",
            "score": 1,
            "text": "Bold of you to think kids would be productive enough to build with Legos while parents get more sleep",
            "title_similarity": "0.779683",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hpydfy6",
            "score": 1,
            "text": "Or maybe you just deal with it for a day",
            "title_similarity": "0.2321312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpydnpc",
            "score": 1,
            "text": "I actually gave my kid a Lego set last night for the Christmas Eve present. He Spent 4 hours building and playing and I got to clean my house. I think ur plan is good too.",
            "title_similarity": "0.81863403",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hpydugs",
            "score": 1,
            "text": "This is what the stocking is for. The Lego set goes into the stocking. They are of course allowed to open the stocking before parents are up. It’s purpose is to keep the kids entertained until it’s actually morning.",
            "title_similarity": "0.8025919",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpydvpj",
            "score": 1,
            "text": "i was that kid. this would have been amazing for me growing up",
            "title_similarity": "0.42583317",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hpydw9i",
            "score": 1,
            "text": "Im 40 years old and I vividly remember some of the little space ship sets I built in my room. The house all silent. I felt so old, up before everyone building something by myself. This is a perfect idea.",
            "title_similarity": "0.6513963",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hpye14w",
            "score": 1,
            "text": "“Here’s a death star, don’t come out until you finish it.”",
            "title_similarity": "0.23947376",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hpye609",
            "score": 1,
            "text": "Lol my kids would burn the house down if that's what it took to get me outta bed.  There is no wait, only chaos and destruction.",
            "title_similarity": "0.45367754",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hpye8k1",
            "score": 1,
            "text": "Yeah, it's totally my KIDS that get up way too early...",
            "title_similarity": "0.57981944",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpye9l0",
            "score": 1,
            "text": "I'd say most kids wouldn't open it since it wouldn't be Christmas morning yet.",
            "title_similarity": "0.539895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyeccd",
            "score": 1,
            "text": "I'm that kid now at 40. Stayed up to 12:30 doing Santa stuff, still got up at 5 to await them waking up.",
            "title_similarity": "0.6491477",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpyee2m",
            "score": 1,
            "text": "LPT: Make it the Millenium Falcon and sleep in until the new year",
            "title_similarity": "0.5433081",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyehlu",
            "score": 1,
            "text": "Yeah bit late for me now....cheers tho",
            "title_similarity": "0.25027898",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpyeizu",
            "score": 1,
            "text": "Yeah that’ll work. :/",
            "title_similarity": "-0.026231864",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpyepcp",
            "score": 1,
            "text": "My kid would 100 percent wake me up to help him.",
            "title_similarity": "0.4981864",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpyerht",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.11819924"
        },
        {
            "id": "hpyerv2",
            "score": 1,
            "text": "Just get up with your kids and share the excitement with them. It doesn't last forever...",
            "title_similarity": "0.589326",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hpyeue7",
            "score": 1,
            "text": "this is actually genius",
            "title_similarity": "0.06508359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyeut3",
            "score": 1,
            "text": "Lol, my kids, 10 and 7, didn't wake up until 7:30!",
            "title_similarity": "0.5527242",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hpyewxh",
            "score": 1,
            "text": "My younger son is always the first to wake up and he bust child in the living room, but today, my older I've woke up first - **at 1:30am** .. and then started waking up the rest of us to inform us that Santa came! M",
            "title_similarity": "0.79511267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyex5p",
            "score": 1,
            "text": "Way easier to give your kid a zyrtec before bed to keep that sucker out for 10 hours.",
            "title_similarity": "0.7073086",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hpyexfj",
            "score": 1,
            "text": "!RemindMe 5 years lol",
            "title_similarity": "0.18817668",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hpyf0a0",
            "score": 1,
            "text": "Will this work for a dad who wakes everyone up too early on Christmas?",
            "title_similarity": "0.7584936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyf0vv",
            "score": 1,
            "text": "My family always did gifts on Christmas Eve",
            "title_similarity": "0.63990796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyf2gv",
            "score": 1,
            "text": "LPT:\n\nDon't have kids and you can wake up in silence whenever you like.",
            "title_similarity": "0.35814267",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpyf9d3",
            "score": 1,
            "text": "For my kids we do a treasure hunt to keep them occupied so we can sleep in. At the end they get to find the key to unlock their handcuffs",
            "title_similarity": "0.686584",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpyfa6y",
            "score": 1,
            "text": "As the child who woke up too early and woke everyone too early, I’m just gonna bring the present with me while I wake everyone up. Heavy sleepers get whacked with the present until they get up lol",
            "title_similarity": "0.7996815",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpyfasq",
            "score": 1,
            "text": "Great tip for making a child spoiled. Learn the kid they will get gifts when waking up early. \n\nThen you have to give the kid a set of lego every day for 15 years. \n\nOr, you can just talk with the kid and its all done",
            "title_similarity": "0.8354491",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpyff85",
            "score": 1,
            "text": "Bonus you get to step on it at end of night putting your kid to bed",
            "title_similarity": "0.5905889",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hpyflaj",
            "score": 1,
            "text": "But... what if I'm the one waking up my wife early? Should I buy myself a lego set?",
            "title_similarity": "0.73404044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyfunm",
            "score": 2,
            "text": "LPT: post tips BEFORE Christmas day that refer to Christmas day.",
            "title_similarity": "0.49518788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyg12j",
            "score": 1,
            "text": "We could wake up whenever we wanted, but could only open the stockings. Real gifts waited until everybody was up, but my sister and I would wake up super early just to look in the stockings.",
            "title_similarity": "0.75872433",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hpyg3pd",
            "score": 1,
            "text": "True LPT: Don't have children.",
            "title_similarity": "0.07775539",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpyg5c6",
            "score": 1,
            "text": "This didn't work cos my god daughter is too stupid to do a Lego set on her own",
            "title_similarity": "0.44762778",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpyg5yi",
            "score": 1,
            "text": "Could have used this advice for a long time haha",
            "title_similarity": "0.19373915",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpyga5d",
            "score": 1,
            "text": "Tip I could have used YESTERDAY!  Haha great got it for next year ty!",
            "title_similarity": "0.50509423",
            "sentiment_compound": 0.8264
        },
        {
            "id": "hpygag5",
            "score": 1,
            "text": "I am glad that you think your kids will wait until morning to unwrap gifts you left in their rooms last night",
            "title_similarity": "0.78859496",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpygdon",
            "score": 1,
            "text": "In before someone rages about how they shouldn't have to bribe their kids and how they'll just beat them instead lol",
            "title_similarity": "0.5108112",
            "sentiment_compound": 0.0752
        },
        {
            "id": "hpygiih",
            "score": 1,
            "text": "Don't do this. It's rewarding bad behaviour.",
            "title_similarity": "0.08075337",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hpygiw9",
            "score": 1,
            "text": "I do this for my husband",
            "title_similarity": "0.25308496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpygj52",
            "score": 1,
            "text": "We had a special blanket the we put in front of the tree after the kids were asleep on the Eve. We would put their stockings filled with small toys and gifts on the blanket along with some snacks (nuts, fruit, crackers). Whenever they woke up they could have their stocking and eat/play quietly with that stuff until everyone else was up.",
            "title_similarity": "0.7886492",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpygjpt",
            "score": 1,
            "text": "Where were you with this post at 5:30 this morning!? Jk",
            "title_similarity": "0.355292",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hpygnl8",
            "score": 1,
            "text": "Just dose them with Zquil",
            "title_similarity": "0.062142942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpygp84",
            "score": 1,
            "text": "This must be some privilege shit because growing up there was no opening gifts as soon as I woke up. For the most part xmas was a regular fay until the family showed up or dinner was made and eatin and ONLY at the end of day when everyone had their cameras was I able to open ANY gifts.",
            "title_similarity": "0.70881635",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hpygv7i",
            "score": 1,
            "text": "So what do I do when that child is 23 and lives with his girlfriend? Asking for a friend",
            "title_similarity": "0.42130473",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpygvqt",
            "score": 1,
            "text": "I always tell our kids that I need to do a security sweep of the house, so they don't get kicked by a rogue reindeer. Ocular pat-downs too, can't forget about those.",
            "title_similarity": "0.7014859",
            "sentiment_compound": 0.4707
        },
        {
            "id": "hpygwbv",
            "score": 1,
            "text": "/r/amItheAsshole for posting this on Christmas instead of a week beforehand",
            "title_similarity": "0.5242839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpygwrm",
            "score": 1,
            "text": "My son woke me up at 2:30 am and then again at 2:48 and so on for the rest of the night.  I am half asleep right now lol.",
            "title_similarity": "0.63203514",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpyh749",
            "score": 1,
            "text": "I read this too late. Damnit.",
            "title_similarity": "0.29178277",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hpyhb5k",
            "score": 1,
            "text": "Oh now you tell us",
            "title_similarity": "-0.055112135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyhc93",
            "score": 1,
            "text": "My parents just set a code to determine who got what presents every year to keep us busy in the morning.",
            "title_similarity": "0.7224447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyhdy0",
            "score": 1,
            "text": "You're a Monster!!\n\nXD that is actually such a good idea lol",
            "title_similarity": "0.2869662",
            "sentiment_compound": 0.896
        },
        {
            "id": "hpyhe51",
            "score": 1,
            "text": "Yeah put a lego set in front of they're door, if they try to come, bim",
            "title_similarity": "0.53555226",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpyhi6y",
            "score": 1,
            "text": "In my house you are allowed to root through the stocking before the family gathers",
            "title_similarity": "0.47057608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyhixg",
            "score": 1,
            "text": "LPT:  Post this tip 24 hours sooner.",
            "title_similarity": "0.3748045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyhj83",
            "score": 1,
            "text": "Once a year you can be a mensch and wake up too early.",
            "title_similarity": "0.6035053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyhoca",
            "score": 1,
            "text": "My mom used to do this for me! I’d wake up like 3 hours too early and would usually wake everyone up. So she would give me a bionicle every year that I could open in the morning and play with.",
            "title_similarity": "0.683497",
            "sentiment_compound": 0.636
        },
        {
            "id": "hpyhrmt",
            "score": 1,
            "text": "Our house rule is no presents until everyone is up and we eat breakfast",
            "title_similarity": "0.5765283",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpyhtnz",
            "score": 1,
            "text": "Here we open presents at midnight.",
            "title_similarity": "0.42140502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyhuo1",
            "score": 1,
            "text": "We have a clock that turns yellow when they can get up and out of bed and then thirty minutes later (7am) turns green and they know they can come out of their room.\n\nTook a bit to get my oldest on this, but she had this down by the time she was 4. Same rules apply for the weekend (during the week we're all up before 6am for work). \n\nKids are now 5 and 2 and they waited this morning for their light to turn green. That click is more worth it's weight in gold!",
            "title_similarity": "0.7789948",
            "sentiment_compound": 0.4734
        },
        {
            "id": "hpyhyo3",
            "score": 1,
            "text": "Yes, get only the loudest toys with the most plastic wrapping",
            "title_similarity": "0.39629373",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpyi1by",
            "score": 1,
            "text": "Man. I think my husband and I were truly lucky.  Every Christmas we always had to wake our kids up. I mean it be around 8 sometimes 9 Christmas morning the kids would still asleep. We’d have to walk and talk real loud in front of their bedroom door to get them stirring.  Lol.",
            "title_similarity": "0.86484563",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hpyi29s",
            "score": 1,
            "text": "Mine would come in the room and ask for help building it(she's 7) lmao",
            "title_similarity": "0.48322675",
            "sentiment_compound": 0.765
        },
        {
            "id": "hpyi9mr",
            "score": 1,
            "text": "From the PNW and we always opened Christmas PJ’s on Christmas Eve before bed.",
            "title_similarity": "0.7239448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyie3e",
            "score": 1,
            "text": "My siblings and I would do a sibling gift swap early in the AM before we woke up our parents.",
            "title_similarity": "0.6986121",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpyilbt",
            "score": 1,
            "text": "Or how about don't be lazy and expect to wake up early with your kids",
            "title_similarity": "0.5984777",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hpyiv47",
            "score": 1,
            "text": "My parents would put one or two small things (yes, often a small Lego set), a book, an orange, and usually a bit of chocolate into our stockings and deliver them to the foot of our beds during the night.\n\nSo when we woke up, we'd have something to do (Lego + book) and a little chocolate and orange to eat.\n\nThe orange always seemed weird until I asked my mom and she explained the history and how oranges used to be a really expensive gift.\n\nI did this with my kids and it definitely helped.",
            "title_similarity": "0.83390313",
            "sentiment_compound": 0.7832
        },
        {
            "id": "hpyivje",
            "score": 1,
            "text": "This post is 13 hours too late.",
            "title_similarity": "0.32422274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyiz95",
            "score": 2,
            "text": "You could also leave their favorite tasty treat in a container and slip some Xanax power in there.",
            "title_similarity": "0.477881",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hpyizn3",
            "score": 1,
            "text": "Or you can teach them respect at an early age which they’ll carry through to adulthood.",
            "title_similarity": "0.3737609",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpyj1nu",
            "score": 1,
            "text": "MOMMY LOOK WHAT I GOT",
            "title_similarity": "0.20922798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyj2g9",
            "score": 1,
            "text": "Remindme! 11 months",
            "title_similarity": "0.11451037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyj48s",
            "score": 1,
            "text": "My grandma did this to me with a puzzle. For a solid 20 minutes I thought I was grounded.",
            "title_similarity": "0.50975364",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpyj49a",
            "score": 1,
            "text": "That is why we got stockings! They kept us occupied.",
            "title_similarity": "0.28563878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyj4z4",
            "score": 1,
            "text": "It’s nice to see OP added that they don’t have kids\n\nI mean it was fucking obvious to everyone who does have kids but still, nice to see",
            "title_similarity": "0.47949243",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hpyj7m6",
            "score": 3,
            "text": "Sponken like somebody who doesn’t have kids.",
            "title_similarity": "0.18738498",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpyjb3d",
            "score": 1,
            "text": "Or just do what we did growing up...you can dig into your stocking when you wake up, but presents wait for everyone.",
            "title_similarity": "0.6225283",
            "sentiment_compound": 0.09
        },
        {
            "id": "hpyjczp",
            "score": 1,
            "text": "Or crush up an antihistamine in some eggnog with a dash of whiskey before they go to bed",
            "title_similarity": "0.48296195",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hpyje90",
            "score": 2,
            "text": "Bit late to post this dont you think",
            "title_similarity": "0.21898167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyjhab",
            "score": 1,
            "text": "My life pro tip was just to skip the kids part of life. I get my own Legos!",
            "title_similarity": "0.6520066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyjqo9",
            "score": 1,
            "text": "It would’ve had to have been the DeathStar for my little one, she woke at 02:10 and thought it was game-on as Santa had called.",
            "title_similarity": "0.6533432",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyjsl9",
            "score": 1,
            "text": "Or just don't give them sh*t so next year they'll learn.",
            "title_similarity": "0.46058396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyjy85",
            "score": 1,
            "text": "ok that shit will take 2 minutes bro",
            "title_similarity": "0.14049923",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpyjz66",
            "score": 5,
            "text": "This doesn't make sense. The whole reason they get up is because they know there are presents to open and as long as there are still unwrapped presents, the possibility of something better than what they currently have is still there.\n\nI've never seen a kid not want to immediately open more after unwrapping something they absolutely love.",
            "title_similarity": "0.70476764",
            "sentiment_compound": 0.8004
        },
        {
            "id": "hpyk1wf",
            "score": 1,
            "text": "Thank you, marketing.",
            "title_similarity": "0.076632336",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpyk55r",
            "score": 1,
            "text": "Great information, you don’t know our kid!",
            "title_similarity": "0.30622602",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hpykazg",
            "score": 1,
            "text": "Or you know, be civilised and do gifts on Christmas Eve.",
            "title_similarity": "0.50341946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpykg9q",
            "score": 1,
            "text": "Presents have always been after Christmas dinner for my family.  It was kind of odd but I totally get it now.",
            "title_similarity": "0.7666148",
            "sentiment_compound": -0.2014
        },
        {
            "id": "hpykjog",
            "score": 1,
            "text": "The Christmas Methadone treatment strategy...",
            "title_similarity": "0.36222777",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpykl58",
            "score": 4,
            "text": "Lol, clearly made by someone without kids.\n\n\nWishful as fuck thinking.",
            "title_similarity": "0.30005628",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpyl093",
            "score": 3,
            "text": "I actually disagree with this. This is a pacifier move. Kids do need to learn patience.  But be clear and fair with your expectations. Kids do respect those as they're not ambiguous. I say this as both a parent of ten years and as a teacher for eight.",
            "title_similarity": "0.56261575",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hpylh3c",
            "score": 1,
            "text": "Forget that, buy your kid something like a shelving unit from Ikea. Not only will they be occupied, they'll have a cool shelving unit to put all all their old cups on when they get older",
            "title_similarity": "0.62374234",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpylh8h",
            "score": 1,
            "text": "When I was little(probably 6ish) I woke up early one Christmas and my parents weren’t having it. They told me I could open one present before they got up, but I had to let them sleep. Looking back, they must’ve known which present I was going to open.\n\nI opened the biggest present, which was a Toy Story playhouse that needed some assembly. The directions had pictures, so I put it together myself while my parents slept. By the time they got up, I had a fully assembled Toy Story playhouse that I loved, and I had to be reminded that there were other presents to open.",
            "title_similarity": "0.90197426",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hpylqic",
            "score": 1,
            "text": "I got half way through this and was like “are they gonna suggest the kid jumps out of bed and steps on legos??",
            "title_similarity": "0.68254596",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hpyltm8",
            "score": 1,
            "text": "What the hell is this? Told our kids long time ago do not wake anyone on Christmas. My youngest gets up at 7am everyday no matter what. Today I was already up and it was 8am. She was literally running around in a circle to kill time. She finally gave up and woke up my other two kids, which after 8am is completely okay lol.",
            "title_similarity": "0.7213683",
            "sentiment_compound": -0.7272
        },
        {
            "id": "hpylwf4",
            "score": 1,
            "text": "I’m 30 and it still works on me.",
            "title_similarity": "0.17605792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpylwsh",
            "score": 1,
            "text": "Got woken up at 4:50 by our 4 year old. All presents and breakfast was done by 6:30 lol. Wife and I are half dead but I am sure we’ll miss these times.",
            "title_similarity": "0.66838396",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpylzmw",
            "score": 1,
            "text": "Found out last night that the kids had found and ripped open the Lego sets I got them for Christmas, weeks ago. Feels bad.",
            "title_similarity": "0.7282046",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpym11w",
            "score": 1,
            "text": "Yeah because I've got enough money to buy fucking Legos 😅",
            "title_similarity": "0.50348294",
            "sentiment_compound": 0.6096
        },
        {
            "id": "hpym2r2",
            "score": 1,
            "text": "Or tell them to go back to bed or Santa is taking the presents back",
            "title_similarity": "0.59339094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpym3k0",
            "score": 1,
            "text": "My parents always let us open the stockings when we got up. That gave us some snacks to tide us over (usually an orange, chocolate and some nuts), and there were always a few small inexpensive games or coloring books. I didn't realize their genius plan to keep us busy until years later.",
            "title_similarity": "0.80421484",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpym47i",
            "score": 1,
            "text": "Alternative option: Move your child while they sleep into one of the deadly assault courses from Raven where they must overcome the challenges of understanding the scottish accent while dodging inflatable and padded mat based obstacles.",
            "title_similarity": "0.55104464",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hpym9zt",
            "score": 1,
            "text": "As a kid, we always had Christmas on the evening of 24th. We would unwrap the gifts, build the LEGO sets (Town for me, Paradisa for my sister), then go to bed, and our parents got to sleep late on the 25th. By breakfast time, I would already present to them whatever I had built from my imagination, using my new and old LEGOs together.",
            "title_similarity": "0.8864437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymafd",
            "score": 1,
            "text": "Give them a lego set but take away a few pieces so they are taking extra long if you want to sleep in late.",
            "title_similarity": "0.7502653",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hpymcmm",
            "score": 1,
            "text": "Locks on doors also work /S……sorta",
            "title_similarity": "0.31086183",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymcn4",
            "score": 1,
            "text": "“Give poorly behaved kids more presents”",
            "title_similarity": "0.4462849",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymczx",
            "score": 1,
            "text": "My parents did this every year, totally worked, definitely recommend.",
            "title_similarity": "0.45021865",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hpymd1u",
            "score": 1,
            "text": "We’ve been through five sets today and counting.",
            "title_similarity": "0.20801434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymfpn",
            "score": 1,
            "text": "r/AwardSpeechEdits",
            "title_similarity": "-0.0016647466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymlld",
            "score": 1,
            "text": "I was thinking you were going to say put legos on the floor for them to step on...we were going into danger levels here",
            "title_similarity": "0.5426235",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hpymm5w",
            "score": 1,
            "text": "Sponsored by Lego",
            "title_similarity": "0.29442504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymtdc",
            "score": 1,
            "text": "OP is sponsored by Lego.",
            "title_similarity": "0.3202662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpymtu5",
            "score": 1,
            "text": "Or you can tie and gag them while they sleep and wait till we all wake up to remove the ropes.",
            "title_similarity": "0.46015683",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpymw3o",
            "score": 1,
            "text": "Don't reward this behavior. Every 15 minutes we get woken up before 730, a present is getting returned. We can start at 6am if you want, but that leaves you with 1 present.",
            "title_similarity": "0.608044",
            "sentiment_compound": -0.2141
        },
        {
            "id": "hpyn03t",
            "score": 1,
            "text": "Wish I would have seen this yesterday. I already took a nap today to catch up on my sleep.",
            "title_similarity": "0.6271019",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpyn0ex",
            "score": 1,
            "text": "The better advise is to put the kids to bed an hour later. Source: Kids woke up at 4:50 this morning for the first time in their lives.",
            "title_similarity": "0.6853988",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpyn3t8",
            "score": 1,
            "text": "My parents just gave me and my brother a pillowcase full of little toys, colouring in books, puzzle books, some sweets etc at the end of our bed. So when we woke up at 5am or 6am we'd be kept super busy in our rooms not waking anyone up and not even wanting to go to our downstairs presents until gone 8.\n\nAnd best of all - we were super quiet as we didn't want to be sent back to ned! We thought we were outwittimng them!",
            "title_similarity": "0.81034666",
            "sentiment_compound": 0.9482
        },
        {
            "id": "hpyn46c",
            "score": 1,
            "text": "This is what my mom would do. When me and my two siblings were little, she would sneak into our rooms super early and leave a single small gift at the base of our bed. Kept us somewhat occupied in case we woke up early, but my brother would wake everyone up at 6:30 regardless.",
            "title_similarity": "0.8435794",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpyn56r",
            "score": 1,
            "text": "In what world do I not just get woken up once every 5 min to interpret the instructions, pull fallen pieces out of the supply registers,  or otherwise deal with Lego emergencies of my own making?",
            "title_similarity": "0.6256269",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hpynjda",
            "score": 1,
            "text": "Excuse me, half the fun of Christmas Day is waking up at 5AM and looking through my stocking with my sister.\n\nActually, the stocking is the distraction I think.",
            "title_similarity": "0.69597316",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpynkrf",
            "score": 1,
            "text": "My mom and dad always filled our stockings and left them by our bedroom doors for this exact reason.",
            "title_similarity": "0.59882057",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyo0x1",
            "score": 1,
            "text": "Why di I have to buy into that expensive shithole of ecosystem when i can get the kid somethong with value for the money I pay for it?\n\nThis \"LPT\" reads like an ad.",
            "title_similarity": "0.48448938",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hpyo48q",
            "score": 1,
            "text": "You could do this and cater to their every ridiculous whim, or you could be a fucking parent and put your foot down and say no.",
            "title_similarity": "0.45876893",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hpyog3t",
            "score": 1,
            "text": "Here in Belgium, we always give our presents at Christmas Eve. I got more toys on the 6th of December with Sint Nicholas though. And clothes and other stuff on Christmas Eve.",
            "title_similarity": "0.76828134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyol4v",
            "score": 1,
            "text": "I'm going to do this for my son from now on! Thank you for this!!",
            "title_similarity": "0.43483227",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hpyolug",
            "score": 1,
            "text": "so you spend more on the pregame gift than the actual gift",
            "title_similarity": "0.38215837",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hpyoo61",
            "score": 1,
            "text": "idk who thought it's a good idea to give presents in the morning instead of later in the evening\n\nI guess it's easier to prep when kids are asleep but we always gave presents on the 24th after eating, my parents would always think of crazy stunts to make me go away from the Christmas tree hah, this year my niece HAD TO call her grandma on the phone with her mum and we were all SOO BUSY we didn't even notice the Santa came!\n\nTurns out someone left the doors unlocked and he got in..",
            "title_similarity": "0.8406663",
            "sentiment_compound": -0.1882
        },
        {
            "id": "hpyop5s",
            "score": 1,
            "text": "SLPT: if your child struggles with boundaries, get rid of the boundaries.",
            "title_similarity": "0.29705328",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hpyp5tg",
            "score": 1,
            "text": "‘ Once again , things that could have been brought to my attention YESTERDAY!!!!’",
            "title_similarity": "0.38157827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpypgzv",
            "score": 1,
            "text": "I'm not a fan of this.  It's important for kids to learn that minor inconveniences such as waiting 30 minutes for people to wake up is no big deal.",
            "title_similarity": "0.5677344",
            "sentiment_compound": -0.3318
        },
        {
            "id": "hpyposs",
            "score": 1,
            "text": "My parents always filled a Christmas stocking with brain exercise toys. Kept us busy while they prepared for the Christmas celebrations.",
            "title_similarity": "0.8376377",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpyq4z1",
            "score": 1,
            "text": "Couldn't you just teach them not to get up and open stuff? Would also teach them patience right?",
            "title_similarity": "0.35821736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyqgxf",
            "score": 1,
            "text": "Holy effing genius Batman! Thanks!",
            "title_similarity": "0.3558939",
            "sentiment_compound": 0.5786
        },
        {
            "id": "hpyqhiq",
            "score": 1,
            "text": "This is so pragmatic and also complete BS. What kid would actually do this? Not my animal children. They’d nod and then do the same shit they always do: make lots of noise and eventually wake everyone else up. It’s their day.",
            "title_similarity": "0.68250775",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpyqzb7",
            "score": 1,
            "text": "Mom wasn't so fussed about the when but rather the how.\n\nMy sister and I were not allowed to wake any adults or start opening presents until we could present a cup of coffee to all the adults in the house first.\n\nMay not like coffee myself but, by seven I could brew a damn fine pot of it lol",
            "title_similarity": "0.65498316",
            "sentiment_compound": -0.0811
        },
        {
            "id": "hpyr04q",
            "score": 1,
            "text": "My mom did this for us, and I’m loving my son taking over the tradition ☺️",
            "title_similarity": "0.4953131",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpyrae4",
            "score": 1,
            "text": "That wouldn’t have flown with me as a kid. I’d have had the Lego set put together in minutes and been like LEGOS LEGOS LEGOS LEGOSLEGOSLEGOSLEGOS!!!!!",
            "title_similarity": "0.68996805",
            "sentiment_compound": 0.5673
        },
        {
            "id": "hpyrg4z",
            "score": 1,
            "text": "I wrapped my sons door jam. Full on wrapping paper after he fell asleep.\n\nHe normally wakes up at 6am. By 730 he was still in there. I yelled at him what hes doing and said santa locked him in. :)\n\nI told him to bust out like koolaid man. Was great fun.",
            "title_similarity": "0.8004499",
            "sentiment_compound": 0.9169
        },
        {
            "id": "hpyro9s",
            "score": 1,
            "text": "That, or they get a jump start on choking to death on a lego without any adult supervision..",
            "title_similarity": "0.56498075",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hpyrq43",
            "score": 1,
            "text": "This is the LPT that came a few hours (or days) late 🤣",
            "title_similarity": "0.26056898",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpyrscu",
            "score": 1,
            "text": "if only it was that easy lol",
            "title_similarity": "0.14419733",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hpys9ig",
            "score": 1,
            "text": "We used to have pillow cases at the end of our bed and “Santa” would fill them with small toys and stuff to keep us occupied while mom slept in",
            "title_similarity": "0.7590711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpysgrg",
            "score": 1,
            "text": "This sounds like a recommendation that has only been evaluated on paper... And on paper it sounds great!",
            "title_similarity": "0.25624537",
            "sentiment_compound": 0.784
        },
        {
            "id": "hpyskm9",
            "score": 1,
            "text": "\nMy parents started to hide our presents in the house. That gave them a few more hours of sleep.",
            "title_similarity": "0.7114957",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpysky0",
            "score": 1,
            "text": "Alternatively, if they have a console, buy them a game which takes a few hours to install and update!",
            "title_similarity": "0.55180395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyss6o",
            "score": 1,
            "text": "My 8 year old just knew she wasn’t allowed to wake us until the baby woke up",
            "title_similarity": "0.5914104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpysyax",
            "score": 1,
            "text": "Thanks for giving me the Lego idea. I’ll just booby trap his floor with loose Legos. Payback is a mother",
            "title_similarity": "0.6868455",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpyt3jj",
            "score": 1,
            "text": "This brings me back! My sister and I would get to open our stockings on Christmas morning just so our parents could sleep in. Thing was, they each had a GIANT bell on them. When we were super young we couldn’t grasp how to mute the bell. But as we got older we learned to wrap some sort of fabric around it to quiet it down.\n\nWe also had the most amazing parents. We were kids of the 80s (82 and 84), our dad did the most amazing thing one year. He stomped on our roof, jingled a giant bell, and made boot prints from the fireplace to the tree. Still makes me misty eyed and we are doing it for our kids now too.",
            "title_similarity": "0.8383135",
            "sentiment_compound": 0.9434
        },
        {
            "id": "hpyt3xx",
            "score": 1,
            "text": "I have kids. This wouldn’t work.   \n    \nNow, it is wholly dependent on the kids and their ages.   \nMy kids are 2 and 6.   \n  \nNo Lego set currently built can keep my 6 year old in his room quietly. Dude is straight savage.  \n  \nLuckily I know their tricks. So I kept them up until 11pm watching Xmas movies on Xmas eve. Then they woke up at 9am on Christmas Day.",
            "title_similarity": "0.80375946",
            "sentiment_compound": -0.128
        },
        {
            "id": "hpyt5pf",
            "score": 1,
            "text": "Or a book. \n\nAs a kid who read every fiction book in my little school library, I found having an hour or two to read quietly on Christmas morning was an amazing gift.",
            "title_similarity": "0.70242846",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hpyt6pc",
            "score": 1,
            "text": "In what universe does this work? No kid who is amped as fuck for Christmas morning is going to sit alone building Legos, lmao.",
            "title_similarity": "0.7494197",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hpyt6v5",
            "score": 1,
            "text": "I had the Elf sitting with a present for each kid at the top of the stairs this year.  I think it did help!",
            "title_similarity": "0.7161449",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hpytdc5",
            "score": 1,
            "text": "Hah mine would just yell that Santa got him a Lego set.",
            "title_similarity": "0.6475538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpytk0q",
            "score": 2,
            "text": "Instructions unclear. Child was confused why I gave them a present a month after Hanukkah.",
            "title_similarity": "0.55113983",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hpytla1",
            "score": 1,
            "text": "As the older sibling I approve",
            "title_similarity": "0.2178303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpytolv",
            "score": 1,
            "text": "My parents had us trained that we were not to wake them until 9am.  So, my wonderful younger sister would wake me up at 6am (while she's been up an hour earlier scoping out the gifts) so we could wait together to open gifts in 3 hours.  The anticipation was torture.",
            "title_similarity": "0.7832076",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hpytz7g",
            "score": 1,
            "text": "I like this!  Thank you. \n\nAdding to this, open all the gifts and cut off all the wires that hold in place, remove tape, install batteries, etc. Basically, prep all the toys so they are ready to go. That way the kids aren’t hovering over and all antsy you while you assemble. Also, you can make sure the toy works beforehand. Nothing like a broken toy to slow down the Christmas momentum.",
            "title_similarity": "0.70618796",
            "sentiment_compound": 0.8432
        },
        {
            "id": "hpytzrr",
            "score": 1,
            "text": "Yeah, that’ll work.",
            "title_similarity": "-0.04624205",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpyu1dm",
            "score": 1,
            "text": "My parents -- I mean Santa Clause -- always left us stair presents, something on the stairs that had to be \"done\" before we could wake up our parents. It might be a book to read, or a puzzle to put together, or a lego set, etc, but we had to finish it before waking up mom and dad.\n\nIt was really nice, because for those of us early we got to start the magic right away, and for those who slept in they had something to look forward to later on. And of course my folks got an extra hour or two of sleep.",
            "title_similarity": "0.87265986",
            "sentiment_compound": 0.6297
        },
        {
            "id": "hpyujey",
            "score": 1,
            "text": "Now that mine are getting older I put legos AND steam gift cards in their room.  Works like a charm",
            "title_similarity": "0.7203622",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hpyujvv",
            "score": 1,
            "text": "My parents always did this. I'm 35 now, but as a kid they always hung one gift on our doorknobs in a stocking and we'd play with that until they got up to do proper gifts under the tree. One year I got a Tamagotchi, once it was Legos, another year it was the most recent Harry Potter book.",
            "title_similarity": "0.7806191",
            "sentiment_compound": 0.7876
        },
        {
            "id": "hpyuk3z",
            "score": 1,
            "text": "My mom would always move our stockings onto our bed or hang them on our doorknob so that in the morning we would distract ourselves opening the little stocking stuffers. She would get to sleep in a little longer, and still get to watch us open the \"real\" presents.",
            "title_similarity": "0.80840516",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpyuqcv",
            "score": 1,
            "text": "My parents used to leave me a ton of packs of baseball cards. That would occupy me for an hour no problem.",
            "title_similarity": "0.6118864",
            "sentiment_compound": 0.2635
        },
        {
            "id": "hpyusis",
            "score": 1,
            "text": "Or just wake up early on your kids favourite day of the year to spend it with them…",
            "title_similarity": "0.68746316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyv2hh",
            "score": 1,
            "text": "Me and my wife have guardianship of her 7 y.o. nephew with some disabilities. The kid came running into our room at 3 AM. Damn near got punted and nearly put the wife into labor. It was a rough start lol. Legos would’ve been a godsend.",
            "title_similarity": "0.7477828",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpyv2y1",
            "score": 1,
            "text": "We do Christmas dinner at 5 on Christmas Eve, presents after that, drunken Cards Against Humanity with the kids after that. Christmas morning we stockings, breakfast, then a live sporting event.",
            "title_similarity": "0.6872643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyv6r8",
            "score": 1,
            "text": "I think OP is my kid just trying to trick me into buying him one more present.",
            "title_similarity": "0.5862645",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpyv8id",
            "score": 1,
            "text": "Wrap em up two xannies and a double scotch, sleep till the Super Bowl.",
            "title_similarity": "0.50122523",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpyvcw6",
            "score": 1,
            "text": "Or... don't have kids.",
            "title_similarity": "0.0036696382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyvigi",
            "score": 2,
            "text": "Yeah, uh.  Little late on this one...  Merry Christmas, everyone!",
            "title_similarity": "0.5586034",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hpyvk8r",
            "score": 2,
            "text": "My parents blocked the hallway with Chrisman wrap which I didn't break for some reason",
            "title_similarity": "0.5627591",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpyvv5e",
            "score": 1,
            "text": "In my family, born and raised in NY, my sister and I were allowed to open the gifts in our stockings without waking mom and dad. That kept us busy until a more reasonable hour.",
            "title_similarity": "0.70278466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyvyxn",
            "score": 1,
            "text": "OP works for Lego.",
            "title_similarity": "0.30205053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyw0o6",
            "score": 1,
            "text": "I thought you were gonna say put some Lego on the floor so they stand on it when they wake up and learn not to go down yet or something lol. Not sure why, I just kinda did-",
            "title_similarity": "0.72478116",
            "sentiment_compound": 0.2115
        },
        {
            "id": "hpyw8hb",
            "score": 1,
            "text": "Just wake up early c'mon, it's one day a year and they are never as excited as when they have just woken up. One day they will be grown up, will stop getting excited and you will miss it.",
            "title_similarity": "0.69396746",
            "sentiment_compound": -0.3476
        },
        {
            "id": "hpywax8",
            "score": 1,
            "text": "Kids stockings are hung on their beds for this reason.",
            "title_similarity": "0.502496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpywyk5",
            "score": 2,
            "text": "Better yet, give them a $1200 titanic replica lego set:\nhttps://www.amazon.com/Creator-Expert-Titanic-Building-10294/dp/B09LCHSC51/ref=mp_s_a_1_3?keywords=Giant+LEGO+Sets&qid=1640476863&sr=8-3\nwith over 9000 pieces and tell them it flies when it's fully built. OP gives you 20 minutes of sleep, I give you 12 months. You're welcome.",
            "title_similarity": "0.6338799",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hpyx20v",
            "score": 1,
            "text": "Or, set boundaries, you know, parent them.",
            "title_similarity": "0.10632807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyx590",
            "score": 1,
            "text": "What’s always worked great for my kids is to fill the stockings with individually wrapped little presents and fun baubles or toys and treats, then stockings are fair game first thing. Presents wait till after mom has coffee in hand",
            "title_similarity": "0.767987",
            "sentiment_compound": 0.9124
        },
        {
            "id": "hpyxauo",
            "score": 1,
            "text": "Honestly, just get up out of bed and start the day as early as your kids want. It's one day a year and you only get so many \"magical\" Christmases",
            "title_similarity": "0.7456567",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpyxb5r",
            "score": 1,
            "text": "This reminded of me. I literally would be awake at first light to see all the Christmas presents, but I wouldn't open any of them. I'd take a peek and check out what my siblings got. I'd sneak back to bed to be woken up later by my siblings.\n\nI did it for years. I'm not sure if anyone ever noticed. Now I wonder if my son will do the same when he's older.",
            "title_similarity": "0.79625",
            "sentiment_compound": -0.3491
        },
        {
            "id": "hpyxhzb",
            "score": 1,
            "text": "In our house you can open your stocking as soon as you get up, but the presents under the tree were for after everyone had gotten up.",
            "title_similarity": "0.6862967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyxst2",
            "score": 1,
            "text": "Or just discipline the child",
            "title_similarity": "0.14470403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyyofu",
            "score": 1,
            "text": "No. Learn some fucking patience and discipline. They can wait a goddamn hour.\n\nLife pro tip?\n\nSpoil your brat tip",
            "title_similarity": "0.5095277",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpyzgmk",
            "score": 1,
            "text": "We tell our kids if their rooms are clean, Santa will leave a present in their room =]\n\nMerry Xmas",
            "title_similarity": "0.77965826",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hpyzk47",
            "score": 1,
            "text": "this is why we have stockings . they can open them as soon as they wake up.",
            "title_similarity": "0.3817636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpyzk6i",
            "score": 1,
            "text": "\"Sweetie, you have to build your first present, then come get us to show us how cool that one is, then we'll all come open presents!\"\n\n*(buys child massive Star Wars Lego set)*",
            "title_similarity": "0.8134037",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hpz05ae",
            "score": 1,
            "text": "Or just enjoy the kids excitement and go with it. Christmas is for the kids and not meant for your lazy ass to sleep in.",
            "title_similarity": "0.7035651",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpz08xy",
            "score": 1,
            "text": "Seeing this about 24 hours too late!",
            "title_similarity": "0.29941726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz0aa3",
            "score": 1,
            "text": "Or teach them to be fucking patient. Some of yall wanna take shortcuts in parenting and it shows",
            "title_similarity": "0.45442116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz0bjs",
            "score": 1,
            "text": "LPT: Don't have kids, enjoy your christmas",
            "title_similarity": "0.46885473",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hpz0gjj",
            "score": 1,
            "text": "As a kid our tradition was that Santa would leave our stockings in our room. We could open those as soon as we woke up but couldn’t go downstairs until 7. Then it was breakfast before presents. \n\nAs a kid it definitely was nice to get to open up some small stuff right away. Usually it was some small toys and coloring books or something. So we had stuff to keep us entertained.",
            "title_similarity": "0.8789145",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hpz0slj",
            "score": 1,
            "text": "You may not be able to do this nowadays, but After a particularly early Christmas, we started getting DVDs in our stockings. And Santa left a note that we had to watch at least 2 (of the 3) before waking mum and dad.",
            "title_similarity": "0.74673444",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz10y7",
            "score": 1,
            "text": "My parents always let us open our stockings before they woke up. We could go no further than that. It was nice to have something small and chocolate to eat while we were waiting on them to get up.",
            "title_similarity": "0.75112474",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpz1j71",
            "score": 1,
            "text": "My parents have always had to wake me up. I don't like mornings lol",
            "title_similarity": "0.57851434",
            "sentiment_compound": -0.5334
        },
        {
            "id": "hpz1l5d",
            "score": 1,
            "text": "I'm 37 and the father in the equation. I'm the one who can't wait and gets everyone up before they're ready.",
            "title_similarity": "0.48817188",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpz1lni",
            "score": 1,
            "text": "Lol, this will not work.\nQualified dad of a 7 year old and 4 year old.\n\nLPT\nHave them stay at their grandparents house",
            "title_similarity": "0.5101741",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpz1msh",
            "score": 1,
            "text": "My parents put our stockings in our room beside our bed! It was amazing and magical waking up to a full stocking. Kept us busy for hours!",
            "title_similarity": "0.6857926",
            "sentiment_compound": 0.658
        },
        {
            "id": "hpz1q9i",
            "score": 1,
            "text": "This is what we did in our house when the boys were little. Stockings(full of little toys and treats) and a small 'Santa' present on the end of their beds were fair game but they had to wait until the \"big light in the sky\" was on to wake Mum and Dad for the rest.",
            "title_similarity": "0.9022074",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hpz1so9",
            "score": 1,
            "text": "Hahahahahahaha oh that's a good one. My husband's family is fucking crazy and the kid they have is just.....no. That child literally makes it his mission to make things as uncomfortable for people as possible because his parents don't know how to parent. Had to sit there and be an audience for him opening gifts (wtf) and he kept yelling at me because I wasn't watching and refused to open his gifts til I did. Asshole. Won't listen, his parents just shove pills and diagnoses down his throat and say terrible shit to him in front of his face about him and others. Just disgusting. Acts like he's 4 but he's fucking 13. \n\nPeople wonder why I don't want kids.",
            "title_similarity": "0.5675922",
            "sentiment_compound": -0.7773
        },
        {
            "id": "hpz1x6e",
            "score": 1,
            "text": "\nSanta would leave stockings at the foot of the bed for my kids.  They could open the stockings but not leave their room until  8 AM, the earliest I could be functional.",
            "title_similarity": "0.78031623",
            "sentiment_compound": 0.0315
        },
        {
            "id": "hpz1ybh",
            "score": 1,
            "text": "My son would wake me up to put it together like he has with all of his other lego sets.  Haha",
            "title_similarity": "0.7560793",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hpz20vn",
            "score": 1,
            "text": "We were allowed to raid the Christmas stocking after midnight mass. There was always one little toy in there to keep us busy.",
            "title_similarity": "0.7387413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz28uv",
            "score": 1,
            "text": "Man I like getting woken up early by my excited children on Christmas. Sometimes I already up before them.",
            "title_similarity": "0.748242",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpz28z4",
            "score": 1,
            "text": "Works on adults, too. \n\nMy brother is 36, married, gainfully employed with no kids. Our Mom got him a little Star Wars T4 shuttle lego set this year and he ignored all his other unopened stuff and immediately started putting it together.",
            "title_similarity": "0.73204434",
            "sentiment_compound": -0.7796
        },
        {
            "id": "hpz29cf",
            "score": 1,
            "text": "no, you should discipline him",
            "title_similarity": "0.09828724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz29ow",
            "score": 1,
            "text": "We have five kids.  Our rule is that the last one up gets to open the first present.",
            "title_similarity": "0.467084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz2ctl",
            "score": 1,
            "text": "DO NOT OPEN THE LEGO SET BEFOREHAND TO INSTALL THE INSTRUCTIONS PRIOR TO BUILDING THEIR SET.\n\nIT’S ALL PART OF THE CHRISTMAS MAGIC/EXPERIENCE!!!",
            "title_similarity": "0.6556562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz2oa1",
            "score": 1,
            "text": "LPT - keep your kids awake late... That way they don't wake up not at the crack of dawn",
            "title_similarity": "0.64132124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz300f",
            "score": 1,
            "text": "Or maybe tell your kid to go the fuck back to bed",
            "title_similarity": "0.46950182",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpz38v5",
            "score": 1,
            "text": "Where were you and this post at 3:00 am this morning?",
            "title_similarity": "0.2975015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz3iy0",
            "score": 1,
            "text": "My kid hates Legos though",
            "title_similarity": "0.4250447",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpz3o0i",
            "score": 1,
            "text": "So the 2500 pc Star Destroyer should buy about 30 min...",
            "title_similarity": "0.2527535",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpz46xw",
            "score": 1,
            "text": "I was allowed to open anything from Santa before my parents got up. I often went down and through all my Santa stuff before I went back to wake my parents.",
            "title_similarity": "0.71107095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz48t8",
            "score": 1,
            "text": "Alright, now what about the other 364 days that they're waking up too early? Asking for a very tired friend",
            "title_similarity": "0.60423356",
            "sentiment_compound": 0.315
        },
        {
            "id": "hpz4x1b",
            "score": 1,
            "text": "We weren’t allowed to come out of our rooms or wake up our parents until there was sunlight outside. We used to sit there staring out the window for god knows how long waiting for the first hint of light 😹",
            "title_similarity": "0.622941",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpz551c",
            "score": 1,
            "text": "This is exactly what we did :) merry Christmas!",
            "title_similarity": "0.4066029",
            "sentiment_compound": 0.7777
        },
        {
            "id": "hpz5blk",
            "score": 1,
            "text": "I thought you were gonna tell us to let legos on the flour of your room on purpose so that if he tries to wake you up he loses his feet but your solution is ok too i guess",
            "title_similarity": "0.74864906",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpz5i43",
            "score": 1,
            "text": "I needed this tip this morning at 5:05am when my 7 and 4 year old were jumping on the bed 😂",
            "title_similarity": "0.6396676",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpz62eg",
            "score": 1,
            "text": "As a kid we would always put our stockings on the doorknob to our bedroom. When we woke up they would be full of treats and small presents like legos or whatever to keep us busy until parents were ready to get up.",
            "title_similarity": "0.8421884",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpz6skz",
            "score": 1,
            "text": "Nice try, kid who wakes everyone up too early!",
            "title_similarity": "0.58662236",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hpz6z5h",
            "score": 1,
            "text": "Uh...no. I'd much rather enjoy watching my kids open gifts. I'll sacrifice waking up early.",
            "title_similarity": "0.6980822",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpz7ghb",
            "score": 2,
            "text": "LPT: condoms are cheap. Use them.",
            "title_similarity": "0.27137357",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz91mk",
            "score": 1,
            "text": "This is genius!  I wish I would have done this when we were up at 4 am this morning.",
            "title_similarity": "0.58322257",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hpz940d",
            "score": 1,
            "text": "What age? My kid woke up at 6:20",
            "title_similarity": "0.4301648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpz996p",
            "score": 1,
            "text": "No kids but I may do this myself. I live alone so theres little point but If I cant find cute things to do with myself what's the point",
            "title_similarity": "0.4500829",
            "sentiment_compound": -0.7446
        },
        {
            "id": "hpz9iz1",
            "score": 1,
            "text": "Growing up we had a rule that was stockings whenever you wake up, presents when everyone wakes up. My parents would put a gameboy game or something in mine so I can play while my older brothers slept.",
            "title_similarity": "0.76590085",
            "sentiment_compound": 0.5209
        },
        {
            "id": "hpz9qse",
            "score": 1,
            "text": "Or, just spread the Lego pieces on the floor around their bed.  That'll be the last time they jump out of bed!",
            "title_similarity": "0.715775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzabxv",
            "score": 1,
            "text": "My 7 year old son is assembling a medium sized lego set (around 60€) in around 45minutes. Thats not much time saved id hes waking up at 5am 😅",
            "title_similarity": "0.6617658",
            "sentiment_compound": 0.0433
        },
        {
            "id": "hpzakum",
            "score": 1,
            "text": "Man I make ‘em stay up late watching movies Christmas Eve ain’t no body got this for that",
            "title_similarity": "0.7213531",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpzap5y",
            "score": 1,
            "text": "My parents used to put most of my toys together Christmas Eve while I slept. If they had done that with the legos I’d prob have been pretty mad lol.",
            "title_similarity": "0.84076846",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpzaqkp",
            "score": 1,
            "text": "My mom used to fill our stockings and then, when we were asleep, she would leave them at them at the foot of our beds. When we woke up, we would empty our stockings and play with whatever was inside all together in my room. That definitely bought my parents an extra hour of sleep.",
            "title_similarity": "0.7326168",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpzbhuh",
            "score": 1,
            "text": "Or simply tell the little shit to learn and not disturb people while they sleep.",
            "title_similarity": "0.45579898",
            "sentiment_compound": -0.2614
        },
        {
            "id": "hpzbm9r",
            "score": 1,
            "text": "We always just had a rule in our house that we could open stockings whenever we got up, but had to wait for our parents to open the rest. That kept us busy for a little while.",
            "title_similarity": "0.7531421",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzbnsb",
            "score": 1,
            "text": "This is a great idea!",
            "title_similarity": "0.06294061",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hpzboz5",
            "score": 1,
            "text": "As long as the kid isn’t the type to leave toys on the floor.\n\n“Merry… AwH #%*@ wHaT tHe @$&# RaERK”",
            "title_similarity": "0.45863712",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpzc5ih",
            "score": 1,
            "text": "My 2 year old grandson will disagree.",
            "title_similarity": "0.3680728",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hpzca8k",
            "score": 1,
            "text": "The most important skill in parenting: keep your kid focused on anything except you as long possible.",
            "title_similarity": "0.48955345",
            "sentiment_compound": 0.5709
        },
        {
            "id": "hpzcqz9",
            "score": 1,
            "text": "This is what the Xmas stocking has been for when I was a kid and now for my own kids.\n\nEspecially if they need to wait for other family to arrive before opening gifts. \n\nStuff the stocking with a few small toys, stickers, other fun little things + some fun snacks like chocolate coins etc. \n\nThey were honestly my favourite bit of Xmas as a kid - I’ve always loved lots of little things over 1 big gift.",
            "title_similarity": "0.8330271",
            "sentiment_compound": 0.9578
        },
        {
            "id": "hpzcvj5",
            "score": 1,
            "text": "You can also teach him to masturbate",
            "title_similarity": "0.3596205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzcvpf",
            "score": 2,
            "text": "Or you could, ya know, set some rules and boundaries.",
            "title_similarity": "0.047800213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzd9jv",
            "score": 1,
            "text": "Wish I had seen this when I was awaken at 4 am",
            "title_similarity": "0.47780788",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpzddlx",
            "score": 1,
            "text": "My parents did this for me when I was little, and I still remember putting that lego set together to this day!",
            "title_similarity": "0.70636433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzdkv8",
            "score": 1,
            "text": "I was allowed to get my stocking return it to my room and quietly open and play with the stuff from Santa",
            "title_similarity": "0.6433815",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpzdl1i",
            "score": 1,
            "text": "One of my sisters-in-law needs a way to keep my 50-something year old brother asleep on Christmas morning. He texted his adult children at 5:30 am to wake them up to open presents. Neither live at home.  He did, at least, not text them at 4:30 like he wanted.",
            "title_similarity": "0.7150855",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpzdnco",
            "score": 1,
            "text": "We were allowed to open our stockings before they got up. So my parents would put something in them that would occupy us. Once we got a Nintendo, my parents would put an nes game in each our stockings.\n\nThat way we'd play Nintendo all morning till they were ready to get up.",
            "title_similarity": "0.76820815",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpzdsew",
            "score": 1,
            "text": "In my family Santa comes while we are at church on Christmas Eve, When we get home from services we open presents. It makes for a late night but we sleep in on Christmas morning.",
            "title_similarity": "0.8038049",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpze724",
            "score": 1,
            "text": "Nah Deconstruct the set and scatter it in on the way to the tree. Only the strong survive. /s",
            "title_similarity": "0.35016555",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpze7dc",
            "score": 1,
            "text": "i know folks who wrap the bedroom doors. If you break through the door before you're called, guess what...santa gives you coal.",
            "title_similarity": "0.62554955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzejb2",
            "score": 1,
            "text": "“First one to open presents is the last one out of bed”",
            "title_similarity": "0.58400047",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzeomg",
            "score": 1,
            "text": "I really think my fam did it best. Mom and dad would set presents up at like 2 to 3 am and excitedly wake us up telling us they Santa came. We would open our presents, play for an hour and then everyone would go “take a nap” and then everyone would get to sleep in.",
            "title_similarity": "0.8239431",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hpzes9i",
            "score": 1,
            "text": "I tell my kids they can attack their stockings all they want, but no prese to till the last (reasonable) person gets up. \n\nTheir stockings are full of shit to keep them busy. New switch game, candy, toys, etc. They get a little loud, but not early enough for us to care.",
            "title_similarity": "0.7420646",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hpzf1hh",
            "score": 1,
            "text": "I'm surprised so many parents are insistent on being left to sleep late on Christmas. We can't wait to get up and let the gift opening begin. It is so much fun watching and seeing all the happiness. I can sleep later.",
            "title_similarity": "0.8605095",
            "sentiment_compound": 0.8996
        },
        {
            "id": "hpzf38i",
            "score": 1,
            "text": "I'd rather just wake up when they want me to get up. It's a magical morning for them, and it's only magical for like 7 years max of their life (like 3 years old til like 9 max). I can handle getting up early one special day a year for them.",
            "title_similarity": "0.7624928",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hpzf6tq",
            "score": 1,
            "text": "This is actually a great LPT",
            "title_similarity": "0.116678596",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpzfifm",
            "score": 1,
            "text": "Wow great timing.\nFor my time zone anyway",
            "title_similarity": "0.24754912",
            "sentiment_compound": 0.836
        },
        {
            "id": "hpzfl86",
            "score": 1,
            "text": "Family tradition: one small present on Christmas Eve, Stockings whenever the kids wake up (includes one small toy like a lego build) and can’t open presents till after breakfast. It helps pace the days quite well.",
            "title_similarity": "0.8558521",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hpzftay",
            "score": 1,
            "text": "Or.. wrap him up.",
            "title_similarity": "0.091267645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzfukt",
            "score": 1,
            "text": "My dad would booby trap the house so he knew if we got up before he did. Like, can of coins on top of the door, fishing line trip wires connected to forks left inside the piano, all sorts of silly stuff.  That just turned into us sneaking out my bedroom window then back in the back door. It was always fun to be up and going through our stocking when he got up but my bedroom door was still taped shut.",
            "title_similarity": "0.7355725",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpzfzyi",
            "score": 1,
            "text": "I had this growing up in the late '70s, and now my kids got the same. Small Lego box at the foot of the bed.",
            "title_similarity": "0.69528425",
            "sentiment_compound": 0.2204
        },
        {
            "id": "hpzg5zh",
            "score": 1,
            "text": "tell the kid santa would never think of going to Africa and if they don’t shut up they’ll under up living amongst those animals",
            "title_similarity": "0.5294083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzg9pw",
            "score": 1,
            "text": "I wish I knew this when my kids were young",
            "title_similarity": "0.52378994",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpzgdk8",
            "score": 1,
            "text": "This is an amazing idea",
            "title_similarity": "0.068665795",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpzgrtz",
            "score": 1,
            "text": "Or just don't have kids. It's worked super well for the wife and I so far.",
            "title_similarity": "0.46819794",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hpzh4c7",
            "score": 1,
            "text": "nah..I'll just keep pulling out",
            "title_similarity": "0.059719503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzh8b2",
            "score": 1,
            "text": "My parents just told us we could open stockings and they always put at least one movie in it for us to watch that morning while they got up later",
            "title_similarity": "0.7167155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzheop",
            "score": 1,
            "text": "My parents weren't Nazis and we'd just wake up whenever and open our presents like normal humans with reasonable parents... or maybe I'm the weirdo?",
            "title_similarity": "0.68083394",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hpzhga0",
            "score": 1,
            "text": "Maybe specify 5 and older? If I gave my three year old a Lego set I’d be able to sleep the rest of the day…",
            "title_similarity": "0.6480261",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzhhsm",
            "score": 1,
            "text": "My mom used to do really full stockings and lay them on the ends of our beds. They’d have candy, little toys, things to build, read, or puzzles to solve. They’d start to get up for the day and start coffee/breakfast (and turn on the lights / let the dog out) when they’d hear us in our rooms laughing and shouting things like “oh my gosh!!” And “I love this _____!” “Coool!!” They said it bought them 30 minutes to an hour of time to wake up and get moving at a reasonable hour.",
            "title_similarity": "0.7689653",
            "sentiment_compound": 0.9164
        },
        {
            "id": "hpzhjxk",
            "score": 1,
            "text": "Every year we were allowed one present to open on xmas eve, and it was always a big box of books. I was that kid in my family and the books usually kept me busy when I was up super early.",
            "title_similarity": "0.75963753",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpzho9o",
            "score": 1,
            "text": "As a child we 'hung' our stockings at the foot of the bed. When we woke up Christmas morning or stockings were full. We would spend the next while comparing what we got and playing with the things in it while of parents got extra sleep.\n\nNext level parenting there.",
            "title_similarity": "0.77562726",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpzht2x",
            "score": 1,
            "text": "My dad did this every year when we were kids. Absolutely brilliant idea, I've always considered it up there with some of his best. Right along with tucking us in for bed and saying \"Now remember If you need anything....... call for your mother\"",
            "title_similarity": "0.72627",
            "sentiment_compound": 0.8516
        },
        {
            "id": "hpzht8k",
            "score": 1,
            "text": "Definitely thought this was going to end with the kid stepping on legos.",
            "title_similarity": "0.5053242",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpzhuc9",
            "score": 1,
            "text": "Or give them a MELATONIN gummie, so everyone can sleep peacefully 😴",
            "title_similarity": "0.542769",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hpzikt1",
            "score": 1,
            "text": "My 6 year old twins woke up at 4 and started wrestling",
            "title_similarity": "0.5636696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzj35j",
            "score": 1,
            "text": "Yeah…wouldn’t work in my house. My daughter wakes me up no matter what. Even just to let me know she woke up.",
            "title_similarity": "0.6372373",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hpzjp5s",
            "score": 1,
            "text": "My childhood Christmas mornings make so much more sense now.",
            "title_similarity": "0.60192037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzjrdd",
            "score": 1,
            "text": "I had an embarrassing Christmas some 50-odd years ago when I was about 9 and my brother was 6. We woke up early that morning -- long before our parents -- as was usual because of the excitement we usually felt on Christmas eve, and went to look at the presents under the tree. Instead of presents, though, we found two cards with clues about where we might find our presents. Unable to stop ourselves, my brother and I ran around the house, solving  each clue only to find another, and eventually turning up all of our presents in a very fun scavenger hunt that our parents had painstakingly planned out for us.\n\nAnd then our parents woke up, only to learn that we had already greedily ripped through everything they had set up. They were quite disappointed and a bit angry, as well they might have been. Only then did it occur to me that they had wanted to watch us play their little game.  \n\nMy parents were not particularly creative or whimsical people. When I think back to all of the effort they must have put into this surprise for us, I always feel horrible about spoiling it.",
            "title_similarity": "0.85717",
            "sentiment_compound": -0.5973
        },
        {
            "id": "hpzjsn2",
            "score": 1,
            "text": "I will never have this problem. I don’t know if I’ll ever have a family.",
            "title_similarity": "0.30491775",
            "sentiment_compound": -0.481
        },
        {
            "id": "hpzjvru",
            "score": 1,
            "text": "My parents would give us these huge like 4 ft stockings and leave them outside our rooms. It would have little things like socks, scool supplies, chapstick etc but also small toys and games. They wrapped everything no matter how small. Bought them plenty of time in the morning and we loved it. They probably stayed up all night wrapping them defeating the purpose!",
            "title_similarity": "0.8322602",
            "sentiment_compound": 0.722
        },
        {
            "id": "hpzkp52",
            "score": 1,
            "text": "Or teach your child some restraint and consideration of others.",
            "title_similarity": "0.23132557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzkrhq",
            "score": 1,
            "text": "We avoided this by opening presents on Christmas Eve night",
            "title_similarity": "0.5749843",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpzktyb",
            "score": 1,
            "text": "Our rule has always been that each kid is 100% allowed to go get their stocking when they first wake up, but then they need to wait for the rest of the house to wake up. The stocking has some snacks and candy and a couple little toys or other entertainments. It’s enough.",
            "title_similarity": "0.75401247",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hpzkxra",
            "score": 1,
            "text": "Only if they like legos. \n\nWere you paid for this? \n\nWhat about a puzzle or movie?\n\nAfter checking your post history it seems like you just spam the popular subs with nonsense trying to get karma.",
            "title_similarity": "0.62242204",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hpzl1yt",
            "score": 1,
            "text": "My son had a scavenger hunt.  I set up 20 clues all around and it ended with his presents being in my locked car.  Killed an hour this morning.",
            "title_similarity": "0.58307153",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hpzlbtx",
            "score": 1,
            "text": "Yeah sure just $80 for a lego set",
            "title_similarity": "0.42906976",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hpzloul",
            "score": 1,
            "text": " You are a damn genius and a gift to all of man kind",
            "title_similarity": "0.35479793",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hpzlz58",
            "score": 1,
            "text": "When I was growing up, the rule was that we could open whatever was in our stockings without the parents. This was usually candy and small toys, enough to satisfy our childhood greed.\n\nThe 'nice' thing about having an alcoholic father is you learned real quick do not go into their bedroom for any reason before noon.",
            "title_similarity": "0.73106056",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpzm9z6",
            "score": 1,
            "text": "r/richpeoplelifeprotips",
            "title_similarity": "0.07786359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzmdcd",
            "score": 1,
            "text": "RemindMe!  340 days",
            "title_similarity": "0.011390716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzmr5n",
            "score": 1,
            "text": "I wish I knew about this before today. My kids were up at 5am...",
            "title_similarity": "0.58850765",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpzmws8",
            "score": 1,
            "text": "That's actually a good idea. When I was a kid, my cousin and I used to bring our parents coffee while singing \"We Wish You a Merry Christmas,\" to make them less grumpy about being awakened early. 😁",
            "title_similarity": "0.72560704",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hpznfs5",
            "score": 1,
            "text": "My brother and I would just get up early, mute the TV, and play video games together. Easy peasy, fond memories, never woke anyone.",
            "title_similarity": "0.7114286",
            "sentiment_compound": 0.802
        },
        {
            "id": "hpzo8tf",
            "score": 1,
            "text": "We always got to open one present from our stocking before our parents woke up. I remember one year I correctly guessed a gameboy advance game whilst my unfortunate younger brother opened an electronic toothbrush.",
            "title_similarity": "0.7338048",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpzoh2f",
            "score": 1,
            "text": "I have to assume you don't have kids. This is not why kids love Christmas",
            "title_similarity": "0.45617348",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hpzon6w",
            "score": 1,
            "text": "Or teach your kid to have patience.",
            "title_similarity": "0.20092608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzp1tj",
            "score": 1,
            "text": "Oh cool a Lego. Let me wake up mom and tell her what I got.",
            "title_similarity": "0.6376866",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpzp5du",
            "score": 1,
            "text": "Oh you mean lock their bedroom door?",
            "title_similarity": "0.3511359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzpfgw",
            "score": 1,
            "text": "Or just open presents at 12am",
            "title_similarity": "0.40281075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzppuw",
            "score": 1,
            "text": "Fillipinos celebrate Christmas like New Years. We don't have that issue. We just all open presents at midnight.",
            "title_similarity": "0.68231535",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpzpr0n",
            "score": 1,
            "text": "Or just... Be strict about it and say no presents before a certain time. No need to power play it either but you know, more presents to distract them from the real presents? Wtf man",
            "title_similarity": "0.5185374",
            "sentiment_compound": -0.8536
        },
        {
            "id": "hpzpr8g",
            "score": 1,
            "text": "What the fuck kind of first world problem is this",
            "title_similarity": "0.15191323",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hpzq34u",
            "score": 1,
            "text": "If you gave kid me a \"small\" set, I'd be done building it in 10-15 minutes. 😂",
            "title_similarity": "0.5259138",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpzqbw8",
            "score": 1,
            "text": "My brother and his wife have this Hatch white noise machine (they have 2 little ones 5 and 3) that has a light on it. They know they can’t leave the room until the light turns from red to green.\n\nSeems to work pretty good for all days but especially on holidays/days with exciting plans.",
            "title_similarity": "0.77173835",
            "sentiment_compound": 0.8047
        },
        {
            "id": "hpzqzk6",
            "score": 1,
            "text": "I gave my nephew an early Xmas gift of Lego ornaments, and he flat out told me, “I don’t play with legos, what else do you have?”",
            "title_similarity": "0.7647841",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hpzr7o7",
            "score": 1,
            "text": "LPT: Post Christmas morning suggestions the night before and not the morning of Christmas.\n\nI think this was posted around 7:00 am PST.\n\nSeriously, all joking aside, good suggestion.",
            "title_similarity": "0.62649703",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpzrdfd",
            "score": 1,
            "text": "LPT go to bed early and wake up before the kid.\n\nBonus LPT since it is present giving time, make list of chores for the kid to do - either they will not wake up early / leave bed early or you have tons of chores that have gotten taken care of.",
            "title_similarity": "0.7738294",
            "sentiment_compound": 0.836
        },
        {
            "id": "hpzrlsl",
            "score": 1,
            "text": "My parents did something like this. They had small or big gifts, such as a new bike or Lego set, that we could play with until they got enough rest before getting up and going downstairs to open presents.",
            "title_similarity": "0.82155585",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpzrp99",
            "score": 1,
            "text": "I really consider myself extremely lucky for having a kid who woke up at almost 10am this morning.....",
            "title_similarity": "0.5857797",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hpzrwwl",
            "score": 1,
            "text": "Be grateful man, I got nothing",
            "title_similarity": "0.104061306",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpzsfik",
            "score": 1,
            "text": "So are you saying if I wake up early I can get an extra gift too?",
            "title_similarity": "0.5513535",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpzsqrg",
            "score": 1,
            "text": "My dad would fill our stockings with dollar store stuff to keep us occupied before we opened presents.",
            "title_similarity": "0.6434181",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzss62",
            "score": 1,
            "text": "Fuuuuck.  My youngest is now 15. This would have been the shit.",
            "title_similarity": "0.4258981",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpzt6vd",
            "score": 1,
            "text": "My kids will learn patience 😂",
            "title_similarity": "0.28586826",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpztjei",
            "score": 1,
            "text": "My mom would subtly let me know which one was a video game and then got all the sleep she wanted",
            "title_similarity": "0.60061055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpztls1",
            "score": 1,
            "text": "I’ve done this with gingerbread houses too. Either a pre made one or one you put together depending on the age.",
            "title_similarity": "0.5397997",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpztptd",
            "score": 1,
            "text": "I get the advice, but part of Christmas is the excitement the kids have for it. I always make sure to be up and ready for when they get up.",
            "title_similarity": "0.712973",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hpzts1g",
            "score": 1,
            "text": "This is exactly what my parents did. With 4 kids under the age of ten my mom realized she could sleep in (read that 7:30am instead of 6am) if she put little toys that required assembly at the ends of our beds.",
            "title_similarity": "0.7737225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpztvu1",
            "score": 1,
            "text": "When my cousins boy was around 3 he was always trying to be the one to open a present and telling someone to give him one to open, as kids do. It can be distracting when there's a sentimental gift or a kinda family moment going on. So I got him a giant like, 3x15ft roll of bubble wrap to open first. Kept him entertained for about 30 to 45 minutes.",
            "title_similarity": "0.78517514",
            "sentiment_compound": 0.802
        },
        {
            "id": "hpzujgj",
            "score": 1,
            "text": "My parents used to let us have a Santa sack that we could open before our proper presents under the tree, but we weren’t allowed up before 7.",
            "title_similarity": "0.7354467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzuq7s",
            "score": 1,
            "text": "Legos aren't quiet. Just a heads up",
            "title_similarity": "0.23726627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzutxq",
            "score": 1,
            "text": "We always got a present in our beds when we were kids.  Maybe it was a stuffed animal or a small action figure or Lego or book.  It kept us in our rooms until our parents called us out and added another sense of magic to the day.\n\nI was a voracious reader, so I'd often get books, finishing them in those pre-present hours.",
            "title_similarity": "0.8407347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzvdym",
            "score": 1,
            "text": "I used to give my youngest his big Lego on Christmas Eve because I knew he was’nt going to be sleeping.",
            "title_similarity": "0.83761597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzw47t",
            "score": 2,
            "text": "Growing up my sister and I each got a brio train piece, a movie, a small Lego kit, and a chocolate Santa in our stockings. We popped the movie in, ate some chocolate for breakfast, and the Lego and new trains kept us busy until our parents woke up. The smartest thing about it was that the new brio pieces got us to pull out the whole set and play happily for hours. \n\nThere was a clear boundary. Presents were not available until both parents woke up without being woken up. Stockings were available immediately.",
            "title_similarity": "0.84810203",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hpzx0un",
            "score": 1,
            "text": "Or do what my parents did, block off our doors so we could not physically come out until breakfast was ready (:",
            "title_similarity": "0.5689169",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpzz5rz",
            "score": 1,
            "text": "or lock the door and put on ear plugs",
            "title_similarity": "0.2860267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpzzc6j",
            "score": 1,
            "text": "But how do I get him out of the crib so he can reach the toy?",
            "title_similarity": "0.51411366",
            "sentiment_compound": 0.1395
        },
        {
            "id": "hpzzhoc",
            "score": 1,
            "text": "This would have done nothing for my brother and I. We used to set an alarm every year and wake our parents up. This was the first year we’ve slept until 9. I’m 26, older brother is 30, younger sister is 17. \n\nWe all act like we’re 8 at Christmas though, and mom is happy to oblige. Still get stockings & Santa gifts. Haha",
            "title_similarity": "0.81453645",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hpzzy4c",
            "score": 1,
            "text": "HAHA like that would work!",
            "title_similarity": "-0.008344779",
            "sentiment_compound": 0.7597
        },
        {
            "id": "hq00gwp",
            "score": 1,
            "text": "My dad died 5 years ago , now in every Christmas I just fell like alone",
            "title_similarity": "0.4338814",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hq00yoq",
            "score": 1,
            "text": "For a minute I thought the LPT was to individually wrap each Lego",
            "title_similarity": "0.5282954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq049oc",
            "score": 1,
            "text": "Last kid up gets to open the first gift in our house. ☺️",
            "title_similarity": "0.58659106",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hq04vzw",
            "score": 1,
            "text": "RemindMe! December 10th, 2022",
            "title_similarity": "0.21742108",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq056ba",
            "score": 1,
            "text": "My sister kid makes her assemble the set for him lol",
            "title_similarity": "0.56712687",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hq05f0w",
            "score": 1,
            "text": "Jokes on you we celebrate christmas in evening",
            "title_similarity": "0.55055594",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hq063qt",
            "score": 1,
            "text": "We always had a rule if you wake up before mum you got to open one present. Often meant we felt most of our presents carefully before opening them though. Was awkward once when we opened a gameboy but the game was wrapped separately... or if you open a gift you can't 'play' with... But usually it worked well to keep us quiet.",
            "title_similarity": "0.7216188",
            "sentiment_compound": 0.5988
        },
        {
            "id": "hq06y6y",
            "score": 1,
            "text": "Growing up we were allowed to open our stockings as soon as we woke. We could eat the candy and play with the (small) toys so long as we kept quiet and let the grown ups sleep. \n\nWorked like a charm for years.",
            "title_similarity": "0.75051475",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hq078z7",
            "score": 1,
            "text": "Or just follow the european way and open gifts on Christmas eve lol",
            "title_similarity": "0.51756066",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hq07qoz",
            "score": 1,
            "text": "I was that child. You’ve basically given me a maraca  to wake you up with",
            "title_similarity": "0.4032145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq08c3d",
            "score": 1,
            "text": "I expected to read as\n\n\"If you have a kid who wakes up everyone way too early on Christmas, set up a small Lego set for them in their room. This acts as a trap for them because they will be crying in pain when they step on the Lego and finally realize they are little shits for opening presents before everyone else could have a chance.\"\n\n\nThen I realized this wasn't r/ShittyLifeProTips",
            "title_similarity": "0.8764306",
            "sentiment_compound": -0.8593
        },
        {
            "id": "hq0a5a1",
            "score": 1,
            "text": "What do you do about a husky?",
            "title_similarity": "0.06393522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0ak40",
            "score": 1,
            "text": "Isn't this exactly what Xmas stockings are for? Give the kids something to do till the adults are awake",
            "title_similarity": "0.64835745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0bjoa",
            "score": 1,
            "text": "My SIL asked if we could exchange one gift on the morning if Xmas eve to keep the kids busy. She gave my 3 year old a Lego technic set meant for 8+.  It’s been an in going joke all weekend.",
            "title_similarity": "0.7926768",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hq0brgg",
            "score": 1,
            "text": "10/10 can confirm this works \n- Me, 16 years ago",
            "title_similarity": "0.2861874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0e3fk",
            "score": 1,
            "text": "My parents did this, one present at the end of the bed that we were allowed to open as soon as we woke up. Took me years before I realised it was to give them an extra hour in bed!!",
            "title_similarity": "0.727736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0ewl1",
            "score": 1,
            "text": "This is what my parents did. We'd get up at like 4 and try to get them to come down for presents so they said ok here's what's happening. Santa is gonna put your stockings in your rooms and you have to solve all the puzzles in them before you can wake us up. It was a ton of fun for my sister and I and a great way to start Christmas.",
            "title_similarity": "0.8148978",
            "sentiment_compound": 0.9211
        },
        {
            "id": "hq0fj50",
            "score": 1,
            "text": "This is freaking genius. Thanks man!",
            "title_similarity": "0.17823523",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hq0havy",
            "score": 1,
            "text": "Or, tell that mother fucker to stop waking everybody up before sunrise.",
            "title_similarity": "0.41874534",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hq0ifsg",
            "score": 1,
            "text": "Lol, or parent your child, so it’s not menacing the rest of the family.",
            "title_similarity": "0.45595458",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hq0jqrz",
            "score": 1,
            "text": "This is a phenomenal idea for next year.",
            "title_similarity": "0.3303165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0lq3j",
            "score": 1,
            "text": "Oh, FFS.. it’s once a year. Wake your ass up and let the kid open some presents!",
            "title_similarity": "0.66136694",
            "sentiment_compound": -0.8528
        },
        {
            "id": "hq0ly60",
            "score": 1,
            "text": "Or they run into your room to tell you about their new Lego set and make you play with them",
            "title_similarity": "0.75316715",
            "sentiment_compound": 0.34
        },
        {
            "id": "hq0n01y",
            "score": 1,
            "text": "My family does stockings first thing when you wake up in your rooms. Usually with one or two small silly toys / magazine to read for a bit. Main presents in the afternoon after Christmas lunch. When I was little I'd get some form of big toy mid morning to amuse me before lunch / main presents. It always made the day feel full and not just about the presents first thing.",
            "title_similarity": "0.86894286",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hq0oet1",
            "score": 1,
            "text": "Nah the kid will just unwrap it and move on to unwrapping other gifts.",
            "title_similarity": "0.4163337",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hq0qiim",
            "score": 1,
            "text": "Coworker told me her family did the Lego gift, every Christmas, when she was young. Worked like a dream.",
            "title_similarity": "0.77417827",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hq0t6qc",
            "score": 1,
            "text": "!remind me 350 days",
            "title_similarity": "0.04338354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0y88s",
            "score": 1,
            "text": "Instructions unclear. Kids ate legos.",
            "title_similarity": "0.49334532",
            "sentiment_compound": -0.25
        },
        {
            "id": "hq10t6m",
            "score": 1,
            "text": "In my household, we’d get one gift the night before, and in the morning we’d open our stockings while waiting for everyone else to wake up to open the rest",
            "title_similarity": "0.706406",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hq13b3j",
            "score": 1,
            "text": "This is why I’ve carried on my family’s tradition of stocking presents. Left outside bedroom door, you can open them all but you stay in your room until a sensible time. I used to open them then go back to sleep.",
            "title_similarity": "0.75527537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq14m66",
            "score": 1,
            "text": "Yea this is low key bad advice. If you have a kid that inconveniences everybody for selfish reasons, teach your kid *why* they shouldn't. Maybe with negative consequences, or with positive reinforcement *while standing your ground on appropriate behavior* (eg. Explain when is too early and give them a reward if they wait until everyone is awake)\n\nRemember parents: you're not raising a child. You have a child. You're raising a human being. Reinforce behavior that you see as desirable in an adult.",
            "title_similarity": "0.6417014",
            "sentiment_compound": 0.5991
        },
        {
            "id": "hq16ewa",
            "score": 1,
            "text": "My parents did this with a book usually or a little figurine. Cherished memories.",
            "title_similarity": "0.47913742",
            "sentiment_compound": 0.4627
        },
        {
            "id": "hq18csv",
            "score": 1,
            "text": "My Dad just yelled at me and told me to get my ass back upstairs",
            "title_similarity": "0.416572",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hq1hs1r",
            "score": 1,
            "text": "This sounds like rewarding bad behavior. Not much of a pro tip tbh",
            "title_similarity": "0.17625114",
            "sentiment_compound": 0.34
        },
        {
            "id": "hq1rziq",
            "score": 1,
            "text": "I read this one day too late! I had a 3-year old playing with snooker balls on a wooden floor, wake me before 5am.",
            "title_similarity": "0.6146636",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hqjk1rl",
            "score": 1,
            "text": "My kid (3 yrs old) would literally scre and then run into my room to tell me about her new gift and then ask me to come build stuff. Love her so much. No sleeps though.",
            "title_similarity": "0.77396727",
            "sentiment_compound": 0.683
        },
        {
            "id": "hsc6x0g",
            "score": 1,
            "text": "If you really want to sleep in, open the Lego set, and wrap the pieces individually. It will take them hours. Lol.",
            "title_similarity": "0.7415502",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hszq4e7",
            "score": 1,
            "text": "My sister and I weren’t allowed to come downstairs and open presents before 7 am. My parents would sometimes turn back the clocks after wrapping presents until the wee hours of the morning. Now that I’m an adult it makes me laugh so much to think about this! Haha",
            "title_similarity": "0.7873006",
            "sentiment_compound": 0.8122
        }
    ]
}