{
    "LPT Ubers are cheaper than DUIs, and funerals. Stay safe out there, happy New Year's.\nIf you plan to party, have a planned out ride or safe way to sleep it off.\n\nI'm no saint, I've spent more than a few evenings sleeping in my car to sober up.\n\nIf you plan to ever sleep in your car, have a blanket and a few insulating jackets handy. Also, a beanie is great to block out the light and some noise.\n\nWhen you wake up, drink water and get out of your car to walk around for a second to make sure your equilibrium has entirely returned. If it has, you can safely drive home.\n\n**Edit: I don't support Uber or Lyft explicitly, i just want a safer New Years.**\n\nMany are saying cabs can be cheaper on holidays, and considering these price surges from the ride sharing apps.. Uber and Lyft should instead be offering discounts, if anything, on nights like this.\n\nThat being said, please still tip well, it's your driver's holiday too.\n\nIt's also really endearing to hear about Coors' and AAA Insurance's free ride services for tonight. All these programs I'd be oblivious to without your comments. Thank you all, please take care.\n\n**Edit 2:** For all those saying this post is common sense, yes, \"don't drink and drive\" is common sense. Although not common enough imo.\n\nHowever, perciving the perspective that an even an $800 Lyft could cost less than a DUI, (I'm hoping) could possibly make at least one person think twice before deciding to write off the safer options of getting home tonight.": [
        {
            "id": "hqrefhk",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.45681137",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hqrff23",
            "score": 24,
            "text": "Staying home is cheaper than a hospital stay for covid. Stay the fuck at home.",
            "title_similarity": "0.70921695",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hqrehxa",
            "score": -5,
            "text": "I'd rather just die than pay Uber's rates tonight.",
            "title_similarity": "0.5203196",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hqrfw8a",
            "score": -1,
            "text": "In places that have Ubers/ other ride services.",
            "title_similarity": "0.23791504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrifbn",
            "score": 4,
            "text": "If you can find one. Or allow Uber to charge you $45 to get one sooner. Uber is a fucking scam.",
            "title_similarity": "0.5317576",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hqrtl9u",
            "score": 2,
            "text": "LPT too: and since it is so much cheaper, remember to tip and tip well!",
            "title_similarity": "0.49363372",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hqrkp19",
            "score": -3,
            "text": "What’s a LPT Uber?",
            "title_similarity": "0.10130565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrx5zr",
            "score": 0,
            "text": "Ubers are pretty damn expensive tho - why don't we just ditch the alcohol altogether",
            "title_similarity": "0.52918506",
            "sentiment_compound": 0.128
        },
        {
            "id": "hqrzwl7",
            "score": 0,
            "text": "Had a drunk person just tailgate me on my way home. Fuck drunk drivers.",
            "title_similarity": "0.5154309",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hqs3h6u",
            "score": 0,
            "text": "Or, you know, and this might seem completely off the fucking chain to some… but you could just… _not go out_ on NYE. During a pandemic.",
            "title_similarity": "0.44429395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsarws",
            "score": 0,
            "text": "Holiday: *happens*\n\nKarma Whores: time to reap in some virtue signaling karma",
            "title_similarity": "0.44217128",
            "sentiment_compound": 0.128
        },
        {
            "id": "hqrs15z",
            "score": -5,
            "text": "It's all good I got a tesla with FSD betaaaa \n\nTake my drunk ass home Elon! LOL",
            "title_similarity": "0.64720184",
            "sentiment_compound": 0.2083
        },
        {
            "id": "hqrkh4p",
            "score": -4,
            "text": "Underrated post! Also, wrap it up!",
            "title_similarity": "0.15509951",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrulof",
            "score": 1,
            "text": "This person thinks it’s a monetary issue 😂",
            "title_similarity": "0.10252513",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqshlry",
            "score": -1,
            "text": "Or you could just not fucking drink or otherwise wreck your body for a short lived thrill...\n\nShocking concept I know.",
            "title_similarity": "0.49693546",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hqrq4ma",
            "score": 36,
            "text": "Man this sub is so shit lol. Next LPT: Living is difficult but breathing makes it so much easier!",
            "title_similarity": "0.54624754",
            "sentiment_compound": 0.4387
        },
        {
            "id": "hqrghps",
            "score": -4,
            "text": "I wish there was somewhere you could go drive decently buzzed that was safe. It’s unfortunately fun. \n\nDon’t ever do it though!",
            "title_similarity": "0.6196848",
            "sentiment_compound": 0.7777
        },
        {
            "id": "hqrqwl5",
            "score": -12,
            "text": "Considering Ubers in my city can be close to 150 dollars and when you consider the likelihood of a DUI, or dying (in which case I pay nothing) I’m thinking the Numbers say to risk it, better cut Uber prices or massively increase fines for DUI",
            "title_similarity": "0.6097785",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hqrpia4",
            "score": 6,
            "text": "This post brought to you by Lyft and Uber’s marketing group. \n\nBut, in reality, stay safe tonight.",
            "title_similarity": "0.63238204",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hqrz2j9",
            "score": 2,
            "text": "Just took an Uber home. Much cheaper than the 10k my buddy spent just a few years ago.",
            "title_similarity": "0.62447274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrzuu9",
            "score": 3,
            "text": "Also to add, if you don't drink/use and have friends pushing you to be the designated driver since you \"weren't going to drink anyways,\" that's what ubers are for!\nIf you're comfortable with doing it, than do by all means, but if you're like me and don't enjoy having folks high and drunk off their asses in your car, you don't have to succumb to peer pressure. If they have the money to go out and party, they have enough to pay for a ride home.",
            "title_similarity": "0.7639424",
            "sentiment_compound": 0.09
        },
        {
            "id": "hqrrpea",
            "score": 15,
            "text": "Not a “Pro Tip”.. just common sense.",
            "title_similarity": "0.2655004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrumxq",
            "score": 0,
            "text": "Always tip your Uber/Lyft",
            "title_similarity": "0.32296002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrxszs",
            "score": 0,
            "text": "you know what's cheaper than all of that? drinking at home alone for another new years.",
            "title_similarity": "0.7054813",
            "sentiment_compound": -0.25
        },
        {
            "id": "hqrzeh1",
            "score": 0,
            "text": "I have a high school friend who fucked his life up and had to join the military in order to have a somewhat decent life, just because he decided to drive under the influence.\n\nIt cost him a ton of money, lost his car and became extremely depressed. It is not worth it to drive under the influence.",
            "title_similarity": "0.5696273",
            "sentiment_compound": -0.7621
        },
        {
            "id": "hqs09sy",
            "score": 0,
            "text": "Not true my funeral isn't going to cost me a cent",
            "title_similarity": "0.38342446",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hqs1o0o",
            "score": 0,
            "text": "Depending on the state, do not sleep in your car if you have been drinking. In some places *being in reach of your keys* is enough to qualify you for a DUI. Drunk driving is awful, but the police departments particularly in the US headhunt and make quotas on DUI cases just like anything else.\n\nSource: guy who got a DUI for sleeping one off in a parking lot and hasn’t even bothered to get his license back since.",
            "title_similarity": "0.78284657",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hqsk6jf",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.015857767"
        },
        {
            "id": "hqu4zxi",
            "score": 0,
            "text": "Aw, come on.\n\nYou have to compare against both the price of the funeral, and the chance of getting caught.\n\nWhen I was commuting every day, I probably was in a checkstop twice a year.  So you probably have somewhere around 1 chance in 1000 of getting caught in a given year.\n\nSuppose your Lyft ride costs $20. Surely you can get off a DUI charge for this.\n\nAnd a discount cremation doesn't cost much at all.\n\nFurthermore, with any luck you'll be dead too, so the bills aren't yours to pay.  Win all around.\n\n&#x200B;\n\n/s This is satire.",
            "title_similarity": "0.69807106",
            "sentiment_compound": 0.7348
        },
        {
            "id": "hsqc295",
            "score": 0,
            "text": "But not cheaper than Lyfts. #LPT",
            "title_similarity": "0.30967668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrw9pd",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.015857767"
        },
        {
            "id": "hqrui33",
            "score": 7,
            "text": "Also, tip your driver. If you're calling a ride because you're drunk, your driver needs it.",
            "title_similarity": "0.55820286",
            "sentiment_compound": -0.34
        },
        {
            "id": "hqrvs5e",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.015857767"
        },
        {
            "id": "hqrxn4e",
            "score": -1,
            "text": "I'm drunk as fuck at a restaurant and going to take a Lyft back to the hotel. Happy New Year's everyone!",
            "title_similarity": "0.5909474",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hqrzgif",
            "score": -1,
            "text": "As a non-driver, I’ve absolutely never understood why people wouldn’t just order an Uber or even walk.",
            "title_similarity": "0.39416277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs11jv",
            "score": -1,
            "text": "You’re the neighbor everyone hates if you set off fireworks.",
            "title_similarity": "0.36945873",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hqs13oh",
            "score": -1,
            "text": "OP is an Uber employee advertising for Uber's surge pricing.",
            "title_similarity": "0.3835094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs1ian",
            "score": -1,
            "text": "Yea but then i have to pretend to put on a mask",
            "title_similarity": "0.18343827",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hqs42z8",
            "score": 1,
            "text": "I think injuring or killing someone by your drunk driving is where the argument is. I don't care if you prefer tickets or your possible death, you do you. Don't endanger others by your irresponsibility.",
            "title_similarity": "0.60796833",
            "sentiment_compound": -0.9416
        },
        {
            "id": "hqs7goi",
            "score": 1,
            "text": "My county is pretty forgiving for first time offenders with no history. My traffic fine for going 10 mph over in a school zone was about the same dollar amount as some of these first time DUIs.",
            "title_similarity": "0.68102825",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hqs989c",
            "score": 1,
            "text": "Easier to leave the car at home.\nIf I drink even a sip of beer, I'm not driving. \nNot worth the risk of hurting someone else, or myself, or damaging the car. \nAlcohol and gasoline don't mix well, be responsible, be safe, keep others safe.",
            "title_similarity": "0.7664591",
            "sentiment_compound": 0.6361
        },
        {
            "id": "hqsdhx2",
            "score": 1,
            "text": "Just got home! Totes Uberd my drunk ass. Good cal broham. Good looking out.",
            "title_similarity": "0.58957195",
            "sentiment_compound": -0.1007
        },
        {
            "id": "hqshdqs",
            "score": 1,
            "text": "This is a very blatant rule 4 violation.\n\nThis is obviously common sense.\n\nAlso, your edit is just like saying:\n\nYeah not murdering people is common sense, not common enough though.\n\nWhat a dumb post lol",
            "title_similarity": "0.4845467",
            "sentiment_compound": 0.5334
        },
        {
            "id": "hqt23ng",
            "score": -1,
            "text": "Why do people only seem like anti duis on New Years and post this stuff now. You just want clout",
            "title_similarity": "0.4758141",
            "sentiment_compound": 0.128
        },
        {
            "id": "hqrh3hw",
            "score": 26,
            "text": "You are 100% right, but the increase in price tonight will discourage so many from this option.",
            "title_similarity": "0.5178099",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hqrvom2",
            "score": 8,
            "text": "Just barely. They wanted >$50 to go from the Airport to my car a couple of miles away, recently.\n\n(I’m joking, obviously, but $50+ for an uber pool? The buses work just fine, thanks.)",
            "title_similarity": "0.7115193",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hqrm50w",
            "score": 10,
            "text": "LPT - Funerals are free if no one loves you enough to claim your body.",
            "title_similarity": "0.5994829",
            "sentiment_compound": -0.542
        },
        {
            "id": "hqroyyv",
            "score": 2,
            "text": "I’m just rollerblade home",
            "title_similarity": "0.26927447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrse2h",
            "score": -2,
            "text": "I don't see how they are cheaper than a funeral, that is by definition something it won't cost you anything",
            "title_similarity": "0.485909",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqrwrp2",
            "score": 2,
            "text": ">Life pro tip: Don't drive drunk\n\nWe're really digging deep here",
            "title_similarity": "0.45660535",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hqrxvgl",
            "score": 2,
            "text": "What a dumb tip, don’t drink and drive… no shit",
            "title_similarity": "0.33808622",
            "sentiment_compound": -0.0966
        },
        {
            "id": "hqry7y9",
            "score": 2,
            "text": "No shit sherlock.\n\n\nI thought this was \"Life Pro Tips\" not \"Common Sense.\"",
            "title_similarity": "0.38749236",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hqryh3j",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.034454018"
        },
        {
            "id": "hqryi3k",
            "score": 2,
            "text": "Wow thanks genius",
            "title_similarity": "-0.046458177",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hqrz7mm",
            "score": -2,
            "text": "Counterpoint, driving drunk is fun",
            "title_similarity": "0.48144138",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hqsafr0",
            "score": 2,
            "text": "Agree...\n\nWater in most places where there is Uber is cheaper, and thanks to global warming most places this year you can sleep in your car without fear of much consequences... Hell you'll even have a good excuse...\n\n...\"I'm sorry officer, I'm isolating from Omicron... Can I please see your test or step away from the vehicle\"\n\nSee the sunrise in your car... Or nearest city bench.\n\nFor those that don't have either... Some of us never did either. Enjoy 2022",
            "title_similarity": "0.88367766",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hqsaqkr",
            "score": -2,
            "text": "One DUI cost the same as the amounts I drove drunk and never got caught and never needed to uber",
            "title_similarity": "0.643922",
            "sentiment_compound": -0.34
        },
        {
            "id": "hqtmuif",
            "score": 2,
            "text": "Thank god. I was planning on drunk driving tonight, but ive seen this PSA and now i won't.",
            "title_similarity": "0.65690917",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hqs9bri",
            "score": 11,
            "text": "I have driven in very idiotic states and had so many close calls... I feel so much shame for it. Grateful as fuck it never got me or anyone else hurt...\n\nIdk why but it was such a hard habit for me to quit. Part of the reason id drink while driving was to hide it from loved ones..\n\nDon't do this shit. Ive met a lot of people in rehab with several DUIs and it ruins their entire life. Let alone if you were to kill someone you're looking at manslaughter charges.",
            "title_similarity": "0.6559926",
            "sentiment_compound": -0.9777
        },
        {
            "id": "hqryzc8",
            "score": 2,
            "text": "I left my car and keys at my girlfriend's while I'm at a friend's place. Been drinking water like a madman while whiskey and champagne go. Me and my mate are drunk, but I promise you that we won't be stupid, OP. Cheers for a responsible post. No plans to die for another few decades. 👍🏻",
            "title_similarity": "0.7504705",
            "sentiment_compound": 0.7363
        },
        {
            "id": "hqs3uoj",
            "score": -3,
            "text": "You can get arrested in an Uber for public intoxication. \n\nDo not become intoxicated if you are out of your home.",
            "title_similarity": "0.6173365",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hqrpzm3",
            "score": 4,
            "text": "Damn I am snowed in so can't go anywhere and have a scared dog that won't sleep and rest unless I sit next to him in the kitchen. I guess it could be worse in this cold weather.",
            "title_similarity": "0.5560169",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hqs86sm",
            "score": 14,
            "text": "> considering these immoral price surges from the ride sharing apps\n\nThere's nothing immoral about it. If there are only 10 drivers in your city but 100 passengers requesting rides uber raises the rates to entice more drivers to enter the fray. Not everybody is willing to take home drunk assholes puking in their car for $10 rides. But make it $30/ride and suddenly you might get another 50 drivers to begin offering their services.",
            "title_similarity": "0.67966324",
            "sentiment_compound": -0.9074
        },
        {
            "id": "hqrx9ig",
            "score": 5,
            "text": "Technically I don’t have to pay for my funeral",
            "title_similarity": "0.41126347",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hqs0ko8",
            "score": 5,
            "text": "Uber/Lyft should be banned from price surging on NYE or day before thanksgiving. Or a limit on how high the surge can go.  But I’ve seen it for go for around $400, which has made me make poor decisions.",
            "title_similarity": "0.6404674",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hqryr45",
            "score": 20,
            "text": ">When you wake up, drink water and get out of your car to walk around for a second to make sure your equilibrium has entirely returned. If it has, you can safely drive home.\n\nWhat? \n\nWHAT?!\n\nWhy would you advocate such responsible advice, then throw this in the end? \n\nBeing able to walk around a car doesn't mean you're clear. Even if you're capable of operating a vehicle, that doesn't mean you'll pass a breathalyzer -  A better metric than just walking around a car is to count how many drinks you've had, then add 2 hours -> 4 drinks? wait 6 hours.",
            "title_similarity": "0.79905707",
            "sentiment_compound": 0.9075
        },
        {
            "id": "hqrwarq",
            "score": 6,
            "text": "Unethical LPT: the fine for improper disposal of a body is much cheaper than a coffin/funeral",
            "title_similarity": "0.5589226",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqrwuec",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.015857767"
        },
        {
            "id": "hqrf8io",
            "score": 22,
            "text": "I hope people take your advice.",
            "title_similarity": "0.1366866",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqrijgi",
            "score": 26,
            "text": "yeah right. im not paying for my funeral. /s",
            "title_similarity": "0.3933351",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hqsb8pc",
            "score": 10,
            "text": "Check your state and county laws before sleeping in your vehicle after drinking. In Cali you'll receive a DUI regardless of your vehicle is on.  You will not be able to talk your way out of it. \n\nAnother tip, primarily for females. Don't travel alone if you can help it. It's rare but there are drivers out there who have SA women because they were intoxicated.\n\nBackground checks aren't fool proof.\n\nHappy 2022 everyone.",
            "title_similarity": "0.7817582",
            "sentiment_compound": 0.0854
        },
        {
            "id": "hqs1bxt",
            "score": 13,
            "text": "People who need this advice won't listen, because it's the wrong message. 1 Uber is cheaper, sure, but 200 ubers aren't, and that's how many most drunk drivers would get away with driving drunk.",
            "title_similarity": "0.61599064",
            "sentiment_compound": -0.785
        },
        {
            "id": "hqrxkgi",
            "score": 38,
            "text": "OP, I know you meant well but the last paragraph in your post is terrible advice.  \n\nEven if your equilibrium feels normal your brain can still be foggy making your reaction times slower and ineffective.\n\n\n>\tWhen you wake up, drink water and get out of your car to walk around for a second to make sure your equilibrium has entirely returned. If it has, you can safely drive home.",
            "title_similarity": "0.77720606",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqrsuo7",
            "score": 111,
            "text": "LPT: buy a travel trailer and tow it with you when you plan on drinking so you can sleep in there and not the car. \n\nULPT:[Break](https://www.dailymail.co.uk/video/news/video-1906736/Video-Drunk-man-wakes-elses-house.html)into someone's house and sleep on their couch, they'll understand in the morning",
            "title_similarity": "0.8155545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqri6ne",
            "score": 269,
            "text": "Please check locally as they may do it elsewhere too, but to my knowledge AAA in California offers tipsy tow, where they will come and get you FREE OF CHARGE. We already lost Betty let's not lose anyone else tonight folks.",
            "title_similarity": "0.73712337",
            "sentiment_compound": 0.7985
        },
        {
            "id": "hqruhgq",
            "score": 96,
            "text": "Bonus LPT. I know several people who have had DIC/DUI charges from driving home the next morning not realising they were still over the limit. Please find another way home if in ANY doubt. Wait it out longer than you think need to, get some food, water and caffeine for your hangover, maybe have another nap. Get a bus on the morning schedule or an Uber after the surge is over if those are options, come back for your car later.",
            "title_similarity": "0.7944679",
            "sentiment_compound": 0.296
        },
        {
            "id": "hqrs47k",
            "score": 263,
            "text": "DONT MAKE YOUR DOG WONDER WHY YOU ARENT HOME YET",
            "title_similarity": "0.34566015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrn82a",
            "score": 1554,
            "text": "As someone who got busted for DUI, wrecked and had to pay to have my car repaired, did mandatory jail time because my BAC was off the chart,payed court fees, has their insurance premiums through the roof, has a restricted license for over a year and still has a court date to determine if I met all the state and the judges wishes to not go back to the slammer…it’s not worth it in any way, shape or form!!!!!!!!",
            "title_similarity": "0.6109979",
            "sentiment_compound": -0.6038
        },
        {
            "id": "hqs0jqe",
            "score": 77,
            "text": "In 2019 my sister died drinking and driving. I've never looked at it the same way again. Even if you feel safe you still might not be. It's always better to take an Uber, or walk or whatever. Never drive drunk. Great LPT",
            "title_similarity": "0.68376946",
            "sentiment_compound": -0.015
        },
        {
            "id": "hqrfam6",
            "score": 767,
            "text": "Careful about sleeping in your car while intoxicated. It can be considered a DUI charge because you are intoxicated and have the means to drive the vehicle, they don’t know your intent! I agree it is better than driving but the law may not side with you. Stay safe",
            "title_similarity": "0.81213665",
            "sentiment_compound": 0.7988
        },
        {
            "id": "hqrlaic",
            "score": 1908,
            "text": "The public bus company in my city (Denver) doesn't charge a fare tonight. Anyone can ride free. It's paid for by Coors, of all people. I don't know if other cities do this, but it's worth checking!",
            "title_similarity": "0.6766385",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hqroexb",
            "score": 581,
            "text": "Also, if you live somewhere that passing out/falling asleep outside will kill you, don't walk home!  When I lived somewhere that regularly got into the -30s, every spring they found at least one body of someone who went missing New Year's Eve, and it was always somewhere between where they were partying and their home.",
            "title_similarity": "0.64850867",
            "sentiment_compound": -0.68
        },
        {
            "id": "hqrmnu3",
            "score": 1,
            "text": "Cheaper than ambulances as well",
            "title_similarity": "0.4346447",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hqrt1rw",
            "score": 1,
            "text": "and better than taxis",
            "title_similarity": "0.28757146",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqru605",
            "score": 2,
            "text": "can confirm, DUI sucks. should have uber'd",
            "title_similarity": "0.36039513",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqrvp61",
            "score": 11,
            "text": "Check local lawyers.\n\nMany are offering free taxi rides.",
            "title_similarity": "0.5736206",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hqrweqz",
            "score": 12,
            "text": "In Tampa (as someone who has been a bartender for the last decade) ride share is the best thing to happen to our city.\n\nPublic transportation has always been shit here. The DUI rate has gone down significantly since ride share.\n\nLiterally a town best defined by eating and drinking.",
            "title_similarity": "0.70115244",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hqrx10y",
            "score": 15,
            "text": "CT is offering a [$10 discount Uber code](https://portal.ct.gov/DOT/News-from-the-Connecticut-Department-of-Transportation/2021/SAVE-THE-NIGHT-CONNECTICUT) good through 1/14/22 to help people get home safe.\n\n>NEWINGTON, CT – November 23, 2021 – As traffic fatalities continue to rise, the Connecticut Department of Transportation Office of Highway Safety is announcing a $10 discount code for Uber, to encourage people who consume alcohol or other impairing substances to use ride-hailing instead of putting themselves and others on the road at risk by getting behind the wheel.\n\n\n>The discount code, SAVETHENIGHTCT, will be available beginning November 23, 2021 through January 14, 2022 between the hours of 5 PM and 4 AM.\n\n\n>This program was made possible thanks to a grant from the Governors Highway Safety Association (GHSA), in partnership with Uber. Connecticut is one of only 5 states to receive this grant.",
            "title_similarity": "0.7296524",
            "sentiment_compound": 0.9597
        },
        {
            "id": "hqrx8fk",
            "score": 1,
            "text": "Except if you're a woman",
            "title_similarity": "0.05136533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrxcd5",
            "score": 1,
            "text": "And cabs are cheaper than ubers",
            "title_similarity": "0.48881564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrxenu",
            "score": 1,
            "text": "Drinking Insurance is cheap when compared to consequences!!!",
            "title_similarity": "0.5212028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrxquy",
            "score": 1,
            "text": "Funerals are free",
            "title_similarity": "0.4369932",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hqry2vn",
            "score": 1,
            "text": "throw your keys in the trunk while your at it. if a cop wants to bother you, it would be hard to prove you were operating the car if the keys are in the trunk.",
            "title_similarity": "0.55188084",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hqry9wy",
            "score": 1,
            "text": "Here we just hire ppl to come drive you and your car back home",
            "title_similarity": "0.60232604",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrynv4",
            "score": 119,
            "text": "Waking up at home without your car is better than waking up in jail.",
            "title_similarity": "0.7266386",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqrypk5",
            "score": 1,
            "text": "Dui fucks you for years. Get an Uber I couldn't.  Also once I got a drink I started using taxis alot so it's in your future either way.",
            "title_similarity": "0.67924774",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hqrypot",
            "score": 1,
            "text": "Unfortunately a lot of those who drink and drive bet on the chance that they wont get caught so this great tip wont get to the majority of those who do.",
            "title_similarity": "0.576895",
            "sentiment_compound": 0.7025
        },
        {
            "id": "hqryqob",
            "score": 1,
            "text": "Where I’m at there’s usually neighbors lighting up fireworks till 3 or 4 o’clock in the morning,  now it’s so quiet for a New Year’s Eve",
            "title_similarity": "0.57457304",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrz0rk",
            "score": 1,
            "text": "Not the point here, but funerals are real expensive. Very similar to weddings - lots of people, excuses for up charging, and many of the same features (flowers, food, venue, officiant, and lots of miscellaneous charges you dont expect).",
            "title_similarity": "0.4889313",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hqrzd3l",
            "score": 2,
            "text": "If you have AAA look into what they're offering. I know in the past they'll offer members free tows and/or rides on NYE",
            "title_similarity": "0.5012683",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hqrzfq5",
            "score": 1,
            "text": "Let me know if anyone is alone on New Years. I need to borrow your chairs.",
            "title_similarity": "0.52456224",
            "sentiment_compound": -0.25
        },
        {
            "id": "hqrzizr",
            "score": 1,
            "text": "Sleeping it off in a gutter is better than drinking and driving.",
            "title_similarity": "0.6974577",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqrzku5",
            "score": 1,
            "text": "When doing the right thing still gets you in trouble\n\nhttps://youtu.be/_VMGbk3b6v4",
            "title_similarity": "0.250053",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hqrznue",
            "score": 3,
            "text": "Around here sleeping in your car while intoxicated will get you a DUI.",
            "title_similarity": "0.70048916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrzpmh",
            "score": 1,
            "text": "AAA tipsy tow.\n\nEven if you dont have AAA theyll tow you home free",
            "title_similarity": "0.6059631",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hqrzqo8",
            "score": 1,
            "text": "Again, LPT. You can take him.",
            "title_similarity": "0.1764669",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqrzvqb",
            "score": 1,
            "text": "Here’s looking at you Frank Somerville",
            "title_similarity": "0.08935682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs074i",
            "score": 1,
            "text": "Uber/Lyft rides will be around x4 the normal rate when the New Years parties end if you are in the downtown areas/ night club strips. That will still be substantially less than what the cost of a DUI will net you.",
            "title_similarity": "0.7073068",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hqs0p77",
            "score": 1,
            "text": "Walking twenty miles is cheaper than a DUI.",
            "title_similarity": "0.5420923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs0s21",
            "score": 1,
            "text": "Too bad that the ones who need to listen to this, are too drunk to care. Through their stupid alcohol arrogance they just go \"i fell like i'm okay to drive.\"",
            "title_similarity": "0.54058504",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hqs0yrl",
            "score": 1,
            "text": "And tip your driver's handsomely... If they did a decent enough job",
            "title_similarity": "0.43485278",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hqs12p4",
            "score": 1,
            "text": "You should add if sleeping in your car make sure you are NOT in drivers seat AND that the keys are not withing reach.\n\nSource: I slept off a few drinks in the parking lot of my vehicle and keys were in reach so I got a DUI back in the day",
            "title_similarity": "0.8490305",
            "sentiment_compound": 0.3239
        },
        {
            "id": "hqs14yk",
            "score": 1,
            "text": "Telling all my bar patrons to get their Uber before close, cause it’s gonna be a mad house",
            "title_similarity": "0.43547323",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hqs15ku",
            "score": 1,
            "text": "Holy shit, an actual life pro tip.",
            "title_similarity": "0.26154238",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hqs16oy",
            "score": 1,
            "text": "Merry christmas everybody ♥",
            "title_similarity": "0.26296592",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hqs1brz",
            "score": 1,
            "text": "I used to think I was one of those guys, grew up on video games, had an instinctive autopilot for driving, no matter what. How I didn't wreck is a mystery, but I realize how lucky I was seeing everyone around me dying or getting hefty fines. I won't do it anymore.",
            "title_similarity": "0.7153804",
            "sentiment_compound": 0.656
        },
        {
            "id": "hqs1e9v",
            "score": 1,
            "text": "When I lived in Philadelphia I looked at a year of expenses. I spent close to 2k on Uber rides.\n\nI haven’t had to hire a lawyer since I was a juvenile but 2k doesn’t get you anywhere.\n\nI don’t know what the increase to you’re insurance if you get in an accident drunk or get a DUI but I bet it’s less than 2k.\n\nI am not an actuary so I can’t quantify what a single human life is worth but 2k is financially and morally a steal.\n\n\nYou don’t have a reason to not drive drunk. If you can’t afford the ride DM me. I will Venmo you some money to make it happen.",
            "title_similarity": "0.68505275",
            "sentiment_compound": -0.6904
        },
        {
            "id": "hqs1f1i",
            "score": 1,
            "text": "No one ever regrets spending money on an Uber when going out. They regret a lot of things, but that’s not one of them.",
            "title_similarity": "0.5392132",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hqs1lcq",
            "score": 1,
            "text": "False. If I die the funeral wouldn’t be paid for by me, so it is free.",
            "title_similarity": "0.61022997",
            "sentiment_compound": -0.4284
        },
        {
            "id": "hqs1okt",
            "score": 1,
            "text": "Anyone who is reading this, please take an extra second to consider the potential consequences.  Stay safe, and happy new year ❤",
            "title_similarity": "0.5215417",
            "sentiment_compound": 0.925
        },
        {
            "id": "hqs1xiz",
            "score": 1,
            "text": "Wait you guys can get Ubers?",
            "title_similarity": "0.25041354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs200l",
            "score": 1,
            "text": "If you can't find an Uber/Lyft, call a local cab company. They'll have something available.",
            "title_similarity": "0.5077362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs22yt",
            "score": 10,
            "text": "It’s also a terrible idea to drive home the morning after a big night. Even though you might feel okay, your BAC is likely still high and you can get busted.",
            "title_similarity": "0.5920045",
            "sentiment_compound": -0.296
        },
        {
            "id": "hqs24sa",
            "score": 1,
            "text": "Also, don't let your friends walk down sketchy streets because they had a fight with their boyfriend  and they just want to walk home alone. You might get killed by a sexual sadist.\n\nThis is a true story",
            "title_similarity": "0.59516424",
            "sentiment_compound": -0.8203
        },
        {
            "id": "hqs27gj",
            "score": 1,
            "text": "This post is brought to by Uber^tm don’t use Lyft",
            "title_similarity": "0.37317932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs29bk",
            "score": 1,
            "text": "Also taxis are usually way cheaper than uber",
            "title_similarity": "0.5148957",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs2d5f",
            "score": 1,
            "text": "didnt uber literally say they werent picking up drunk people anymore?",
            "title_similarity": "0.5005505",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hqs2fs0",
            "score": 1,
            "text": "Okay Uber employee.",
            "title_similarity": "0.114378504",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hqs2iuv",
            "score": 1,
            "text": "These dumb ass karma hunting post help nobody.",
            "title_similarity": "0.31497443",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hqs2mcd",
            "score": 1,
            "text": "Depends which country you're from ;)",
            "title_similarity": "0.03730095",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hqs2rvi",
            "score": 1,
            "text": "My Uber driver was drunk off his ass.",
            "title_similarity": "0.4317018",
            "sentiment_compound": -0.7322
        },
        {
            "id": "hqs2u8f",
            "score": 1,
            "text": "City gives us free public transit tonight, should be in perpetuity, but I'll take it.",
            "title_similarity": "0.6202449",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hqs2x2t",
            "score": 1,
            "text": "Man, buzzed driving is so fun.",
            "title_similarity": "0.3920284",
            "sentiment_compound": 0.6418
        },
        {
            "id": "hqs2yig",
            "score": 1,
            "text": "And taxis are cheaper than ubers.",
            "title_similarity": "0.47611126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs3614",
            "score": 1,
            "text": "DUI lawyers call NYE, Amateur Night",
            "title_similarity": "0.43911618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs3643",
            "score": 1,
            "text": "DUI’s - while they suck and are expensive, not risking lives (your own and others) is paramount. Be safe. Take an Uber or have a DD. Happy new year all. Let’s make 2022 better.",
            "title_similarity": "0.6786107",
            "sentiment_compound": 0.8206
        },
        {
            "id": "hqs3amv",
            "score": 1,
            "text": "I was on the road all night, barely any traffic. Shockingly little traffic. Way to go guys.",
            "title_similarity": "0.5994071",
            "sentiment_compound": -0.1119
        },
        {
            "id": "hqs3gvd",
            "score": 1,
            "text": "But if I die don't have to pay",
            "title_similarity": "0.32812822",
            "sentiment_compound": -0.7101
        },
        {
            "id": "hqs3hj2",
            "score": 13,
            "text": "Got stuck in the city after a nightclub closed nye a few years ago and my friends and I almost froze to death, no Ubers available for 3 hours and the prices where hundreds of dollars when they are normally $30. Uber isn't always an option, had to wake my sister up to come save us.",
            "title_similarity": "0.6189212",
            "sentiment_compound": -0.1372
        },
        {
            "id": "hqs3kbb",
            "score": 1,
            "text": "Even better option, drink until you pass out in a bush! Then you can sleep off the drunk",
            "title_similarity": "0.68339294",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hqs3o0o",
            "score": 9,
            "text": "If you plan to sleep in your car do so in the back seat, or bare minimum the passenger seat.\n\nIdk about every location, but where I'm from just being behind the wheel while drunk can land you a DUI.",
            "title_similarity": "0.7928153",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hqs3prz",
            "score": 1,
            "text": "In my country, a (rough) way to work it out is 1 unit takes 1 hour to leave your system. It depends on your body type/weight though as well so it’s not gospel per person. [Here is a link for a rough idea of when you will be sober](https://www.confused.com/car-insurance/morning-after-calculator)",
            "title_similarity": "0.6357592",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hqs3x28",
            "score": 1,
            "text": "Iseful corporate ad... I guess.",
            "title_similarity": "0.28694516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs4006",
            "score": 1,
            "text": "Happy New Year to you as well.",
            "title_similarity": "0.22599098",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hqs47bw",
            "score": 1,
            "text": "Kept reading that as fun-erals... was thinking that doesn't sound so bad... brain not quite working well today",
            "title_similarity": "0.44622198",
            "sentiment_compound": -0.7587
        },
        {
            "id": "hqs4acc",
            "score": 1,
            "text": "So are cabs and they are way cheaper at night than Uber",
            "title_similarity": "0.60811996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs4hu0",
            "score": 1,
            "text": "1:45 am and for the Uber rn",
            "title_similarity": "0.31791806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs4j5l",
            "score": 1,
            "text": "FYI, funerals are free to the deceased.",
            "title_similarity": "0.5084317",
            "sentiment_compound": 0.4995
        },
        {
            "id": "hqs4l73",
            "score": 1,
            "text": "Do taxis not work anymore?",
            "title_similarity": "0.33380985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs4owh",
            "score": 1,
            "text": "Can confirm.  Mom died drunk driving.  I have an OWI.  BOTH were heavy burdens, emotionally and financially",
            "title_similarity": "0.47344208",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hqs4s1q",
            "score": 1,
            "text": "Sleep in the passenger seat or back seat, before you get Fu ked up park somewhere well lit, and the equilibrium thing isn't 100% factual bc you'll think it's back b4 it's back\n-somebody safely drunk St home that has done dumb things in the past",
            "title_similarity": "0.80357397",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hqs59rk",
            "score": 1,
            "text": "Driving drunk right now",
            "title_similarity": "0.36616832",
            "sentiment_compound": -0.34
        },
        {
            "id": "hqs5lgt",
            "score": 1,
            "text": "Everyone that drank is sleeping at my place, so cheers",
            "title_similarity": "0.5489948",
            "sentiment_compound": 0.6113
        },
        {
            "id": "hqs5o1d",
            "score": 1,
            "text": "Yeah but the dead drunk person doesn't have to pay for the funeral.",
            "title_similarity": "0.5726931",
            "sentiment_compound": -0.9053
        },
        {
            "id": "hqs5orw",
            "score": 1,
            "text": "Nah, man Imma ok to drive",
            "title_similarity": "0.30045307",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hqs5pq2",
            "score": 1,
            "text": "Also, uber's are harder to find these days due to covid. Please plan ahead",
            "title_similarity": "0.50270927",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hqs5q61",
            "score": 1,
            "text": "Haven't really partied since the pandemic came, but I'm really glad my group of friends has a designated driver. He doesn't really like alcohol, so whenever we hang out, he'd just have a Coke (or single beer early on in the night if he's feeling it). He actually tells us not to bring any of our cars and he'll just drive us home using his minivan. \n\nHe's the real MVP.",
            "title_similarity": "0.7983006",
            "sentiment_compound": 0.7732
        },
        {
            "id": "hqs5xue",
            "score": 1,
            "text": "I can add more: after being busted for DUI they suspended my driver license for two years, thus it was DUI fine plus Uber for two years",
            "title_similarity": "0.55057585",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hqs60jq",
            "score": 1,
            "text": "Sleeping in ur car wont always work, iirc theres been stories about ppl getting booked for duis even if they were sleeping and the car wasnt turned on nor keys anywhere near ignition",
            "title_similarity": "0.70541275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs6a7j",
            "score": 24,
            "text": "This should be pinned to the top of the site on all major holidays. There are even places that will drive you for free of your drunk in many metropolitan areas for these nights.\n\nPlease be safe.",
            "title_similarity": "0.6677525",
            "sentiment_compound": 0.8687
        },
        {
            "id": "hqs6ab9",
            "score": 63,
            "text": "So my ex brother in law died today in a car crash. He was drunk and didn’t have his seatbelt on. 5 years ago his 20 year old younger brother died in a car crash because he didn’t have his seatbelt on. DONT DRINK AND DRIVE AND WEAR YOUR SEATBELT.",
            "title_similarity": "0.60352695",
            "sentiment_compound": -0.9325
        },
        {
            "id": "hqs6mj1",
            "score": 1,
            "text": "Technically if you die the funeral isn’t really your problem.",
            "title_similarity": "0.48930794",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hqs6ohn",
            "score": 1,
            "text": "Also, yes it is inconvenient to leave your car somewhere and have to retrieve it in the morning. But you know what’s MORE inconvenient? Life without the possibility of parole and your kids growing up without their father. Source: the drunk driver who hit and killed my friend and her entire family when we were teens. \n\nCall. An. Uber!!! Please!!",
            "title_similarity": "0.6279758",
            "sentiment_compound": -0.8109
        },
        {
            "id": "hqs6xn7",
            "score": 1,
            "text": "I paid $16,432 in fines and that’s not even counting the cost of the vehicle I totaled and that’s nothing compared to what could have happened. I could have murdered someone, ruined someone’s entire life. I’m blessed that it didn’t happen, but you will do that, you won’t be the exception. I took the exception, the odds are not in your favor. I’ll call you an Uber just pm me.",
            "title_similarity": "0.6440406",
            "sentiment_compound": -0.6354
        },
        {
            "id": "hqs6zb2",
            "score": 1,
            "text": "I’m just staying home. Sleeping early.",
            "title_similarity": "0.6121087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs72g7",
            "score": 1,
            "text": "My designated driver the last two years hasn't taken me out at all. His bedtime is 8pm and he doesn't get his license for another fourteen years.",
            "title_similarity": "0.54686666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs73dg",
            "score": 150,
            "text": "Side tip: as a former traffic safety engineer who’s looked at car crash data, even if you are sober, there are times, holidays and midnight of New Years especially, where you should just avoid being on the road if you can.",
            "title_similarity": "0.7485753",
            "sentiment_compound": 0.128
        },
        {
            "id": "hqs75rs",
            "score": 1,
            "text": "but do uBers have cool dudes like Jim that share a bunk with me?",
            "title_similarity": "0.5512867",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hqs763h",
            "score": 1,
            "text": "yeah i got D.I.I. once, it was not fun.",
            "title_similarity": "0.24594054",
            "sentiment_compound": -0.1285
        },
        {
            "id": "hqs78f8",
            "score": 1,
            "text": "Uber Drivers do get fucked pretty hard though. Didn't realize they only got $2 for an $8 drive.",
            "title_similarity": "0.5638044",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hqs7a88",
            "score": 1,
            "text": "im in cali and need to get to new york though...",
            "title_similarity": "0.28653008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs7cj6",
            "score": 1,
            "text": "Depends on where you are, but just being drunk in your car, not driving, can result in charges. “Actual Physical Control” is basically the same as a DUI if there’s any way they can claim intent to drive. Be careful about sleeping in your car. Best case scenario is to get a ride to your destination and also home. Be safe.",
            "title_similarity": "0.8488462",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hqs7f33",
            "score": 1,
            "text": "LPT: Lyfts are cheaper than Ubers",
            "title_similarity": "0.4863901",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs7i8u",
            "score": 13,
            "text": "My piece of shit sister got off Scott free from what should have been a felony dui for driving 86 in a 55 with her kids in the backseat and blowing over 2 times the legal limit. Still makes my blood boil.",
            "title_similarity": "0.63751495",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hqs7ks7",
            "score": 1,
            "text": "Think of your doggo! That was a really sad commercial",
            "title_similarity": "0.30627286",
            "sentiment_compound": -0.5697
        },
        {
            "id": "hqs7ne7",
            "score": 1,
            "text": "This is a LPT? Damn... I thought it was obvious",
            "title_similarity": "0.02641648",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hqs7qnd",
            "score": 1,
            "text": "In NY? This could be argued otherwise\n\ns/",
            "title_similarity": "0.16487512",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqs7u20",
            "score": 1,
            "text": "Just as a call out, it's not necessarily uber/lyft fault that the surge pricing happens on these nights \n\nThere's just nobody driving so it's a supply demand issue",
            "title_similarity": "0.66170496",
            "sentiment_compound": 0.1921
        },
        {
            "id": "hqs7vtp",
            "score": 1,
            "text": "It's also cheaper than the therapy sessions and lawyers if you takeout a family. Stay safe!",
            "title_similarity": "0.6143466",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hqs7x1t",
            "score": 1,
            "text": "Sober friends time to shine. Offer to drive them if you’re able.",
            "title_similarity": "0.5737549",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hqs83pt",
            "score": 1,
            "text": "For me it’s not the cost of the Uber that’s the problem. It’s that often the Uber will take way too long to arrive, or Uber and Lyft are totally unavailable when I request them. I’ll party fully intending to get an Uber or Lyft, and then I can’t, and I gotta get home somehow. I drove to the party planning to leave my car overnight, but at that point it’s my only option.",
            "title_similarity": "0.7561383",
            "sentiment_compound": 0.1576
        },
        {
            "id": "hqs8aag",
            "score": 1,
            "text": "Honest question… why do we say Happy New Years (or Year’s, in this case).  The new year is neither plural nor possessive.  Did someone just say it wrong once and it became a trend, or am I completely missing something (I can kinda understand the plural version).",
            "title_similarity": "0.45915747",
            "sentiment_compound": 0.2297
        },
        {
            "id": "hqs8fpi",
            "score": 1,
            "text": "The only thing that sucks about this analogy is that the idea of paying an inflated urber fair of $200 for 2 miles is insane...and will make you not accept that far and drive yourself home...",
            "title_similarity": "0.5073815",
            "sentiment_compound": -0.3365
        },
        {
            "id": "hqs8gjp",
            "score": 1,
            "text": "Duis and funerals both cost about 5-10k depending on your representation. \n\nUber... $100 if you're really really drunk",
            "title_similarity": "0.5292459",
            "sentiment_compound": -0.6779
        },
        {
            "id": "hqs8ig4",
            "score": 1,
            "text": "Picked up a negligent driving charge years ago for blowing .065 (below the limit yes). Through the ensuing classes and stuff you get exposure to how many people are so severely impacted by drunk drivers and how many are really out there and holy hell.\n\nNow if I'm even having a beer I'll take an Uber cuz then I can have 2 or 3 and it doesn't matter. No stress no danger. I advocate everyone do the same.",
            "title_similarity": "0.73922205",
            "sentiment_compound": -0.7623
        },
        {
            "id": "hqs8jro",
            "score": 1,
            "text": "Just got out of an Uber four minutes ago, it’s 2:30 just got home. we passed four police officers on our way home in a period of maybe 25 blocks, definitely the 13.50 was much fucking cheaper than a DUI after the seven drinks that we had.",
            "title_similarity": "0.72696674",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hqs8o4a",
            "score": 1,
            "text": "Everyone basically knows that Ubers are cheaper and I don't know many that would dispute that.\n\nHowever, everyone is terrible at risk analysis, especially when under the influence. The setup is easy; you just need to get home today, it'll work this one time like it has before, driving yourself is cheaper, and so forth.\n\nAnyone wise enough to understand that in the long term, it's cheaper to uber instead of risking that 1 in 100k (pulled that out of my ass btw) chance it doesn't work with a critically that is crippling physically and financially, is wise enough to not do it. There is a break even point, but humans are terrible at analyzing risk-cost benefits. We have entire sci-fi and fantasy premises around it, looking at you captain kirk. Motorcycles fall into this as well, but I accept my fate there.\n\nRegardless, don't drive impaired.",
            "title_similarity": "0.72571087",
            "sentiment_compound": 0.6428
        },
        {
            "id": "hqs8tb8",
            "score": 1,
            "text": "SAFENEWYEAR2022 - Lyft promo code for $25 off",
            "title_similarity": "0.43789014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqs911j",
            "score": 1,
            "text": "I like staying home with a bottle of wine these days.",
            "title_similarity": "0.59963924",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hqs923g",
            "score": 1,
            "text": "Story time. \nI've struggled with alcohol for quite some time. \nI lost a job a while back due to drinking. I went to rehab and got sober. Was sober for about 3 years. Now, during my drinking career I had driven drunk countless times. It is disgusting, selfish and wreckless. I am not proud of it. \nGot my shot together. Starting working back in my industry again. Come home for vacation, things were stressful. It is not an excuse but I always used alcohol to cope. Things felt like they were coming down on my bad. Family, relationship best friend had COVID. \nI relapse. I get borderline blackout.  I drive. Pulled over. DWI. \nI have to go back to work in a month. I have no choice. Need to take care of DWI ASAP. I cannot tell my job that I have court dates for DWI. I will lose job for sure. This is not to mention the shame and fear I felt for driving in the shape I was in. I am so, so, so glad I didn't hurt anyone. \nI go to jail for one night. I get convicted.\nAttorney is 8k, he gets fines down to 1500. License is suspended and now when I Renew my documents for the industry I work in I have to disclose the DWI which will ultimately end in my said documents/license being revoked permanently.\nThe governing body for my job does not play around with DUI/DWI or any other drug related offense. \n\nI fucked up. Could have hurt or killed someone and feel like a piece of moral. \n\nMoral of the story. Ubers/lyft/ cabs or whatever the fuck are way cheaper. Just leave your house in one of those initially and then once you're  out and about having your drinks then you don't have a choice but to take a ride back home. \n\nI know I have more than just that to fix. I need to work on getting sober, alcohol and I do not mix well. \n\nThis all happened in Oct. 21'. Fast forward to Dec 21'. I get a text message from a family member telling me that a cousin several times removed, younger than me, he was 24. Died in a vehicle accident on Dec 17th. Alcohol was suspected to be involved. Only 24. Just like that. \n\nWhether it's the money you have to spend or you losing your life being via death or prison. It. Is. Not. Worth. It. \nThe job? I mean what can I do? I'm just glad no one was killed but definitely could have not used a DWI. \nStay safe.",
            "title_similarity": "0.63991857",
            "sentiment_compound": -0.9945
        },
        {
            "id": "hqs9cei",
            "score": 1,
            "text": "What a shit pro tip",
            "title_similarity": "0.098741606",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hqs9dpc",
            "score": 2,
            "text": "I am no one.  Sleeping in your car alive and with all your shit is way better than dead or somewhere you don’t know with none of your shit.  Be safe, be smart, live",
            "title_similarity": "0.7467916",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hqs9hci",
            "score": 1,
            "text": "Ubers aren't as exciting as drink drivin though",
            "title_similarity": "0.41709808",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hqs9ktp",
            "score": 7,
            "text": "Uber driver out here working tonight. Stay safe and be nice to your drivers!",
            "title_similarity": "0.6288682",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hqs9pqo",
            "score": 3,
            "text": "This may depend on the state, but I know that at least in some states, you are not able to even turn your car on while intoxicated, as this can lead to DUI charges even if you did not move the vehicle.",
            "title_similarity": "0.6409365",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hqs9tew",
            "score": 1,
            "text": "Yeah so I checked both Lyft & Uber - No ride available. Still need ways for most people to get home. Luckily I Had a ride home.",
            "title_similarity": "0.6941531",
            "sentiment_compound": 0.4627
        },
        {
            "id": "hqs9xhv",
            "score": 1,
            "text": "In a lot of places, if you are even in your car drunk, you can get a DUI. If you have fallen asleep in your car wasted, a passing cop will likely not view this as responsible and will assume you intended to drive home wasted and just passed out first. You should always assume they will not give you the benefit of the doubt.",
            "title_similarity": "0.79075825",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hqsa9eu",
            "score": 1,
            "text": "Arrive alive, don't drink and drive",
            "title_similarity": "0.37288135",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hqsaayt",
            "score": 1,
            "text": "And staying home is cheaper than going to the hospital after getting covid 🙃",
            "title_similarity": "0.67303824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsacy5",
            "score": 1,
            "text": "People who need this won't listen. They know the cost vs benefit. No one is gonna look at this and say \"oh right!!! I never knew its bad to get a DUI. Good this this pro tip was here!",
            "title_similarity": "0.50751173",
            "sentiment_compound": 0.828
        },
        {
            "id": "hqsadrs",
            "score": 6,
            "text": "It is 100 % not wrong.  Accept- in many states they will still charge you with the dui for sleeping in the car with your keys “because you could have decided to drive”",
            "title_similarity": "0.81453764",
            "sentiment_compound": 0.0951
        },
        {
            "id": "hqsaenf",
            "score": 1,
            "text": "Pretty sure the people who are dumb enough and don't give a shit enough to drive drunk aren't going to care if it isn't cheap. Because they \"can drive just fine\"",
            "title_similarity": "0.5843896",
            "sentiment_compound": 0.2254
        },
        {
            "id": "hqsaoo9",
            "score": 1,
            "text": "Not doing drugs at all is even cheaper.",
            "title_similarity": "0.48854336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsap4t",
            "score": 1,
            "text": "Where were you when I got a DUI and held a funeral for myself?",
            "title_similarity": "0.44851744",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqsasts",
            "score": 2,
            "text": "I wish there was Ubers in our area...I've always been DD....I'm 27.",
            "title_similarity": "0.5128065",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hqsawjw",
            "score": 1,
            "text": "Or you can be like me and walk 8 miles to home for free",
            "title_similarity": "0.5766369",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hqsb2bs",
            "score": 3,
            "text": "Saw someone tonight cut off a cop by making a left turn onto a busy 7 lane road. Cop flashed his lights for one second after the driver slowed down to about 5 mph for no reason. It took the cop a few more seconds to pull him over as he sped up to about 20 mph to cross the busy intersection and then came halting down to about 5mph again for no reason. \n\n\nDUIs in AZ can ruin your life.",
            "title_similarity": "0.6264335",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hqsb3hg",
            "score": 2,
            "text": "I heard AAA will tow your car (and you) for free on NYE/day.",
            "title_similarity": "0.6209239",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hqsb4mu",
            "score": 1,
            "text": "All well and good if you don't live in the middle of fucking nowhere with zero public transport or uber. I just stayed home instead. Everyone here is getting Corona anyway",
            "title_similarity": "0.71114147",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hqsb57y",
            "score": 3,
            "text": "Agreed! Unfortunately Uber has made it difficult to plan this stuff out. If anyone is in a drunk situation and runs into this issue tonight, call your local taxi, hell call a friend or parent even because this post could not be any more true!\n\n**Edited for grammar, I'm also in this situation, but drinking home alone with no plans of driving like a responsible alcoholic with no friends",
            "title_similarity": "0.7054726",
            "sentiment_compound": -0.6449
        },
        {
            "id": "hqsb80e",
            "score": 1,
            "text": "Buuut - how do you know the Uber/Lyft driver hasn't been drinking?",
            "title_similarity": "0.44704324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsbi7m",
            "score": 1,
            "text": "My funeral isn’t going to cost me a dime, pal.",
            "title_similarity": "0.3899956",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqsbl0t",
            "score": 1,
            "text": "Depends on the funeral",
            "title_similarity": "0.25407335",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqsc3wh",
            "score": 1,
            "text": "Tonight, a 1.5 mile Uber ride was $205 in my city... there is a HUGE amount of drunk drivers for this reason",
            "title_similarity": "0.60574484",
            "sentiment_compound": 0.1613
        },
        {
            "id": "hqsc6et",
            "score": 4,
            "text": "On a related note: Have you ever wondered why almost all American cities are designed so that getting to a bar requires driving? Why everything is so spread out so walking/public transport/biking is not feasible? If so, join us at /r/fuckcars",
            "title_similarity": "0.59577537",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hqscdzz",
            "score": 1,
            "text": "If you need to be told this and you're above the age of like 16-18, then your genes aren't welcome in the pool.",
            "title_similarity": "0.32868394",
            "sentiment_compound": 0.0052
        },
        {
            "id": "hqscjcb",
            "score": 11,
            "text": "Our local law enforcement started Project Red Nose years ago...  they have people waiting that will drive you home in YOUR car, and hop in the car thier partner is following in to go to the next person in the list.\n\nDon't know if it's officers or contractors at this point, only cost is a donation to the food bank.",
            "title_similarity": "0.6786176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsckxo",
            "score": 1,
            "text": "Washington has had snow the last week. First day, Monday, was no problem. After that less snow in general but worse for me driving. I just sacrificed not only pay for Thursday, but also holiday for Friday/tod... yesterday, cuz holiday pay you have to work the scheduled day before and after, cuz that's cheaper than an accident so fuck it. My car is still undamaged and I can get to work on Monday.",
            "title_similarity": "0.7010059",
            "sentiment_compound": -0.8387
        },
        {
            "id": "hqscr6r",
            "score": 23,
            "text": "I was hit by a drunk driver while driving my drunk friends home. I was the only person injured.",
            "title_similarity": "0.5925692",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hqscx9w",
            "score": 63,
            "text": "As someone who is sober, also try calling your sober friends/family if you are really desperate. Idgaf if I’m asleep, if someone I love calls me for a safe ride home, I would go get them. I would much rather be annoyed at you for one day because my sleep was interrupted than possibly mourn you for the rest of my life.",
            "title_similarity": "0.7225701",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hqsd0ry",
            "score": 1,
            "text": "Lmao I am fucking wasted, Happy New Years, motherfuckers",
            "title_similarity": "0.41586658",
            "sentiment_compound": 0.6581
        },
        {
            "id": "hqsdgsy",
            "score": 1,
            "text": "At least in California… a taxi ride to and from NYC is cheaper than a DUI.\nDrive safely please.",
            "title_similarity": "0.67566895",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hqsdhp3",
            "score": 3,
            "text": "When I waited tables I always told them I wanted them to get home safe so they could come back. Now I work boh and tell the wait staff if they can't afford an uber they can't afford to drink.\n\nNothing is worth a DUI. Plan ahead and be safe y'all!",
            "title_similarity": "0.71696126",
            "sentiment_compound": 0.6626
        },
        {
            "id": "hqsdtv4",
            "score": 1,
            "text": "Here in Quebec the governement solve the problem. It was lockdown at 10pm. Happy new year!",
            "title_similarity": "0.49198633",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hqsdz0n",
            "score": 1,
            "text": "PRO TIP GUYS\n\nDON’T DRIVE DRUNK\n\nMAN THIS SUB IS SO LOADED WITH PROFESSIONAL TIPS\n\nHEY GUYS ALSO DON’T SHOOT HEROIN FROM UNKNOWN SOURCES, LITTLE FREE EXTRA LPT FOR YA",
            "title_similarity": "0.6482985",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hqse1n6",
            "score": 1,
            "text": "This simply isn't true. I've had people I know pay 3 grand and the dwi or dui was settled. A funeral and burial can easily cost more sadly.",
            "title_similarity": "0.5280266",
            "sentiment_compound": -0.4451
        },
        {
            "id": "hqse5sb",
            "score": 1,
            "text": "Yeah but also fuck Uber looked at booking a ride on NY Night and they were trying to charge $120 for an 8 minute ride ?!?!",
            "title_similarity": "0.5790111",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hqseahx",
            "score": 1,
            "text": "I agree completely but please call them Taxi's and not by their brand.",
            "title_similarity": "0.4974407",
            "sentiment_compound": 0.627
        },
        {
            "id": "hqsecy7",
            "score": 1,
            "text": "Y’all dumb. Just don’t drink and drive.",
            "title_similarity": "0.30354765",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hqsfjwc",
            "score": 1,
            "text": "They are and they shouldn’t mix well...",
            "title_similarity": "0.06368197",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hqsfkoh",
            "score": 1,
            "text": "Yes, from someone almost killed by a drunk driver, please don't drive.",
            "title_similarity": "0.49331683",
            "sentiment_compound": -0.3832
        },
        {
            "id": "hqsflea",
            "score": 1,
            "text": "I never comment and just wanted to say DO NOT SLEEP IT OFF IN YOUR CAR. Keys located in the car  while you're intoxicated is never a good idea and an easy way for an OWI. Seriously, just get an Uber or whatever.",
            "title_similarity": "0.7182596",
            "sentiment_compound": -0.0531
        },
        {
            "id": "hqsfxsm",
            "score": 2,
            "text": "Couldn’t have put this more simple my simple myself. Listen to this post y’all",
            "title_similarity": "0.30708325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsg16w",
            "score": 1,
            "text": "Funeral might be more expensive than uber but you don’t have to pay for it😎",
            "title_similarity": "0.56835",
            "sentiment_compound": 0.3919
        },
        {
            "id": "hqsg5zr",
            "score": 1,
            "text": "this ain't a life pro tip this is common fucking sense",
            "title_similarity": "0.27162844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsga8p",
            "score": 3,
            "text": "Used to work for the police looking after people who got arrested. This was before Uber but taxis were still available. When you get arrested all your property is listed. Every drunk driver had over 100 in cash on them when they were arrested.",
            "title_similarity": "0.6041213",
            "sentiment_compound": -0.9253
        },
        {
            "id": "hqsgqa2",
            "score": 1,
            "text": "All DUI drivers deserve only death. I always hope they die smashing into some concrete, rather than damaging a tree.\n\nBy definition, they are OK with killing others. So them dying is really the best outcome for mankind.",
            "title_similarity": "0.5624252",
            "sentiment_compound": -0.7342
        },
        {
            "id": "hqsh0na",
            "score": 1,
            "text": "I thought we weren't supposed to go out and party because omicron",
            "title_similarity": "0.3835742",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hqsikuz",
            "score": 1,
            "text": "I guess you haven’t seen Ubers prices lately. DUI is probably cheaper.",
            "title_similarity": "0.584027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsilbi",
            "score": 2,
            "text": "Hey I can relate to this. Just grabbed an Uber home after a hard night of drinking! Feeling great about that!",
            "title_similarity": "0.6648028",
            "sentiment_compound": 0.6988
        },
        {
            "id": "hqsj5ka",
            "score": 3,
            "text": "Goodluck getting one nowadays. \n\nUber and Lyft exploit their drivers as much as they exploit their customers. \n\nUber/Lyft used to pay out $200 for passengers who vomited in their drivers vehicle. Nowadays they pay $15. \n\nJust one example. \n\nWho wants to put thousands of miles on their vehicle for pennies, after expenses like taxes, vehicle maintenance and wear and tear?\n\nThis is why it's difficult (in many areas of the US) to find an Uber or Lyft.",
            "title_similarity": "0.6047905",
            "sentiment_compound": -0.4336
        },
        {
            "id": "hqsjj0g",
            "score": 1,
            "text": "My housemate already drank drive to and from the pub this new year....",
            "title_similarity": "0.58724165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsko0i",
            "score": 1,
            "text": "Most Ubers but not all",
            "title_similarity": "0.24628434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsl2a0",
            "score": 1,
            "text": "This isn't a life pro tip, it's just life. You're not blowing anyone's mind with this crazy realization.",
            "title_similarity": "0.3779934",
            "sentiment_compound": -0.4118
        },
        {
            "id": "hqslb4p",
            "score": 1,
            "text": "my LPT: Please keep breathing!",
            "title_similarity": "0.121353276",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hqsljpq",
            "score": 1,
            "text": "LPT: You can schedule Uber in advance and be more sure to get it. Like if you know you will be drinking till 2 AM schedule Uber before leaving to pub and have it pick you up at 2 AM. You are almost sure to get a ride back home.",
            "title_similarity": "0.65195906",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hqslju3",
            "score": 1,
            "text": "Sure, but I’m not paying for my own funeral.",
            "title_similarity": "0.3452595",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hqsloko",
            "score": 1,
            "text": "I’d like to add, if you can arrange a ride from someone you trust then I’d recommend that over Uber. I’ve personally had a scary incident using Uber and have heard tell of others from friends. Being intoxicated and with a stranger who knows your address can be dangerous. Of course, drinking and driving is always the worst option.",
            "title_similarity": "0.6285064",
            "sentiment_compound": -0.0
        },
        {
            "id": "hqslq4z",
            "score": 1,
            "text": "That is one of the biggest reasignar I haven't taken a car in about 3 years. Where I live if you get cought driving under the influence is at least the same prime as taking 40 ubers. It's just not worth it plus you could just die or kill someone so that's that",
            "title_similarity": "0.6812675",
            "sentiment_compound": -0.8825
        },
        {
            "id": "hqslsug",
            "score": 1,
            "text": "My Uber story from a few nights ago at 3AM. There were no Ubers and I stood outside for over an hour to wait for a taxi at -6C.\n\nI cannot rely on Uber in my small town.",
            "title_similarity": "0.6277569",
            "sentiment_compound": -0.296
        },
        {
            "id": "hqslvhz",
            "score": 1,
            "text": "Also much cheaper than hiring a top notch defense attorney to defend you against vehicular manslaughter charges. Or if someone you injured will now require round-the-clock care for life. That kind of expense will easily exceed the maximum  payout of most auto liability insurance policies. And that's even if they would cover it, which they may not in the case of a DUI.",
            "title_similarity": "0.66667116",
            "sentiment_compound": 0.2551
        },
        {
            "id": "hqslwd8",
            "score": 1,
            "text": "I was driving Uber tonight and they were surcharging to 110 and even 60 bucks when you were out in the country.\n\nThe fucked up part is they were paying like 35$ for the 110$ ride\n\nAnd the 60$ ride I didn't see but I would guess they're gonna pay you like 25$",
            "title_similarity": "0.62242377",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hqsn6kv",
            "score": 1,
            "text": "A earful for a week after calling your parents from 2 hours away at 3am is cheaper than Uber if you really will break your bank.    \nFull story.     \nMy designated had taken who knows what and rode the public bus, believing they were on a spaceship according to phone calls (they answered everytime, i wish I knew which provider he had such high expectations of). At 6am where they've a 1hour mandatory service and cleaning, designated fell asleep on what they believed to be the moon.    \nI assume, because their myspace had an up close of smooth concrete that said \"There's no rocks up here.\" and more clues on their forum section (myspace was wild lol)",
            "title_similarity": "0.7500818",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hqsnbda",
            "score": 1,
            "text": "Uber is ruining the taxi business. Stay away from ubers.",
            "title_similarity": "0.43538606",
            "sentiment_compound": -0.3134
        },
        {
            "id": "hqsne8b",
            "score": 1,
            "text": "Cheaper than cabs too. Fuck the cab industry. Get an uber",
            "title_similarity": "0.60308075",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hqsnqqa",
            "score": 1,
            "text": "The bit about being safe to drive home 'if your equilibrium has returned' is extremely dangerous and just plan wrong. You can still be well over the legal limit to drive the next morning, and if you cause and accident you're still DUI.",
            "title_similarity": "0.6954751",
            "sentiment_compound": -0.624
        },
        {
            "id": "hqsnzk5",
            "score": 1,
            "text": "Got charged with a DWI 12 years ago, and got off. Even a $10,000 Uber would have been cheaper. If you can’t afford an Uber your can’t afford to drink",
            "title_similarity": "0.60134935",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hqso6j0",
            "score": 1,
            "text": "Lyft and Uber makes things so easy.  I’m so glad I don’t have to deal with taxi operators, hope they got the right address down, and wait for an hour without knowing when they’ll arrive to pick you up.",
            "title_similarity": "0.7472136",
            "sentiment_compound": 0.8731
        },
        {
            "id": "hqsovyu",
            "score": 1,
            "text": "As an Uber Driver you completely lost me at the “should be offering discounts if anything” bit. This is my job that I use to make money to live off of. Do you have and idea how badly it sucks to spend new years eve driving around a busy city full of drunk people all night? Have you ever had to find one specific group of drunk people, in this massive rush of drunks surging out of every bar in town onto the sidewalks and streets all at once and looking for rides? Do you have any idea how many drunk drivers almost hit my car tonight? How many drunk idiots walked, ran, or even jumped in front of my moving car? How many obnoxious assholes (the 50 year old guy with the younger girlfriend who told me like 5 times was “his stepdaughter who he fucks” springs to mind) I had to put up with tonight?\n\nIf you want “discounted Uber rides for public safety”. You can feel free to provide them yourself since you are such a Good Samaritan. I earned every penny of the $468 I made during tonight thank you very much. If working a Holliday night didn’t pay like twice as much as easy ass daytime Uber driving does I wouldn’t have worked at all and the 23 safe and sober rides I provided tonight would have gone unfulfilled.",
            "title_similarity": "0.6514667",
            "sentiment_compound": -0.9091
        },
        {
            "id": "hqsppgx",
            "score": 1,
            "text": "My siblings SO got hit with a drunk driver and died... Thank you for this post. Drunk driving is never okay. Stay safe everyone.",
            "title_similarity": "0.65746784",
            "sentiment_compound": -0.839
        },
        {
            "id": "hqsqge7",
            "score": 1,
            "text": "This is well intentioned and obviously correct, but you’re missing the reason people drive drunk. Alcohol affects your judgement. People who are drunk incorrectly assess themselves to sober enough to drive.  So they would not take an Uber, or a cab.   \n\n\nthe real life tip is to have a plan BEFORE you go out drinking that involves you getting safely home without driving.",
            "title_similarity": "0.7574086",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hqsqnxd",
            "score": 1,
            "text": "LPT, it is cheaper to take an Uber than to take out an Uber driver and \"go your own waaaa-eee-aaayy\"",
            "title_similarity": "0.59718573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsqwu8",
            "score": 1,
            "text": "I wish there was Uber in 2001. And 2005",
            "title_similarity": "0.48071587",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hqsr3kj",
            "score": 1,
            "text": "Driving drunk and not getting caught is better than uber",
            "title_similarity": "0.67573655",
            "sentiment_compound": 0.128
        },
        {
            "id": "hqsr4ez",
            "score": 1,
            "text": "A better tip is that it’s not ok to be sober and have an open container in the car while your driving but it is legal to have a shot or 2 and get to feeling nice and drive provided your under the arbitrary limit. So the real tip is get a keychain breathalyzer for less than $20 and be safe that way.",
            "title_similarity": "0.80334",
            "sentiment_compound": 0.8899
        },
        {
            "id": "hqsrbq9",
            "score": 1,
            "text": "It's \"happy new YEAR\" or \"New Year's Day\". Please take note.",
            "title_similarity": "0.2789684",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hqsrq3c",
            "score": 1,
            "text": "I just recently discovered Uber here in Sweden. I booked a trip for New Year's a few days in advance and the calculator said $40. Sure I thought, and booked the trip. Then comes yesterday, I take the trip, and then I see the receipt says $125. Apparently Uber has a surge charge which I was completely unaware of (that is not a thing with other cab companies over here - at least not to that extent), and the app didn't warn me or anything. This story is completely unrelated to OP's LPT, but since OP mentioned Uber I just wanted to say fuck Uber. They're never getting my business again.",
            "title_similarity": "0.6639979",
            "sentiment_compound": -0.6703
        },
        {
            "id": "hqsrsw6",
            "score": 1,
            "text": "Hey man either way I'm not the one paying for the funeral",
            "title_similarity": "0.36616677",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqss34e",
            "score": 1,
            "text": "Sure. Hubs and I hopped in an Uber a few weeks ago, on a calm morning, in Chicago. One block from the hotel, a woman crashed into us. \nNot so safe.",
            "title_similarity": "0.58758795",
            "sentiment_compound": -0.3245
        },
        {
            "id": "hqss82h",
            "score": 1,
            "text": "I love how shit this sub is.\n\nCommon sense and social normals are now LiFe PRo TiPs",
            "title_similarity": "0.42757472",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hqssfo1",
            "score": 1,
            "text": "And don’t forget to tip.",
            "title_similarity": "0.106068626",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hqsswy7",
            "score": 1,
            "text": "That’s what me and my gf did last night even with each Uber being almost $60 for less than 10 miles to and from downtown Nashville still cheaper haha.",
            "title_similarity": "0.6607424",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hqst2hz",
            "score": 1,
            "text": "Be careful sleeping drunk in your car, too. I've heard of plenty of cases of DUI just from being drunk and in your car.",
            "title_similarity": "0.76824784",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hqst3yo",
            "score": 1,
            "text": "Sound advice. It can be nasty out there where partying and alcohol are involved. Better yet, don't drink and still enjoy good company at home without the noise and booze. Safer and don't do Uber or the likes, either. Just like a good Sunday football game. Still can enjoy the game and day with Pizza and Mountain Dew and/or Barq's rootbeer.",
            "title_similarity": "0.7891569",
            "sentiment_compound": 0.966
        },
        {
            "id": "hqst4sx",
            "score": 1,
            "text": "I have no clue what DUIs and LPT is.",
            "title_similarity": "0.08508341",
            "sentiment_compound": -0.296
        },
        {
            "id": "hqstday",
            "score": 1,
            "text": "I drive the same way I sleep - with one eye open",
            "title_similarity": "0.53984493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsvgcn",
            "score": 1,
            "text": "I'm glad we all know this shit is expensive but I wish more people understood the impact it would have on their lives outside of a large bill. \n\nMy dumb ass got a dui in 2012. I had an at home breathalyzer I had to breath into 3 times a day, 6am, 6pm, and 10pm. I obviously couldn't drive but that meant I got shit jobs, lost contact with friends, and biked/public transport for everything. It's really hard to fill a fridge with a rucksack full of stuff. \n\nAfter thousands of dollars, random police home visits wondering why I have a baseball bat and cooking wine, and community service, I finally got off of probation. \n\nI got my dui In 2012, court in 2013, and finished in 2014. I've had a new license issued and after almost 10 years since my dui, I now can't renew my liscence because the judge never filed my interlock release paperwork and I owe the state 10$. It takes 21 days for them to process the paperwork after they receive it in the mail and then I can schedule another appointment with the dmv. \n\nGetting that dui was one of the dumbest mistake I have ever made and it's still haunting me. A dui isn't just a ticket or fee. Expect your life to eat shit for the next couple of years and thank whatever you believe in that you didn't kill anyone. All of this money, stress, and frustration is nothing compared to the guilt and jailtime  you'll have to deal with for taking someone else's life because you thought you could drive.",
            "title_similarity": "0.71897894",
            "sentiment_compound": -0.9838
        },
        {
            "id": "hqsvgvw",
            "score": 1,
            "text": "Party.. like having in real life friends and doing stuff... in 2022?",
            "title_similarity": "0.39877376",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hqsvjqd",
            "score": 1,
            "text": "Little late to the party but here goes anyway. I have driven drunk more times than I can remember. Then I got a DUI. That sucked, for many reasons, including the cost.\n\n6 years after getting a DUI, my wife and I were hit by a repeat DUI offender while riding our bikes. He hit her, kept going, hit me and kept going, pushing my bike under his Jeep for about 500’ (I was thrown from the bike).\n\nI was relatively uninjured but have incredibly annoying tinnitus as a result.\n\nMy wife had a broken leg, collar bone, fractured cervical vertebrae and fractured ribs. She was in thr hospital for 2+ weeks, did rehab for 12 wks, had a rod put in her leg (and removed a year later), metal put in her shoulder (and removed, along with the end of the bone) and more. Her son was devastated to see her in the hospital (he was 11 at the time).\n\nIt’s been a number of years and it still affects us.\n\nWhere we live, convicted drunk drivers have to attend victim impact panels. I now know people whose children, husbands and wives have been killed by drunk drivers. I see more DUI people than you would believe on a regular basis, way more than we should ever see, and they are only a small fraction of the people who drive drunk.\n\nFor the folks who says “this is common sense”: no shit. But as soon as you start drinking, your judgment is impaired and you will find 1000 ways to rationalize how you’re “ok to drive” or you “don’t want to leave your car there.”\n\nThere’s no such thing as a safe or ok drunk driver.",
            "title_similarity": "0.6111462",
            "sentiment_compound": -0.9892
        },
        {
            "id": "hqswbdq",
            "score": 1,
            "text": "LPT Uber is a POS organisation, hire a traditional cab or catch a bus instead",
            "title_similarity": "0.609311",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqswloy",
            "score": 1,
            "text": "Part of this advice could backfire. Even if you aren’t driving you can get a DWI just for your being in your vehicle while drunk. Even if the keys aren’t in the ignition the cop could simply lie and say they were",
            "title_similarity": "0.69048744",
            "sentiment_compound": -0.34
        },
        {
            "id": "hqswph2",
            "score": 1,
            "text": "Or you can live in a city with public transit.",
            "title_similarity": "0.21433055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsx2v7",
            "score": 1,
            "text": "I got a dui sleeping in my car that I'm just dealing with now my advice is don't do this either.",
            "title_similarity": "0.69839245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsy363",
            "score": 1,
            "text": "In many countries such as  Canada, there is a charge called Care and Control of a Motor Vehicle while drunk.\n\nYou WILL be charged if you are drunk in a car with the keys in your pocket or very nearby.\n\nFew people know this because everyone focuses on the words Drunk and Driving.\n\nDon't be fooled. You will be charged and you will be convicted in jurisdictions where care and control of a motor vehicle is the law. \n\nJust a heads up.",
            "title_similarity": "0.6381646",
            "sentiment_compound": -0.0557
        },
        {
            "id": "hqszek2",
            "score": 1,
            "text": "I hope if you’re sleeping it off in the car make sure the keys aren’t in your pocket, ignition, cup holder or anyplace else where you can reach them from your seat, otherwise you’ll get a DUI . Throw those things way under the seat or something like that",
            "title_similarity": "0.76185954",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hqszf1s",
            "score": 1,
            "text": "In my country if the cops catch you over the limit while in your car they will bust you for Drinking & Driving. \n\nhttps://www.pdalaw.co.uk/services-for-you/road-traffic-offences/drunk-in-charge/#:~:text=The%20charge%20of%20being%20drunk,points%20or%20disqualification%20from%20driving.",
            "title_similarity": "0.61331093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqsztb7",
            "score": 1,
            "text": "Are there any stats on DUI recidivism? Don't get me wrong, DUI punishment should be harsh. But I see all of these scenarios where someone gets a DUI and their entire life is ruined financially, personally, professionally - on and on. Usually when someone's life tanks like that, they turn back to alcohol or even harder drugs and then it is back to square one. \n\nI'm not saying I have an answer, or maybe I am way off base. Maybe the answer is better public/low-cost transport in America.",
            "title_similarity": "0.607706",
            "sentiment_compound": 0.1722
        },
        {
            "id": "hqszx6v",
            "score": 1,
            "text": "In the US, Ubers are also cheaper than ambulances.",
            "title_similarity": "0.5257335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqt0etf",
            "score": 1,
            "text": "Lawyers and Funeral Directors hate this one trick!",
            "title_similarity": "0.30845973",
            "sentiment_compound": -0.7712
        },
        {
            "id": "hqt0zst",
            "score": 1,
            "text": "This message was probably paid for by a Uber rep.",
            "title_similarity": "0.3849916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqt1w45",
            "score": 1,
            "text": "Self driven cars and phones with AI to detect drunkenness will save many lives",
            "title_similarity": "0.64825416",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hqt234a",
            "score": 1,
            "text": "LPT: If you think that?",
            "title_similarity": "-0.014885932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqt2p8t",
            "score": 1,
            "text": "Cremation is cheaper than $800",
            "title_similarity": "0.49010503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqt36vj",
            "score": 1,
            "text": "This is more of a pro life tip!  Happy New Year.",
            "title_similarity": "0.3932107",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hqt37i7",
            "score": 1,
            "text": "It drives me crazy when i hear about drunk drivers, especially when it's a celebrity or athlete and shit. Even before Uber and Lyft, you could call a taxi or someone to pick you up. Insane.",
            "title_similarity": "0.54916096",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hqt3dud",
            "score": 1,
            "text": "No one ever gets excited about the bomb that *didnt* go off. Even though that's the one we should be celebrating most.",
            "title_similarity": "0.51837164",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hqt4cn8",
            "score": 1,
            "text": "Technically speaking funerals can be free...\n\nAnd free is much cheaper than any Uber.",
            "title_similarity": "0.5647595",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hqt4erk",
            "score": 1,
            "text": "Yeah, and funerals are cheaper than DUIs.\n\nSo what’s your point.",
            "title_similarity": "0.52248114",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hqt4gwn",
            "score": 1,
            "text": "Hah, stupid! If I die, I pay nothing!",
            "title_similarity": "0.26425233",
            "sentiment_compound": -0.8513
        },
        {
            "id": "hqt4m01",
            "score": 1,
            "text": "Wow. What a pro tip.\nAre cabs cheaper, too?",
            "title_similarity": "0.48584872",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hqt4wt6",
            "score": 1,
            "text": "To be fair, almost anything is cheaper than a DUI or Funeral.",
            "title_similarity": "0.5344485",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hqt50a6",
            "score": 2,
            "text": "I went to my parents for a little bit and as my bf and I were driving home we saw a serious wreck and the firefighters were using the jaws of life to get people out of one of the cars. Craziest thing to me is that this happened on a residential street where no one should have been going fast enough to cause that kind of damage. And it was only 11pm. We also almost got into a few accidents from people driving like asshats. \n\nYou would think that it’s common sense but people feel bulletproof just because of the holiday.",
            "title_similarity": "0.69630444",
            "sentiment_compound": -0.1018
        },
        {
            "id": "hqt5dln",
            "score": 1,
            "text": "The worst was when I was 21 Uber didn’t exist. Nearly all my friends had DUIs pretty sad",
            "title_similarity": "0.474125",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hqt5hzn",
            "score": 1,
            "text": "Counter LPT: Funeral is cheaper than studend debt",
            "title_similarity": "0.517498",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hqt5mjt",
            "score": 2,
            "text": "Know what else is super cheap?  Smoking a big dooby, falling asleep by 9pm and forgetting it was New Years entirely!",
            "title_similarity": "0.6708518",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hqt5nv1",
            "score": 2,
            "text": "Back when I was in college I decided to uber for new years eve so i coulr build a gaming computer. They had surge pricing back then. I made like $2000 in 8 hours in Orlando and never ubered again. The kinda people who take ubers are huge losers. Didn't want that in my car.",
            "title_similarity": "0.70354176",
            "sentiment_compound": 0.0459
        },
        {
            "id": "hqt6utx",
            "score": 1,
            "text": "But if I die I don’t have to pay anything",
            "title_similarity": "0.33513796",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hqt7ix6",
            "score": 1,
            "text": "In my state, Arizona, they will 100% give you a DUI if you are asleep while drunk in your car.",
            "title_similarity": "0.67854255",
            "sentiment_compound": -0.34
        },
        {
            "id": "hqt7kd3",
            "score": 1,
            "text": "You may be correct as to pricing.\n\nBUT, you're leaving out the emotional distress and drain of dealing with the UBER ecosystem, and the mental anguish that goes along with riding in someone else's car, and the extreme discomfort of being in a car with a stranger - who ...god forbid.... may try to make small talk.\n\nMy social skills can't handle those situations.  I would much rather die or go to jail.",
            "title_similarity": "0.6731107",
            "sentiment_compound": -0.9676
        },
        {
            "id": "hqt7zvf",
            "score": 1,
            "text": "TIL lowest common denominator knowledge like “don’t drink and drive” is now a “Life PRO Tip”\n\nThis sub sucks now.",
            "title_similarity": "0.5114871",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hqt8nv7",
            "score": 1,
            "text": "You can get about 150 Uber rides for just about what a retainer for an attorney would cost…………oh you are just getting started.",
            "title_similarity": "0.4812843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqt9hc1",
            "score": 1,
            "text": "OP if you've slept in your car to sober up multiple times you're probably still drinking too much/often",
            "title_similarity": "0.720488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqt9i27",
            "score": 1,
            "text": "Aaand, they don’t kill by-standers which is always a plus",
            "title_similarity": "0.44559228",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hqt9oci",
            "score": 1,
            "text": "Fuck Uber they took 100$ out of my account for food I never ordered",
            "title_similarity": "0.45939937",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hqtc101",
            "score": 1,
            "text": "Uber was specifically working on a service to detect if you are drunk and refuse you rides.",
            "title_similarity": "0.6042135",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hqtc6no",
            "score": 2,
            "text": "Even an Uber to 7-11 and back, even if it’s only a few blocks away, even if no one’s on the road, even if you can make that drive with your eyes closed, even if your only buzzed, don’t drive.",
            "title_similarity": "0.62589157",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hqtcqyv",
            "score": 2,
            "text": "Well, 2 out of 3 of those options are at my expense. Lol what has 2 thumbs and likes free? This person right here 👍👍\n\nPs I stayed in for NYE, lessened my chances of needing any of the above.",
            "title_similarity": "0.59216106",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hqtd239",
            "score": 1,
            "text": "Yeah but they're certainly not quicker! 😜😜😂",
            "title_similarity": "0.025454314",
            "sentiment_compound": 0.8335
        },
        {
            "id": "hqtdgf1",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.015857767"
        },
        {
            "id": "hqtdjxp",
            "score": 1,
            "text": "Life pro tip or common knowledge?",
            "title_similarity": "0.2525927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtdqsa",
            "score": 7,
            "text": "last NYE i got completely blotto'd... bartender told me to take the bus home.\n\nprobably wasn't that good of an idea. i hit seventeen cars and drove halfway through a building before it finally died.",
            "title_similarity": "0.64549327",
            "sentiment_compound": -0.7189
        },
        {
            "id": "hqtdshc",
            "score": 1,
            "text": "Also make SURE TO PUT YOUR KEYS IN THE BACK SEAT BEHIND DRIVER SEAT. \n\nIf they are in the ignition or within arms reach \n\nYOU MAY STILL BE CHARGED\n\n:NYC here",
            "title_similarity": "0.6219234",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hqtezp6",
            "score": 2,
            "text": "Years ago I hosted a few hosted New Years parties just so I didn’t have to worry about getting home or what not and informed guests to bring blow up mattresses and blankets and we’ll do a big sleep over. My ex has the pics. But it was cool we’d have the living room at the end of the night with bumping side by side blow up mattresses and spare room we could get a few in. People enjoyed it. Big adult slumber party.",
            "title_similarity": "0.7836313",
            "sentiment_compound": 0.8968
        },
        {
            "id": "hqtffxr",
            "score": 1,
            "text": "Even with surge pricing - it’s cheaper than a DUI!",
            "title_similarity": "0.433339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtfox5",
            "score": 1,
            "text": "If you need something like this to convince you not to drink and drive you shouldn’t be drinking",
            "title_similarity": "0.41906115",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hqtfzgo",
            "score": 2,
            "text": "Uber and Lyft have been so unreliable in my area since covid, I just stayed home because I can’t risk not being able to find a ride back home to my dog lol",
            "title_similarity": "0.7412825",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hqtgnld",
            "score": 2,
            "text": "I get why you are posting this, while also sad that for some people NOT driving drunk and getting killed may actually be a PRO tip.",
            "title_similarity": "0.59118545",
            "sentiment_compound": -0.7625
        },
        {
            "id": "hqthk55",
            "score": 1,
            "text": "Booze cruisers stay oppressed",
            "title_similarity": "0.38873214",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hqtikl3",
            "score": 1,
            "text": "A lot of places you can still get charged with a DUI even if you're just sleeping it off in your car. Be forewarned.",
            "title_similarity": "0.7002789",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hqtj6o9",
            "score": 1,
            "text": "You don't usually have to pay for your own funeral though...",
            "title_similarity": "0.43759078",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hqtjn8n",
            "score": 1,
            "text": "That’s all well and good when your town actually has Uber or Lyft, mine does not, so the chances of a cab being available on New Years Eve was next to none",
            "title_similarity": "0.6380445",
            "sentiment_compound": 0.4943
        },
        {
            "id": "hqtks7s",
            "score": 2,
            "text": "I can't afford any of them. Can't afford drinking either though so that doesn't really matter.",
            "title_similarity": "0.428859",
            "sentiment_compound": -0.0749
        },
        {
            "id": "hqtlbt5",
            "score": 1,
            "text": "Hmmm, slightly misleading. My mother's funeral didn't cost her a dime.",
            "title_similarity": "0.4746669",
            "sentiment_compound": -0.6003
        },
        {
            "id": "hqtlcyv",
            "score": 1,
            "text": "Also cheaper and more honest than regular cabs. Fuck regular cabs. Yeah let's just take 3 extra miles to get to the same location as the Uber.",
            "title_similarity": "0.6321534",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hqtmg3b",
            "score": 2,
            "text": "Where I live it was negative -32 last night… we don’t have Uber or Lyft and two taxi services that are hit and miss if they answer their phone. Getting drunk and trying to get home is so dangerous in the winter it’s not even worth it.",
            "title_similarity": "0.63076895",
            "sentiment_compound": -0.9073
        },
        {
            "id": "hqtmu9s",
            "score": 2,
            "text": "I read it fast and thought you were suggesting to use Uber instead of the hearse for carrying the body at a funeral.",
            "title_similarity": "0.57713425",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hqtn9cx",
            "score": 1,
            "text": "You don't even always realize when you're drunk. And the more you drink, the longer it takes to leave your system. \n\nMy brother was ten when an inebriated driver hit him in broad daylight. Imagine how worse it is at night. That MF only broke his arm thank goodness, but seriously, really think about how your actions effect children and families. I met a woman who lost her husband and baby from this.",
            "title_similarity": "0.6188489",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hqtorhn",
            "score": 1,
            "text": "All over my town are signs that say... DUI, you can't afford it.",
            "title_similarity": "0.37120706",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtr0he",
            "score": 1,
            "text": "Most people drive drunk over 80 times before getting caught.\n\n  \n\n\nYoure just not as clever as you think you are with \"facts\" like this.",
            "title_similarity": "0.54440534",
            "sentiment_compound": -0.3907
        },
        {
            "id": "hqtrlpv",
            "score": 2,
            "text": "Big shout out to David who helped me do exactly that last week. \n\nThanks for looking out David!",
            "title_similarity": "0.2999729",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hqtry8z",
            "score": 1,
            "text": "This guy over here assuming you can even find an Uber.",
            "title_similarity": "0.28298947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtscgh",
            "score": 1,
            "text": "Btw sleeping in your car drunk will still get you a DUI. Just a heads up really bad idea to tell people to do that… if you do that, do something that removes the keys from your person and not easily accessible that way you can prove you had no intent in operating the vehicle.",
            "title_similarity": "0.7103733",
            "sentiment_compound": -0.8566
        },
        {
            "id": "hqttd0w",
            "score": 2,
            "text": "We need stricter penalties for any bad driving. My friend’s parents were killed by a sober driver and he gets no sympathy. the asshole was on no sleep.\n\nover 90% of driving deaths involved 0% alcohol. we need to crack down on all unsafe driving and stop pretending that every accident involves alcohol when it’s less than 10%.\n\ni hate bad sober drivers more than good drunk drivers. they kill more people",
            "title_similarity": "0.5903707",
            "sentiment_compound": -0.981
        },
        {
            "id": "hqtthg9",
            "score": 2,
            "text": "Average DUI costs $10,000 after everything is said and done. A lot of which is from your skyrocketing vehicle insurance costs. Taking a helicopter home would be cheaper.",
            "title_similarity": "0.5749165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtu9of",
            "score": 1,
            "text": "Don’t have to worry about funeral costs if you’re dead",
            "title_similarity": "0.41438723",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hqtuqn2",
            "score": 1,
            "text": "People also need to understand that the next morning/ early afternoon after a long night out they can STILL get a DUI as well. BAC takes time to go down and people assume they can wake up and are operational to drive the next morning.\n\nRealistically, people should give it a full day before driving a vehicle. Also, if you choose to sleep in a vehicle make sure you are not in a driver seat and the keys are not within distance of you as a officer can still give you a DUI",
            "title_similarity": "0.7493726",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hqtuwc4",
            "score": 1,
            "text": "One would think DUIs would’ve gone down with the whole ride share thing coming about, but it seems we’re too dumb to avail ourselves of something readily available that’s safe for everyone.",
            "title_similarity": "0.54927826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtwc6s",
            "score": 1,
            "text": "$80 for a ten minute ride is less than a DUI, but….",
            "title_similarity": "0.49528322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqtyqyb",
            "score": 2,
            "text": "This reminds me of a cool thing this bar in rural Louisiana did about a decade ago: if you left your car in the parking lot and took a safe ride home instead of driving under the influence they'd put a free drink coupon under your windshield wiper.",
            "title_similarity": "0.76740557",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hqtyshf",
            "score": 1,
            "text": "If you are sleeping it off in your car, make sure to put your car keys in your trunk.\n\nPeople can and have been arrested for DUI while being in their car, engine off but keys are \"within reach\", in ones possession etc.\n\nKeys have to be in a place without easy access.",
            "title_similarity": "0.7339117",
            "sentiment_compound": -0.5202
        },
        {
            "id": "hqtzkj3",
            "score": 1,
            "text": "Know what’s even cheaper: staying home and going to bed.",
            "title_similarity": "0.67539775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqu0cqc",
            "score": 2,
            "text": "I don't drive after having anything more than one drink (and it would be like if we were at dinner with someone and I had one beer then sat around hanging out for 2 hours afterwards). That's not a matter of principle. I just have a low alcohol tolerance.",
            "title_similarity": "0.6475441",
            "sentiment_compound": 0.3666
        },
        {
            "id": "hqu13fs",
            "score": 2,
            "text": "I was driving to pick my girlfriend up from work, it was barely passed 9:30 pm and I make the turn coming into town and what do I see?\n\nA line up on the side of the road of probably 5 fire trucks, a few ambulances and a few cops cars all in front of a house...with a car sticking out the side of it...I'm expecting to hear about it on the local news, but I'm left to assume a drunk driver drove into someone's house.",
            "title_similarity": "0.6435944",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hqu2mo2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.015857767"
        },
        {
            "id": "hqu2n0n",
            "score": 1,
            "text": "Staying home and drinking is even cheaper.",
            "title_similarity": "0.6441802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqu4tqb",
            "score": 1,
            "text": "My Uber driver was definitely drunk last night and almost got into a crash several times in addition to missing several exits and delaying my trip. Stay safe out there.",
            "title_similarity": "0.6575501",
            "sentiment_compound": -0.1119
        },
        {
            "id": "hqu7cu7",
            "score": 1,
            "text": "Yeah, I thought this was clever too then my passenger threw up in my car...",
            "title_similarity": "0.5781212",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hqu7e1u",
            "score": 1,
            "text": "Yeah but I don't have to pay upfront for a DUI. \n\nEdit: Clarifying that this is total sarcasm, just in case",
            "title_similarity": "0.5247744",
            "sentiment_compound": -0.189
        },
        {
            "id": "hqu820g",
            "score": 1,
            "text": "They’re also cheaper than ambulances.",
            "title_similarity": "0.4331361",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqu8zvj",
            "score": 1,
            "text": "The sad thing is, this is advice that shouldn’t need to be told. It is only idiocy to operate a vehicle while intoxicated.",
            "title_similarity": "0.5046959",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hqudwzs",
            "score": 1,
            "text": "Also, in some US states, simply being in the driver’s seat of your car with the key on hand counts as having control of the vehicle and can get you a DUI. So if you decide to sleep in your car, make sure not to sleep in the driver’s seat.",
            "title_similarity": "0.76848567",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hqufefi",
            "score": 2,
            "text": "Us older folks call NYE “amateur night”...",
            "title_similarity": "0.37134972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqufpj4",
            "score": 1,
            "text": "Also people get DUIs the next morning, when they wake up and think they still aren't drunk.",
            "title_similarity": "0.5546564",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hquh5cz",
            "score": 2,
            "text": "This is great and all but 99% of the time for me there are no rides available or its a 4 hour wait and they may not show up. Better to plan ahead and find a dedicated driver than rely on cabs or Uber type rides",
            "title_similarity": "0.607478",
            "sentiment_compound": 0.1633
        },
        {
            "id": "hquokom",
            "score": 1,
            "text": "An 80 ride cost me $22,000 \nSober 2.6 yrs \nChanged my Life \nFor the better honestly, Grateful",
            "title_similarity": "0.6307578",
            "sentiment_compound": 0.836
        },
        {
            "id": "hquooth",
            "score": 1,
            "text": "IF ONLY THERE WERE A SOLUTION - A TRANSIT SYSTEM FOR THE PUBLIC MAYBE??? GOSH THIS PROBLEM CAME OUT OF NOWHERE",
            "title_similarity": "0.30356145",
            "sentiment_compound": -0.3712
        },
        {
            "id": "hquoq4v",
            "score": 1,
            "text": "This is not a LPT, this is common sense and if anyone doesn’t agree with this, reading it won’t change their mind. This shit really detracts from the site, don’t abuse the sub, this clearly isn’t what it’s for.",
            "title_similarity": "0.41429114",
            "sentiment_compound": -0.5893
        },
        {
            "id": "hqustyv",
            "score": 2,
            "text": "For anyone in Québec (and maybe Canada though I'm not sure) there is a group called the red nose operation, in french Opération Nez Rouge, and its a bunch of people just willing to help that you'll pass them your keys and they'll drive you home. The group is even sponsored by Desjardins (a bank) and you can leave them a donation that will get sent to a fund that your community supports and decides and I think you can tip them too. They're all volunteers and I think its pretty sweet what they do. The phone number is available on their website with what regions are covered\n\n\nhttps://www.operationnezrouge.com/en\n\nDo know they only do this during december though.",
            "title_similarity": "0.62185246",
            "sentiment_compound": 0.8604
        },
        {
            "id": "hqvbf40",
            "score": 1,
            "text": "r/RepostSleuthBot",
            "title_similarity": "0.09715702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqvgekg",
            "score": 1,
            "text": "Uber drivers in my area refuse to accept rides until the price goes up. It sucks. Rideshare is newer to our area and they have to get a commercial license so we have a huge lack of drivers. But drivers also need to realize they need to accept trips to keep people using the service.",
            "title_similarity": "0.6224087",
            "sentiment_compound": 0.431
        },
        {
            "id": "hqvhbgu",
            "score": 1,
            "text": "Yes but what if the uber driver is also drunk?",
            "title_similarity": "0.39668402",
            "sentiment_compound": -0.3071
        },
        {
            "id": "hqvi9a5",
            "score": 1,
            "text": "Most people charged with a DUI drive drunk at least 200 times before they get caught. \n\nThe repeat/pre-offenders who have decided it’s worth the risk are the biggest problem. \n\nAnyone who says they got pulled over & charged their first time is either lying to you, or themselves.",
            "title_similarity": "0.5534185",
            "sentiment_compound": -0.8905
        },
        {
            "id": "hqvjp8y",
            "score": 1,
            "text": "Paid $55 for an Uber last night which usually costs around $15. Shitty that they price gouge but it’s cheaper than a $10,000 dui",
            "title_similarity": "0.64023125",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hqvlhti",
            "score": 1,
            "text": "It may be common sense, but people still need to hear it every now and then.   Plus, OP’s post isnt hurting anybody.",
            "title_similarity": "0.42086798",
            "sentiment_compound": 0.438
        },
        {
            "id": "hqvrb7b",
            "score": 1,
            "text": "Yeah don't use lyft the driver will report you for damages you didn't make. Then make 150 bucks. Luckily my bank refunded me.",
            "title_similarity": "0.5855098",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hqvusxh",
            "score": 1,
            "text": "Working New Years, going home and crashing is cheaper than either.",
            "title_similarity": "0.5865011",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqvxl0d",
            "score": 1,
            "text": "But I don’t have to pay for my funeral",
            "title_similarity": "0.40020812",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hqwt3aj",
            "score": 1,
            "text": "Dont drink and drive is common sense.  Common sense goes out the window if youve had to many.",
            "title_similarity": "0.55296",
            "sentiment_compound": 0.0
        }
    ]
}