{
    "LPT Don't get overwhelmed by perfection or nice looking but arbitrary figures when shooting for goals. Do 17 pushups, save $138.93, read 1/3 of a chapter, but keep moving.\nWhen approaching tasks, errands, projects, etc., somehow, my instinct is to throw the thought of doing it at all out the window, rather than do what's possible or even just easy. The thought of not having time to completely clean my room, may deter me from making my bed, which would go a long way to make the room clean, inspiring me to actually finish it. \n\nI have been trying to get back into the gym regularly too. When I do make the trip, especially if I haven't been in a while and my usual reps are hard to achieve to the point of not achieving my initial goal, I can still say to myself \"Dammit, I went\". \n\nThat may sound a little pathetic and being content with mediocrity, but it's usually a step in the right direction far enough that I'll want to go the next day too. \n\nI've been putting away $75 a week for a few months. Times are tough right now, but instead of saying \"Eh, I just won't invest this week\" I'll put $25 away, even though it's miniscule. The value might change but the mindset does not. \n\nAs dumb as it sounds, I say to myself \"Something is something, and nothing is nothing.\" \n\nBecause truly, doing something incompletely, is better than doing completely nothing.\n\nEdit: I am truly humbled by everyone’s thoughts and feelings regarding my post. If one person takes one step closer toward their goals that makes me happier than I can put into words!": [
        {
            "id": "hwfym0h",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.7030138",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hwg8v5d",
            "score": 2,
            "text": "17 push ups? Lol ya right.",
            "title_similarity": "0.28690624",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwguw0e",
            "score": 0,
            "text": "Jordan Peterson talks about this a lot! Super cool to read it in your words, though! Keep on keepin on!",
            "title_similarity": "0.39008826",
            "sentiment_compound": 0.795
        },
        {
            "id": "hwgn6la",
            "score": 2,
            "text": "Thanks... I thought this was r/LifeProTips, not r/GetMotivated",
            "title_similarity": "0.39814803",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwgktxh",
            "score": 0,
            "text": "Holy shit. \n\nYes. This. All the way this. \n\nI always do things to rounded numbers. Its part of my ocd I think (actual ocd, not “oh my goodness Im so OCD!!). It doesn’t lead to anything too crazy except extra large tips for servers lol.",
            "title_similarity": "0.6940455",
            "sentiment_compound": -0.552
        },
        {
            "id": "hwggpbd",
            "score": 0,
            "text": "no more of this “whole” business, I want 5/8ths of the enchilada **and I want it NOW!**",
            "title_similarity": "0.5303565",
            "sentiment_compound": -0.2244
        },
        {
            "id": "hwg522t",
            "score": 8,
            "text": "Time to learn 1/3 new recipes.",
            "title_similarity": "0.38923782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgl4qi",
            "score": 1,
            "text": "r/usernamechecksout",
            "title_similarity": "0.11408198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwga9j7",
            "score": -7,
            "text": "Is finding an extra $1.07 to save really that daunting?",
            "title_similarity": "0.51972014",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hwg319t",
            "score": 16,
            "text": "This is a great LPT. ☺️",
            "title_similarity": "0.12671068",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hwg90wq",
            "score": 4,
            "text": "Thank you writing this.",
            "title_similarity": "0.16240649",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgiafc",
            "score": 2,
            "text": "Speaking of perfectionism, most people's pushups are done like complete shit and the number they do is totally arbitrary at that point. Look up how to do proper pushups on YouTube!",
            "title_similarity": "0.56759524",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hwg9xkn",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.06318783"
        },
        {
            "id": "hwhq25k",
            "score": 0,
            "text": "Anything worth doing is sill worth doing poorly.",
            "title_similarity": "0.4247915",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwghfqu",
            "score": 7,
            "text": "These are called SMART goals.\n\n* Specific (simple, sensible, significant).\r\n* Measurable (meaningful, motivating).\r\n* Achievable (agreed, attainable).\r\n* Relevant (reasonable, realistic and resourced, results-based)\n* Time bound (time-based, time limited, time/cost limited, timely, time-sensitive).",
            "title_similarity": "0.3755027",
            "sentiment_compound": 0.8842
        },
        {
            "id": "hwgirat",
            "score": 1,
            "text": "One of my favorite quotes:\n\n\"Don't let perfect be the enemy of good.\"\n\nChange, especially lasting change, is usually incremental and occurs over long periods of time. Don't be discouraged because it's not perfect. Better is fantastic and many times just trying is enough.",
            "title_similarity": "0.69637346",
            "sentiment_compound": -0.0372
        },
        {
            "id": "hwgl4e5",
            "score": 1,
            "text": "Smoke Nine Hundred & Ninety-Nine Blunts",
            "title_similarity": "0.16510345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgrru2",
            "score": 1,
            "text": "Strange words, coming from /u/Smoke1000Blunts \n\nLike, exactly 1000? Will you be happy if you can only smoke 937 blunts? /s\n\nAll jokes, the dichotomy just stuck me as funny. =)",
            "title_similarity": "0.5342305",
            "sentiment_compound": 0.897
        },
        {
            "id": "hwgmjyj",
            "score": 2,
            "text": "Op’s username does not check out",
            "title_similarity": "0.26240072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgeho3",
            "score": 3,
            "text": "Don’t let perfect be the enemy of good.",
            "title_similarity": "0.41676044",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwgiiva",
            "score": 5,
            "text": "so much this. I really get annoyed when people say stuff like they are sad becasue Betty White didnt make it to 100... Like isthat all you can contribute to the conversation? She lived to be 99 is is loved around the world. Get some perspective yo.",
            "title_similarity": "0.61593664",
            "sentiment_compound": 0.4445
        },
        {
            "id": "hwgd0kc",
            "score": 4,
            "text": "Bonus tip: create a simple spreadsheet and record your progress. Today it's 17 pushups but what will it be in 2 weeks? 20? That record will give you a reason to keep going.",
            "title_similarity": "0.62634504",
            "sentiment_compound": 0.6199
        },
        {
            "id": "hwgk054",
            "score": 3,
            "text": "Thank you mr. smoke precisely 1000 blunts",
            "title_similarity": "0.24786271",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgke7j",
            "score": 5,
            "text": "Lose the \"as dumb as it sounds\" and \"that may sound a little pathetic\" qualifiers. You have it right. Anyone pursuing personal growth eventually has to accept this principle. In fact, there are a hundred idioms based on it. For instance: \"The perfect is the enemy of the good (enough)\"",
            "title_similarity": "0.6709277",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hwgz1y9",
            "score": -22,
            "text": "I was eating 160g protein and doing perfect form pushups all the time for a while. Could never get past 7 or 8 in a row. Genes incompatible with decent muscle growth I guess since I did everything right. Improvement from being able to do 0 start of that year at least.",
            "title_similarity": "0.56647575",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hwge4zj",
            "score": 7,
            "text": "17 push ups?  Who am I, Jack LaLanne?",
            "title_similarity": "0.32292208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwga7dq",
            "score": 8,
            "text": "I agree with the advice but I always listen to anyone called smoke1000blunts!",
            "title_similarity": "0.42355946",
            "sentiment_compound": 0.2598
        },
        {
            "id": "hwg9zjb",
            "score": 10,
            "text": "Me: \"i must do exactly 20 push ups or i'll die\"",
            "title_similarity": "0.39440173",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hwgbzjv",
            "score": 18,
            "text": "\"Something is something and nothing is nothing\" thanks for that",
            "title_similarity": "0.17645702",
            "sentiment_compound": 0.2594
        },
        {
            "id": "hwggiyt",
            "score": 52,
            "text": "You might like r/nonzeroday",
            "title_similarity": "0.29138005",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgwkb1",
            "score": 34,
            "text": "\"The steps we take don't need to be big, they just need to be in the right direction.\"\n\n-Jemma Simmons, Agents of Shield",
            "title_similarity": "0.5426008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgbcfg",
            "score": 40,
            "text": "I have an extremely perfectionist mindset on this. I've always said \"If I can't do all of it, I won't do any of it\" and I've been slowly breaking myself from that behavior.",
            "title_similarity": "0.61971176",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hwgk2jh",
            "score": 48,
            "text": "Numbers are easy to communicate but they mask the real goal. Sometimes I can do 100 push ups. Sometimes I can do 150. But sometimes I can only do 50. Instead of hanging your success on an arbitrary number and setting yourself up for failure, make your goal a mindset.\n\nWhat is your goal? Better health? That's vague but a great place to start. Break it down. Here's where people focus on numbers. I'm only going to eat x calories and do x pushups. I plan to lose x pounds by x date. Even if you did everything perfectly, doesn't mean you will make your goal and it likely means you will struggle with maintaining it because you're forcing yourself to meet arbitrary numbers when your body is trying to tell you not today.\n\nInstead make your goals specific to mentality. I will try to make one healthy choice each meal. I will try to do as many pushups as I can each day. I will listen to my body, not over exert myself, and hold myself accountable to maintain these habits.\n\nInitially it's harder. We aren't used to achieving goals this way. We are used to pushing ourselves or bsing ourselves. Getting there through the power of self hate alone and then losing it all as we spiral back down. But as you practice the approach of doing what you can as you can, you see progress that didn't hurt to achieve. It was exactly at your pace that you set.",
            "title_similarity": "0.7757181",
            "sentiment_compound": 0.9263
        },
        {
            "id": "hwggrv6",
            "score": 164,
            "text": "My doctor introduced me to the \"80%\" solution. If my exercises hurt so much I want to stop doing them, stop trying so hard to give 100% effort every time, but instead just give 80% . It's nearly as effective and far more effective than 0%",
            "title_similarity": "0.6793383",
            "sentiment_compound": 0.7861
        },
        {
            "id": "hwgcy6t",
            "score": 72,
            "text": "I read a post somewhere by a student that said her professor said \"anything worth doing is worth doing halfway.\" And as a recovering perfectionist, it's been my mantra ever sense.",
            "title_similarity": "0.5370747",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hwg8hen",
            "score": 296,
            "text": "Perfectionists (like me) defeat ourselves by not starting if we can't do it \"all\" or \"right\" or \"wholly\"... thank you for this reminder!",
            "title_similarity": "0.6590274",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hwg99wq",
            "score": 500,
            "text": "If a task is worth doing, it's worth half-assing.",
            "title_similarity": "0.41169757",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwg6vkx",
            "score": 104,
            "text": "I can’t even keep the volume on odd numbers, man… this would kill me",
            "title_similarity": "0.48025447",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hwg3k71",
            "score": 1032,
            "text": "I never knew how bad I needed to hear this",
            "title_similarity": "0.40083438",
            "sentiment_compound": 0.431
        },
        {
            "id": "hwg8kx7",
            "score": 449,
            "text": "One step is still *one step* more than no steps, and that is still progress.",
            "title_similarity": "0.32927442",
            "sentiment_compound": 0.0828
        },
        {
            "id": "hwgg7u3",
            "score": 603,
            "text": "Don't let perfect be the enemy of good. \n\nMy grad school advisor was a garbage human, but she did drill that into me, and it's good advice.",
            "title_similarity": "0.64393497",
            "sentiment_compound": 0.3718
        },
        {
            "id": "hwfzk34",
            "score": 3708,
            "text": "I really like this. I used to struggle much more with putting things off until I could completely finish the task. I have been much more productive since I started being happy with chipping away at goals. It’s good to be reminded to celebrate the small victories but also to take the time to accomplish them. Thanks for sharing this!",
            "title_similarity": "0.67515093",
            "sentiment_compound": 0.9548
        },
        {
            "id": "hwgb0ti",
            "score": 4,
            "text": "...heh, my goals are more like \"stop reading after 1/3 of a chapter and get some f'ing sleep\"",
            "title_similarity": "0.57950217",
            "sentiment_compound": -0.0735
        },
        {
            "id": "hwgbwtf",
            "score": 9,
            "text": "anything worth doing is worth doing poorly",
            "title_similarity": "0.39683",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgd5f9",
            "score": 2,
            "text": "I’ve become a big fan of “a little goes a long way”",
            "title_similarity": "0.19615713",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hwgddef",
            "score": 1,
            "text": "This really reminds of the phrase \"if its worth doing, its worth doing poorly.\"",
            "title_similarity": "0.3740328",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwge5ew",
            "score": 1,
            "text": "Like many are saying, thank you for this.",
            "title_similarity": "0.17016715",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hwggn0i",
            "score": 6,
            "text": "smoke just 1 less cigarette a day. wait 2 and half hours before your next one, instead of 2 hours.",
            "title_similarity": "0.44249073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwghn9x",
            "score": 1,
            "text": "Trends and progress are what matters. Only can do 1 push up? Awesome! Do 1 until you can do 2. You've trended up and made progress.",
            "title_similarity": "0.49217805",
            "sentiment_compound": 0.8777
        },
        {
            "id": "hwghut5",
            "score": 4,
            "text": "I also have heard this sentiment put a different way which I really like, \"Done is better than perfect\"",
            "title_similarity": "0.49769235",
            "sentiment_compound": 0.8553
        },
        {
            "id": "hwghyf2",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.06318783"
        },
        {
            "id": "hwgi4j2",
            "score": 1,
            "text": "my dude 1 rep is infinitely more than 0",
            "title_similarity": "0.22944805",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgi65s",
            "score": 1,
            "text": "I needed to hear this!",
            "title_similarity": "0.16125569",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgifgl",
            "score": 1,
            "text": "This is something my therapist told me. \"Done is better than perfect\" but the original rhymes: \"Feito é melhor que perfeito\". I usually struggle with starting or continuing something, even if it's something I love, because it won't be perfect, or good enough etc. \n\nShe told me: Perfection doesn't exist; you will always find something that \"could be better\". So instead of having nothing due to fear of failure, have something you can improve.",
            "title_similarity": "0.7858521",
            "sentiment_compound": 0.9709
        },
        {
            "id": "hwgirtv",
            "score": 3,
            "text": "This has always been an issue for me. Always wanting to hit that 10th rep. Run that 1 mile. Do that 25 push ups. Save that 2500 dollars. My life would be so much easier and I'd probably be so much further ahead in life too if I was a bit more mentally flexible.",
            "title_similarity": "0.6696887",
            "sentiment_compound": 0.8155
        },
        {
            "id": "hwgiv0m",
            "score": 19,
            "text": "Every morning, while I'm drinking my coffee, I'll write down what I want to accomplish that day, assigning a point total to the total work of each task\n\nEven if I don't get a whole task done I'm getting partial points. \n\nToday was a good day, 12/13 possible points. With partial credit for only walking the dogs partway around the block. \n\nThere are also low point days though. 2/15 happens. But you still get partial credit. \n\nBefore you critique saying it doesn't matter if the points don't matter, please think about how much those fake internet points matter.",
            "title_similarity": "0.7133198",
            "sentiment_compound": -0.2418
        },
        {
            "id": "hwgivbf",
            "score": 1,
            "text": "love your post! I try to do this when i’m dreading starting a task. like if I know I need to clean the kitchen but really don’t feel like it, I start by just going out there and putting away spices, putting dishes in the sink, etc. I tell myself I just have to do a little, maybe a minute or 2, but it makes the mess feel more manageable. and I feel less overwhelmed about going back to it. \n\ndifferent but related- when I don’t feel like starting a work task (or an assignment back when I was in grad school) I will at least just open it up, read the directions, write some headings, etc. try to get myself in the right direction. I often find myself avoiding something simply because gathering the materials and starting seems like a lot. but if I get that out of the way initially, it feels like it won’t be so bad when I go back to it.",
            "title_similarity": "0.8160614",
            "sentiment_compound": 0.4518
        },
        {
            "id": "hwgjgbk",
            "score": 1,
            "text": "I think like this when i need to clean house. As long as i start somewhere i usually end up doing more than i thought i would do",
            "title_similarity": "0.68423104",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwgji3y",
            "score": 1,
            "text": "I'd rather read an article by you than the \"ten steps to meditate\" BS. lol",
            "title_similarity": "0.5888314",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgjjhe",
            "score": 1,
            "text": "Thanks for the great advice. I need to try and remember this.\n\n Just recently I noticed things have changed for me now, and I can only save $100-$150 per month. A part of me wanted to be like, oh what's the use! But, no that's not true. Even though the amount isn't great, maybe it will trigger a change in behaviour... skip this non-essential item at the store, etc. And you know what? Those savings came in handy... I had a surprise emergency that led to a very expensive vet visit. That small little pile of savings saved my ass.",
            "title_similarity": "0.7307577",
            "sentiment_compound": -0.8435
        },
        {
            "id": "hwgjuas",
            "score": 1,
            "text": "17 push-ups! You're aiming high! I go for 10 half push-ups, works for me",
            "title_similarity": "0.44527388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgk6xg",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.06318783"
        },
        {
            "id": "hwgk9pc",
            "score": 1,
            "text": "\"No zero sum days\"",
            "title_similarity": "0.12697396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgk9u1",
            "score": 1,
            "text": "Perfection is the Enemy of Progress",
            "title_similarity": "0.38121942",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwgk9vy",
            "score": 122,
            "text": "If you’re bored, look into tiny habits. He’s got some great advice. He says if you’re trying to start a new habit, anchor it to something you already do. In your example, if you’re just starting push-ups saying “tomorrow I’m going to start by doing twenty pushups”  anchor it to something. “Tomorrow while I’m waiting for my coffee to brew I’m going to get into the push-up position”. And instead of listing a big ambitious first goal, just list the start of the goal, the thought process being that if you start the motion, the rest will follow. Hence the “I’ll get in the push-up position”. Once you’re there, you’ve gotten past the hardest part. Years ago, when I was trying to get into bullet journaling, I said “When I start my computer in the morning I’ll take my notebook out of my bag and open it”. For me, it worked. Once I took the time to open it, I was more likely to start filling it out.",
            "title_similarity": "0.73775274",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hwgkhnc",
            "score": 1,
            "text": "this is how i need to approach learning new skills or hobbies in my free time. i think i can never learn spanish. i could never learn web design, that’s so much work and looks way too hard to build a beautiful website, or understand how a website is built. i can’t learn to play this keyboard that would be so hard to read music and play an entire song. i can’t paint a sweet graffiti mural from start to finish. this mindset has all but crippled my creativity and passion to learn new things. my life is my day job and trying to stay healthy",
            "title_similarity": "0.73347026",
            "sentiment_compound": 0.954
        },
        {
            "id": "hwgl77v",
            "score": 1,
            "text": "Some days we do more, some days we do less or even none but that’s ok as long as we have the intention to keep going.\n\nI struggle with ADHD so on a bad day, I just wash a couple of dishes instead of forcing myself to do it all at once and this may go on for days but that’s ok, I do what I can every day is all that matters.",
            "title_similarity": "0.709116",
            "sentiment_compound": -0.8828
        },
        {
            "id": "hwgl7il",
            "score": 1,
            "text": "Anything worth doing is worth doing badly.",
            "title_similarity": "0.38449436",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwglhxp",
            "score": 1,
            "text": "Currently using this mindset while resealing my patio concrete. Moved everything to a corner and sprayed it down. Came back the next day applied the sealer. Moved everything back to where it belongs and washed the remaining part today. Will finish the job tomorrow.\n\nDoesn't matter that it's taken almost a week. Slowly checking things off my to do list is just as nice, whether I do it all at once or over a period of time.",
            "title_similarity": "0.56641334",
            "sentiment_compound": 0.4071
        },
        {
            "id": "hwglx2j",
            "score": 1,
            "text": "Starting on Monday is the worst offender",
            "title_similarity": "0.3774926",
            "sentiment_compound": -0.765
        },
        {
            "id": "hwglxgl",
            "score": 1,
            "text": "Nope. Can't do it. 5s or evens. Makes me uncomfortable thinking about it",
            "title_similarity": "0.41768062",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hwgm2d5",
            "score": 2,
            "text": "This is very true and I find that people with this mindset are happier. It’s okay to be content with less than perfection, and thank you for this reminder , I truly needed it .",
            "title_similarity": "0.42920002",
            "sentiment_compound": 0.9452
        },
        {
            "id": "hwgm4hg",
            "score": 1,
            "text": "Start where you are, go as far as you can.  Wherever you end up is your (temporary) finish line.",
            "title_similarity": "0.3388787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgmdig",
            "score": 2,
            "text": "To anybody reading this thread wondering about the gym and not hitting \"your reps\":\n\nGet on an actual program. \n\nIt's impossible to follow a proven program, eat at a surplus, and get weaker. \n\nSometimes you just get stronger at a slower pace than you wanted.",
            "title_similarity": "0.7313887",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwgme6m",
            "score": 1,
            "text": "Wise advice. At the beginning stages of having my wife leave me this past summer my therapist recommended taking things one step at a time. I was so overwhelmed at the thought of what the deterioration of my marriage and the domino effect of everything to likely come. To say I was devastated would be putting it lightly, but slowly chipping away at things has at least made it a little more manageable.",
            "title_similarity": "0.6691308",
            "sentiment_compound": 0.0408
        },
        {
            "id": "hwgmekc",
            "score": 2,
            "text": "If I can't start this project right at 7:00 than I'm starting at 8:00!",
            "title_similarity": "0.53736496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgmhz8",
            "score": 1,
            "text": "It's tough to be motivated when you feel like you can't achieve your goals. But don't let that stop you – just do what you can and keep moving forward. save $138.93, read 1/3 of a chapter, but keep moving. And if you slip up, don't beat yourself up – just start fresh the next day.",
            "title_similarity": "0.7924894",
            "sentiment_compound": 0.9018
        },
        {
            "id": "hwgmmtg",
            "score": 1,
            "text": "This. I'm learning the piano by making myself practice for at least 20 minutes a day. Sure it's really slow going but I'm at least finally working on a longtime goal of mine. I even have a little table calendar where I write my daily practice time to keep track of my practice.",
            "title_similarity": "0.5618278",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hwgn0c2",
            "score": 1,
            "text": "So much this! I have been a perfectionist all my life. I don't start something until I know I can do it perfectly, I don't move onto the next step until I've done the previous step perfectly, etc. And it's cost me so much. I'm practicing forcing myself to do things even if they're not perfect, and to move on even if I'm not satisfied, and I'm so much more productive it's amazing!",
            "title_similarity": "0.699942",
            "sentiment_compound": 0.9046
        },
        {
            "id": "hwgn0dt",
            "score": 1,
            "text": "1 is greater than 0 .",
            "title_similarity": "-0.009148583",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgn4jk",
            "score": 1,
            "text": "Those numbers broke my brain. I can't pump gas if it's uneven, I have to have the volume on my TV in increments of 5. If I lost a finger I might have to lose the same one on the other hand or I'd sweat the rest of my life.",
            "title_similarity": "0.6932727",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hwgn8ar",
            "score": 1,
            "text": "I'm lucky to save 100 bucks a week.",
            "title_similarity": "0.30859354",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hwgndv6",
            "score": 3,
            "text": "I've been doing a shitload of pushups (by my out-of-shape standards) since the first of the year.  Like 40 per day.  This is after many years of zero pushups.\n\nI told my co-worker, and she said *\"Why? Doing a shitload of pushups doesn't really do anything! You're not going to get any results just doing pushups.\"* and it was just SO disheartening.  I'm still going, but my numbers are getting smaller.",
            "title_similarity": "0.6511527",
            "sentiment_compound": -0.32
        },
        {
            "id": "hwgnfbm",
            "score": 1,
            "text": "10 pushups is nothing and you are going to want to do more at some point but 10 pushups every day makes a difference",
            "title_similarity": "0.5983746",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hwgnioj",
            "score": 2,
            "text": "Maybe only smoke 700 blunts, it's not as great as 1000, but it's more than 0!",
            "title_similarity": "0.45520085",
            "sentiment_compound": -0.3483
        },
        {
            "id": "hwgnquj",
            "score": 1,
            "text": "Day is ruined.  Only saved $137.22 damnit!",
            "title_similarity": "0.38179997",
            "sentiment_compound": -0.6114
        },
        {
            "id": "hwgnss9",
            "score": 1,
            "text": "Yep. Don’t let the perfect be the enemy of the good.",
            "title_similarity": "0.4460201",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hwgnunk",
            "score": 2,
            "text": "Says Smoke1000blunts.. we know what you're saving for mister lol",
            "title_similarity": "0.32204965",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgnxly",
            "score": 2,
            "text": "This is exactly what mindset that I tried to apply recently. Thanks for bringing this up cause now I feel reassured.\n\n\nAnd I can assure you, just start small. Start where you feel okay. Don't overdo or you'll do the same mistakes like I did; overdoing it, felt overwhelm, stepped out, and repeat again.\n\n\nRemember, habits build up overtime. You'll stack up more and more, you can imrove along the way.\nIt is a journey, inhale every moment of it. Be patient, you'll reach you destination.\n\nEven if you do mistakes, you can refactor that. That' it.",
            "title_similarity": "0.6735486",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hwgo6k0",
            "score": 2,
            "text": "And stop being kind to sh!tty people.",
            "title_similarity": "0.33236164",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hwgo6td",
            "score": 2,
            "text": "Finally, some good fucking LPTs.",
            "title_similarity": "0.27332506",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwgo818",
            "score": 1,
            "text": "Keep moving forward.\nThat's been my motto for a few years now and it has kept me going through all the tough times. But now I am in a better job in a new city happy. All because I just kept moving forward",
            "title_similarity": "0.5436088",
            "sentiment_compound": 0.8641
        },
        {
            "id": "hwgobzj",
            "score": 6,
            "text": "Will 17 push ups a day have any effect on my body over a year?",
            "title_similarity": "0.4290135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgoetq",
            "score": 1,
            "text": "Dude\n\n\n\nThank you",
            "title_similarity": "0.098982275",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgoixd",
            "score": 1,
            "text": "Any progress is progress.",
            "title_similarity": "0.13822028",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hwgonum",
            "score": 1,
            "text": "I wanted to add a comment but there was a perfect 100 when I visited the thread.",
            "title_similarity": "0.4227814",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hwgoy30",
            "score": 5,
            "text": "Maybe somewhat related, but I always set my alarm for odd times (0603, 0607, 0619)... just never 5 minutes apart to keep it from coinciding with the snooze. It seems to make me feel better both going to sleep and seeing the time when I wake up. No need to be perfect!",
            "title_similarity": "0.7865484",
            "sentiment_compound": 0.3274
        },
        {
            "id": "hwgoy4t",
            "score": 1,
            "text": "The really important part here is how you said you’ll be likely to go again the next day. If you keep going, even if you’re not accomplishing a lot at first, you’ll eventually develop that habit that will pull you through the rest of the days. What you don’t want to do is go so hard that you don’t want to do it the next day. That’s how failure happens. Go slow at first.",
            "title_similarity": "0.71267843",
            "sentiment_compound": -0.3555
        },
        {
            "id": "hwgp0lx",
            "score": 2,
            "text": "My grandfather used to say, \"Son, how do you eat a Buffalo?... I don't know, but its certainly one bite at a time!\"\n\nI feel like this applies here.",
            "title_similarity": "0.47902292",
            "sentiment_compound": 0.7678
        },
        {
            "id": "hwgpe2p",
            "score": 1,
            "text": "Yes. Whatever you think you *need*, like half of that will get you going. Also, the \"backend\" almost doesn't matter. Take a look at the bathrooms, like, anywhere for majorly successful companies.",
            "title_similarity": "0.6143937",
            "sentiment_compound": 0.9
        },
        {
            "id": "hwgpvvt",
            "score": 1,
            "text": "My whole attitude towards saving money changed when I shifted from “I should save $500 a month” to “I’ll save as much as I can every month”. So often I’d not be able to move exactly $500 to savings and so I moved $0. Now, some months it’s $78, some it’s $1,236. Much more effective.",
            "title_similarity": "0.60948974",
            "sentiment_compound": 0.8687
        },
        {
            "id": "hwgpwa9",
            "score": 11,
            "text": "Many people struggle with starting things because of the first step. \n\nTrue, the first step in any endeavor is important. \n\nHowever, the NEXT STEP is always the most important step. The first step is useless if you never take a next step. And when doing nothing, the next step may actually be the first step. \n\nMove forward, no matter how slow. “No zero days” is a thing I’ve seen thrown around and I love it. \n\nTry thinking of every task or endeavor like how you eat. Eating is natural to most people. Do you shove the whole meal in your mouth all at once? Generally no, you eat it little bit by little bit. Manageable chunks. \n\nBreak everything into manageable chunks and tackle many smaller tasks rather than one huge task. \n\nBut no matter what, keep moving forward.",
            "title_similarity": "0.7037901",
            "sentiment_compound": 0.7094
        },
        {
            "id": "hwgpwxq",
            "score": 1,
            "text": "Truly wise advice",
            "title_similarity": "0.17102697",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hwgq1ce",
            "score": 2,
            "text": "dude I get it, you are still struggling to smoke1000blunts. I believe in you🙏🏻thanks for the lpt, really needed to hear this",
            "title_similarity": "0.5879444",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hwgq9ab",
            "score": 1,
            "text": "Thank you, I needed this",
            "title_similarity": "0.18932912",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgq9d7",
            "score": 1,
            "text": "I'm going to have to use this with my high school students. So many of them don't get that growth and learning is a long process of small steps and not one huge jump.",
            "title_similarity": "0.6472353",
            "sentiment_compound": -0.4847
        },
        {
            "id": "hwgqchm",
            "score": 2,
            "text": "Smoke 798 blunts, don't feel the need to do the full 1000",
            "title_similarity": "0.52959156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgqk2a",
            "score": 1,
            "text": "Show up and get to work. You've done 90% of the hard part",
            "title_similarity": "0.27284682",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hwgqlt4",
            "score": 1,
            "text": "If a job's worth doing, it's worth doing badly.",
            "title_similarity": "0.4068449",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwgqoxd",
            "score": 1,
            "text": "Thank you for this",
            "title_similarity": "0.06322926",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgqqfj",
            "score": 1,
            "text": "This rh is what a true lpt is all about, we need more kings like this dude",
            "title_similarity": "0.47238195",
            "sentiment_compound": 0.6786
        },
        {
            "id": "hwgqumu",
            "score": 1,
            "text": "Progress, not perfection! Or: perfect is the enemy of good.",
            "title_similarity": "0.40883985",
            "sentiment_compound": -0.6234
        },
        {
            "id": "hwgr2bp",
            "score": 1,
            "text": "Struggling with forcing myself to finish college work at a specific time to have the rest of the day for myself. I needed to hear this, thank you.",
            "title_similarity": "0.66006726",
            "sentiment_compound": 0.0194
        },
        {
            "id": "hwgr5v9",
            "score": 1,
            "text": "having an attention disorder is so annoying, so now I only do half the dishes, one load of laundry, one homework problem. Eventually it gets done, but now I start earlier and mope less about it",
            "title_similarity": "0.7375444",
            "sentiment_compound": -0.8199
        },
        {
            "id": "hwgr7xf",
            "score": 1,
            "text": "Username does not check out",
            "title_similarity": "0.22535843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgr8xd",
            "score": 1,
            "text": "Needed to read this today",
            "title_similarity": "0.30314115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgr9v6",
            "score": 1,
            "text": "I read 1 chapter a day and in a week ive made tons of progress.",
            "title_similarity": "0.27792114",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgrcee",
            "score": 2,
            "text": "I just did 18 push ups today. Started with one, adding one every day or two.\n\nSame with yoga, I've been doing it every day. Some days I give in after ten minutes but always rolling out the matt keeps me consistent.",
            "title_similarity": "0.53913367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgre1y",
            "score": 1,
            "text": "Always remember, continuous improvement is better than delayed perfection.",
            "title_similarity": "0.46550423",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hwgrer7",
            "score": 1,
            "text": "If it’s worth doing, it’s worth half assing. \n\nBetter to half ass it than not do it at all",
            "title_similarity": "0.5330086",
            "sentiment_compound": 0.296
        },
        {
            "id": "hwgrllj",
            "score": 1,
            "text": "Incremental change is lasting change",
            "title_similarity": "0.28760248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgrpsv",
            "score": 1,
            "text": "Do half-ass or do not half-ass. There is no try.",
            "title_similarity": "0.30759686",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwgrsxy",
            "score": 1,
            "text": "Anything worth doing is worth doing shittily",
            "title_similarity": "0.37829792",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgrvk9",
            "score": 2,
            "text": "Join us at r/bogleheads for investment ideas ( hint: we love saving money )",
            "title_similarity": "0.51108825",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hwgrzd6",
            "score": 1,
            "text": "Thi sis interesting—magazine covers deliberately us things like “7 Way to X” or “13 Secrets to Success.” Or “143 Gift Ideas.” Because people will believe those are more credible that even numbers or round numbers (like 25).\n\nMy husband’s family is one where you give money for weddings. So when my husband got to the point that he was writing checks to brides & grooms, he started making them out in numbers like these. $159.27, etc.\n\nOne of his cousins told us that her mom had asked her how much they’d received as gifts. The bride balked a bit, and refused to break it down, but she finally told her mom they’d received, oh,, $9,609.27. Her mom asked, “Who gave you 27¢?!” When she heard it was my husband, she said, “Oh, of course.”\n\nWhen we got married, the mom seized the opportunity to write a check for $138.43. We found it hilarious.",
            "title_similarity": "0.66660595",
            "sentiment_compound": 0.903
        },
        {
            "id": "hwgs4bj",
            "score": 1,
            "text": "Gotta remember Running water never gets stale!",
            "title_similarity": "0.34759748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgs6qc",
            "score": 1,
            "text": "I’m growing out of this at the moment. It really makes a difference in the long run. They say it in my classrooms and at work, “showing up late or making an effort to show up is better than not coming at all.” Though not inspiring at first, it makes sense later. Even if you can do it all at once, that activity can domino itself and create a overwhelming feelings towards a different activity. Take it slow, there is no rush as long as you go to work or have a livable salary",
            "title_similarity": "0.7267447",
            "sentiment_compound": 0.2887
        },
        {
            "id": "hwgs6vn",
            "score": 2,
            "text": "LPT IS BACK, BABY",
            "title_similarity": "0.13156885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgs83x",
            "score": 1,
            "text": "\nThis was needed for me today. \n\nThank you.",
            "title_similarity": "0.3091187",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgs8ks",
            "score": 1,
            "text": "More succinctly: Don't strive for perfection, strive for progress.",
            "title_similarity": "0.48865873",
            "sentiment_compound": -0.0511
        },
        {
            "id": "hwgsch8",
            "score": 2,
            "text": "I tried to smoke 1000 blunts but only got like 2% of the way. Progress",
            "title_similarity": "0.4279717",
            "sentiment_compound": 0.7876
        },
        {
            "id": "hwgsdbm",
            "score": 1,
            "text": "Yup, good enough is more realistic and better for your mental health.",
            "title_similarity": "0.41640127",
            "sentiment_compound": 0.7239
        },
        {
            "id": "hwgsiv0",
            "score": 1,
            "text": "There's no way this will stop me from doing pushups in sets counting down in increments of 5 from wherever I start.",
            "title_similarity": "0.5400063",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hwgskoo",
            "score": 3,
            "text": "And keep your finances known.  Go back the previous month in bank statements and see what you're paying for.  Then ask, do you need it?  Then ask if you want it.  Weigh it out from there.",
            "title_similarity": "0.49385214",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwgspel",
            "score": 1,
            "text": "I always tell people your body has no idea how far a mile is, but it knows effort over time. If you’re a runner having a tough day, don’t get wrapped up in trying to stay on pace for your weekly mileage - that’s missing the bigger picture.",
            "title_similarity": "0.72788936",
            "sentiment_compound": -0.631
        },
        {
            "id": "hwgsrxq",
            "score": 1,
            "text": "“The amount may change, but the mindset hasn’t.” \n\nI need a new motivational poster with this on it. Love it.",
            "title_similarity": "0.64437675",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hwgsscw",
            "score": 1,
            "text": "Eat dem 13 pizzas",
            "title_similarity": "0.2462898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgstjk",
            "score": 24,
            "text": "I call this principle 'fake rules'. As someone who is very anal about doing things 'precisely' and gravitates towards round numbers, I always have to remember to not let my life be controlled by fake rules. \n\nI personally define fake rules as any imaginary restriction which isn't actually based on any difference in outcome. If you're supposed to do something at 3 PM and it's 3:07, that's ok. If it's only a commitment to yourself, that deadline is a fake rule. Start at 3:08. Start at 3:21. \n\nRoutines don't need to be stuck to precisely. If I don't feel like, say, playing piano, I can still go sit down and just play something comfortable and easy. The need to  warm up is a fake rule. Practicing with a metronome is a fake rule too. Yes, those things help and will make you better, but not playing at all will make you worse than just spending 10 minutes going over something you already know.\n\nThe idea of doing things 'right' is very appealing to a certain kind of logic-loving brain, but the truth is that if you want to make progress the only way to do something wrong is to not do it at all. \n\nMotivation comes and goes, and on days when it's short on supply, it's okay to just do what you can. Hold out until the energy returns. It always does.",
            "title_similarity": "0.75685716",
            "sentiment_compound": 0.7056
        },
        {
            "id": "hwgsvj6",
            "score": 1,
            "text": "So very true!! You said it perfectly!! The old saying something is better than nothing is completely accurate. It’s much better to have $138 in savings than zero, it’s better to finish your weekly workout routine on Wednesday of the following week than just not finish. I agree 100%",
            "title_similarity": "0.65066624",
            "sentiment_compound": 0.9462
        },
        {
            "id": "hwgsvnd",
            "score": 2,
            "text": "1 push up is better than no push ups. And by the time you do 1, you'll probably find it in you to do 2.",
            "title_similarity": "0.5497297",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hwgtf66",
            "score": 1,
            "text": "True, small goals much more motivating because you can realistically achieve them, bigger goals can be achieved by breakng them up into smaller ones. \n\nWhen you have one big goal, it's much harder to take action because it feels overwhelming and taking action is the most important step.",
            "title_similarity": "0.61846864",
            "sentiment_compound": 0.8119
        },
        {
            "id": "hwgtj82",
            "score": 1,
            "text": "Don't let perfect be the enemy of good.",
            "title_similarity": "0.41653872",
            "sentiment_compound": -0.5571
        },
        {
            "id": "hwgtjkx",
            "score": 2,
            "text": "Or smoke 997.5 blunts",
            "title_similarity": "0.14548114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgtjqe",
            "score": 1,
            "text": "This is why I just show up to my soccer game and demand a trophy. Hey, at least I went!",
            "title_similarity": "0.3845021",
            "sentiment_compound": -0.2003
        },
        {
            "id": "hwgtk5m",
            "score": 1,
            "text": "needed this today. ty. hope you keep moving in a positive direction.",
            "title_similarity": "0.44496393",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hwgtl9p",
            "score": 1,
            "text": "Related LPT: if you are doing a round number of, yaknow, pushups or whatever in order to seek validation from others, you're doing things for the wrong reasons. The key to fitness is valuing and caring about yourself, and wanting to be healthy and strong. Value THAT, and you won't need to brag about your fitness accomplishments, people will just be able to tell that you work on yourself. The same basic concept applies to creative problems, pursuit of knowledge, building community, etc. Just try to be good, rather than perfect, and people will appreciate you for it.",
            "title_similarity": "0.6967753",
            "sentiment_compound": 0.9716
        },
        {
            "id": "hwgtoe3",
            "score": 1,
            "text": "Username checks out. Solid advice",
            "title_similarity": "0.20029584",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hwgtq9p",
            "score": 1,
            "text": "This is great thank you for sharing, I think this also helps with building a life worth living. Thank you",
            "title_similarity": "0.3643649",
            "sentiment_compound": 0.9371
        },
        {
            "id": "hwgtqhd",
            "score": 1,
            "text": "Man. I needed this. \n\nI hope you have a good nice OP.",
            "title_similarity": "0.44933152",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hwgtvbz",
            "score": 1,
            "text": "Love it. I needed this.\n\nI will be using this from now on:\n\n\"Something is something, but nothing is nothing\"",
            "title_similarity": "0.4981099",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hwgtxxq",
            "score": 2,
            "text": "Smoke 999 blunts",
            "title_similarity": "0.12122654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgty8n",
            "score": 1,
            "text": "1/3 is too standard, aim for like 4/15th",
            "title_similarity": "0.36403605",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgu1b7",
            "score": 1,
            "text": "Needed to read this. Much appreciated 👍",
            "title_similarity": "0.27509022",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hwgu92a",
            "score": 1,
            "text": "Former PT here. \n\nA sensible fitness YouTuber introduced me to what he called ‘Incremental Commitment’, which is an approach I used with all my clients after I watched that video. The idea is basically this: If you’re new to running, for example, don’t start with an arbitrary overall distance or time you’re aiming for. Commit to small goals, achieve, evaluate, set a new small goal and repeat. So for running, it would be ‘I’m going to run up to that broken tree’ and once you get there and you still have more in the tank, you go ‘ok, I’m going run to where the road curves’ and so on. If you set a goal of ‘I’m going to run 5k’ and you begin to feel out of breath at 1k, it’s disheartening and makes you give up when you could possibly have made it to 2k if you had kept going. Incremental commitment makes you do the most you can and feel good instead of fail at something unrealistic and feel bad. \n\nSame dude also dropped this line which stuck in my head ever since - ‘Any workout you do is better than the best workout you don’t do.’ If your normal workout takes an hour and you only have a half-hour to spare, do a condensed half-hour workout rather than skip the workout. You get your exercise in, you maintain even if you don’t improve, and you don’t get that nagging in your own brain that says ‘Yup, that’s how it starts, bud …’\n\nBoth these concepts can be extended to your life in general, not just workouts :)",
            "title_similarity": "0.6247341",
            "sentiment_compound": -0.0721
        },
        {
            "id": "hwgu997",
            "score": 1,
            "text": "Compounding is key",
            "title_similarity": "0.32758132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgufqb",
            "score": 2,
            "text": "Perfection is the enemy of progress....",
            "title_similarity": "0.36619592",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwgug5o",
            "score": 1,
            "text": "My favorite saying is, \"Race your own ghost car.\" \n\nIn racing video games you can record your race time and watch your own car recomplete the track you're on so you can improve your timing and maneuvers on said track. The only goal is to be better than the last ghost car. That is how you should approach your life. Not watching everyone else and comparing yourself, but improving on what you had before.",
            "title_similarity": "0.63999176",
            "sentiment_compound": 0.753
        },
        {
            "id": "hwguguj",
            "score": 1,
            "text": "Keep going. \n\n\nOkay. \n\n\nKeep racking up [input heinous crimes].\n\n\nLol.",
            "title_similarity": "0.3900832",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwgupvj",
            "score": 1,
            "text": "I really needed this. Thank you.",
            "title_similarity": "0.2279712",
            "sentiment_compound": 0.4947
        },
        {
            "id": "hwgur47",
            "score": 1,
            "text": "Plan your work and work your plan. If the plan doesn’t work change the work, but keep the plan.",
            "title_similarity": "0.6016623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgus7f",
            "score": 1,
            "text": "There’s a video called The 2 minute rule “ that explains this very well on YouTube",
            "title_similarity": "0.31478274",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hwgusr9",
            "score": 1,
            "text": "When you step out for a run, the welcome mat is further than majority of people that day.",
            "title_similarity": "0.31429854",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwguz9w",
            "score": 1,
            "text": "I needed this.  Thank you",
            "title_similarity": "0.2175445",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hwgv5iz",
            "score": 1,
            "text": "I agree with this but with one exception. Anybody who stops reading mid-chapter is a monster. How do you start reading from a random page? Do you restart the chapter? Who does this? Let me know.",
            "title_similarity": "0.6309591",
            "sentiment_compound": -0.1754
        },
        {
            "id": "hwgv7a2",
            "score": 1,
            "text": "Savings tips is solid ..easy to go low if you are tight that month rather than zero",
            "title_similarity": "0.48345554",
            "sentiment_compound": 0.34
        },
        {
            "id": "hwgvl78",
            "score": 1,
            "text": "If you can't get the gold medal, it's okay to give it your all and go for Bronze.",
            "title_similarity": "0.43173334",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hwgvnui",
            "score": 1,
            "text": "Great advice! I last 4.45 seconds in bed.",
            "title_similarity": "0.41690463",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hwgvojs",
            "score": 1,
            "text": "This post encouraged me to finally put money into my savings after MONTHS of being bummed I’m not saving anything",
            "title_similarity": "0.6388951",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwgvpl4",
            "score": 1,
            "text": "I’d rather take the tip from your username",
            "title_similarity": "0.4289092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgvsx0",
            "score": 2,
            "text": "I like Ali's take on it:\n\n>I don't count all my pushups. I only start counting when it starts hurting, because those are the ones that matter.\n\nIf your pushups start hurting at 2, so be it. Do 3. Then try to go higher later on. Just stick with it and don't worry what everyone else can do.",
            "title_similarity": "0.7035289",
            "sentiment_compound": -0.1012
        },
        {
            "id": "hwgvwih",
            "score": 2,
            "text": "I try to rember this for work. It may be a good day where i write for 4 hours, or it may be a crap one where I spend 6 hours just troubleshooting broken equipment. \n\nOn those bad days I say fuck it, go to a coffee shop, and try to get at least an hour of writing done before going home. \n\nThose little hours stack up and they keep my mind focused and make it easier to knock out a 3 hour block of writing when I don't have distractions. \n\nSame with the gym. At this point I try to make it once a week, but when I go I go hard. I probably don't make the gains I could but it's better than sitting home doing nothing.",
            "title_similarity": "0.73493546",
            "sentiment_compound": -0.3036
        },
        {
            "id": "hwgvyga",
            "score": 1,
            "text": "That's what's been helping me lose weight, just eating less and trying to move more. It's not falling off but it's progress and everyday I just try to get something I don't want to do done and it's working",
            "title_similarity": "0.70849526",
            "sentiment_compound": 0.5378
        },
        {
            "id": "hwgw0g2",
            "score": 1,
            "text": "r/nozerodays or whatever it's called",
            "title_similarity": "0.08149417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgw13k",
            "score": 1,
            "text": "Nah read that whole chapter! It's one chapter! Just send it. \n\n(It hurts when I can't finish a chapter lol)",
            "title_similarity": "0.5315647",
            "sentiment_compound": -0.3147
        },
        {
            "id": "hwgw2tp",
            "score": 1,
            "text": "Have a friend battling alcoholism. 60 days sober. 59 days ago he told me he wanted to go 100 days sober. I told him fuck that goal. Today you're sober, tomorrow you're sober. Don't create an arbitrary opportunity for failure. The key is consistency. 1 step a day for 100 days is far more beneficial than 100 steps in 1 day.",
            "title_similarity": "0.6230804",
            "sentiment_compound": -0.1333
        },
        {
            "id": "hwgw4dm",
            "score": 8,
            "text": "This is awesome. When I played football we always had this rule of 1% better. Get 1% better, in any way, every day. It may seem tiny, and insignificant, but it was the best/easiest way to push ourselves to get to where we wanted to be for our long term goals. \n\nI’ve learned since to apply this to my everyday life. I started to make my bed every day during that time, no matter what, and slowly it’s turned into 1. Making my bed 2. Drinking 8oz 3. Eating some kind of food for breakfast (football screwed up my eating habits) 4.brushing my teeth and so on. I can’t stress enough how important It is to not stress yourself out with trying to better yourself. \n\nI’m not sure if I am getting the point across in a productive or relatable way, but the 1% increase has changed my life and made me really appreciate myself and the journey I am on. 1% increase everyday over years quickly leads to 100% in the way that you want to be. \n\nI appreciate you so much OP, and what you are trying to get out there, thank you! You even reminded me of my 1% rule.",
            "title_similarity": "0.69388485",
            "sentiment_compound": 0.9656
        },
        {
            "id": "hwgw50n",
            "score": 2,
            "text": "Thanks for the tip on not getting hung up on round numbers u/Smoke1000Blunts",
            "title_similarity": "0.54517084",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwgw5ry",
            "score": 1,
            "text": "Start studying at 8:37pm don't wait for 9pm or 9am",
            "title_similarity": "0.479925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgw76v",
            "score": 1,
            "text": "My brain won't let me",
            "title_similarity": "0.26487494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgw9dq",
            "score": 1,
            "text": "Don't ask, How will I climb the mountain, just climb the mountain.\n\n-Nietzsche",
            "title_similarity": "0.44984338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgwfqy",
            "score": 1,
            "text": "“Be not afraid of going slowly, be afraid only of standing still.”",
            "title_similarity": "0.3671737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgwivo",
            "score": 9,
            "text": "17 push ups? What am I, The Rock? I'll give you one good one, a noodly second, and collapse halfway through the 3rd.",
            "title_similarity": "0.47746757",
            "sentiment_compound": -0.168
        },
        {
            "id": "hwgwkeq",
            "score": 5,
            "text": "In short, consistency is better than perfection.",
            "title_similarity": "0.3589205",
            "sentiment_compound": 0.765
        },
        {
            "id": "hwgwqbp",
            "score": 2,
            "text": "Add a .0 on to any number to make it nice and round!",
            "title_similarity": "0.303428",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hwgx69j",
            "score": 1,
            "text": "There is a saying translated as: drop by drop a river forms",
            "title_similarity": "0.09676138",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hwgx6ev",
            "score": 1,
            "text": "Exactly. I learned how to take off and fly an airplane, I’ll worry about the landing some other time. At least I made progress.",
            "title_similarity": "0.46298406",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hwgxdg8",
            "score": 1,
            "text": "This is such an important message.",
            "title_similarity": "0.13544607",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hwgxg36",
            "score": 2,
            "text": "Atomic habits is a nice book about forming your own habits.",
            "title_similarity": "0.5044477",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwgxglz",
            "score": 2,
            "text": "This. As a perfectionist it's hard to do things half finished and be ok. But today I only did half of the dishes and told myself that's enough, I'll finish the rest tomorrow.\n\nBaby steps.",
            "title_similarity": "0.743943",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hwgxwzq",
            "score": 1,
            "text": "Except saving money bit, the two things i’m struggling most now in life is mentioned here: cleaning my room and going to the gym. This post is like god send for myself",
            "title_similarity": "0.7319708",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hwgxzpv",
            "score": 2,
            "text": "...what if I only smoke 999 blunts",
            "title_similarity": "0.30672202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgy59n",
            "score": 1,
            "text": "Don’t let the perfect stand in the way of the good.",
            "title_similarity": "0.41665184",
            "sentiment_compound": 0.765
        },
        {
            "id": "hwgye2t",
            "score": 2,
            "text": "I think it must be some sort of disorder to have this way of thinking, because I know it has directed my life for as long as I can remember, regardless of whether I am aware of it. Of course it has gotten better, but it is still a huge struggle. I can pour over details and generate ideas, but this is another beast entirely. And almost always I'd rather trash the whole venture and start over or not do it at all than accept the imperfect outcome.",
            "title_similarity": "0.7118639",
            "sentiment_compound": 0.1036
        },
        {
            "id": "hwgyebp",
            "score": 3,
            "text": "Been phenomenal for me with college. I generally can plot out time accordingly and know what I need so I can get homework and projects and the like done, so it was never a huge issue. Doing stuff at the last minute wasn’t a bad thing.\n\nHowever, I started spacing it out more. I started getting antsy while doing school work, and finding that I’m just wanting to fuck around instead. So I make a change. Instead of “ok I’ll play video games tonight and do homework tomorrow” it went to “I’ll do half tonight half tomorrow, that way I can play video games tonight and tomorrow”.\n\nIt’s done wonders as if I’m able to treat myself to doing something productive rather than making it a trade off. Plus it makes for good break points without forcing yourself through something. “Damn problem 5 is hard. I’ll stop now and pick it up tomorrow and see if that helps”.\n\nI’d imagine it works similar to other goals as well.",
            "title_similarity": "0.7953801",
            "sentiment_compound": -0.0675
        },
        {
            "id": "hwgylte",
            "score": 1,
            "text": "The older I get the more attracted I am to the milestones of prime numbers. If I can finish with 51 pushups or write a story of 229 pages then I'm quite happy.",
            "title_similarity": "0.52156967",
            "sentiment_compound": 0.7956
        },
        {
            "id": "hwgym3j",
            "score": 1,
            "text": "SMART Goals are almost a cliched topic at this point because it’s effective because when you make something measurable you know if you succeeded or not. Something like “get in shape” is nebulous and you don’t know if you’re going fast enough, what you’re measuring in shape by, etc.\n\nBut Id recommend approaching this very differently and I think it takes care of the problem itself. More effective then the incomplete thing, is the idea of setting an easy habit that you know you can succeed at but really makes a world of difference.\n\nEvery month I choose something new to work on that needs improving. With your gym example the fact that you say “when I haven’t been in a while” means it’s not really habitual for you so it’s going to seem daunting. But if you make even a really small habit for this month and say I’m going to go to the gym for 15 minutes three times a week, it’s very easy for you, it’ll make the habit less scary, etc. because if you haven’t went and now can’t hit your goals it’s probably because you’re trying to sprint when you haven’t even been walking regularly.\n\nAnd I let that be a habit and maybe in six months from now I’ll add on to the 15 minutes. I view life holistically and all the stats say to really only do one new habit at a time, so if you’re only trying to improve working out then you can do it quicker but for me I might do January 15 minute work out three times a week February lower my daily calories to a 500 calorie deficit, March make a budget where i track spending and save $75 a week, April do big house projects I’ve put off, etc. it’s all how you prioritize it but it’s all positive so there’s no wrong way. And many of these you can take with you forever or alter when you need to or drop after a year, etc.\n\nAnd with all that comes off days. When trying to form a habit I like to give myself a 75% completion rate throughout the year as I track my progress. You’re going to get sick sometimes, going to feel super burnt out, or super busy, so make it so if you have to miss a day it’s no big deal. And you adjust your yearly goals to account for the fact that you’ll miss up to 25% of the time you’ve scheduled.",
            "title_similarity": "0.7658582",
            "sentiment_compound": 0.9929
        },
        {
            "id": "hwgyp1a",
            "score": 2,
            "text": "I used this method today. Didnt feel like painting. I just sat down and mixed blue and white and started scrubbung onto canvas. 45 min later i was still enjoying the progress",
            "title_similarity": "0.5638621",
            "sentiment_compound": 0.6237
        },
        {
            "id": "hwgypn4",
            "score": 1,
            "text": "17 push ups? Who do you think I am, Joe Rogan or Jocko Willinx?",
            "title_similarity": "0.3706395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgyqdl",
            "score": 1,
            "text": "Keep moving forward.",
            "title_similarity": "0.108078964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgyxov",
            "score": 1,
            "text": "Start nofap 10/02/2022",
            "title_similarity": "0.18166097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgz00w",
            "score": 1,
            "text": "So you guys can all just save $138.93? And that's a \"well, it's better than nothing\" situation? That's cool.",
            "title_similarity": "0.5265211",
            "sentiment_compound": 0.7648
        },
        {
            "id": "hwgz23k",
            "score": 1,
            "text": "Get the reps in. Consistency always wins.",
            "title_similarity": "0.39039892",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwgzapa",
            "score": 1,
            "text": "1 cent is richer than nothing\n1 cent a day for a hundred days dollar \nNothing for a hundred days nothing",
            "title_similarity": "0.36323577",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hwgzbto",
            "score": 1,
            "text": "Baby steps, get on a bus…",
            "title_similarity": "0.13809597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgzcmj",
            "score": 1,
            "text": "I love your advice. I share the same principles. While sometimes I accomplished mediocre things, other times I've accomplished great things. All by not giving up. That's all. Just keep going. \n\nI tell my friends who hate running to go on a walk, then jog or run until they absolutely don't want to anymore. Then stop. Walk then run. If you don't want to continue, then don't. Just keep moving at your own pace. \n\nAnyways, I love your advice. You're amazing",
            "title_similarity": "0.7161654",
            "sentiment_compound": 0.9625
        },
        {
            "id": "hwgze8w",
            "score": 1,
            "text": "Exactly, always do your best.",
            "title_similarity": "0.16888276",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwgzecn",
            "score": 1,
            "text": "Automatic savings transfer gang",
            "title_similarity": "0.25055745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwgzfk8",
            "score": 1,
            "text": "Amazing advice! As someone who has struggled with perfectionism for most of my life, I was always flooded with anxiety whenever I would start something new, and when I finally did start it I would set myself up for failure because my goals were completely unrealistic. There were times where I definitely did achieve a lot but only other people were happy with my achievements…\n\nAfter finding a good mentor/manager who helped me realise it, and after constantly working on it over the last few years in my career, I can finally be happy with achieving little things and making progress in everything. It has resulted in financial achievement, business achievement, new hobbies and now my goals are  focused on improving my heath through sleep, diet and exercise. I’m going 8 months strong and it’s the first time in my life that I have ever been able to wake up at 6am and go to the gym. The improved discipline does a lot to improve your overall happiness!",
            "title_similarity": "0.71067166",
            "sentiment_compound": 0.9933
        },
        {
            "id": "hwgzio9",
            "score": 1,
            "text": "One of the best LPT in a while.",
            "title_similarity": "0.22736688",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwgzj8r",
            "score": 1,
            "text": ">\"Something is something, and nothing is nothing.\" \n\nThis is some quote 👌",
            "title_similarity": "0.17490235",
            "sentiment_compound": 0.7297
        },
        {
            "id": "hwgzlkm",
            "score": 3,
            "text": "Great tip, OP. Would rate it 5/7",
            "title_similarity": "0.23119567",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwgzmcj",
            "score": 1,
            "text": "This is wonderfully good advice. \nGenuine, real, solid, relevant.\nGreat LPT, and thank you very much.",
            "title_similarity": "0.2898506",
            "sentiment_compound": 0.9325
        },
        {
            "id": "hwgzt48",
            "score": 1,
            "text": "“something is something, and nothing is nothing” thank you",
            "title_similarity": "0.17549056",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hwgzuyr",
            "score": 1,
            "text": "so, progress over perfection?",
            "title_similarity": "0.2567984",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hwh01ti",
            "score": 1,
            "text": "I really love what you’ve said here. Making your bed is not just something parents say, but something that starts that momentum for the day. I personally have found that saying I will “do something later” just means I won’t do it at all. Making an actual effort is the first step, but continuity is a hard secornd. I thank you(OP) for inspiration and hope the best for all",
            "title_similarity": "0.79321593",
            "sentiment_compound": 0.9668
        },
        {
            "id": "hwh03ev",
            "score": 1,
            "text": "Always forward. Whatever the situation always go forward.",
            "title_similarity": "0.2004729",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh03zc",
            "score": 6,
            "text": "I really needed to see this. I had a tough week (depression) and this gives me a different insight than how I’ve been feeling, it makes me feel like I can still take control, even if it’s just a little bit. Thank you.",
            "title_similarity": "0.6255226",
            "sentiment_compound": 0.0056
        },
        {
            "id": "hwh0asl",
            "score": 1,
            "text": "Don’t even count your reps in the gym. Go until you can’t anymore.\n\nSource: am bodybuilder",
            "title_similarity": "0.51549006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0awq",
            "score": 1,
            "text": "It wasn't until I realized this that I finally got to losing 50lbs and being a normal weight.  Weight loss is a slow process when you really look at what's involved, just like gaining weight is.  It's easy when you're starting out to be like \"omg i worked so hard for weeks/months and i'm still so far from my goal\" but its like that's how life works man.  Just make sure you're going in the right direction, as long as you are you will get there eventually if you stick with it",
            "title_similarity": "0.7211777",
            "sentiment_compound": 0.8256
        },
        {
            "id": "hwh0csp",
            "score": 1,
            "text": "'Something is something, nothing is nothing.'\n\nBeautiful.",
            "title_similarity": "0.10036619",
            "sentiment_compound": 0.3794
        },
        {
            "id": "hwh0e6a",
            "score": 1,
            "text": "I think more people are overwhelmed by aging and inflation that eats away the value than perfection.\n\nYour $75 are worth lesser and lesser every day due to inflation. You can’t keep doing the same gym routine as you get older too. Read 1/3 chapter when thousands of new info are released everyday.\n\nThe effort seem worthless and overwhelming due to the target moving faster than you can move. You are further away tomorrow despite your effort than you are today.",
            "title_similarity": "0.64976263",
            "sentiment_compound": 0.6771
        },
        {
            "id": "hwh0fb7",
            "score": 1,
            "text": "\"If you can't fly, then run,\nIf you can't run, then walk,\nIf you can't walk, then crawl,\nBUT KEEP MOVING FORWARD.\"\n  \n- MLKjr",
            "title_similarity": "0.53751063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0gus",
            "score": 1,
            "text": "I needed to read this 🙏🏼",
            "title_similarity": "0.31650382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0j03",
            "score": 2,
            "text": "Repetition is the root of all achievement. Gotta push a bit, but 90% of greatness is showing up everyday",
            "title_similarity": "0.414375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0l7h",
            "score": 1,
            "text": "I’m saving this thread",
            "title_similarity": "0.25142157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0mi7",
            "score": 1,
            "text": "This is such a great advice.\nWhen universal constants are wacky looking why should our goals be in perfect number.",
            "title_similarity": "0.4891192",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hwh0txr",
            "score": 1,
            "text": "I first started learning this lesson when I finally got over needing the volume to be set to an even number. 28 or 30 might look nice. But if 29 is the perfect volume for right now, then so be it.",
            "title_similarity": "0.59387505",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hwh0u6c",
            "score": 1,
            "text": "Username checks out",
            "title_similarity": "0.07270523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh0zue",
            "score": 1,
            "text": "First two are fine and all but unless its a textbook stopping mid chapter feels wrong",
            "title_similarity": "0.5742302",
            "sentiment_compound": -0.6858
        },
        {
            "id": "hwh1003",
            "score": 1,
            "text": "Thank you for bringing this out and sharing it. I have OC tendencies to make some things perfect or exact as they are, since there is some satisfaction and (sometimes) validation that comes with it. Given that, I've never really been that consistent when it comes to some tasks due to mental health problems.\n\nBuuut, I am slowly trying to change my ways every single day & thank you for this sound advice that I really needed. More power to you, OP.",
            "title_similarity": "0.70114756",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hwh11jy",
            "score": 1,
            "text": "I like that this pro-tip is by username Smoke1000Blunts lol.\n\nMust have worked his way up to it <3\n\nSage advice good sir, solid post :)",
            "title_similarity": "0.4962171",
            "sentiment_compound": 0.9287
        },
        {
            "id": "hwh1203",
            "score": 1,
            "text": "I’m in my 40’s and only recently discovered this. It has been a game-changer.\n\nConsistency in doing little things adds up to way more than a few big things.\n\nSmall changes to your diet, exercise, etc. have a massive effect if you make them habitual.\n\nThe book Atomic Habits really solidified this for me and I use the app called Streaks to keep track of my progress.\n\nSince I’m getting older, I hurt myself easier working out. My shoulders in particular.\n\nSo now I go lighter and more frequent. I have a bare minimum set of exercises (body weight squats, crunches, push-ups, pull-ups) I do before hoping in the shower each day. I do them no matter how I feel. I set the bar low enough that I never feel incapable of doing them. \n\nOn the days that I feel like doing more, I do more. If I have time I’ll do a more full blown workout.\n\nWhen the goals become way to easy, I slightly increase them. But only after weeks or months of going with the old goals.\n\nThe result is that I’m in better shape then when I use to do 2.5 hour workouts 4 times a week, fall out of the habit for weeks, get back to the gym again, build back up to where I was before, and so forth.\n\nConsistency is EVERYTHING! And you have to do it without thinking about it. Should be like brushing your teeth.",
            "title_similarity": "0.68695426",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hwh167c",
            "score": 1,
            "text": "I needed to see this. I’m a perfectionist and I struggle a lot when things aren’t perfect. I am especially tough on myself if I do not get perfect grades… I am damn close to it. Statistics is a super hard class for me and I keep telling myself passing is the goal. However, my brain is not convinced.",
            "title_similarity": "0.68010056",
            "sentiment_compound": -0.0897
        },
        {
            "id": "hwh18sk",
            "score": 1,
            "text": "\"Somethng is something and nothing is nothing\"\n\nI like that",
            "title_similarity": "0.25622833",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hwh1id9",
            "score": 1,
            "text": "If it’s worth doing, it’s worth doing poorly.",
            "title_similarity": "0.3251232",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwh1ivy",
            "score": 1,
            "text": "Don't let perfect become the enemy of progress",
            "title_similarity": "0.43141568",
            "sentiment_compound": -0.5716
        },
        {
            "id": "hwh1m4j",
            "score": 1,
            "text": "The most important step you can take is the next one!",
            "title_similarity": "0.33761746",
            "sentiment_compound": 0.3367
        },
        {
            "id": "hwh1nvz",
            "score": 1,
            "text": "As a reforming perfectionist the quote that helped me reshape my thinking was “always something” as opposed to “all or nothing”",
            "title_similarity": "0.6465651",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwh1pa0",
            "score": 1,
            "text": "I call this method “if you give a mouse a cookie” \n\nMy brain has a difficult time preparing itself to say…. Clean my room. I know the clutter makes me feel worse but it’s just too overwhelming to muster up the energy to tackle. \n\nSo I make a deal with myself. You don’t have the clean your WHOLE room, you can just grab the cups and put them in the sink. And you know what happens when you give a mouse a cookie…. \n\nSince I’m already up grabbing the cups, I may as well throw those pieces of laundry in the basket, and grab this because it’s on my way, and before I know it my whole room is clean! \n\nIt’s funny because I know this, I know what I’m doing. Yet I still have to convince my brain every time. Cleaning whole room = way too much. Tiny manageable tasks are much easier to tackle, and you also get the added benefit of a lil dopamine boost of accomplishment with every task you complete. \n\nIf you’re ever struggling, try giving a mouse a cookie and it may just help:)",
            "title_similarity": "0.756924",
            "sentiment_compound": 0.9852
        },
        {
            "id": "hwh1qfi",
            "score": 1,
            "text": "Oh if only my brain would allow that.",
            "title_similarity": "0.300856",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hwh1tmo",
            "score": 1,
            "text": "So your saying... any progress is still progress???   Holy fuck...  That's amazing!",
            "title_similarity": "0.22209428",
            "sentiment_compound": 0.7738
        },
        {
            "id": "hwh1uql",
            "score": 1,
            "text": "also smoke 1000 blunts",
            "title_similarity": "0.1556401",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh1vwe",
            "score": 1,
            "text": "Hey there! I struggle with perfectionism (no, but like really. For real, for real). \n\nAlthough it’s incredibly difficult to apply this to many necessary aspects of my life, I have been able to  “do what I can” when it comes to exercise! After months, I am able to do 30 squats, 2 min plank, and 10 push ups, I actually hit 10 push ups today 🥳  I started with 2 squats a few months ago, and some days I don’t remember to exercise, and it’s ok because I walk a lot at work. \n\nIt’s about gifting yourself grace and space to just exist within the capacity of your current availability. That doesn’t just mean your schedule, it includes your mental and emotional capacity.",
            "title_similarity": "0.69420505",
            "sentiment_compound": 0.8989
        },
        {
            "id": "hwh1wn1",
            "score": 1,
            "text": "I mean, I don't mean to be rude and the LPT is amazing but this from someone whose username is \"smoke1000blunts\" and not smoke164blunts? Damn, that's high. 😅",
            "title_similarity": "0.47917506",
            "sentiment_compound": 0.7606
        },
        {
            "id": "hwh22cb",
            "score": 1,
            "text": "Exactly like maybe just spoke 782 blunts, y'know, just keep burnin",
            "title_similarity": "0.38141525",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwh24fg",
            "score": 1,
            "text": "I heard something once, \n\n'if it's worth doing, it's worth half-assing'\n\nIt doesn't mean that you shouldn't try, it means that doing something half assed is better than not doing it at all.\n\n Can't stick to that diet? Well maybe a diet soda is better than regular. Cant get motivated to make your bed? Well just throwing the blanket back on is a start.\n\nStart on the creating the habit, and work on improving, even if they are just small steps at a time",
            "title_similarity": "0.803784",
            "sentiment_compound": 0.9284
        },
        {
            "id": "hwh24tp",
            "score": 1,
            "text": "If something's with doing it's worth doing badly.",
            "title_similarity": "0.31997487",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwh24z9",
            "score": 1,
            "text": "This is a great LPT. Thank you",
            "title_similarity": "0.15648341",
            "sentiment_compound": 0.765
        },
        {
            "id": "hwh2566",
            "score": 1,
            "text": "Gentle consistency",
            "title_similarity": "0.094903074",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwh26m2",
            "score": 1,
            "text": "Well yeah but 17 is a weird set.  Kinda want to keep them whole numbers.",
            "title_similarity": "0.5482381",
            "sentiment_compound": 0.0285
        },
        {
            "id": "hwh281c",
            "score": 1,
            "text": "There's a lot of sense to that notion, particularly with respect to avoiding burnout/unrealistic expectations, from yourself and from others.",
            "title_similarity": "0.50017333",
            "sentiment_compound": 0.2449
        },
        {
            "id": "hwh2c8p",
            "score": 1,
            "text": "“No no no, not like that. Let me do it. An Elf would have come up with a better plan”\n\nFuck you, Elf. At least I was trying.",
            "title_similarity": "0.5820757",
            "sentiment_compound": -0.6007
        },
        {
            "id": "hwh2csv",
            "score": 1,
            "text": "Do 17 pushups, read 1/3 a chapter, u/Smoke1000Blunts, whatever it is just take it slow!  \n\nBut for real OP thanks for the post.  This is the first r/LifeProTips post that I actually *saved*",
            "title_similarity": "0.59395325",
            "sentiment_compound": 0.8335
        },
        {
            "id": "hwh2dnn",
            "score": 1,
            "text": "Just made me do a double take. Actually insanely good advice.",
            "title_similarity": "0.3533411",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwh2equ",
            "score": 1,
            "text": "it took me 40 years to learn this lesson, but it's a great one. I spent so much time disappointing myself by not meeting huge goals that I became paralyzed by fear of failing again. Goals are great. Setting goals beyond your means can be very destructive.",
            "title_similarity": "0.67258763",
            "sentiment_compound": -0.8892
        },
        {
            "id": "hwh2ido",
            "score": 1,
            "text": "I aim for 69 or 420 in everything",
            "title_similarity": "0.24045002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh2ll9",
            "score": 1,
            "text": "Literally me. Oh I am only getting 7 hours 45 minutes of sleep tonight? Guess I fucked up, may as well make it 6 now",
            "title_similarity": "0.5039102",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hwh2mkz",
            "score": 1,
            "text": ">Do 17 pushups, save $138.93, read 1/3 of a chapter,\n\n\nSmoke 1000 blunts",
            "title_similarity": "0.40770313",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hwh2s33",
            "score": 1,
            "text": "Perfect is the enemy of good",
            "title_similarity": "0.32827413",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwh2v01",
            "score": 1,
            "text": "My OCD says no way. Haha",
            "title_similarity": "0.25217173",
            "sentiment_compound": -0.569
        },
        {
            "id": "hwh2vko",
            "score": 1,
            "text": "Good enough for who it’s for. Helps me accept less than perfect.",
            "title_similarity": "0.38038862",
            "sentiment_compound": 0.8891
        },
        {
            "id": "hwh30wj",
            "score": 1,
            "text": "Anything worth doing is worth doing badly.",
            "title_similarity": "0.38449436",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwh30xm",
            "score": 1,
            "text": "But the society runs on perfection. It has molded people in way that if you are not doing something perfectly or at least close to perfect you are going to be miserable in life and others will surpass you. \n\nExample: If I don't get 96% percentage in exam in school, I will not be considered for college admissions in prestigious colleges or scholarships even though I tried my best to achieve 80%. And if I'm not getting scholarship, I can't study further on my own and if I can't study further more, I will get shitty job. This shitty job will lead me to shitty life full of misery and debt. Sadly I wasn't perfect and I am going through this and will end up as another sad story.",
            "title_similarity": "0.73637104",
            "sentiment_compound": -0.9831
        },
        {
            "id": "hwh37f3",
            "score": 1,
            "text": "Goals: wake up early, do fifteen push ups, cum in my cereal, play apex, take more naps and save money this entire year. Y’all getting brand new socks for every occasion that calls for a gift.",
            "title_similarity": "0.5666902",
            "sentiment_compound": 0.83
        },
        {
            "id": "hwh39o5",
            "score": 1,
            "text": "Slowmotion is better than no motion",
            "title_similarity": "0.42981857",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hwh3cqu",
            "score": 1,
            "text": "Don't let perfect be the enemy of good",
            "title_similarity": "0.41445953",
            "sentiment_compound": -0.5571
        },
        {
            "id": "hwh3dms",
            "score": 1,
            "text": "Dude 17 push-ups is a lot",
            "title_similarity": "0.286982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh3dyw",
            "score": 1,
            "text": "if it's worth doing, it's worth doing poorly",
            "title_similarity": "0.3105263",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwh3e0v",
            "score": 1,
            "text": "I have a mantra to help me complete tasks and/or put it down to move on to something else:\n\nDone beats Perfect.",
            "title_similarity": "0.55270255",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hwh3hw4",
            "score": 1,
            "text": "\"If you can't fly then run, if you can't run then walk, if you can't walk then crawl, but whatever you do you have to keep moving forward.\"\n\nMartin Luther King Jr.",
            "title_similarity": "0.6033996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh3jyt",
            "score": 1,
            "text": "My brain needs them",
            "title_similarity": "0.22942713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh3nbl",
            "score": 1,
            "text": "Anything worth doing is worth doing poorly,\nCan't spend a whole two minutes brushing your teeth cause you are running behind? 30 seconds with mouthwash is better than nothing.\n\nCan't manage to get yourself out for a walk? what about 5 minutes of fresh air just standing.\n\nDon't have the energy for the gym? maybe start with putting on your jogging pants.\n\nReal progress always starts small. Habits take time.",
            "title_similarity": "0.72856665",
            "sentiment_compound": 0.86
        },
        {
            "id": "hwh49m9",
            "score": 1,
            "text": "I’ve only been saving $138.92",
            "title_similarity": "0.36405832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh4awh",
            "score": 1,
            "text": "I did .5 push up today. I’ll do the other half in 3 hours 37 minutes.",
            "title_similarity": "0.36070353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh4b2n",
            "score": 1,
            "text": "Anything worth doing well is worth half assing.",
            "title_similarity": "0.40602508",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hwh4i6z",
            "score": 1,
            "text": "This reminds me of my dentist who says brushing less than two minutes is still better than nothing at all",
            "title_similarity": "0.54933447",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwh4lj7",
            "score": 1,
            "text": "I have ADHD, I will never be perfect.  Just today I was actually on time got work, felt prepared for a big difficult  meeting, remembered to grab my coffee... got 15 minutes out and realized I forgot my laptop bag. F%ck.\n\nOh well, tomorrow I'll do better. \n\nA few years back I worked very closely with a brilliant engineer for several years, it was a painful process but he broke my brain and rebuilt it... continous improvement was in his DNA, there was always room for improvement.  It was annoying as hell because nothing was ever perfect and I got less than 10 \"good job\"'s my entire 4 years working for him.  (Lol I celebrated each) but also it was kind of freeing because perfection was never expected.  It was expected that I learn and do better, but if I got 97%, now we know where we need to focus the next improvement. \n\nDon't focus too achieve completion, enjoy the process and know that if you ever do 100% of what you need and want to do, you'll have nothing to do tomorrow... and although after the week I had, that night did very tempting, I would get bored.",
            "title_similarity": "0.6790353",
            "sentiment_compound": 0.9748
        },
        {
            "id": "hwh4peu",
            "score": 1,
            "text": "Thanks u/smoke1000blunts I’ll make sure to avoid those nice looking but arbitrary numbers u/smoke1000blunts",
            "title_similarity": "0.54155254",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwh4svz",
            "score": 1,
            "text": "I saw it on here a few years ago.\n\n1)Always be learning some thing new\n\n2)Always be I have complete forget what the other two points were.",
            "title_similarity": "0.55815536",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hwh4umy",
            "score": 1,
            "text": "i always tell myself im going to do a workout after i get off a 16 hour shift, then i get home and think, well if i get all worked up i wont be able to sleep, ill just get some rest and try tomorrow. well two nights ago i ran 2 miles after midnight (a first for me) now tonight i will attempt to do the same again while watching some tv, 12 mins less sleep tho ;/",
            "title_similarity": "0.72858846",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwh51yc",
            "score": 1,
            "text": "So true. Got back into swimming after a 4 year break and I usually try to hit the 2km mark. But on some days that just doesn’t work - But I still went and did everything I could.",
            "title_similarity": "0.57990813",
            "sentiment_compound": 0.2609
        },
        {
            "id": "hwh52i4",
            "score": 1,
            "text": "Do 1 push up a day and you'll finish the year 365 push ups better off. 10 a day, 3,650 a year. Both will progress your strength, your mood and confidence.  The same.for any exercise. What seems a small amount in the day, massively builds up over the year to something great. \n\nDo zero push ups a day and finish the year, a year older.",
            "title_similarity": "0.57532644",
            "sentiment_compound": 0.946
        },
        {
            "id": "hwh55t2",
            "score": 1,
            "text": "This is astounding advice. Thank you!",
            "title_similarity": "0.19906539",
            "sentiment_compound": 0.68
        },
        {
            "id": "hwh5a5a",
            "score": 1,
            "text": "Great advice. This year my new years resolution was simply to do some exercise every day. Even one push up counts, but it has to be a conscious effort to do something, anything. Once I've started I always do more, but I can't make excuses if the bar is that low and I keep momentum.",
            "title_similarity": "0.69526124",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hwh5diz",
            "score": 1,
            "text": "Pretty much don't have aimless goals. You do better when having a ser value. Same thing goes with resumes. People love numbers.",
            "title_similarity": "0.5060239",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hwh5erg",
            "score": 1,
            "text": "some progress is still progress.",
            "title_similarity": "0.18754745",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hwh5fie",
            "score": 1,
            "text": "The Borg do not approve of this post.",
            "title_similarity": "0.376078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh5guw",
            "score": 1,
            "text": "This advice is genuinely great. Partially done is better than not at all and it's important to remember that just because humans like patterns such as neat round numbers and strict schedules, we can't let our psychology get in the way of what we need to be doing",
            "title_similarity": "0.7094853",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hwh5p2f",
            "score": 1,
            "text": "True to an extent, and for folks starting out, but for me the round number can be a great motivator to do a little extra too.",
            "title_similarity": "0.5726654",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hwh5wct",
            "score": 1,
            "text": "“If something’s worth doing, it’s worth doing poorly”",
            "title_similarity": "0.36774737",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwh60vh",
            "score": 1,
            "text": "Kinda the opposite to this - aim to go to the gym daily, not super serious but try. If you miss a day or two it's no biggie, you're still getting 3/4/5 days in a week.\n\nIf you plan to go say Mon/Wed/Fri and miss a day or two either due to being busy, tired or lazy,, the gaps become larger, easier to miss more, and you feel more down for not going.",
            "title_similarity": "0.7570685",
            "sentiment_compound": -0.8971
        },
        {
            "id": "hwh69ls",
            "score": 1,
            "text": "70% adherence is better than 0 or doing nothing",
            "title_similarity": "0.36832836",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwh6d39",
            "score": 1,
            "text": "Setting low goals initially is a good way to get started, then often you start wanting to do more. Having the goal to start writing an essay is a good example. If you start and get in that flow state, you'll likely want to continue.",
            "title_similarity": "0.6762216",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hwh6fk8",
            "score": 1,
            "text": "I know not everyone is able to do this *but* with my bank I've started a savings account that automatically puts $50 a week into the savings account. I haven't even really thought about it after 6 months and looked and felt really great about making that choice. Whether it's for emergencies or just a fun vacation I'm glad I put it away. The debts I have will be taken from checking, but in vase that all goes south I have my cushion.",
            "title_similarity": "0.64645445",
            "sentiment_compound": 0.948
        },
        {
            "id": "hwh6hfd",
            "score": 1,
            "text": "I once was mocked at 11:30ish pm because I was doing push ups. 'Ahahaah you're dumb, exercise at night doesn't benefit you, you're wasting time.' \n\nMy shoulders and arms would disagree. Do as much for your self when you can",
            "title_similarity": "0.7500918",
            "sentiment_compound": -0.9077
        },
        {
            "id": "hwh6k4q",
            "score": 1,
            "text": "Measurable goals are achievable goals",
            "title_similarity": "0.17664745",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hwh6nj6",
            "score": 1,
            "text": "Eat half a billionare :)",
            "title_similarity": "0.20247626",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwh6orp",
            "score": 1,
            "text": "I am also repulsed by the terror of round numbers!",
            "title_similarity": "0.4426862",
            "sentiment_compound": -0.784
        },
        {
            "id": "hwh6y2b",
            "score": 1,
            "text": "You only need to lift weights for about 3 seconds to start building muscle.",
            "title_similarity": "0.38720265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh6yqw",
            "score": 1,
            "text": "I've been thinking about this with drinking. Do I have a problem? Maybe. Yes. Research certainly says I do. My blood tests from a week ago and my progress with life are all 100% in good or excellent ranges, not fucking anything up... Yet.\n\nBut I'm not able to stop cold turkey. Grad school is hard. There's a lot of stress. I used to not think aboutl alcohol for months. Now it's ... Days. If that. But .. hey. I took half the extra amount I wanted to take tonight. I took 2 days off within the last 4. I never drink before 6pm. I've limited my intake to below 12oz 40%abv the last few times.\n\nI'm taking baby steps. Progress. Slow, steady in it's \"rising\" and \"falling.\" I've stopped smoking weed completely. I'm working on myself. \n\nI think it will be easier after grad school. Grad school is killing me right now, stress wise. That's no excuse to not make progress tho. \n\nI just realized that progress does not equal perfection. I can make tiny, baby steps. An overall trending upward slope of progress. And that's ok. \n\nThat's good, in fact.\n\nThat IS success. \n\nThank you, u/Smoke1000Blunts . I was slowly coming to this realization, and hearing you clarify it so perfectly is not only reassuring, but motivating as well. \n\nI'm going to keep trying. Thank you.",
            "title_similarity": "0.651607",
            "sentiment_compound": 0.9821
        },
        {
            "id": "hwh72lg",
            "score": 1,
            "text": "Just don't do the unhealthy shit you do to be better. Not really as easy as it sounds.",
            "title_similarity": "0.5627823",
            "sentiment_compound": -0.1371
        },
        {
            "id": "hwh74qi",
            "score": 1,
            "text": "I'm gonna save $420.69!!!",
            "title_similarity": "0.43707815",
            "sentiment_compound": 0.6219
        },
        {
            "id": "hwh78d4",
            "score": 1,
            "text": "Doing something might get something.\n\nDoing nothing gets nothing.",
            "title_similarity": "0.34382176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh7bnb",
            "score": 1,
            "text": "This is good advice but also impossible. 17 pushups?? It's 15 or 20, anything in between I'd black magic fuckery.",
            "title_similarity": "0.6209501",
            "sentiment_compound": 0.3204
        },
        {
            "id": "hwh7cfr",
            "score": 1,
            "text": "*\"Comparison is the thief of joy. It literally steals us away from satisfaction with our own life, providing us with a yard stick on the thing we see as desirable.\"*\n\n \\- Theodore \"Teddy\" Roosevelt, 26th President of the United States of America\n\n*Bully!*",
            "title_similarity": "0.59632564",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hwh7l16",
            "score": 1,
            "text": "Wow, I didn’t know I needed to hear this. The amount of money in my savings account always has to be perfectly even, which probably caused me to save else than I could. With reading, I won’t start knowing that I won’t be able to finish a chapter. I think the only area where I’m fine with doing partial tasks is cleaning..\nThank you!",
            "title_similarity": "0.7640127",
            "sentiment_compound": 0.9412
        },
        {
            "id": "hwh7l5e",
            "score": 1,
            "text": "Bro I cant even get out of bed if the time doesn't end in 5 or 0",
            "title_similarity": "0.47995782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwh7oul",
            "score": 1,
            "text": "Awesome post thanks",
            "title_similarity": "0.10224766",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hwh8ekb",
            "score": 1,
            "text": "Ok this is truly a LCPT \"life Changing pro tip\".",
            "title_similarity": "0.3041466",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwh8nmq",
            "score": 1,
            "text": ">I have been trying to get back into the gym regularly too. When I do make the trip, especially if I haven't been in a while and my usual reps are hard to achieve to the point of not achieving my initial goal, I can still say to myself \"Dammit, I went\". \n\nA bad gym day is infinitely better than no gym day. Your body still counts any exercise you did",
            "title_similarity": "0.73808897",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hwh8o8m",
            "score": 1,
            "text": "A lot of words to say “anything worth doing is worth doing poorly”. Not everyone really understands that sentiment on its face, but the implication is that doing *something* is better than doing nothing at all.",
            "title_similarity": "0.62870306",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hwh8ry3",
            "score": 1,
            "text": "> Do 17 pushups\n\n16.5 are fine too",
            "title_similarity": "0.3494287",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hwh8t6j",
            "score": 1,
            "text": "This is extremely helpful advice. This reminds me of the saying, \"How do you eat an elephant?\"\n\nAnswer: \"One bite at a time.\"\n\nIt is so important to be realistic with your goals and just get started. That is the biggest trick, to just start.\n\nStart with 5 minutes, and then see how you feel...\n\nIf you want to stop after 5 minutes, then stop.\n\nBut, guess what?\n\n99% of the time, I find I want to keep going, and then I accomplish a lot.",
            "title_similarity": "0.6830683",
            "sentiment_compound": 0.7261
        },
        {
            "id": "hwh8u2v",
            "score": 1,
            "text": "I like this lots.",
            "title_similarity": "0.034546547",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwh914e",
            "score": 1,
            "text": "Something a therapist said to me. Perfection is an impossible goal so it's really unhealthy to aim for it. It's something as someone who enjoys making things I have to keep in my head or I'll paralyze my creativity.",
            "title_similarity": "0.712638",
            "sentiment_compound": 0.6852
        },
        {
            "id": "hwh97z7",
            "score": 1,
            "text": "Alright, I’ll set my goals low.",
            "title_similarity": "0.30097514",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hwh9i0c",
            "score": 1,
            "text": "No. Stop and just be.",
            "title_similarity": "0.17508233",
            "sentiment_compound": -0.296
        },
        {
            "id": "hwh9icx",
            "score": 1,
            "text": "I needed to read this this afternoon. Thank you",
            "title_similarity": "0.37677854",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwh9lbe",
            "score": 1,
            "text": "This just hit me at exactly the right time. I've been procrastinating for the last hour thinking of big things that I should be doing and not appreciating that even a little bit of each task would have had me in a better spot right now. Thank you. \n\nOff to be at least mildly conquering!",
            "title_similarity": "0.652959",
            "sentiment_compound": 0.5083
        },
        {
            "id": "hwh9lwt",
            "score": 1,
            "text": "I love this! To quote Uncle Rico from Napoleon Dynamite “You might as well be doing something while you’re doing nothing”",
            "title_similarity": "0.60529095",
            "sentiment_compound": 0.807
        },
        {
            "id": "hwh9qch",
            "score": 1,
            "text": "This is the best LPT I've read on here but also my OCD doesn't want to hear it.",
            "title_similarity": "0.6673771",
            "sentiment_compound": 0.3109
        },
        {
            "id": "hwh9zud",
            "score": 1,
            "text": "My non existant OCD won't allow this lol",
            "title_similarity": "0.3917888",
            "sentiment_compound": 0.3786
        },
        {
            "id": "hwha1nn",
            "score": 1,
            "text": "One of the few LPT that I salute!",
            "title_similarity": "0.18711154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwha2u7",
            "score": 1,
            "text": "\"do 17 pushups\".. I feel someone is bragging here..",
            "title_similarity": "0.35897085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwha70g",
            "score": 1,
            "text": "Small push-up hack. If you are too heavy to do them, get on your knees and do the pushup. It is still very effective",
            "title_similarity": "0.498393",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hwhaedr",
            "score": 1,
            "text": "But at the same time, always count your push ups. When you’re at 17, suddenly 3 more doesn’t seem impossible. I think is humans like even numbers, and it can also be a help in the right direction.",
            "title_similarity": "0.64236426",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hwhajip",
            "score": 1,
            "text": "This is a good LPT and also something that is written about in a book called Atomic Habits by James Clear. Basically the idea is just this - if you do a small amount of the same thing each day (or often), and do it 1% better each day, due to a compounding effect you will be c37% better at the end of the year at that thing (if done daily). While it feels like a small increase at the time, it is a big increase over a few years. It’s a great book and I highly recommend it, can be applied in all areas of life",
            "title_similarity": "0.5876163",
            "sentiment_compound": 0.9729
        },
        {
            "id": "hwhawv6",
            "score": 1,
            "text": "Hey you son of a bitch if you stumble across this, thanks a million. I needed this.",
            "title_similarity": "0.5063797",
            "sentiment_compound": -0.1091
        },
        {
            "id": "hwhazsx",
            "score": 1,
            "text": "Love this! I am overweight and this new year I started walking as a way to get some stamina. I then started jogging for like 10 secs and moving little by little. Still can only jog for like 30 secs but it's 30× more than I was before. I twisted my ankle and when I went back after it healed I got mad cause I wasn't where I was before. Gave up for a week but then thought: just go. Even if you just walking you'll get there. Eventually..  \n\n\nI'm still going. And this made me make sure I go ahead to the track again tomorrow, on a Friday and get my walk/jog in cause it hurts so bad after I finish but I love it\n\nTo anyone who took the time to read this, keep going. As long as you going, you are doing great!",
            "title_similarity": "0.6130338",
            "sentiment_compound": 0.6425
        },
        {
            "id": "hwhb2ow",
            "score": 1,
            "text": "This sort of reminds me other the quote \"anything that's worth doing is worth doing poorly\", basically saying, it's better to do the bare minimum than to give up or not do it at all",
            "title_similarity": "0.61532205",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hwhb4i3",
            "score": 1,
            "text": "Forward unto dawn",
            "title_similarity": "0.07356147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhbd9f",
            "score": 1,
            "text": "My ocd makes wanna finish in multiples of 10.",
            "title_similarity": "0.37898323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhbelo",
            "score": 1,
            "text": "/r/adhd could do with seeing this I think\n\n  \n\n\nIn my case this would look like\n\n\\- draft blog one sentence\n\n\\- lay one laminate floorboard\n\n  \n\n\nKnowing full well the rest will flow once started. I mean *come on*, doing that one tiny thing really shouldn't be that hard...",
            "title_similarity": "0.70032907",
            "sentiment_compound": 0.6365
        },
        {
            "id": "hwhbfof",
            "score": 1,
            "text": "https://www.amazon.ca/Mini-Habits-Smaller-Bigger-Results/dp/1494882272/ref=asc\\_df\\_1494882272/?tag=googleshopc0c-20&linkCode=df0&hvadid=292994429195&hvpos=&hvnetw=g&hvrand=15743592685460913464&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1002283&hvtargid=pla-405698727965&psc=1",
            "title_similarity": "0.40370637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhbper",
            "score": 1,
            "text": "I remember there was a similar LPT that was something like\n\n> if a kind with doing, it's worth half assing\n\nBasically, if going for a run half the distance you usually would is better than not going for a dry run at all.\n\nI often find it's the motivation to get me started and then I end up completing the job any way",
            "title_similarity": "0.6781663",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hwhbvdu",
            "score": 1,
            "text": ">Something is something, and nothing is nothing.\n\n\nGoing to be my mantra from now on!\n.\n\nRight next to Ron Swanson’s: Don’t half ass two things, whole ass one thing.",
            "title_similarity": "0.49241188",
            "sentiment_compound": -0.807
        },
        {
            "id": "hwhc0cg",
            "score": 1,
            "text": "Nice I just try to combine things.\n\nDon't get up early to exercise ever or will I ever make it to the gym even though that is my new year resolution every year.\n\nSo I wake up 2-3 am to do a 4-5 hours delivery because well it pays about $135-$150 and I love money. So I get about 1-2 mile of exercise and if I do about 8 hours of 1-3 miles and get about $200 then I am pretty content. So I wake up early to do delivery 5=7 times a week and make $1000-$1200. Then I got another couple of other jobs where I work serving food and more delivery so another $300-800/week. So overall I get about 22 miles of walking in per week just from working/exercising/free food and making roughly $2000 a week.\n\nIt overall help with my food budget and I get my exercise and still make more than when I was a manager in an office but I learned that some people perceive me as poor by being a delivery driver and food server. It also allow me to be flexible with my schedule so I can study for my license, travel, help my mom out, walk my dog. Walking my dog add in another 14 miles a week so a total of 36 miles of walking and sort of exercising I do (lifting and carrying packages). Yeah, I learned that I am never going to wake up early to go to the gym but I will wake up early for $$$. Life that is how it goes but I learned that if I combine work/exercise/eat free food, overall I save money and make money. I am one happy camper and I look fit. Actually, I am much more fit than when I ever worked in an office and \"try to hit the gym.\" I had a gym membership while working for cheap and I used it about twice in a 6 months. I think I am winning at being healthier now. My secret is actually just showing up by being there, I already have more momentum to keep exercising or working. I was doing delivery whatnot and it was a long 18 hours day but that is +$420/day that I wouldn't have before all because I woke up and show up for my gigs. When you add in money to work and exercise, it helps.",
            "title_similarity": "0.6621412",
            "sentiment_compound": 0.9907
        },
        {
            "id": "hwhc43v",
            "score": 1,
            "text": "This is one of them most valuable LPT's on here in recent times. It also made me feel good as I read it, thank you.",
            "title_similarity": "0.40568548",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hwhc536",
            "score": 1,
            "text": "Also not meeting your goals is one sure way of not sticking to whatever you are trying to do, so always undervalue your goal. Personal anecdote - several years back I sterted tracking books I read, I set a goal of reading 15 books a year, and this keeps being my goal even though for couple of years I read way more than that. But especially if you are tracking your goals (which I recommend) there is this feeling of shame of failing to meet it even when no one else sees the tracking, so you will skip on tracking which will more likely lead to skipping on working towards the goal",
            "title_similarity": "0.7802744",
            "sentiment_compound": -0.7624
        },
        {
            "id": "hwhcef9",
            "score": 1,
            "text": "Username checks out 🤪😂",
            "title_similarity": "0.12240313",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwhcexg",
            "score": 1,
            "text": "I've been struggling with procrastination for my whole 20 or so years of existence - hearing \"something is something, nothing is nothing\" resonates with me so much that I might just put this into action",
            "title_similarity": "0.5333956",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hwhciih",
            "score": 1,
            "text": "I drank 7 waters today",
            "title_similarity": "0.17227782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhcjf7",
            "score": 1,
            "text": "This is excellent advice.",
            "title_similarity": "0.11424344",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwhcte6",
            "score": 1,
            "text": "I didn't hit a thousand today but I'll keep trying.",
            "title_similarity": "0.5212483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhd00v",
            "score": 1,
            "text": "Thank you for posting this. I recently went back to physical therapy and it was harder than expected my first day. Being disabled for 4 years, I was unable to do much of anything around my house, so now that I can, I’ve had to create my new normal. When cleaning I ask myself “is it better than it was?” And to get started I remind myself “it just has to be better, not perfect.” I allow myself to wipe down 1 cabinet when I feel up to it. Or sweep one room. I think I’ll make my bed today. Thank you again.",
            "title_similarity": "0.7253277",
            "sentiment_compound": 0.8816
        },
        {
            "id": "hwhd5h3",
            "score": 1,
            "text": "I wish I could but non round numbers are the stuff of r/mildlyinfuriating to me and make me feel bad inside. 🤮 Has to be divisible by 5 or a prime number or something stupid like that. I am having a cortisol spike just looking at your numbers. No joke. The numbers are making me feel unwell. Why am I like this.",
            "title_similarity": "0.6706605",
            "sentiment_compound": -0.597
        },
        {
            "id": "hwhdbl9",
            "score": 1,
            "text": "Anything thats worth doing, is worth doing poorly. \n\nYou hear the version of \"is worth doing well\", but that's not true to OPs point. \n\nBrush your teeth? Better to half ass it than not at all. Etc.",
            "title_similarity": "0.6953318",
            "sentiment_compound": -0.2495
        },
        {
            "id": "hwhdeo2",
            "score": 1,
            "text": "Thank you for this LPT. 🙏🏼",
            "title_similarity": "0.22731766",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwhdfsd",
            "score": 1,
            "text": "I would also add to this, that if you are doubting if you should put something you made out into the world, you should just do it.",
            "title_similarity": "0.5812278",
            "sentiment_compound": -0.34
        },
        {
            "id": "hwhdhxh",
            "score": 1,
            "text": "In relation to the push-ups, a shit workout is better than no workout, it’s all progress!",
            "title_similarity": "0.58815205",
            "sentiment_compound": -0.1007
        },
        {
            "id": "hwhdpfo",
            "score": 1,
            "text": "This may be one of the best posts I’ve seen on here. I needed this",
            "title_similarity": "0.3723066",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwheg8f",
            "score": 1,
            "text": "No matter how slowly you run, you're lapping everyone on the couch.",
            "title_similarity": "0.4059297",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hwheuny",
            "score": 1,
            "text": "No. Keep going. You are stronger than you think.",
            "title_similarity": "0.29699492",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hwhevwt",
            "score": 1,
            "text": "In Dutch we have a saying that flows so easily that fits perfectly on this: iets is beter dan niets (something is better than nothing). Since I started taking that seriously I have made massive steps forward, and mostly by incrementing all the small efforts.",
            "title_similarity": "0.52014154",
            "sentiment_compound": 0.8596
        },
        {
            "id": "hwhf4x8",
            "score": 1,
            "text": "My gf and i save up with weird random numbers, like when we return a purchase, that money would sometimes go to savings. Usually a weird one.\n\nBut then we were motivated to save up X amount so that it would look good in the savings account",
            "title_similarity": "0.73766375",
            "sentiment_compound": 0.936
        },
        {
            "id": "hwhf4xa",
            "score": 1,
            "text": "Just do compound exercises... Not that difficult... You'll get stronger and stronger by the first Month.\nDon't load up too much weight and you'll be fine.",
            "title_similarity": "0.53941524",
            "sentiment_compound": 0.797
        },
        {
            "id": "hwhfjny",
            "score": 1,
            "text": "Yeah but for some things you still should set a threshold or it's pointless doing it. For example workout has a reason why you do specific sets and reps. Doing not enough meaning no or very minimal results which just frustrates more possibly",
            "title_similarity": "0.7188984",
            "sentiment_compound": -0.2306
        },
        {
            "id": "hwhfnkp",
            "score": 1,
            "text": "Yes! I love the saying “don’t let perfect be the enemy of good”.",
            "title_similarity": "0.4867572",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hwhfopv",
            "score": 1,
            "text": "And go to bed whenever don't wait for 00:00 or 00:30  just go to bed at 23:46",
            "title_similarity": "0.52191985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhg3mb",
            "score": 1,
            "text": "“Perfection is the enemy of progress.”\n\n— My Wise High School Teacher",
            "title_similarity": "0.52447623",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hwhg9hd",
            "score": 1,
            "text": "I've heard this same concept phrased this way:\n\nYou may have heard others say, \"Do it right, or don't do it at all.\" But I say, \"Any step in the right direction, with the right intent, is better than no step in that direction.\"",
            "title_similarity": "0.6183836",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hwhgf21",
            "score": 1,
            "text": "Somebody with OCD just got the nastiest case of twitchy eye before dying shortly after reading this.",
            "title_similarity": "0.4499094",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hwhgk8v",
            "score": 1,
            "text": "“Good enough for Government work” 17 push ups when the goal was 20",
            "title_similarity": "0.49499506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhgs7p",
            "score": 1,
            "text": "Half-assed is better than no-assed!",
            "title_similarity": "0.3486362",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hwhgxg5",
            "score": 1,
            "text": "CGP Grey of /r/cortex did an [excellent video](https://www.youtube.com/watch?v=NVGuFdX5guE) on this subject.\n\nHe talks about having a *theme* to a year or a season or even a month, rather than setting concrete goals. That way, even if you change a trend from \"downward\" to \"still downward but less\", you win. \n\nDon't let perfect be the enemy of good enough.",
            "title_similarity": "0.7263551",
            "sentiment_compound": 0.326
        },
        {
            "id": "hwhh7us",
            "score": 1,
            "text": "I agree that doing things perfectly is not good for your mental health but finishing the task is still important. I found that doing 80% of the work makes me put half the effort and leads to poor quality. If I do 95%-100% of the work but put 80% effort I can feel satisfied that I have done enough to get the work done. Unfortunately for some things like exams doing 100% is not enough and you will still fail which is why I hate studying yet my community expects me to spend my 20s studying, doing a full time job and somehow have the energy to do fun stuff with friends.",
            "title_similarity": "0.7325132",
            "sentiment_compound": 0.612
        },
        {
            "id": "hwhh8jp",
            "score": 1,
            "text": "Proximal goals get you there. Smoke 100 blunts, you will get to the rest later!",
            "title_similarity": "0.46691567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhhk6x",
            "score": 1,
            "text": "Ok, so what I'm taking away here is that 17 is the exact, right number of pushups to do.",
            "title_similarity": "0.41512692",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwhhmn8",
            "score": 1,
            "text": "At 2:50 don't wait until three to start work/ studying.",
            "title_similarity": "0.36227524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhhzmw",
            "score": 1,
            "text": "If it isn’t you, than it’s someone else! We all have the same 24 hours, get yours bro",
            "title_similarity": "0.38701558",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhi7xu",
            "score": 1,
            "text": "Yep. Perfect is the enemy of done.",
            "title_similarity": "0.2806079",
            "sentiment_compound": 0.34
        },
        {
            "id": "hwhic4v",
            "score": 1,
            "text": "I like this. \n\nI’ve heard a psychiatrist talk about it being better to not focus on getting an outcome when you’re doing something. You just need to focus on what it is you need to do right now where you are. He used getting in shape as an example because “getting in shape” isn’t really an action that you can do right then and there, its the outcome of a lot of different actions that you take. You shouldn’t focus on the thought of keeping up with going to the gym for a year. You should just ask yourself “Am I going to the gym today?”. I think its a great thought and I’ve definitely felt an impact from applying it to different areas of life.",
            "title_similarity": "0.80411994",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hwhig2f",
            "score": 1,
            "text": "I keep doing this with sleep, if it's already under 7 hours might as well make it 6",
            "title_similarity": "0.53919536",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwhijin",
            "score": 1,
            "text": "Smoke 979 blunts",
            "title_similarity": "0.09339156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhiq62",
            "score": 1,
            "text": "Even if you go to the gym for 2 minutes to get accustomed in the beginning, you still showed up right? You went to the gym, next time you go for 5 minutes and you’ve already made progress",
            "title_similarity": "0.44168955",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwhjbfm",
            "score": 1,
            "text": "You're better to be 80% on time rather than 100% late",
            "title_similarity": "0.41799095",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwhjjtb",
            "score": 1,
            "text": "Another thing I want to add to this idea is, try to take out the prep steps, so you can go in swinging.\n\nEg. If you go to gym before work, Prep your gym bag the night before, so you can get up, grab the bag and go. \n\nOr if you have a busy work schedule, pre plan your next days schedule The night before\n\nOf if you’re just doing functional at home, lay the yoga mat out before you go to sleep \n\nYour past self has much more wisdom and patience than your current self. Leverage that",
            "title_similarity": "0.74199724",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hwhk4ah",
            "score": 1,
            "text": "I really resonate with this and came to the conclusion that I really suffer from those things.\n\nI've been trying to work on it and it takes time. I would say it's kinda like perfectionism.",
            "title_similarity": "0.557943",
            "sentiment_compound": -0.1442
        },
        {
            "id": "hwhk75c",
            "score": 1,
            "text": "Something is something and nothing is nothing might be my new limelight",
            "title_similarity": "0.44004345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhkigz",
            "score": 1,
            "text": "Perfection is the enemy of progress. Truly. Thank you for this post.",
            "title_similarity": "0.46657622",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hwhkn38",
            "score": 1,
            "text": "Depending on your goals this is very bad advice for working out",
            "title_similarity": "0.43407553",
            "sentiment_compound": -0.5849
        },
        {
            "id": "hwhktl5",
            "score": 1,
            "text": "Way late to the party but I use a mantra of “no zero days”. One push-up. Make the bed. Walk a mile. Walk a quarter mile maybe. Recycle all the fucking cardboard boxes. Just one of these things. Maybe it will turn into more. Maybe not. \nYou get the idea and I think it’s similar. No Zero Days.",
            "title_similarity": "0.7637258",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hwhkwft",
            "score": 1,
            "text": "In the same way, meet people or set your schedule to odd times instead of, say, 1pm sharp. Leave the building at 3:48. Less chance of congestion at elevators, parking exits, payment, etc.",
            "title_similarity": "0.6137608",
            "sentiment_compound": -0.2006
        },
        {
            "id": "hwhla7t",
            "score": 1,
            "text": "Heard somebody say “don’t let perfection be the enemy of the good” or something. Makes a lot of sense. 365 days of going at 15% is gonna far exceed 3 or 4 random days a year where you go 100%.",
            "title_similarity": "0.5944399",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hwhlik8",
            "score": 1,
            "text": "I actually started this policy a few days ago for myself. I always wanted to learn to draw and now that I have children I want to be able to draw cutesy animals for them. I want to be the ‘creative’ mom for them, want to help them to get in a creative mindset. \n\nI’ve being trying to be more ‘creative’ (learned myself photoshop, picture manipulation, photography and the like) but creating art out of nowhere wasn’t possible for me. Taking pictures is easy in a way. Quick result. But drawing takes too long before seeing result. \n\nAnd I wanted perfection. A good drawing, the first time if possible. \n\nBut now I want to practice, I want to create things for my children. They won’t judge whatever I do for them. They will think whatever I do and draw is perfect. Not because it is perfect, but because it is in their character to feel that way about the things I do. \n\nMe and my husband are the same way. I’ve loved every creative thing my mother has done (and still does). She works with glass and she isn’t (always) happy with the results. But I love her work and I don’t mind those little imperfections (I don’t see them or it simply doesn’t bother me. She put time and dedication in her work and I love having those things surrounding me.) So I hope to fill my house with her ‘imperfect’ works. \n\nAnd I am 26. I can judge her art. But I don’t because I love it. (When she asks for critic and feedback I feel comfortable to give her that. ) Love the fact that she created it. And since my children are already kind, I’m sure that they too will be so kind to my artwork. Even if it is imperfect. \n\nNow that my children are 20 months old, I would love for them to learn to use pencils too. It is good for their development. And since they don’t mind drawing on my paper, even if this ‘ruins’ my work, I don’t mind making mistakes. They learn to use pencils, I practise drawing and we spend time together! \n\nWhole anecdote. I’m just really proud of my mindset changing and I hope that I can continue this and use this mindset in other skills as well. I hope someone who reads this feels a bit motivated to start trying things. ❤️",
            "title_similarity": "0.7034395",
            "sentiment_compound": 0.9991
        },
        {
            "id": "hwhlmq0",
            "score": 1,
            "text": "Better yourself by 1% each day.\n\nYou'll be more than 37 times better after a year.",
            "title_similarity": "0.41704753",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hwhlnwr",
            "score": 1,
            "text": "Homie out here pretending 17 push ups and $138 ain't much",
            "title_similarity": "0.5365863",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwhlv3z",
            "score": 1,
            "text": "It depends. If you're supposed to do 20 pushups, but start to fail at 17, that's OK - get out of position, get your breath, and then get back in the position and do the remaining 3. That's how we build strength.\n\nThat said it is of course true that 17 is better than 0 and you absolutely should be pleased with yourself for going and definitely not kicking yourself over not finishing a set.",
            "title_similarity": "0.75700796",
            "sentiment_compound": 0.9628
        },
        {
            "id": "hwhm1i3",
            "score": 1,
            "text": "If it’s worth doing it’s worth doing poorly. \n\nExample….it running is with doing than running for a minute is worth doing…just keep doing it.",
            "title_similarity": "0.6220229",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwhmti6",
            "score": 1,
            "text": "Sometimes good enough is… good enough.",
            "title_similarity": "0.26259407",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hwhmumh",
            "score": 1,
            "text": "Someone described this to me in this way and for some reason it really stuck.\n\n\"Imperfect action is better than perfect inaction\"",
            "title_similarity": "0.5242424",
            "sentiment_compound": 0.1849
        },
        {
            "id": "hwhmxtx",
            "score": 1,
            "text": "Also, with the push up example, once you get to 17 it gets easier to push yourself and say “I’ll do 20”.\n\nIf you’ve done 1 or 2 and know you have 18 left, it can fill you with dread. If you do as many as you can, then aim to do 2/3 more to round it up, it helps with the mentality.",
            "title_similarity": "0.6644108",
            "sentiment_compound": 0.34
        },
        {
            "id": "hwhmywa",
            "score": 1,
            "text": "Thank you, I needed this. After having caught covid and being away for exams, I was dying to start training in gymnastics again. I was kinda disappointed with how my trainings went - but at least I went and did stuff. Next time will be better. Sometimes you need to remember where you came from and that not every step needs to be big :)",
            "title_similarity": "0.7766094",
            "sentiment_compound": 0.827
        },
        {
            "id": "hwhn2qx",
            "score": 1,
            "text": "Perfect being the enemy of good, as most always 👌🏼",
            "title_similarity": "0.3655284",
            "sentiment_compound": 0.8682
        },
        {
            "id": "hwhn8hu",
            "score": 1,
            "text": "Don’t set goals, set ideas. Don’t say “I’m going to lose 10kg this year” say “I’m going to lose weight this year” or “I’m going to develop my fitness”. That way you’re not focused on a number but instead the concept of what you’re doing.",
            "title_similarity": "0.647373",
            "sentiment_compound": -0.484
        },
        {
            "id": "hwhnmlq",
            "score": 1,
            "text": "Motivation is found through action, not the other way around.",
            "title_similarity": "0.30602968",
            "sentiment_compound": 0.34
        },
        {
            "id": "hwhnprf",
            "score": 1,
            "text": "This actually really helped me today",
            "title_similarity": "0.214281",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhnu4c",
            "score": 1,
            "text": "Perfect is the enemy of good.",
            "title_similarity": "0.31994802",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwhnwn5",
            "score": 1,
            "text": "Done is better than perfect.  Perfect is never done. Done one can be improved upon, if necessary, at a later date.\n\nhttps://hbr.org/2011/05/the-power-of-small-wins",
            "title_similarity": "0.59200764",
            "sentiment_compound": 0.9246
        },
        {
            "id": "hwhnwqg",
            "score": 1,
            "text": "Sometimes my standard is, “Better than last time.” For example, if I didn’t exercise last week, this week’s goal is to do any exercise at all.",
            "title_similarity": "0.52454734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwho1p0",
            "score": 1,
            "text": "If a job is worth doing, it’s worth doing badly.\nHalf a job is better than nothing, and 9/10 you’ll finish the job anyway. \n\nThe 80/20 rule is a good lesson to remember too.",
            "title_similarity": "0.62277603",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hwhodnm",
            "score": 1,
            "text": "Thanks mate, this is really helpful advice. I’m going to read more of that book I’ve been neglecting even if I can’t finish the chapter :)",
            "title_similarity": "0.6308129",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hwhp3kb",
            "score": 1,
            "text": "The goals aren’t the problem, it’s relying on them instead of your methodology that trips people up.\n\nFor example “I’m going to do 100 push-ups a day” is a fine goal, as long as your methodology is “I’m going to achieve that by seeing how many I can do in a day now; and slowly keep adding pushups every day until I’m at 100/day”",
            "title_similarity": "0.63461125",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hwhpa8z",
            "score": 1,
            "text": "This! Smoke 750 blunts instead of 1000.",
            "title_similarity": "0.28170455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhpelk",
            "score": 1,
            "text": "I agree. Too many people do this “all or nothing” approach which is doomed to fail once your initial motivation slows down. You won’t be 100% all the time and especially those times were you only reach <100% but still commit are the important times. \n\nThat being said actual tangible goals are very important too so you don’t always dabble around and never give your best my",
            "title_similarity": "0.71000075",
            "sentiment_compound": -0.0676
        },
        {
            "id": "hwhphul",
            "score": 1,
            "text": "This! \n\nI even have this approach with brushing my teeth (of course dental hygiene is very important).\n\nHowever, if I have a bad phase, this is something I struggle with. So I’m telling myself to just go brush my teeth for 20 seconds since it’s better than nothing. And often I end up doing it properly. If not, it’s still better than neglecting it at all.",
            "title_similarity": "0.74870646",
            "sentiment_compound": -0.7355
        },
        {
            "id": "hwhpilr",
            "score": 1,
            "text": "We've simplified and adopted this as our house motto.\n\n\"Something is better than nothing.\"\n\nSome effort is better than none essentially.",
            "title_similarity": "0.6566512",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hwhpixw",
            "score": 1,
            "text": "Agile is better than waterfall methodology in this case.",
            "title_similarity": "0.3758952",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwhpqie",
            "score": 1,
            "text": "Seriously my life has been a huge change since I've embraced the moto \"Anything worth doing, is worth doing poorly\". I used to never stick at workout, healthy eating, savings etc. Everything had to be \"the best\" (according to my tough self towards myself) and my life was basically going from one extreme (super healthy) to the other. But now, I choose to move every 2 to 3 days, be it 5min or a full workout. I eat a bit of veggies with my burger, and if I don't, then be it. Overall being kinder to myself and stopping the blame train has been tremendously positive!",
            "title_similarity": "0.6969676",
            "sentiment_compound": 0.9425
        },
        {
            "id": "hwhqber",
            "score": 1,
            "text": "Just smoke one blunt! And continue to do so *every day*. Then you will eventually work your way up to /u/Smoke1000Blunts without even knowing it!",
            "title_similarity": "0.481096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhqjr1",
            "score": 1,
            "text": "User name does not check out. \n\nSmoke 962 blunts.",
            "title_similarity": "0.30083692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhrf5c",
            "score": 1,
            "text": "So you'll be cool if I only smoke 997 blunts?\n\nJust kidding OP, this is a good tip.",
            "title_similarity": "0.46745896",
            "sentiment_compound": 0.7063
        },
        {
            "id": "hwhrg90",
            "score": 1,
            "text": "Something, never nothing.",
            "title_similarity": "0.104157664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhrmmn",
            "score": 1,
            "text": "You can move forward, or you can move backwards. Those are your only two options. Time marches on regardless, and there's no such thing as standing still on *anything*.\n\nHow fast you move forward is much, *much* less important than just making the choice *to* move forward, and not to move backwards. The rest is just different gradations of success.",
            "title_similarity": "0.6244229",
            "sentiment_compound": 0.4601
        },
        {
            "id": "hwhrzyl",
            "score": 1,
            "text": "I’m sure this is in here somewhere but I’ve always LOVED the quote “Don’t let perfection be the enemy of the good.” Or something like that. I think about it like once a day!",
            "title_similarity": "0.55080885",
            "sentiment_compound": 0.945
        },
        {
            "id": "hwhs1qw",
            "score": 1,
            "text": "\"Anything worth doing is worth doing badly\"",
            "title_similarity": "0.38083833",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwhs2b2",
            "score": 1,
            "text": "I disagree. \n\nConsistency is key and hitting a certain number provides clarity and helps benchmark whatever goal is next.",
            "title_similarity": "0.53864837",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hwhs9gg",
            "score": 1,
            "text": "One of the best LPT's I've seen in a while. \nIt also motivated to clean (part of) my patio this morning.",
            "title_similarity": "0.4625589",
            "sentiment_compound": 0.872
        },
        {
            "id": "hwhsalj",
            "score": 1,
            "text": "It probably stops you from pushing yourself... Like you are doing pushups and you can probably do like 23... But you stop at 20 because that's what you were thinking at first... So you basically slow down your progress",
            "title_similarity": "0.6422146",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwhsefk",
            "score": 1,
            "text": "why not save everything and only spend what you need?",
            "title_similarity": "0.4890412",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hwhseg3",
            "score": 1,
            "text": "as someone with ADHD, this really is a mindset I need to adopt.",
            "title_similarity": "0.41030997",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hwhsqj1",
            "score": 1,
            "text": "Cheers mate, \n\nYou have no idea how.. relevant this is to me.",
            "title_similarity": "0.2907526",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hwhsumd",
            "score": 1,
            "text": "I really needed to read this right now so thankyou",
            "title_similarity": "0.3780708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwht3eo",
            "score": 1,
            "text": "Rome wasn't built in a day but it was built one brick at a time.",
            "title_similarity": "0.39130074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwht3wx",
            "score": 1,
            "text": "On that note, use a to-do list and track how much work you get done. It worked miracles for me.\n\nJust put anything you need to get done on there, no matter how small a task it might be (you can even include daily routine if you feel like it, especially if you struggle with depression, everything counts). If there is a big task, split it into sub-tasks and handle them individually. Maintain the list every day and think about what want to do the next day. Track how many tasks you completed each day. It helps to put this self-reflection on the list as well, so you don't forget. Include things like meetings or other tasks you have to perform for work/school/etc. Also include activities you think are meaningful to you, like sports, practicing an instrument or whatever. \n\nThis way you really get a feeling for what you need to do and how much you actually do on a regular basis, even if it's something you don't  want to do or something you think is pointless. This will not only make you much more organized, but it might also show you that you're more productive than you think. Moreover it is very rewarding when you have a very productive day and you can tick your list and put it down in numbers. It will automatically make you want to achieve more and you can visualize your progress this way.\n\nBut you have to be somewhat strict and not cheat on yourself. You can set up your own rules for what constitutes a task and so on, but try not to betray them. Maybe question whether they make sense, but don't abandon them for no good reason.",
            "title_similarity": "0.63117623",
            "sentiment_compound": 0.9717
        },
        {
            "id": "hwht8ol",
            "score": 1,
            "text": "And start day one of a new habit even if it’s a Wednesday in the middle of the month. Don’t wait until Monday or the 1st or January. If you want to start doing it then start doing it today.",
            "title_similarity": "0.47901082",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwhtfe6",
            "score": 1,
            "text": "This is really good. I read somewhere this week about a way to break the \"going to the gym\" funk many of us have when trying to get healthier. The tip was simple, but had some genius to it: Whenever you don't want to work out, still go to the gym. You don't have to enter, and if you do enter you don't have to do any exercise. Just go, consider it the victory of the day. Sometimes, being there will be the incentive to work out, and if so, do it. It not, that's OK too. It's something, and something is always better than nothing.",
            "title_similarity": "0.7496907",
            "sentiment_compound": 0.6925
        },
        {
            "id": "hwhthkj",
            "score": 1,
            "text": "my college mantra: “D for DUN”",
            "title_similarity": "0.36734128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhtskt",
            "score": 1,
            "text": "Or don't move. Sall good. Life needs to eat.",
            "title_similarity": "0.45645466",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hwhu4up",
            "score": 1,
            "text": "Don’t let perfect be the enemy of good. Is how I was taught this idea.",
            "title_similarity": "0.49083036",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwhu52r",
            "score": 1,
            "text": "It’s “progress” not “perfection”",
            "title_similarity": "0.24433987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhu5ms",
            "score": 1,
            "text": "Very underrated LPT. Do I condone this? Yes.\nWill I go do the 69 pushups now instead of sleeping? No.",
            "title_similarity": "0.7042445",
            "sentiment_compound": 0.54
        },
        {
            "id": "hwhucl8",
            "score": 1,
            "text": "Better to get a C than a 0.",
            "title_similarity": "0.39374912",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwhuhi1",
            "score": 1,
            "text": "It all counts. Everyday you have a choice to do something towards your goal or do something away from your goal.\n\nEven the tiniest step towards your goal gets you closer! Going backwards is not an option. At least try to stay in place.",
            "title_similarity": "0.6107471",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhuqza",
            "score": 1,
            "text": "I find tidying my roam like sieving where you start with a bigger mesh which slowly gets finer. The goal is never to get a perfectly organised room, but it's to get one step closer. The previous organisation makes the next organisation slightly easier.",
            "title_similarity": "0.72575116",
            "sentiment_compound": 0.7657
        },
        {
            "id": "hwhuuft",
            "score": 1,
            "text": "How do you eat an elephant?",
            "title_similarity": "0.27975756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhux04",
            "score": 1,
            "text": "There's an aphorism \"Don't Let Perfect Get In the Way Of Good\"",
            "title_similarity": "0.42992386",
            "sentiment_compound": -0.0253
        },
        {
            "id": "hwhuzla",
            "score": 1,
            "text": "Says smoke 1000 blunts. \n\nBro, 762 is a good enough goal.",
            "title_similarity": "0.33639184",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwhv345",
            "score": 1,
            "text": "I developed this mindset when I was trying to workout Everyday after work. I'd come from work with bike and that would be a nice warmup to jump straight into weightlifting. But sometimes you have a bad day at work. Or a whole week and just don't have energy/motivation to do the workout.\nSo to combat the lack of motivation I set up my training in a way that I do most important workout first and then gradually progress to less important or alternative movements/sets. So on a bad day, trying to do the first part only that takes like 15-20min is better than doing nothing. Consequently some of these days I ended up doing the whole workout just from the mindset \"I'm just gonna do a bench press and that's all\" and on the days that I only did 1 workout I still did the most important one and that adds up in a long run.\nYou can apply this sort of pattern to anything and I think you will always profit from the actions that you take in your life. \nThanks for posting this, a great reminder to never stop trying and keep going no matter what. Cheers!",
            "title_similarity": "0.7372182",
            "sentiment_compound": 0.978
        },
        {
            "id": "hwhv3ms",
            "score": 1,
            "text": "Love the comment/s for sure. But a procrastinator that I truly want to change I know it sounds dumb Af ! But any help on how yall got out the cobwebs?",
            "title_similarity": "0.63999814",
            "sentiment_compound": 0.7871
        },
        {
            "id": "hwhvfmv",
            "score": 1,
            "text": "If it doesn't end on a 5 or a 0 then I'm not interested",
            "title_similarity": "0.38656542",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hwhvpa7",
            "score": 1,
            "text": "This is exactly what I needed this morning. Thank you.",
            "title_similarity": "0.29913366",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwhvu9l",
            "score": 1,
            "text": "Chapters aren’t arbitrary.",
            "title_similarity": "0.17743921",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhvzo8",
            "score": 1,
            "text": "Hahahah thank you for this reminder",
            "title_similarity": "0.22052318",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwhw3nh",
            "score": 1,
            "text": "I think I needed this, thank you!",
            "title_similarity": "0.23902385",
            "sentiment_compound": 0.4883
        },
        {
            "id": "hwhwcud",
            "score": 1,
            "text": "I have my 'do one' principle. If I am trying to accomplish something and am struggling with motivation (which tbh is most days), I try to build-in success by moving the goalposts to something that requires minimal effort.\n\nIf I am trying to do more press-ups and I don't have a routine established, my goal is to do one. If I do more than that when I'm down there, great, but if not then I've achieved what I've needed to. I can always go again in the afternoon/evening/tomorrow/next week. It helps break the inertia of doing nothing.",
            "title_similarity": "0.7626605",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hwhwkan",
            "score": 1,
            "text": "thank you for this ❤️",
            "title_similarity": "0.14826322",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwhwviv",
            "score": 1,
            "text": "Sometimes just doing anything, no matter how little, is good enough. Room is a mess? Well maybe you can just do the laundry for now.",
            "title_similarity": "0.6675713",
            "sentiment_compound": 0.2841
        },
        {
            "id": "hwhx2kl",
            "score": 1,
            "text": "This is the exact mentality we fail to teach in our schools. At least try. Perfection isn't necessary nor does it really matter. Something is infact better than nothing.",
            "title_similarity": "0.63083965",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hwhx5n1",
            "score": 1,
            "text": "Yes!! One of my favorite sayings is \"don't let the perfect become the enemy of the good.\"",
            "title_similarity": "0.55124044",
            "sentiment_compound": 0.3991
        },
        {
            "id": "hwhxcly",
            "score": 1,
            "text": "Don’t let the perfect be the enemy of the good",
            "title_similarity": "0.44485885",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwhygsr",
            "score": 1,
            "text": "This is real good advice. I'd also say that being a perfectionist without any progress is just being an over-thinker. There's a real difference between those two kinds of people",
            "title_similarity": "0.63616127",
            "sentiment_compound": 0.471
        },
        {
            "id": "hwhz3e7",
            "score": 1,
            "text": "This is one of the best LPTs I've seen in a while imo, thanks OP!",
            "title_similarity": "0.2980467",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hwhz47y",
            "score": 1,
            "text": "Perfection is the enemy of the good.",
            "title_similarity": "0.37012267",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hwhzauk",
            "score": 1,
            "text": "Just chip away at your goals. In time, you can chip away larger pieces, but you will probably start with smaller pieces. It's a marathon, not a sprint.",
            "title_similarity": "0.7167901",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwhzeik",
            "score": 1,
            "text": "Finally, I LPT that actually wise!",
            "title_similarity": "0.13057673",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hwhzkm0",
            "score": 1,
            "text": "Small progress is still progress",
            "title_similarity": "0.211442",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hwhzm6a",
            "score": 1,
            "text": "Anything is better than nothing. I have to remind myself of this all the time. Especially if I fall off the gym for a bit and then I get motivated to go on a Wednesday, and then I start thinking “we’ll I’ll wait till Monday to start, because I’d rather start at the beginning of a week so it’s ‘a clean’ start.”\nNah fuck that. If it’s a Wednesday when you feel like working out - start on a Wednesday. Just fucking start. Always works out so much better. Its ok if that one week is a little lopsided, in the long run it won’t matter. What matters is building that habit",
            "title_similarity": "0.6960219",
            "sentiment_compound": 0.8434
        },
        {
            "id": "hwhzuip",
            "score": 1,
            "text": "Can we get hourly updates on prices? 😛",
            "title_similarity": "0.3713094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi093g",
            "score": 1,
            "text": "Momentum is the key",
            "title_similarity": "0.20952037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi13dj",
            "score": 1,
            "text": "In the pursuit of perfection, don't fail to do good.",
            "title_similarity": "0.34417313",
            "sentiment_compound": 0.8573
        },
        {
            "id": "hwi18of",
            "score": 1,
            "text": "You don't know any type A folks, do you?!",
            "title_similarity": "0.21561188",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi1bxm",
            "score": 1,
            "text": "\"Something is something, and nothing is nothing.\" I like that!\n\nThank you for sharing your post, this helped me retrain my perspective of acomplishments and gave me new insight on how to become more producitve without becoming too overwhelmed.",
            "title_similarity": "0.5912876",
            "sentiment_compound": 0.5162
        },
        {
            "id": "hwi2n0p",
            "score": 1,
            "text": "Kevin Smith had a great quote about progress where he says something like; “you don’t have to climb Everest everyday. Sometimes you just put the bar on the floor, step over it and go, “ta-da!”",
            "title_similarity": "0.65045226",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hwi2p30",
            "score": 1,
            "text": "This is so true. Pre-covid, I exercised for almost the whole year because I told myself I *only* had to get to the park (about 10 blocks away) and once there I could come back home. Every time, I’d get to the park and inevitably take at least one round on the track because I was there already, so might as well.\n\nEventually I started doing 2-5 rounds (about 1-1.5 hours every other day) and *walking back home* on top of that, even though I was “giving myself permission” to take the bus back if I was tired.",
            "title_similarity": "0.62494457",
            "sentiment_compound": 0.4552
        },
        {
            "id": "hwi33c5",
            "score": 1,
            "text": "Very true. Trying to get the round numbers just stresses me out and I end up not enjoying the activity. Great tip",
            "title_similarity": "0.61930597",
            "sentiment_compound": 0.3436
        },
        {
            "id": "hwi3e0c",
            "score": 1,
            "text": "My therapist agrees",
            "title_similarity": "0.24489692",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hwi3m9h",
            "score": 1,
            "text": "keep moving forward",
            "title_similarity": "0.11201717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi41th",
            "score": 1,
            "text": "If it's worth doing, it's worth doing badly.",
            "title_similarity": "0.2943452",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwi42ld",
            "score": 1,
            "text": "Great mindset, thanks for sharing this",
            "title_similarity": "0.16404682",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hwi4xgi",
            "score": 1,
            "text": "I take this advice to the extreme and never put enough effort into anything",
            "title_similarity": "0.4260196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi51vw",
            "score": 1,
            "text": "I think \"microaccomplishments\" are in this same mindset. If a task is overwhelming, break it down to all its parts and do any of them. Life changing way of thinking.",
            "title_similarity": "0.4617623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi527s",
            "score": 1,
            "text": "Move 1/2 your stuff and leave the rest.\n\nBook a vacation you'll never get the time off for and just go.\n\nPlant flowers outside of every AirBNB you visit in the summer time.",
            "title_similarity": "0.4984148",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hwi5i6f",
            "score": 1,
            "text": "Even if you half ass something, it’s better than not doing it at all\n\nStart small",
            "title_similarity": "0.5182229",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hwi5w1s",
            "score": 1,
            "text": "Orrr... Just accept yourself outright.\n\nUnless a doctor tells you that your health is bad, just be you. There's never been a need to run around trying to be more than yourself. Everything you've ever wanted and everything you've ever wanted to be, you already have and already are.\n\nRelax and enjoy the ride.",
            "title_similarity": "0.59155464",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hwi6dzk",
            "score": 1,
            "text": "Perfection is the enemy of progress",
            "title_similarity": "0.38121942",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwi6fbt",
            "score": 1,
            "text": "Great tip, but as someone diagnosed with OCD this is incredibly hard advice to take my brother ahah",
            "title_similarity": "0.57132006",
            "sentiment_compound": 0.1307
        },
        {
            "id": "hwi6p60",
            "score": 1,
            "text": "There's an aphorism that basically says the same thing: Don’t Let “Perfect” Be the Enemy of “Good”",
            "title_similarity": "0.45873278",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hwi7j4o",
            "score": 1,
            "text": "yes! I've been trying to get rid of that black and white thinking lately. it's so hard!",
            "title_similarity": "0.56740296",
            "sentiment_compound": 0.3438
        },
        {
            "id": "hwi80qj",
            "score": 1,
            "text": "The grind. It adds up over time. I learned this best from playing Destiny2.",
            "title_similarity": "0.43186966",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hwi8d0c",
            "score": 1,
            "text": "Anything worth doing is worth doing poorly! Brushing your teeth for 10 seconds is better than not brushing at all.",
            "title_similarity": "0.6500827",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hwi8msx",
            "score": 1,
            "text": "Username checks out",
            "title_similarity": "0.07270523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwi8qd0",
            "score": 1,
            "text": "Our brain seems to like round figures because they're easy to tally in our head but technically not that different",
            "title_similarity": "0.49990612",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hwi8qvx",
            "score": 1,
            "text": "TL;DR: treat getting started as a win & win the day with 1% gains. if you struggle with activation energy // inconsistency, simply showing yourself that you can show up for yourself on a regular basis can be a game changer. in my experience, compounding interest is all it’s cracked up to be :)\n\ni got back in shape by considering it a win if i got dressed and walked 5 min to the field i chose as my workout spot. i would basically make a contract with myself that i could leave/stop anytime i wanted and that i would heartily celebrate the fact that i showed up if that were the case (vs. beating myself up about it) — there were a few times where i took the out i gave myself and left after a couple minutes, but most of the time i would end up working out for a significant amount of time (anywhere between 20-90 minutes). \n\nif activation energy is an issue for you, i would highly recommend this approach — if you treat showing up//simply starting as the bar for success, it’s so much easier to get show up//get started",
            "title_similarity": "0.67684114",
            "sentiment_compound": 0.9864
        },
        {
            "id": "hwi8rr5",
            "score": 1,
            "text": "My dad told me once when I brought home a shitty report card that a 0 on an assignment is really TWO Fs, and that stuck. Better to turn in something and get 50% than to not turn it in at all. True waaaaay beyond homework.",
            "title_similarity": "0.67424417",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hwi9ss4",
            "score": 1,
            "text": "My recent attitude has been a shift to focus on routine over results. Mainly towards fitness. The days where I just don’t feel like doing anything I don’t pressure myself to go hard or anything but instead to just show up and do something. The consistency that brings has brought a lot of positive changes.",
            "title_similarity": "0.66590416",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hwiaeod",
            "score": 1,
            "text": "To complement this, notice which tasks involve lots of prep work and extra friction before you can start them, and try to remove the extra friction or else reserve them for when you can work on them in fewer sessions.",
            "title_similarity": "0.7108036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwiba83",
            "score": 1,
            "text": "My grandfather used to say \"even a single step forward is progressing\"",
            "title_similarity": "0.4078129",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwibvem",
            "score": 1,
            "text": "This is the MOALPT",
            "title_similarity": "0.016440786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwid7kj",
            "score": 1,
            "text": "Keep moving is the key here. You can get good in almost anything if you just make it a habit, and the best way of not falling off is to not do it to much at the time and to not worry about doing it optimally.",
            "title_similarity": "0.69398236",
            "sentiment_compound": 0.9052
        },
        {
            "id": "hwidvaj",
            "score": 1,
            "text": "an old saying from my days years ago in a 12 step program is one of the few positives I got from that era, \"progress, not perfection\".",
            "title_similarity": "0.52245843",
            "sentiment_compound": 0.4943
        },
        {
            "id": "hwie4d3",
            "score": 1,
            "text": "That's some good advice, wish i could follow it myself but i am an perfectionist, it's all or nothing for me and thus mostly nothing.",
            "title_similarity": "0.59189034",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hwie6oi",
            "score": 1,
            "text": "“And now that you don’t have to be perfect, you can be good.”\n\nEast of Eden changed my life. This quote was the main reason.",
            "title_similarity": "0.5880539",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwieife",
            "score": 1,
            "text": "My doctor has a favorite saying, \"just get'r done\".",
            "title_similarity": "0.4861068",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hwienaj",
            "score": 1,
            "text": "You should really finish that chapter.",
            "title_similarity": "0.32391948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwiesgn",
            "score": 1,
            "text": "\"Anything worth doing is worth doing badly\" - GK Chesterton",
            "title_similarity": "0.43507615",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hwig06u",
            "score": 1,
            "text": "If you improve 1% each day, you'll have improved nearly 38x by the end of a single year",
            "title_similarity": "0.3400826",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hwig2gj",
            "score": 1,
            "text": "Reading 1/3 of a chapter is blasphemy.",
            "title_similarity": "0.4151201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwig506",
            "score": 1,
            "text": "There’s a book where some guy writes about making his bed everyday",
            "title_similarity": "0.49159652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwih7fp",
            "score": 1,
            "text": "Similar to this I always like to say \"if it's worth doing, it's worth doing poorly.\" When I'm deep in depression it can be hard for me to shower or brush my teeth, but washing my face and using some mouthwash is a step in the right direction and it helps me feel a little better.",
            "title_similarity": "0.6910597",
            "sentiment_compound": 0.7852
        },
        {
            "id": "hwihri1",
            "score": 1,
            "text": "I needed this today. \n\n#thank u",
            "title_similarity": "0.32747668",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwihwin",
            "score": 1,
            "text": "So so true. I've gotten started reading again and I have a super low bar goal of reading 1/2 a page a day from any of the books I'm currently working on. I've made so much more progress than I have in the past when I've set goals of 1 chapter a day or something like that. The positive feedback loop of \"hey, I actually met my goal for today! I might read a bit more now since I'm actually having fun and making progress\" is addicting. We can do it!",
            "title_similarity": "0.6276394",
            "sentiment_compound": 0.9695
        },
        {
            "id": "hwiihdj",
            "score": 1,
            "text": "If it’s worth doing then it’s worth doing poorly",
            "title_similarity": "0.31116295",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwiii7v",
            "score": 1,
            "text": "Direction, rather than a goal",
            "title_similarity": "0.21383497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwijl23",
            "score": 1,
            "text": "I would really recommend checking out a book called Atomic Habits by James Clear.\n\nI can't and therefore won't attempt to summarize what the book is about, but all I can say is that it monumentally iterates on the concept of doing some a little bit every day. 1% improvement results in 365% improvement in a year. Showing up is half the work and other stuff like that. I'm halfway through it now and it's really quite eye opening.",
            "title_similarity": "0.7414326",
            "sentiment_compound": 0.9318
        },
        {
            "id": "hwikfac",
            "score": 1,
            "text": "Precisely. Perfection can be an enemy of consistency.",
            "title_similarity": "0.3528965",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hwikubv",
            "score": 1,
            "text": "I started doing 1-3 pull-ups every time I left my office and before too long I can do 5-10 no problem! This is really great advice, I second this. 1 is better than none.",
            "title_similarity": "0.62653065",
            "sentiment_compound": 0.8703
        },
        {
            "id": "hwil0fe",
            "score": 1,
            "text": "You don’t even have to smoke 1000 blunts!! It could be 1021! Or 927!",
            "title_similarity": "0.43193507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwil1pc",
            "score": 1,
            "text": "17 push-ups sounds a bit high for the people on here",
            "title_similarity": "0.33425862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwimbiq",
            "score": 1,
            "text": "Progress not perfection. Perfection being the dream and progress being the goal",
            "title_similarity": "0.42902207",
            "sentiment_compound": 0.1541
        },
        {
            "id": "hwimflr",
            "score": 1,
            "text": "the real LPT is not in the comment section",
            "title_similarity": "0.25791603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwimj84",
            "score": 1,
            "text": "This.\n\nAnd also: literally do one. One pushup, one USD, one page. Often enough you're building momentum and keep going, if not you're habitualizing to start and it'll be easier next time to maybe do two. I started swimming by doing one lab back-and-forth, a year ago. Now I'm at 1km twice a week and steadily pushing higher by \"maybe I can do one more lab next time\".",
            "title_similarity": "0.59885746",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwio3vp",
            "score": 1,
            "text": "Coming from someone who is OCD when it comes to numbers (I tend to do things in 3's, I always pump gas to an even number etc.) this post means a ton.  I am going to take that to heart as permission to stop before I get to that magic number and quit with the \"all or nothing\" mentality which really is not serving me.  Thank you!",
            "title_similarity": "0.68850166",
            "sentiment_compound": 0.418
        },
        {
            "id": "hwio8je",
            "score": 1,
            "text": "Thank you for this. As someone that deals with depression and anxiety I tend to do the same thing. I like to begin my day by making a list of things to accomplish even really small things, so the list ends up being a little long. However it’s satisfying to cross off each item. I also have an interpretation of a small part of the book of bushido (hagakure) where it explains that action must be taken within seven breaths otherwise the task may not ever get completed and may not get completed with the same vigor. It’s much like a “1,2,3” method but feels a little more “natural” to me. Also the outcome won’t be any worse by pushing yourself to do the task ‘now’ rather than later. Be like a samurai, get shit done, even if it’s a small task.",
            "title_similarity": "0.7827536",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hwiowq8",
            "score": 1,
            "text": "Too many prime numbers >.<",
            "title_similarity": "0.24860162",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hwipzah",
            "score": 1,
            "text": "This ain't for people with OCD. I need to round everything up or down.",
            "title_similarity": "0.5793839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwiqka5",
            "score": 1,
            "text": "This is a good thing for me to remind myself of. My brain likes numbers in intervals of 5,  but sometimes that 17th squat is the last one I can manifest without pushing too much.",
            "title_similarity": "0.6432443",
            "sentiment_compound": 0.431
        },
        {
            "id": "hwir6il",
            "score": 1,
            "text": "Every step is  a step forward.",
            "title_similarity": "0.0996932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwirgit",
            "score": 1,
            "text": "Smoke 937 blunts",
            "title_similarity": "0.09260257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwisd50",
            "score": 1,
            "text": "I heard or read this same idea recently and it definitely spoke to me when struggling with depression. “Anything worth doing, is worth doing poorly”. If you can only brush your teeth for 30 seconds, you still win today because you did what you could. 30 seconds today is 40 seconds tomorrow and it builds from there. (And if you backslide that’s ok too).",
            "title_similarity": "0.6591644",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hwiultl",
            "score": 1,
            "text": "As someone who would rather not do something because I can’t give it 1000% something is better than nothing",
            "title_similarity": "0.5990896",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwiups2",
            "score": 1,
            "text": "Real LPT - \"Be content with mediocrity\". \n\nWhat was the quote? \"Paint poorly, dance awkwardly, flirt clumsily\".",
            "title_similarity": "0.45983326",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hwiveoi",
            "score": 1,
            "text": "I started with 1/3 of a chapter while i pooped now i read a book in a week",
            "title_similarity": "0.3755278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwivfa2",
            "score": 1,
            "text": "This has been something I've learned with my body in my yogic practice.  Poses can be very challenging, and for wildly different reasons.  Sometimes your body isn't flexible enough yet, sometimes your muscles are not strong enough yet.  It is ok to do variations (like how we used to do push-ups on our knees before doing them with \"correct form) it is ok learning to just balance yourself, and it's definitely ok to stop every 5 minutes for water if you need it.",
            "title_similarity": "0.66661656",
            "sentiment_compound": 0.729
        },
        {
            "id": "hwivwus",
            "score": 1,
            "text": "Well that's something",
            "title_similarity": "-0.13314424",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwiw5ot",
            "score": 1,
            "text": "I've been mining crypto and my system does 79 MH/s this bothered me to an extent that I would rather get it to 80 MH/s but have unstable system and crash then let it run at 79 MH/s . IDK why brain do this",
            "title_similarity": "0.66273797",
            "sentiment_compound": -0.8837
        },
        {
            "id": "hwiwhpd",
            "score": 1,
            "text": "Forward is forward no matter how slow/small.",
            "title_similarity": "0.19521569",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hwixeqw",
            "score": 1,
            "text": "Some things are overwhelming because effort cannot translate to results. Like what can I do to make me any less ugly and any more a person worthy of being cherished?",
            "title_similarity": "0.6691654",
            "sentiment_compound": 0.7146
        },
        {
            "id": "hwixg4b",
            "score": 1,
            "text": "yeah, I respect this mindset but it's not for me.  \n\n\nI set a goal. I meet that goal. If I don't, it's failure. I accept the failure and I try again. I don't pat myself on the back for it, I just reassess my goals. Jocko Willik has a pretty good take on the gym stuff too - something along the lines of \"on those days that you don't feel like it - do more than usual.\" or something. You get the idea.  \n\n\nNever give up though. That's the common lesson.",
            "title_similarity": "0.7082566",
            "sentiment_compound": 0.8919
        },
        {
            "id": "hwiykwq",
            "score": 1,
            "text": "I know I’m late, but recently I told my students this and I think it applies:\n\n“Time does not sit still for you. If you are not growing then you are being left behind. Before long, you will pass everyone else on this road and excel”",
            "title_similarity": "0.6743169",
            "sentiment_compound": -0.1967
        },
        {
            "id": "hwizk6m",
            "score": 1,
            "text": "As someone in their 30s with a recent ADHD diagnosis, this method works wonders.\n\nDont fall victim to all or nothing mentality",
            "title_similarity": "0.53118634",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hwizwx4",
            "score": 1,
            "text": "Perfection is a flaw, by definition. 💯",
            "title_similarity": "0.32149354",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwj0cy9",
            "score": 1,
            "text": "Your name is quite the goal.",
            "title_similarity": "0.14895368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwj0kgg",
            "score": 1,
            "text": "How many blunts in to 1000 are ya?",
            "title_similarity": "0.18582132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwj0p9z",
            "score": 1,
            "text": "I love this! Wabi sabi is the way.",
            "title_similarity": "0.15959334",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hwj18so",
            "score": 1,
            "text": "Smoke 997 blunts. Don't worry about those last 3 my man!",
            "title_similarity": "0.4689849",
            "sentiment_compound": 0.4015
        },
        {
            "id": "hwj261t",
            "score": 1,
            "text": "This took me forever to learn in the software engineering world. I’d get a huge project and feel overwhelmed and just terrified at the amount of work to be done. \n\nSo I set weekly goals and try and accomplish those. Implement this page by Friday, create this logo by Wednesday, etc. \n\nIt really helped me let go of the “project” and focus on the goals and it eased the mindset a bit.",
            "title_similarity": "0.6464052",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hwj33os",
            "score": 1,
            "text": "You might not gain a level, but you still got experience.",
            "title_similarity": "0.44609845",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hwj3a55",
            "score": 1,
            "text": "I haven't tried Libby and it looks more user friendly compared to Overdrive.\n\nI'm also a fan of Hoopla.",
            "title_similarity": "0.601084",
            "sentiment_compound": 0.6983
        },
        {
            "id": "hwj7bha",
            "score": 1,
            "text": "i used to do this, then i am getting lazy and forgot. thanks for the reminder - will try to do pushup again daily",
            "title_similarity": "0.66322756",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hwj80n3",
            "score": 1,
            "text": "Only wipe your ass halfway clean. got it.",
            "title_similarity": "0.32958764",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hwj8z8j",
            "score": 1,
            "text": "Exactly! For example, if you have 1000 blunts, it’s okay to smoke a few a day instead of all of them in one sitting!",
            "title_similarity": "0.3574027",
            "sentiment_compound": 0.3578
        },
        {
            "id": "hwj9anl",
            "score": 1,
            "text": "“Perfection. Goal always changes. Can chase. Cannot reach.”\n\n-Abathur",
            "title_similarity": "0.42502734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwjbele",
            "score": 1,
            "text": "This is a big one, especially for anyone who is a perfectionist. Realizing this is a game changer",
            "title_similarity": "0.41336614",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hwjfkqi",
            "score": 1,
            "text": "I like to every now and then knock out a solid set of 20 push-ups. Gives me a good idea on how fit I'm feeling when compared to when I was a teen.",
            "title_similarity": "0.5448445",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hwjflcy",
            "score": 1,
            "text": "This is exactly how I get myself to keep working on this giant digital drawing I've been doing. Even if I only draw a single line, I've still done something. And usually it gets me to do a little bit more once I've done that first line.\n\nExcellent tip, OP",
            "title_similarity": "0.55719185",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hwjgxpy",
            "score": 1,
            "text": "The first variation on this theme that stuck for me was \"Anything worth doing is worth doing poorly\".\n\nIt's a little harder to wrap your head around than some of these other nice quotes that people are sharing. Doing something poorly sounds so undesirable, and it is so contrary to the advice we often hear about always doing your best and putting your all into everything you do. \n\nBut there's just so much to do in this life and there are usually diminishing returns the closer you get to ~perfection~. Of course, it doesn't mean to only aim to do things poorly, but rather just do your best in that moment without focusing too much on the outcome.\n\nI think this is also very helpful because many things in life are time sensitive. It is often better to get something done early but not perfect than perfect but too late.",
            "title_similarity": "0.77553254",
            "sentiment_compound": 0.9458
        },
        {
            "id": "hwjkb9d",
            "score": 1,
            "text": "I started off doing 1 minute on the elliptical about 2 weeks ago and now I’m up to 4 minutes. Any small amount of improvement is worth it, don’t let anyone mock you for it",
            "title_similarity": "0.5733621",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwjkqp7",
            "score": 1,
            "text": "How? Ive drilled into myself that things arent worth doing unless they are done properly. The people ive looked up to had issues where theyd do something for the sake of telling themselves they did it but effectively achieved nothing. For example, my mom is overweight for many years now and will do something really light like a walk once a month. While i agree walking is good, you cant say you walked therefore you did what u needed to do related to your weight for the week. If she walked a bit every day id have no problem. If she did something more substantial once a week id have no problem.  But she walks once in a blue moon and does it only so that she can justify not doing anything which will actually help her since that stuff is not fun or easy. I dunno, i guess this is another thing which needs balance. Unlucky, im not good at that.",
            "title_similarity": "0.7255177",
            "sentiment_compound": 0.9221
        },
        {
            "id": "hwjnj3u",
            "score": 1,
            "text": "Thanks OP you helped me today. It means a lot.",
            "title_similarity": "0.24954104",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwjnzmn",
            "score": 1,
            "text": "Before I grew out of perfectionism (and I’m still growing out of it), yeah saying perfection is the enemy of done would have given me a panic attack… fast forward a few years I had to break this cycle literally, I had to break myself out of perfectionism before it broke me. I’ve had mental breakdowns over not doing everything “right”. although it’s weird I’m grateful for it, because I know balance now",
            "title_similarity": "0.7109173",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hwjrpyo",
            "score": 1,
            "text": "Smoke 993 blunts...",
            "title_similarity": "0.12639394",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwjsscd",
            "score": 1,
            "text": "So I would not call myself a writer, but for the past decade I've had this idea for a fantasy romance story. However, I've never been able to put pen to paper for it. Recently I've been reading a lot of pulpy trashy fantasy romance... And I realized that if these people can write their silly love stories, so can I. Unconsciously I was comparing my unwritten fantasy story to the greats like Tolkien and George RR Martin. And I was discouraging myself anytime I felt like my ideas weren't as good as theirs. Which was all of them, because I am an untrained amateur and they are literally professionals. \n\nSo I have let go of that expectation and now I am the farthest I've ever been writing a story longer than a few pages.",
            "title_similarity": "0.6742456",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hwjumne",
            "score": 1,
            "text": "Well, it’s 3:21pm. Time to shower.",
            "title_similarity": "0.2951362",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hwjy7aw",
            "score": 1,
            "text": "“First master the habit of showing up and then you can work into making it perfect.” No an exact quote but basically what James Clear mentions on his book Atomic Habits. Very interesting read for anyone trying to get better habits or get rid off bad ones.",
            "title_similarity": "0.7412157",
            "sentiment_compound": 0.7086
        },
        {
            "id": "hwk38el",
            "score": 1,
            "text": "This is my daily life. I sit and do nothing because I don’t have time to do everything. It’s a disease of my mind. Sometimes I stop and think wait why couldn’t I just do one small thing right now even if I can’t do everything. And this really confuses my brain, but when I do it it actually works and is honestly the only time I really can get anything done.",
            "title_similarity": "0.70086324",
            "sentiment_compound": 0.3825
        },
        {
            "id": "hwk9iu6",
            "score": 1,
            "text": "No can do my friend",
            "title_similarity": "0.20220979",
            "sentiment_compound": 0.25
        },
        {
            "id": "hwk9xba",
            "score": 1,
            "text": "Suck 3.5 dicks!  Even if no can finish #4 he still have a good time!",
            "title_similarity": "0.4910701",
            "sentiment_compound": -0.4184
        },
        {
            "id": "hwkkz42",
            "score": 1,
            "text": "That !\n\nThat kind of mindset made me lose 15kg (30lbs).\n\nI didn't try to eat healthy, I tried to bully my unhealthy diet with healthy things.\n\nOne day I would eat 100% healthy and bring it to its knees, but a rainy day would be doing nothing at all or just slapping his back / giving it a kick in the ribs.\n\nSee what that would do to someone ? It would destroy them right ? Same thing with an unhealthy habit.",
            "title_similarity": "0.6978617",
            "sentiment_compound": -0.8736
        },
        {
            "id": "hwkl83j",
            "score": 1,
            "text": "You should have smoked 997 blunts",
            "title_similarity": "0.39086598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwkm9h5",
            "score": 1,
            "text": "The responses to this have been overwhelming! I don't feel like I even articulated my point the best but most everyone in this thread is certainly bright enough to know exactly what I meant. \n\nThank you all!!!",
            "title_similarity": "0.3894654",
            "sentiment_compound": 0.9248
        },
        {
            "id": "hwknw5h",
            "score": 1,
            "text": "This is really helpful",
            "title_similarity": "0.05196977",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hwkp3it",
            "score": 1,
            "text": "Maybe just smoke 999 blunts instead of 1000.",
            "title_similarity": "0.38508582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwks9wu",
            "score": 1,
            "text": "I literally said out loud, today, \"2 miles is better than zero miles!\"\n\nIt was warmer than normal, I was able to get out for a walk. In the spring/summer/fall, I usually walk 4-6 miles a day but in the winter, it's too cold and snowy so I don't get to exercise as much. I started to be mad it was \"only\" 2 miles when it's still snowy, barely 40 degrees, windy, icy, but then I said that out loud and it made sense. I could have chosen to sit on my ass, but I walked. It's enough. Some is always enough.",
            "title_similarity": "0.66692555",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hwnbc2r",
            "score": 1,
            "text": "Smoke 823 blunts",
            "title_similarity": "0.04868631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwt78af",
            "score": 2,
            "text": "I do daily journaling to specifically for this, so I can do small things constantly. I keeps track of what I done the whole day and also before the day ends i set a pointer for what can I do for tomorrow. Initial plan when I start journaling is to set a boundary for me to just focus myself in one day, and as I learn stoicism also it keeps me fully present.",
            "title_similarity": "0.61041343",
            "sentiment_compound": 0.0
        }
    ]
}