{
    "LPT: Nobody cares if you overwork yourself until hitting a burnout. Keeping a good work/life balance is your own responsibility.\nEdit:\nDisclaimer, as it seems necessary, ofc there are people in slave like work conditions which have no other chance than work as much as they can, only to make ends meet.\n\nBut there are also a lot of people in good jobs (let's say marketing) who are caught in this work and work more mindset, this post is about them.": [
        {
            "id": "hxtr5rc",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.63350844",
            "sentiment_compound": 0.9615
        },
        {
            "id": "hxtygad",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.11788143"
        },
        {
            "id": "hxu0th2",
            "score": -1,
            "text": "There was a much more compassionate way to say this. Jeez.",
            "title_similarity": "0.32540405",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hxtw4gy",
            "score": -2,
            "text": "They care at work. Do it right and it will positively impact your salary. You don’t have to do it forever, but early in your career it can help propel you. Sure, there are other ways to stand out in the crowd, but don’t dismiss overworking outright if you need a boost.",
            "title_similarity": "0.7624104",
            "sentiment_compound": 0.9239
        },
        {
            "id": "hxu1c9a",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "0.12840231"
        },
        {
            "id": "hxu1sie",
            "score": 9,
            "text": "What a terribly sanctimonious thing to say.....you presume to understand everyones circumstances do you?",
            "title_similarity": "0.47592705",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hxudyd0",
            "score": 3,
            "text": "Another brilliant LPT from the LPT squad!  Work less and hope you don't get fired for it, you guys are just so damn smart over here! /HEAVY S",
            "title_similarity": "0.70166886",
            "sentiment_compound": 0.8561
        },
        {
            "id": "hxu1m3k",
            "score": 34,
            "text": "How is this a LPT? Holy shit",
            "title_similarity": "0.16262935",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hxtztox",
            "score": 9,
            "text": "That's not true at all. Most people and your boss especially WILL care. It is still your own responsibility to keep a good work/life balance though. And it can be hard for your boss to pick up the signals. It can even be hard for yourself to pick up the signals.",
            "title_similarity": "0.8607308",
            "sentiment_compound": 0.5017
        },
        {
            "id": "hxu9q3b",
            "score": 6,
            "text": "I am sorry but that is such a bad way of thinking...\nIn Denmark I have never seen a company that does not care about you (not talking about bars/cleaning companies unfortunately). It is the company's best interest of you being well. If I would overwork myself my co-workerks or HR would be breathing on my neck telling me to go play with them, take a brake, or just go home.\nIt should be as much of the company that makes you work to take responsibility in giving a work/life balance as it should be yours.",
            "title_similarity": "0.79759",
            "sentiment_compound": 0.8024
        },
        {
            "id": "hxu1faa",
            "score": 24,
            "text": "I fundamentally disagree with this idea that 'nobody cares if you overwork yourself until hitting a burnout'. We should all care. Such a mentality is incredibly unhealthy for the individual in question but also has a direct impact on other employees in that they are expected to achieve the same level of productivity; which is not sustainable in the long run. Therefore, it contributes to a toxic work environment and contributes to a mental health crisis.",
            "title_similarity": "0.8313062",
            "sentiment_compound": -0.7715
        },
        {
            "id": "hxu6wtf",
            "score": -1,
            "text": "Some people enjoy the super grind. For me a good work life balance ce is having work be the major thing I think about, focus on, and spend time on. It’s how I’ve grown a successful business in just 8 months. \n\nI also worked for a start up funded by a 9 figure net worth serial entrepreneur. He was the same way. Same thing if you want to become an investment banker, top tier lawyer, etc. it’s called greedy jobs and some (successful) people enjoy that lifestyle. \n\n I was a lot more miserable and depressed and lonely when I was only working 40 hours a week. Ironically I also had fewer (zero friends), and no hope at all with women, and was anywhere from 20-60 pounds heavier. I also now have a casual sort of gf and it’s the first time I’ve had anything like that in over a decade. There’s nothing wrong with throwing everything in to work.",
            "title_similarity": "0.68434185",
            "sentiment_compound": 0.9612
        },
        {
            "id": "hxuduoo",
            "score": 5,
            "text": "So what about the millions living in poverty or worse that literally cannot *afford* to set healthy work/life boundaries?! I didn't realize they were just irresponsible, workaholic complainers.   \nThis post is ignorant.",
            "title_similarity": "0.71793175",
            "sentiment_compound": -0.8832
        },
        {
            "id": "hxui1td",
            "score": 3,
            "text": "This feels like such a psychotic post lmao",
            "title_similarity": "0.37046188",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hxu6rd4",
            "score": 12,
            "text": "that's not at all true. your friends and family should care and want to support you. lots of work places have life works and programs like that to help employees with mental health issues or feeling burnout. \n\ndon't be insensitive to mental health issues or how people react to the demands of life. you may need the help too one day, and even if you don't empathy is still a valuable skill.",
            "title_similarity": "0.79054165",
            "sentiment_compound": 0.9592
        },
        {
            "id": "hxukqo3",
            "score": 12,
            "text": "I understand your sentiment, but this isn't entirely true.  I cared for the people that worked with me and eventually the people that ended up working for me.  If that's unusual, it's unfortunate.\n\nI point this out, because my kids and their generation are growing up riddled with anxiety because they hear this type of message every day.  We have to let people know that the world can be good and supportive if you find the right environment.  And we have to learn ourselves that we need to create this environment by being or becoming people that appreciate the humanity around us.\n\nTake care!",
            "title_similarity": "0.7478589",
            "sentiment_compound": 0.935
        },
        {
            "id": "hxtz6ym",
            "score": 5,
            "text": "Im self employed. :(",
            "title_similarity": "0.4097158",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hxu3opg",
            "score": -5,
            "text": "Don't listen to anyone who disagrees. You're right. All biological life is selfish and when We are not useful, We are ignored. Learned that the hard way. Now everyone is gonna have to get used to being manipulated by me how I see fit til they show me their competence. I find petty things like emotions amusing. My realm will be mine or you will be eliminated from it. Like a tiger, crocodile, or shark. \n\n\nFuck around and find out. \n\nYou're probably dealing with shit too I bet. Like the rest of the species. You have support with Us if you're ready to follow.",
            "title_similarity": "0.6940314",
            "sentiment_compound": -0.6377
        },
        {
            "id": "hxu4yv0",
            "score": 14,
            "text": "This is toxic as hell and assumes a lot about the human condition.",
            "title_similarity": "0.47834408",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hxu1ew0",
            "score": 0,
            "text": "Yup, I've been doing it for years.",
            "title_similarity": "0.21441592",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuookb",
            "score": 0,
            "text": "And if your salary, no one cares that you put in 80 hours a week. They won't remember it the moment something goes wrong.",
            "title_similarity": "0.64884937",
            "sentiment_compound": -0.777
        },
        {
            "id": "hxuyt9z",
            "score": 0,
            "text": "$1,000 a man wrote this",
            "title_similarity": "0.26019755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxw196m",
            "score": 0,
            "text": "LifeProTips—Privilege Edition",
            "title_similarity": "0.2720546",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwchrr",
            "score": 0,
            "text": "This is a hard truth to swallow, but one I recently realized while tripping on mushrooms. I work for a Fortune 100 company and realized I’d been showing more love for the company than for myself or anyone else over the last 1.5 years. Granted, it did get me promoted. But now it’s time to learn what WLB really means. Because you are absolutely right, my managers and teammates did nothing to stop me from working long hours, weekends, doing extra work, etc. I was ultimately benefiting the company and if I burned out, I was (and still am) 100% replaceable. It was on me to put up those boundaries. But I was sipping the kool-aid too hard.",
            "title_similarity": "0.6367004",
            "sentiment_compound": 0.9395
        },
        {
            "id": "hxwtwgl",
            "score": 0,
            "text": "I know I’m going to be ripped to shreds for this. I don’t believe in work life balance. Handle your stuff at work just like you need to handle your stuff at home.",
            "title_similarity": "0.7190261",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxxj7km",
            "score": 0,
            "text": "Marketing isn't real work",
            "title_similarity": "0.3548004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxtyjoe",
            "score": -1,
            "text": "A good GM will account for burnout, especially for management, who are required to be more available. But yeah, overall people need to speak up for themselves because it's not always obvious how miserable we are.",
            "title_similarity": "0.82182825",
            "sentiment_compound": -0.0398
        },
        {
            "id": "hxu44vr",
            "score": 1,
            "text": "Gees, I spent a good chunk of this weekend thinking about this very thing. As a current teacher, talking to a retired teacher she did remind me that administration doesn’t really care much about me personally. They DO care about not being able to fill another position. It is hard to keep a good work/life balance when the (workload) scales are already tipped against you…",
            "title_similarity": "0.79616356",
            "sentiment_compound": 0.902
        },
        {
            "id": "hxu7mqe",
            "score": 1,
            "text": "I love how OP assumes everyone has the ability to do this. Some people can't afford to not work three jobs or be able to risk losing a job by taking time off. This tip is very much coming from a privileged existance. Work/life balance is only for the well-off.",
            "title_similarity": "0.85742736",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hxu7oqv",
            "score": 1,
            "text": "I couldn't agree more. Slow and steady wins the race.",
            "title_similarity": "0.49676895",
            "sentiment_compound": 0.3798
        },
        {
            "id": "hxuarx6",
            "score": 1,
            "text": "Must be nice to have the convenience of taking time for yourself instead of working three jobs to keep a roof over your head.",
            "title_similarity": "0.6119914",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxudc5z",
            "score": 1,
            "text": "I was a 'hard worker'.\n\nI got burned out.\n\nNow I'm a stay at home dad.\n\nI still get burned out.\n\nAsk for help if you need it. It's not a problem. It's a problem if you do nothing.",
            "title_similarity": "0.7463364",
            "sentiment_compound": 0.2163
        },
        {
            "id": "hxudx4u",
            "score": 1,
            "text": "We can take this a step further... most everything is your responsibility. Boss not paying enough and refusing raises that, at least, track inflation? Strike. Boss using OT as a way to not hire new employees, saving in benefits costs? Strike. Boss not allowing the crew to WFH when it applicable? Strike. Boss needlessly putting you in harms way? Strike. \n\n\nAt one point in time, the workforce felt so strongly about their rights that they literally took to fighting the police with butcher knives. The streets ran red with blood, for real. Today, we just demand legislation (that's never correct/enough or followed/enforced).",
            "title_similarity": "0.7370952",
            "sentiment_compound": -0.8185
        },
        {
            "id": "hxugfx6",
            "score": 1,
            "text": "All work and no play makes bloody revolution inevitable",
            "title_similarity": "0.5942653",
            "sentiment_compound": -0.6041
        },
        {
            "id": "hxumm6s",
            "score": -1,
            "text": "I mean, working my ass off earned me a promotion? This is subjective.",
            "title_similarity": "0.62201905",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hxuwt8c",
            "score": 1,
            "text": "That's not true, other people care. \n\nI tell people to take a break all the time when I see them get stressed or there's just not a lot of work to be done. I'll also light a fire under your add when it's needed.\n\nA well rested soldier is a good soldier.",
            "title_similarity": "0.7610669",
            "sentiment_compound": 0.2658
        },
        {
            "id": "hxv14n0",
            "score": 1,
            "text": "False: nobody cares\nTrue : your own responsibly\n\nFriends and family care because it can directly effect them.",
            "title_similarity": "0.73899126",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hxuams9",
            "score": 42,
            "text": "Oh my, this. I always used to think, \"Why do my bosses allow me to get to my wits end like this?\" I was seen as hardworking, a go getter, team player, etc. But guess what, I started taking more PTO, prioritizing sleep and exercise by not coming in super early and leaving late. I'm still seen as a hard worker and team player, but I don't hate myself or resent management. \n\nI'm not saying there aren't times to turn up work as a priority or have a late night at the job occasionally, but thats why it's called balancing. In general, I come first.",
            "title_similarity": "0.8099617",
            "sentiment_compound": -0.171
        },
        {
            "id": "hxu3v9d",
            "score": 2,
            "text": "In germany you arent even allowed to think about that.\n\nthey want you to live for the company",
            "title_similarity": "0.64600307",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxujzcy",
            "score": 2,
            "text": "People sometimes ask me why I don’t have a “grindset” because I don’t have side hustles and I’m not pulling OT at every opportunity.\n\nIt’s because more money doesn’t make me more happy, more time doing the shit I enjoy does.",
            "title_similarity": "0.7334466",
            "sentiment_compound": 0.9412
        },
        {
            "id": "hxu1j11",
            "score": 11,
            "text": "Make it practice to say no to your work, the earlier you set you boundaries and how consistently you maintain them matter.",
            "title_similarity": "0.6723744",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hxtu59l",
            "score": 21,
            "text": "I care. \n\n\nDon’t do it!",
            "title_similarity": "0.20928833",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hxumiqw",
            "score": -4,
            "text": "youre just jealous and lazy",
            "title_similarity": "0.4214195",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hxu47ly",
            "score": 13,
            "text": "[deleted]",
            "title_similarity": "0.12840231"
        },
        {
            "id": "hxu9sfo",
            "score": 4,
            "text": "As a manager, I absolutely care if my staff are burning themselves out.  I want my staff to succeed if only because their quitting due to burnout would mean I have to interview, hire, and train new people and that's a terrible waste (and also because my staff are great and I want to help them however I can).\n\nBut I can't always tell because I don't sit over their shoulders watching their every waking moment, and burnout often happens silently and is only apparent when it's too late.\n\nIf you're burning out *you need to communicate*.  Your manager can't help solve a problem they don't know about.",
            "title_similarity": "0.8773352",
            "sentiment_compound": -0.4987
        },
        {
            "id": "hxua7je",
            "score": 6,
            "text": "You should care if your coworker is being overworked. They may be being pressured in a way they're unaware they can stand up to,  but your performance will be compared to their overworked performance. \n\nThis is not a LPT, this is being a grump.",
            "title_similarity": "0.7806771",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hxu6xci",
            "score": 22,
            "text": "There are people who pressure you to do so and society gaslights you into doing it. While you can only blame yourself, you are not the only one to blame. It's a symptom of a larger disease",
            "title_similarity": "0.6301515",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hxulkev",
            "score": 59,
            "text": "> Keeping a good work/life balance is your own responsibility\n\nThis couldn't be any further from reality. And instead of advocating for individualistic approaches to cope with burnout, we need to talking about eliminating the conditions that lead to burnout in the first place and that can only be achieved through organizing. Keeping a good work/life balance requires solidarity with your coworkers and collective action to fight for your rights in the workplace. Employers don't give a shit about your work/life balance and would work you 15 hours a day if they could (which historically they did and continue to do elsewhere in the world). \n\nFor anyone looking to get started with organizing, I highly recommend reaching out to and volunteering with the [Emergency Workplace Organizing Committee](https://workerorganizing.org) and reading Labor Note's [Secrets of a Successful Organizer](https://www.labornotes.org/secrets).",
            "title_similarity": "0.8415739",
            "sentiment_compound": 0.9245
        },
        {
            "id": "hxu0nqg",
            "score": 86,
            "text": "I work at a very well-known fortune 15 company. The company will never do the right thing unless it suits their process. There is always someone above who can shut down the next best thing offered. And don't train your employer you will work until you're burnt out. Someone on a sister team died and their job was posted the next week. Your life is as important to your job until you're not making them money. Live your life.",
            "title_similarity": "0.76271653",
            "sentiment_compound": 0.34
        },
        {
            "id": "hxu2ox4",
            "score": 68,
            "text": "[deleted]",
            "title_similarity": "0.12840231"
        },
        {
            "id": "hxu5gei",
            "score": 33,
            "text": "Correlate:  nobody cares about you",
            "title_similarity": "0.32869655",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxtvq4z",
            "score": 377,
            "text": "I cared. I tried to prevent obvious burnout from someone I managed on my team. She actually got offended that I thought she was \"weak\" (not at all how I communicated the issue to her). 6 months later she imploded and burned all her bridges.",
            "title_similarity": "0.6240819",
            "sentiment_compound": -0.25
        },
        {
            "id": "hxu67l7",
            "score": 13,
            "text": "It is also important to not foster an environment of overworking. \n\nI came from an industry where 60-100 hour weeks were pretty common. The culture had a lot of \"flexing\" about who had the most OT on a project or who had the most on a year, etc. When I was young it wasn't too bad but getting older and watching people in their 40s still doing it I realized how rough it could be. It eats up soo much of your life and usually without much to show for it.\n\nI finally realized I couldn't do that forever and moved to something more normal. It took some time to get used to it and fight the urge to just work crazy hours and get stuff done that could wait. What really helped was being in an environment where time off and non-work hours were respected. \n\nI almost laughed being in a meeting where they discussed concern with having people work a weekend or two, or do a good bit of OT for a whle with concerns of burnout. It took me a minute to realize just how crazy my old job had been and I was glad there were conversations like that going on. \n\nSo absolutely push back on maintaining that balance and if you are management make sure you foster an environment of respecting work/life balance. It is a two way street.",
            "title_similarity": "0.7517575",
            "sentiment_compound": 0.9678
        },
        {
            "id": "hxtrjqo",
            "score": 193,
            "text": "I've been trying to make my good friend understand this for so long. He's stuck in a job in a kitchen, he takes no sick days, gets off days only if his manager puts em in the schedule, and even then the manager always calls him on his off days just to cover for someone else. \n\nAnd my friend always says yes. He's so damn miserable. The only time he gets a pay raise is if the manager initiates it, which tells me he could've gotten a much bigger raise if he was proactive about it. Not by overworking himself and covering for others all the damn time.",
            "title_similarity": "0.79769146",
            "sentiment_compound": 0.6875
        },
        {
            "id": "hxtwd06",
            "score": 112,
            "text": "Some do care, but obviously when you do this, to most people, you look more like a martyr for an unworthy cause than anything else. Not a hill worth dying on. Realizing this is probably the most important step.",
            "title_similarity": "0.7160268",
            "sentiment_compound": 0.3464
        },
        {
            "id": "hxtwaje",
            "score": 1109,
            "text": "I would venture to say that your company does care if you burn out, in that they will fire and replace you if you do.",
            "title_similarity": "0.6866956",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hxu8s2c",
            "score": 271,
            "text": "I worked for a family business for eight years. I was already working weekends and late nights and took on even more work when we were short staffed during COVID. I was doing the work of three people when others quit and no replacements were hired. The company was growing, and I was promised help the entire last year but nothing changed. I was afraid to take time off because the work was only piling up for when I returned. I finally ended up in the hospital when my BP skyrocketed dangerously high, and I started having chest pains. \n\nWhile laying in the hospital bed, I decided to put in my two week notice and expected them to counter or ask me to stay on (even though I would have refused). Instead, after working extra hours to train several people and hearing how difficult it would be to replace me, the only goodbye I got on my last day was to be escorted out with a box. \n\nAll my hard work and extra effort only resulted in my burnout and degrading health. I can't get those years back.  Never again.",
            "title_similarity": "0.60416865",
            "sentiment_compound": -0.9595
        },
        {
            "id": "hxu2u3t",
            "score": 476,
            "text": "I’ve worked in construction for 34 years now. Family business. As a family we all know the importance of downtime and vacations. We have a skeleton crew and like it this way. We don’t work weekends. We are usually done for the day at 3ish. We are careful not to get caught up in the hype of buying shiny new things and the debt load that would incur. Could we make more money by working longer and weekends?….definitely but the value of having a peace of mind = priceless!",
            "title_similarity": "0.7459584",
            "sentiment_compound": 0.8805
        },
        {
            "id": "hxu0bzn",
            "score": 1357,
            "text": "People's reasons to be a workaholic may vary. Some people genuinely enjoy working. Then there's people like my dad, they struggle with a combination of guilt and trauma so they use working to distract themselves from themselves.",
            "title_similarity": "0.8101294",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hxu0kbr",
            "score": 5765,
            "text": "To add to this - it also creates an expectation of that 'you will always do x amount of work' or 'you will always work x hours'.\n\nAlso your reward for going over and above with the amount you do....is....MORE WORK.\n\nYour health and wellbeing should always come first.",
            "title_similarity": "0.65194494",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hxu5ios",
            "score": 151,
            "text": "My boss these past 2 years: I need you to train new employees, work out of town overnight, work 12+ hour days 5 days a week, work outside your skill set due to lack of available technicians, no we can't afford to give you a raise, also we're opening a new location and hiring a dozen new employees. \n\nMy boss last week during a meeting: \"we just want to make sure we're not burning you out\" bud, I was burnt out a year ago. Time to get out.",
            "title_similarity": "0.66062737",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hxu48vw",
            "score": 628,
            "text": "Damn every lpt is about work now these days haha",
            "title_similarity": "0.5647776",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxtx9ud",
            "score": 1,
            "text": "Saying “No” in business is like saying “go fuck yourself”.\n\nI have turned saying “No” to an art form.\n\nMy company brought in a Nurse as part of a “get healthy” program. She commented that my blood pressure was low which seemed unusual for the place. I just replied “yeah…”",
            "title_similarity": "0.6342236",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hxu2vb8",
            "score": 16,
            "text": "I'd argue it is the job of all employers to make sure they aren't overworking their employees too though. \n\nI've had two stint off work in a previous job due to burnout (presented itself like a really bad flu, insomnia and fatigue) and I never would have gotten that way in the first place if it wasn't for my previous manager being an uncaring asshole. \n\nIn my current job, there have been a couple a times over the last five years where I have taken a couple of days off because I recognize the signs of burnout. Told my manager that is why I needed the sick days and they were granted no questions asked aside from a doctor's note.",
            "title_similarity": "0.7401247",
            "sentiment_compound": -0.868
        },
        {
            "id": "hxu2zo4",
            "score": 1,
            "text": "Even if it means standing up to your bosses.",
            "title_similarity": "0.55467904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxu4mst",
            "score": 2,
            "text": "Depends on your employer but you might be right. I’d argue that work/life balance starts with you, but at the end of the day, that won’t mean shit if your company demands you work long hours. If you can find another job elsewhere that has a better work/life balance, then go for it.",
            "title_similarity": "0.7920742",
            "sentiment_compound": -0.631
        },
        {
            "id": "hxu4s52",
            "score": 1,
            "text": "Yep I once made the mistake of saying that I was willing to do some work over the weekend if needed. Ended up being given a series of tasks every Friday at 4pm, due for Monday.",
            "title_similarity": "0.5337947",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxu5xgy",
            "score": 1,
            "text": "Hey I care! Don't do it guys!",
            "title_similarity": "0.25568485",
            "sentiment_compound": 0.5837
        },
        {
            "id": "hxu622w",
            "score": 1,
            "text": "Pacing yourself with your work and your colleagues is important, even if you can work faster and harder, leave that for emergency situations, if you work faster and harder than the average worker, first you will suffer by doing it and secondly, your co-workers will hate you for making them look bad for working normal and your boss will start considering your highly demanding efforts and hard work as normal work routine and demand from your to do more.",
            "title_similarity": "0.8318871",
            "sentiment_compound": -0.9412
        },
        {
            "id": "hxu6tfv",
            "score": 2,
            "text": "People WILL care though if your workload/efficiency reduces as you increase your life balance, unfortunately.\n\nI joined my company and mutually agreed to work 8 till 4, so I could get in to the office earlier and leave earlier to dodge the heavy traffic, plus I support the EU side which are an hour ahead of us, so it made sense.  Been doing it for 4.5 years now, I love it.  Way more time in the afternoons to do what I want.\n\nDoesn't stop people expecting you to still be working between 4 or 5, because they are, and beyond to 6pm when a lot of THEM stop as they're in more managerial roles.  So they see me as someone who works \"less\" when in reality I'm in or logged in WFH an hour earlier than them.  A quick talk resolves this, but impressions last and are hard to overwrite.  If you're late consistently in your first month, people see you as lazy and always late etc.",
            "title_similarity": "0.65645707",
            "sentiment_compound": 0.5851
        },
        {
            "id": "hxu6wml",
            "score": 1,
            "text": "My turn to post this tomorrow.",
            "title_similarity": "0.2505464",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxu6zdh",
            "score": 1,
            "text": "My boss tells me to stop working and take breaks, he even makes sure im not working over an hour without taking a break lol.",
            "title_similarity": "0.6791667",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxu76z9",
            "score": 1,
            "text": "I agree. I have got better at this overtime. Acquiring productivity tools, revision techniques and organization such as diaries or digital calendars has been a big part of learning",
            "title_similarity": "0.57652515",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hxu7a1c",
            "score": 1,
            "text": "Wait... I thought the good advice was in r/YSK",
            "title_similarity": "0.28343636",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxu7q7f",
            "score": 1,
            "text": "The curse of competency\n\nThe reward for doing your work quickly is more work",
            "title_similarity": "0.6337534",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hxu898y",
            "score": 1,
            "text": "My boss cares. And regularly asks how I'm doing. And makes sure we take enough PTO. These generalistic posts are terrible.",
            "title_similarity": "0.787618",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxu8dw5",
            "score": 2,
            "text": "That's why I'm quiting my job today. Wooooooooooo",
            "title_similarity": "0.57308996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxu8rrf",
            "score": 1,
            "text": "Yup people are getting soft and letting their emotions get in theway of their success",
            "title_similarity": "0.44001788",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxu8vng",
            "score": 3,
            "text": "Milking projects at work is an art form",
            "title_similarity": "0.37811312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxu9pic",
            "score": 1,
            "text": "To be fair, no one cares either way.",
            "title_similarity": "0.288581",
            "sentiment_compound": -0.3356
        },
        {
            "id": "hxuam76",
            "score": 1,
            "text": "They will care if you make a lot of money",
            "title_similarity": "0.48703352",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxuaokk",
            "score": 1,
            "text": "I feel like every team manager I've ever had is the guy/girl that is willing to dedicate the largest portion of his life to work.",
            "title_similarity": "0.6296184",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxub9u9",
            "score": 1,
            "text": "To add more to this, your co-workers probably resent you for this behavior more than they admire it.",
            "title_similarity": "0.66976285",
            "sentiment_compound": 0.3947
        },
        {
            "id": "hxubf04",
            "score": 1,
            "text": "LPT: Claiming that “Nobody cares” implies that you think you can/should/are able to speak on behalf of everyone else on the planet. Please do not try to speak for me thank you.",
            "title_similarity": "0.5658668",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxubj80",
            "score": 1,
            "text": "Thank you, I needed this.",
            "title_similarity": "0.27407783",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxuc57n",
            "score": 1,
            "text": "Definitely not your managers or the company",
            "title_similarity": "0.35355687",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxucc3v",
            "score": 1,
            "text": "If you work somewhere that no one cares if you burnout then you need to find a new job.",
            "title_similarity": "0.7181262",
            "sentiment_compound": -0.569
        },
        {
            "id": "hxucd1i",
            "score": 1,
            "text": "Overworked myself for 3 years in finance working 12 to 14 hours every day, became bald, skinny from stress and anxiety. Was fired because I wanted to take more family time by working my normal shift. \nChanged field of works with a loooot of less stress and I feel better now",
            "title_similarity": "0.66859686",
            "sentiment_compound": -0.7722
        },
        {
            "id": "hxucd82",
            "score": 1,
            "text": "Learning to pace yourself and be consistent will get you much farther than cycles of burnout",
            "title_similarity": "0.57193446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxucdd1",
            "score": 1,
            "text": "I mean, it's \"your own responsibility\" except that most people who overwork have no choice. Yes, *some* people could just chose to maintain a better work-life balance, but the majority of burnout doesn't happen because irresponsible dumbasses refuse to take time for themselves but rather because they're either not allowed to, can't afford to, or don't have time to.\nThere's no personal responsibility in being forced. As much as it is your responsibility to make good choices *when you can,* it is also the responsibility of authority figures to *give* people good choices when they can.",
            "title_similarity": "0.8399406",
            "sentiment_compound": 0.3356
        },
        {
            "id": "hxucfek",
            "score": 1,
            "text": "So very true. I always look at folks who sacrifice their health, family life for work as weak to be honest.",
            "title_similarity": "0.7497726",
            "sentiment_compound": 0.5819
        },
        {
            "id": "hxuclw6",
            "score": 1,
            "text": "No, for real, even suicidal, nobody cares. Until you hassle them with a body, you aint getting a thing. Good luck.",
            "title_similarity": "0.54272056",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxucmte",
            "score": 1,
            "text": "Yea good work life balance ratio. The ANTI  work ethic slogan",
            "title_similarity": "0.6754793",
            "sentiment_compound": -0.0343
        },
        {
            "id": "hxucwti",
            "score": 1,
            "text": "I personally care a lot if my coworkers are burnt out, and will advocate for them any chance I get. They don't always feel the same.",
            "title_similarity": "0.6979362",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxucx3l",
            "score": 1,
            "text": "I work for myself and worked 70+ hours last week. 15 hours yesterday. I’m sitting here doing nothing and going to my jobsite 2 hours later than normal. I can’t shake how tired I am and things are just starting to get busy. Fuck grind culture. This is pure necessity and I can’t wait to be able to hire some help.",
            "title_similarity": "0.6545069",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hxucz71",
            "score": 1,
            "text": "I mean, I care. Take care of yourselves y'all!",
            "title_similarity": "0.37342536",
            "sentiment_compound": 0.7712
        },
        {
            "id": "hxud0lx",
            "score": 3,
            "text": "Dude a lot of people physically can't keep a good work life balance. Take a look at teachers. People are jealous because they get a lot of days off but you're a fool if you think they aren't grading and planning on that time off.",
            "title_similarity": "0.79197085",
            "sentiment_compound": -0.7617
        },
        {
            "id": "hxud2dv",
            "score": 1,
            "text": "I also add that if a job can not support a good work/life balance then you should immediately look for other employment.",
            "title_similarity": "0.6923231",
            "sentiment_compound": -0.5667
        },
        {
            "id": "hxud64y",
            "score": 1,
            "text": "Did this at my old job, while my boss always expected more out of me he always had my back and I got great rewards and incentive to do so",
            "title_similarity": "0.73644185",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hxud7qh",
            "score": 1,
            "text": "I told all of my coworkers this and made sure they took care of themselves. I forgot to take care of myself and now I'm on unpaid LOA. RIP my mental health.",
            "title_similarity": "0.7467332",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hxudaah",
            "score": 1,
            "text": "Let me guess, you have a high paying job with benefits and live comfortably? Cuz most people are out here working 2 or 3 jobs just to keep food on the table. It's easy to say this crap when you have the option of not working yourself to death",
            "title_similarity": "0.60535854",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hxudcwr",
            "score": 1,
            "text": "I’m off today and woke up to a missed call and a text from work. Setting boundaries is a goal of mine in 2022.",
            "title_similarity": "0.52285194",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxuddpg",
            "score": 1,
            "text": "However, this does not mean you should submit yourself to a toxic work environment or a toxic boss.",
            "title_similarity": "0.5258126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxudfg9",
            "score": 1,
            "text": "People call my prioritization of life outside of work a lack of ambition",
            "title_similarity": "0.6064725",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hxudiyy",
            "score": 1,
            "text": "Yeah, um, that’s impossible given the ridiculous demands employers make: taking calls at all hours, answering emails even on days off, being guilted for taking time off, being on call when others call out even on days off, etc etc etc.",
            "title_similarity": "0.72307897",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxudkxb",
            "score": 1,
            "text": "An enormous amount of companies/managers don't care even if you hit burnout.  A lot of places function on a \"squeeze everything you can out of them then throw them away.\"  Like working in an Amazon Warehouse.",
            "title_similarity": "0.7308624",
            "sentiment_compound": 0.1461
        },
        {
            "id": "hxudl7j",
            "score": 1,
            "text": "Work/life balance doesn’t actually exist. It’s all just part of your life.",
            "title_similarity": "0.58446574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuduc2",
            "score": 1,
            "text": "I work for a union - you will get reprimanded for working overtime (and you will not get paid)… yet people still do it then complain about it.",
            "title_similarity": "0.85137075",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hxue5b4",
            "score": 1,
            "text": "As a person who has hit multiple burnouts, your time between episodes decreases substantially.  At one point, I was working 3 jobs/projects, and cut back to one.  Even after, I find myself reaching burnout much faster than before, and it keeps getting shorter.",
            "title_similarity": "0.5660691",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxue5ul",
            "score": 1,
            "text": "Just do enough to not get fired problem solved",
            "title_similarity": "0.41408738",
            "sentiment_compound": 0.7416
        },
        {
            "id": "hxuefvn",
            "score": 1,
            "text": "I care. It’s insurance and unions that ought to provide balance. In solidarity, we can help make it so no one has to go it alone.",
            "title_similarity": "0.62852776",
            "sentiment_compound": 0.4996
        },
        {
            "id": "hxuegml",
            "score": 1,
            "text": "Shitty managers are shitty. I always tell my people to go home and turn their phone off. If we can't get all the work done it gives me leverage to hire more people. Quit overdoing it everyone, please!",
            "title_similarity": "0.72665477",
            "sentiment_compound": -0.7345
        },
        {
            "id": "hxueote",
            "score": 1,
            "text": "It is a pretty good excuse for people if you’re the type of person who works a shitload and neglects friendships. \n\nYou need money to survive so it’s a legitimate excuse if you ever need to really put your head down and grind out cash.",
            "title_similarity": "0.7442639",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hxufbje",
            "score": 1,
            "text": "I haven’t seriously worked since early 2018\n\nThink I might’ve swung too hard in one direction",
            "title_similarity": "0.44327456",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hxufoso",
            "score": 1,
            "text": "Another life pro tip about caring more about yourself than your work place. \n\nI’m interested in seeing how many ways it can be reworded.",
            "title_similarity": "0.6858795",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hxufrl2",
            "score": 1,
            "text": "Also, keep this in mind: Being a great soldier not necessarily makes you qualified to be a good Captain.\n\nThat is, they will not give you a promotion for being great at your job. In fact, the case could be made that they will probably be wary of removing you from the job you are good at.",
            "title_similarity": "0.6561011",
            "sentiment_compound": 0.9325
        },
        {
            "id": "hxug46u",
            "score": 1,
            "text": "Exactly. I don't start any earlier than 8, I don't end my lunch any second less than an hour, and I'm ready to go at 5. Especially being on a 12 month contract for a job that may or may not keep me around, I'm not burning myself out for them, especially when the job itself is already stressful.",
            "title_similarity": "0.56642926",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hxug84e",
            "score": 1,
            "text": "Actually a lot of people do. Your coworkers that now have to hear shit from your boss because you are a fucking workoholic and are setting the bar too high for not enough pay.",
            "title_similarity": "0.70439065",
            "sentiment_compound": -0.5113
        },
        {
            "id": "hxugbq5",
            "score": 36,
            "text": "My employer refused to allow me to take time off for my medical conditions and doctors appointments, which is illegal in the state that I am employed in.\n\nThey wanted to play games so I took three months of paid, short-term disability leave. Never give your all to an employer and learn to fuck them over just as they do you.",
            "title_similarity": "0.58728325",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hxuggfl",
            "score": 1,
            "text": "I used to stress about my job 24/7. I'd leave at 6am and get home at 6pm and think about the next work day until I went home. All the stress I put myself under to be the best at it made me go almost completely salt and pepper by 26. Once they moved the specific customer to a different branch closer to him it was like a million pounds were lifted off my shoulder. I do miss the 20+ hours of overtime on my paycheck, but I am more than glad to be poor and happy than rich and miserable.",
            "title_similarity": "0.69281006",
            "sentiment_compound": 0.7945
        },
        {
            "id": "hxugkwv",
            "score": 1,
            "text": "I remember an old boss of mine saying how, except for Christmas he hadn't taken a vacation in 5 years. \n\nHe said this with a sense of pride and like a brag.  Per the title of the thread,  I was not impressed. I just internally shook my head. \n\nWhat's more, I feel like he used that fact to ridicule anyone who expressed burnout or a simple desire to use their PTO.",
            "title_similarity": "0.62135345",
            "sentiment_compound": 0.5283
        },
        {
            "id": "hxuglci",
            "score": 1,
            "text": "But also, if you don't overwork yourself for your meager pay, they'll sack you and replace you with someone that will.",
            "title_similarity": "0.7491097",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hxugnpz",
            "score": 1,
            "text": "I tell everybody, including my direct reports, that they should see how little they can get away with working while still delivering quality",
            "title_similarity": "0.7472031",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxugofn",
            "score": 1,
            "text": "Once I told my boss that I rip my ass open to get the job done (I said that literally) and he actually answered that he doesn't care, he just wants the job done. Few months later they fired me because I \"didn't work\" and they \"could not trust me\". \n\nFor one of the last projects I stayed until 7pm on site several times - shift ends 2 hours earlier. Had to stay to reinstall laptops because the boss kept fucking up the configuration remotly. \n\n&#x200B;\n\nFound a new company, they love me, I get paid adecuatly and I for sure do not overwork myself. Getting fired was the best thing that could happen to me. \n\nAs OP said - nobody cared about me working my ass off.",
            "title_similarity": "0.75886613",
            "sentiment_compound": -0.721
        },
        {
            "id": "hxugq9h",
            "score": 1,
            "text": "Respectfully disagree. I’m a manager and I believe that it’s in my selfish best interest over the long run to have employees with a healthy work/life balance and actively encourage my team members to focus on achieving that.",
            "title_similarity": "0.7594034",
            "sentiment_compound": 0.91
        },
        {
            "id": "hxugrjq",
            "score": 1,
            "text": "LPT: No one thinks or cares about you at all. Live your best life",
            "title_similarity": "0.4846666",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hxugsfb",
            "score": 5,
            "text": "I have had the opportunity to mentor young people entering my industry.  I have shared many times that **The Company will take everything you give, and then when you are spent, toss you out for someone younger.**  \n\nMy advice has always been that you are responsible for maintaining boundaries, and pushing back when agents of The Company try to take more.",
            "title_similarity": "0.71561646",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hxugv2u",
            "score": 1,
            "text": "I learned this lesson hard at my last job. Always took on the extra work/task and in the end I never saw much from it aside from more work. At my new job I set realistic expectations and keep my work load balanced. I am much happier now!",
            "title_similarity": "0.7445407",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hxugv8t",
            "score": 1,
            "text": "SOs absolutely do... They can feel and and they care that you can feel it.",
            "title_similarity": "0.33973238",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxugy7l",
            "score": 1,
            "text": "I'd like to add to this, it's good to keep an eye out for a good work/life balance , but its not your sole responsibility. Employers shouldn't act unethical to get the maximum out of you up till the point where you complain.",
            "title_similarity": "0.7472902",
            "sentiment_compound": 0.6063
        },
        {
            "id": "hxuh7va",
            "score": 1,
            "text": "I got tasked with taking over managerial duties at the branch where my manager quit and left for a different job.\n\nThey sang my praises for weeks. Kept me feeling confident about the role. They even told me to apply, and I went through three interviews with management. They told me they felt I was ready for the responsibility.\n\nThen they hired someone else and denied me a raise when I asked for a compensation review.\n\nI found a new job and was gone within a month.",
            "title_similarity": "0.64404714",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hxuhb99",
            "score": 4,
            "text": ">Keeping a good work/life balance is your own responsibility\n\nThis kind of implies that everyone needs to fight to achieve work/life balance. It is your own responsibility to *report* when you are not achieving work/life balance, but ultimately, I think some (I would actually argue, most) of the responsibility is on your manager to get you the support you need to maintain a good work/life balance. I've had a couple of managers who would regularly ask me about bandwidth, workload, etc and if I need help with anything. That *should* be the norm, but definitely is not.",
            "title_similarity": "0.86437917",
            "sentiment_compound": 0.9109
        },
        {
            "id": "hxuhbwv",
            "score": 1,
            "text": "Can 100% confirm this. Been working 60+ hours a week since last July due to short staffing and have an infant at home. There’s no appreciation and no one seems to care they only comment about how much overtime I’m making. \n\nFuck the money I’m losing valuable time with my family",
            "title_similarity": "0.65317017",
            "sentiment_compound": -0.5722
        },
        {
            "id": "hxuhd6y",
            "score": 1,
            "text": "Said no Protestant ever . . .",
            "title_similarity": "0.20187442",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxuhf0o",
            "score": 1,
            "text": "That is implying that our bosses aren't forcing us into said burnout.",
            "title_similarity": "0.6095545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuhit5",
            "score": 1,
            "text": "Work culture really sucks these days. Best advice is to just stay under the radar and to keep going with a better job offer every few years imo unless you find a unicorn boss that actually cares about you\n\nIf you worked for louis rossman then work ethic would matter, or if you work commission the same would apply but if your employer is the type that keeps taking an inch and setting the bar higher next time, you will run out of health before you benefit from working harder to not get chewed out for not performing as your best work you've done.",
            "title_similarity": "0.8100532",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hxuhjzt",
            "score": 1,
            "text": "My contract says 8hrs / day, 40hrs / week. Boss asked me only once if I could stay more and I simply said 'no'.      \nIts not my problem if management doesnt understand time/resource management and its not my job to fix their shit. The problem is they will usually find someone who will stay and in my case they did, my coworker worked into the night because he was unable to say no, or maybe he didnt mind, I dont know.      \nThreads like this one, warnings from older people to not give your life to a company is something I've taken to heart and I've put myself in a position where I can say 'no' whenever I want.",
            "title_similarity": "0.7528236",
            "sentiment_compound": -0.4314
        },
        {
            "id": "hxuhmwr",
            "score": 1,
            "text": "\"Nobody cares\" arguments always seem to ignore the reasons behind wanting a new broader change to take place in favor of pure practicality in the moment. That's exactly how we get stuck in the same shitty situations over and over again, for this and other things.",
            "title_similarity": "0.7057553",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hxuhpe7",
            "score": 1,
            "text": "very true. quite recently left a job after working myself to the bone day in and day out, coming in early, leaving late. didn’t get much appreciation during this time, but once i started slipping when i realized it wasn’t worth it anymore i got all sorts of hell from upper management. feeling pressured to stay late regularly because group tasks aren’t finished on time? peace out, my schedule is from A to B. at the end of the day, do what’s best for you.",
            "title_similarity": "0.7584618",
            "sentiment_compound": 0.8441
        },
        {
            "id": "hxuhsfq",
            "score": 1,
            "text": "Thank you corporate overlords, yes, work more. It’s my responsibility to be happy.",
            "title_similarity": "0.6441529",
            "sentiment_compound": 0.836
        },
        {
            "id": "hxuhut7",
            "score": 1,
            "text": "Don’t be afraid to leave work when the clock strikes that time. Doing extra is rarely rewarded. Any significant raise/promotion will come easier by changing jobs than working harder at your current one.",
            "title_similarity": "0.74040174",
            "sentiment_compound": -0.4802
        },
        {
            "id": "hxuhvwu",
            "score": 1,
            "text": "Yeah well...what if you're already burned out and you can't stop working?",
            "title_similarity": "0.54330266",
            "sentiment_compound": 0.4745
        },
        {
            "id": "hxuhwbx",
            "score": 1,
            "text": "Just like any relationship, they will always push to get away with whatever you allow, plus one.\n\nDraw the line early.",
            "title_similarity": "0.5646157",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxuhzxq",
            "score": 1,
            "text": "this should be extended to “nobody cares, you are your own responsibility”\n\nhard truth of life that most people don’t learn until too late",
            "title_similarity": "0.77758044",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hxui05b",
            "score": 1,
            "text": "Damn, I need to hear that right now. I’ve been putting off a career change in order to support my employer (small business owner and a good man), but I hate my job. I’m getting to the point where I can no longer fulfill my duties to the standard I expect and at this rate I’m going to have a melt down, do something stupid and get fired. So, I’m spending my day off applying for new positions in an adjacent field. I know this will be a burden to my boss that he doesn’t need, but he’ll hire someone new and move on. I should too.",
            "title_similarity": "0.83469653",
            "sentiment_compound": -0.976
        },
        {
            "id": "hxui95i",
            "score": 1,
            "text": "Been doing too much. I'm demanding a significant raise before working more than one position. Boss yelled at me but i stoid my ground. Store can die not my problem",
            "title_similarity": "0.7979232",
            "sentiment_compound": -0.5443
        },
        {
            "id": "hxuiara",
            "score": 1,
            "text": "Your boss cares. Probably the only person you should care about that thing lol.",
            "title_similarity": "0.7128053",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hxuiax3",
            "score": 1,
            "text": "Someone had told me to keep in mind that “there’s a significant difference between busyness and business - it’s only the latter matters.”\n\nIt’s been helpful back pocket reminder.",
            "title_similarity": "0.6479776",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxuiu0b",
            "score": 1,
            "text": "Correction: your family will care, your employer will not.",
            "title_similarity": "0.5859581",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxuj5rn",
            "score": 9,
            "text": "I’ve been a manager for almost 4 years now and I am happy to say that not a single employee has ever quit under me. I used to work for an agency where after just 9 months at the company, I became the most tenured employee under the AD role. I would always stress the importance of shutting down at the end of the day and taking all the vacation time you can. If someone sent an email at 10PM I’d chat with them the next day about it. My motto was always “if it can be sent at 6 pm, it can be sent the next morning.” \n\nI am familiar with burnout. I experienced it after just 3 years into my career working 12-14 hour days and 7 days a week. I promised myself I would never be a manager that burnt out his employees. Thankfully I work at a company now that has unlimited PTO (formerly 25+ days) and they encourage employees to take as much as they can and my boss is of the same mindset as me. I treat employees like people and I’m proud that. \n\nBe the manager you wish you had.\n\nEdit: this rant probably doesn’t contribute to the overall LPT, but if I can change just one manager’s perception then I feel like I succeeded.",
            "title_similarity": "0.6023743",
            "sentiment_compound": 0.9483
        },
        {
            "id": "hxujc7m",
            "score": 1,
            "text": "I come from an industry of “abuse”….Public Accounting/Consulting\n\nThe expectations are sky high and there is no work/life balance consideration.\n\nIt was because of that, I started my own company….I may work as many or more hours, but I do it on my own time and every hour I work is compensated at my hourly rate.\n\nI’m not saying starting your own company is easy, it’s not, and it’s expensive to start, and covid set me way back financially…but everything I do is way more rewarding, I can travel whenever I want, especially if I choose to work when I travel….I hate corporate America, or, rather, being employed by corporate America \n\nIf you have the startup cash set aside and are questioning yourself, sometimes you have to make the jump",
            "title_similarity": "0.7968377",
            "sentiment_compound": 0.4748
        },
        {
            "id": "hxujfdj",
            "score": 1,
            "text": "I mean, I think it needs to be said that some people don't have the luxury of creating a work/life balance or caring whether anyone cares if they overwork themselves or not. Inflation is at such a high that someone who works a 70 hour work week at federal min wage, will only take home roughly $430 usd after taxes. That's not livable in most places. For my family, half of that would be groceries alone. \n\nThat being said, people who brag about how tired they are from working is insane.",
            "title_similarity": "0.71911144",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hxujhds",
            "score": 1,
            "text": "This can apply to all aspects of life. You can have all the cards stacked up against you but in the end no one cares and its your responsibility to complete a goal. Also its your responsibility to find a purpose in life or find your own happiness.",
            "title_similarity": "0.7404537",
            "sentiment_compound": -0.031
        },
        {
            "id": "hxujqir",
            "score": 1,
            "text": "Similarly, who wants you to have a comfortable retirement?  YEP that's on you alone again.  This is the same thing really - don't let society's imagined hopes for you to change your life.  It's YOUR life",
            "title_similarity": "0.65794826",
            "sentiment_compound": 0.7925
        },
        {
            "id": "hxujtzi",
            "score": 1,
            "text": "Been there too many times.",
            "title_similarity": "0.25634545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxujxxl",
            "score": 1,
            "text": "I would say most companies specifically push you to the burn out phase.",
            "title_similarity": "0.52606946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxujzcu",
            "score": 1,
            "text": "My supervisor finally said he wants to see me volunteering some OT (I've worked 40 hr weeks for 33 yrs) because we are getting super busy and our new CEO has big expectations... and I asked him if he's working OT, he said oh ya.  I asked when does he get to go back to 40 hrs....  no comment.  But he did say it will affect decisions on my upcoming bonuses....\n.",
            "title_similarity": "0.62513304",
            "sentiment_compound": 0.775
        },
        {
            "id": "hxuk2bg",
            "score": 1,
            "text": "Companies have near perfected brainwashing workers they owe their job everything, even to the point of putting work ahead of their real life.  People need to remember, within a few weeks of leaving that job you are killing yourself for...you'll be replaced and forgotten.  \n\nI thank my lucky stars daily I hit the lottery with my government union job.  I don't have to deal with hardly anything people in the private sector deal with.  Clearly defined work hours, job responsibilities, great benefits, and a pension waiting for me when I retire in 2 years.  All while not overworking and life always taking precedent over work.",
            "title_similarity": "0.806798",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hxuk8pv",
            "score": 1,
            "text": "Being rich is a choice, where u work is also a choice",
            "title_similarity": "0.46067238",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxukeur",
            "score": 1,
            "text": "There's this old timer I work with that loves shitting on me about my work ethic because I take my 15 minute breaks and leave on time. Meanwhile, he never leaves on time and never breaks and says it's \"an old school thing.\" Really wears it as a badge of honor...and both of his knees are completely shot, he spends more time grabbing his copious cups of coffee and spends most of the time on the clock talking to customers and coworkers, of whom usually has to help him get his work done so he can still leave about an hour and half after his shift ended....but he doesn't take breaks which makes him better than me.",
            "title_similarity": "0.6845796",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hxukg2y",
            "score": 14,
            "text": "It isn’t your responsibility if your workload is literally designed to get you to your maximum capacity every day. I had been a driver for a well-known delivery service for over a year, had a route that no one else could do and even veterans of the job said they didn’t know how I pulled it off. They put me on routes that always took 11-12 hours every day, sometimes 14, and that’s if you’re working non-stop with breaks after you’re done.\n\nThe onus of taking care of ourselves only goes as far as what the company demands of us first, period. I stood up for myself and left, and while the security of the job and almost guaranteed nice retirement are gone, I can enjoy myself after doing absolutely nothing but work that entire time. At least for a little bit, while I’m still young. It was a job that I would wake up in 20 years in a month and wonder where my life went.",
            "title_similarity": "0.66884893",
            "sentiment_compound": 0.62
        },
        {
            "id": "hxukpg4",
            "score": 4,
            "text": "Which is easier said then done when you have a limited number of days off a year and have to save a few in case of emergency, let alone trying to enjoy life.",
            "title_similarity": "0.5332067",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxul4p3",
            "score": 1,
            "text": "Bare minimum for the maximum effort if you are too stupid to realize before the industrial public schooling spits you out and your blindly following the masses until you think for yourself oof",
            "title_similarity": "0.7201942",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hxullli",
            "score": 1,
            "text": "Hearing LPT's like this every once in a while is so helpful. I'm constantly trying to grow and learn, but also have hit major burnout phases. On paper I have an amazing work history, I get antsy when I'm not out and about doing and learning something. I have a \"work hard / play hard attitude\". I'm still learning how to balance this and be content with my life.",
            "title_similarity": "0.74205875",
            "sentiment_compound": 0.8795
        },
        {
            "id": "hxulqxv",
            "score": 1,
            "text": "Your family will care.  Multiplr times I've almost lost mine to working too much. \n\nMy wife has pulled me back each time. \n\nI have addictive personality and work is my drug. \n\nShe just flatly tells me and after our first big life event that was a work or us situation, I immediately back off of work. \n\nMy company won't give a shit if I die. Itll get sold off. My wife and kids though.",
            "title_similarity": "0.7514527",
            "sentiment_compound": 0.0559
        },
        {
            "id": "hxultt7",
            "score": 1,
            "text": "Most of the time burnout isn't because of the person, it's the work environment.  If a person can line up a better job, then maybe they can prioritize themselves.",
            "title_similarity": "0.81340504",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxum580",
            "score": 1,
            "text": "Work / Life balance gets easier when you realise your employer gives zero fucks about you, to be honest, but your \"kid will always remember you weren't there for (event)\".\n\nZero.\n\nYou'll be replaced and forgotten in less than a week or two, tops.",
            "title_similarity": "0.7514198",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hxum73b",
            "score": 1,
            "text": "Don’t forget when you burn out it’s your fault",
            "title_similarity": "0.52238536",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hxumgs5",
            "score": 1,
            "text": "Actually last week I had this issue. I've always prided myself on my work ethic, but declining mental health due to recent events in my personal life, plus the fact that I've been studying full-time in the evenings for the last year and I work full time during the day means that I've just been really struggling lately. And the last straw was last week when another problem student joined my class (I'm a teacher). I was just having such a bad day that I went to the toilet mid-class, threw up from the stress, then went back to teach the rest of the class.\n\nAfter that, i had to go to my boss and admit that I was struggling and burnt out. And he was really cool about it, immediately he was concerned and asked for and suggested ways to make things easier for me. Honestly, i did not expect anyone to be kind to me, and i almost cried there are then, from gratefulness and relief. That's when I knew that I had all this pent up stress that I had just bottled up. \n\nDon't burn yourself out guys... And if you're having a rough time, talk to someone. People want to help and you're not alone.",
            "title_similarity": "0.6971277",
            "sentiment_compound": 0.714
        },
        {
            "id": "hxummvx",
            "score": 1,
            "text": "My workplace actually encourages people to overwork by giving generous bonuses to those who work 60 hours a week. Until this year, workers were even allowed to work 7 days a week, and some did...\n\nImagine reaching 100k/year, but with absolutely no time to do anything else.\n\nUnless you have someone else doing your cooking and prepping your lunch, I don't see how it's even doable.",
            "title_similarity": "0.66469467",
            "sentiment_compound": 0.5041
        },
        {
            "id": "hxumpdr",
            "score": 1,
            "text": "This mentality from management is why there's huge turnover and a worker shortage. \n\nHow about taking care of employees regardless of whether they ask or not. \n\nAnd then giving them things like vacation days or sick days? Hard to have any worklife balance if management denies every time off or vacation request.",
            "title_similarity": "0.849434",
            "sentiment_compound": -0.3687
        },
        {
            "id": "hxumqbk",
            "score": 1,
            "text": "You can’t convince the ladder climbers that this is logical… however it’s lonely at the top, and I’ve seen more than a few decend from glory",
            "title_similarity": "0.6111395",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxumwd2",
            "score": 1,
            "text": "I think it's also important for managers to recognize what's going on, and take care of their employees.\n\nMake sure they're taking lunches, make sure they're taking breaks.\n\nSee someone spinning their wheels and getting frustrated with an issue? Pull them off and give them a breather.\n\nMake sure people are using their PTO.\n\nDon't let anyone constantly work long days and weeks",
            "title_similarity": "0.7811702",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hxun1d2",
            "score": 1,
            "text": "Not really. It’s everyone s responsibility to look after. Don’t normalize a statement just because it’s a contemporary fact. Instead, say, hey ppl always be aware of your surroundings and their performance as well as your own. If anyone is doing over or under try helping them. That’s how you become a society.",
            "title_similarity": "0.76966953",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxun3e2",
            "score": 1,
            "text": "I wish I had really practiced this when starting my own business. Life is much better now",
            "title_similarity": "0.6040736",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hxuncu3",
            "score": 1,
            "text": "Always underpromise, overdeliver. This way you’re usually in the driver seat of your own workload.\n\nBest lesson I learned from my years in consulting.",
            "title_similarity": "0.68992084",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxunexw",
            "score": 1,
            "text": "I care.\n\nI manage technical project teams at a 100 billion+ dollar company and I hate when people burn themselves out. \n\nYou are hurting the rest of the team who needs to now pick up your work, our metrics are off which affect everyone's bonus, and timelines get pushed.\n\nWhen we are setting the time line it was for X amount of people working 40 hours a week minus PTO/Sick/KTLO/Research/docs. Not you working 70 hours week one and two then phoning it in the next ten week cause you burned yourself out.",
            "title_similarity": "0.72901416",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxunk47",
            "score": 1,
            "text": "How do I deal with management who seem to think that if I have free time. I can take on more stuffs to do",
            "title_similarity": "0.58972615",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxunq0n",
            "score": 1,
            "text": "Sometimes they care if you are overworking yourself….when them paying OT causes budget issues.",
            "title_similarity": "0.61243975",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxunqvb",
            "score": 1,
            "text": "No, it's not. I will file for disability or even worker's comp if management gives me a workload that will cause severe stress. I have done this every single time since I became 25 and threw away weird fantasies of being promoted to an exec by 35.",
            "title_similarity": "0.60319114",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hxuo0xh",
            "score": 1,
            "text": "My line of work is notorious for burnout and high stress.  No one cares.  Over the years I’ve become better at taking care of myself, but OP is right.  You have to do it for yourself because no one else gives a shit.",
            "title_similarity": "0.8435178",
            "sentiment_compound": -0.8702
        },
        {
            "id": "hxuo20f",
            "score": 1,
            "text": "What if I’m working tons cause all my friends are usually busy or have different schedules? I can only spend a certain amount of time at the gym before it’s just exhausting and all my old hobbies don’t interest me as much anymore.",
            "title_similarity": "0.72159326",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hxuo8co",
            "score": 1,
            "text": "And you will often be made to feel guilty about it. LPT: don’t",
            "title_similarity": "0.49337715",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxuo9sn",
            "score": 1,
            "text": "I agree but I would add that employers have a responsibility to make a work/life balance possible, through things like paid sick leave and vacation leave, reliable breaks, and limiting mandatory overtime. The employee is responsible for making it happen, but the employer should make it possible.",
            "title_similarity": "0.77901787",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hxuob4i",
            "score": 1,
            "text": "This!!! I was in an accident two years ago, and while my employer has been fantastic in my time off and subsequent return to work, I definitely came back with a new appreciation for my own life, especially prioritizing myself over my work.",
            "title_similarity": "0.65574",
            "sentiment_compound": 0.8114
        },
        {
            "id": "hxuodbf",
            "score": 1,
            "text": "Which is kind of BS.\n\nWe should all be looking out for each other, more so the people in charge of our work life. They hold a lot of power over us. They can make us unable to obtain food and housing if they decide we aren't worth paying.\n\nOur employers have a responsibility to their employees, the same way employees have a responsibility to their employers. The employer should work to ensure the employee had time off to pursue their personal objectives, is paid correctly, and is provided health care (though this shouldn't be an employer responsibility, it should be a governmental one). Employees have a responsibility to do work as per their contract, be reasonable in their requests for consideration, and help work mates as much as possible.",
            "title_similarity": "0.8352436",
            "sentiment_compound": 0.7804
        },
        {
            "id": "hxuoi6d",
            "score": 1,
            "text": "Don’t forget that this typically includes your friends and family too, not just your employer.",
            "title_similarity": "0.5908254",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxuota4",
            "score": 1,
            "text": "Yeah but the amount of work people have to do to make enough money to survive, usually doesnt permit this. This is ignorant and stupid. A person who has to work 70 hours or yheyre short on a bill foesnt have the choice to work less. No one works by choice. This reeks of conservative individualist bootstrap garbage.",
            "title_similarity": "0.77916455",
            "sentiment_compound": -0.8406
        },
        {
            "id": "hxuotcg",
            "score": 1,
            "text": "So, if your boss isn't a shitbag, they should care.\n\nYes, the vast majority of bosses are shitbags, I'm aware.",
            "title_similarity": "0.7410029",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hxuotmx",
            "score": 1,
            "text": "LPT: Work two jobs until you eventually burnout so that you don't starve",
            "title_similarity": "0.73154485",
            "sentiment_compound": 0.3412
        },
        {
            "id": "hxup7r0",
            "score": 1,
            "text": "And if someone DOES care, fuck 'em.  No job is worth a burnout workload.",
            "title_similarity": "0.6918261",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hxup7sn",
            "score": 1,
            "text": "Ugh, this tip is a little gross to me. I hate this hyper individualistic society we live in now, not everything is your fault if it's out of your control. Some people unfortunately aren't in a position that provides them adequate resources or time for maintaining that balance, especially if they're on the brink of poverty",
            "title_similarity": "0.7108468",
            "sentiment_compound": -0.9414
        },
        {
            "id": "hxupg6w",
            "score": 1,
            "text": "Depends on your work situation.\n\nMy boss is super aware of burnout and schedules our work in a way that tries to avoid it.\n\nI've told him I'm close to burnout before and he has responded by lightening my load. \n\nThe real LPT here is to be discriminating about the jobs you take.",
            "title_similarity": "0.8382457",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxuph1c",
            "score": 1,
            "text": "Work for a company that honors efficient workers. I get my tasks at the beginning of the week (sometimes Friday the week before). It's my Manager's job to ensure that the work adds up to around 40 something hours. It's my job to give feedback if it's too little or too much. \n\nIf I finish on Thursday, guess what? Friday off. If I procrastinate till Thursday, that Friday is going to be a nightmare. \n\nA company that simply gives you more work when you finish, is just running your smart workers into the ground.",
            "title_similarity": "0.74142283",
            "sentiment_compound": 0.886
        },
        {
            "id": "hxuprq5",
            "score": 1,
            "text": "this! I have had so many co workers flip out on customers or their fellow co workers and blame it on how much they’re working but they’re constantly picking up extra shifts.. gah.",
            "title_similarity": "0.75073063",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hxupuc8",
            "score": 1,
            "text": "This LPT is ignoring the fact that nearly half of Americans dont have a choice in the matter and must work.  This is a protip for the privileged",
            "title_similarity": "0.74873513",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxuq0a8",
            "score": 1,
            "text": "Victim of people pleasing syndrome.  Grew up with people who complained about other people not stepping up and doing their part so, I never felt like I was doing enough and always overdid it so that could never be said about me.\n\nIt's a personal thing for real. I was praised repeatedly and well paid for my work. They begged me to go home that I was overdoing it but the more they said that to me the more I produced just because they noticed.\n\nCue to 13 years later of burning the candle at both ends and beyond, I basically broke. I had nothing to give.\n\nTo this day, I'm still struggling with just getting a project started. Let me be clear, if it's a project that will benefit or help another, I will drag myself through the mud to complete it for you but I cannot get anything done for myself on any level.\n\nIf I were to give anyone advice, I would say, Slowdown and breathe. If it doesn't get done, either the company will have to hire someone that can help or you should look for another job where you do not feel a level of stress caused by overworking yourself to please others.\n\nGood luck out there",
            "title_similarity": "0.7605227",
            "sentiment_compound": 0.9293
        },
        {
            "id": "hxuq3al",
            "score": 1,
            "text": "u/onlyforthisjob can you please clarify with situations you're talking about? I really hope you're not talking about people with mental health issues that are forced to work for financial reasons/get burnt out faster vs some overachiever that puts too much effort into their work compared to their actual duties and responsibilities with no guarantee for that extra effort to be valued.\n\nThere are some jobs like that. Be it for poverty, a *Global pandemic* that forces you out of your old job and quickly scrambling to find something that covers the bills... many people who aren't /you/ may not be in the position to find that comfy work life balance. Which was my situation. The job I got asked way too much from up for the pay we received. Almost all the people that work here are burnt out from the Incredible turnover. Not any of thier faults.\n\nThey aren't lazy, they know their position and what they're dealing with but have families to feed and some have two jobs to cover bills. They don't have the luxury to craft *a good work/balance* 😒 if I Ieft this company I wouldn't have received a 7 dollar raise listening to your advice. \n\nLast year we lost a person on my six-member team and you really can't help but not overwork when we have to contractually cover that person shift... So could you clarify what you mean by it being *my responsibility*? How is it my fault corporate only wants 6 people to cover a full week of shifts?\n\nSure, it's my responsibility for mental health, but if I can't afford to not work or quit to change jobs (my position has very few openings and very specific requirements) and we lose a person and all have to cover for the open shift or the /contract/ ends for all of us that's on me?\n\nI get that no one cares, but maybe people should? It reads as if you don't care and are the same type of person my bosses boss is. \"Pull yourself up by tyour bootstraps is how this post feels.\"\n\nThis just feels like a post from someone who is ingnorant and intolerant about the poverty mindset and systemic barriers that keep many people stuck in their jobs for healthcare/financial issues. People get burntout for many reasons and have to have two jobs to make ends me. \n\nSure, in the sense that the world and people like you, u/onlyforthisjob don't care about them, their problems or their burn out for problems that just /may/ be out of their control, it's their responsibility to figure it out. Probably shouldn't be though. I wonder how the world would look if employers actually did care about employee burnout and /WHY/ they were burntout in the first place. \n\nThis post and mindset is why we *need* r/WorkReform\n\nTL;DR:\n\nI don't care for people like that and wholehearted *DISAGREE* with your post, if my interpretation of what you mean is correct. \n\nIf I misattributed your intent, I apologize, but I have heard this so many times and I've seen my old bos shrug off an employee would was suicidal. So yet, maybe it should be their responsibility to at least check if their fellow human being needs some kind of support or something? Anything?\n\nOur client/bossess boss can and has changed our shifts at the drop of the hat... I love the work, the environment, the (old) shift, the co-workers, the pay, and where I work takes 15 minutes to get there. Should it be all on me that my boss can do that and it affects my mental health? I should just quit, try and hope to find something that even comes close to all those things even though that is literally the only problem? Or perhaps it should be my boss that should actually care that we're humans with lives outside of work and /not/ change all of our schedules (for no justifiable reason that we have seen). It's that or \"find somewhere else to work\" even though they 'love me and want my knowledge and skills'. I shouldn't even have to reveal my mental health issues to anyone at work. What you've said is the same energy as what my corporate boss thinks.\n\nI will defend mental health and advocate that people other than me, myself and I actually care about someone burntout or struggling through work.",
            "title_similarity": "0.8348769",
            "sentiment_compound": -0.8972
        },
        {
            "id": "hxuq3ih",
            "score": 1,
            "text": "I already know this deep in my heart but I cant help it because I want good grades. Ill fuck my self out especially in groupings.\n\nNever had good leadership skills and pandemic fucks peoples communicating skill or sht. I’d do things to help myself but too angelic to leave my group out \n\nARGSHAH CIANW DJCISNNAK ISNQK",
            "title_similarity": "0.78844154",
            "sentiment_compound": -0.8572
        },
        {
            "id": "hxuq6ry",
            "score": 1,
            "text": "I hate this so much and myself",
            "title_similarity": "0.35558546",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hxuqkwu",
            "score": 1,
            "text": "chatting with an older woman I work with, mentioned they might have not paid me for 1 holiday day\n\nshe tells me she missed out on 2 weeks paid holiday.......\n\nWTF? \n\ntell her to give me details and I'll try and help her get in touch with the people that can get that back for her\n\n'no, it's done, it's my lot in life, it always happens (?!)'\n\ncan't help someone that doesn't want to be helped",
            "title_similarity": "0.6523577",
            "sentiment_compound": -0.4147
        },
        {
            "id": "hxuqng2",
            "score": 1,
            "text": "I’ve made a point to set those boundaries early at my current job. I’m happy to work more than 40 when needed, that’s salary after all, but in most cases, I’m leaving at 40ish hours and if I’m expected to work events and travel on my weekends then I will be taking time out of the week to account for weekends lost, in most cases.\n\nMy coworker eventually cornered me after work one night, while I was staying late to get shit done, to call me out for abusing my salaried position and taking advantage of “how salary works”. \n\nI told him that’s the agreement I was hired on with and  if he has a problem with that then he needs to speak to the owner. Eventually he apologized and got himself a salaried role which now allows him more flexibility in his own schedule. \n\nThis has improved our work relationship, no one feels like they are being taken advantage of and we both have added flexibility and autonomy. \n\nI am fortunate enough to work for someone who appreciates and pushes work life balance. \n\nNow if only I could get healthcare through work….",
            "title_similarity": "0.7112433",
            "sentiment_compound": 0.9441
        },
        {
            "id": "hxuqnrq",
            "score": 1,
            "text": "Good tip. Also, if you work yourself to your breaking point and you actually have a mental break and snap at someone, you are still the asshole. \n\nAlso your employer will almost definitely try to find a way to not pay you for any time you miss if you do \"break\"",
            "title_similarity": "0.7912889",
            "sentiment_compound": 0.6128
        },
        {
            "id": "hxuqscj",
            "score": 1,
            "text": "To add: your friends and family do, in the sense that they care about you not getting a burn out",
            "title_similarity": "0.5401968",
            "sentiment_compound": 0.743
        },
        {
            "id": "hxuqzdu",
            "score": 1,
            "text": "Someone should tell this to the slacker population of /antiwork",
            "title_similarity": "0.5384506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxur0ve",
            "score": 1,
            "text": "Not everyone is afforded that opportunity. Tried to be more open minded as many people are not as fortunate as you",
            "title_similarity": "0.48850015",
            "sentiment_compound": 0.1012
        },
        {
            "id": "hxurbel",
            "score": 1,
            "text": "\"No, I can't work 60 hours a week, I don't have time for the things that make my life worthwhile\" \"Oh, well, you need to do those things on your *own* time, not on company time! We require you to work overtime!\" \"LOL my 'own time'? You're *infringing* on my 'own time' with unreasonable demands for overtime work! Hire more people if you need more work done!\"\n\nFuck these people and their shit.",
            "title_similarity": "0.76182956",
            "sentiment_compound": -0.3609
        },
        {
            "id": "hxurmyk",
            "score": 1,
            "text": "this is good, no, great advice",
            "title_similarity": "0.24581976",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hxurnx3",
            "score": 1,
            "text": "I feel so called out!",
            "title_similarity": "0.23618895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxurs4f",
            "score": 1,
            "text": "Yup.  100%.  Tenure means nothing anymore either aside from ESOP/stock options that grant after a certain # of years.  Was salaried making \\~100k a year for a prior company, putting in 60 hours a week for an insufferable savage brute of a manager.  When I put in my 2 week notice they said \"I'm shocked\".  It was unreal, 60 hour weeks for 365+ days and you never even noticed?\n\n  Looked elsewhere, landed another job, now making 20% more than that and I barely do 40 hours,  and every single thing I do they act like I'm a golden goose that just shit a golden egg.  If you are suffering at a company tell them to put up or shut up then GTFO when they dont.  In business appropriate terms of course.\n\nFinally something I can comment on based on my actual true experiences.",
            "title_similarity": "0.58361804",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hxurtct",
            "score": 1,
            "text": "Truly. Nobody has any empathy for you",
            "title_similarity": "0.2957731",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxus06x",
            "score": 1,
            "text": "I agree with the latter, but good management / owners will care. Any business owner or manager worth their salt pays close attention to this and when they advise you to take a break or slow down, you should.",
            "title_similarity": "0.68296576",
            "sentiment_compound": 0.9052
        },
        {
            "id": "hxusel7",
            "score": 1,
            "text": "Even if that means you quit your shitty job to find a better one.",
            "title_similarity": "0.70154583",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hxusfmm",
            "score": 1,
            "text": "Nah imma work like a lithium powered slave for six months then get disillusioned and quit\n\nRinse repeat\n\nNew jobs induce a sense of hope and optimism I really like. When that feeling goes away, I look for another job.",
            "title_similarity": "0.6440158",
            "sentiment_compound": 0.8357
        },
        {
            "id": "hxusglj",
            "score": 1,
            "text": "How am i nearly 50 and only starting to really, really get this?",
            "title_similarity": "0.18628621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxush7o",
            "score": 1,
            "text": "Plenty of people care and have no problem adjusting accordingly. It’s golden rule adjacent",
            "title_similarity": "0.367321",
            "sentiment_compound": 0.666
        },
        {
            "id": "hxusj4u",
            "score": 1,
            "text": "Spoken like, and titled like a true asshole.",
            "title_similarity": "0.3519985",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hxuskry",
            "score": 1,
            "text": "My boss cares. \n\nLPT: everybody should work for my boss",
            "title_similarity": "0.7153783",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxuslxd",
            "score": 1,
            "text": "This isn't a LPT.",
            "title_similarity": "0.024976965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxusnvt",
            "score": 1,
            "text": "I agree with the sentiment of this LPT up to the point of “nobody cares.”\n\nI care. Your boss or your company doesn’t care, but there are lots of people around the globe that genuinely care that so many people are burning themselves out and killing themselves for these jobs that would replace you the next day. Don’t think you’re alone in this struggle, this is a collective struggle. I care about you and your work/life balance.",
            "title_similarity": "0.8483846",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hxuss91",
            "score": 1,
            "text": "I'd like to respond from the viewpoint of a retiree (a Boomer).\n\nI found a job in 1981, that I actually enjoyed, working in maintenance for a larger school district. Think HVAC (Heating, Ventilation & Air Conditioning).\n\nI was fortunate that I worked for a supervisor, who became my mentor. He was highly thought of in his respective field. (heat pumps and installations). He being a supervisor, was at the low end tier of administrators, with approximately 12 mechanics that answered to him. Myself and two or three other were apprentices at that time. \n\nMy supervisor/mentor, were what may be considered outcast because of positive outlook on work and being conscientious when it came to getting the job done. He showed me the ropes of written and unwritten rules and regulations within our work environment. \n\nI picked up on what and how my job performance would affect my advancement, mainly to become a mechanic and work in a quadrant of our area of responsibility. Mainly for the money, but also the chances for advancement within our department. Raises followed with advancements.\n\nI took on work that most people refused, which is an entirely different post. Taking extra workload worked in my favor, as I became trusted to work alone or when needed worked within a group. This lead to me being assigned minor and major projects, with and without assigned help. At times working with contractors on renovations and new buildings. I was rarely questioned in the acquisitions of tools, equipment or parts, to complete assigned tasks. No one is indispensable, but doing projects most people balked at or refused, gave me trust and credence as a worker and manager.\n\nI did move from that department to another in 1984 that dealt with building controls (pneumatics) then into PLC (Programable Logic Controls) and digital controls, beginning of computers and digital related controls.\n\nWe went through series of supervisors, which I eventually became one in 1991. This in turn,  with raises and overtime, I worked 60-80+ hours per week, increasing my income and setting up annuity(401b), saving one third of my income per pay period. \n\nI was on-call 24/7 for this period of time. (Approximately 10 years give or take)\n\nThe work and benefits enabled me to retire at 58 in 2011, comfortably and receiving three fourths of my base pay per month. \n\nI came across people from all walks of life. Many I met were miserable working at their jobs they \"hated\". I on the other hand found a craft that was challenging and rewarding, if only me being happy with my own work performance.\n\nIn process of my work life, I was able to buy a home and used many skills learned to renovate my home to my needs. It is home and easily maintained and cleaned.\n\nTimes have changed and so has the world, I feel fortunate to have found a (monetarily) rewarding occupation, in which I feel I contributed to society.\n\nMy time is my own now.\n\nAnd let the haters come out.",
            "title_similarity": "0.65322125",
            "sentiment_compound": 0.9798
        },
        {
            "id": "hxusstt",
            "score": 1,
            "text": "My wife used to do this.  Working off the clock, always answering work calls no matter what time it was.  She started creating healthy boundaries and telling people no.  Not only is she working less hours and getting treated with more respect, but it forced the company to realize her value and she got a raise!",
            "title_similarity": "0.77518725",
            "sentiment_compound": 0.4591
        },
        {
            "id": "hxusxlc",
            "score": 1,
            "text": "And choosing not to is also allowed",
            "title_similarity": "0.2584197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxusz67",
            "score": 1,
            "text": "wish I knew this three jobs ago..",
            "title_similarity": "0.37905294",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxutbcs",
            "score": 1,
            "text": "Is that really a tip? Sounds more like an opinion to me",
            "title_similarity": "0.24977753",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hxutdcx",
            "score": 1,
            "text": "Another dumb lpt",
            "title_similarity": "0.242131",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hxutfo5",
            "score": 1,
            "text": "I see this all the time at work. People are waiting for their boss to manage it for them. It’s your responsibility to say no if you’re overloaded and to schedule and stick to vacations.",
            "title_similarity": "0.79073703",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxutkpb",
            "score": 1,
            "text": "Several years ago when I worked for disney.  A friend of mine would come into work an hour before his shift to \"get stuff done\".  When I asked him why he would do this he claimed that he was going to get a promotion \"real soon\".  Two years later I had my two year degree and left the company to go to a four year school out of state....... he was still there waiting for that promotion.  I don't know if he ever got that promotion.",
            "title_similarity": "0.5365853",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxutlg4",
            "score": 1,
            "text": "Especially the company you work for. They couldn’t care less that you burn out they will just replace you",
            "title_similarity": "0.8060063",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxuu1f1",
            "score": 1,
            "text": "Id love to tell myself this but im way too busy",
            "title_similarity": "0.6076889",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hxuu2w0",
            "score": 1,
            "text": "That’s easier said than done. When you are responsible for the livelihood of others (both at work and at home), it’s not so easy to just stop in the middle of what you are doing and say that it can wait till tomorrow.",
            "title_similarity": "0.7758497",
            "sentiment_compound": 0.1708
        },
        {
            "id": "hxuu47z",
            "score": 1,
            "text": "That’s why even though I am passionate about my work, I sign off at 5 o’clock sharp.",
            "title_similarity": "0.4433822",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxuu5au",
            "score": 1,
            "text": "That middle manager whose trying to claw past his competition definitely wants you to overwork yourself.",
            "title_similarity": "0.7062468",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxuu5le",
            "score": 1,
            "text": "I just quit my job after because burnout was too severe. Now I’m scared of unemployment, not sure if I want to return to my industry, and so so mentally and physically tired. I know this will take years to recover and I’m so angry at myself for letting this happen.",
            "title_similarity": "0.7007102",
            "sentiment_compound": -0.9451
        },
        {
            "id": "hxuu5mq",
            "score": 1,
            "text": "As someone who had to take a mental health day due to things like managers not giving people time to grieve about the death of parents/members and worrying more about customer complaints than employee ones honestly sometimes you don’t get a choice. Other than seek employment elsewhere sometimes you don’t get a choice.",
            "title_similarity": "0.75367177",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hxuu8vl",
            "score": 1,
            "text": "The labor participation is too low for this to carry an weight. \n\nHow can the working people maintain a balance when so many people are not contributing to the work force? \n\nUnemployed Antiwork people are the unvaccinated of capitalism. They are driving prices up and adding to the burnout of their working peers.",
            "title_similarity": "0.78719413",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hxuudfv",
            "score": 1,
            "text": "Years ago when I was between jobs and trying to decide what to do with the rest of my life, I met a guy who had worked so hard he ended up in the hospital for exhaustion. While he was laying there staring at the ceiling he made a decision. He told me: \"If I would work this hard to make lots of money for someone else, why shouldn't I work this hard to make lots of money for myself?\" He decided to become self-employed, and never looked back. \n\nThat made a huge impact on me, and I decided to start my own business as well. That was 25 years ago, and I've been self-employed ever since. If I'm going get overworked, I want the beneficiary of my efforts to be myself and my family.\n\nIf you are a natural workaholic, then be a workaholic for yourself.",
            "title_similarity": "0.6838602",
            "sentiment_compound": 0.6038
        },
        {
            "id": "hxuuhp7",
            "score": 1,
            "text": "I am in this situation. I work until 10 p.m. or sometimes until midnight; I also work on weekends but my project lead only talks bout how I am always late to work. Kinda frustrating",
            "title_similarity": "0.6265105",
            "sentiment_compound": -0.5284
        },
        {
            "id": "hxuui0g",
            "score": 1,
            "text": "It's been proven if you work more than 55 hours a week, you performance decreases. I've seen first hand people working 7 days a week because \"they don't want to be here x number of days\" and they just blow thru the job, making it look like shit and then when they leave, management sends other people to fix their cluster fuck of a mess.",
            "title_similarity": "0.73639214",
            "sentiment_compound": -0.6152
        },
        {
            "id": "hxuuo0b",
            "score": 1,
            "text": "I’m currently a patient in the hospital with a second inter cranial bleed due to high blood pressure due to over -working. \n\nI’m a nurse.",
            "title_similarity": "0.41012102",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxuur4v",
            "score": 1,
            "text": "I'm responsible for it yet its completely outside of my control unless I keep switching jobs until I find one that allows that and pays well, which might as well be looking for a unicorn nowadays and would take several years and probably bankrupt me.",
            "title_similarity": "0.62067664",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hxuuuh4",
            "score": 1,
            "text": "yup, can confirm.\n\nHigher ups couldn’t give two💩s about you after killing yourself making them richer with bonuses.\n\nImmediate manager says this is an area that I fucking need to improve. Not her, not her higher ups, no one,  but me, because it’s my fault that I couldn’t make them rich fast enough.",
            "title_similarity": "0.79215705",
            "sentiment_compound": 0.7455
        },
        {
            "id": "hxuuunk",
            "score": 1,
            "text": "I have no set schedule. I tend to work 46 hours a week. I'm burnt out. I keep calling in sick/tired. Boss likes my work and professionalism. I told him I'm tired 2 weeks ago. He sent me home saying I might need to take a few months off work. I gladly took the time off. I'd rather just work 8 hours a day and be done. But no I'm up at 6 and not home til 6. Then dinner 730ish relax for 2 hours and in bed. Not much personal time. So I'll call in sick when ever I want.",
            "title_similarity": "0.6770713",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hxuuwoj",
            "score": 1,
            "text": "Uh, as a manager I actually do care. I work really hard to try to make sure the team isn’t burning out. Losing a good engineer and tons of training to burnout is NOT a good outcome for anyone.",
            "title_similarity": "0.8265885",
            "sentiment_compound": 0.4021
        },
        {
            "id": "hxuuxfz",
            "score": 1,
            "text": "I think *a lot* of people care about other people's burnout, even strangers. There is some humanity left.",
            "title_similarity": "0.6619804",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxuuxuf",
            "score": 1,
            "text": "I’m working 60 hours a week. But I am getting paid well. That’s when it becomes tough to decide what to do.",
            "title_similarity": "0.6346625",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hxuv0bu",
            "score": 1,
            "text": "This is true! \n\nThough I try my best to be mindful of it for myself and my team.",
            "title_similarity": "0.5294256",
            "sentiment_compound": 0.807
        },
        {
            "id": "hxuv2d3",
            "score": 1,
            "text": "This is so true... You might be sitting there waiting for others to notice that you're running at 110% constantly, thinking that eventually someone will notice, step in and offload / help remediate the issue. They won't... Your peers won't step in because they don't want more workload, your management won't step in because you're likely producing more work product that their average employee, why would they want to stop that? \n\nKnow who will step in? Your family... After all of their repeated comments you ignored, missed plays and soccer games, help that you couldn't give on those school reports, except you might not notice until they're on their way out the door, sick of your shit. Remember, those of us with families say we work to provide for them, but they're not going to see your 80hr a week as a requirement, they'll see it as a choice, a choice where you chose work over them. This isn't the 1950's or 1960's anymore, the nuclear family is dead, was never healthy to begin with. \n\nDon't put work before your family, find a damned balance. I wish that I genuinely understood this 15 years ago, fix shit before it's too late.",
            "title_similarity": "0.770104",
            "sentiment_compound": -0.9493
        },
        {
            "id": "hxuv50p",
            "score": 2,
            "text": "Applies to fitness and training, too. Recovery is key.",
            "title_similarity": "0.42676586",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxuv6el",
            "score": 1,
            "text": "I tried telling this to my husband, who is a cook. He was working 50 hours a week for a place that couldn't care less about him, and supplied him with a free bottle of liquor a week to keep him from speaking up about unsafe work practices. He nearly drank himself to death and started self harming. Our marriage nearly failed.\n\nOnly when he suffered a spinal fracture at work, did he slow down. Granted, that was after mixing opiods and alcohol and ending up hospitalised.\n\n\nYour job is never worth your life.",
            "title_similarity": "0.65102494",
            "sentiment_compound": -0.9185
        },
        {
            "id": "hxuvozx",
            "score": 1,
            "text": "To add to this, no one cares if you're not working enough to make your ends meet.\n\nThere's always more opportunities and work to be done. Handle yourself",
            "title_similarity": "0.75433147",
            "sentiment_compound": -0.2702
        },
        {
            "id": "hxuvpt1",
            "score": 1,
            "text": "I don’t think people have the luxury to just work 30 hours a week",
            "title_similarity": "0.5681164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuvtar",
            "score": 3,
            "text": "For the love of God, please do not accept extra work without monetary compensation in return. It's extremely irritating to your coworkers, and makes underlying problems even worse.",
            "title_similarity": "0.74376535",
            "sentiment_compound": -0.3973
        },
        {
            "id": "hxuw00e",
            "score": 1,
            "text": "See this is why I left New York. It’s a weird point of pride, especially there.",
            "title_similarity": "0.49990702",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hxuw0bi",
            "score": 1,
            "text": "Note: this is a fairly American sentiment.",
            "title_similarity": "0.23005542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuw0qt",
            "score": 1,
            "text": "In fact, many employers encourage you to work yourself until burnout.",
            "title_similarity": "0.7267205",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxuwapx",
            "score": 1,
            "text": "Remember the company you work for can replace you. Take care of yourself. \nAs someone who is burnout and charred, I should have done better. But I am starting to.",
            "title_similarity": "0.7550162",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hxuwdok",
            "score": 1,
            "text": "People talking on here about time off and 'holidays' like some kind of communists.  You know who has 28 paid days off a year. The Russians. That's who!",
            "title_similarity": "0.5417362",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hxuwkz1",
            "score": 1,
            "text": "Tell that to the nurses and teachers",
            "title_similarity": "0.36101466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuwmu7",
            "score": 1,
            "text": "Okay, then advocate for a 4 day work week.\n\nRefine what the standard employment expectations are for employees.\n\nNormalise unions, and workers rights.\n\nAnd start paying people what they are worth.\n\nThis LPT is only applicable when workers rights are reformed...",
            "title_similarity": "0.6493249",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxux3x1",
            "score": 1,
            "text": "Thanks for the reminder. I’m 37 and still working on it.",
            "title_similarity": "0.42389864",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxuxddz",
            "score": 1,
            "text": "This doesn't sound like LinkedIn advice.",
            "title_similarity": "0.17778903",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hxuxdem",
            "score": 1,
            "text": "Nobody will be impressed. Hell they might even start to dislike you.",
            "title_similarity": "0.51872087",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hxuxggm",
            "score": 1,
            "text": "Luckily my job isn’t quantifiable in it’s day to day. I do what I can, and go home.",
            "title_similarity": "0.6065996",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxuxkpa",
            "score": 1,
            "text": "Sending emails in the middle of the night never looks good",
            "title_similarity": "0.4406194",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hxuxm9q",
            "score": 1,
            "text": "My husband…. volunteers for every little thing, has to be everyone’s hero, drives himself mad, then says he must quit because he’s getting stress-related diseases and the job expects too much out of him.\nWhen the whole time I’ve been reminding him that all of his grief is his own doing.\n\nThen he goes to the next company and does the exact same thing. Over. And over. And over again.\n\nBut it’s never his fault, it’s always ‘the company’. While I watch this man leap across the living room to answer a call from his boss on a Sunday afternoon. Meanwhile my work phone is chilling turned completely off. 🤷🏾‍♀️\n\nI’m constantly telling him “they only call you and ask you to do this shit because you’re dumb enough to always say yes”. Now I’m the asshole. 🥴",
            "title_similarity": "0.7386896",
            "sentiment_compound": -0.8882
        },
        {
            "id": "hxuxpbm",
            "score": 1,
            "text": "1) this is not a life tip.\n2) This really overlooks the fact that, at least in the US, there are societal expectations to overwork and a really toxic work culture in general. We aren’t going to “individual responsibility” our way out of this problem - it requires policy change like mandated amounts of vacation/sick time, stricter overtime rules for salaried employees, etc.",
            "title_similarity": "0.75766265",
            "sentiment_compound": -0.1593
        },
        {
            "id": "hxuxqqr",
            "score": 1,
            "text": "I would add to this that in a lot of cases, pushing back on taking on more work to your managers/clients will often not be punished and could even possibly be rewarded and seen as a sign of maturity/responsibility (or at the least a dead end no longer worth pursuing).",
            "title_similarity": "0.7714184",
            "sentiment_compound": -0.3582
        },
        {
            "id": "hxuxrg5",
            "score": 1,
            "text": "Understand that there will be people who give you shit either way. If you're a workaholic who wants to retire by 40, people will insist you're missing your life and if you want to be there for the important stuff early on in your kids' lives, there will be those who insist your career is suffering. \n\nThey're both wrong. Live your life.",
            "title_similarity": "0.73936206",
            "sentiment_compound": -0.872
        },
        {
            "id": "hxuxrvt",
            "score": 1,
            "text": "Yep. Currently watching one of our young managers burn herself out. She wants to do it all herself and not delegate work to us. She could have a much lighter load but chooses instead to handle things herself. Unfortunately she hasn't been fun to work with. It's like watching a car crash. You want to stop it, but you can't, all you can do is watch.",
            "title_similarity": "0.6759489",
            "sentiment_compound": -0.8273
        },
        {
            "id": "hxuxy66",
            "score": 1,
            "text": "But what about the jobs that don't give you the opportunity or enough time to do that?",
            "title_similarity": "0.6249501",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxuy21r",
            "score": 1,
            "text": "And then you burn out - and they toss you aside and have no value to them. \n\nTake care of yourselves!",
            "title_similarity": "0.539815",
            "sentiment_compound": 0.3519
        },
        {
            "id": "hxuy44x",
            "score": 1,
            "text": "Aim to give 75% everyday. Then when you give 50% it’s an off day, and when you give 100% you went above and beyond.",
            "title_similarity": "0.34141415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuy7tz",
            "score": 1,
            "text": "*employers don’t care\n \nFriends and peers care loo",
            "title_similarity": "0.6330663",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hxuya9b",
            "score": 1,
            "text": "I don’t just not care - I think someone is pretty damn weird for it. Sends off weird superiority complex vibes",
            "title_similarity": "0.44629434",
            "sentiment_compound": -0.2796
        },
        {
            "id": "hxuyf98",
            "score": 1,
            "text": "Well technically it shouldn't be on the employee to keep a work/life balance. The company should have policies and follow local, state, and federal labor laws. It's like saying it's on you that your bank cheated you out of money. Sure you have to be on top of things, however putting the onus on the employee alone gives the companies a carte blanche to avoid fixing their staff shortages.\n\nIn the vast majority of cases the company knows that they are understaffed and they know people want to keep their job, no matter what, so they use that as leverage.",
            "title_similarity": "0.82465315",
            "sentiment_compound": -0.0449
        },
        {
            "id": "hxuyjj3",
            "score": 1,
            "text": "Your manager will. Hitting a wall means time off unexpectedly. I’d rather know you’re gonna be off then get a last minute notice.",
            "title_similarity": "0.67132676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuyk19",
            "score": 1,
            "text": "This makes it sound like appropriate staffing isn't fully the responsibility of employers everywhere.\n\nWhile I generally agree with your post, there are situations where an employer is essentially expecting you to complete a task and hasn't provided adequate staffing to complete it in time, which is essentially the ultimatum of: \"sacrifice your work life balance or quit.\"\n\nIf you don't complete the task you will get poor reviews, could even be used as an excuse to let you go, etc. But you can't reasonably complete the task in time while maintaining a healthy work/life balance and thus the only way to take responsibility for your work/life balance without pigeonholing yourself into your current level and pay is to leave that company.\n\nFor any relationship, team, party, whatever collection of humans working together on a task, there exists a shared intertwined causal responsibility. Something that usually looks like:\n\nIf entity A did this differently, it wouldn't have gone bad... but if entity B hadn't done that, entity A wouldn't have had to do it that way to begin with!\n\nIt is pointless to do anything other than look at what you are capable of controlling or influencing yourself.\n\nIf you are an employer and your employees are getting burnt out, shut up about them not balancing their life, take responsibility for (what is supposed to be) YOUR team and either get appropriate staffing or hold your current staff accountable for getting their work done and reward them appropriately when they do a good job (that means more merit based pay or profit sharing, not pizza Friday or w/e).\n\nIt isn't that hard to work with people and help them improve whatever it is you want them to, but we have a plethora of managers who got promoted for hard work over efficient work and leadership qualities. And when you are a standard level employee, your managers are literally pretty much the lowest ranked people who wanted to be a manager in that organization. That's why most of them can't even take responsibility for much of anything, let alone the actions, conflicts, and motivational states of their team members. \n\nI can't begin to count the number of times I've seen middle managers pivot in a way that boils down to \"It isn't my fault my team sucks!\"\n\nIf you are an employee and getting burnt out, shut up about what your employer is doing wrong and look in the mirror. If after doing so you still think they are the problem, then find a new job. Stop staying under bad management and sending the message that mediocre finger pointing is somehow acceptable leadership.",
            "title_similarity": "0.8443995",
            "sentiment_compound": 0.9906
        },
        {
            "id": "hxuylh4",
            "score": 1,
            "text": "A client says something to me that really stuck last year.\n\nNo client is going to come out and praise you for killing yourself to get a job done and congratulate you on destroying your body.\n\nThey will tell you how good a job you did when your done tho if they are decent people.",
            "title_similarity": "0.68873537",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hxuyqfr",
            "score": 1,
            "text": "I’m a manager if operations we know people burn out. However picking up 16 hours of “OT” doesn’t mean you should call off Monday and Tuesday because you have 80 hours on your pay period.\n\nWe have coverage needs and happened to need extra help at hours people apply for. It’s not intended to make your own schedule.\n\nJust work the 40 have your weekend and don’t leave the rest of your team hanging on busy Mondays and Tuesdays.\n\nRant over.",
            "title_similarity": "0.7678489",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxuyvhu",
            "score": 1,
            "text": "Yep.  Nobody asked for you to burn out.  Give them 75% and it’s probably still more than they asked for or really need from you.  Wellness is wealth!",
            "title_similarity": "0.45932013",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hxuz7xj",
            "score": 1,
            "text": "Your entire life is your responsibility",
            "title_similarity": "0.47111833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuzcf5",
            "score": 1,
            "text": "I don't know if it's the same everywhere on the planet, but here in Québec, Canada, people are proud of doing overtime, they say it openly and its well see by teammate. It's not rare someone tells me he did lots of overtime and then I know he's waiting for a \"congrats\".\n\nI think... Doing overtime is a sign of weakness. It can mean you are not fast/good enough to do you things. It can means you are weak at managing your time. It can means you don't appreciate having time with your family. It can means your too weak to just say no to your manager. It can means your unaware of body health best practice. \nWeak. Weak. Weak.\nOvertime is a sign of weakness. Deal with it.",
            "title_similarity": "0.7861273",
            "sentiment_compound": -0.9463
        },
        {
            "id": "hxuzdaf",
            "score": 1,
            "text": "I think the point of this is definitely true but companies are really starting to care about burnout because it negatively effects them",
            "title_similarity": "0.7292333",
            "sentiment_compound": 0.8149
        },
        {
            "id": "hxuzifz",
            "score": 1,
            "text": "Aa a manager, I care. Bad morale and turnover is not good for anyone",
            "title_similarity": "0.714402",
            "sentiment_compound": -0.4031
        },
        {
            "id": "hxuzlgy",
            "score": 1,
            "text": "The people around you care. \n\nThe people you work with care. \n\nThe people who have to do extra work because you’re on a holiday care.",
            "title_similarity": "0.5843328",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hxuzok2",
            "score": 1,
            "text": "People like me care, we care about you performing at your best always. Which means I'm going to remind you not to let that pto build up. Use it and take time for yourself.",
            "title_similarity": "0.72912806",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hxuzpsg",
            "score": 4,
            "text": "This is absolutely the truth.  There is always going to be unwritten pressure to work more, you’ll always be made to feel you were “too slow” on every project, and you will always get side eye whenever you’re packing up to leave (whether that’s just two hours after quitting time or six hours after).  Your boss will always push you to stretch your day, put more on your plate, and allude to “negative career impacts” if you ever say no.\n\nThey will make you feel like you’ll be fired if you do it, but you have to push back.  Standing up for yourself is hard, but it’s the only way.  I still work 7 days a week with no OT pay, BUT by pushing back I’ve made it so that Sunday’s are only 5-6 hours of work and I have some free time in the afternoon.  I’ve also made it so I can even use a portion of my allotted PTO when project schedules are a little bit more light.  I have a ways to go, but pushing back is the only way to prevent your employer from taking everything you have",
            "title_similarity": "0.82486606",
            "sentiment_compound": 0.2922
        },
        {
            "id": "hxuzx69",
            "score": 1,
            "text": "slpt: overwork yourself so you hit a burnout, everyone will start to notice you",
            "title_similarity": "0.664156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxuzxs4",
            "score": 1,
            "text": "Yes, but also we must remember that some are forced to overwork to sustain themselves. For some, it is a systemic problem to which they are a victim.",
            "title_similarity": "0.6451567",
            "sentiment_compound": -0.8537
        },
        {
            "id": "hxv05xg",
            "score": 1,
            "text": "I had a coworker work 12s almost every day due to short staffing (12\\*5=60hr work weeks) and she was always talking about how all she did is work, work, work, and how life back home in Europe was so much nicer...told her to stop doing the 12s and she said, \"who else would work then?\" Uhh, not your problem!! Some people never learn.",
            "title_similarity": "0.73348165",
            "sentiment_compound": 0.1635
        },
        {
            "id": "hxv0e10",
            "score": 1,
            "text": "I don't like this LPT. It makes it seem like your workload is an individual choice and not one bestowed to you by your employer. OP seems ignorant of the fact that worker's rights are constantly being eroded",
            "title_similarity": "0.74596167",
            "sentiment_compound": -0.1803
        },
        {
            "id": "hxv0jrh",
            "score": 1,
            "text": "This is kinda shitty imo. Work/life balance is a thing that can be really difficult to figure out, and assuming that nobody cares means that you’ll be afraid to ask for help when burnout happens suddenly. It is my responsibility but it is also my hope that I will not be punished for trying to figure out a balance that seems to be constantly shifting.",
            "title_similarity": "0.78630775",
            "sentiment_compound": 0.7827
        },
        {
            "id": "hxv0kcl",
            "score": 1,
            "text": "I do have to say though, it took a burnout last year for me to come to the realisation that I needed to readjust my priorities and start putting my health and wellbeing first.\n\nWhilst it was an extremely difficult time that came with some repercussions, I’m glad that I realised this now rather than wasting my life putting myself under constant pressure and worry until the day I retire.",
            "title_similarity": "0.6628886",
            "sentiment_compound": -0.7645
        },
        {
            "id": "hxv0n25",
            "score": 1,
            "text": "I left my previous job for this reason. It was an operations job with 12 hour rotating shifts (days/nights every other week) and we were constantly expected to cover extra shifts on top of it - \"just finished a 48 hour week of nights? We need you to come in tomorrow morning\". \n\nThe pay was decent - but only because of the overtime. The base pay was lower than industry average and we worked ourselves to exhaustion for raises and bonuses that were lower than inflation because the company - while still being very very profitable - just missed their target projections. \n\nWe were lucky to get a heartfelt thank you from a supervisor for coming in for coverage,  and half the times I was legitimately sick and trying to call out, I was told to come in anyway because there was no coverage. \n\nMy point is that we were all just tools to senior management and the company in general. They were more than happy to squeeze every little bit of usefulness out of us and didn't bat an eyelash when their most senior operators left in droves. My health suffered, my relationships suffered, and I was not happy.\n\nOnce you're known as the guy who always comes in for coverage, you're basically expected to always be that guy. You even develop a sense of obligation and the company will guilt you into it. And it's never worth it to sacrifice yourself for the company's benefit. You can almost guarantee that they wouldn't go out on a limb for you if it hurt their bottom line, and your health is your bottom line.",
            "title_similarity": "0.7534205",
            "sentiment_compound": -0.6002
        },
        {
            "id": "hxv0pp2",
            "score": 1,
            "text": "I just told my supervisor this morning that if they cannot find me support I'm submitting my resignation. It's only been a month or so of 45-50 hour weeks and my mental health is deteriorating at an alarming rate. I work for a huge company,  but in a small underfunded department and we had three huge projects (affecting more than 100,000 clients a piece ) all started January 1st.  When I expressed to my employer that I was completely overwhelmed and cannot maintain everything that they need me to complete on thier timeline, I was told that everybody's busy and we're all in the same boat. Oh yeah, and they will keep it in the back of their mind to consider what they could do to find support for me.",
            "title_similarity": "0.6192408",
            "sentiment_compound": 0.8485
        },
        {
            "id": "hxv13ke",
            "score": 1,
            "text": "We've all worked with people who work through lunch and work more at home.\n\nWorking longer hours doesn't make you a better employee, it just shows you have poor time keeping and orgazational skills.",
            "title_similarity": "0.8037747",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxv15po",
            "score": 1,
            "text": "Shutters in poverty if don't work overtime",
            "title_similarity": "0.6846194",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hxv1fic",
            "score": 1,
            "text": "Even if I knew this the time kept stacking and soon I couldn´t sleep, memory was not working and overtime every month. On top of that being bullied and a boss that was so exhausted that she did not do anything about it.",
            "title_similarity": "0.64719486",
            "sentiment_compound": -0.7609
        },
        {
            "id": "hxv1srq",
            "score": 1,
            "text": "This is why I said no when they asked me to come in yesterday. Twice. Fuck that.",
            "title_similarity": "0.498036",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hxv1t1s",
            "score": 1,
            "text": "That’s not true. As an employer, we are well aware of this, and focus on work-life balance. Some people can’t handle 40 hours per week, so we recommend less. Some people just love to be “productive” so we give them more time. But sometimes you don’t know you don’t have balance, particularly if you are just starting out in your profession, until someone points it out to you.",
            "title_similarity": "0.83523256",
            "sentiment_compound": 0.5225
        },
        {
            "id": "hxv24jd",
            "score": 1,
            "text": "I never understood why so many stay at places that offer crappy work/life balance - then complain like it is the employers fault. \n\nIf you don’t like your circumstances - change it. \n\nI grew up in an area where poverty was “normal” and had abusive parents. I saved money by doing odd jobs and moved to the nearest better town when I was 16. I then worked, saved, and moved across the country when I was 20. I then studied a couple trades in my free time and used that to land an amazing career that is low stress, great pay, and killer benefits. \n\nI was hired as an entry level employee and through my own ambition have gotten a couple promotions and pay raises. I work 4 days a week. I don’t have to worry about retirement, healthcare, etc -  because I work for an amazing company that treats all their thousands of employees great. Funny thing is - we can’t find enough people to hire. The whole place is desperate to hire. \n\nI am not college educated, of abnormal intelligence, or anything special - I just realized that the person most responsible for my success is myself. There were times when I was “that guy on the couch” and times where even the lunch menu specials were out of reach - but I worked through it. Now I have a great life, and it was 100% worth the journey. \n\nI don’t see why people are insistent on waiting for the government, others, or companies just to imbue them with happiness. It doesn’t work that way. Granted for many people they are in a situation where this won’t work - but for most people I see complaining about this stuff - it is totally in their abilities to do something and improve their life. Just most people don’t want to expend the effort.",
            "title_similarity": "0.78281796",
            "sentiment_compound": 0.9828
        },
        {
            "id": "hxv29im",
            "score": 1,
            "text": "The last portion maybe applies to people with decent paying full time jobs where they at least have some control in the matter. Those who are working lower-wage jobs or are barely able to meet their expenses don’t really have the choice to make their work/life balances better. Otherwise, this is pretty agreeable.",
            "title_similarity": "0.7569904",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hxv2ciq",
            "score": 1,
            "text": "Although there are jobs where you’re right, you made a blanket statement, so you’re wrong.  \nAlmost every manager I know values the contributions their employees make, so even if for no other reason, we value the employee making those contributions. If an employee burns out, we lose them (and their contributions) temporarily or permanently. Good management make sure that doesn’t happen.  \nIf you’re working for someone who doesn’t value your well being, you’re working for the wrong person. If you’ve never had a manager who values you, you haven’t set your employment standards high enough.  \n  \nAnd for what it’s worth: most managers *do* care about their team members as human beings, not just as business assets. If this hasn’t been your experience, you’re saying yes to the wrong jobs.",
            "title_similarity": "0.87386644",
            "sentiment_compound": 0.8685
        },
        {
            "id": "hxv2d9s",
            "score": 1,
            "text": "I care. Someone always cares about your mental health, even if your employer doesn't.",
            "title_similarity": "0.6366801",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hxv2g1j",
            "score": 1,
            "text": "Awesome advice for people who can apply it. Last time I burned out (blew my knees out and couldn't fight through the pain anymore) I was evicted and homeless. Now I have three jobs.",
            "title_similarity": "0.5777011",
            "sentiment_compound": 0.4559
        },
        {
            "id": "hxv2gxb",
            "score": 1,
            "text": "Keeping a healthy work/life balance is impossible for some given stagnant slave wages, constant inflation, and the misguided expectation that everybody just needs to pull themselves up by their bootstraps. It’s either do all the extra work while possibly having more than one job, or you can starve and die.",
            "title_similarity": "0.8220458",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hxv2h8f",
            "score": 1,
            "text": "Just wait until the wage drought caused by the profit crunch catches up to you",
            "title_similarity": "0.6227048",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxv2imk",
            "score": 1,
            "text": "I had a good work buddy that I went through training with.  No offense to him and he'd happily admit it, but he consistently gave half-assed effort at the job.  He was obviously wiser than me and knew the best strategy was to work just hard enough to not be fired.  Meanwhile, I worked myself sick to meet and exceed every goal that was put in front of me.  \n\nAfter a couple years guess who the company valued/paid more?  That's right, I discovered my buddy who I outperformed on every metric was being paid more than me despite starting on the same day with the same pay.\n\nMy only explanation is that his consistency was valued more.  Despite not meeting goals, his performance was extremely consistent, he always gave the same half assed but barely passable effort.  Meanwhile, I always naively tried to give 110% which often resulted in far exceeding the goals we were given but due to the natural variance in our job/metrics, sometimes my results only met goals instead of exceeding them despite still working myself sick to beat the goals.  \n\nOf course, when my stats dropped to \"perfectly acceptable\" one month, I got put on an improvement plan since it was seen as a regression to my own standards, despite still beating my buddy who was still in good standing by 25%+ on our metrics and he was never put on a plan because his (poor) stats never went down.  \n\nI found out shortly after that he was also getting paid a couple dollars more an hour than me which was significant compared to what we were making at the time.  Obviously I left for greener pastures and they were stuck with the half-asser (yet awesome person in general).",
            "title_similarity": "0.8159888",
            "sentiment_compound": 0.9875
        },
        {
            "id": "hxv2nv7",
            "score": 1,
            "text": "This.\n\nI work in large corporate events in San Diego, pre-pandemic was a nightmare, back to back programs, work work work. Fortunately I am an hourly employee so I was clocking a lot of overtime, making super good money, but on the verge of burning out, and everyone around me knew it. I was a \"full time\" employee, which meant that i was required to take any and all shifts that i was scheduled for. I asked to be demoted to an \"on call\" employee, which meant I could pick and choose my shifts, and I had to approve my schedule. Demoting myself meant a 30K pay cut, loss of medical benefits and loss of 401K; it was the best decision I ever made. Suddenly, I was in a much better mood because I had returned to a better work/life balance. Less work, more sleep. Less work, more time with my SO. Less work, more vacation time whenever I felt like it.\n\n When I made the request, all of my directors made me feel like i was letting the team down, and I basically had to demand it. One of my predecessors had had a mental breakdown, so everyone knew the role was a pressure cooker. Funny thing is, the director who tried to talk me out of it, had a heart attack in his 40s, from the same stress.\n\nOne thing I've learned; Either you have the job by the balls, or they've got yours in a vise",
            "title_similarity": "0.770576",
            "sentiment_compound": 0.9578
        },
        {
            "id": "hxv2pr1",
            "score": 1,
            "text": "Nobody's building me a statue at my work for my \"outstanding work/work ethic\". I have only two hands and two eyes....only so much I can do, boss *shrugs in pay me more for more work*",
            "title_similarity": "0.72337246",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxv2q7o",
            "score": 1,
            "text": "And a selfish act required in a “selfless” society.",
            "title_similarity": "0.5090207",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hxv2xru",
            "score": 1,
            "text": "You had me at nobody cares. This applies to so much. Hair, how expensive ones car is, cost of a ring, name of college etc.",
            "title_similarity": "0.5056874",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxv39dk",
            "score": 1,
            "text": "Workaholics are their own worst enemies. Often volunteering for work tasks for validation and approval at their own risk of burnout.",
            "title_similarity": "0.8278239",
            "sentiment_compound": -0.743
        },
        {
            "id": "hxv39vz",
            "score": 1,
            "text": "looks at r/studentaffairs with bags under my eyes.",
            "title_similarity": "0.32511306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxv3a5v",
            "score": 1,
            "text": "Yes they do.\n\n\n\nWas overworking myself, burning out: job kept staying my job, performance reviews stayed good. \n\n\n\nTook it upon myself to balance work and life more: performance reviews went to shit though I still did everything asked of me (just nothing \"above and beyond\") - manager instantly turned against me, never said another good thing about my work again, gradually made work a living hell, to the point I ended up resigning a few weeks ago. This was at a company that is often touted as \"the best place to work in the world.\" \n\n\n\nI'm not saying what happened to me is right. Not at all. \n\n\n\nJust a warning, not all management is the same, some say they have your back and want you to find that balance, just so they can say they said it, and still punish you in subtle ways that will make you sorry you ever tried to work less, and double down ad infinitum on their bad faith actions, fully backed by their own management and HR as well. \n\n\n\nIf you're not ready to find yourself in a situation like this, balance your life at your own peril. Again, I wish this were not the truth, but feel the need to give notice, nonetheless, that it is.",
            "title_similarity": "0.8311656",
            "sentiment_compound": -0.5779
        },
        {
            "id": "hxv3b07",
            "score": 1,
            "text": "I have a brother in law who bragged about working 6 straight 12 hour days because his boss asked. \n\nI also know how he doesn’t help his wife with anything at the house or do much to help with their child. Even on his day off, if working has a detrimental effect on you and those around you. That’s nothing to be proud of",
            "title_similarity": "0.6887779",
            "sentiment_compound": 0.5784
        },
        {
            "id": "hxv3bk9",
            "score": 1,
            "text": "I like the people that actually brag about working 60+ hour weeks as if it's a concrete example of what a REAL man is!\n\nHad a buddy that worked crazy hours like that. Made good money of course. But I also remember being at his daughter's first birthday party and he didn't show up until almost 5 hours later because he \"Had to get some important work done\".\n\nSorry, but the day I have a job that prevents me from being at my child's first birthday on a Saturday is the exact day I also quit that job. \n\nToo many people work their asses off and then suddenly they wake up and their 50 with a bunch of money but their body is in too much pain or they are just simply to old to enjoy it like they want to. \n\nLive your life people. Make that money but also make time for yourself.",
            "title_similarity": "0.72411174",
            "sentiment_compound": 0.907
        },
        {
            "id": "hxv3hq5",
            "score": 1,
            "text": "I would disagree here. Leadership can create a culture where burnout is actively discouraged.",
            "title_similarity": "0.6335119",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hxv3jkw",
            "score": 1,
            "text": "It's true. I crammed six extra days worth of working before Christmas to make one orders deadline and I didn't even get a thank you for it I stressed myself unnecessarily but I did come to the realization that with my managers management style, I realized I'm an alcoholic. I'm getting better though",
            "title_similarity": "0.6262878",
            "sentiment_compound": 0.7391
        },
        {
            "id": "hxv3ke2",
            "score": 1,
            "text": "100% true. I used to make it a point to copy management on after hours emails so they knew how long I was working, but quickly found out literally no one cares. I've since made it a point to close my laptop at 4pm and not check it again until the morning. Quality of life has definitely improved. You gotta look out for yourself because your company honestly doesn't give a shit.",
            "title_similarity": "0.71757704",
            "sentiment_compound": 0.9094
        },
        {
            "id": "hxv42iq",
            "score": 1,
            "text": "People love to bitch about how much they choose to work.\n\nJk they aren't bitching but drag flexing",
            "title_similarity": "0.74826604",
            "sentiment_compound": 0.4689
        },
        {
            "id": "hxv42ys",
            "score": 1,
            "text": "💯 and your company will absolutely lay you off if it is in their best interest.",
            "title_similarity": "0.609797",
            "sentiment_compound": 0.802
        },
        {
            "id": "hxv4ckz",
            "score": 1,
            "text": "I spent 10 years in car dealerships and finally reached a breaking point.  The base expectation is 5 12 hour days.  Not including commute or the fact that your day isn’t over until every customer leaves.  If there is an opportunity to sell a car you’re there as a manager.  My longest day was a 17+ hour day and I was back the next morning at 8 am.  No overtime, no time off to make up for it, and honestly not even a “atta boy”.  General manager left the store around 6pm and I was there until almost 2 am.  I finally left and have been without a job now for 4 months.  It’s been like rehab becoming a regular person again.  The good news is the money.  Last year I made over 150k in 10 months of work so I have enough to cruise for a while. It’s great when you’re in your 20s but if you have any hope of having a life, hobbies, or a family don’t even bother",
            "title_similarity": "0.52305746",
            "sentiment_compound": 0.8378
        },
        {
            "id": "hxv4ltr",
            "score": 1,
            "text": "Counter LPT.\n\nSometimes you don't have a say in the matter, and op is just kinda being a dick.",
            "title_similarity": "0.55160224",
            "sentiment_compound": -0.4472
        },
        {
            "id": "hxv4nfq",
            "score": 1,
            "text": "LPT if nobody cares, make better friends and get a better job.",
            "title_similarity": "0.6601633",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hxv4tq2",
            "score": 1,
            "text": "Taking a couple of vacation days this week for just that purpose, gotta reset my brain for a couple days and relax.",
            "title_similarity": "0.5545146",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxv4vzz",
            "score": 1,
            "text": "This is true in the context of a job where you have some say in your workload but many corporations shove more and more onto you until you break with the promise that it will help you grow into your next promotion. I know it’s easy to say that you should leave but a lot of these companies withhold a significant part of your compensation as RSU’s where you lose them if you leave so basically if you quit you were working for free.",
            "title_similarity": "0.8471421",
            "sentiment_compound": 0.9294
        },
        {
            "id": "hxv520x",
            "score": 1,
            "text": "I care.\n\nSlow down mates!",
            "title_similarity": "0.37875164",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hxv52ve",
            "score": 1,
            "text": "Antiwork strikes again lol",
            "title_similarity": "0.5081994",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxv58ki",
            "score": 1,
            "text": "This really makes it sound like it's a workers own fault if they're taken advantage of and overworked to the point of burnout and I don't like that.",
            "title_similarity": "0.73845315",
            "sentiment_compound": -0.0798
        },
        {
            "id": "hxv5aol",
            "score": 1,
            "text": "No, it’s not. Because I cannot stop any employer from punishing me for maintaining said balance.\n\nWhich means that balance needs to be codified into law. Period.",
            "title_similarity": "0.56140053",
            "sentiment_compound": -0.4043
        },
        {
            "id": "hxv5bs1",
            "score": 1,
            "text": "As a nurse I don't think it's even possible to slow down your work, if you don't keep up patients aren't taken care of, you can take care of the patients but have a backlog of stuff to document which also takes a lot of time.\nAnd much more things in between which just take away the time from you working.\nThe  patients to nurse ratio is just overwhelming as well, especially because of the lack of nurses or people being sick/pretending to be sick to get over the exhaustion of being overworked.\nSo worklife balance for some people in Healthcare is not that easy, especially if you have young children.",
            "title_similarity": "0.7462623",
            "sentiment_compound": -0.9173
        },
        {
            "id": "hxv5dyx",
            "score": 1,
            "text": "I wouldn't say that I don't care when the people I supervise do this. However, I would agree that I am very bad at keeping track of it. They would be a much better person to assess when they need a break.",
            "title_similarity": "0.79526496",
            "sentiment_compound": -0.2549
        },
        {
            "id": "hxv5kth",
            "score": 1,
            "text": "It shouldn’t be, and in some jurisdictions it isn’t. Check the law where you are.",
            "title_similarity": "0.41121286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxv5lcz",
            "score": 1,
            "text": "As a sysadmin: Never work for a small business.\nThey will say you are family and guilt you into working sick and guilt you into not asking foe a raise. Its either bs or they aren't a viable business anyways.\n\nGo work for a 10-20 person team in a enterprise.\nYou sick? Whatever, they have 9 more admins.\nCant figure something out? Not to worry, chuck it to a senior. Wanna test new equipment? Sure, here is 10k for a testbed.\nNeed more money? Depends on the business, its definitely negotiable, otherwise you can just move on and dont feel bad bc they ll surely manage.",
            "title_similarity": "0.7464908",
            "sentiment_compound": 0.6929
        },
        {
            "id": "hxv5pti",
            "score": 1,
            "text": "Nobody cares until I ask my boss for some time off, then when I do have burnout and need time off the boss is like \"Why was DeadManInc1981 signed off from the doctors for 6 weeks?“",
            "title_similarity": "0.64382386",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hxv5qfe",
            "score": 1,
            "text": "This is blatantly untrue for some industries (e.g. consulting, where hours worked = billable hours = revenue, which is basically all it takes to get to Partner).",
            "title_similarity": "0.7273545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxv68t3",
            "score": 1,
            "text": "Nobody cares about you.",
            "title_similarity": "0.24076104",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxv69pf",
            "score": 1,
            "text": "Honestly a good manager and a good company will/should. Obviously they won't always know when this is happening  and you can't just rely on them, but smart  companies/management should understand people are at their best when they are balanced and they even sometimes need to be prevented from doing too much.\n\n\nI'm not saying they do, or are at all the norm, but I have definitely worked with/for people that get productivity is not about maximizing utilization of time, and that is not effective long term.",
            "title_similarity": "0.7603012",
            "sentiment_compound": 0.9395
        },
        {
            "id": "hxv6g5x",
            "score": 1,
            "text": "My boss told me this morning that Saturdays are going to be mandatory. I’m getting really tired of being treated like a lackey and not getting paid enough for the work I do. I work 5 days a week and only get to see my child on the weekends. The wrong people are in charge and there is nothing we can do about it.",
            "title_similarity": "0.7432771",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hxv6zr6",
            "score": 1,
            "text": "I hit that burn out phase hard. So hard that I’m questioning what I do for work. Lol. Fuck.",
            "title_similarity": "0.6314578",
            "sentiment_compound": -0.5214
        },
        {
            "id": "hxv6zx8",
            "score": 1,
            "text": "Nobody notices you're on fire until you start to burn",
            "title_similarity": "0.4525699",
            "sentiment_compound": -0.34
        },
        {
            "id": "hxv77oi",
            "score": 1,
            "text": "This is actually not true. If you have a good relationship with your company, and they respect your work. They absolutely do care.",
            "title_similarity": "0.6250843",
            "sentiment_compound": 0.799
        },
        {
            "id": "hxv79kx",
            "score": 1,
            "text": "For me it is nearly every job I left but not when I started or for some years later, sure some were there from the start but the others came later.",
            "title_similarity": "0.5440247",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hxv7pnj",
            "score": 1,
            "text": "I disagree, I as an employer wants and  needs my personal in good physical and mental help. They are the ones making our business successful. If I don't take care of them, they won't take care of me or my business.\nI agree though that everyone should think and reflect over work/life balance,  I can only do my part.",
            "title_similarity": "0.8365201",
            "sentiment_compound": 0.6179
        },
        {
            "id": "hxv84h0",
            "score": 1,
            "text": "This is like telling slaves or their responsibility to get their freedom.\n\nOur entire ethos as a culture is work. You can't even break into my industry unless you're willing to work 20 hour days as deadlines get near.  If you don't you aren't asked back for the next project.  You need seniority to even begin telling them you have boundaries.\n\nThere needs to be systemic change and it needs to cover freelance workers too.\n\nBut to just tell a kid that wants in my industry what you said. To give them that advice... They will just be wondering why they can't find work.",
            "title_similarity": "0.81246173",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hxv8810",
            "score": 1,
            "text": "I’ve just resigned from an 8 year career and a weight has been lifted off my shoulders. Three month notice period but I’m using it to start retraining to become a driving instructor",
            "title_similarity": "0.42335424",
            "sentiment_compound": -0.128
        },
        {
            "id": "hxv9a3t",
            "score": 1,
            "text": "While I wholeheartedly believe this advice to be true, I also feel it’s terrible advice to give out to others because, in my experience, this gives a bad mindset for the lazy workers to continue to be lazy while their counterparts now have to work harder to pickup the slack.",
            "title_similarity": "0.79255354",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hxv9g97",
            "score": 1,
            "text": "Yes and also take PTO because they don’t care about you at the end of the day",
            "title_similarity": "0.65494895",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hxvac1m",
            "score": 1,
            "text": "My coworkers care very much about how much I work, because I'm \"not allowed\" to take mandated holidays unless \"Ive worked hard enough\"",
            "title_similarity": "0.8229141",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hxvaec9",
            "score": 1,
            "text": "yep, I totally ignore when people say this and just give a generic 'oh damn that sucks' or something",
            "title_similarity": "0.40572548",
            "sentiment_compound": -0.6997
        },
        {
            "id": "hxvarwi",
            "score": 1,
            "text": "The manager should care or they're a bad manager. It is their responsibility to equally distribute work and take it off your plate if you're overworking.",
            "title_similarity": "0.79137737",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxvazjj",
            "score": 2,
            "text": "Well, I would disagree. Some do. I had my annual review at work yesterday. I was literally told I work too much, and I'm generally at work only 30 minutes early, and leave 30 minutes late. I should add that I have a great boss.",
            "title_similarity": "0.6759466",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxvbua1",
            "score": 1,
            "text": "I agree with this but this ain't a tip",
            "title_similarity": "0.30509788",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hxvc22t",
            "score": 1,
            "text": "As someone who’s pushed myself to burnout multiple times over the last couple years I really needed to read this thread.",
            "title_similarity": "0.509277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxvced9",
            "score": 1,
            "text": "That's why when they ask me if I want ot or call me in cause someone called off. My answer 99% is always a no.",
            "title_similarity": "0.50138646",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxvcivr",
            "score": 1,
            "text": "\"do x amount of work or you'll be fired\" \n\nOh yeah it's my fault right",
            "title_similarity": "0.590141",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hxvcxsp",
            "score": 1,
            "text": "My company actually cares about this a lot. \n\nVery competitive industry and they legit want us to be happy so we're less likely to get sniped away to a competitor.  Recent example, out of the blue increased paternity leave from 12 to 18 weeks and I don't even know anyone that was complaining about the 12.\n\nAre there actions  100% altruistic? No, clearly us being happy makes them more money. But are their actions 100% good for our well being? Yes, and I wouldn't want to work anywhere else.\n\nSo while this tip is important for many, it's also true that DONE companies actually see prioritizing work/live balance as an important company culture issue.",
            "title_similarity": "0.73855865",
            "sentiment_compound": 0.9762
        },
        {
            "id": "hxvd3q8",
            "score": 2,
            "text": "Dealing with burnout right now. As much as I did for everyone, yeah, no one really gives a fuck unless it’s results. Makes you angry.",
            "title_similarity": "0.7407645",
            "sentiment_compound": -0.7943
        },
        {
            "id": "hxvd7d7",
            "score": 1,
            "text": "Can I have tips on how to maintain this with a factory job?",
            "title_similarity": "0.60800385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxvda6g",
            "score": 1,
            "text": "I'm in construction. Here's what I've learned. Every project is a sprint to the company. My career however is a marathon. We're going to work a pace closer to what helps me maximize my employment for my career than this project. Steady wins the race. So much of the problems with production in my industry are logistics. When management has the logistics handled, they can crack the whip on production. They won't have to though. We just want to do what we have to do, stay busy and have the day go by quickly. It's like my buddy told his boss once who had told him to \"act busy\" when they didn't have anything to do through no fault of their own, \"we're in the Plumbers and Pipefitters [union], not the Screen Actors' Guild. I don't *act* busy. You get me the material and information and I'll be busy all day.\" I'm also reminded of Bill Hicks bit on work: https://www.youtube.com/watch?v=wL4O0GlW3OQ",
            "title_similarity": "0.7859075",
            "sentiment_compound": 0.8252
        },
        {
            "id": "hxvdk3x",
            "score": 1,
            "text": "It blows my mind that people do this. I have the opposite problem: finding that sweet spot where I can do as little work as possible for as short a time as possible without anyone noticing\n\nMy work/life balance is like 30% work, 70% life. Trying to get that up to 75%",
            "title_similarity": "0.71024394",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxvdlnk",
            "score": 1,
            "text": "Don't overwork. If you do then that will be the expectations. I always report my numbers lower than what I actually accomplished on purpose.",
            "title_similarity": "0.6759895",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hxvdody",
            "score": 1,
            "text": "Put in your vacation and pto often and early.",
            "title_similarity": "0.32763168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxvdz4s",
            "score": 1,
            "text": "Having burnt out to the point it's probably affected me for the rest of my life I'd have agreed until this last job.\n\nIn this our team leader is one of the most amazing people of ever worked for in terms of making sure we don't burn out. \n\nNot just over work in hours, but also over stress in what we do.\n\nI'm scared shitless that she'll move on frankly, the rest of the company is ok, but can see some shitty management starting to influence that which we do...",
            "title_similarity": "0.8290448",
            "sentiment_compound": -0.8751
        },
        {
            "id": "hxve97m",
            "score": 1,
            "text": "This isn't true. I'm always make sure to monitor my staff's stress and workload in order to avoid burnout. I routinely talk to them about their work load and make sure they aren't working too late or too much, and I encourage them to ask for help if their workload isn't reasonable.  I'm far from the only one that does this.  If it's worth having employees, it's worth having employees that aren't burnt out.",
            "title_similarity": "0.807484",
            "sentiment_compound": 0.7243
        },
        {
            "id": "hxveare",
            "score": 1,
            "text": "Can confirm. As a wee lad young apprentice, I took pride in my work anytime anywhere attitude. My company ate it up. I absolutely loved the paychecks. But it was confirmation to me that they would use me up and spit me out if they had to. I always remembered that growing old through the trade. Now I demand my team have a life work balance. \n\n\"You don't have to go home you just can't stay here\" lol. \n\nLife is too fing short to spend it working it away for a company.",
            "title_similarity": "0.84524703",
            "sentiment_compound": -0.0262
        },
        {
            "id": "hxvebkd",
            "score": 1,
            "text": "Tony Stark : \"No amount of money ever bought a second of time.\"",
            "title_similarity": "0.38496912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxvebyk",
            "score": 1,
            "text": "Change the nomenclature, having a good life/work balance is key, not work/life.",
            "title_similarity": "0.57133895",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxvejgn",
            "score": 1,
            "text": "I have made this mistake in the past. Kept getting more work till some of it started to suffer then when they broke the camels back sought to hire but guess who is training the new hire... worry about your bottom line not theirs",
            "title_similarity": "0.7335487",
            "sentiment_compound": -0.8349
        },
        {
            "id": "hxvf5v4",
            "score": 1,
            "text": "My mom does. Dad had 3 jobs to support us all growing up. If my grades slip below a B- while also working full time, or if I work less than 40hrs that week, I’m the lazy pos.",
            "title_similarity": "0.6009583",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hxvfd5t",
            "score": 1,
            "text": "We’ve had mass people quit and they’re just throwing more work at us. I’m ready to give up. At this point, if it doesn’t get done I don’t fucking care. I can’t do it anymore. Project on top of project. I’m exhausted.",
            "title_similarity": "0.7392627",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hxvge44",
            "score": 1,
            "text": "And that’s wisdom.",
            "title_similarity": "0.058738116",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxvhmb5",
            "score": 1,
            "text": "It’s a transactional relationship—you wouldn’t tolerate not getting what you “pay for” in any other area of life—jobs are exactly the same. Every time I’ve learned the situation is truly rigged against me in some clear way I addressed it, waited a short time for it to get fixed then usually walked (after securing another job). Then, depending on if I give any shits at all I MIGHT tell them that’s why I’m leaving. Usually I don’t. I already told them once.",
            "title_similarity": "0.828985",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxvhmdq",
            "score": 1,
            "text": "I disagree. Some management can make poor decisions resulting in a bad work/life balance. Companies will exploit employees and egotistical co-workers can make working life a living hell out of any one person’s control.",
            "title_similarity": "0.7685646",
            "sentiment_compound": -0.9442
        },
        {
            "id": "hxvhv3y",
            "score": 1,
            "text": "I used to work as a supervisor and manager and it was very sad how often I had to tell people that a task I assigned them could wait until tomorrow, and how much I had to insist they go home at the end of their shift and not do unpaid overtime.\n\nWhat was saddest is how many of them were complete shocked at me not expecting them to burn themselves out like a match.\n\nOne of many reasons I'm no longer in management.",
            "title_similarity": "0.80622077",
            "sentiment_compound": -0.8553
        },
        {
            "id": "hxvhwt6",
            "score": 1,
            "text": "As an educator who cares deeply for his students, I find this tip hard. There are times I go the extra mile for my students and push through burnout despite being burned out for a while. Finding a balance is hard in my profession when I am constantly thinking about my students and what I can do to be a better educator and person for them. My job isn’t always about me and that makes it hard to find a balance.",
            "title_similarity": "0.80584073",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxvi8px",
            "score": 1,
            "text": "like if everybody has the chance to do so. arrogant post.",
            "title_similarity": "0.42166212",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxvjajm",
            "score": 1,
            "text": "The issue however is that it is damn near impossible to keep a good work/life balance right now.",
            "title_similarity": "0.5312216",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hxvjem2",
            "score": 1,
            "text": "Saying “No” or “I don’t feel comfortable doing that” has been the greatest skill I’ve learned. Of course, having a decent manager who will accept that and let you work on this you are comfortable with is the ideal setup.",
            "title_similarity": "0.75530803",
            "sentiment_compound": 0.9501
        },
        {
            "id": "hxvjhn4",
            "score": 1,
            "text": "A good boss should care.",
            "title_similarity": "0.47014338",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hxvjiam",
            "score": 1,
            "text": "Honestly just never overwork. Work less than you feel is necessary to keep you sane. (If you can) and then don’t work any more than that. Don’t do weekends/evenings/holidays if you don’t HAVE to.",
            "title_similarity": "0.60817754",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxvjoyf",
            "score": 1,
            "text": "Yep. If there's one thing I learned in my first 5+ years of working it is this. You can work yourself to death, nobody will stop you, and you'll probably get praise for it. But it's not sustainable in the long run and you can succeed without doing that.",
            "title_similarity": "0.6666786",
            "sentiment_compound": 0.631
        },
        {
            "id": "hxvjt6x",
            "score": 1,
            "text": "I just burned out at my current place of work. Put myself out there on LinkedIn,  got a 40% raise in less than a month's time.\n\nDon't allow yourself to work outside of reasonable hours unless your employer is showering you with OT or options or promotions. \n\nDelayed gratification isn't a concept that employers follow through on.",
            "title_similarity": "0.651671",
            "sentiment_compound": 0.0088
        },
        {
            "id": "hxvk6ev",
            "score": 3,
            "text": "I mean, sure? But should we not scold companies that expect too much of their employees also? That's the trend with a lot of corporations is expecting as much as possible out of the least amount of employees.",
            "title_similarity": "0.7753561",
            "sentiment_compound": 0.599
        },
        {
            "id": "hxvkhyc",
            "score": 1,
            "text": "It’s true about just about everything. Nobody cares what you do and how you do it and how you feel. Just get your shit done and be upbeat and people will think you’re top notch. Everyone is sitting around thinking too much about their own shit to care at all about you.",
            "title_similarity": "0.751537",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hxvktsg",
            "score": 1,
            "text": "X: Wanna go to kitchen have a coffee break ? \n\nY: Sorry I'm too busy\n\nFew months later\n\nY: I Quit, I'm burn out",
            "title_similarity": "0.5871851",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxvl82i",
            "score": 7,
            "text": "I’m a mid-level manager at my company, the type of role that everyone here generally hates. \n\nI tell my team to sign off early every Friday, and tell them not to work when they are sick(but don’t submit a sick day). When someone goes above and beyond on a project I tell them to take a long weekend and don’t submit the vacation. \n\nI tell people to set their hours and STOP working when they hit their time. Work with me and I can communicate to stakeholders if deadlines get affected. \n\nYou know what the majority of my team does? They work too much, pour too much of their time into work, and then they come to me 3 months too late saying they are burnt out. \n\nI tell them exactly what you are saying, keeping a work life balance is just as much their responsibility as it is mine. I will have their back 100% of the time, and I myself hardly ever work more than 40 hours a week. \n\nLike, your boss is telling you to go home early, and they still. Won’t. Do it. \n\nI don’t get it, but some people have that mentality. The only thing that you’ll get for working 50+ hour weeks is an unrealistic expectation from your stakeholders that that’s your ‘normal’ effort. Three months from now when you work a normal amount of time they will think you aren’t trying, you’ll be held to the standard you set.",
            "title_similarity": "0.7819726",
            "sentiment_compound": -0.5598
        },
        {
            "id": "hxvl90j",
            "score": 1,
            "text": "I just left a really toxic work environment last September and it's amazing looking back seeing how burned out I was. It's harder to see burnout when you're in it. \n\nFor me it was like I was drowning. I was trying and pushing myself so hard just trying to stay afloat. Every once and awhile I would get a good breath (like when I had a slow or good work week or a vacation where I actually decompressed). But then it was right back to the struggle, never fully recovering and thinking it's just normal because you've been doing it for so long. \n\nNow I'm out and have been saved. I can breathe and reflect and now know how bad that situation really was. \n\nIt's a hard life lesson to learn. But in a way I am glad I experienced and now I know what to never go back to.",
            "title_similarity": "0.6828117",
            "sentiment_compound": 0.6972
        },
        {
            "id": "hxvldfu",
            "score": 1,
            "text": "And working for big corporate companies, you might have to play corporate games. Find a reason to get a doctors note limiting you to 8 hours/day, 40 hours/week.  Note sure if this will work with every company in every state, but it worked for me after they tried to get me to be their workhorse. Not gonna do 10 hrs a day for 6 days, hire more people.",
            "title_similarity": "0.6779918",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hxvlizf",
            "score": 1,
            "text": "Not my job. I go 100% and when I burn out they give me time off. I explained to them that this is a 12 hour job and I do my best when I work in spurts. I can get a lot done in 12 hours if I'm able to get a lot done in 12 hours. So now we worked on a schedule where I have full control of my hours while I'm still averaging peak numbers and quality control. I believe the idea is effective communication. I was never at my job for the money. I was there to learn how to communicate with upper management and after a year and a half. I am able to speak their  lingo. I hate upper management in terms its a boring ass job and appreciate the people who have to take that dull role. It's important to find a good way of communication as that will grow into a more comfortable position at your job.",
            "title_similarity": "0.6488775",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hxvlnn5",
            "score": 1,
            "text": "& after 5 weeks of no lunches and the normal 11+ hour day I quit and haven't looked back. But boy are they mad I left. Gee, I wonder why!?",
            "title_similarity": "0.49166372",
            "sentiment_compound": -0.7345
        },
        {
            "id": "hxvluxk",
            "score": 1,
            "text": "I recently stopped accepting overtime at all, for any reason. The uptick in my mental health is worth the loss of take-home money. At the moment, anyway.",
            "title_similarity": "0.6405283",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxvm1sc",
            "score": 1,
            "text": "You know how after 10 years on the job you don't give a fuck and are jaded and cut corners and look our for your own ass? LPT: Your managers ARE THE SAME!",
            "title_similarity": "0.68314534",
            "sentiment_compound": -0.685
        },
        {
            "id": "hxvmqvo",
            "score": 1,
            "text": "It's hard not to when you have to work 2 jobs 60 hours a week 6 days a week just to make ends meet.",
            "title_similarity": "0.66577744",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxvmxgo",
            "score": 1,
            "text": "I care.  \nWhen I see a coworker working overtime I remind them \"hey your shift is over, go home and enjoy the day\" or something similar.  \nI also tell people to go to the doctor when they complain about health issues and remind them that they will be replaced in 2 weeks if they heel over dead today.  Made 2 listen so far and they thanked me.",
            "title_similarity": "0.70247287",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxvn0so",
            "score": 1,
            "text": "It’s nice to have a choice. Not everyone has that privilege.",
            "title_similarity": "0.38594586",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hxvn942",
            "score": 1,
            "text": "r/antiwork in shambles lol",
            "title_similarity": "0.31913996",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxvndpx",
            "score": 1,
            "text": "Lpt: You have to overwork yourself if you don’t make a living wage.\n\nSo this lpt lot doesn’t quite work unless you are financially stable. 🤷",
            "title_similarity": "0.7239424",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxvo7rz",
            "score": 1,
            "text": "Used to work 6-7 days a week to catch up at work. Got paid hourly plus time and a half. They came to me and asked if I wanted to go salary. I said sure. Never worked the weekends again. Life became soooo much better.",
            "title_similarity": "0.6976938",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxvp7br",
            "score": 1,
            "text": "Oh, but they DO care when you make those adjustments to reduce work hours and stress. They do",
            "title_similarity": "0.6566379",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hxvpf39",
            "score": 1,
            "text": "Lol I overworked myself and will have my house paid off in two years. If someone is \"overworking until hitting a burnout\" then they're dumb. I'll have no debt (except as a government pay pig) before I'm 35.\n\nBut by all means it would probably be better to sloth through life so I \"won't be burned out\" when I can finally retire at 65 (and still have debt).\n\nThe amount of karma-seeking posts like these is absurd for a \"Life Pro Tips\" sub. This is about the thousandth post this year.",
            "title_similarity": "0.6973504",
            "sentiment_compound": 0.6066
        },
        {
            "id": "hxvprth",
            "score": 1,
            "text": "This must be different where you are; but here there are all sorts of opinions on it, but someone overworking themselves is not generally cool at all.\n\nIt's bad for the person; they likely do more work than they should, and the extra is not rruly recognized, while other people who do what they should do, even if to a good standrad, can be seen to be doing too little; when in fact they're doing the right thing.\n\nSo it's bad for their colleagues, and bad for themselves, and hard to escape from, as they become known to always do the extra work; they don't mind', and so the business relies on it; also screwing up their data on timescales/costs of projects etc.",
            "title_similarity": "0.799741",
            "sentiment_compound": -0.9447
        },
        {
            "id": "hxvpyay",
            "score": 1,
            "text": "They might not care about me, but when I quit without warning / have to take a medical leave, I bet you all the sudden they care about the workload increase.\n\nHelping manage workers burnout is part of management. Not offering assistance, ignoring the problem, and delegating with no support... Guess what kind of management styles those are.\n\nYeah. The ones that good employees won't put up with for long.",
            "title_similarity": "0.8280451",
            "sentiment_compound": 0.9272
        },
        {
            "id": "hxvq5ue",
            "score": 1,
            "text": "I must have some pretty decent luck. I work in accounting and even I have had bosses who care about my mental well being and stress levels at every firm.",
            "title_similarity": "0.61803555",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hxvq5wd",
            "score": 1,
            "text": "I've lived both sides of this at the same company. Had a break down and took 3 months out, I was put into a better role on return and dont feel that I've lost any respect from colleagues since I've slowed down. People get it. Stress can kill. Look after each other!",
            "title_similarity": "0.65540487",
            "sentiment_compound": -0.6239
        },
        {
            "id": "hxvrd1s",
            "score": 1,
            "text": "Not true. I care. I’m here for y’all if you need it.",
            "title_similarity": "0.39190263",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hxvrtgg",
            "score": 1,
            "text": "Not true my SO cares",
            "title_similarity": "0.24689633",
            "sentiment_compound": 0.4007
        },
        {
            "id": "hxvrya4",
            "score": 1,
            "text": "more than three days work a week is too much. 4 days a week would be over half your life thrown away for profit.",
            "title_similarity": "0.54238266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxvs2ib",
            "score": 1,
            "text": "Yet it’s your bosses responsibility to make sure that doesn’t happen and you’re ground to a nub.",
            "title_similarity": "0.6953728",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxvsbn4",
            "score": 1,
            "text": "Given that burnout is extremely expensive for your employer, they should care.",
            "title_similarity": "0.715511",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxvscpb",
            "score": 1,
            "text": "At my work guys ask me why I don't take overtime shifts or  anything. I want to be happy and this job isn't my whole life. They give me weird looks. Sorry I don't want to be a miserable bastard that spends every second of my life working.",
            "title_similarity": "0.80887973",
            "sentiment_compound": -0.6023
        },
        {
            "id": "hxvsdlu",
            "score": 1,
            "text": "I disagree: your boss cares: I'd you don't overwork yourself, you're not working hard enough",
            "title_similarity": "0.7607861",
            "sentiment_compound": 0.1769
        },
        {
            "id": "hxvshdk",
            "score": 2,
            "text": "Unless you have an employer that gives a shit...\n\nA good employer knows that crunch is bad for them and employees, and plays the long game, making an effort to reduce burnout and therefore turnover. This reduces cost and improves production/productivity.",
            "title_similarity": "0.8067773",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxvtely",
            "score": 1,
            "text": "I'm in business school at the moment and this is a very important lesson that is getting taught and I hope everyone keeps a note of it.",
            "title_similarity": "0.61495674",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hxvtng3",
            "score": 1,
            "text": "Holland does. People at my Dutch branch go on \"burnout leave\" for months.",
            "title_similarity": "0.4577433",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxvtsc8",
            "score": 1,
            "text": "I care. What is this reactionary garbage?  Has it always been this way and I just didn't notice?",
            "title_similarity": "0.49813744",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hxvuith",
            "score": 1,
            "text": "*Everyone in third world countries*",
            "title_similarity": "0.2538595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxvvb4n",
            "score": 1,
            "text": "Literally dealing with this right now as a therapist. I gave my company a very open schedule with the intention of giving my clients the most amount of flexibility I could. Instead the agency I work for saw that as an opportunity to give me an unethical amount of clients. Rather than get frustrated I recently figured out it's on me to handle my work life balance.",
            "title_similarity": "0.70457685",
            "sentiment_compound": 0.0422
        },
        {
            "id": "hxvverg",
            "score": 4,
            "text": "This is a terrible, terribly bad LPT. Your hyper individualistic and narrow-minded view *leads to problems*. Everyones health is a team effort, nobody can live in society *alone*, that's just not how it works. Take care of yourself and others and surround yourself with those who do the same. \n\nYou have a lot of agency when it comes to getting out of toxic relationships (with an employer or otherwise), but only if you have the capacity, insight and will to do so. That's a whole lot to take on entirely solo.\n\nStop going against human nature, stop hyper-individualism.",
            "title_similarity": "0.8237283",
            "sentiment_compound": -0.8972
        },
        {
            "id": "hxvvgb3",
            "score": 1,
            "text": "We need a post doc/PhD student thread of this. Such a weird job setting where you need to turn on like 80 hours a week out of necessity and ALSO KNOW WHEN TO TURN OFF!",
            "title_similarity": "0.66490996",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hxvvwoi",
            "score": 1,
            "text": "I get the spirit of this LPT; but I think it is grossly naive.  \n\nIt's very easy to sit in a privileged position of professional/financial freedom and decree if people burnout its their own fault.  \n\nSome people don't get a choice. Labor rates are so bad that if they don't overwork, they can't support themselves/their family - and if they try to push back on the work side of work life balance, they will simply be replaced like a widget.  \n\nSo they either overwork themselves and risk burnout; or can't afford to live.",
            "title_similarity": "0.82964826",
            "sentiment_compound": -0.1985
        },
        {
            "id": "hxvw0xk",
            "score": 1,
            "text": "I am baffled seeing my peers work late and even on weekends despite no overtime in most companies (India). Situation is much worse in startups where young enthusiastic bachelors work so hard with a mentality that work is God.\n\nI mean, if you really need to work THAT hard to please your manager, it's not worth working for them. And if you don't work that hard and still aren't fired, then you're chasing a (potential) promotion by working 2x more in the present in hopes that your manager will keep note of your (mostly unnoticed) hard work. \n\nIn both cases, switching to a new job will probably fetch you much better salary for the price of applying for jobs and sitting through interviews. That's much better than working your ass off with no clear goal post.\n\nCompany may lay you off at the first chance in case of a crisis, yet you ignore your personal crises & life for its sake.\n\nTo me it seems like an overcompensation of some internal struggle. Low self esteem? People pleasing nature? Narcissistic parents? Fear of rejection and abandonment? God knows. But I ain't gonna work a minute extra than I need to, and if I do, I'll sure as hell let it be known that I took EXTRA time from MY LIFE for the company.",
            "title_similarity": "0.8158771",
            "sentiment_compound": -0.8344
        },
        {
            "id": "hxvwl7t",
            "score": 1,
            "text": "Same for relationships.  \n^(unfortunately)",
            "title_similarity": "0.37601185",
            "sentiment_compound": -0.34
        },
        {
            "id": "hxvx0uv",
            "score": 1,
            "text": "Laughs in working as a chef and not having a life",
            "title_similarity": "0.58146906",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxvxqmn",
            "score": 1,
            "text": "Lot of tech managers that need to get a clue too.  Just bc your Skype,teams,slack is logged in all the time don't mean anyone else's has to be",
            "title_similarity": "0.7510686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxvy908",
            "score": 2,
            "text": "Grew up with in a kitchen grindset (they called it a Cavlinistic work ethic back then).  What a hoax. Have worked 35+years between kitchens and the military & cannot agree with this statement more.  Have opened over a dozen restaurant/bars & field tested more than one weapon system.  Never benefited from any of them after I left.  No matter how successful the project, once you leave your were just part of the start up cost.\n\nHave burnt myself out numerous times with the hope that this time would be different.  It never is despite what you may think about your new employers you are just a number to them in the end.\n\nMore young people need to hear this message & more older (in power) folks need to accept this & respect it.\n\nThank you.",
            "title_similarity": "0.6081637",
            "sentiment_compound": 0.8501
        },
        {
            "id": "hxvyfos",
            "score": 4,
            "text": "Currently in a place in life where I earn about 20% more money than I need as long as I don’t fall for consumerism, or have kids. It’s so freeing and I hope others in a similar situation don’t fall for the need more money trap that has been set. Be happy with your car, your home, and the food you can afford as many are working more jobs than they can handle because at some point they either got caught willingly or were forced into a negative economic situation",
            "title_similarity": "0.69690096",
            "sentiment_compound": 0.321
        },
        {
            "id": "hxvzjlz",
            "score": 1,
            "text": "To start our school year, each of my schools three classes had someone different designated to do a monthly photo album and newsletter. \n\nI’ve done all of them since November.  Yaaaaaaay.",
            "title_similarity": "0.3006528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxw18mf",
            "score": 1,
            "text": "And almost nobody will support you on that quest. But you gotta do it anyway.",
            "title_similarity": "0.56531644",
            "sentiment_compound": 0.1823
        },
        {
            "id": "hxw1cmm",
            "score": 1,
            "text": "I feel the first two words should be swapped to “*Your Employer doesn’t care*”.\n\nIt should go without saying that your family surely does.\n\nAlways remember, “Work to live, don’t live to work”.",
            "title_similarity": "0.796983",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxw1htk",
            "score": 1,
            "text": "Why is this shitty life pro tip posted every other day?  Karma farming?",
            "title_similarity": "0.64251804",
            "sentiment_compound": -0.6818
        },
        {
            "id": "hxw1yb2",
            "score": 1,
            "text": "I always tell people to take a mental health day here and there if you need it. I’d rather them not be there for a day then they come in and feel like anxiety level and depression level is unbearable.",
            "title_similarity": "0.7045418",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hxw315t",
            "score": 1,
            "text": "It's amazing how many things that are urgent can wait.",
            "title_similarity": "0.34065875",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hxw456d",
            "score": 1,
            "text": "I have a coworker like this, he has child support payments but he also wants to still buy rolex watches and other nice things, his solution is working 80 hours a week. He always looks miserable, he tells me he sleeps 2-4 hours a night and he’s always angry. I really do feel bad for him.",
            "title_similarity": "0.6853239",
            "sentiment_compound": -0.7681
        },
        {
            "id": "hxw4t7r",
            "score": 1,
            "text": "The company I worked for pit me on the nightshift alone until they saw a need as I could not handle it all alone.Then they put another one on the shift. It was still more they added a third. We started doing massive overtime to handle the load. I did 829 overtime hrs in 2018. There were two of us doing the shift averaging about 39 hr overtime a week. Then they brought on new hires on to the shift with a new manager. They dumped me as I cost too much. The new ones were $30,000 less than my pay. No loyalty from the company after busting our but to keep the overnight working smooth",
            "title_similarity": "0.72641134",
            "sentiment_compound": -0.5176
        },
        {
            "id": "hxw59kw",
            "score": 1,
            "text": "Genuine question: How? \n\nI recently got a job after months of applying and I hate it immensely. I’ve gone from not working outside of home to working every day outside of home and I’m exhausted. Even when I leave, I don’t feel relieved or energized. Just angry. If I weren’t on so many OTC herbs/drugs I wouldn’t have it in me to stay on at this job but it’s the only workplace that gave me an offer and I need the cash flow.",
            "title_similarity": "0.77896285",
            "sentiment_compound": -0.34
        },
        {
            "id": "hxw5gws",
            "score": 1,
            "text": "Getting pissed at other people is natural reaction after you are exhausted and need time off of other people.",
            "title_similarity": "0.6642377",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hxw6vux",
            "score": 1,
            "text": "My wife doesn't really care either. She used to get irritated that I would take comp time instead of OT. She seems to think that we need that OT. I think that we don't.",
            "title_similarity": "0.6544578",
            "sentiment_compound": -0.7045
        },
        {
            "id": "hxw75ep",
            "score": 1,
            "text": "I live by this. My coworkers may think I’m a selfish ass sometimes bc I refuse to work on my days off",
            "title_similarity": "0.7029532",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hxw7bmk",
            "score": 1,
            "text": "Brehhh I cannot for the life of me explain this concept to my coworker. He gets so mad over ppl not keeping up with him but hes literally doing 3 to 5x the standard. Like yooo chill my guy u fuckin up the vibe.",
            "title_similarity": "0.58147144",
            "sentiment_compound": 0.1759
        },
        {
            "id": "hxw7f1h",
            "score": 1,
            "text": "Also never be afraid to quit the job too. Especially when you’re working 2 jobs and one of them is being more demanding of you. I was working 2 jobs for the back end of 2021. 70+ hour weeks between 2 jobs. The pay, management, work culture and even the customers were not worth the mental and physical stress on myself for the extra couple of hundred dollars a week. When I handed in my 2 weeks, they were desperately trying to hold onto me because I was their “fix it” or “go to” man who would plug the holes. Safe to say, that when I left, according to my other coworkers, had impacted them dramatically as they had not thought ahead and prepped for the inevitable case of a senior staff member leaving them after being treated poorly for more then half the time at the job.\n\nI am so glad I’m out.",
            "title_similarity": "0.80573666",
            "sentiment_compound": -0.2246
        },
        {
            "id": "hxw8kn4",
            "score": 1,
            "text": "My wife and I a baby with cerebral palsy a year and 2 months ago and I’ve needed much more personal time recently and I feel judgmental eyes on me. I’m not the type to share my personal stuff with others but I get tired of feeling people are judging me. I work with a lot of “tough guy” military type guys and I feel they think I’m shunning my work, but honestly I’m just struggling mentally and feel very useful at home these days. I wish I could stay home,  and also not worry about how others perceive how I live my life. It’s hard Ignoring the way people judge you taking off days and shit",
            "title_similarity": "0.74306893",
            "sentiment_compound": -0.0776
        },
        {
            "id": "hxw8uhr",
            "score": 1,
            "text": "Work smarter, not harder. \n\nI’ve learnt the hard way unfortunately.",
            "title_similarity": "0.5878714",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hxw8wdw",
            "score": 1,
            "text": "Yep. \n\nLast job - worked overtime +++++++ - so burnt out that didn’t try and claim it (or submit a time sheet) til the end of my contract. When went to do so, was told that it was too difficult to work iut so I just got paid my minimum hours. \n\nWorkplace and boss was such a toxic environment and I was so crispy that I was just happy to heave.\n\nLesson learnt.\n\nNo one cares if you work hard. \n\nWork smart and take care of yourself.",
            "title_similarity": "0.850977",
            "sentiment_compound": 0.6393
        },
        {
            "id": "hxw92sg",
            "score": 1,
            "text": "I once worked a job that ran seven days a week for about 6 months. We routinely hit 40hrs. by Wednesday. Never. Again.  \n  \nBut we all love movies, don't we?",
            "title_similarity": "0.44042343",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hxw95vr",
            "score": 1,
            "text": "Sorry can someone explain what part of this is meant to be the tip",
            "title_similarity": "0.30626184",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxw9e4y",
            "score": 1,
            "text": "We teach kids that hard work can lead to success. We never seem to teach them that some people might use their work ethic against them.\n\n&#x200B;\n\nEdit: corrected typo",
            "title_similarity": "0.71113145",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxw9gb3",
            "score": 1,
            "text": "People do this at my company all the fucking time. Then they think they are entitled to random days off in the middle of a work week because they are exhausted from working voluntary overtime. I've had to make way too many phone calls to idiots not coming to work because they've worked however many days straight. If you can't handle it, don't do it.",
            "title_similarity": "0.80361104",
            "sentiment_compound": 0.128
        },
        {
            "id": "hxw9rth",
            "score": 1,
            "text": "Everyone at my job makes comments about my schedule , I tell them it’s\nNot my fault you don’t manage your shir correctly",
            "title_similarity": "0.7922847",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hxw9tmm",
            "score": 1,
            "text": "You could have just stopped after \"Nobody cares\"",
            "title_similarity": "0.37209234",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxwab5l",
            "score": 1,
            "text": "As someone that works in marketing, thank you for this. I needed the reminder.",
            "title_similarity": "0.5366621",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxwabo4",
            "score": 1,
            "text": "For real, i am surprised at how many people close to me dont understand this. Yes, you love your job, but thats not all. You will barely have any hobbies or an identity outside work.",
            "title_similarity": "0.77928436",
            "sentiment_compound": 0.6264
        },
        {
            "id": "hxwans1",
            "score": 1,
            "text": "I drastically changed my mentality with my new mission. When someone requests it, my first question is \"Is it my responsibility to work on it ?\" Followed by \"can i fix it fast or at least explain once why I can't ?\"\n\nFirst makes me avoid work that should be done by the right persons but sometimes they slack off and hope everything will be okay because the team i'm in will take 2 more hours in their day to fix it. Not accepting work that is out of my scope helps me save time for the team.\n\nThat said, not accepting work should always be accompanied by a clear explanation of why not. Even more to a client. \"Can't do it because i searched for your problem using my every means and saw no issues. If it's not there i don't have the means to correct it or even understand it  please get someone which can bring this visibility\"",
            "title_similarity": "0.7933496",
            "sentiment_compound": 0.8445
        },
        {
            "id": "hxwapvh",
            "score": 1,
            "text": "Nah, imo it's an employers responsibility to not overwork their employees.\n\nThey set the pace, the pay, the responsibilies, the requirements, and the standards.\n\nIt's they're job that those are reasonable things and to ensure their employees don't suffer from burnout.\n\nIf it was up to the shit heel employees employees would come wrapped in plastic and be disposable. Preventing that is up to employees to leave those places and ensuring your company doesn't have the issue is the employers.\n\nIf you're an employee stop letting the pass the buck on their end of the relationship.",
            "title_similarity": "0.82954174",
            "sentiment_compound": 0.8047
        },
        {
            "id": "hxwcun7",
            "score": 1,
            "text": "Yes. I just got hired on from a temp to perm. Folks been there 15-40 years. Some told me to work mths and jump ship for better money. But, I'm mid 30s making 55k a year in a field I'm still in school for. I have, for the 1st time ever, a non physically demanding no stress role. Like, I have 3 breaks 25 days of pto and NO STRESS. It would have to be an internal promotion or a new job that could demonstrate they provide the same work/life balance for me to leave any time soon. I overworked myself for 16yrs trying to make it, screw that.",
            "title_similarity": "0.53240776",
            "sentiment_compound": 0.8315
        },
        {
            "id": "hxwd302",
            "score": 1,
            "text": "Saving post.\n\nThank you OP",
            "title_similarity": "0.27516136",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxwd4ew",
            "score": 1,
            "text": "Everyone loves hard work being done though.",
            "title_similarity": "0.552841",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxwdaso",
            "score": 1,
            "text": "That's incorrect in my life. I have 5 friends that are adamant about me over working myself... When truth be told i don't feel like 65 hours a week is alot.. they are just way lazier than me. \n\nThey smoke weed and still live at home so....",
            "title_similarity": "0.6192765",
            "sentiment_compound": -0.0026
        },
        {
            "id": "hxwey33",
            "score": 1,
            "text": "This lesson took me a decade to learn",
            "title_similarity": "0.37628618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwf1tz",
            "score": 1,
            "text": "Tell me you've never worked corporate without telling me",
            "title_similarity": "0.45747983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwfi5b",
            "score": 1,
            "text": "Lol so paying rent while you \"burnout\" overworking it is living in the United States clearly you don't understand the struggle 2200$ salary month with 1500$ rent",
            "title_similarity": "0.60853714",
            "sentiment_compound": 0.8505
        },
        {
            "id": "hxwh85q",
            "score": 1,
            "text": ">Keeping a good work/life balance is your own responsibility.\n\nSelf-employed, run my own company. Learned a number of years back to never take my laptop to my bedroom. Keep work relegated to my home office. That way I can get up, turn off the light and walk out of the room.\n\nOtherwise, I was burning the candle at both ends, running 18-24hrs straight from day to day, before crashing for almost 2 days straight with exhaustion. \n\nI used to have friends who told me how 'lucky' I was to have my own business, working for myself. Until one of them stayed over at my place for a few days and they told me they realized that I spent more time doing work related tasks than they ever did at their 9-5 job. \n\nI replied, \"you clock out, go home. Going home for me is leaving the office and not going back in after a certain time each day, but that's not always possible.\"\n\nIt's been a constant struggle to not let myself work for 16hrs straight. It may not be 'grunt' work, labor intensive etc. But it's mental work, eye strain, headaches, exhaustion and body aches from being at the computer for longer than most people spend at an office.\n\n**You HAVE to take care of you, no one else will.**",
            "title_similarity": "0.7166779",
            "sentiment_compound": -0.1108
        },
        {
            "id": "hxwi43c",
            "score": 1,
            "text": "LPT: Nobody cares.\n\nThere, fixed it for you.",
            "title_similarity": "0.49998653",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxwi5ss",
            "score": 1,
            "text": "OK mr. bootstraps.",
            "title_similarity": "0.16761817",
            "sentiment_compound": 0.4466
        },
        {
            "id": "hxwiah4",
            "score": 1,
            "text": "What do I do when I'm constantly thinking about work because everything feels stressful. I'm not actively working more than 40 hours but just always thinking about work and what I have to do next.",
            "title_similarity": "0.7035641",
            "sentiment_compound": -0.3881
        },
        {
            "id": "hxwilrf",
            "score": 1,
            "text": "You must be rich to have that choice.   Not some of us.\n\n\nGood For You.",
            "title_similarity": "0.5094581",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hxwj7uh",
            "score": 1,
            "text": "Hate your job? We help people find high-paying careers they love without needing college debt. [onedegreecareers.com](https://onedegreecareers.com)",
            "title_similarity": "0.7064644",
            "sentiment_compound": 0.6497
        },
        {
            "id": "hxwjd3c",
            "score": 1,
            "text": "I burned out HARD recently. I had a complete mental breakdown over stress from work. Ended uo leaving my job over it. Got 2 new jobs that each lasted 2 days and realized what I really needed was a break. So I took 2 months off and today is my first day back at work at another new job. Luckily I have the means to take that time off otherwised i'd have been screwed. So far so good. Just needed to do nothing for a while. Therapy and meds helped a lot too. Don't let yourself burn out like I did.",
            "title_similarity": "0.7021877",
            "sentiment_compound": 0.4094
        },
        {
            "id": "hxwjii9",
            "score": 1,
            "text": "Not including slave,forced,migrant or illegal labor in this ,just my friends. The ones who are so busy workin crazy hrs making bank an loving it and bragging about it, until they dont like it anymore and get whiney and cut back or get a different job. And then start the whole process over and over again",
            "title_similarity": "0.84329766",
            "sentiment_compound": -0.5823
        },
        {
            "id": "hxwkfu3",
            "score": 1,
            "text": "I wish someone had given me this advice. But also that it's not wrong to actually take the time you need. I only worked in telecom for two years, but I overworked myself so bad that I now have seizures if I get too stressed. But the government doesn't think that's a disability, but just trying to maintain employment sends me into multiple seizures a day. It's fucking absurd.",
            "title_similarity": "0.7379091",
            "sentiment_compound": -0.7316
        },
        {
            "id": "hxwkoe5",
            "score": 1,
            "text": "ah yes, the weekly work/life balance LPT. A nice reminder though",
            "title_similarity": "0.6284013",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hxwkpoy",
            "score": 1,
            "text": "laughs in engineering major",
            "title_similarity": "0.30160052",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxwkqtv",
            "score": 1,
            "text": "We are very concerned about peoples work life balance. \n\nWe literally talk about it at every quarterly meeting, and discuss it while hiring. \n\nYes there may be times we need you to do some extra, but 99% we operate M-F 6-4 with flexible starts. \n\nAbout half work 8-4. Service works 6-3\n\nAnd don’t call, email, or anything else on your off time unless it is mission critical/ top customer major issue",
            "title_similarity": "0.69237113",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hxwkqu2",
            "score": 1,
            "text": "Yes it's my responsibility, but there is not always availability in that.\n\nMany jobs I've worked I tell them I'm depressed and some days will be hard to come in and I need a good work/life balance. Tell them 30 hrs a week is very doable. What do they do? Schedule me 8 hours a day for 9 days straight, then 4 days off. Like wtf? That's not balance in any effect..",
            "title_similarity": "0.73763835",
            "sentiment_compound": -0.3204
        },
        {
            "id": "hxwkrv3",
            "score": 1,
            "text": "As someone who is currently looking for a job and they include an hourly/commission scale…when they ask about my preferred environment I just wanna print this out and include this. Or include it with my application. Like, don’t call me if you expect me to put work before my mental health again.",
            "title_similarity": "0.70353585",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxwkxw9",
            "score": 1,
            "text": "God I’m getting sick of these.  Every work environment is different.  The work generic related LPTs are situational and have too many variables to an effective general tip.  This is just karma farming!",
            "title_similarity": "0.63848925",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hxwld0c",
            "score": 1,
            "text": "Oh people do care if you work in the extraordinarily toxic profession of medicine",
            "title_similarity": "0.58216035",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxwls2p",
            "score": 1,
            "text": "I learnt this the hard way with my old job",
            "title_similarity": "0.6003518",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxwm1li",
            "score": 1,
            "text": "At my job its actually frowned upon to the point i only stopped taking OT shifts for one month cause i was working 80/90hr weeks with sometimes less than 1hr notice and i needed to give myself a break…. Well that was 4ish years ago I’ve had to get a job somewhere else cause I’ve they refuse to give me OT now and I’m financially hurting since covid started i haven’t gotten an inflation raise. I’ve learned to hate working for NFPs and school’s.",
            "title_similarity": "0.6989261",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hxwmksb",
            "score": 1,
            "text": "Love the phrase work life balance. So much propaganda right there. If you do all work you suffer from basic enslavement. If you do all life, the possibilities seem endless!",
            "title_similarity": "0.73236287",
            "sentiment_compound": -0.2193
        },
        {
            "id": "hxwmukp",
            "score": 1,
            "text": "I guess this is part of why I don't make a good supervisor. I just had someone resign and I *could* ask my other nurse to cover her stuff until I get another one hired but I don't want to overwhelm him and so instead I am figuring out ways I can do more to cover the lapse until we hire someone. Honestly, I think this job market will force people to care more about their employees and not burn them out into quitting.",
            "title_similarity": "0.8093611",
            "sentiment_compound": 0.8096
        },
        {
            "id": "hxwmzwj",
            "score": 1,
            "text": "I’m struggling with this, hardcore. I’m trying to move up in my company and have been GRINDING work for 2 years now. Tons of accomplishments. Tons of visibility and accolades. Boat load of new skills and experience. Zero new job offers.",
            "title_similarity": "0.6234715",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxwn22f",
            "score": 1,
            "text": "You will work your fingers to the bone and then the boss will give the promotion to a buddy.",
            "title_similarity": "0.68547845",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwo0wh",
            "score": 1,
            "text": "Oh, you're very wrong. People absolutely care if you hit burnout, and they will shout at you like a dog if you're not doing what they expect.",
            "title_similarity": "0.6783468",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hxwox0j",
            "score": 2,
            "text": "I'm probably going to call out tomorrow. I'm so overworked in my department I literally think about quitting every day.",
            "title_similarity": "0.7022486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwoxbq",
            "score": 2,
            "text": "Should be life-work balance. Life always comes first",
            "title_similarity": "0.5526368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwpchd",
            "score": 1,
            "text": "Actually I feel sad for some. I have been there and working so hard that you forget to live and then regrets, well sad.",
            "title_similarity": "0.680617",
            "sentiment_compound": -0.8543
        },
        {
            "id": "hxwqen7",
            "score": 1,
            "text": "There are a lot more of those people than mareting people... No worries, Ill keep going to town helpin kiddos for $14.50!",
            "title_similarity": "0.5356204",
            "sentiment_compound": 0.6067
        },
        {
            "id": "hxwr9kp",
            "score": 1,
            "text": "You actually could have shortened this -\n\n**LPT: Nobody cares.**\n\nIt’s the truth, people only really care about themselves.",
            "title_similarity": "0.6535664",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hxwrmin",
            "score": 1,
            "text": "I worked for too long at a job that required lots of travel. The leave at o-dark thirty on Monday, back after supper time on Friday type of job. Week after week for months on end, with 10-12 hour days when at the customer.\n\nWhile my wife could handle my absences, a lot of other wives could not. I lost track of the number of divorces that the schedule no doubt had a part in. Just about every one of the road warriors, myself included, were on Paxil, Xanax or similar for anxiety. Finish one job then off to the next that was already weeks behind. Lather, rinse, repeat.\n\nI finally realized I was missing too much home life and got a local-only job. That was twenty years ago, but I sometimes still get triggered on Sunday nights, when in my old job I would be taking clothes out of the dryer straight to my suitcase. Again.\n\nEdit: we were all salaried, no OT pay.",
            "title_similarity": "0.69132257",
            "sentiment_compound": 0.0335
        },
        {
            "id": "hxwsjuj",
            "score": 1,
            "text": "The value of my time is vadtly lower than the value of my free time.",
            "title_similarity": "0.38884473",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hxwslmc",
            "score": 1,
            "text": "This is something I want to scream to my peers sometimes. For some reason they (graduate students) expect the program to determine self-care and are upset when they don’t set their own boundaries.",
            "title_similarity": "0.6958393",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hxwu70h",
            "score": 1,
            "text": "Someone show this to the devs at 343.",
            "title_similarity": "0.21353608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxwuoen",
            "score": 1,
            "text": "This is so true, but some companies do t allow it and you get stuck. \n\nI’m applying g to new places like crazy because you’re just a number here and you feel like if you take PTO you’ll fall behind so badly (not enough admin time is given to remain caught up) you take a risk by stepping away.",
            "title_similarity": "0.78597116",
            "sentiment_compound": -0.4817
        },
        {
            "id": "hxwv1c9",
            "score": 1,
            "text": "Not true. Your significant other/family will care if you work yourself into an early grave.",
            "title_similarity": "0.634768",
            "sentiment_compound": -0.3235
        },
        {
            "id": "hxwv351",
            "score": 1,
            "text": "It is your responsibility, but when there are these toxic managers that companies don’t want to sort out, it becomes a fight to have that balance. Poor management is a virus that corrupts the entire environment. It’s not until someone is willing to take a stand to bad management is when HR and the higher ups take notice.",
            "title_similarity": "0.7537365",
            "sentiment_compound": -0.9161
        },
        {
            "id": "hxwvk25",
            "score": 1,
            "text": "It’s never that simple in some situations. I voiced my concern about more “family time” to my boss. I then worked back to back days of 9 am - 2 am and a week later gave them a 2 week notice. Sometimes you are only heard when you decide to leave.",
            "title_similarity": "0.6683548",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxww24u",
            "score": 1,
            "text": "Me: *Spends all 9 hours at work constantly working with no breaks or down time* \n\nWork: \"I know we are a bit understaffed, just keep doing your best and things will get easier soon\"\n\nWork: *finally hires new staff to share the workload*\n\nMe: *gets to relax a bit with more people around to help out*\n\nWork: \"hey, I noticed you are slacking off a bit, here's some new responsibilities to keep you busy in your downtime\"",
            "title_similarity": "0.7790996",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hxwx6jz",
            "score": 1,
            "text": "I fell like this should be posted in big flashing letters once a week, where everyone can see it and internalize it.\n\nThank you X 1,000.",
            "title_similarity": "0.46012163",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxwxchs",
            "score": 1,
            "text": "hey, overworked person, I care.",
            "title_similarity": "0.45734942",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxwy8ix",
            "score": 1,
            "text": "This is my wife at work.  Dead tired at night and telling allllll about the sacrifices she does for this person and that person.  I tell her who gives a crap and then she’s mad at me??! Truth sucks I guess.",
            "title_similarity": "0.6645306",
            "sentiment_compound": -0.9307
        },
        {
            "id": "hxwybam",
            "score": 1,
            "text": "I had an executive at my work this week say “I don’t call it work life balance, I call it work life integration.” I immediately cringed. You aren’t supposed to bring life to work, so why bring work into your life? You pay me for my work, you don’t pay me for my loyalty. \n\nA few things on my mind lately:\n\n1. If you die, your position will be open for applications tomorrow. Treat your job with that same respect that your employer would have for you and your role.\n\n2. Money is a means to an end which means in many cases work is that way too. Very few people really chase money. Money is a tool to check a different box. Make sure the box you’re checking is worth it i.e. “The dream car you ‘love’….do you love the car or the way it makes you look to others? Because although it checks a $100 need for transportation, the extra $387 it costs monthly may keep you in a job you hate for hours you don’t need to work.” How much money you spend (which is also time worked) on making others “impressed” with you is always a sunk cost. Enjoy things, but don’t become indebted to them.\n\n3. Corporate culture will suck you in and the executives in your company many times are incentivized to get your buy in. They want low turnover so they aren’t spending money on onboarding or proper workplace culture which means higher profits and bigger bonuses for them. Be a good steward, but don’t become a subservient. There is always another job out there. Don’t be afraid of the unknown if what you do know is toxic and not good for you, your health, or your family.",
            "title_similarity": "0.84451985",
            "sentiment_compound": 0.9012
        },
        {
            "id": "hxwyuo2",
            "score": 1,
            "text": "I think one positive here is that since COVID at least office culture has changed for the better in a lot of ways. It has been totally normalized for people's families and pets to be running around in the back of video call and making noise.",
            "title_similarity": "0.53159416",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hxx1emi",
            "score": 1,
            "text": "LPT - YOURE WRONG.  a good boss cares",
            "title_similarity": "0.61222386",
            "sentiment_compound": 0.2656
        },
        {
            "id": "hxx2pyg",
            "score": 1,
            "text": "Marketing, the biggest perpetrator of inequality and corporate gaslighting. Ethical Work/life balance would exclude 99.99% of corporate marketing positions.",
            "title_similarity": "0.5452819",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hxx4ahf",
            "score": 1,
            "text": "Boss makes a dollar I make a dime that's why I poop on company time",
            "title_similarity": "0.61958826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxx4m1h",
            "score": 1,
            "text": "A girl I worked with in my last job was like this. We were close and even got coffee out of work or brought both sets of kids to the park together. Anyway everyone loved her for being so dedicated and always the one to call if work was short or the one to stay back.\n\nI looked up to her for her work ethic until I realised she was putting this shitty low paying job above nearly everything else. She would jump through hoops to get her kids watched to come to work because the team was short (working short was common and wasn't the end of the world). She would guilt you for taking a break if you were short. When she did a particular shift she wouldn't take one of her allocated breaks as it was a waste of time apparently. If you had an issue with the workplace she would say something like \"oh well, just gotta work through it.\" She made you feel guilty if you called in sick or complain about the workplace. \n\nI eventually resented her for putting blinkers on to how bad the workplace had gotten, how she made excuses for why we were treated like shit as employees, how she always put the job above her own needs.",
            "title_similarity": "0.7381214",
            "sentiment_compound": -0.9039
        },
        {
            "id": "hxx4tbx",
            "score": 1,
            "text": "How nice it must be to be so privileged that you can afford to just quit any job you don’t like.",
            "title_similarity": "0.6943278",
            "sentiment_compound": 0.8419
        },
        {
            "id": "hxx4tzs",
            "score": 2,
            "text": "Dont be house poor",
            "title_similarity": "0.34516445",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hxx57jm",
            "score": 1,
            "text": "Every situation is different indeed. I worked 95hrs a week with one day off for a year. I’ll never do that shit again but I was able to establish myself as a hard working motherfucker and everyone around me wanted me to work for them. Now I own my own cleaning business and I create high paying jobs. Some people just complain too well about how lazy they are. \n\nIf you don’t need money cool, but let the working class build America. We don’t need you.",
            "title_similarity": "0.80960655",
            "sentiment_compound": -0.7421
        },
        {
            "id": "hxx7d3r",
            "score": 1,
            "text": "Not really if you're a casual worker, aren't good at workplace politics and you turn down shifts for work life balance guess who's not gonna be getting shifts?",
            "title_similarity": "0.7473024",
            "sentiment_compound": -0.1546
        },
        {
            "id": "hxx8ouw",
            "score": 1,
            "text": "PLEASE PPL LISTEN!!! No one!!! And I’m sorry but if you stay out of work long enough or fall on hard times you’ll see and sometimes hear to your face what ppl really think about you. It’s sad but ppl are afraid to ask for help for a reason.\n\nDon’t over extend yourself for any reason. Fill your cup up first and help others with what spills out.",
            "title_similarity": "0.7602765",
            "sentiment_compound": 0.7036
        },
        {
            "id": "hxx97pv",
            "score": 1,
            "text": "A good manager prevents this from happening to you a bad one puts you in this position with pressure of authority",
            "title_similarity": "0.6691198",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxx99ci",
            "score": 1,
            "text": "Sometimes you don’t have a choice in the matter, I’d love to have some control on how much I work but unfortunately food and a roof costs money",
            "title_similarity": "0.7315233",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hxx9g3o",
            "score": 1,
            "text": "I care\n\nAnd I think the people who don't care should go fuck themselves",
            "title_similarity": "0.5177841",
            "sentiment_compound": -0.4456
        },
        {
            "id": "hxx9k6f",
            "score": 1,
            "text": "Found that out the hard way. Worked a full time job at Tim Hortons (Morning Baker, 4am-Noon Monday to Friday) and Papa John's, 4pm-7pm Tuesday to Friday).\n\nI lasted a month. 😐 I got so burnt out that I overslept several times. The first time they were furious. The second dmtime they sent me home. I felt like shit, but at the same time, I couldn't keep it up.\n\nI would wake up at 3am eat breakfast and get there for 4am, leave at noon, go home, eat lunch and take a nap, go to my other job for 4pm, work until 7, go home, eat dinner then go to bed at 9pm to do it all over again the next day.\n\nNever. Again.",
            "title_similarity": "0.589464",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hxx9oql",
            "score": 1,
            "text": "This is not a tip - life pro or otherwise.",
            "title_similarity": "0.25431252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxxafoo",
            "score": 1,
            "text": "You can't compete with people that work harder than you do and there isn't a lot to have at the bottom. If you slack off they'll take it.",
            "title_similarity": "0.74308026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxxag9x",
            "score": 1,
            "text": "I used to have a job that was 11 hours a day.\n\nMy freetime was laying down and not doing shit to recoup\n\nThe job was not only robing me of my life but my ability to physically do anything in my actually free time.",
            "title_similarity": "0.6802532",
            "sentiment_compound": 0.8725
        },
        {
            "id": "hxxavap",
            "score": 1,
            "text": "Dont forget about yourself!",
            "title_similarity": "0.2862935",
            "sentiment_compound": 0.2401
        },
        {
            "id": "hxxccax",
            "score": 1,
            "text": "Don't let yourself truly burn out. You never fully recover.",
            "title_similarity": "0.43631682",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hxxcoff",
            "score": 1,
            "text": "work just enough not to get fired",
            "title_similarity": "0.5150931",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hxxdjck",
            "score": 1,
            "text": "Disclaimer covered my qualm here. You’re absolutely right for whenever it’s within your control. For many of us it is not within our control sadly.",
            "title_similarity": "0.56007266",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxxdl75",
            "score": 1,
            "text": "Truth!! I work a high demand job. But I make a point to go camping/ riding quads/ or overlanding at a minimum once per month. Self care is always needed",
            "title_similarity": "0.6418793",
            "sentiment_compound": 0.7418
        },
        {
            "id": "hxxg7ju",
            "score": 1,
            "text": "I've worked 75 hours a week, 7 days a week, every week for 10 straight months. \n\nNot everyone gets burnout",
            "title_similarity": "0.40574047",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hxxiced",
            "score": 1,
            "text": "Learned this the hard way. In fact it led me into some terrible circumstances and eventually bankruptcy. If I had just paced myself Id still have everything and be doing quite well.",
            "title_similarity": "0.7221324",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hxxjee4",
            "score": 1,
            "text": "I somewhat agree, but also don't at the same time.\n\nOften it is the case that nobody cares... But a good manager should care. Having an un-burnt out employee is more effective long term. They will do better work, and do it happily bringing up morale of the team and decreasing attrition.\n\nI would say there is a nuance that if you're overworking because you're adding more things to your own plate to pump up your numbers then you should stop. If you're overworked because too many things have been put on your plate, then you need to talk to your management about priorities and workload.\n\nDon't suffer in silence. If you don't put the problem in words how do you ever expect it to get better? At best you get a prioritised set of tasks, at worst you find out that your manager doesn't care and you need to look elsewhere.",
            "title_similarity": "0.83741564",
            "sentiment_compound": 0.9867
        },
        {
            "id": "hxxllcy",
            "score": 1,
            "text": "LPT: It is better to not do any overwork at all than doing some. People understand that you do your job and limit yourself to it. This include no overtime, no out of hours and all that. But they do not understand why you refuse to do it this time when you sometime do it. They will push you to do it, because \"you do it all the time!\".",
            "title_similarity": "0.82011175",
            "sentiment_compound": -0.3178
        },
        {
            "id": "hxxqkiy",
            "score": 1,
            "text": "Took me 20 years to figure this shit out",
            "title_similarity": "0.26306558",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hxxvmyb",
            "score": 1,
            "text": "Marketing is sales, there is nothing good about that except the blood money.",
            "title_similarity": "0.57997763",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hxxvtw2",
            "score": 1,
            "text": "While I kind of agree with this, it’s half on your employer too. If the environment is toxic to a point where everyone overworks and struggles with work life balance, then something is systematically wrong",
            "title_similarity": "0.76763797",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hxxxim4",
            "score": 1,
            "text": "On the Edit: Or your stuck in a job you can’t leave because you don’t have any experience in another field.",
            "title_similarity": "0.68887264",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxy9xjj",
            "score": 1,
            "text": "Couldn't agree more with that statement",
            "title_similarity": "0.28065893",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hxya3mq",
            "score": 1,
            "text": "That's especially true in remote jobs which are the norm now in some professions. I've had managers who told me \"not to stay online too long\", but it's not their responsibility to manage your wlb.",
            "title_similarity": "0.7202101",
            "sentiment_compound": 0.2609
        },
        {
            "id": "hxyabw9",
            "score": 1,
            "text": "Yeah I'll be sure and show this to my boss. I'm sure he'll be quite sympathetic to my plight. What planet do you live on that you think the average person can just saunter into their place of employment and simply tell them \"I'm burnt out I'll be back in a couple of weeks\". Maybe at a cushy white collar job but that doesn't apply to a huge chunk of the workforce.",
            "title_similarity": "0.78722143",
            "sentiment_compound": 0.799
        },
        {
            "id": "hxydpx4",
            "score": 1,
            "text": "Milking projects at work is an art form",
            "title_similarity": "0.37811312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxyf57y",
            "score": 1,
            "text": "This is the most \"I don't understand how the world works\" post ever 😂",
            "title_similarity": "0.41104424",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxygevh",
            "score": 1,
            "text": "I can 100% agree. Used to overwork myself but all I got was a 'you work so hard' or 'you're the best' and additional work. Now I've stopped working outside of work hours and asked for extra help when I need to and I feel so much better.",
            "title_similarity": "0.76803714",
            "sentiment_compound": 0.9139
        },
        {
            "id": "hxygf8r",
            "score": 1,
            "text": "This is why Im a consultant. If I feel like overworking myself I actually get compensated for it. And it I feel a lil lazy I keep my work load lighter",
            "title_similarity": "0.71263003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxyjk6u",
            "score": 1,
            "text": "Keep that same energy when there are no more healthcare professionals to take care of you after an accident or your sick grandma. If your employer doesn't support your wellness and work/life balance, your only option is to quit.",
            "title_similarity": "0.74125075",
            "sentiment_compound": -0.7884
        },
        {
            "id": "hxyn1gw",
            "score": 1,
            "text": "Part of the reason people are quitting health care is that we do not have that luxury.  Your boss has need for a body somewhere and decided it’s on you.  If you refuse you’ll be terminated with cause — and threatened with allegations of abandonment/neglect.",
            "title_similarity": "0.78589934",
            "sentiment_compound": -0.25
        },
        {
            "id": "hxys4e9",
            "score": 1,
            "text": "yh your life is all up to you. Everyone wants the best for themselves. Themselves . They put themselves way higher up on the priority list than you would and you have to do the same for yourself",
            "title_similarity": "0.6533039",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxz1zow",
            "score": 1,
            "text": "True, but then you can’t complain when hard work pays off for those who put in the extra time. Elon Musk didn’t get where he is by working a 30-40 hour workweek. Sometimes the risk of *possible* burnout is worth the payoff.",
            "title_similarity": "0.7680416",
            "sentiment_compound": -0.631
        },
        {
            "id": "hxzw3p3",
            "score": 1,
            "text": "Currently work a salaried position at a WITCH IT company and since this job means nothing to me, I stopped caring on the verge of quitting (it doesn’t really help my career aspirations) but also couldn’t risk losing an income.\n\nSo I just stopped giving a shit about anything and anyone because I’m not worried about the aftermath. It has done wonders for my mental well-being.",
            "title_similarity": "0.7518039",
            "sentiment_compound": -0.8287
        },
        {
            "id": "hy2vnh2",
            "score": 1,
            "text": "This is so true... I realized on my own experience... Also the reward of working and delivering more is going to be having more work assigned to you...",
            "title_similarity": "0.5940136",
            "sentiment_compound": 0.8083
        },
        {
            "id": "hyi4nsu",
            "score": 1,
            "text": "Milking projects at work is an art form",
            "title_similarity": "0.37811312",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0y86ja",
            "score": 1,
            "text": "I work a solid 5 days in a row at a grocery store overnight. I'm stocking shelves and having to face-up and make the store look \"pretty\" every night.  Do you know how exhausting it is to see the bill come in and think *\"Greeeeeeeat, have 900 pieces of freight to work PLUS the entire store to face with a total of 3 people on shift tonight.\"*  Making the store look \"pretty\" takes 5 hours minimum with 3 people because of the size and is meant to be the priority. My store would rather the shelves look pretty instead of actually having all the freight done so people can, IDK, buy it when they come to shop??\n\nDo this 5 days in a row, every single week. By the end of the week, I am *tired and exhausted* but when my first night off comes up, I can always rely on good ol' manager man to ask me \"Wanna work tonight?\"\n\nAnd I tell them \"No. I'm sore and tired.\" And walk away.  Because 5 days a week pays my bills and mostly allows me to manage the pain I have from work anyway.\n\nDefinitely glad I found the will to say \"no\" or my life/work balance would be wrecked.",
            "title_similarity": "0.5702885",
            "sentiment_compound": 0.2124
        },
        {
            "id": "i19g64i",
            "score": 1,
            "text": "I don't think it is that simple. Once you are on salary many bosses treat you like a slave. Your choice - work the hours or leave. You don't always have that choice",
            "title_similarity": "0.8353828",
            "sentiment_compound": 0.6124
        }
    ]
}