{
    "LPT: If you’re stuck on a call you don’t want to be on, hang up while YOU are talking. No one will ever think you hung up on yourself.\n": [
        {
            "id": "i1x9r46",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.63162255",
            "sentiment_compound": 0.9615
        },
        {
            "id": "i1x9sv4",
            "score": 4,
            "text": "you’re a fucking genius",
            "title_similarity": "0.22947386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xk6f9",
            "score": 1,
            "text": "I almost left this sub.  Then you happened.  Thank you.",
            "title_similarity": "0.41566104",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1xdlx9",
            "score": 1,
            "text": "How have I not thought of this until now!?",
            "title_similarity": "0.3921485",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xfrig",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.26594427"
        },
        {
            "id": "i1y1ix8",
            "score": -1,
            "text": "Devious i like it",
            "title_similarity": "0.21873508",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1xahlp",
            "score": 46,
            "text": "Or grow some balls and hang up after explaining that you don't want to talk anymore.",
            "title_similarity": "0.6828258",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i1xrqzm",
            "score": 0,
            "text": "This is a good LPT",
            "title_similarity": "0.22034524",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1xyldm",
            "score": 0,
            "text": "That’s actually a great LPT.  Thank you OP.",
            "title_similarity": "0.26979858",
            "sentiment_compound": 0.765
        },
        {
            "id": "i1x9y59",
            "score": 16,
            "text": "True sociopath shit. Jealous",
            "title_similarity": "0.21070948",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i1y07b3",
            "score": -2,
            "text": "Finally, a real fucking LPT. \n\na little more useful than that one from earlier that was like \"Drink water\"",
            "title_similarity": "0.3718872",
            "sentiment_compound": 0.6613
        },
        {
            "id": "i1xhayf",
            "score": -3,
            "text": "Finally something useful!",
            "title_similarity": "0.26469135",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i1xnsc8",
            "score": 0,
            "text": "I do this daily! I have no end of people calling me, I have to do it just to get some silence.",
            "title_similarity": "0.63278127",
            "sentiment_compound": -0.3595
        },
        {
            "id": "i1xocfr",
            "score": 0,
            "text": "That's so cunty *I love it*",
            "title_similarity": "0.22047657",
            "sentiment_compound": 0.6666
        },
        {
            "id": "i21ttze",
            "score": 0,
            "text": "But then they’ll probably call you back…",
            "title_similarity": "0.5472802",
            "sentiment_compound": 0.0
        },
        {
            "id": "i220q7x",
            "score": 0,
            "text": "LPT:  stop recommending dishonesty.",
            "title_similarity": "0.63410074",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2237is",
            "score": 0,
            "text": "Belive me they can know it's very obvious 🙄 rather just hang out and say it's the phone fault",
            "title_similarity": "0.6330314",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i228yu8",
            "score": 0,
            "text": "Next level passive aggressive",
            "title_similarity": "0.36706468",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i22bwud",
            "score": 0,
            "text": "Lol this is a pro tip on how to be a douche bag",
            "title_similarity": "0.407355",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i1xjpk0",
            "score": -1,
            "text": "I’ve been doing this for years, now everyone knows, how am I going to get out of called with my mum!?",
            "title_similarity": "0.43118638",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xu2de",
            "score": 1,
            "text": "Yes! I do this all the time at work! I work in the firearms industry and a lot of people like to waste time.",
            "title_similarity": "0.2789971",
            "sentiment_compound": 0.4559
        },
        {
            "id": "i1y0fcp",
            "score": 1,
            "text": "Hey, hey, hey! This is a trade secret that I use on everybody. Family, friends, strangers. No one is immune to mid-sentence phone failure.",
            "title_similarity": "0.56768763",
            "sentiment_compound": -0.126
        },
        {
            "id": "i1y13y7",
            "score": 1,
            "text": "Even better, turn your phone off so they can't immediately call back",
            "title_similarity": "0.64720476",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1y30fl",
            "score": -1,
            "text": "I've done that forever.  It's always a pointless conference call where you don't even need to be there.  Just people saying the same thing over and over and over.  I've got shit to do.  \n\nJust drop the call.  Later, send an email saying sorry, mutated weasels invaded my office and i had to kill them with my bio-engineered robot T-Rex and my trusty dog Sparky.\n\nGod I hate long conferences.  I don't care if it's Zoom or Conference Bridge.  Most of the time, the entire thing could be handled in seconds with a well composed email.\n\nWith in-person long meetings, I usually feign diarrhea and run out of the meeting.  I had to do that with a 4 hour long meeting regarding an event where the packet had all the information.  I just couldn't take it any more.  No, I don't want to listen to the parking coordinator about how to park for 30 minutes.  I've been doing the event for a decade.  Why am I here?  I don't need power run to my booth so stop talking about it.  I know where my booth is.  I know the rules.  I know how it's done.  No, I don't want to pin the gold star on the clowns nose in your team building exercise.\n\nDiarrhea to the rescue.  No one ever questions that.  Then go straight to your car and get back to the office so you can do real work.",
            "title_similarity": "0.4712885",
            "sentiment_compound": -0.8987
        },
        {
            "id": "i1y3g4r",
            "score": -1,
            "text": "Usually it’s my grandmother or mom that is taking forever, so I just say I’ve gotta use the bathroom. \n\nNo one wants to hear you poop.",
            "title_similarity": "0.6519388",
            "sentiment_compound": -0.296
        },
        {
            "id": "i1y4kk3",
            "score": -1,
            "text": "I just hang up. IDC. People need to learn to shut up and to recognize responses people give in conversation that show they aren't interested in what they are talking about.",
            "title_similarity": "0.67187047",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i1y5rd1",
            "score": 1,
            "text": "\nThis LPT could be useful in a situation where there's a power difference between you and the other person and there will be consequences if you don't have a believable excuse. Maybe OP specifically had a business call with an unreasonable boss in mind. But please please do not do this with your friends/family just because it's awkward to interrupt or say goodbye.\n\nSomeone doing this to me would trigger my anxiety and potentially throw off my whole day. Should I call them back? Are they calling me back? What if we call each other at the same time? If I call them back and it was inconvenient for them, then I might feel like a bother for the rest of the day. If I don't call them back I'll wonder if they thought I hung up on them and that worry could bring me down for the rest of the day. If you need/want to get off the phone with me, it's a lot easier if you just say that you need to go rather than just hanging up and leaving me in a confusing situation wondering what the social expectation is.\n\nAnd stop with the \"I should let you go\" thing. If you act like you're doing it for me, I'll tell you that you don't need to because I'm enjoying the conversation and don't have anything else I need to do right now. Oh, you meant that you want to get off the phone? Why didn't you just say that to begin with and save yourself time and me embarrassment? \n\nPeople act like I'm socially inept for not correctly interpreting their unspoken meanings (or correctly interpreting them but asking for clarification rather than assuming) when they're the ones who can't be honest and set clear boundaries.",
            "title_similarity": "0.6807022",
            "sentiment_compound": 0.818
        },
        {
            "id": "i1y6vlm",
            "score": -1,
            "text": "Just make sure you actually complete a sentence while you're doing it. Don't say \"well the thing abou-\" and hangup cuz then you'll probably have a weird cadence and leave people suspicious. Say \"well the thing about that is\" and just cut yourself off at abou- it makes it seem way more natural.",
            "title_similarity": "0.6971413",
            "sentiment_compound": 0.0462
        },
        {
            "id": "i1y71cx",
            "score": 1,
            "text": "Subtle yet genius lmao",
            "title_similarity": "0.27432457",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i1y7ny1",
            "score": -1,
            "text": "finally some actual lpt. it's been years i tells ya... YEARS!",
            "title_similarity": "0.23952389",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zknqj",
            "score": 1,
            "text": "Woah, holy shit, this is a game changer.",
            "title_similarity": "0.26953056",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i21k8la",
            "score": 1,
            "text": "\"I'm sorry, but I have an appointment shortly and are running short on time. If you have any further questions and information please contact me via email\".\n\nThat LPT will just end with the caller calling again, with a lot of waffling going on about your connection and the general decline of the telephone industry.",
            "title_similarity": "0.63923496",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i21maei",
            "score": 1,
            "text": "\"i gotta go now, talk to you later\" \"nice talked ng to you, i gotta let you go\" \nI dont see how hard it is just to be straight up and end the call.",
            "title_similarity": "0.7500802",
            "sentiment_compound": 0.6119
        },
        {
            "id": "i21shn2",
            "score": -1,
            "text": "There are a few times in life where you may have to do something like this, but they are very few & far between. As a general rule we, as adults, shouldn't deal with things in life in a childish manner. When people get into habits of doing things like this, they forget to whom & how many times they've done it and it will catch up with you. Remember, 95% of all the decisions made about you at work happen when you aren't in the room. If you treat your \"friends\" like this too, the same will happen in your personal life.",
            "title_similarity": "0.60226566",
            "sentiment_compound": 0.8957
        },
        {
            "id": "i1xqf91",
            "score": 26,
            "text": "So, if a coward, also be a liar?\n\nReal pro tip. Never be afraid to say, “I have to go now”",
            "title_similarity": "0.62156415",
            "sentiment_compound": -0.743
        },
        {
            "id": "i1xlvoi",
            "score": 36,
            "text": "r/ShittyLifeProTips\n\nIn real case you say \"Sorry I have to go urgent matter\". Otherwise your team will try to call yo back to that meeting or wiat for you.",
            "title_similarity": "0.62705106",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i1xykgy",
            "score": -2,
            "text": "Oh my gosh! This! I used to do this to my first boss all the time. He'd call back and then I'd blame it on him being in a bad cell area. (Mid to late 90s)\n\nThe trick to doing this right is to continue talking even after you've hung up. Because there might be a delay between when you hang up in your voice stops going. You want to make it seem like you are cut off in the middle. Especially in the middle of the word instead of in between words. It feels less obvious when it's in the middle of a word rather than between words.",
            "title_similarity": "0.6704799",
            "sentiment_compound": -0.8353
        },
        {
            "id": "i1ydjd5",
            "score": 2,
            "text": "This isn’t a good tip",
            "title_similarity": "0.32787257",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1xiz4z",
            "score": 3,
            "text": "I haven't come across anybody that uses this. This is true sociopathic. 😂",
            "title_similarity": "0.48737833",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i1ximv4",
            "score": 22,
            "text": "Lay the groundwork as soon as you answer the phone. “Hey, just a heads up, my phone battery is almost dead and I’m not near a charger, so I might disappear mid-conversation.” Then you don’t even have to wait for them to let you get a word in edgewise.",
            "title_similarity": "0.7961802",
            "sentiment_compound": -0.7328
        },
        {
            "id": "i1xwgih",
            "score": 12,
            "text": "In my opinion, this is bad practice and teaches passive aggressive habits. \n\nYou‘ll see with age that cutting into an active conversation to get out is something you have to eventually learn. It shouldn’t be considered rude and there are plenty of ways to do it without being passive aggressive. \n\nWhat are you going to do when you are stuck in conversation at the grocery store with the chatty neighbor? Can’t exactly just hang up on them right? \n\nMy 2 cents.",
            "title_similarity": "0.585677",
            "sentiment_compound": -0.7655
        },
        {
            "id": "i1xx091",
            "score": 18,
            "text": "Why not just tell them you need to go.. ? You know. Like a regular, decent human being.",
            "title_similarity": "0.5551134",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1xp20z",
            "score": 5,
            "text": "r/UnethicalLifeProTips",
            "title_similarity": "0.33039993",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xi1sy",
            "score": 56,
            "text": "\"GottaGoBye\" is what I  say to my best friend when I'm too busy to talk.",
            "title_similarity": "0.56192493",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i1xiy2l",
            "score": 285,
            "text": "Just say \"Apologies. Thank you, I must go now, goodbye.\".\n\nSeriously, don't people wish people were more direct and less fake, but this is an LPT?\n\nEdit: It's completely valid to have situations you can't do this in, but that's very nuanced. Try to get where I'm coming from, don't be a coward and run from other fair people who just want real friends.",
            "title_similarity": "0.6707047",
            "sentiment_compound": 0.8637
        },
        {
            "id": "i1xuo5l",
            "score": 8,
            "text": "Ooooooor, develop a backbone and learn how to politely end a conversation like a well adjusted human.  \n\nI grew up very very shy, sometimes you just have to take things on head on, it's not going to kill you.",
            "title_similarity": "0.6288005",
            "sentiment_compound": 0.6972
        },
        {
            "id": "i1xzu56",
            "score": 8,
            "text": "This belongs in shitty life pro tips. What a terrible tip. Stop encouraging people to be avoidant. \n\nHere's a real life pro tip. Learn to be assertive so you don't get walked on. It's very simple.",
            "title_similarity": "0.66038597",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i1xpilx",
            "score": 9,
            "text": "bad lpt. they might call back and if you don't pick up then, you'll look sus af",
            "title_similarity": "0.610368",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i1xpiqa",
            "score": 11,
            "text": "Or just be a adult and say you have stuff to do and you can't stay on the phone all day",
            "title_similarity": "0.6254614",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xej2s",
            "score": 360,
            "text": "[deleted]",
            "title_similarity": "0.26594427"
        },
        {
            "id": "i1xvoqw",
            "score": 87,
            "text": "[removed]",
            "title_similarity": "0.2558092"
        },
        {
            "id": "i1xop0v",
            "score": 156,
            "text": "[deleted]",
            "title_similarity": "0.26594427"
        },
        {
            "id": "i1y6epm",
            "score": 19,
            "text": "...or maybe you shhould just have the courage to tell your counterpart \"sorry to interrupt you but I really have to join another meeting/open the door for the postman / go poop / watch a urgent youtube video / get rid of your annoying voice in my ear\"\n\nwe all are not 13 anymore, are we?",
            "title_similarity": "0.61779016",
            "sentiment_compound": 0.2722
        },
        {
            "id": "i1xm39m",
            "score": 20,
            "text": "Can you tell me as much of this you can in 2 minutes and send the rest in a text, I’m pushed for time right now but don’t want to miss what you have to say. Be careful who you hang up on, one day you may need them not to hang up on you.",
            "title_similarity": "0.7187217",
            "sentiment_compound": 0.1154
        },
        {
            "id": "i1y0jar",
            "score": 56,
            "text": "LMAO these socially inept LPTs make my day.",
            "title_similarity": "0.38675565",
            "sentiment_compound": 0.6841
        },
        {
            "id": "i1xqg3p",
            "score": 275,
            "text": "And then they call back? Or they dont and understand you just hung up on then but wouldnt tell them you wanted to leave so just fucked off?",
            "title_similarity": "0.76025903",
            "sentiment_compound": -0.8473
        },
        {
            "id": "i1xphfq",
            "score": 1849,
            "text": "LPT: If you don't want to be on a call, say \"Sorry, I have to go\" and hang up. If you use the trick in the OP the person on the other end might expect you to call back or will call you back themselves.",
            "title_similarity": "0.79091644",
            "sentiment_compound": -0.1833
        },
        {
            "id": "i1xkzdp",
            "score": 421,
            "text": "This only works so many times when you work at a call center. You eventually still get fired.",
            "title_similarity": "0.5003009",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i1xj80y",
            "score": 2122,
            "text": "I hit em with the ol *quick deep breath* \"alright then\" signals I am done here.",
            "title_similarity": "0.48306793",
            "sentiment_compound": 0.25
        },
        {
            "id": "i1xiggn",
            "score": 2595,
            "text": "My grandmother would never say goodbye to me on the telephone. She would get to the end of what she was saying and hang up. When I asked her why she said she didn't want to say goodbye to me because it was too final. She wanted to talk to me again.",
            "title_similarity": "0.69472307",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i1xie9c",
            "score": 2950,
            "text": "“Hey listen, my battery’s getting real low, my phone’s abou- *click*",
            "title_similarity": "0.4189158",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i1x9w3u",
            "score": 7393,
            "text": "Oldest trick in the call Center book",
            "title_similarity": "0.3997692",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i1xmkfm",
            "score": 5604,
            "text": "\"Let me let you go\"",
            "title_similarity": "0.4266107",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xkrhc",
            "score": 1,
            "text": "Hang up whenever.",
            "title_similarity": "0.39427152",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xl7tx",
            "score": 1,
            "text": "I've actually done this several times.  lol",
            "title_similarity": "0.06730971",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i1xnr5y",
            "score": 5,
            "text": "Just tell them you aren't interested in talking right now, and say bye.",
            "title_similarity": "0.73380166",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i1xoh4d",
            "score": 1,
            "text": "I just say \"Have to go poop\" in the chat and peace out.",
            "title_similarity": "0.51118845",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i1xou24",
            "score": 2,
            "text": "Ope, going under a bridge..... SKSHHHHHH  *CLICK*",
            "title_similarity": "0.12617603",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xp1zj",
            "score": 1,
            "text": "I think you are supposed to call back",
            "title_similarity": "0.52629334",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xqcvb",
            "score": 1,
            "text": "I do this at work",
            "title_similarity": "0.2237595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xr64f",
            "score": 1,
            "text": "Just say \"That is great, but I *really* need to go.\"",
            "title_similarity": "0.47208458",
            "sentiment_compound": 0.3716
        },
        {
            "id": "i1xrekj",
            "score": 1,
            "text": "Then I’m sure you’ll be very forgiving when the customer service rep you’ve been arguing with for 45 minutes does the same thing",
            "title_similarity": "0.51058996",
            "sentiment_compound": 0.3597
        },
        {
            "id": "i1xrqvy",
            "score": 1,
            "text": "This is waaaaay better than the person putting their car info in their phone contacts",
            "title_similarity": "0.46715862",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1xrzz3",
            "score": 1,
            "text": "I do this frequently",
            "title_similarity": "0.10147153",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xsdgv",
            "score": 1,
            "text": "Just flush the toilet",
            "title_similarity": "0.28187114",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xtkxs",
            "score": 1,
            "text": "I’ve literally had to just end the call and turn my phone off and then 5 mins later I just text and say “sorry phone died, running to the store call ya back later”\n\nThis was after being on the phone for over an hour where I literally couldn’t get a word in to say I had to go",
            "title_similarity": "0.46935892",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i1xtqud",
            "score": 1,
            "text": "Hahaha, I do this all the time when I get frustrated with the agent on a support/billing phone call. Hang up while I'm talking and call back to get someone different.",
            "title_similarity": "0.5732101",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i1xtt2c",
            "score": 1,
            "text": "I've never had a problem getting off phone. Just hit them with the Alright. Okay. Alright then. Well I know you're busy, I don't want to keep you. Good talking. Bye.",
            "title_similarity": "0.79077435",
            "sentiment_compound": 0.8731
        },
        {
            "id": "i1xufn4",
            "score": 1,
            "text": "“ L e t m e c a l l y o u b a c k” very easy and nice to be honest",
            "title_similarity": "0.3498039",
            "sentiment_compound": 0.9601
        },
        {
            "id": "i1xv1yu",
            "score": 1,
            "text": "Just hang-up.  If you don't want to be there, stop hiding it and just leave.  You do not owe people anything.   Why play games? Just tell them, I am done with this conversation and leave it.  Being disingenuous will only cause you more headaches in the end.",
            "title_similarity": "0.72807163",
            "sentiment_compound": -0.3863
        },
        {
            "id": "i1xv757",
            "score": 1,
            "text": "Turn off cellular service to make the call fail/disconnect",
            "title_similarity": "0.5604501",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xvzb0",
            "score": 6,
            "text": "I was on a conference call with just 1 other person when my phone did some weird shit where it hung up, but didn't register.  When I tried making outbound calls, it would connect, but I could only hear.  Had to reboot my phone.\n\nI get back on the conference call, and the other person was still talking as if I was still there.  I had to stop them and explain that I haven't been connected for at least 5 minutes.",
            "title_similarity": "0.6155455",
            "sentiment_compound": -0.6652
        },
        {
            "id": "i1xwiul",
            "score": 3,
            "text": "Yeah. But the probl",
            "title_similarity": "0.2523632",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i1xwvhm",
            "score": 3,
            "text": "Is this sub a joke sub now?",
            "title_similarity": "0.36766738",
            "sentiment_compound": 0.296
        },
        {
            "id": "i1xx0bs",
            "score": 1,
            "text": "Well *this* is a strangely neurotic life pro tip.",
            "title_similarity": "0.38392037",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i1xxx1t",
            "score": 1,
            "text": "Don't you dare underestimate the depths of my self-loathing.",
            "title_similarity": "0.53164625",
            "sentiment_compound": 0.2235
        },
        {
            "id": "i1xy8rs",
            "score": 1,
            "text": "No-tell them you have an incoming call you have to take. Very simple.",
            "title_similarity": "0.7025375",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xycz5",
            "score": 1,
            "text": "You have no obligation to answer random calls, just hang up, you don't need to explain yourself",
            "title_similarity": "0.8071536",
            "sentiment_compound": -0.296
        },
        {
            "id": "i1xynfo",
            "score": 21,
            "text": "[deleted]",
            "title_similarity": "0.26594427"
        },
        {
            "id": "i1xyrvj",
            "score": 1,
            "text": "My job is to literally talk to these people.\n\nYou can tell..",
            "title_similarity": "0.42209244",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xyy4m",
            "score": 1,
            "text": "i thought i was the only one!",
            "title_similarity": "0.35290977",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1xz35z",
            "score": 1,
            "text": "\"Sorry to interrupt, mate, but i've really got to get going. Talk to you some other time okay?\"\n\n...",
            "title_similarity": "0.57251227",
            "sentiment_compound": 0.128
        },
        {
            "id": "i1xz5dz",
            "score": 1,
            "text": "I just thank them for their time and wish them a wonderful day and hang up. I dont have time for this stuff anymore",
            "title_similarity": "0.61659604",
            "sentiment_compound": 0.836
        },
        {
            "id": "i1y0gv6",
            "score": 1,
            "text": "Yeah anyways, the secret to life and happiness is \\*click\\*",
            "title_similarity": "0.4099195",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i1y0i10",
            "score": 1,
            "text": "How about tell the truth and say you don't want to talk anymore? You have communication issues",
            "title_similarity": "0.6635877",
            "sentiment_compound": 0.2681
        },
        {
            "id": "i1y0pa5",
            "score": 1,
            "text": "Or you just say\n\nI don't want to be in this call any longer ans hang up?",
            "title_similarity": "0.7020099",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i1y0u72",
            "score": 1,
            "text": "Lol.  That's not as sneaky as you think.   Then you get stuck in the loop of why you didn't call back.   Battery dying only works a couple times.   Just tell the truth and get the awkwardness out the way lol.",
            "title_similarity": "0.70926946",
            "sentiment_compound": 0.7065
        },
        {
            "id": "i1y104r",
            "score": 1,
            "text": "I just say, “oh god oh god I have a mud pie liquid hot running down my leg. Dear oh god it’s a liquid hot pie from the mud factory downtown. Way downtown. I’m going to need new socks and a jockey. Quick with the socks and jockey cause of the mud pie hot.”\n\nThat does the trick in 98% of conversations.",
            "title_similarity": "0.1595361",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i1y1p5n",
            "score": 1,
            "text": "Why don't you just say I gotta go? I have things to do or something?\n\nI don't wanna hang up cause I don't want them calling me back.",
            "title_similarity": "0.6998071",
            "sentiment_compound": -0.1486
        },
        {
            "id": "i1y2nin",
            "score": 1,
            "text": "Yup. Now release the introvert you're pumping for info, they want to go home. Obvs.",
            "title_similarity": "0.53219426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i1y2o4f",
            "score": 1,
            "text": "Back in the day I would slowly unscrew the antenna",
            "title_similarity": "0.33192554",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y2qrb",
            "score": 1,
            "text": "If I really can't get someone off the phone, and it's a personal call, I just say... Oh I'm getting another call that I've gotta take, so have a great rest of your day, goodbye!",
            "title_similarity": "0.7514479",
            "sentiment_compound": 0.6864
        },
        {
            "id": "i1y326n",
            "score": 1,
            "text": "I do this allll the time..",
            "title_similarity": "0.25131637",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y35mn",
            "score": 1,
            "text": "Unless they’re using an iPhone. It’ll say call disconnected if it’s genuinely dropped. If you hang up it gives the three beeps",
            "title_similarity": "0.56024873",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y3bgq",
            "score": 1,
            "text": "Ah yes, yet another LPT for us socially awkward people.",
            "title_similarity": "0.3165031",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i1y3pht",
            "score": 3,
            "text": "This an r/UnethicalLifeProTip",
            "title_similarity": "0.34925205",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y3xbf",
            "score": 1,
            "text": "More ULPT material if you ask me but genius nonetheless.",
            "title_similarity": "0.30034927",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y40s7",
            "score": 1,
            "text": "\"Sorry, I have lost interest in this conversation now, I really gotta go, bye!' usually works",
            "title_similarity": "0.6115867",
            "sentiment_compound": 0.1759
        },
        {
            "id": "i1y4ig0",
            "score": 1,
            "text": "I do that all the time, works like a charm",
            "title_similarity": "0.23320648",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i1y4jhh",
            "score": 1,
            "text": "That’s brilliant",
            "title_similarity": "0.10284836",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i1y4jq5",
            "score": 1,
            "text": "That's rediculous. I can't",
            "title_similarity": "0.33318004",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y57dv",
            "score": 1,
            "text": "Oh, I remember using thi",
            "title_similarity": "0.20758528",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y5l81",
            "score": 7,
            "text": "I'm sorry, I have to go return some video tapes",
            "title_similarity": "0.33050182",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i1y5lts",
            "score": 1,
            "text": "Yoy know this person works in a call center",
            "title_similarity": "0.41011554",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y64o1",
            "score": 1,
            "text": "And if you're on a zoom call, disconnect from the wifi instead of just leaving the meeting. It will more realistically seem to the others like you didn't just quit because your computer will try to stay in the call before disconnecting.",
            "title_similarity": "0.72146654",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1y73ga",
            "score": 1,
            "text": "Haha I used to do this all the time when cellphones were newer. Now I just never answer my phone.",
            "title_similarity": "0.4800855",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i1y7b55",
            "score": 3,
            "text": "Lol I didn't think this was serious",
            "title_similarity": "0.3857113",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1y7c5e",
            "score": 4,
            "text": "My sister use to give me grief when I would say bye and immediately hang up without letting her say goodbye. Until she realized that our dad just would not let you off the phone unless you borderline hung up on him. My grandpa does that and my great grandma did it while she was alive. When we'd visit her you would have to drive away as she was still talking because otherwise you would never leave.",
            "title_similarity": "0.60446775",
            "sentiment_compound": 0.5644
        },
        {
            "id": "i1y7hvy",
            "score": 1,
            "text": "Real life pro tip: if you need to get off the call just say “oh I have a call coming in I need to take, talk to you later” then get off the call",
            "title_similarity": "0.7206688",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y846k",
            "score": 1,
            "text": "Just abruptly scream \"OH SHIT!\" and hang up",
            "title_similarity": "0.40336585",
            "sentiment_compound": -0.8087
        },
        {
            "id": "i1y8alj",
            "score": 1,
            "text": "I act excited when there’s a scammer.  I tell them to hang on a sec, I’m grabbing my wallet.  Then I toss my phone on the couch and let them wait.  Waste their time.",
            "title_similarity": "0.54191226",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i1y8uvt",
            "score": 1,
            "text": "Reported for rule 1. - Rude\n\nYou come across as quite selfish. Even if you dont want to engage with another person if they want to engage with you then its nice to be nice.",
            "title_similarity": "0.5491631",
            "sentiment_compound": -0.0903
        },
        {
            "id": "i1y8zqf",
            "score": 1,
            "text": "I really enjoy chatting with you all in this comment section, and I",
            "title_similarity": "0.26361772",
            "sentiment_compound": 0.5413
        },
        {
            "id": "i1y900u",
            "score": 1,
            "text": "I just yelled at the collection agency who were trying to collect on a debt that never existed.  The woman hung up and the calls stopped after that.",
            "title_similarity": "0.5773417",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i1y93bl",
            "score": 1,
            "text": "First time the advice has been good. Well done op.",
            "title_similarity": "0.40604967",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i1y93s5",
            "score": 1,
            "text": "This may work in some situations but usually if a call disconnects you would call back right away. If you do this trick and don't call back it'll be obvious what you did.",
            "title_similarity": "0.7133655",
            "sentiment_compound": -0.0964
        },
        {
            "id": "i1y94lx",
            "score": 1,
            "text": "I don't get it. Are you trying to get them to call you back? Or just an asshole?",
            "title_similarity": "0.6070933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1y9ah5",
            "score": 1,
            "text": "Worked in customer service for years. I know this trick, sorry you're not fooling everyone on this one.",
            "title_similarity": "0.5080426",
            "sentiment_compound": 0.1798
        },
        {
            "id": "i1y9i8e",
            "score": 1,
            "text": "Keep talking after you hang up just so it feels more genuine. Nothing worse than an awkward 1 or 2 seconds after you hit the button and the call just doesn’t cut yet for whatever reason.",
            "title_similarity": "0.7803043",
            "sentiment_compound": 0.0304
        },
        {
            "id": "i1y9w01",
            "score": 1,
            "text": "Pretty sure OP is between 16 and 25 and has been working for max. 3-4 years. This is the kind of behaviour you see with young colleagues. I call this semi-solution. Yeah it might look like you solved the problem but in reality you just postponed it and in fact this will now cause more work to you (or one of your colleagues) than it would have to just tank throught it.\n\nIf you cant escape a call give the other person a reason that has something positive to it. Like \"Sorry to interrupt you Mr. Wilson but it seems like we are drifting off into smalltalk and I already have another caller waiting on the line. I dont want him to wait longer than necessary, just as I wouldnt want you to. So thank you for calling and if you need anything else please send me an Email. Thank you, have a nice day\"\n\nIts not unprofessional or rude to interrupt people when they are wasting your time, as long as you are polite.",
            "title_similarity": "0.47911125",
            "sentiment_compound": 0.9732
        },
        {
            "id": "i1ya2bd",
            "score": 1,
            "text": "I just tell the person straight up I gotta get off the phone I'll talk to you later lol. 🤷 Of they keep going I'll keep saying ok BYE! talk you later. There's a way to be respectful about it too",
            "title_similarity": "0.70834416",
            "sentiment_compound": 0.8478
        },
        {
            "id": "i1yab5a",
            "score": 1,
            "text": "I kill the connection to my laptop, from the router, during zoom meetings.  First time is early in the meeting, for only a second, while I'm talking.  Then gradually longer and more frequently.  When someone finally says something too stupid for me to continue, I kill the connection, then quit the meeting.  It helps I live in the middle of nowhere, backs up my crappy internet story.",
            "title_similarity": "0.47797045",
            "sentiment_compound": -0.9398
        },
        {
            "id": "i1yavr0",
            "score": 1,
            "text": "It helps to blow into the phone so it sounds like static. Or if you have some stubble, rub it against your beard.",
            "title_similarity": "0.4499455",
            "sentiment_compound": 0.6557
        },
        {
            "id": "i1yax05",
            "score": 1,
            "text": "Just tell them you gotta go. If they won't stop talking just hang up. If they call back say you gotta go and hang up. If they call back again just ignore it and continue your day.",
            "title_similarity": "0.74924284",
            "sentiment_compound": -0.1561
        },
        {
            "id": "i1yb5nd",
            "score": 1,
            "text": "LPT: If you’re stuck on a call you don’t want to be on, tell them you have to go. \n\nWhy do you need to hang up on someone?",
            "title_similarity": "0.7418621",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i1ybhir",
            "score": 1,
            "text": "Can confirm, have done this and then pretended it took forever to get cell back and now too busy sorrrrrryyyyyyyy",
            "title_similarity": "0.56974685",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ybrm4",
            "score": 1,
            "text": "This is more common than you think, and it’s easily detectable.",
            "title_similarity": "0.28684348",
            "sentiment_compound": 0.34
        },
        {
            "id": "i1ybshu",
            "score": 1,
            "text": "Been using this for years. It works every time. Although sometimes they call you back and for that you gotta turn your phone off instantly. People assume bed reception rather than bad friendship.",
            "title_similarity": "0.6202336",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i1ybso6",
            "score": 1,
            "text": "They will if you keep doing it.",
            "title_similarity": "0.3812968",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ybuo6",
            "score": 1,
            "text": "Heres an adult tip: \"Hey i really have to go now - Yeah you have a good one too, bye\"",
            "title_similarity": "0.54363775",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i1yc4v6",
            "score": 1,
            "text": "Lmao the number of times I did that, should be illegal. Though good LPT!",
            "title_similarity": "0.52536356",
            "sentiment_compound": 0.5848
        },
        {
            "id": "i1yc7j5",
            "score": 1,
            "text": "Nah, they'll just call you back.",
            "title_similarity": "0.6314454",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i1yc8mk",
            "score": 1,
            "text": "Can't they just call you back?",
            "title_similarity": "0.6018605",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yceyv",
            "score": 1,
            "text": "r/shittylifeprotips",
            "title_similarity": "0.25549456",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ych70",
            "score": 1,
            "text": "this is what you do in pandemic zoom lectures. you disconnect frequently and always have cam/mic issues, so when your teacher tries to get your to participate, you have issues and they won't sus you",
            "title_similarity": "0.6128587",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yciqr",
            "score": 1,
            "text": "Haha I did this last night",
            "title_similarity": "0.21582446",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i1yckm7",
            "score": 1,
            "text": "Mid sentence clicks are the best way to rid yourself of terrible clients",
            "title_similarity": "0.46168235",
            "sentiment_compound": 0.34
        },
        {
            "id": "i1ycqd6",
            "score": 1,
            "text": "You really gotta LMAO as to what people think constitutes a LPT nowadays. Might as well have also posted the classic \"I'm driving through a tunnel, you're getting choppy\" line",
            "title_similarity": "0.39720082",
            "sentiment_compound": 0.7912
        },
        {
            "id": "i1ycqux",
            "score": 1,
            "text": "I've done this...right in the middle of giving my credit card info",
            "title_similarity": "0.37107128",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i1yd2z3",
            "score": 1,
            "text": "Did that at work during a zoom meeting and forgot that I was sharing my screen. My colleagues saw my mouse go down to my wi-fi, then turn it off.",
            "title_similarity": "0.5041296",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i1yd72e",
            "score": 1,
            "text": "And you say this is a Life Pro T.......",
            "title_similarity": "0.3907764",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ydcg8",
            "score": 1,
            "text": "Bonus points if you scream \"OH MY GOD WHAT IS THAT?\" first.",
            "title_similarity": "0.36439225",
            "sentiment_compound": 0.5622
        },
        {
            "id": "i1yddsv",
            "score": 1,
            "text": "If you have a friend/SO, [here's a few ideas](https://www.youtube.com/watch?v=Dn-Yd_-HmEE)...\n\nMy ex and I used to do the first one all the time to amuse ourselves when she was stuck with a telemarketers.",
            "title_similarity": "0.48898923",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i1ydlgs",
            "score": 1,
            "text": "DELETE THIS!! THIS IS MY GO TO",
            "title_similarity": "0.41198808",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ydovh",
            "score": 1,
            "text": "Didn't work on my conference call at work today.",
            "title_similarity": "0.50570494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ydpku",
            "score": 1,
            "text": "Unless you're my psycho ex.\n\nOur call dropped in the middle of *my* sentence, and he called back **screaming** \"Did you FUCKING hang up on me?!?!?!?!\"",
            "title_similarity": "0.5501478",
            "sentiment_compound": -0.6628
        },
        {
            "id": "i1ydrhy",
            "score": 1,
            "text": "Just say \"I don't care\" and hang up.",
            "title_similarity": "0.6446322",
            "sentiment_compound": -0.3875
        },
        {
            "id": "i1ye21p",
            "score": 1,
            "text": "Well, they might now 😆",
            "title_similarity": "0.29346588",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i1yea4p",
            "score": 1,
            "text": "I’ve used https://busysimulator.com/ to make it sound like I’ve got a lot of emails or team’s messages coming in. “Something just blew up at wok, got to go!”",
            "title_similarity": "0.42496687",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i1yep4j",
            "score": 1,
            "text": "If the feeling is not mutual, that fucker would just call again",
            "title_similarity": "0.6281103",
            "sentiment_compound": 0.6049
        },
        {
            "id": "i1yfdp8",
            "score": 1,
            "text": "> Hey, sorry to interrupt you, I have to get going. It was good talking with you. Bye!\n*click*\n\nOr am I the only one that does this?",
            "title_similarity": "0.6412538",
            "sentiment_compound": 0.126
        },
        {
            "id": "i1yfo17",
            "score": 1,
            "text": "I always just go like \n\n…\n\n…\n\n…\n\n\nHELLO? (Interrupt their talking)\n\nIt works.",
            "title_similarity": "0.49922743",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i1yg16b",
            "score": 1,
            "text": "This belongs in UNETHICAL life pro tips. My family and I come to this space for a wholesome, positive tips to lead a pro life. But this is downright RUDE.",
            "title_similarity": "0.5022248",
            "sentiment_compound": -0.7443
        },
        {
            "id": "i1yg6ss",
            "score": 1,
            "text": "Test the fire alarm also works.",
            "title_similarity": "0.32103473",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i1ygc22",
            "score": 1,
            "text": "Why are people so afraid to just tell someone that you need to get off the call?",
            "title_similarity": "0.66869426",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yghg2",
            "score": 1,
            "text": "But don’t you have to call back because the call was dropped? I don’t get it lol. If I don’t want to talk to my brother anymore and I hang up, he’s going to call me back right away lol",
            "title_similarity": "0.73101985",
            "sentiment_compound": 0.8338
        },
        {
            "id": "i1ygjvu",
            "score": 1,
            "text": "Or just hang up whenever you want to? Who gives a fuck who thinks what...",
            "title_similarity": "0.6786208",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i1ygv9z",
            "score": 1,
            "text": "A true master uses these tricks AND knows when they’ve been used on you.",
            "title_similarity": "0.4033885",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i1ygyse",
            "score": 1,
            "text": "Former call center employee. Can confirm.  Dont judge, I only did it to the racists.  Yeah tho, that move even got past the managers listening in on the calls.",
            "title_similarity": "0.3876289",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i1yh2f0",
            "score": 1,
            "text": " \"Are you done? Because I am!\" Click.",
            "title_similarity": "0.33930576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yhap8",
            "score": 1,
            "text": "It has to sound natural, though. There can’t be any big awkward pause before hanging up.",
            "title_similarity": "0.6820377",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i1yhcop",
            "score": 1,
            "text": "Another trick is to start crumbling up a piece of paper. It sounds like the line is breaking up.",
            "title_similarity": "0.22901319",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i1yhhpg",
            "score": 1,
            "text": "Or if it's Teams, Zoom, whatever; turn your wifi off.",
            "title_similarity": "0.47146484",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yijyl",
            "score": 1,
            "text": "\"Hey, I just got a message from my mom, I gotta go\"",
            "title_similarity": "0.49840018",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yin1v",
            "score": 1,
            "text": "That’s…..brilliant.",
            "title_similarity": "0.1291685",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yiqct",
            "score": 1,
            "text": "LPT: don’t listen to this LPT. Be honest and upfront.",
            "title_similarity": "0.6242847",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i1yitc9",
            "score": 1,
            "text": "Sadly I used to do this when I worked for a computer warranty company. Some of these people were so slow to comprehend anything I would hang up mid sentence, I got in trouble once because I didn’t call the customer back.",
            "title_similarity": "0.569095",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i1yj2lv",
            "score": 4,
            "text": "If you are stuck on a call with a salesperson, don't feel guilty about saying you aren't interested and hanging up.  The worst call a salesperson can have is a long one where they don't get a sale.  Think of it as freeing the salesperson to speak to someone else.  (And some people do need/want to speak to salespeople at times).",
            "title_similarity": "0.7243413",
            "sentiment_compound": -0.4453
        },
        {
            "id": "i1yj47j",
            "score": 1,
            "text": "And when they call back because the phone went dead and they didn't catch what you was saying?",
            "title_similarity": "0.6250613",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i1yjhxo",
            "score": 3,
            "text": "This is if you answer the phone right? The real pro tip should be how to get out of a text conversation, isn’t that how most people communicate now?",
            "title_similarity": "0.6775081",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yjohn",
            "score": 1,
            "text": "I wish I had money for a medal on this one right here.  Omg you nailed it in my industry!",
            "title_similarity": "0.3677078",
            "sentiment_compound": 0.7263
        },
        {
            "id": "i1yjt29",
            "score": 1,
            "text": "Doesn't work unless both parties want to get out of it. They will just call back.",
            "title_similarity": "0.7562667",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i1yjyk6",
            "score": 1,
            "text": "Ah yeah and they'll think that I have no network, instead of calling back in the next 5 seconds right?",
            "title_similarity": "0.5079961",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yk4md",
            "score": 1,
            "text": "“I’m sorry, I’m about to lose you because I’m about to drive into a tunnel in a canyon on an airplane while hanging up the phone.”\n\n-House",
            "title_similarity": "0.35143107",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i1yk7vy",
            "score": 1,
            "text": "Saved my life today",
            "title_similarity": "0.33036274",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i1ykgy7",
            "score": 1,
            "text": "I love this. Finally a LPT that isn't r/oddlyspecific",
            "title_similarity": "0.43463045",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i1yki5u",
            "score": 1,
            "text": "OH         MY           GOODNESS             😍",
            "title_similarity": "0.055931427",
            "sentiment_compound": 0.7739
        },
        {
            "id": "i1ykq1g",
            "score": 1,
            "text": "Less than a minute into a phone call with a colleague: \n\n\"Look, buddy, I don't even talk to my wife for this long, so bye.\"",
            "title_similarity": "0.61529845",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ykscq",
            "score": 1,
            "text": "\"That a ridiculous pro-tip. I would nev .....\"",
            "title_similarity": "0.39933395",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i1yl2s7",
            "score": 1,
            "text": "Haha I do this shit all the time. Takes some getting used to not pausing just before hanging up. Trick is to keep talking after hanging ip",
            "title_similarity": "0.5802889",
            "sentiment_compound": -0.3506
        },
        {
            "id": "i1yl3yj",
            "score": 1,
            "text": "Would do this a lot during my call centre job with angry customers",
            "title_similarity": "0.39010546",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i1ylb0z",
            "score": 1,
            "text": "I figured that out while working on call centers.",
            "title_similarity": "0.42686418",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yld20",
            "score": 1,
            "text": "This belongs in r/ShittyLifeProTips",
            "title_similarity": "0.26820666",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ylecq",
            "score": 1,
            "text": "this is more ULPT than LPT.",
            "title_similarity": "0.16107064",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yli17",
            "score": 1,
            "text": "I do this all the time.",
            "title_similarity": "0.18392843",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ylr5b",
            "score": 1,
            "text": "sneaky...I approve",
            "title_similarity": "0.23004341",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ylv01",
            "score": 1,
            "text": "LMFAO 🤣\nIDGAF and hang up at whatever point I feel like hanging up. 😁",
            "title_similarity": "0.5536663",
            "sentiment_compound": 0.9175
        },
        {
            "id": "i1ylym5",
            "score": 1,
            "text": "No the real tip is to turn your data off mid sentence and then leave it off so when they try and call back they assume you lost signal or your battery died.",
            "title_similarity": "0.6475061",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i1ym0tw",
            "score": 1,
            "text": "If I have to stop by someone's house I don't want to go to, like an extended relative, I buy a bag of ice.\n\n\"I can't stay I have ice in my car\"",
            "title_similarity": "0.43453926",
            "sentiment_compound": 0.0201
        },
        {
            "id": "i1ym4zj",
            "score": 1,
            "text": "If you don't intuitively know this you're not a very good liar",
            "title_similarity": "0.4753024",
            "sentiment_compound": -0.7352
        },
        {
            "id": "i1ym5b5",
            "score": 1,
            "text": "This is a perfect balance between this sub and /r/shittylifeprotips",
            "title_similarity": "0.32321423",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i1ymmff",
            "score": 1,
            "text": "Do this all the time",
            "title_similarity": "0.1923312",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ymw21",
            "score": 1,
            "text": "I used to do this when I was working in a restaurant and got a Karen on the other line. Right in the middle of my sentence I used to hang up and then walk away. When they called again, they would say “I was disconnected”.  By that time, I was long gone doing something else around the freezers.",
            "title_similarity": "0.44350535",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i1ynhjh",
            "score": 1,
            "text": "I've done this before, I'll absolutely do it again. Don't stay on shitty phone calls unless you have to.",
            "title_similarity": "0.7330106",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i1ynhrt",
            "score": 1,
            "text": "Yeah, I used to use this in the call center. \n\nIf QA caught it I'd be like \" the call cut, tried to call back but got no answer\" \n\nIt helped that my headset had a button I could press to hang up",
            "title_similarity": "0.62388253",
            "sentiment_compound": -0.25
        },
        {
            "id": "i1ynp7p",
            "score": 1,
            "text": "If I'm hanging up on someone, I want them to feel it https://youtu.be/qmFekwcWg3c",
            "title_similarity": "0.48359564",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i1ynxnc",
            "score": 1,
            "text": "Haha I always do this! Hate when they call back tho! I always hit that cancel and then text “idk what happened! My service is being weird”",
            "title_similarity": "0.50077134",
            "sentiment_compound": -0.6429
        },
        {
            "id": "i1ynyv8",
            "score": 1,
            "text": "They will just call you back.",
            "title_similarity": "0.59800494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yo6us",
            "score": 1,
            "text": "LPT: Don’t answer you phone and you’ll never be stuck talking to people on it.",
            "title_similarity": "0.7578509",
            "sentiment_compound": 0.1877
        },
        {
            "id": "i1yod0r",
            "score": 1,
            "text": "And they will just call you back?",
            "title_similarity": "0.58261716",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yok6t",
            "score": 1,
            "text": "How can I apply this in person? \n\nDo I just cut my throat? \n\nThey won't expect me to cut my throat to stop talking.",
            "title_similarity": "0.66227496",
            "sentiment_compound": -0.6966
        },
        {
            "id": "i1youuz",
            "score": 1,
            "text": "How about send a brb",
            "title_similarity": "0.24836427",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yoxvr",
            "score": 1,
            "text": "My goto is usually \"i gotta hit the bathroom and don't think you wanna hear this.\" You'd be surprised how quickly chatty people decide to end the call",
            "title_similarity": "0.7103565",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i1yp9ze",
            "score": 1,
            "text": "And they just call back. Kinda worthless life tip considering how easy it's circumvented",
            "title_similarity": "0.572061",
            "sentiment_compound": 0.0754
        },
        {
            "id": "i1yp9zo",
            "score": 1,
            "text": "i just hang up on people",
            "title_similarity": "0.4442851",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ypg4o",
            "score": 1,
            "text": "but then they will call back",
            "title_similarity": "0.51346564",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ypk98",
            "score": 1,
            "text": "Maybe it also works if you’re writing a comm",
            "title_similarity": "0.4167385",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ypl64",
            "score": 2,
            "text": "That’s a Costanza move right there.",
            "title_similarity": "0.22553183",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yqo0v",
            "score": 1,
            "text": "But, we can't do this more than twice to the same person. It'll backfire.",
            "title_similarity": "0.5682907",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yqoa6",
            "score": 1,
            "text": "You clearly have never spoken to my mother. Sorry, been spoken to by my mother.",
            "title_similarity": "0.4808988",
            "sentiment_compound": 0.34
        },
        {
            "id": "i1yqoja",
            "score": 1,
            "text": "This will surely help my social anxiety",
            "title_similarity": "0.40625036",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i1yqso4",
            "score": 1,
            "text": "Have another person call your phone. Then say you have to take this call",
            "title_similarity": "0.571062",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yqv2x",
            "score": 1,
            "text": "Or you start to whisper: \"knife... knife... blood... blood...\" Usually *they* hang up on you.",
            "title_similarity": "0.292319",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yqwec",
            "score": 1,
            "text": "“Wow well you know how it is I just ne-(hangup)”",
            "title_similarity": "0.3817903",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i1yr1pu",
            "score": 1,
            "text": "This is our king, and he has solved scam calls",
            "title_similarity": "0.446805",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i1yr6xv",
            "score": 1,
            "text": "When r/lifeprotips and r/unethicallifeprotips collide",
            "title_similarity": "0.32426852",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i1yrh89",
            "score": 1,
            "text": "Turn off the cellular signal on your iPhone during a call and the other person will get a “call failed” notification.",
            "title_similarity": "0.585937",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ys3om",
            "score": 1,
            "text": "\"Yeah I agree and I think we should, um .... uh ... *beep*.\"",
            "title_similarity": "0.36492223",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i1ys81e",
            "score": 1,
            "text": "I've done this. It works beautifully.",
            "title_similarity": "0.2179195",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i1ysdje",
            "score": 1,
            "text": "I guess I’m the only one that says “this is not relevant to me” and drops off",
            "title_similarity": "0.6002758",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ysels",
            "score": 1,
            "text": "And then they call you again...",
            "title_similarity": "0.45108342",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yskpb",
            "score": 1,
            "text": "I used this when I'm stuck on a call but my shift is over",
            "title_similarity": "0.58694196",
            "sentiment_compound": -0.128
        },
        {
            "id": "i1yt5k8",
            "score": 1,
            "text": "Then turn off your phone immediately so that when they try calling back they can't get through.\n\nMore fully supports the \"glitch\" story. Say phone went into reboot cycle or something.",
            "title_similarity": "0.60651875",
            "sentiment_compound": 0.4716
        },
        {
            "id": "i1ytbqw",
            "score": 1,
            "text": "To add to OP: keep muting yourself to simulate your signal or battery going out then do a final mute, hold for like 4 seconds and then hang up. \n\nNow you don’t have to call that person back. Battery is out.",
            "title_similarity": "0.67708135",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1yth0k",
            "score": 1,
            "text": "\"I'm sorry, I have to go return some videotapes\"",
            "title_similarity": "0.35185757",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i1ytmzb",
            "score": 1,
            "text": "Or the alternative \"I'm about to lose you. I'm going through a tunnel, in a canyon, on an airplane, while hanging up on you.\"",
            "title_similarity": "0.30487955",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i1ytyt3",
            "score": 1,
            "text": "Having small kids is an excellent excuse. \"I gotta go, the kids are fighting\". \"Gotta go, one of the kids got hurt\".",
            "title_similarity": "0.32754865",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i1ytzcu",
            "score": 1,
            "text": "Belongs in r/ULPT",
            "title_similarity": "0.22985779",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yu0el",
            "score": 1,
            "text": "Why are there so many LPTs on this sub that involve avoiding confrontation and leaving the other person guessing? Just be an adult about it and say you have to go. It's pretty damned disrespectful to have the other person waste their time trying to reconnect with you to figure out \"what went wrong\".",
            "title_similarity": "0.67911804",
            "sentiment_compound": -0.8402
        },
        {
            "id": "i1yu2oo",
            "score": 1,
            "text": "Or just finish the damn call like a real person because you are the one who freaking answered the call in the first place. Good grief!",
            "title_similarity": "0.6251733",
            "sentiment_compound": -0.5562
        },
        {
            "id": "i1yu4gz",
            "score": 1,
            "text": "This is how I got through 5 years of call center work.",
            "title_similarity": "0.16067079",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yuav8",
            "score": 1,
            "text": "“So basically what I was thinking wa-“",
            "title_similarity": "0.31250012",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yuc1n",
            "score": 1,
            "text": "I don't know what fantasy world you live in OP but I'll have you know, I accidentally hang up on myself in a MS Teams call on a weekly basis at minimum.",
            "title_similarity": "0.42986456",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i1yuetp",
            "score": 1,
            "text": "but you see the problem is its usually THEM DOIN ALL THE TALKING",
            "title_similarity": "0.5061041",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i1yugmz",
            "score": 1,
            "text": "If you turn off your Data while In a call it’ll just tell them call failed or disconnected",
            "title_similarity": "0.61077285",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i1yuhgv",
            "score": 1,
            "text": "I turn on/off the \"mute\" function a few times before hanging up. In my head it seems like the phone was actually having a connection issue. \n\nBut this works too.",
            "title_similarity": "0.6243733",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i1yuq47",
            "score": 1,
            "text": "I used to work in a call center and I did this all of the time. Never got caught because I always cut myself off mid sentence.",
            "title_similarity": "0.56780607",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i1yurgt",
            "score": 1,
            "text": "I'm turtling here, gotta go....",
            "title_similarity": "0.41139615",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yv5m5",
            "score": 1,
            "text": "That's very, very creative and you're absolutely right!",
            "title_similarity": "0.21555282",
            "sentiment_compound": 0.5808
        },
        {
            "id": "i1yvboq",
            "score": 1,
            "text": "Ffs. If you're an adult, you don't have to lie. Just say the truth. If you have something else you need to do, tell them that you need to do something else. If you don't feel like talking, tell them. Don't lie.",
            "title_similarity": "0.7540885",
            "sentiment_compound": -0.5588
        },
        {
            "id": "i1yvi9o",
            "score": 1,
            "text": "I used to do this in World of Warcraft all the time. I'd just shut my router off, switch everything to appear offline and then do something else.\n\nRaiding could get really frustrating...",
            "title_similarity": "0.41646877",
            "sentiment_compound": -0.5709
        },
        {
            "id": "i1yvzw3",
            "score": 1,
            "text": "I used to do this all the time when I worked at a call center. It worked 100 % of the time.",
            "title_similarity": "0.28123605",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yw3xd",
            "score": 1,
            "text": "This feels like an unethical life pro tip",
            "title_similarity": "0.40984344",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i1yw5dx",
            "score": 1,
            "text": "Works: EVERY. SINGLE. TIME.",
            "title_similarity": "0.31951982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ywhiu",
            "score": 1,
            "text": "I have done this.",
            "title_similarity": "0.15987486",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1ywi1m",
            "score": 1,
            "text": "\"hey I gotta jump\"\n\nWhat does it mean no idea but always works.",
            "title_similarity": "0.39778566",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i1ywv8l",
            "score": 1,
            "text": "Fuck I have been doing this for years",
            "title_similarity": "0.1415245",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i1yxapb",
            "score": 1,
            "text": "This is how I got fired from a job",
            "title_similarity": "0.40272155",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i1yxbic",
            "score": 1,
            "text": "Funny, I've had 3 people pull this today now.",
            "title_similarity": "0.25664392",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1yxh4m",
            "score": 1,
            "text": "Or just be a fucking adult",
            "title_similarity": "0.3699177",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yxkit",
            "score": 1,
            "text": "Why would I care what they think?",
            "title_similarity": "0.44531164",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i1yxyek",
            "score": 1,
            "text": "Beautiful to see someone giving the real life saving tips",
            "title_similarity": "0.3820213",
            "sentiment_compound": 0.743
        },
        {
            "id": "i1yy4vo",
            "score": 1,
            "text": "I've been doing this for years lmao. Never with a friend, of course, but sometimes I'll pull it out for a telemarketer or what-have-you",
            "title_similarity": "0.5175403",
            "sentiment_compound": 0.162
        },
        {
            "id": "i1yykwh",
            "score": 1,
            "text": "Just knock on the counter and say Chinese food",
            "title_similarity": "0.29279172",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yylbu",
            "score": 1,
            "text": "Unless your company has a way to track if the phone was disconnected by you.",
            "title_similarity": "0.6380861",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yyn2f",
            "score": 1,
            "text": "Ha. I read this as “stuck being on-call.” I was looking forward to some tips for not getting called into work!",
            "title_similarity": "0.7162359",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1yysr4",
            "score": 1,
            "text": "I have very low battery but let me fill you in on what's going o....",
            "title_similarity": "0.47841108",
            "sentiment_compound": -0.177
        },
        {
            "id": "i1yz02i",
            "score": 1,
            "text": "I hang up on them (whenever), call back super offended and suspicious of them, and then I hang up on them again lmao.",
            "title_similarity": "0.4936119",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i1yz4e8",
            "score": 1,
            "text": "I use the \"mute\" button while I'm taking to the prick, then I hang up, works every time.",
            "title_similarity": "0.57060313",
            "sentiment_compound": -0.34
        },
        {
            "id": "i1yzibv",
            "score": 1,
            "text": "I used to do this shit all the time lol.",
            "title_similarity": "0.27404496",
            "sentiment_compound": -0.3506
        },
        {
            "id": "i1yzle0",
            "score": 1,
            "text": "I work in sales, and if this happens to me I just call back.  If they don't answer I'll leave a voicemail and keep reaching out.  You're better off just telling them your not interested, and to remove you from their list.",
            "title_similarity": "0.7300986",
            "sentiment_compound": 0.3798
        },
        {
            "id": "i1yzyvp",
            "score": 1,
            "text": "I’ve been doing this for as long as I can remember",
            "title_similarity": "0.211991",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z00cf",
            "score": 1,
            "text": "LTP: If you have kids and get busted watching a video on your phone via the audio you can say \"Hey, I'm in a meeting can you...(mute)\" then they will assume a kid walked up with a tablet or something.",
            "title_similarity": "0.47672468",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z0217",
            "score": 1,
            "text": "I mean once they play back 20 calls of you cutting out mid-sentence, even the dumbest manager will figure it out.",
            "title_similarity": "0.3639336",
            "sentiment_compound": -0.34
        },
        {
            "id": "i1z0996",
            "score": 1,
            "text": "Dude... you gave up my secret weapon",
            "title_similarity": "0.51857674",
            "sentiment_compound": -0.296
        },
        {
            "id": "i1z0efd",
            "score": 1,
            "text": "do this all the time.  why are you telling people about this!?!?!",
            "title_similarity": "0.37498015",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z0i7i",
            "score": 1,
            "text": "Unless they, too, have read this post.",
            "title_similarity": "0.43832374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z0vh3",
            "score": 1,
            "text": "This is change my life !!!!!!!!",
            "title_similarity": "0.24336739",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z12ne",
            "score": 1,
            "text": "Yeah, i remember one time i was speaking with this guy on the phone and i said to m",
            "title_similarity": "0.47349",
            "sentiment_compound": 0.296
        },
        {
            "id": "i1z175t",
            "score": 1,
            "text": "\"Call over, have an adequate day.\"\n\n*click*",
            "title_similarity": "0.4940251",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i1z1cc2",
            "score": 1,
            "text": "When my father can’t get my babbling aunt off the phone, he calls her from his other phone with his number blocked. She always says she has another call and he says something like, “Well I gotta go low anyway, talk to you later!”",
            "title_similarity": "0.64920956",
            "sentiment_compound": -0.1759
        },
        {
            "id": "i1z1cf5",
            "score": 1,
            "text": "Is there anyone who doesn't do this?",
            "title_similarity": "0.43150717",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z1mja",
            "score": 1,
            "text": "Was this meant for r/shittylifeprotips? The life pro tip is grow the fuck up and learn how to disengage from conversations you don’t want to have instead of faking bad reception. This is pathetic",
            "title_similarity": "0.59917605",
            "sentiment_compound": -0.9217
        },
        {
            "id": "i1z1q0o",
            "score": 1,
            "text": "Dumbest shit I’ve read in a while, this",
            "title_similarity": "0.34125528",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i1z29ld",
            "score": 1,
            "text": "“Sorry to interrupt but something came up and I got to go. Bye.” *hang up*\n\nUnless you’re turning your phone off this LPT is just going to make your social anxiety worse as you watch them try to call you back and then inevitably end up being asked why you disconnected and didn’t try to return their call later.",
            "title_similarity": "0.7289322",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i1z29th",
            "score": 1,
            "text": "Thank you OP. I’ll be using this from now on.",
            "title_similarity": "0.4676578",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1z2g4s",
            "score": 1,
            "text": "Just out of curiosity...does OP work for NET10?",
            "title_similarity": "0.37797323",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z2lh5",
            "score": 1,
            "text": "I work for an IT service desk at a large corporation serving internal employees only. Def have pulled this one more times than I'd like to admit...   \n\n\nThere's only so many times you can tell someone how to open an internet browser before it becomes infuriating.",
            "title_similarity": "0.39046746",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i1z2qzm",
            "score": 1,
            "text": "Yes, childish passive aggressive tactics are definitely good for your mental health...",
            "title_similarity": "0.399536",
            "sentiment_compound": 0.743
        },
        {
            "id": "i1z3ak0",
            "score": 1,
            "text": "I tried this but the police just showed up at my door",
            "title_similarity": "0.4353259",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z3h52",
            "score": 1,
            "text": "I do this so often",
            "title_similarity": "0.09901804",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z4b1b",
            "score": 1,
            "text": "Wow, this is ACTUALLY a good LPT that I will use",
            "title_similarity": "0.32469776",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i1z4bpz",
            "score": 1,
            "text": "Shady and unethical, yet seems effective",
            "title_similarity": "0.39754716",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i1z4mcw",
            "score": 1,
            "text": "Years ago, if I was at home, I'd ring my own doorbell. Gotta go, someone at the door.",
            "title_similarity": "0.4376595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z4za0",
            "score": 1,
            "text": "or just tell you need to shit",
            "title_similarity": "0.4466672",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i1z52in",
            "score": 1,
            "text": "But then they’ll call back wondering what happened or next time they see you you’ll have to come up with some lame excuse",
            "title_similarity": "0.63659424",
            "sentiment_compound": -0.5023
        },
        {
            "id": "i1z56g9",
            "score": 1,
            "text": "I feel like most calls I don't want to be on are ones where they won't let me get a word in though, haha",
            "title_similarity": "0.6615083",
            "sentiment_compound": 0.646
        },
        {
            "id": "i1z5s5y",
            "score": 1,
            "text": "I just don’t answer the phone if it’s someone I don’t feel like talking to.",
            "title_similarity": "0.62240726",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1z5uq4",
            "score": 1,
            "text": "Ask ‘what’s good looking & hangs up?’",
            "title_similarity": "0.38379407",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1z6k9q",
            "score": 1,
            "text": "This is so fucking stupid god why is it on the front page.",
            "title_similarity": "0.28913006",
            "sentiment_compound": -0.3246
        },
        {
            "id": "i1z6ufh",
            "score": 1,
            "text": "OLDEST TRICK IN DA BOOK....WORKS!",
            "title_similarity": "0.33043808",
            "sentiment_compound": -0.126
        },
        {
            "id": "i1z6ugi",
            "score": 1,
            "text": "I just usual cut them off right from the start. Don't want it, don't need it, don't care about your unsolicited spam call. Clcik. I don't feel like I owe them the pleasantries of conversation.",
            "title_similarity": "0.7856698",
            "sentiment_compound": -0.7399
        },
        {
            "id": "i1z77cr",
            "score": 1,
            "text": "Just yell \"OH SHIT\" and turn off your phone. EZ",
            "title_similarity": "0.4482172",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i1z7n6h",
            "score": 1,
            "text": "Shouldn’t this be on the unethical pro tips lol.",
            "title_similarity": "0.44888106",
            "sentiment_compound": -0.128
        },
        {
            "id": "i1z7v0p",
            "score": 1,
            "text": "Do they still have the background sounds on google?  Nothing like a code blue alert,and the sound of  nurses running , to and a phone call.",
            "title_similarity": "0.47322065",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i1z7wnc",
            "score": 1,
            "text": "Or you could just be a mature adult and say \"I have to go\" and end the conversation. I've never figured out why this is so hard. One advantage of being an introvert maybe?",
            "title_similarity": "0.6743208",
            "sentiment_compound": 0.4935
        },
        {
            "id": "i1z7x0f",
            "score": 1,
            "text": "Probably the best tip I've ever seen",
            "title_similarity": "0.29877806",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i1z87ls",
            "score": 1,
            "text": "Yo guys are so behind",
            "title_similarity": "0.3692093",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z8ekj",
            "score": 1,
            "text": "\"Have you ever heard of an Irish Goodbye?\"\n\n\"No, what's-\"\n\n*Click*\n\nNow you left and made a joke.",
            "title_similarity": "0.47684193",
            "sentiment_compound": 0.296
        },
        {
            "id": "i1z9odq",
            "score": 1,
            "text": "Just hit them with a, “This is the sound of me hanging up right now”.",
            "title_similarity": "0.48968086",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1z9qn9",
            "score": 1,
            "text": "My excuse was always that I gotta go to the bathroom.  Any arguments against will just be rebutted with \"I don't like talking on the shitter\"",
            "title_similarity": "0.56998426",
            "sentiment_compound": -0.5439
        },
        {
            "id": "i1z9uyl",
            "score": 1,
            "text": "Unethical, but sure",
            "title_similarity": "0.33299214",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i1za3py",
            "score": 1,
            "text": "If I'm on a call that I don't want to be on I'm not doing any talking. If you're listening I'm all good.",
            "title_similarity": "0.8514926",
            "sentiment_compound": 0.3975
        },
        {
            "id": "i1za5ez",
            "score": 1,
            "text": "Battery dead. Also say that you were talking for two minutes without noticing for further distraction.",
            "title_similarity": "0.50451523",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i1zaa11",
            "score": 1,
            "text": "Oh my god why did I never think of this?! My coworkers don’t stand a chance now.",
            "title_similarity": "0.616956",
            "sentiment_compound": 0.5255
        },
        {
            "id": "i1zaeld",
            "score": 1,
            "text": "OMG.  This changes everything!",
            "title_similarity": "0.1864315",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zahsu",
            "score": 1,
            "text": "I used this at the call center a lot. Good times.",
            "title_similarity": "0.2908405",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1zaih6",
            "score": 1,
            "text": "Damn I do this all the time.. Back when we had landlines, id use a peppermint wrapper to create \"static\" and then hang up lol",
            "title_similarity": "0.28808993",
            "sentiment_compound": 0.296
        },
        {
            "id": "i1zanlb",
            "score": 1,
            "text": "They'll call back......",
            "title_similarity": "0.5210649",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zaoov",
            "score": 1,
            "text": "When you hang up the phone sauté call ended. When a call drops out it says call failed.",
            "title_similarity": "0.6378021",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i1zayi6",
            "score": 1,
            "text": "I do this all the time",
            "title_similarity": "0.17098032",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zb3z5",
            "score": 1,
            "text": "That's great until they call you back...",
            "title_similarity": "0.5770613",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i1zbc5b",
            "score": 1,
            "text": "Or, you say something like, \"Well... it's been great chatting with you, but I really have to go now.\"  And if they still keep talking, you say something like, \"No, really Steve. I have to go. I'm hanging up now. Bye.\" And then you hang up.\n\nYou can be completely polite while still ending a call on your own terms. You know, like an adult.",
            "title_similarity": "0.7456064",
            "sentiment_compound": 0.8847
        },
        {
            "id": "i1zcft4",
            "score": 1,
            "text": "LPT: just start moaning, louder and louder until you are screaming your own name, and then fake (... or not I don't judge) orgasm, drop the phone on a bed or couch and return a few minutes later to pick it up",
            "title_similarity": "0.40367553",
            "sentiment_compound": -0.647
        },
        {
            "id": "i1zcsk8",
            "score": 1,
            "text": "\"Oh crap, the contractor for (urgent home repair issue) is here. I need to go let him in and show him the 'problem'.\"\n\nWorks well. I have used it before.",
            "title_similarity": "0.47790015",
            "sentiment_compound": -0.34
        },
        {
            "id": "i1zcw6o",
            "score": 1,
            "text": "I do this when someone invites me to a party chat and im done talking to them lol, \"shit man, my internet went off ill play with you later\"",
            "title_similarity": "0.47539192",
            "sentiment_compound": 0.128
        },
        {
            "id": "i1zd45i",
            "score": 1,
            "text": "I used to work in a call centre and I would do this to asshole customers. The more irate or obnoxious someone was, the more sickly sweet and annoyingly joyous I would be and I'd often cut the call off while I was in the midst of speaking ever so nicely and then call back and oh so politely apologise for the fact we seemed to have gotten cut off.",
            "title_similarity": "0.49646533",
            "sentiment_compound": 0.5173
        },
        {
            "id": "i1zdjvn",
            "score": 1,
            "text": "Me, as a help desk engineer: \"Yeah, of course. We can help you fix this problem in just a few seconds. Here, let me take control of your computer. Ok, so I'm going to just open the settings app here and I wi--\"\n\n*hangs up*\n\nI'm just kidding. I clean poop for a living",
            "title_similarity": "0.43345094",
            "sentiment_compound": 0.7632
        },
        {
            "id": "i1ze6jz",
            "score": 1,
            "text": "This is *spicy* and I like it",
            "title_similarity": "0.17035976",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1zeaj5",
            "score": 1,
            "text": "Sorry, I have to let you go so that I can wipe my ass, I can feel it starting to get a bit of a rash from the poop residue.",
            "title_similarity": "0.41825515",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i1zels2",
            "score": 1,
            "text": "\"He just hung up on me mid sentence\"",
            "title_similarity": "0.50915325",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i1zemz3",
            "score": 1,
            "text": "Make sure that the call is hung up before you sigh and say, \"Thank God for that.\"",
            "title_similarity": "0.7165121",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i1zewkm",
            "score": 1,
            "text": "Speaking of calls, isn't there an app to schedule a call to yourself?",
            "title_similarity": "0.57413256",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zexmv",
            "score": 1,
            "text": "My old roommate used to do this when he was a call center guy for Comcast. I think now a days, they can tell who ended the call though.",
            "title_similarity": "0.50612485",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zf2sf",
            "score": 1,
            "text": "Do you think they won't be expecting you to call back in and finish your thought? What a stupid idea.",
            "title_similarity": "0.6673534",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i1zgn8y",
            "score": 1,
            "text": "I mean I avoid the situation by not picking the phone up at all and if they want to talk to me they can leave a voicemail",
            "title_similarity": "0.71516395",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i1zhdus",
            "score": 1,
            "text": "It's really easy to check logs and see where a disconnect came from.",
            "title_similarity": "0.37936878",
            "sentiment_compound": 0.4927
        },
        {
            "id": "i1zhfvz",
            "score": 1,
            "text": "They'll just think you are clumsy and you dropped the phone.",
            "title_similarity": "0.5058016",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zib67",
            "score": 1,
            "text": "I've done this.  They just ring you back.",
            "title_similarity": "0.46847618",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zisia",
            "score": 1,
            "text": "Mention at the top of the call that your phone is dying and you can't access a charger at the moment, then when you hang up they think your phone just died",
            "title_similarity": "0.57430804",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i1ziwwn",
            "score": 1,
            "text": "Bravo, sir. I'm seriously going to use this a lot from here on out.",
            "title_similarity": "0.29872528",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i1zix4c",
            "score": 1,
            "text": "28.8k people will now",
            "title_similarity": "0.2229644",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zj8p0",
            "score": 1,
            "text": "Well NOW they will!  😀",
            "title_similarity": "0.2630508",
            "sentiment_compound": 0.5983
        },
        {
            "id": "i1zjv8l",
            "score": 1,
            "text": "“Can you hear me now? Hello?” Hang up",
            "title_similarity": "0.569489",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zk5vu",
            "score": 1,
            "text": "A better option is to turn off your Wi-Fi or cell service. Works every time.",
            "title_similarity": "0.53525484",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i1zkc0g",
            "score": 1,
            "text": "But then they’ll call you back?",
            "title_similarity": "0.57159865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zl7bp",
            "score": 1,
            "text": "I used to do this occasionally at my call center job, and advised my husband of this strategy for his phone job.",
            "title_similarity": "0.47742438",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zlsir",
            "score": 1,
            "text": "Back in the days of working in person, I’d get folks who would just pop into my office and start talking. I’d casually send an IM to a coworker with my 4 digit extension. She knew if she got a message of “1234” she needed to call me asap. \n\nThe phone would ring, “oh I need to get this!” \n\nI pick up, fake a convo, and on the way out, cover the receiver, “this will be a minute, mind closing the door on your way out?”\n\nPretty elaborate method for getting rid of long talkers.",
            "title_similarity": "0.58448243",
            "sentiment_compound": 0.2714
        },
        {
            "id": "i1zltcs",
            "score": 1,
            "text": "Lol I do this all the time",
            "title_similarity": "0.18760082",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i1zmdfk",
            "score": 1,
            "text": "Just mute your end at any point. They will \"helllllloooo?\" for a few seconds and then hang up all on their own?",
            "title_similarity": "0.5985866",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zme7o",
            "score": 1,
            "text": "I always just dropped my phone on the bed or quickly hung up and pretended there was an emergency I had to attend to or I’d felt sick lol",
            "title_similarity": "0.4850949",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i1zmkkp",
            "score": 1,
            "text": "Just say that your battery is low and it's about to run out and hang up after 5-10s.",
            "title_similarity": "0.4289432",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i1zmvln",
            "score": 1,
            "text": "No one expects the self hang up",
            "title_similarity": "0.6176467",
            "sentiment_compound": -0.296
        },
        {
            "id": "i1zmxdt",
            "score": 1,
            "text": "Can only do this once. Spend it wisely.",
            "title_similarity": "0.5682896",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i1zn0dr",
            "score": 1,
            "text": "Been doing this since I had a Razr lol",
            "title_similarity": "0.23612137",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i1zobmy",
            "score": 1,
            "text": "Oh, if only those McLeodUSA customers knew how many times I did this. I feel bad now that I have to wait in 15-30 mins ques to talk to the phone company, but in my defense I was 20 and stupid and selfish and I just didn’t wanna.",
            "title_similarity": "0.4814338",
            "sentiment_compound": -0.882
        },
        {
            "id": "i1zoph9",
            "score": 1,
            "text": "This is a life pro tip coming from a psychopath because I could never do hang up before I finish my thought. Or am I the psychopath?",
            "title_similarity": "0.61386645",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zote5",
            "score": 1,
            "text": "Stop giving away introvert secrets, the normal people will figure it out and make us talk and interact....ew",
            "title_similarity": "0.63591695",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i1zp856",
            "score": 1,
            "text": "The trick I use in the call center when someone is cursing me out and I want to make it seem like the call dropped lol",
            "title_similarity": "0.5810709",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i1zp9zq",
            "score": 1,
            "text": "To make it seem like I’m losing service, while I am talking I click the mute button on and off. Then I hang up.",
            "title_similarity": "0.5704111",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i1zqenj",
            "score": 1,
            "text": "I do this all the ti",
            "title_similarity": "0.21287674",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zqfnh",
            "score": 1,
            "text": "I've done this so many times",
            "title_similarity": "0.05091074",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zqkgd",
            "score": 3,
            "text": "Why do we have to BS each other through life?  If you don't want to be on the call, then why are you on it in the first place?  If you find yourself there and you don't want to be, tell the person you don't want to be on the call, so you're going to hang up now.\n\nIt's really not that hard, people.",
            "title_similarity": "0.8460983",
            "sentiment_compound": -0.1195
        },
        {
            "id": "i1zqlh2",
            "score": 1,
            "text": "Usually if I’m stuck it’s because the other person won’t shut up.",
            "title_similarity": "0.5760512",
            "sentiment_compound": -0.25
        },
        {
            "id": "i1zr319",
            "score": 1,
            "text": "I learned this hanging up on yourself trick 40 years ago in a management class at the hospital where I worked. Old news.",
            "title_similarity": "0.29031408",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i1zs6m8",
            "score": 1,
            "text": "This used to work like a charm when the end call button wasn't literally pressed to my cheek. it's conversations like this that make me his old handset style phones, i mean, did you eve-",
            "title_similarity": "0.58239377",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i1zs9cn",
            "score": 1,
            "text": "Ooooh, taking note of this trick. Moving up to a manager role. I fear this will be useful with some people who rant…",
            "title_similarity": "0.48184133",
            "sentiment_compound": -0.1406
        },
        {
            "id": "i1zsfwk",
            "score": 1,
            "text": "Mastodon hunting",
            "title_similarity": "0.07907343",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zszk7",
            "score": 1,
            "text": "Best tip I've seen in a while",
            "title_similarity": "0.35747817",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i1zton1",
            "score": 1,
            "text": "I've done this and it's absolutely wonderful. Glad to know it's not just me who thought this was a brilliant idea LOL.",
            "title_similarity": "0.37434453",
            "sentiment_compound": 0.9393
        },
        {
            "id": "i1zu3zk",
            "score": 1,
            "text": "Gotta give ‘em a preemptive “Hey, apologies in advance if I drop, my phone just told me it has about 10% left.” Then even less sus and you won’t be expected to call back immediately.",
            "title_similarity": "0.5226943",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i1zud55",
            "score": 1,
            "text": "And if you are approaching or getting approached by someone you don't want to talk to, pretend to be on the phone and have a tense conversation with yourself. So far it's worked for me.",
            "title_similarity": "0.7925173",
            "sentiment_compound": -0.4628
        },
        {
            "id": "i1zuez3",
            "score": 1,
            "text": "Cut it while you're talking so you can bring anxiety to their table:\n\n\"So yeah, in glad to talk to you because you won't believe what I saw lose to your house!\" -hangs up",
            "title_similarity": "0.64500237",
            "sentiment_compound": -0.1511
        },
        {
            "id": "i1zuf7x",
            "score": 1,
            "text": "Ok but then they'll call you back?",
            "title_similarity": "0.5681503",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i1zujv9",
            "score": 1,
            "text": "My go to is “sorry can I call you back later my doctor is calling” no one ever",
            "title_similarity": "0.6753094",
            "sentiment_compound": -0.296
        },
        {
            "id": "i1zulsd",
            "score": 1,
            "text": "What I do is say, “can you hold on for a sec?” then just put the phone down for 1 or 2 minutes. Get back on, continue the conversation for a few minutes. Repeat. The person will eventually end the call after a few rounds of this.",
            "title_similarity": "0.55384904",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zvhco",
            "score": 1,
            "text": "When you do this it’s usually the signal to call back… ‘oh seems like that call just cut out there anyways what were you saying’",
            "title_similarity": "0.615196",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i1zvi8z",
            "score": 1,
            "text": "I prefer the classic \"He......llo... c..an..you...\\*ghrr ghrr\\*.. tunnel \\*ghrr\\* \\*hangup\\*\"",
            "title_similarity": "0.36006445",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zvprv",
            "score": 1,
            "text": "Then what? Smash your phone and leave the country?",
            "title_similarity": "0.34354234",
            "sentiment_compound": -0.1431
        },
        {
            "id": "i1zvsl1",
            "score": 1,
            "text": "I do this constantly",
            "title_similarity": "0.16306603",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zvtgu",
            "score": 1,
            "text": "Holy shit. Its like most people are either to delicate to handle the truth or too scared to tell somebody the truth. Don't play games. Just say you have to go and say goodbye.",
            "title_similarity": "0.6969097",
            "sentiment_compound": -0.304
        },
        {
            "id": "i1zvx40",
            "score": 1,
            "text": "There is a land called Passive Agressiva and you are its queen.",
            "title_similarity": "0.29563224",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i1zvyjw",
            "score": 1,
            "text": "\\*remembers this for while on the phone with a rude customer\\*",
            "title_similarity": "0.58087945",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i1zwdiw",
            "score": 1,
            "text": "Or just say, “hey, by the way, can you believe this weather we’re having?”\nOnce a conversation turns to the weather, you’ll be done talking within minutes.",
            "title_similarity": "0.5338256",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zwnz8",
            "score": 1,
            "text": "Has anyone ever done this? I want to confirm this genius before attempting it myself",
            "title_similarity": "0.42931682",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i1zwu0c",
            "score": 1,
            "text": "Hahahha done that. Works great ✅",
            "title_similarity": "0.19520588",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i1zxya2",
            "score": 1,
            "text": "\"And by way of closing, fuck you all.\" \\*click*",
            "title_similarity": "0.4023226",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i1zy1g8",
            "score": 1,
            "text": "You can double down on this by saying “why did you hang up on me?” The next time you talk to them.",
            "title_similarity": "0.56399125",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zyfxh",
            "score": 1,
            "text": "I usually just hang up.",
            "title_similarity": "0.43996036",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zykxc",
            "score": 1,
            "text": "If there’s someone I don’t want to talk to, I just don’t take the call. And if you didn’t expect the call to\nGo long just say “hey I’m so sorry to cut you off but I really have to get going.”  \n\nSocial skills aren’t rocket science.",
            "title_similarity": "0.7904264",
            "sentiment_compound": -0.2269
        },
        {
            "id": "i1zyp2f",
            "score": 1,
            "text": "I used to work at a hotel as a valet overnight. The maintenance guy was a hostage talker so I would frequently text the front desk guy to call the valet phone for a \"guest request\"",
            "title_similarity": "0.47252095",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zyqkd",
            "score": 1,
            "text": "Stop giving away the secrets!!! This is a great one!",
            "title_similarity": "0.48673493",
            "sentiment_compound": 0.7556
        },
        {
            "id": "i1zyzk7",
            "score": 1,
            "text": "I thought this was r/callcentres",
            "title_similarity": "0.35093573",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zzhqi",
            "score": 1,
            "text": "Uh huh.. and then they call you back ‘you got cut off! What were you saying?’",
            "title_similarity": "0.55483043",
            "sentiment_compound": -0.3382
        },
        {
            "id": "i1zznwq",
            "score": 1,
            "text": "I do this when I get tough questions on zoom calls.",
            "title_similarity": "0.4062091",
            "sentiment_compound": -0.128
        },
        {
            "id": "i1zzrpv",
            "score": 1,
            "text": "That's a shitty tip.",
            "title_similarity": "0.29828125",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i1zzt6y",
            "score": 1,
            "text": "or you know, just hang up",
            "title_similarity": "0.50554717",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1zzyuw",
            "score": 1,
            "text": "Not really helpful for ppl working in call centre where you're not allowed to hang up and all of your calls are recorded and monitored",
            "title_similarity": "0.6376747",
            "sentiment_compound": -0.3713
        },
        {
            "id": "i200q3d",
            "score": 1,
            "text": "We’ve had this LPT quite often…\n\nThe verdict is that you should turn off your signal from settings.\n\nAdd to that ‘mid sentence’",
            "title_similarity": "0.4861634",
            "sentiment_compound": 0.2177
        },
        {
            "id": "i200tyk",
            "score": 1,
            "text": "“Did he just hang up in the middle of talking?”\n\n“He did.”\n\n“Does he think I’m an idiot?”\n\n“He would have to.”",
            "title_similarity": "0.6144062",
            "sentiment_compound": 0.0
        },
        {
            "id": "i200zd8",
            "score": 1,
            "text": "I have done this many times and it always works flawlessly",
            "title_similarity": "0.20705073",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i201a9p",
            "score": 1,
            "text": "Yeah great idea for all the dudes with bad social skills. Keep it up!",
            "title_similarity": "0.37931252",
            "sentiment_compound": 0.4753
        },
        {
            "id": "i201gat",
            "score": 1,
            "text": "Just say you are about to use the bathroom",
            "title_similarity": "0.35500228",
            "sentiment_compound": 0.0
        },
        {
            "id": "i201k63",
            "score": 1,
            "text": "u just blew my mind",
            "title_similarity": "0.36728275",
            "sentiment_compound": 0.0
        },
        {
            "id": "i201ye0",
            "score": 1,
            "text": "DO NOT PAUSE BEFORE YOU CLICK. They’ll know. You’ll know they know. Dont hover you’re finger over the button before doing it. Just hit the power button. So much easier and if they try to call again it’ll go to voicemail. Win win",
            "title_similarity": "0.7372232",
            "sentiment_compound": 0.8928
        },
        {
            "id": "i2024pd",
            "score": 1,
            "text": "Little does anyone know, I've been doing this for years.",
            "title_similarity": "0.26363105",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2025nh",
            "score": 1,
            "text": "If you switch the phone to air plane mood while on call, it makes the sound when a call drops.. and even says “call lost” or “signal lost” on the other end.. \n\nI use to do this to my boss..",
            "title_similarity": "0.62656665",
            "sentiment_compound": 0.0
        },
        {
            "id": "i202e3j",
            "score": 1,
            "text": "I had a friend that used to call me late every single night and give me what were basically history lectures on explorers from the 1800’s. I didn’t get a chance to talk for the whole two hours! Eventually I just started hanging the phone up and saying the battery died. After a while I just stopped answering",
            "title_similarity": "0.38514215",
            "sentiment_compound": -0.1511
        },
        {
            "id": "i202wk5",
            "score": 1,
            "text": "“Hello? HELLO? HELLO?!”\n \n*Click*",
            "title_similarity": "0.2662479",
            "sentiment_compound": 0.0
        },
        {
            "id": "i203ibr",
            "score": 1,
            "text": "Yeah but that leaves room for call backs.\n\nInstead I just cut them off mid sentence with: \"Oh my mom's calling me let me take this, we'll talk later.\" *click*\n\nNo one will deny you answering your mom lol",
            "title_similarity": "0.72025704",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2041mf",
            "score": 1,
            "text": "Back when removable batteries were a thing in cell phones (remember those relics?) I would just pull the battery on the phone that way if they tried to reconnect the call it went straight to voicemail, corroborating the idea that \"my phone died\" the next time I spoke to/texted them.",
            "title_similarity": "0.5802312",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i204e5e",
            "score": 1,
            "text": "just started watching Space Force\n\nSteve Carell doesn't want to take a phone call so he picks up and goes \"I just gotta warn you, my battery is low so I might lose you *hangs up*\"",
            "title_similarity": "0.5872593",
            "sentiment_compound": -0.6894
        },
        {
            "id": "i204esx",
            "score": 1,
            "text": "\"Oh yea I never thought it that and guess what\"\n\n*click*",
            "title_similarity": "0.49370724",
            "sentiment_compound": 0.0
        },
        {
            "id": "i204lom",
            "score": 1,
            "text": "Been doing this for years.",
            "title_similarity": "0.13184372",
            "sentiment_compound": 0.0
        },
        {
            "id": "i204x95",
            "score": 1,
            "text": "Just ring you own doorbell if you are at home and tell the person you need to answer the door. Thats what my grandma does.",
            "title_similarity": "0.41881236",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2050wy",
            "score": 1,
            "text": "An apartment I lived in had a fire buzzer that made a simple one-frequency tone. So I bought a little device that musicians use to tune their instruments and found the exact frequency of my buzzer.  \n  \nI just left it at that setting and kept it right by the house phone (Yes I had fallen off my dinosaur earlier that day).",
            "title_similarity": "0.39279777",
            "sentiment_compound": -0.296
        },
        {
            "id": "i206vxr",
            "score": 1,
            "text": "next on curb your enthusiasm",
            "title_similarity": "0.45696136",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i206zrt",
            "score": 1,
            "text": "Except the person on the other end of the line?",
            "title_similarity": "0.43253812",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2070ml",
            "score": 1,
            "text": "Start fast tapping mute before the cuto and on the follow-up call that also cuts off abruptly. \n\nThen go fishing or write that novel. Ok, fine just stay in bed; either way you should be ok.",
            "title_similarity": "0.53590757",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i207357",
            "score": 1,
            "text": "Or, and hear me out, be a decent person and say, I have to go now. Hanging up, ghosting, general avoidance of dealing with reasonable people is immature behavior. Some may find it more unpleasant than others, but it’s a life skill like tying your shoes.",
            "title_similarity": "0.60559297",
            "sentiment_compound": 0.0525
        },
        {
            "id": "i207b6r",
            "score": 1,
            "text": "This is a great tip, will d",
            "title_similarity": "0.2742791",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i209omn",
            "score": 1,
            "text": "I totally did this when I worked at a call center.  We had calls recorded and monitored regularly, so it was especially nice that it fooled both ends.  \n\nI would finish my sentence and pause for reply, then Hello? a couple times.  Easy peasy",
            "title_similarity": "0.5454836",
            "sentiment_compound": 0.5709
        },
        {
            "id": "i209wbm",
            "score": 1,
            "text": "Push mute a few times before you do it. If the voice stops and the call end immediately it's a hangup. If the ... tops .... ts ... bad conne....",
            "title_similarity": "0.60818756",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i20a41a",
            "score": 1,
            "text": "I only talk to my mom when I'm on my way to something when I can't talk. I love her dearly, but that woman can talk. I fucked up one time, and we were on the phone for 4 hours.  So unless I have plenty of time and \"uh huhs\" in my system, we talk when I'm on my way to the train.",
            "title_similarity": "0.49304664",
            "sentiment_compound": -0.8118
        },
        {
            "id": "i20a49y",
            "score": 1,
            "text": "man stop giving away my secrets.",
            "title_similarity": "0.6219781",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i20a5st",
            "score": 1,
            "text": "This is really an interesting post, OP. It’s also worth noting th",
            "title_similarity": "0.28470543",
            "sentiment_compound": 0.5965
        },
        {
            "id": "i20aj8q",
            "score": 1,
            "text": "I do this to rude customers on the phone.",
            "title_similarity": "0.5341989",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i20ajy0",
            "score": 1,
            "text": "I do this to rude customers.",
            "title_similarity": "0.3342866",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i20bjty",
            "score": 1,
            "text": "I work at a call center. Can't",
            "title_similarity": "0.4849893",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20bxlh",
            "score": 1,
            "text": "It was very believable in Pee Wee's Big Adventure.",
            "title_similarity": "0.2852342",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i20c898",
            "score": 1,
            "text": "I'm approaching my home in my tunnel,  so---",
            "title_similarity": "0.28971347",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20cdzp",
            "score": 1,
            "text": "My friend in Nevada does this to me all the fucking time. I call him back immediately and tell him look dude, if you have to go then just say so, I can take it. But he's a salesman and needs to be in good standing with everyone, so on it continues.",
            "title_similarity": "0.45536968",
            "sentiment_compound": 0.714
        },
        {
            "id": "i20cumh",
            "score": 1,
            "text": "I usually say \"I think we've covered everything we need to. Have a good day\" and hang up before they get a chance to reply.",
            "title_similarity": "0.6963185",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i20d4lv",
            "score": 1,
            "text": "David Brenner (z”l) had a bit on this in the 70s. He also suggested leaving the phone off the hook for a few minutes so the other person thinks you’re trying to call back. Today, it would be let it go to VM.",
            "title_similarity": "0.5541601",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20dpi8",
            "score": 1,
            "text": "I've done this at work with people who just keep going and going telling me their life story. If I can perform the task that's needed from the called, I will straight up act like I can't hear them.\n\n\"Hello? ...Hello? Helllloooo?\"\n\nHang up. I know they usually won't call back. All them call prompts are a bitch.",
            "title_similarity": "0.7117717",
            "sentiment_compound": -0.2359
        },
        {
            "id": "i20drt1",
            "score": 1,
            "text": "I invented that move 30 years ago",
            "title_similarity": "0.22339734",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20dx50",
            "score": 1,
            "text": "I do this at work when the patient is being rude to me, I hang up mid sentence then I say “Hello???” after I hang up on them. Everyone just thinks that the call got disconnected. lol oooops!",
            "title_similarity": "0.61562884",
            "sentiment_compound": 0.234
        },
        {
            "id": "i20ekq5",
            "score": 1,
            "text": "This what my mom does all the time.",
            "title_similarity": "0.24490368",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20elph",
            "score": 1,
            "text": "or just tell them you have to go and hang up",
            "title_similarity": "0.54085726",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20f8jl",
            "score": 1,
            "text": "I used to do this when I worked for Verizon. But to my defense, I shouldn't be stuck an hour and a half past my shift reading the iPhone user manual for people that just upgraded from a rotary phone.\n\nBut I didn't just hit the disconnect button. I loosened my phone line under the desk just enough that I can pull it out with my foot and not be seen (of course by then most people have gone home for the night).",
            "title_similarity": "0.598982",
            "sentiment_compound": 0.4329
        },
        {
            "id": "i20f9ze",
            "score": 1,
            "text": "y’all just found this out?",
            "title_similarity": "0.35195136",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20fjz1",
            "score": 1,
            "text": "I did this today to an insurance salesman. \"Hey I'm doing fine how a-",
            "title_similarity": "0.4376569",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i20gg00",
            "score": 1,
            "text": "Alternatively, be an adult.",
            "title_similarity": "0.25332472",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20gjza",
            "score": 2,
            "text": "I do that ALL the time.\n\nOr if I'm at work, I'll make a call to the office on my smartphone so they'll hear the ringing in the background and tell them, \"Oops. I got another call. I have to let you go.\"\n\nIf I'm on my smartphone, I'll put a long pause in a sentence and tell them that another call just came in that I have to answer.",
            "title_similarity": "0.6209317",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i20he19",
            "score": 1,
            "text": "I just say I gotta go....",
            "title_similarity": "0.41414678",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20hfqd",
            "score": 1,
            "text": "Finally! A LPT i can use.",
            "title_similarity": "0.35141203",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20huh9",
            "score": 2,
            "text": "Yeah...they call back and say sorry because they lost signal while talking.",
            "title_similarity": "0.5981638",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i20hwmb",
            "score": 2,
            "text": "\"I have to go\" usually works for me. That way there is no callback on the basis it was a dropped line.",
            "title_similarity": "0.7606103",
            "sentiment_compound": -0.296
        },
        {
            "id": "i20iwqt",
            "score": 1,
            "text": "Switch it to airplane so they can’t call back",
            "title_similarity": "0.50441676",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20j8ai",
            "score": 1,
            "text": "We had a woman from Mexico who could barely speak English and would do this constantly when questioned by higher ups. Either hang up or go on mute. They'd unmute her. Tons of respect for anyone who even attempts to speak multiple languages but it was a requirement at our international company as the primary language. It was so painful we'd be on mute in the US like did she even understand what we asked? Her team would have to jump in and speak on her behalf.",
            "title_similarity": "0.50273913",
            "sentiment_compound": -0.2528
        },
        {
            "id": "i20jg6o",
            "score": 1,
            "text": "….they’ll just call you back",
            "title_similarity": "0.5961692",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20k6rt",
            "score": 1,
            "text": "I do this all the time 🤗",
            "title_similarity": "0.19052559",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i20kbpy",
            "score": 1,
            "text": "I love that this could be equally valid in /r/unethicallifeprotips",
            "title_similarity": "0.3476013",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i20kpek",
            "score": 1,
            "text": "No joke I already do this lmao",
            "title_similarity": "0.3865728",
            "sentiment_compound": 0.5771
        },
        {
            "id": "i20l3ab",
            "score": 1,
            "text": "And then they’ll just call back lol",
            "title_similarity": "0.53521466",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i20lyep",
            "score": 1,
            "text": "Bro these are elite secrets do not be spreading this",
            "title_similarity": "0.6595834",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20m4xk",
            "score": 1,
            "text": "Wouldn’t they just calls back?",
            "title_similarity": "0.56599796",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20moql",
            "score": 1,
            "text": "I used to do this when I worked at a call centre when dealing with horrible people.",
            "title_similarity": "0.40204954",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i20n5y2",
            "score": 1,
            "text": "\"Oh I am about to drive under a bridge/in a tunnel/into a parking garage..\" garble your speech say \"can you hear me?\" then hang up.",
            "title_similarity": "0.39166278",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20n6dc",
            "score": 1,
            "text": "Low key I’ve done this",
            "title_similarity": "0.34102574",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i20n7uo",
            "score": 1,
            "text": "“Hey, my battery is about to die.”",
            "title_similarity": "0.4662724",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20n9vm",
            "score": 1,
            "text": "Just be assertive and say \"I have to go.\" If you're afraid to do that, blame a sudden work email or something urgent yet minor.",
            "title_similarity": "0.66427076",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i20olgm",
            "score": 2,
            "text": "I like to forcefully say \"Hey can you hold on for a second.\" Then put the phone on mute, wait a few seconds and take a deep breath. Right back on the call. \"Hey I gotta go.\" They will assume you have another call and may want to quickly arrange a follow up call. \"Sure can you call me back in 10 minutes?\" When they call back you can just let the follow up call go to voicemail.",
            "title_similarity": "0.6267736",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i20omoe",
            "score": 1,
            "text": "the genius of this LPT really caught me off guard.",
            "title_similarity": "0.2985956",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20osyy",
            "score": 1,
            "text": "I thought only i did this",
            "title_similarity": "0.39314035",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20pk15",
            "score": 1,
            "text": "I usually shut down my phone for a few minutes after doing this so if they try to call back it goes straight to voicemail and they assume dead battery.",
            "title_similarity": "0.48685592",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i20q79t",
            "score": 1,
            "text": "“…and that is how you calculate your projected net profit for this quarter. Let’s see…Jim, care to demonstrate this for us using your Q2 results?”\n\n“Uh, sure. Yeah. Well, so let me…let’s see I’m just bring up those numbers now. Um. Ehhh. *Click*” \n\n“Jim? Jim? Did he just hang up on himself?”",
            "title_similarity": "0.37689048",
            "sentiment_compound": 0.9129
        },
        {
            "id": "i20qv5l",
            "score": 1,
            "text": "Nothing new if you've ever worked in a call center. Nothing slick here.",
            "title_similarity": "0.5318382",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20rqxk",
            "score": 1,
            "text": "That’s brilliant.",
            "title_similarity": "0.10675119",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i20tkf3",
            "score": 1,
            "text": "Haha I've been doing this since 1999 when I first learned about it; has worked every time!",
            "title_similarity": "0.18689762",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i20u6dk",
            "score": 1,
            "text": "I swear the quality and message of this sub has gone down the drain each year.",
            "title_similarity": "0.27504712",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i20utpn",
            "score": 1,
            "text": "My older brother will literally just say \"ok I'm done, love you, bye\" and I have a quick second to say love you too bye and the call is over. I prefer this to long drawn out endings.",
            "title_similarity": "0.58609384",
            "sentiment_compound": 0.8555
        },
        {
            "id": "i20v6mi",
            "score": 1,
            "text": "i am receiving call from doctors office ..talk to you later or \n\njust say got to answer call i am receiving",
            "title_similarity": "0.5141344",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20vbld",
            "score": 1,
            "text": "But what if it’s a person you can’t have a conversation to?",
            "title_similarity": "0.547439",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20vfna",
            "score": 1,
            "text": "Oh god the amount of times I do this lol",
            "title_similarity": "0.1535028",
            "sentiment_compound": 0.6542
        },
        {
            "id": "i20voaq",
            "score": 2,
            "text": "you know what...that's actually a really go.",
            "title_similarity": "0.25751424",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20vrc1",
            "score": 1,
            "text": "Problem is, the only people I would do this to are the exact people who will call back immediately and say \"oh I think we got disconnected. Anyways....\"",
            "title_similarity": "0.6964948",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i20vvde",
            "score": 1,
            "text": "Best LPT I have ever seen!",
            "title_similarity": "0.24281001",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i20w2b2",
            "score": 1,
            "text": "What if they call you back",
            "title_similarity": "0.53581524",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20wcsm",
            "score": 1,
            "text": "Omg I do this while I’m in meetings and I need to poop. It works so well.",
            "title_similarity": "0.34111783",
            "sentiment_compound": 0.4101
        },
        {
            "id": "i20wd3n",
            "score": 1,
            "text": "\"...tunnel coming up krshrhsrhshrhshrh\" blip",
            "title_similarity": "0.15841082",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20wk98",
            "score": 1,
            "text": "I wish I knew this when I was a teenager, I used to tell everyone \"Hey Imma call you right back\" and never did.",
            "title_similarity": "0.52148867",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i20wy4l",
            "score": 1,
            "text": "Sip logs enter the chat",
            "title_similarity": "0.291259",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20x14q",
            "score": 1,
            "text": "I've been doing this since I've been able to make phone calls.",
            "title_similarity": "0.41853833",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20y3yi",
            "score": 1,
            "text": "Or be an adult and tell them you have to go.  Now. Like Right now.  Bye. \n\nClick.",
            "title_similarity": "0.5518163",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i20ylph",
            "score": 1,
            "text": "I do this every so often",
            "title_similarity": "0.1585757",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20yyrf",
            "score": 1,
            "text": "Protip for automated call center calls.\nCellphones don't make a distinct noise of answering, so when an automated system calls and you answer they don't know you did until you speak.\n\n\nDon't speak, the system will hang by itself.",
            "title_similarity": "0.77335036",
            "sentiment_compound": 0.0
        },
        {
            "id": "i20z78n",
            "score": 1,
            "text": "Someone did this during an interview once. We called them back, but it went straight to voicemail twice.",
            "title_similarity": "0.4850481",
            "sentiment_compound": 0.3291
        },
        {
            "id": "i20zarb",
            "score": 1,
            "text": "Shhh, you’re giving all my secrets away",
            "title_similarity": "0.46983773",
            "sentiment_compound": 0.34
        },
        {
            "id": "i210u69",
            "score": 1,
            "text": "I do this all the time",
            "title_similarity": "0.17098032",
            "sentiment_compound": 0.0
        },
        {
            "id": "i210vpo",
            "score": 1,
            "text": "Or just... hang up on them? Preferably after telling them to eat a bag of dicks",
            "title_similarity": "0.42674607",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2119qz",
            "score": 1,
            "text": "This didn't work on corded landlines. You would hear the rattling from the impact of the handset on the base before the call would cut out.",
            "title_similarity": "0.52915955",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i211rda",
            "score": 1,
            "text": "So basically the quarterly projections … oh my god.. what the Hell is th…….",
            "title_similarity": "0.24916166",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i212229",
            "score": 1,
            "text": "Used to do this back when I sold insurance over the phone",
            "title_similarity": "0.4725536",
            "sentiment_compound": 0.0
        },
        {
            "id": "i212l0h",
            "score": 1,
            "text": "My trick has always been to confidently be a nice asshole. \n “Well I’ll let you go…”\n“It’s ok I’ve got time”\n“That wasn’t a suggestion. I’m letting you go”\n Then I do friendly eyyyy which is the equivalent of finger guns over the phone and then I hang up.",
            "title_similarity": "0.73132837",
            "sentiment_compound": 0.8779
        },
        {
            "id": "i212l7q",
            "score": 1,
            "text": "I did that to my brother in the process of telling him about this pro tip.",
            "title_similarity": "0.4664193",
            "sentiment_compound": 0.0
        },
        {
            "id": "i212rzr",
            "score": 1,
            "text": "Lmao I’ve done this",
            "title_similarity": "0.2021451",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i212z04",
            "score": 1,
            "text": "Yup, I’ve said this for years.",
            "title_similarity": "0.18111917",
            "sentiment_compound": 0.0
        },
        {
            "id": "i213lto",
            "score": 1,
            "text": "I simply no longer answer phone calls these days. I refuse",
            "title_similarity": "0.5127208",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i213wtv",
            "score": 1,
            "text": "Shhh….don’t tell everyone!",
            "title_similarity": "0.5777618",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2143k5",
            "score": 1,
            "text": "This only works once",
            "title_similarity": "0.41177198",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2150ou",
            "score": 1,
            "text": "My friend does that to me all the time.\n\n5 minutes later: \"Sorry, my phone died\"\n\nYeah, sure it did.",
            "title_similarity": "0.3220661",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i215o91",
            "score": 1,
            "text": "*calls back*\n\nHey, we lost you for a second there!",
            "title_similarity": "0.4623844",
            "sentiment_compound": -0.3802
        },
        {
            "id": "i215t3g",
            "score": 1,
            "text": "Disagree, because if you hang up then y-",
            "title_similarity": "0.54833126",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i216e3z",
            "score": 1,
            "text": "Why go through that when you can be blunt and just hang up?",
            "title_similarity": "0.60303944",
            "sentiment_compound": 0.0
        },
        {
            "id": "i216o1h",
            "score": 1,
            "text": "This is a very old David Brenner joke.",
            "title_similarity": "0.3393461",
            "sentiment_compound": 0.296
        },
        {
            "id": "i21794x",
            "score": 1,
            "text": "What happened to being honest and saying the truth?  Why do all these charades?",
            "title_similarity": "0.4775433",
            "sentiment_compound": 0.7149
        },
        {
            "id": "i2179pr",
            "score": 1,
            "text": "My favorite is just turning the phone off. Then if they ask you something about it later, you can just say your battery died.",
            "title_similarity": "0.5849658",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i218dtn",
            "score": 1,
            "text": "They will call you back.",
            "title_similarity": "0.5133766",
            "sentiment_compound": 0.0
        },
        {
            "id": "i218zi9",
            "score": 1,
            "text": "This is a very g",
            "title_similarity": "0.12289913",
            "sentiment_compound": 0.0
        },
        {
            "id": "i21915w",
            "score": 1,
            "text": "Verified from customer support 😂",
            "title_similarity": "0.41900462",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i21965b",
            "score": 1,
            "text": "Don’t fucking tell everybody.  Been one of my favorite life hacks",
            "title_similarity": "0.47504663",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i219ipw",
            "score": 1,
            "text": "You know what they say about that click",
            "title_similarity": "0.2592035",
            "sentiment_compound": 0.0
        },
        {
            "id": "i21amz0",
            "score": 1,
            "text": "This is actually quite clever.",
            "title_similarity": "0.15186597",
            "sentiment_compound": 0.5095
        },
        {
            "id": "i21dgm7",
            "score": 1,
            "text": "I do it all the time when I answer staffing agency calls without realizing who they are. I used to do it to a boss I had and would just say sorry, I have a shitty phone. Never questioned it",
            "title_similarity": "0.6165799",
            "sentiment_compound": -0.558
        },
        {
            "id": "i21dh3z",
            "score": 1,
            "text": "This will probably result in them calling you back if they think the connection was interrupted...",
            "title_similarity": "0.66329354",
            "sentiment_compound": -0.296
        },
        {
            "id": "i21e0l5",
            "score": 1,
            "text": "That probably only works once lol . But I’ll definitely use this sometime in my life",
            "title_similarity": "0.51094574",
            "sentiment_compound": 0.6652
        },
        {
            "id": "i21iu1t",
            "score": 1,
            "text": "Did this quite often when I worked in a call center talking to customers who wouldn’t stop talking.",
            "title_similarity": "0.4413886",
            "sentiment_compound": -0.296
        },
        {
            "id": "i21nexz",
            "score": 1,
            "text": "Tell them your battery is low, when the call drops they will think it died",
            "title_similarity": "0.5774443",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i21niet",
            "score": 2,
            "text": "I was on a work video call a few weeks back and I just didn’t have the energy for it so I turned my wifi off mid-sentence. The software we use showed me as “dropped” rather than “left”.",
            "title_similarity": "0.46864304",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i21tkja",
            "score": 1,
            "text": "if you have a close friend text them and ask if they're alone and iff theyll cover for you. if yes, \"ah shit i gotta go __ is here\"",
            "title_similarity": "0.7085792",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i21yqcn",
            "score": 1,
            "text": "You can also turn off cellular data. It’ll show as call dropped and not call ended",
            "title_similarity": "0.56844413",
            "sentiment_compound": 0.0
        },
        {
            "id": "i21zara",
            "score": 1,
            "text": "Been doing this for years.\n\n\"Before we wrap up I just wanted to say...\"",
            "title_similarity": "0.368117",
            "sentiment_compound": 0.0
        },
        {
            "id": "i239np1",
            "score": 1,
            "text": "Bonus credibility when the company uses Microsoft Teams!\n\nNot a single day passes where there isn't a new exciting problem with this wonderful application. Today I wasn't able to make a call from my pc at all. What a calm Friday... until they found out I have a company mobile...",
            "title_similarity": "0.5320691",
            "sentiment_compound": 0.6667
        },
        {
            "id": "i25db0d",
            "score": 1,
            "text": "or as we like to call it in the phone jockey business the \"Smoko Line Drop\"",
            "title_similarity": "0.5253863",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i25iz94",
            "score": 1,
            "text": "He’s too dangerous to be kept alive",
            "title_similarity": "0.42638522",
            "sentiment_compound": -0.128
        },
        {
            "id": "i2an1pl",
            "score": 2,
            "text": "Lol I've done this but differently. I will say a sentence full on and just tap the mute button on and off a few times. People will think you have spotty connection, which is the green light to hang up haha.",
            "title_similarity": "0.52812725",
            "sentiment_compound": 0.7469
        },
        {
            "id": "i59n43q",
            "score": 1,
            "text": "HAH i always do this!",
            "title_similarity": "0.22327852",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5b1n4i",
            "score": 1,
            "text": "Then the other person calls back 30 seconds later",
            "title_similarity": "0.33589745",
            "sentiment_compound": 0.0
        }
    ]
}