{
    "LPT: If you spy an elderly person alone at McDonalds, the gas station or wherever, casually interact with them: commiserate over a long line, crack a joke, ask a question - it reassures them they're still just people, not \"old people.\" Many have outlived their friends and are lonely as hell.\n": [
        {
            "id": "i4a2y14",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.45915633",
            "sentiment_compound": 0.9615
        },
        {
            "id": "i4aad4l",
            "score": 11,
            "text": "Unless your a person of color and the old person is white, then think twice",
            "title_similarity": "0.23744512",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ai733",
            "score": -2,
            "text": "LPT: don’t do this for free. It doesn’t benefit ME. Why should I spend MY time helping people? Why don’t they just pull themselves up by the bootstraps instead of looking for handouts? \n\n\\- everyone from that asshole boomers generation. \n\nBe a savior. Return the asshole favor.",
            "title_similarity": "0.57231",
            "sentiment_compound": 0.89
        },
        {
            "id": "i4as0k7",
            "score": -1,
            "text": "This is some good advice. Though I'd add that it isn't just elderly people who may feel lonely as hell. Introverts, Asperger's or autism, people feeling 'mentally ill', people after lockdowns or isolation. I've seen many posts by people in their 30's saying they feel lonely and how hard it is to make friends as you get older. Maybe a little more friendlyness and conversation all round would be some useful advice.",
            "title_similarity": "0.7041919",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i4a9bk1",
            "score": 4,
            "text": "Good morning!\n\"That's harassment!\"",
            "title_similarity": "0.1716605",
            "sentiment_compound": -0.2924
        },
        {
            "id": "i4a7ci2",
            "score": -9,
            "text": "I don't usually go to these places but I'm going to now just to do this. this is wholesome as shit",
            "title_similarity": "0.37460914",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i4a7haw",
            "score": 36,
            "text": "\"Treat old people differently to show them they're the same as everyone else.\"  \n\n\nGood one, dummy.",
            "title_similarity": "0.54417276",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i4aa2sy",
            "score": 17,
            "text": "Why would you spy on old people? Are you deranged?",
            "title_similarity": "0.49036717",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4a7j27",
            "score": 26,
            "text": "Ya well sometimes I don't have time for a 30 minute reenactment of their lives.\n\n\"Long line today huh?\"\n\"BACK IN '57 I WAITED IN THE LONGEST DAMN LINE OF MY LIFE. IT WAS OPENING DAY AT THE NEWEST CHEVY DEALERSHIP......\"",
            "title_similarity": "0.5052504",
            "sentiment_compound": -0.3254
        },
        {
            "id": "i4axc9b",
            "score": 1,
            "text": "In the U.S, particularly among the white population, our elders aren’t valued or respected the way they are in other countries and cultures. Many seniors are left in the care of nursing homes (where abuse and neglect stats are shockingly high), rarely getting calls or visits. If seniors are living at home, it’s often still the case that they seldom get calls or visits from family.",
            "title_similarity": "0.6308684",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4a4829",
            "score": 34,
            "text": "This is one of the nicest Life Pro Tips I have ever seen posted. Good advice!",
            "title_similarity": "0.34974945",
            "sentiment_compound": 0.75
        },
        {
            "id": "i4axied",
            "score": 2,
            "text": "You'll see a lot of this in malls - old folks sitting on the benches in between the stores, or at the food court. Just trying to feel like they are still members of the human race. Heartbreaking.  There's an epidemic of loneliness out there.  And not just affecting the elderly either.",
            "title_similarity": "0.76349914",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i4ae0yz",
            "score": 13,
            "text": "pro tip: give money to poor people as they need money to do things and it’ll make them happy.",
            "title_similarity": "0.41037256",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i4b3dl5",
            "score": 0,
            "text": "This is the *kindest* LPT I’ve seen in a long, long time. Good on ya, OP!",
            "title_similarity": "0.32554573",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i4blfwa",
            "score": 0,
            "text": "I think this will be the interesting part of the new generation because we are alone and have tons of online friends at the same time and this wont change by time. You cannot outlive the internet.",
            "title_similarity": "0.63761514",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4a4c7m",
            "score": 28,
            "text": "My soulmate and I just had a recent interaction with an out of state elderly couple a few days ago, while we were visiting a local botanical garden. \n\n\nHe was pushing her in a wheelchair when our paths crossed. We had a brief wholesome conversation with them, shared a few laughs and then went our separate ways. \n\n\nAlthough I enjoyed our brief moment together, I honestly hadn't thought of the positive impact they may have experienced from 'their' perspective.\nHopefully they enjoyed it too!",
            "title_similarity": "0.66410625",
            "sentiment_compound": 0.9769
        },
        {
            "id": "i4b20ze",
            "score": 10,
            "text": "Nah. Fuck elderly people",
            "title_similarity": "0.32858175",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i4a9b67",
            "score": 122,
            "text": "Cool but how is this a life pro tip? I am genuinely wondering. Aren't life pro tips supposed to be (hypothetical) something like \"stir the food and push them towards the corner of the bowl so while microwaving, the food heats up and not the bowl\"... All \"LPTs\" I see here are things like \"be kind to everyone.. it'll make their day better\".",
            "title_similarity": "0.5711611",
            "sentiment_compound": 0.9485
        },
        {
            "id": "i4b3f41",
            "score": 1,
            "text": "This is a really good and very touching LPT. Made me a bit sad thinking of some of the people I wish I was better at keeping in touch with.",
            "title_similarity": "0.5005747",
            "sentiment_compound": 0.6901
        },
        {
            "id": "i4b0sxu",
            "score": 8,
            "text": "Most old people are self righteous pricks who think they k ow more than anyone but at the end of the day are racist old grunts.",
            "title_similarity": "0.6351764",
            "sentiment_compound": -0.7876
        },
        {
            "id": "i4b216m",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.12520903"
        },
        {
            "id": "i4agumj",
            "score": 35,
            "text": "How is this a pro tip of any kind?",
            "title_similarity": "0.20935412",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4av6c6",
            "score": 33,
            "text": "I'm an old person. Don't approach me or talk to me.  I don't care and I've heard all your dumb shit/jokes/stories before a million times. \n\nI'm done learning new stuff and meeting new people. Just don't get in my way and we are good.",
            "title_similarity": "0.70350933",
            "sentiment_compound": -0.4639
        },
        {
            "id": "i4auv6v",
            "score": 11,
            "text": "No. Old people are awful.",
            "title_similarity": "0.32834136",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4all7n",
            "score": 5,
            "text": "> have outlived their friends and are lonely as hell.\n\nAhaa! I certainly won't be having that issue",
            "title_similarity": "0.63798547",
            "sentiment_compound": -0.4389
        },
        {
            "id": "i4at357",
            "score": 23,
            "text": "Fuck em; most of the old people around me continually vote against their own best interests, cheer for anti-human legislation, are so fucking out of their gourd in terms of reality-driven understanding of what the consequences of their actions are and were.\n\n\nThey deserve to be lonely.\nBut I'll still say hi to them anyway.",
            "title_similarity": "0.7012145",
            "sentiment_compound": 0.3071
        },
        {
            "id": "i4axh4x",
            "score": 0,
            "text": "Wholesome, great idea, and will legit make this world a better place. Thanks for the suggestion OP.",
            "title_similarity": "0.20568588",
            "sentiment_compound": 0.872
        },
        {
            "id": "i4aztkr",
            "score": 0,
            "text": "I like this tip, will actually try to make an effort to do so.",
            "title_similarity": "0.2147384",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4baxjf",
            "score": 0,
            "text": "They feel invisible.",
            "title_similarity": "0.12881556",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4baysa",
            "score": 0,
            "text": "You know that old trees just grow stronger,\nAnd old rivers grow wilder every day,\nOld people just grow lonesome,\nWaiting for someone to say, \"Hello in there, hello\"\n\nSo if you're walking down the street sometime\nAnd spot some hollow ancient eyes\nPlease don't just pass 'em by and stare\nAs if you didn't care, say, \"Hello in there, hello\"\n\n-John Prine",
            "title_similarity": "0.7011968",
            "sentiment_compound": -0.0588
        },
        {
            "id": "i4c6q5v",
            "score": 0,
            "text": "There's a comic series out now set in a future where Michelangelo is the only ninja turtle left alive. For some reason that really depresses me...",
            "title_similarity": "0.4667595",
            "sentiment_compound": -0.2247
        },
        {
            "id": "i4d4gyg",
            "score": 0,
            "text": "The trick is to only have one or two friends, then you don't have to wait as long to be left alone",
            "title_similarity": "0.5269767",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i4akttt",
            "score": 8,
            "text": "I just moved into a cul de sac and I’m the youngest resident by at least 30 years. These grandmas and grandpas are fucking awesome. They’re sweet, they’re knowledgeable, and they have connections. We have “nice” battles where we do stuff for each other. I’ve now unofficially adopted 4 grandmas and 2 grandpas and fucking love them.",
            "title_similarity": "0.5977249",
            "sentiment_compound": 0.8898
        },
        {
            "id": "i4akev0",
            "score": 15,
            "text": "LPT- do this with everyone if you have the social battery\n\nI do this with strangers about everything. I don’t try carry on a conversation but I’ll point out funny things or mutual annoyances.\n\nThere’s lots of people that say “hi” to me when I walk around in my neighborhood because they’ve interacted with me before and had a laugh.\n\nI’ve had enormous social and financial gains from this.",
            "title_similarity": "0.72803354",
            "sentiment_compound": 0.8462
        },
        {
            "id": "i4ary3n",
            "score": 51,
            "text": "This gotta be an amercan thing.\n\nSpeaking to people you dont know is a big no-no where i live.",
            "title_similarity": "0.46147895",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4afu7o",
            "score": 3,
            "text": "Honestly I am a young person and if another young person made a joke to me in line I would be flattered",
            "title_similarity": "0.45832005",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i4am3yj",
            "score": 35,
            "text": "Introvert here… leave, people, alone. Stop assuming everyone wants attention and is as needy for social interaction as you.",
            "title_similarity": "0.5950367",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i4avv0h",
            "score": 1,
            "text": "When I was a kid I use to fantasize about living forever. When my gramps was the last one left, wife died and ALL his childhood friends were dead he said “Everyone I know is dead” with a sad look on his face…\n\nThat’s when it hit me that I wouldn’t want to live forever unless everyone else could live forever too.\n\nIt would just be TOO DAMN LONELY.",
            "title_similarity": "0.589165",
            "sentiment_compound": -0.9356
        },
        {
            "id": "i4b5fok",
            "score": 1,
            "text": "One of my favorite things about running autoparts stores was just hangin' around jawin' with the old timers. \n\nThey'd teach me about all their mechanical tips and tricks and I'd help them with their computers or smartphones. \n\nTurns out we're *all* people!",
            "title_similarity": "0.59584373",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i4b5m3o",
            "score": 1,
            "text": "In my field, healthcare, I always have elderly patients. 9 times out of 10 they want to talk about anything and everything and I always let them. I enjoy the conversations and it helps my day go by a lot quicker. I feel bad when I have to ask them to hold their breath so that I can get the perfect image for my radiologist. (I’m a sonographer.)",
            "title_similarity": "0.5707194",
            "sentiment_compound": 0.743
        },
        {
            "id": "i4blg4x",
            "score": -1,
            "text": "I'd add, do this with homeless people too. Homeless people are still people and usually feel that they aren't treated as such. If you want to listen to a wild story they may even feel open to telling you about themselves.",
            "title_similarity": "0.5914471",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4d9jhd",
            "score": 1,
            "text": "Heck yeah it costs nada to be nice to someone else",
            "title_similarity": "0.3912252",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i4doo5k",
            "score": 1,
            "text": "I don't think this applies to just the elderly... I mean don't just walk up to someone eating by the self and I'm not talking about hitting on someone or being creepy, but If you're genuinely friendly then most people enjoy small talk or a quick remark if they're alone in public situations",
            "title_similarity": "0.7374078",
            "sentiment_compound": 0.8185
        },
        {
            "id": "i4b1opn",
            "score": 78,
            "text": "Ironic how this LPT is basically, \"When you see an old person, treat them differently than you would a younger person to suggest to them that they are not an old person.\"",
            "title_similarity": "0.49189046",
            "sentiment_compound": 0.296
        },
        {
            "id": "i4b5b2u",
            "score": 5,
            "text": "fuck no, why tf would I intentionally instigate a totally avoidable interaction with a stranger? I sure as fuck aint doing this with people my age, I'm not doing it with elderly people either.",
            "title_similarity": "0.49387288",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i4awlgj",
            "score": 31,
            "text": "Fuck no.\n\nPeople come up to talk to my husband all of the time (like he's sitting down eating and someone walks up and wants to show their grandkids pictures).  It's just weird.  Encouraging that behavior is weird.",
            "title_similarity": "0.73063654",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4binm1",
            "score": 15,
            "text": "**No, do NOT do this!** I'm one of those people (70+ years old), and I just want to be left alone. I feel harassed when people do this. For some reason, it's always the crazy god-believers or some idiot who wants to share their politics with me. Keep walking, and mind your own business. This is bad advice.",
            "title_similarity": "0.6228816",
            "sentiment_compound": -0.9098
        },
        {
            "id": "i4b7bf3",
            "score": 37,
            "text": "This is so patronizing",
            "title_similarity": "0.1160768",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4as8mg",
            "score": 9,
            "text": "I live in an elderly neighborhood and the majority of elderly are assholes.",
            "title_similarity": "0.4910427",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i4c3q36",
            "score": -2,
            "text": "That’s one of the most thoughtful things I have ever read.\n\nThank you, kind stranger.",
            "title_similarity": "0.32433462",
            "sentiment_compound": 0.8313
        },
        {
            "id": "i4ba60o",
            "score": 18,
            "text": "OR you can leave people the fuck ALONE..",
            "title_similarity": "0.27405965",
            "sentiment_compound": -0.7531
        },
        {
            "id": "i4b3x2n",
            "score": 10,
            "text": "And when an old person sees me they should give me money. Because I need to be reassured they see me as a person too and not just a “young people.”",
            "title_similarity": "0.44879484",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4az90b",
            "score": 23,
            "text": "LPT: let people live their lives, mind your business without projecting some big life story onto strangers",
            "title_similarity": "0.500426",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b1i08",
            "score": 33,
            "text": "Pro tip. Leave most people alone and use your social cues on whether or not to interact with people.",
            "title_similarity": "0.54911673",
            "sentiment_compound": -0.3566
        },
        {
            "id": "i4b1s2p",
            "score": 34,
            "text": "TIL that the peace and quiet I’ve worked so hard to achieve will one day be ruined by a bunch of self entitled nitwits tryin to make themselves feel good by bothering me.  FML.",
            "title_similarity": "0.6216438",
            "sentiment_compound": 0.2344
        },
        {
            "id": "i4allgr",
            "score": 5,
            "text": "I do this.  It usually surprises them and they act suspicious. Occasionally there’s a pleasant exchange.  Certainly safer bet than some of the young people who walk into me staring at phone.",
            "title_similarity": "0.58863413",
            "sentiment_compound": 0.7675
        },
        {
            "id": "i4c4z0x",
            "score": 4,
            "text": "What if theyre boomers? Are we supposed to give a shit?\n\nEdit: a word",
            "title_similarity": "0.20881774",
            "sentiment_compound": -0.6072
        },
        {
            "id": "i4b3ajk",
            "score": 13,
            "text": "I've tried this before, only to be told to mind my own damn business after asking how they were doing 🤷‍♀️",
            "title_similarity": "0.48679292",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4auzp9",
            "score": -5,
            "text": "As someone who had a grandfather who would regularly forget the last 30 years and wander around at great risk to himself please do follow this advice.",
            "title_similarity": "0.62666476",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4axlqr",
            "score": -4,
            "text": "This is probably my new favorite LPT.",
            "title_similarity": "0.20593399",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i4b4gz7",
            "score": -2,
            "text": "This is a good one.",
            "title_similarity": "-0.044253483",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4blgo1",
            "score": 4,
            "text": "I do my best to avoid interacting with anyone no matter their age.\n\nWant to make them feel like 'they're still just people'? Don't infantilize them and coddle them.",
            "title_similarity": "0.5131456",
            "sentiment_compound": 0.6933
        },
        {
            "id": "i4al7jo",
            "score": 15,
            "text": "I met an old woman at the gas station once who was screaming at the Indian clerk to speak English and refund her old lotto tickets. When I politely enquired as to whether she missed her bus back to the museum, she informed me that I should fuck myself.",
            "title_similarity": "0.6779755",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i4bky9t",
            "score": 32,
            "text": "I miss LPTs that were actually tips you could use to make your life better.",
            "title_similarity": "0.53350437",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4akmkb",
            "score": 64,
            "text": "Elderly people love to speak to me, but I'm also a 45 y.o. small woman.  They just have to get past my (slightly) dark appearance and realize that I speak their language (Danish).\n\nMy 20 y.o. son said he wanted to help an elderly woman who looked like she was looking for someone to ask something but it was only when she became desperate and was standing at quite a distance, that she dared to ask him for the time and directions.  He's very small for a male at 170cm.",
            "title_similarity": "0.6015729",
            "sentiment_compound": 0.7543
        },
        {
            "id": "i4b37no",
            "score": 64,
            "text": "Isn't doing this kind of explicitly not treating them as not \"just people\"? It comes off a little condescending to me. When I'm ancient, I can't imagine really enjoying some kid coming up to me out of pity.\n\nJust be normal! If they're cool or you relate to them, have a chat, like anyone else - but going out of your way because of pity seems like a way to make yourself feel good without actually being socially genuine with someone.",
            "title_similarity": "0.6288874",
            "sentiment_compound": 0.6592
        },
        {
            "id": "i4anuh0",
            "score": 4,
            "text": "Sees old lady alone at gas station… walks up to her… BAAM… got shot…. \n\nCop: you did the right thing mam. Cant be too careful these days.",
            "title_similarity": "0.73686475",
            "sentiment_compound": -0.3493
        },
        {
            "id": "i4b6c67",
            "score": 7,
            "text": "\"Talk to randoms\" is a life tip?",
            "title_similarity": "0.402708",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4akas2",
            "score": 16,
            "text": "LPT: Dont interact with any random stranger. Make zero eye contact and keep walking. If someone looks at you and moves towards you, 9 times out of 10, they want money. Literally every time I step out of my car, someone approaches me for cash. Usually they are elderly people. I don't carry cash anymore because I ran out after giving it all away and decided it wasn't worth it to carry.",
            "title_similarity": "0.6765755",
            "sentiment_compound": 0.2579
        },
        {
            "id": "i4b15gj",
            "score": 20,
            "text": "That's not a tip in any way shape or form.",
            "title_similarity": "0.10706427",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b0mcu",
            "score": 36,
            "text": "When I'm an old man I'm gonna throw my drink at whoever tries this.",
            "title_similarity": "0.5270381",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b32qz",
            "score": 23,
            "text": "This is what is called infantalization. You think \"old\" people are incapable of the same thoughts and emotions such as yourself. They probably just want to get their shit and leave the same as you.",
            "title_similarity": "0.54914856",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i4bvqe0",
            "score": 8,
            "text": "Nah old people are the fucking worst",
            "title_similarity": "0.3887862",
            "sentiment_compound": -0.6997
        },
        {
            "id": "i4anqjm",
            "score": 43,
            "text": "Whenever I’m out and about and see someone by themself I usually try to say hi, smile, or otherwise acknowledge them unless they look avoidant.\n\nI’ve had friends and former partners seemingly get upset with this, but I know what it’s like to feel a deep sense of loneliness and I know how just one small interaction can change my mindset or day, why would I not offer that to others if it doesn’t hurt me at all?",
            "title_similarity": "0.6716399",
            "sentiment_compound": -0.6187
        },
        {
            "id": "i4b0ffc",
            "score": 9,
            "text": "Some people are just happy being alone though. Maybe they've got a wife or husband at home and they're happy to get away from them and out of the house for 10 minutes without any pointless interaction",
            "title_similarity": "0.70731133",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i4b93hv",
            "score": 7,
            "text": "Or maybe they just want to be left alone",
            "title_similarity": "0.3170963",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4bclr2",
            "score": 11,
            "text": "Fuck no lmao, previous American generations are the worst people. I'd tell them to die sooner. \"Commiserate over a long line\" with some dumbass that probably voted for Reagan. Pass.",
            "title_similarity": "0.60125995",
            "sentiment_compound": -0.9598
        },
        {
            "id": "i4b57ko",
            "score": 31,
            "text": "LPT: if you see me alone somewhere in 50 years, leave me alone. I like my peace and quiet, when out and about by myself.",
            "title_similarity": "0.59889144",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4b2f49",
            "score": 11,
            "text": "Lots of them are also mean old racist.",
            "title_similarity": "0.4087084",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i4b5p3m",
            "score": 14,
            "text": "\"Not\" talking to them is treating them like a normal person. Going out of your way to strike up a convo or joke is treating them like an \"old person\"",
            "title_similarity": "0.65347916",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i4buh56",
            "score": 13,
            "text": "your mileage may vary.\n\nI did this at a McDonalds in Philadelphia when I was in college.  I was wearing a Temple University sweatshirt and the old man told me that it can't be that good of a school because it has a lot of black students.  But he didn't refer to them as 'black students'\n\nSometimes there's a reason people are lonely.",
            "title_similarity": "0.7131088",
            "sentiment_compound": -0.6063
        },
        {
            "id": "i4ag1n8",
            "score": 18,
            "text": "Worked a stint at mcdonalds before covid and its true. Had at least one elderly regular that always ordered a fish sandwich for lunch in the lobby, same time every day. I knew his name a few years ago, would always at least say hi. Hope hes aight.",
            "title_similarity": "0.6521683",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i4ba3ve",
            "score": 21,
            "text": "Or just leave people alone.  Some people don't really want strangers trying to make small talk with them all the time.",
            "title_similarity": "0.5077602",
            "sentiment_compound": -0.3897
        },
        {
            "id": "i4at490",
            "score": 29,
            "text": "So, how'd you do it, how'd you outlive your friends?",
            "title_similarity": "0.44354433",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i4agu7q",
            "score": 127,
            "text": "Maybe I have grown old but also don't feel sorry for me!\n\nIm a whopper guy myself. Nice talking to you!",
            "title_similarity": "0.6114812",
            "sentiment_compound": 0.6825
        },
        {
            "id": "i4aktz6",
            "score": 205,
            "text": "Some people just want to be left alone",
            "title_similarity": "0.37073642",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4a7ahv",
            "score": 89,
            "text": "John Prine, *Hello in There*\n\nhttps://youtu.be/RfwGkplB_sY",
            "title_similarity": "0.17131825",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4aqs4v",
            "score": 769,
            "text": "[deleted]",
            "title_similarity": "0.12520903"
        },
        {
            "id": "i4ador9",
            "score": 353,
            "text": "Funny you should say that.\nLast week I was doing my shopping and getting some sugar and I must have stayed a few minutes just staring at the thirty different types of sugar on display. And this lady in her seventies was right next to me and clearly experiencing the same paralysis of choice, i reckon.\nFinally, I decide to just grab one and be done with this nonsense and I can hear her sighing and, you know, you can feel a fellow human being wanting to commiserate, she just goes kinda \"it's so complicated\" or something.  \nAnd I totally understood her and went something like \"tell me about it! So many choices! I've no idea how were supposed to pick!\" and just went on my merry way.  \n\nWe are not all able to start chatting with random strangers in the street, but I think just recognising other people's presence and acknowledging the shared humanity is a good start. A hello here, a thank you there, a \"what a ludicrous display!\" if appropriate...  \n\nIt's nice being nice.",
            "title_similarity": "0.6684228",
            "sentiment_compound": 0.9621
        },
        {
            "id": "i4a7t26",
            "score": 1648,
            "text": "My dad will turn 80 this year. Every evening, he goes out to a restaurant and eats at the bar so he can talk to others. When I call him on his birthday, he is always hunting. The conversation last year was this:  \n\nMe: “Hey dad, how’s your birthday going?”\n\nHim: “Well, I turned 79 today and climbed up into my tree stand 3 times, so I am gonna call it a good day.”\n\nWhen Covid forced him into isolation due to lack of local precautions (small town Alabama), I called and checked on him twice a week. His most common complaint - without fail- when we asked how he was holding up was, “Well, I am lonely.”  For a man like my dad to admit loneliness, you know it is overwhelming. He is tough as nails and rarely,if ever, admits feelings that would be deemed as “weak” to his peers. \n\nThat said, loneliness is an epidemic for the elderly - especially men and even more especially, men that do not go to church. If this fits the bill for someone you love, reach out to them. Loneliness is a major contributor to suicide in men over 55.",
            "title_similarity": "0.65840876",
            "sentiment_compound": -0.8221
        },
        {
            "id": "i4artm8",
            "score": 56,
            "text": "I sell a medical advice. I speak with old people all day, every day. I can always tell those who don’t really have anyone to talk to. I listen. I let them go on as they see fit. I know they don’t have anyone to talk to, and I don’t mind being an ear for them. I’ve heard some wild stories too. Happens two or three times a week, at least. They’re still people, and everyone deserves to have someone to talk to.",
            "title_similarity": "0.65285766",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4agc8w",
            "score": 480,
            "text": "I was just talking to my husband about this a few days ago. I wish there was something like adopt a senior in our area. All our grandparents are passed and we both feel that void. I feel weird just going up to someone older and I always feel like I'd be bothering them.",
            "title_similarity": "0.65911376",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i4ajcgk",
            "score": 3284,
            "text": "Had a really old lady who would come through the Walmart with a bottle of wine like once or twice a week.  (Had to of been 90+).  And after seeing her a few times she came through my line, and I made a point of talking to her while we waited for the CSM to come over (had to be 21 to sell alcohol and I was 18 at the time).  She lit up almost immediately when I asked if she had any plans for the week or summer, explained how she wanted to plant some flowers around the house and such.  CSM arrives and starts to process the alcohol sale and I stop her and say \"you have to card her\", CSM visibly confused as is old lady, so I explain \"there is no way she is a day older then 25 and you have to card everyone who isn't clearly over 41yo\".  Old lady start laughing, CSM asks to see her license and bam made an old lady's day so much so that she would exclusively come through my line if I was working when she came in.",
            "title_similarity": "0.56129646",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i4a6gne",
            "score": 1647,
            "text": "My grandmother is 92 and constantly complains about all her friends being gone. I like this advice.",
            "title_similarity": "0.60827994",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i4ad0u8",
            "score": 7601,
            "text": "My grandfather died almost ten years ago, and he was born in 1918.  Back when he was around, we were looking at a framed picture of his high school basketball team once.  He pointed out himself, and then he pointed out Gerald and said, “We were the only two who made it through the war.  Gerald died in 1984.”\n\nI cannot imagine how lonely that would feel, knowing that literally everyone from your childhood is gone.",
            "title_similarity": "0.6248208",
            "sentiment_compound": -0.8747
        },
        {
            "id": "i4at7lf",
            "score": 3,
            "text": "I went to physical therapy last week with my 6-week old. Aside from myself, every other person in there had to have been 60 plus years of age. Every single one of them wanted to look at my daughter, coo over her, congratulate me etc. Normally it bothers me but because everyone was still wearing masks I let everyone take a peek in. I know one day I'm going to be that old and my kids are going to be fully grown. Everyone keeps reminding me to enjoy the time while I have it. And if I can brighten their day with a squeaky little baby then by golly I'm going to do it.",
            "title_similarity": "0.52425194",
            "sentiment_compound": 0.8705
        },
        {
            "id": "i4auc3f",
            "score": 2,
            "text": "I agree you get lots of fun conversations, especially from older people wandering around a pet store. They LOVE to talk about their pets! The post also reminded me of this scene! https://youtu.be/vrc0xyJ4q3s",
            "title_similarity": "0.5554286",
            "sentiment_compound": 0.9065
        },
        {
            "id": "i4ave12",
            "score": 2,
            "text": "Say Hello in There.",
            "title_similarity": "0.03521455",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4avpnx",
            "score": 2,
            "text": "I used to do this when I was still a medic. We’d stop every morning because my partner liked their coffee but I’d stop to talk to the old folks reading the paper or just staring off drinking their coffee. I miss those times so I guess I’m heading to McDonald’s tomorrow for a biscuit and a coffee.",
            "title_similarity": "0.6421796",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4ayplf",
            "score": 3,
            "text": "My mother, in her 80s says the obituaries look more like a high school reunion announcement now.",
            "title_similarity": "0.39896902",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i4ayso4",
            "score": 2,
            "text": "Well said!  They deserve to not be treated like the are invisible. A kind word or a simple smile can make them feel less lonely/isolated.",
            "title_similarity": "0.43051958",
            "sentiment_compound": 0.7337
        },
        {
            "id": "i4azp3d",
            "score": 2,
            "text": "What about pizza hut?",
            "title_similarity": "0.32275036",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4azqcm",
            "score": 2,
            "text": "I briefly worked for the US Census years back, my job was to go to the addresses that didn't send theirs in and determine if the houses were unoccupied or whatever.  On at least two different occasions the door was answered by an elderly person who was clearly so happy to have someone to talk to, talked my head off, and it kinda felt like they didn't want me to leave. I think about them sometimes, hope they had someone checking on them.",
            "title_similarity": "0.6930218",
            "sentiment_compound": 0.903
        },
        {
            "id": "i4b04ji",
            "score": 1,
            "text": "The lady Gaga and Liza Minnelli moment",
            "title_similarity": "0.281062",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b0m4w",
            "score": 2,
            "text": "I have a 1 year and most elderly love babies, even just watching them. I always stand and let them talk/smile/wave as long as they want!  Especially the ones who have had children; brings a light to their eyes!",
            "title_similarity": "0.50093025",
            "sentiment_compound": 0.7478
        },
        {
            "id": "i4b0oos",
            "score": 1,
            "text": "Oh my God. \nThanks for opening my eyes OP. \nI never really though about old people being lonely that even talking to someone would make their day. \nLike it didn’t even occur to me that old people trying to strike up a conversation and I just went silent because didn’t want any awkward moments.",
            "title_similarity": "0.67630804",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4b0wij",
            "score": 1,
            "text": "True. I had two buddies that were 90 and 97. Both amazing and interesting as heck. They are gone now but I greatly enjoyed them.",
            "title_similarity": "0.5265807",
            "sentiment_compound": 0.8761
        },
        {
            "id": "i4b12xa",
            "score": 2,
            "text": "Marxists wanting to destroy the nuclear family are actually advocating for old people to still be involved in people's lives not just old and discarded people needing to be pushed aside to make room for a new generation that will one day become old and discarded.",
            "title_similarity": "0.5432314",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i4b1kfa",
            "score": 1,
            "text": "Crack a Rosney Dangerfeild joke.\n\nClean, and never fails to make one laugh",
            "title_similarity": "0.4990763",
            "sentiment_compound": 0.8699
        },
        {
            "id": "i4b1p0k",
            "score": 2,
            "text": "The last time I was sitting next to a lone elderly person she cut the line and I told her she was rude. She proceeded to get nasty so we told her that she must not have many friends. She then got up and passive aggressively called her son from a few feet away, talking loudly as if to brag that she is friends with someone. It was funny as shit.",
            "title_similarity": "0.7175727",
            "sentiment_compound": -0.8874
        },
        {
            "id": "i4b21tt",
            "score": 1,
            "text": "My dad is going through this. He’s lost is parents, friends, siblings, and even his wife. He’s lucky to have me around and I do my best to keep him company but even then I know I’m not the same at all.",
            "title_similarity": "0.6639077",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i4b28bq",
            "score": 1,
            "text": "Everyone should listen to the John Prine song \"Hello in there\".",
            "title_similarity": "0.2535968",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b2o5d",
            "score": 1,
            "text": "Man some old lady when me an my homie were walking to get beer stopped us to ask a question , it wasn’t really making sense an she didn’t speak English well I felt bad when we walked away cause she looked kinda like defeated but there wasn’t much we could do , an we wanted beer",
            "title_similarity": "0.67375135",
            "sentiment_compound": -0.3522
        },
        {
            "id": "i4b2tuq",
            "score": 1,
            "text": "I’ve had a lot of fun commiserating with folks while pumping gas lately. Lol. It’s an easy in and out conversation too because when the tank is full you have a great excuse to leave.",
            "title_similarity": "0.622033",
            "sentiment_compound": 0.9217
        },
        {
            "id": "i4b2xgq",
            "score": 2,
            "text": "For an uplifting exception to this, my great-grandma got married at 92 because she \"didn't want to die single\". She died a year later but she got her wish haha",
            "title_similarity": "0.47768497",
            "sentiment_compound": 0.8027
        },
        {
            "id": "i4b2zfe",
            "score": 1,
            "text": "That's their fault for taking care of their bodies and eating well and being cautious. Ha Ha!",
            "title_similarity": "0.574919",
            "sentiment_compound": 0.5983
        },
        {
            "id": "i4b3drj",
            "score": 3,
            "text": "not old, wish someone would reassure me in such a manner",
            "title_similarity": "0.3083775",
            "sentiment_compound": 0.0366
        },
        {
            "id": "i4b3kib",
            "score": 1,
            "text": "You also encounter those who are tired of living and hate everything, and will go off on you for attempting to talk to them. I've seen this too.\n\nKinda related, but you know how once in a while you'll see a cashier ID a senior citizen woman for wine, saying she looks too young? The response almost every time is that the woman is overjoyous, smiles, and loves it, and you can tell it made her year. But I saw it happen once time where the cashier did this, and the woman responded by saying are you fucking kidding me you stupid bitch, I'm old enough to be your great grandma, give me my god damn wine.\n\nSo yeah, not always gonna get the response you expect lol.",
            "title_similarity": "0.6967248",
            "sentiment_compound": 0.8698
        },
        {
            "id": "i4b42mt",
            "score": 1,
            "text": "Nah I’ll play on my mobile instead thanks, if they want a chat they can get a budgie",
            "title_similarity": "0.40856785",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4b43i5",
            "score": 2,
            "text": "This reminds me of some regular customers at the bank branch I was working at. One of the regulars would come in frequently for very minor things mainly as an excuse to come in. We all love the guy though so no worries. He's an old Vietnam vet and is one of the nicest and warmest person you will ever meet. There was a day he came in and was really excited because he was going on the honor flight. So he was getting an expenses paid trip to D.C. to see the memorials and the neat thing was that the volunteers took pictures for him and put them in a personalized book. He brought that in to show us and it was really cool. I keep remembering the shot in there of him breaking down a bit at the wall, and y'all, that straight broke my heart. Don't really know where I'm going with this, mainly wanted to share. Though reading some of the things here makes me wish there were more and better things we could be doing for people like this.",
            "title_similarity": "0.6221038",
            "sentiment_compound": 0.9889
        },
        {
            "id": "i4b4rek",
            "score": 1,
            "text": "A lot of them are lunatics too, last time I did that they started ranting about how Biden is a lizard person and trump is the reincarnation of Christ.",
            "title_similarity": "0.5161771",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i4b5210",
            "score": 1,
            "text": "I've done this since I was a teen. I am 40 today ❤️",
            "title_similarity": "0.24306206",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b5lr6",
            "score": 1,
            "text": "Some of them are pretty grouchy though 🤣",
            "title_similarity": "0.22370622",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4b5zcg",
            "score": 1,
            "text": "no, old people are vulnerable to covid. maintain social distance and wear a mask around them",
            "title_similarity": "0.5367725",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i4b611v",
            "score": 1,
            "text": "What kind of magical lives do people lead that that they only become lonely and miserable after they outlived most of their generation?",
            "title_similarity": "0.5785301",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i4b690t",
            "score": 1,
            "text": "This is a great reminder for us to show some humanity. \n\nMy grandfather lived into his mid 90s and towards the end he had some pretty severe cognitive decline starting in his late 80s. Prior to that he candidly said to me that all of his old friends had passed away. Thankfully he was the definition of a social butterfly and had a bigger social circle in his 80s than I had in my late teens and early 20s but the fact that his lifelong friends had all passed still bothered him.",
            "title_similarity": "0.65205",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i4b6ebv",
            "score": 1,
            "text": "A person who can't be happy alone, has fundamentally missed their life. Make sure to reach that point before it happens to you.",
            "title_similarity": "0.43773746",
            "sentiment_compound": -0.2635
        },
        {
            "id": "i4b6rza",
            "score": 1,
            "text": "Then again, old people in my country just prooved they were a bunch of massive oversized assholes that profited from the \"30 glorieuse\", full employement, retirement at 55, cheap and affordable housing, free healtcare, ect... any utopian dream, you name it.\n\nAnd then all voted for the guy that's gonna destroy all of it for the generations to come. So, no, i won't take the risk to befriend a bunch of rotten meat. There's about a 10 to 15% chance of said old people being a decent human being according to yesterday's election result so...",
            "title_similarity": "0.71095103",
            "sentiment_compound": -0.2928
        },
        {
            "id": "i4b6s11",
            "score": 1,
            "text": "My great uncle says \"I keep getting older and my friends stay the same age\".\n\nThe man is 101 and hangs out with his son's friends (who are in their late 70s) because all his friends are dead.\n\nThankfully, it is a small community and he is very well liked, so he has a steady rotation of neighbors of all ages that come by to say hi.",
            "title_similarity": "0.7240131",
            "sentiment_compound": 0.9466
        },
        {
            "id": "i4b6xtl",
            "score": 2,
            "text": "One asked me for help finding wiper blades. We talked for an hour in Costco about his time in WW2. He stopped and asked if I needed to leave. I said \"no\" because I missed my grandpa's war stories and talking to him made my day. He teared up and said thank you and he has no one left to tell his stories too. \n\nI use to visit Jake for two years after that and have coffee with him on Saturdays. He was a good man and I miss him now too. The man flew B17s. He was an absolute legend and a humble soul. \n\nSo be careful taking this advice but please take it anyway.",
            "title_similarity": "0.7127824",
            "sentiment_compound": 0.3483
        },
        {
            "id": "i4b71ke",
            "score": 1,
            "text": "Mom said the toughest thing about being old is that nobody sees you.\n\nThat's stuck with me.",
            "title_similarity": "0.54293466",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i4b71lo",
            "score": 3,
            "text": "Can confirm. Had a chat with an old lady in the supermarket today.\nI think she felt good about being able to connect with someone.\n\nAs someone who is not old but suffers from isolation and loneliness, I too, enjoy having these little convos with people.",
            "title_similarity": "0.653874",
            "sentiment_compound": 0.325
        },
        {
            "id": "i4b73wk",
            "score": 1,
            "text": "This is why Senior Centers, Senior Living and Nursing Homes, etc. should be built next to playgrounds and community centers. \n\nOur elders are some of the most wise and valuable people in our society, and we leave them all alone to die staring at the same four walls.",
            "title_similarity": "0.6407407",
            "sentiment_compound": 0.1672
        },
        {
            "id": "i4b74wz",
            "score": 1,
            "text": "Yea... but they're still old tho but that doesn't mean they are useless. They have lots of experience and wisdom to share.",
            "title_similarity": "0.43998048",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i4b7dwn",
            "score": 1,
            "text": "This reminds me of John Prine's song [Hello In There](https://www.youtube.com/watch?v=OVhA01J0Zsg)",
            "title_similarity": "0.29780784",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b7m70",
            "score": 1,
            "text": "My Nana had adopted a McDonalds. She is now the friendly grandma figure to the younger people working there. I haven't asked their opinion on being adopted though.",
            "title_similarity": "0.67133665",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4b7okc",
            "score": 1,
            "text": "Thanks for speaking on this -- it's easy to underestimate another's loneliness -- let's keep the love flowing",
            "title_similarity": "0.45170707",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i4b7q1r",
            "score": 1,
            "text": "Damn girl are you a life alert because Ive fallen for you and can’t get up",
            "title_similarity": "0.49301425",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4b7rqe",
            "score": 2,
            "text": "Mama said never talk to strangers.",
            "title_similarity": "0.36613816",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b7vil",
            "score": 1,
            "text": "I just recently had a nice conversation about cars with an old man in the grocery store,his face lit up like a candle as he was reminiscing about his old cars. \nIt totally made my day as well.   \n\nSmall talk can make a big impact!",
            "title_similarity": "0.65435743",
            "sentiment_compound": 0.7712
        },
        {
            "id": "i4b7x7i",
            "score": 1,
            "text": "It reassures them there are still good people in the world too.",
            "title_similarity": "0.22552307",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i4b85xs",
            "score": 1,
            "text": "My mother is a master of this while I'm too enclosed and introverted to try and even make new friends back when I was in school. The way other's faces light up in conversation is a blessing",
            "title_similarity": "0.63778734",
            "sentiment_compound": 0.743
        },
        {
            "id": "i4b8dk9",
            "score": 1,
            "text": "I am such an introvert, but one time I was waiting while my oil was being changed and had like a 20 minute conversation with an older gentleman who was also waiting. It felt like it was good for both of us.",
            "title_similarity": "0.63712454",
            "sentiment_compound": 0.8847
        },
        {
            "id": "i4b8jz2",
            "score": 1,
            "text": "\"Hello In There\" by John Prine",
            "title_similarity": "0.093868546",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b8x9g",
            "score": 1,
            "text": "I did that at a cafe once and he tried to sell me Amway.",
            "title_similarity": "0.5324879",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4b90yh",
            "score": 1,
            "text": "I do! Seniors aren't so weird and standoffish when you try to initiate a random convo I find like most people are.",
            "title_similarity": "0.70269704",
            "sentiment_compound": 0.5734
        },
        {
            "id": "i4b9j2v",
            "score": 1,
            "text": "I currently care for my elderly mom, since moving into her house in the burbs, I've witnessed the \"endgame\" for a few families. \n\nHer neighbors of thirty plus years were moved into an assisted living facility two days ago, and the sadness of it still haunts me. Seeing their empty house, thinking about them in that home; it's really bothering me.\n\nIt brings me back to my mom's situation; no friends, her once vibrant life long over. I don't chat up random elderly when I'm in the city, but I certainly will now that op has brought it up.",
            "title_similarity": "0.6875214",
            "sentiment_compound": 0.2087
        },
        {
            "id": "i4b9zio",
            "score": 1,
            "text": "This is the feeling that scares me most as I grow older. I’m starting to get to that age where a lot of my older relatives are having serious health problems or passing away. I’m just scared of being at the point where I wake up one day as an older man and every connection I’ve ever had to this earth is gone. Idk why but it’s something that I think about often, maybe due to health issues going on with relatives. Not looking forward to the future 😣😢",
            "title_similarity": "0.57011706",
            "sentiment_compound": -0.8294
        },
        {
            "id": "i4ba3tt",
            "score": 1,
            "text": "My dad used to wander around our town and say hello to anyone walking a dog. He loved animals and it was a good way to meet people and say hello.\n\nMum was in a home because of dementia, dad was struggling with disability due to a car accident. I had a six month period of being unemployed, so I would take him out for lunch.\n\nWe'd fallen out years ago and had started reconciling a bit, so things were a lot easier between us.\n\nHe had an epileptic fit once, and I was there to see it and describe it to the ambulance crew that turned up. He'd collapsed about eight times before but nobody knew way - mum didn't describe very well what happened. I did, and they started giving him drugs to control it.\n\nDad died six months later, then we discovered how many people around town knew him. I guess he had plenty of time to make friends.\n\nI notice as I'm getting older I have less and less friends alive. I didn't grow up in one place, so don't have any childhood friends and never found it easy making new ones. I do have a partner though.",
            "title_similarity": "0.6931709",
            "sentiment_compound": 0.8378
        },
        {
            "id": "i4ba42h",
            "score": 1,
            "text": "Back in 2009, when I was 24, the high-production movie of the opera La Bohéme was doing a special tour in the US for select movie theaters, and it came to my town for one day, one showing only. I had invited six acquaintance-friends and my mother (I really struggled to make real friends). One by one, they all bailed on me, even my mother did. I felt really sad, believing that just no one wanted to go with me. Ultimately, I decided to go alone, which I felt embarrassed at going to a movie alone, but I really wanted to see it, and this was my only chance. Low and behold, it ended up being only myself and an elderly woman in the entire theater. I sat in the back, she in the front. When it was over, we both went toward the exit, and I said, \"That was really beautiful.\" She smiled and agreed, asking if I knew where it was filmed, which I responded I didn't. We decided to both wait and watch all the credits to find out, and continued chatting all the while about the movie, about what we enjoyed most about it, and how we heard about it. Turns out, she had invited a couple friends who bailed on her also, and she was excited for this movie because she can rarely afford tickets to the live theatre operas. We only chatted for maybe five or six minutes, and we never even exchanged names, but I like to think that time we shared meant a lot to both of us.",
            "title_similarity": "0.6219186",
            "sentiment_compound": 0.9864
        },
        {
            "id": "i4badrh",
            "score": 1,
            "text": "Careful if you do that with my grandpa. If someone starts a conversation with him, you're trapped in a 5 hour conversation with him. He LOVES talking, unfortunately my grandma has grown a bit tired of hearing the same stories so she just goes \"Mmmmmm\" after like 60 years of marriage, so whenever he has the opportunity to tell his stories to a new ear he will talk forever. I love that man with all my heart.",
            "title_similarity": "0.6460773",
            "sentiment_compound": 0.9008
        },
        {
            "id": "i4bamud",
            "score": 1,
            "text": "Your befriending could also prevent a nefarious person's I'll intentions, in the long run...",
            "title_similarity": "0.36911094",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4bav0x",
            "score": 1,
            "text": "Maurice Sendak (Where the Wild Things Are) did an interview on NPR (Fresh Air, I think), where he talks about outliving all of his loved ones. It was captivating and heartbreaking to listen to.",
            "title_similarity": "0.57993233",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4baxec",
            "score": 1,
            "text": "This makes me so sad. I love talking to our elders, and resonate with that pain. I am only 22 and have sadly outlived all of my friends. So many beautiful souls, I can never wrap my head around why all of them were taken at such a young age. \nLucky for me, time helps heal wounds. And I hope to think I have time left to heal and possibly even make new friends that I’ll share a similar relationship with. It breaks my heart to think how it would feel if I didn’t have that possibility 💔",
            "title_similarity": "0.66874015",
            "sentiment_compound": 0.9664
        },
        {
            "id": "i4bbdsz",
            "score": 1,
            "text": "I said “you’re good” when scooting my cart past an elderly man at the grocery store and he replied “you’re the first person who’s spoken to me in months.” The pandemic has isolated them even more. 😞",
            "title_similarity": "0.69139636",
            "sentiment_compound": -0.6901
        },
        {
            "id": "i4bbg5p",
            "score": 1,
            "text": "Fuck. This made me tear up. My grandma and grandpa on both sides died when I was still young. I miss them so much. So every chance I get to interact with the old folks, I do so. I once escorted an elderly couple trying to go to a mall 7 train stations away. They were asking how to get there. I'm also on my way home after work and I don't have anything to do so I told them I'll come with them and bring them there. The old couple were super shocked that someone would go out of their way to help them. They were super thankful to me and offer to treat me to dinner, I refused because I know they both want to be on this date. They thanked me again then I left. Little did they know, I'm the one whose thankful to them. For atleast a couple of hours, I get to have my grandparents back.",
            "title_similarity": "0.70812285",
            "sentiment_compound": 0.931
        },
        {
            "id": "i4bbgfb",
            "score": 1,
            "text": "No thanks, too high a chance of them being a bigot, or them trying to talk down to me about things they couldn't possibly understand.",
            "title_similarity": "0.41492298",
            "sentiment_compound": -0.1043
        },
        {
            "id": "i4bc0v1",
            "score": 1,
            "text": "The people who use it to justify their own flaws",
            "title_similarity": "0.24714291",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bc11b",
            "score": 1,
            "text": "I work in elder care. B/c.of the pandemic many people are not volunteering as much, but they still need help with games and fun events, most have very little budget for activities. Hell I know one nonprofit that can't keep staff since they have no budget, and low pay so they just got rid of it and rely on volunteers. \nEven just coming by and sharing a musical talent or a story is more than they will do most days, staring at TV's.",
            "title_similarity": "0.71859443",
            "sentiment_compound": 0.6187
        },
        {
            "id": "i4bccmg",
            "score": 1,
            "text": "If you spy a geezer at Mickey D's, always say \"howdy, thank you and please.\" Think of stories and jokes to tell, because their life's a living hell.",
            "title_similarity": "0.7008619",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i4bd33m",
            "score": 1,
            "text": "They looted the futures of their children and gave us the finger when we asked for the most basic essentials to survive. But sure, why not.",
            "title_similarity": "0.4321536",
            "sentiment_compound": 0.4497
        },
        {
            "id": "i4bd6u3",
            "score": 1,
            "text": "My neighbor is an older retired fella that lives alone. He stops me everytime we're outside at the same time to chit-chat. I always let him go on and on, even if he repeats past stories. I was sure he hadn't remembered my name from our first introduction, so I had the idea to write my name and number on a piece of paper and gave it to him. Not only does he now know my name, he also calls every other day now. Haha. I don't mind.",
            "title_similarity": "0.7426689",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i4bdakt",
            "score": 1,
            "text": "Man I’m so lonely at 32 I honestly am glad when people engage with me unprompted, I’m in for it when I get older aren’t I? 🥹",
            "title_similarity": "0.6570847",
            "sentiment_compound": 0.632
        },
        {
            "id": "i4bdc3j",
            "score": 1,
            "text": "Years ago I went to visit some friends in college and we went out and got absolutely hammered. I thought it was a good idea to drink 151. I woke up at 6am, puked, and had fitful sleep for a couple of hours. Finally I decided I was hungry and nobody else was awake so I decided to walk to Burger King which was about a mile away. It was a long and miserable walk but I made it and I needed food stat. \n\nWhile I’m waiting in line an old man lined up behind me and starts talking with me. I feel like absolute dog shit, I probably reek of booze and all I want is to sit in silence and eat my food. \n\nUnfortunately, for me, I am very bad at turning people away or setting boundaries when being spoken to so I continue to chat with the guy while I wait in line. Finally, I reach the front of the line, place my order and get my food. I take my food and sit down at a booth and start eating my fries. The old man followed me and sat down with me. This shocked me because I would never do that to someone and I just wanted to eat my food. My head felt like a bowling ball that was being struck by lightning repeatedly. However, I continued to chat with the guy and he was very nice and told me about his life and the art he enjoys doing in his free time. \n\nIt wasn’t the way I wanted to spend my morning but I’m glad I did. The walk back was more miserable than the walk to Burger King and when I arrived back at my friend’s place I threw up again. \n\nThe end.",
            "title_similarity": "0.70356894",
            "sentiment_compound": -0.6516
        },
        {
            "id": "i4bdge9",
            "score": 1,
            "text": "Let me tell you how fast it all goes by. One day I woke up and looked into the mirror, only to see my FATHER looking back at me. I wondered where the time went. It was only yesterday, carefree about life, saying I’ll do it tomorrow. Aging ain’t fer sissies, people. Live your life right now. Make those connections with people. Do it all in love.",
            "title_similarity": "0.5168052",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i4bdj4p",
            "score": 1,
            "text": "This is such a helpful post. \n\nI generally try to do it, but sometimes I just get wrapped up in 'non-stop life thoughts' and completely miss the moment. I will work on that.",
            "title_similarity": "0.53484267",
            "sentiment_compound": -0.1128
        },
        {
            "id": "i4bdrq7",
            "score": 1,
            "text": "We had an apartment in the city.\n\nMe and Loretta like living there...",
            "title_similarity": "0.17056969",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4bedgt",
            "score": 1,
            "text": "I'm a golfer and yesterday the weather was really nice so I decided to walk 9 holes at the local par 3. Played the first hole and walked up to the 2nd and there was a guy in his late 70s sitting on a bench with his clubs. He said \"I'm pretty slow, you can play through. Or maybe I can play with you if that's ok.\" I said sure we can play together and we spent the next couple hours playing, talking about our lives and families. Turns out he was a marine corps scout sniper in Vietnam and he ran a pool hall in NYC after the war. He had a bunch of crazy stories from all of those experiences. At the end of the round, we had a drink at the club house and exchanged numbers so we can meet up and play again in a couple weeks. The cool thing is while I'm sure it made his day to have someone to talk to, it made mine too.",
            "title_similarity": "0.5855212",
            "sentiment_compound": 0.9493
        },
        {
            "id": "i4behl4",
            "score": 1,
            "text": "And then be prepared to sit and and indulge them for hours. Its nice to engage but dont be afraid to say \"gotta go!\" when the conversation turns pointless. I made an effort at the library the other day and I realized in 2 minutes, this person had isolated himself. You dont need to feel sorry or the need to give anyone more than common courtesy.",
            "title_similarity": "0.685781",
            "sentiment_compound": 0.5555
        },
        {
            "id": "i4bekua",
            "score": 1,
            "text": "My great aunt has Alzheimer's, and has become extremely flirty (in a rather conservative religious family). I definitely enable her, acting like a handsome prince escort, and making up scandalous stories about our other family members that she doesn't remember. \n\nIt gets her to laugh like the old her. She doesn't remember anyone, but still has her dark sense of humor.",
            "title_similarity": "0.67801917",
            "sentiment_compound": 0.8441
        },
        {
            "id": "i4betml",
            "score": 1,
            "text": "Also, visit your grand parents while you still have them.  I really regret not spending more time with mine when they were around.  They died suddenly in an accident and we never even had the late stages where they were in a home or we knew the end was near.  Ask them about old stories.  It's something you'll always remember and regret not doing.",
            "title_similarity": "0.64919186",
            "sentiment_compound": -0.8622
        },
        {
            "id": "i4bezkj",
            "score": 1,
            "text": "As someone that works at McDonald’s. Please do this. They are often the nicest people you’ll meet and love to tell stories. Can make a normal day into a good one.",
            "title_similarity": "0.6221204",
            "sentiment_compound": 0.9118
        },
        {
            "id": "i4bfi9b",
            "score": 1,
            "text": "Thank you for this wholesome tip. It really resonates with me today and I will try to remember it moving forward",
            "title_similarity": "0.29324102",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4bfkwv",
            "score": 1,
            "text": "My elderly neighbor just commuted suicide, and I really wish I had been more of his friend. I totally agree with this post",
            "title_similarity": "0.7013061",
            "sentiment_compound": 0.5789
        },
        {
            "id": "i4bfxhm",
            "score": 1,
            "text": "I always feel so sad when I see elderly people alone, but I never have the courage to interact with them :(",
            "title_similarity": "0.57089263",
            "sentiment_compound": -0.883
        },
        {
            "id": "i4bg7l8",
            "score": 1,
            "text": "I always say Hi to people who are alone. Doesn’t matter what age they are. Just to acknowledge them.",
            "title_similarity": "0.5788102",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i4bgc3o",
            "score": 2,
            "text": "No. If I was them I wouldn’t want to talk with people.",
            "title_similarity": "0.2553271",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4bghpe",
            "score": 1,
            "text": "This is one we should all do bc if you’re lucky it ll be you one day.",
            "title_similarity": "0.1856732",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4bgn4k",
            "score": 1,
            "text": "[Hello in there - John Prine](https://youtu.be/RfwGkplB_sY)",
            "title_similarity": "0.18822819",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bgrrf",
            "score": 1,
            "text": "Thank you for this.  I always go out of my way to smile or make a comment to any elderly person I see by themselves.",
            "title_similarity": "0.71301055",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i4bgsqf",
            "score": 1,
            "text": "I feel bad sometimes. I find myself in convos with old people in passing but because of my anxiety, I feel maybe I made them feel weird or like I couldn't wait to get away. Happened the other day in a parking lot, the convo kinda just ended as we went in different directions, I didn't realize he was still talking to me.",
            "title_similarity": "0.703648",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i4bgtqd",
            "score": 1,
            "text": "but why mcdonalds",
            "title_similarity": "0.39841282",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bgvv8",
            "score": 1,
            "text": "Im 48 and outlived many -  smallest generation and … dropping like flies.  Good news zoomers… we gonna X the fuck outta yer way and outta this shuzhole.  Youre welcome",
            "title_similarity": "0.48274553",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i4bgy7e",
            "score": 1,
            "text": "I owned a handyman business for 8 years. Almost every client over 60 that I did work for was more involved in basic conversation over the work actually being done.",
            "title_similarity": "0.42965105",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bhb87",
            "score": 2,
            "text": "This is probably my favorite LPT I've seen on here. So wholesome 🥰",
            "title_similarity": "0.3295542",
            "sentiment_compound": 0.8905
        },
        {
            "id": "i4bhbvu",
            "score": 1,
            "text": "Not only that but they have really good wisdom they give out for free",
            "title_similarity": "0.3122809",
            "sentiment_compound": 0.9409
        },
        {
            "id": "i4bhhjw",
            "score": 1,
            "text": "I tried this but all she talked about was the “coloured” problem 😞",
            "title_similarity": "0.36154056",
            "sentiment_compound": -0.8271
        },
        {
            "id": "i4bhne1",
            "score": 1,
            "text": "One time I did this, and the guy told me he had something on his phone he wanted to show me... It was porn. I didn't really want to look at porn with him, so I just kinda laughed it off and walked away",
            "title_similarity": "0.6239252",
            "sentiment_compound": 0.3112
        },
        {
            "id": "i4bhsvy",
            "score": 2,
            "text": "That wonderful advice! Thank you!",
            "title_similarity": "0.09991995",
            "sentiment_compound": 0.7772
        },
        {
            "id": "i4bhtrp",
            "score": 1,
            "text": "Maybe they want peace and don't want to be bugged. You never know what somebody is currently dealing with so don't just pester them.",
            "title_similarity": "0.45643574",
            "sentiment_compound": 0.5541
        },
        {
            "id": "i4bhwlf",
            "score": 1,
            "text": "I used to do this at my University's rec center. We were close to a retirement village and they would bus in seniors to get some light exercise in the mornings.  I would always offer to walk and talk with them or help spot them if they were still able to do some lifting. The stories I got to hear and the look of excitement some would give me when they would see me come in the gym was so much fun.  If I hadn't become a professor I would definitely be an entertainment coordinator at a elderly living facility.",
            "title_similarity": "0.61127925",
            "sentiment_compound": 0.9322
        },
        {
            "id": "i4bhz71",
            "score": 1,
            "text": "This reminds me of my saddest day ever. \n\nMy grandfather was a Holocaust survivor and he retired in South Florida and didn't drive at all. When I was in high school (2006), he would ask me to drive him to the mall every Thursday after school and he would go to the food court where maybe 20 old guys (many also Holocaust survivors) would sit and chat for an hour or two and then I'd drive him home.\n\nWhen I moved back after grad school (2013) he asked me to take him to the mall to see his old friends. No one had taken him since I left.\n\nWe get to the mall and there was no one there. I felt so bad for my grandpa. But then we notice one old man sitting next to a woman in scrubs (a nurse/his aide) we went up to him and sure enough, he was from the group. He cried and held my grandpa's hands for 10 minutes. I was crying so hard. His aide said she had been working for him for over a year and they came every Thursday to sit but none of his group ever showed up, my grandpa was the first friend the guy had seen in over a year. All the rest had passed away.\n\nMy Gramps passed in 2020 from covid at age 99. Dude was happy till his last day.\n\nRIP Abe.",
            "title_similarity": "0.67033815",
            "sentiment_compound": -0.0503
        },
        {
            "id": "i4bi3r9",
            "score": 1,
            "text": "Absolutely fucking not. I hate when people I don't know talk to me, and I will still hate it when I'm old. People vary.",
            "title_similarity": "0.57293475",
            "sentiment_compound": -0.1125
        },
        {
            "id": "i4bi4uq",
            "score": 2,
            "text": "This!\n\nMy grandmother-in-law lived until she was 101 years old and then some. Her greatest complaint? That all her friends were long since gone, most of them died well before she was 85.",
            "title_similarity": "0.5096797",
            "sentiment_compound": 0.5615
        },
        {
            "id": "i4bi90s",
            "score": 1,
            "text": "whenever i go pickup groceries at my local grocery store tons of old people just start talking to me, i always converse with them but i always find it funny that of every1 in the store im the approachable one. last weekend i was grabbing apples and the old lady told me how much she preferred oranges over apples, literally copmaring apples to oranges... good times :D",
            "title_similarity": "0.7077926",
            "sentiment_compound": 0.9354
        },
        {
            "id": "i4bi93y",
            "score": 1,
            "text": "Jesus fucking Christ, I come in here for my weekly Filet o' Fish and this motherfucker's hasslin' me...",
            "title_similarity": "0.5302814",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bigiv",
            "score": 1,
            "text": "Omg this mad me so sad, I’m gonna try that",
            "title_similarity": "0.33628586",
            "sentiment_compound": -0.7645
        },
        {
            "id": "i4birui",
            "score": 1,
            "text": "My grandmother lived alone for a long time, and a few years before she died a new family moved in next door. I guess they had a teenage son who would always wave and make a joke about the weather or something if they both happened to be out getting their mail. And it probably seemed like nothing to him, but I'd talk to her on the phone and she'd go on about how nice the neighbors son was and how he always talked to her and how he brightened her whole week with his jokes. \n\nThose little things really go a long way.",
            "title_similarity": "0.70308626",
            "sentiment_compound": 0.872
        },
        {
            "id": "i4biwvy",
            "score": 1,
            "text": "A lot of the replies on here dwell on the negative. While everything the OP says is true there is an upside. I am 83. While I have outlived most of my family and friends, I have also outlived my enemies, ex-wives and girl friends and many companies I have worked at. So there is that, but the LPT is still good.",
            "title_similarity": "0.6700061",
            "sentiment_compound": 0.6858
        },
        {
            "id": "i4bix3a",
            "score": 1,
            "text": "This also helps people with small kids or anyone over 35",
            "title_similarity": "0.21851231",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i4bj68b",
            "score": 1,
            "text": "LPT: an older friend told me once that she was told by an older friend to always make sure you have younger friends.  Because as you get older and your friends die you are sure you still have friends.  \n\nSo, the real LPT is to always have friends of all ages.",
            "title_similarity": "0.59900457",
            "sentiment_compound": 0.9552
        },
        {
            "id": "i4bj7jh",
            "score": 1,
            "text": "They shouldn't be out, those quilts aren't gonna make themselves.",
            "title_similarity": "0.2661006",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bj7up",
            "score": 1,
            "text": "Or them them alone because a lot of people eating at McDonald's by themselves are just eating lunch and don't want to interact with you.",
            "title_similarity": "0.73621464",
            "sentiment_compound": -0.3009
        },
        {
            "id": "i4bjas0",
            "score": 1,
            "text": "I worked at a McDonald's years ago\n\nMy boss once said to me that if an elderly person begins to chat away at the front of the queue, take 2 minutes to have a conversation with them, because you might be the only person they speak too that day. \n\nI was 17 at the time and that shit hit me hard.\n\nSince then I made it a point to strike up conversation as and when I could, because that's how I would want it when/if I ever get to that point",
            "title_similarity": "0.7258959",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i4bjk20",
            "score": 1,
            "text": "You are a kind stranger 😢",
            "title_similarity": "0.3369137",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4bjozm",
            "score": 1,
            "text": "I distinctly remember listening to my great-uncle tell stories at a family reunion.  He was 90 or so at that point, lived to 94, and most of his stories ended with \"but they're dead now\".  \n\nHe also joked occasionally.  We were visiting their house once when my great-aunt was asking him where a pie pan was, or some other kitchen implement that he'd never touched in his life except to eat out of, and him being hard of hearing goes \"WHAT?\".  After she repeated it, he says \"KISS YOUR WHAT?\" and winked at my brother.  She just shook her head and went back to looking around.",
            "title_similarity": "0.7303216",
            "sentiment_compound": -0.1927
        },
        {
            "id": "i4bjqd3",
            "score": 1,
            "text": "Ah, look at all the lonely people.",
            "title_similarity": "0.38540804",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4bjri0",
            "score": 1,
            "text": "Ah, look at all the lonely people.",
            "title_similarity": "0.38540804",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4bjsa2",
            "score": 1,
            "text": "\"We had an apartment in the city / \nAnd me and Loretta liked living there / \nWell it'd been years since the kids had grown / \nA life of their own, and left us alone\n\nJohn and Linda live in Omaha / \nAnd Joe is somewhere on the road / \nAnd we lost Davy in the Korean war / \nAnd I still don't know what for, it don't matter anymore\n\nYou know that old trees just grow stronger / \nAnd old rivers grow wilder every day / \nOld people just grow lonesome / \nWaiting for someone to say, \"Hello in there, hello\"\n\nMe and Loretta, we don't talk much more / \nShe sits and stares through the back door screen / \nAnd all the news just repeats itself / \nLike some forgotten dream that we've both seen\n\nSomeday I'll go and call up Rudy / \nWe worked together at the factory / \nBut what could I say if he asks, \"What's new?\" / \n\"Nothing, what's with you? Nothing much to do\"\n\nYou know that old trees just grow stronger / \nAnd old rivers grow wilder every day / \nOld people just grow lonesome / \nWaiting for someone to say, \"Hello in there, hello\"\n\nSo if you're walking down the street sometime / \nAnd spot some hollow ancient eyes / \nPlease don't just pass 'em by and stare / \nAs if you didn't care, say, \"Hello in there, hello\"\n\n(Prine, John. \"Hello in There.\" *John Prine*. Atlantic, 1971. Transcript of Lyrics.)",
            "title_similarity": "0.69847035",
            "sentiment_compound": -0.2591
        },
        {
            "id": "i4bjsle",
            "score": 1,
            "text": "hell naw i hate old people",
            "title_similarity": "0.41900682",
            "sentiment_compound": -0.8519
        },
        {
            "id": "i4bjv07",
            "score": 2,
            "text": "I'm 58 this year. Let me eat in peace! I'm sitting alone at the bar by choice. I'm sitting alone at a table for 2 by choice. If you are lonely, sure, take a seat. But don't assume I want company.",
            "title_similarity": "0.70056045",
            "sentiment_compound": -0.1217
        },
        {
            "id": "i4bjy35",
            "score": 1,
            "text": "I already eat alone and I’m 42. Yes I am lonely. No I don’t have any friends.",
            "title_similarity": "0.5911902",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4bk3we",
            "score": 1,
            "text": "Just because people are old doesn’t mean that they welcome strangers for awkward conversations. What a shitty fucking tip lol",
            "title_similarity": "0.60440934",
            "sentiment_compound": 0.2212
        },
        {
            "id": "i4bk9d2",
            "score": 1,
            "text": "Why would I \"spy\" lonely elderly people at Mcdonald's? Is this a new trending hobby?",
            "title_similarity": "0.7813138",
            "sentiment_compound": -0.4329
        },
        {
            "id": "i4bkaf8",
            "score": 1,
            "text": "Someone is gonna get stabbed with this advice",
            "title_similarity": "0.2762832",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4bkbpz",
            "score": 1,
            "text": "What can we do to help elderly people still have a social life? They struggle to make \"new friends\" or find \"new interests\" and end up very idle.",
            "title_similarity": "0.664336",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i4bkf6o",
            "score": 1,
            "text": "Meanwhile elderly people are like...\n\n\"I cannot eat u breakfast at Mcdonald in peace. These young kids won't stop bothering me for no reason...\"",
            "title_similarity": "0.788825",
            "sentiment_compound": 0.7828
        },
        {
            "id": "i4bkgji",
            "score": 3,
            "text": "Only if you can get out of there before they can latch on. Some old people are alone for a reason. They are crazy nutsacks who have driven everybody out of their life and now see your interaction as someone else to be crazy at. \n\nSo just use your best judgement when dealing with ANY strangers. Have an out ready to go.\n\nEdit to add my experience:  Sweet older lady with a cane that walks past my house every day to the shop on the corner. \n\nAlways looks kind of sad and alone. Finally made up my mind to give her a ride one day as I was leaving the house. Big mistake.\n\nOver the next few months she constantly harassed me and my family for change for beer. Asked the neighbors and she’s apparently a raging alcoholic. \n\nI told her no politely at first. She bugged me, my wife, my mom. Until I outright told her not to bother us. \n\nOne day my son is taking out trash and she follows him to the dumpster asking for change.\n\nHad to tell her I’d suplex her if she talked to me or my family again. She has left us alone.\n\nEdit again to add: she was not homeless. She lived in the same set of apartments/condos we did and they weren’t on the low end.",
            "title_similarity": "0.73236823",
            "sentiment_compound": -0.9281
        },
        {
            "id": "i4bknbh",
            "score": 1,
            "text": "This one really hit me.\n\nI'm very introverted, and don't easily make friends. I'm in my mid-40's -- and at the rate things are going with those whom I have counted amongst my close friends -- if I don't die off before then, I'll very likely be a loner by the time I'm in my early 60's. I can assure you, if someone follows this LPT and I'm on the receiving end, it will indeed mean a lot more to me than any stranger would likely expect.\n\nWas not prepared for these feels on a Monday.",
            "title_similarity": "0.6228099",
            "sentiment_compound": 0.2709
        },
        {
            "id": "i4bktl7",
            "score": 1,
            "text": "\"So if you're walking down the street sometime,\n\nAnd spot some hollow, ancient eyes\n\nPlease don't just pass them by and stare\n\nSay hello in there, hello\"\n\nI love John Prine's music. He was an early casualty of Covid in 2020.",
            "title_similarity": "0.5838779",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i4bkuft",
            "score": 1,
            "text": "Due to legal issues at another venue in my company my work makes us scan every bodies ID everybody regardless of age and in fact, older folks absolutely light up when you ask to see their ID, one in every ten or so gets really pissed off about it but those other 9 make it all worth it",
            "title_similarity": "0.6170138",
            "sentiment_compound": -0.0717
        },
        {
            "id": "i4bkys2",
            "score": 1,
            "text": "Here’s John Prine’s view on this: [Hello In There](https://youtu.be/VKoYHFVBpEA)",
            "title_similarity": "0.19044824",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bkyto",
            "score": 1,
            "text": "Damn this post made me so sad.  I’ll keep this in mind",
            "title_similarity": "0.37895307",
            "sentiment_compound": -0.7712
        },
        {
            "id": "i4bl3lr",
            "score": 2,
            "text": "I assume this is true but, from my experience most elderly people actually want to be left alone and unbothered by others.",
            "title_similarity": "0.6291785",
            "sentiment_compound": -0.0387
        },
        {
            "id": "i4blb6o",
            "score": 1,
            "text": "Yeah, old people can talk. It's always sad when I've been having a great conversation with someone 60+ years my senior, and then I have to leave because I have other people's bugs to treat. I can see the joy peave because they know they'll be alone for however long. It's sad and I wish i could just keep talking with them. The lonely ones are nice. The old ones with a life are the grumpiest people I've ever met.",
            "title_similarity": "0.74690443",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i4blf5l",
            "score": 1,
            "text": "This is how I ended up inviting a 60 year old lesbian couple to my 4th of July cookouts.",
            "title_similarity": "0.45795426",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4bli0i",
            "score": 1,
            "text": "This is so simple and yet huge. Great idea. Warms my heart just thinking about it. \nI used to work in a nursing home. Elderly people have a lifetime of stories.",
            "title_similarity": "0.47265357",
            "sentiment_compound": 0.9136
        },
        {
            "id": "i4blp5t",
            "score": 1,
            "text": "I don't know man, then they want to talk n shit.",
            "title_similarity": "0.29985353",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i4bm2f9",
            "score": 1,
            "text": "Can we just clarify that an elder person is one that is 75+ ish.\n\nEdit: I'M NOT OLD YOU ARE OLD.",
            "title_similarity": "0.2624362",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bm538",
            "score": 1,
            "text": "I have “old people hobbies” like sewing and crafts (they’re old people hobbies here and not co-opted by trendy hipsters). The old people will strike up conversations with you without even making an attempt. I went to a yarn store with nothing better to do that day and an old lady spent an hour describing what each yarn was good for since I don’t knit or crochet (it didn’t annoy me, I was actually curious!)\n\nHonestly, if you have social anxiety, get an “old person hobby” and go to the stores with the supplies.",
            "title_similarity": "0.6722218",
            "sentiment_compound": 0.5402
        },
        {
            "id": "i4bm55l",
            "score": 1,
            "text": "While I was traveling, I visited a McD near my hostel often. There was an old man there every morning, and one day I decided to join him for breakfast when there weren’t any seat’s available. We got to chatting and he told me how his family started in the flower business, and when Zhiang Kai Shek came to Taiwan, they needed to look official, and order lots or wreathes from his family whenever there were any official announcements or company openings. This made them rich over time, but because his next generation wasn’t into the flower business, eventually the business closed. \n\nIt was his little contribution to history, and I’m glad I listened.",
            "title_similarity": "0.66253245",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i4bm5fr",
            "score": 1,
            "text": "As a “Customer Experience” volunteer at a hospital, my greatest joy is speaking with elderly patients. They often share their life experiences. \n\nOr, share a their deepest desires. Last November when  a patient’s wife spoke about Christmas plans, her husband turned toward me, crossed two fingers and whispered, “I hope I make it.” \nAfter I walked into the hallway, I sobbed.",
            "title_similarity": "0.5546001",
            "sentiment_compound": 0.9081
        },
        {
            "id": "i4bm6wy",
            "score": 1,
            "text": "I work in a grocery store, and my favorite customers are the elderly regulars (mostly old men, elderly women are a totally different experience). My interactions with these specific older customers always make my day and I can tell they also look forward to seeing me and chatting about mundane things too.",
            "title_similarity": "0.7522622",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i4bmd2t",
            "score": 2,
            "text": "Or, like, leave them the fuck alone because many people like it that way.",
            "title_similarity": "0.5101923",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4bmd9h",
            "score": 1,
            "text": "I think this is a great LPT. A lot of times I think we put older people into (metaphorical) boxes and think they’re out of touch or not interested, but as I’ve gotten older I’ve found it not to be the case.\n\nI host trivia nights at bars a couple days a week and an older couple I initially thought seemed not so pleasant are literally the sweetest people I’ve ever met, and we really enjoy seeing each other and talking every week.\n\nSocial interaction keeps us young and connected. Also this reminds me I’m a piece of shit and need to call my grandmother.",
            "title_similarity": "0.73666143",
            "sentiment_compound": -0.591
        },
        {
            "id": "i4bn90b",
            "score": 1,
            "text": "My great aunt lived to be 100 years old - had to watch her own children die of old age.  She used to joke that \"God forgot to pick me up!\"",
            "title_similarity": "0.5604818",
            "sentiment_compound": 0.5848
        },
        {
            "id": "i4bnbe2",
            "score": 1,
            "text": "Same goes for homeless people.",
            "title_similarity": "0.31250975",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bnud8",
            "score": 1,
            "text": "I sometimes see an old man alone at McDonald’s and think. “Why, I should go chat with this old man. He probably doesn’t have many friends left who are able to have normal conversations with him. His kids are grown and gone and maybe his wife has recently passed.  I’m going to spread happiness and go chat with him.”\n\nAnd then I think “I wonder what he was like as a young man. Maybe he was a soldier, or a doctor! Wouldn’t that be something!” But then I think “but, what if he is a child molester? Lots of people used to be child molesters back then. People used to just sorta turn the other cheek to that sorta thing.  Nah, he’s not a child molester.  But what if he is, then I’d be sitting there cheering up a child molester. I can’t do that. I mean here’s a man who in his youth, when he was strong decided to use his power to abuse children, and now in old age expects kindness and sympathy? At a time when he was strong he used it against the weak for his own selfish gains? Oh no I’m not sitting with him. He should be thankful I don’t beat the ever loving fuck out of him right here!” \n\nSo that’s why I don’t do this particular LPT.",
            "title_similarity": "0.82173085",
            "sentiment_compound": 0.8375
        },
        {
            "id": "i4bnui8",
            "score": 1,
            "text": "I love to compliment old women on their jewelry and ask them about where they got it. most often they’ll tell me about where it’s from or why they love it and and I love hearing how happy they are to talk about their favorite pieces. :)",
            "title_similarity": "0.45395643",
            "sentiment_compound": 0.9786
        },
        {
            "id": "i4bnvpa",
            "score": 1,
            "text": "I work retail and I NEVER rush elderly customers who get chatty. For some folk, it's the only conversation they'll have that day. I make sure they feel like whatever they said to me was important and the most interesting thing I heard that day.",
            "title_similarity": "0.6585999",
            "sentiment_compound": 0.8221
        },
        {
            "id": "i4bo13s",
            "score": 1,
            "text": "Counterpoint: Fuck old people",
            "title_similarity": "0.3695857",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4bo59h",
            "score": 1,
            "text": "Half this sub: If you see someone in public talk to them, they might be depressed and need support\n\nThe other half: if you see someone in public don't talk to them, they might be introverts and you'll make them depressed",
            "title_similarity": "0.54115343",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i4bodpt",
            "score": 1,
            "text": "If people knew how much insight could be gained by befriending someone with that many years of life experience there would be a line forming to speak to the elderly. But when you are young sadly you don't value that information.\n\n Just a simple smile and 'Hi, how are you doing today?' can really make someone's day.",
            "title_similarity": "0.69804466",
            "sentiment_compound": -0.2969
        },
        {
            "id": "i4bor3p",
            "score": 1,
            "text": "Thanks! Haven't thought of that.",
            "title_similarity": "0.20200266",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i4bp10d",
            "score": 1,
            "text": "I'm just afraid of seeming weird or bothering them- this goes with any stranger I don't know. \n\nHonestly the internet has made it so I love speaking to strangers- so many interesting lives with incredible and unique stories.\n\nI just- can't bring myself to do it in real life. Though the world is such a beautifully diverse place.",
            "title_similarity": "0.64367443",
            "sentiment_compound": 0.7489
        },
        {
            "id": "i4bp790",
            "score": 1,
            "text": "Random story I don't often get to tell: I had a motorcycle in college. Thing couldn't go over 65 downhill with the wind, so I took backroads. In a car, going from my home to college was 2 hours. Oh my bike it was 4.5 hours of cautious scenes, vistas, water fronts, back country winding roads, and over all loveliness. There was this one McDonalds I stopped at by chance once. And it was COMPLETELY FULL OF OLD PEOPLE. OF ALL WALKS OF LIFE\n\n\nLike the workers all were over retirement age. The patrons sat around and chilled playing cards or watching the TV. It was absolutely wonderful. They had set up there own little clubhouse at a McDonalds and it worked. From then on I always stopped there and even insisted on stopping and eating in on some road trips. They would just come over and talk to you and just genuinely have a nice time.",
            "title_similarity": "0.64733744",
            "sentiment_compound": 0.807
        },
        {
            "id": "i4bpooh",
            "score": 1,
            "text": "Nice try grandpa",
            "title_similarity": "0.2886899",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4bqb8u",
            "score": 1,
            "text": "It’s not necessarily that older people are lonely, it’s also that many of them have lived past the point where they just don’t care what people think about them any more so they’re more likely to have fun with a stranger in public. Elderly women are way more fun to flirt with than college girls.",
            "title_similarity": "0.6723749",
            "sentiment_compound": 0.8221
        },
        {
            "id": "i4bqepj",
            "score": 1,
            "text": "Thanks man what I wonderful advice.. I really like chilling with elderly people they're so laid back and sweet 😄",
            "title_similarity": "0.5524733",
            "sentiment_compound": 0.9478
        },
        {
            "id": "i4bqnzf",
            "score": 1,
            "text": "I'm not entertaining your grandparents because you ignore them. I've already masked up and isolated on their behalf.",
            "title_similarity": "0.5396744",
            "sentiment_compound": -0.7356
        },
        {
            "id": "i4brbtg",
            "score": 1,
            "text": "And some of them are dicks who are alone bc their family isn't putting up with their shit anymore",
            "title_similarity": "0.5844928",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i4brnan",
            "score": 1,
            "text": "What a weird thing to assume about other people. If you see me alone at McDonald's, please leave me alone.",
            "title_similarity": "0.69680285",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i4broi5",
            "score": 1,
            "text": "And how the fuck does that help me?",
            "title_similarity": "0.06297663",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4brpc3",
            "score": 1,
            "text": "This is just plain wrong. Old people don't need companionship. They need to be isolated and studied so it can be determined what nutrients they have that might be extracted for our personal use.",
            "title_similarity": "0.5982826",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4brx9t",
            "score": 1,
            "text": "Another big problem with this is that many young people think 50 is elderly. My coworkers and I like to joke about it since we hear it a lot. And apparently we're all \"elderly\" lol",
            "title_similarity": "0.70974326",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4bs1dx",
            "score": 1,
            "text": "Yeah, as you age, more and more people you know die. \n\nEventually, if you live long enough, you outlive all your friends and acquaintances.",
            "title_similarity": "0.46955878",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i4bs6mn",
            "score": 1,
            "text": "Sometimes we forget about these things so thank you for the reminder",
            "title_similarity": "0.42107457",
            "sentiment_compound": 0.3272
        },
        {
            "id": "i4bs9sz",
            "score": 1,
            "text": "They could also be lonely as heaven if their friend went to hell.",
            "title_similarity": "0.44828886",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i4bsfqi",
            "score": 1,
            "text": "No\n\nI don't want to interact with strangers and neither do they\n\nGermany",
            "title_similarity": "0.2915563",
            "sentiment_compound": -0.3447
        },
        {
            "id": "i4bsfxh",
            "score": 1,
            "text": "Also they could be lost and disoriented, this needing help.",
            "title_similarity": "0.23143178",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i4bsg5i",
            "score": 1,
            "text": "I'm 77, have outlived most of the people I have ever known.  Lucky to have supportive family.",
            "title_similarity": "0.42398742",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i4bshiz",
            "score": 1,
            "text": "LPT Be kind to strangers, even old ones lol.",
            "title_similarity": "0.5761327",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i4bsml3",
            "score": 1,
            "text": "Compliment them on the colour of the walker or design of their cane! Lots of older folks are really resistant to using gait aids and being seen as old or frail, to the point that alot would rather risk a catastrophic fall. Having younger folks normalize it and react positively really helps some  people feel comfortable boogieing around in public with their snazzy wheels.",
            "title_similarity": "0.6883622",
            "sentiment_compound": 0.8264
        },
        {
            "id": "i4bsofy",
            "score": 2,
            "text": "Our local McDonalds is in a town of under 10k. Precovid it was THE meeting place for older folks in the morning. When the dining room was closed all that ended. It just has never really returned to the busy level from 5 to 9 every morning as before the plague.",
            "title_similarity": "0.6268849",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bsr8c",
            "score": 1,
            "text": "LPT: You know those old, weird, lonely people you see in public? Talk to them so maybe they'll believe that you don't see them as old, weird, and lonely, even though they are!\n\nJFC can you indoor kids be any more disconnected from the world?",
            "title_similarity": "0.7055026",
            "sentiment_compound": -0.7936
        },
        {
            "id": "i4bssq5",
            "score": 1,
            "text": "John Prine would give you a thumbs up if he was still around  \n\n> [You know that old trees just grow stronger  \nAnd old rivers grow wilder every day  \nOld people just grow lonesome  \nWaiting for someone to say, \"Hello in there\" ](https://www.youtube.com/watch?v=OVhA01J0Zsg)",
            "title_similarity": "0.63953507",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4bsu4b",
            "score": 1,
            "text": "I've been trying to do just this very thing for a long, long time. \n\nAfter hearing the lament of many lonely seniors when I worked EMS, I decided to make an effort to exchange pleasantries with my community's older residents. \n\nI've made several friends, and always enjoy seeing them smile when I say I'm happy to see them.\n\nThis kind of stuff is simple, but goes a long way. Great LPT OP!",
            "title_similarity": "0.6822043",
            "sentiment_compound": 0.902
        },
        {
            "id": "i4bt1ua",
            "score": 1,
            "text": "Please don't talk to me...",
            "title_similarity": "0.1139501",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4bt4md",
            "score": 1,
            "text": "I chatted with a lady over thr price of potatoes... I thought they were cheap, she rolled here eyes at me and said they were expensive.",
            "title_similarity": "0.63180006",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4btcn0",
            "score": 1,
            "text": "I wouldn't do it if they were young either. Their age has no bearing on my detest for interactions with strangers. If I'm out in public it's because I have things to do, and that never ever includes chatting up random people.",
            "title_similarity": "0.54828525",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4btx4o",
            "score": 1,
            "text": "Used to work in electronics section for retail, and there was an older gentleman that would come in every week or two and just talk to the apple home.  Ask it questions, play jazz, talk about the jazz, *ask you about the jazz*, \"you kids wouldn't know jazz\"... He was really annoying but none of us were ever going to kick him out since we knew he needed the social company.  It just sucks, we get it.",
            "title_similarity": "0.7639463",
            "sentiment_compound": -0.5494
        },
        {
            "id": "i4bu532",
            "score": 1,
            "text": "Neighbor has a grandpa with dementia who gets lost and just keeps walking a lot. Last time he was gone about 18 hours, and no one could find him. Then out of nowhere an Uber pulls up to the house; a lady saw him at a Home Depot about 20 miles away and asked him if he was lost, checked his id, then put him in an Uber for home. No one could find out who she was other than she was an Asian lady. \n\nDude had walked 20 miles, confused, all night long. \n\nIf you see an elderly person who seems lost, ask if they are.",
            "title_similarity": "0.6973654",
            "sentiment_compound": -0.8971
        },
        {
            "id": "i4bu8ur",
            "score": 1,
            "text": "I love interacting with old people. I wonder if this why they’re always so nice back",
            "title_similarity": "0.50208485",
            "sentiment_compound": 0.8323
        },
        {
            "id": "i4bud0c",
            "score": 1,
            "text": "This works extra well if they look like they don't like BiPoc and you are BiPoc",
            "title_similarity": "0.3895288",
            "sentiment_compound": 0.3591
        },
        {
            "id": "i4bul9l",
            "score": 1,
            "text": "Oh great! Now when I'm standing in line and a young lady chats me up about the weather, instead of me thinking she is interested in me, I'll now know she just feels sorry for me. LOL",
            "title_similarity": "0.5872928",
            "sentiment_compound": 0.884
        },
        {
            "id": "i4buprh",
            "score": 1,
            "text": "Im a gay man that enjoys going to gay bars often. One time I saw an old Irish man trying to get my attention. He did flirt at first and I accepted the drink he bought for me. I politely told him he wasnt my type but we talk on for a casual hour and I enjoyed the stories he gave me and also felt sympathy for how many young guys he said that take advantage of him and his lonely old friends.",
            "title_similarity": "0.7550666",
            "sentiment_compound": 0.9432
        },
        {
            "id": "i4bv6kj",
            "score": 1,
            "text": "Especially important when you find yourself still young and outliving so many of the people in your life.",
            "title_similarity": "0.41566092",
            "sentiment_compound": 0.2716
        },
        {
            "id": "i4bv99k",
            "score": 1,
            "text": "Seniors have a lot more knowledge to share.. some fascinating stories to tell.",
            "title_similarity": "0.35993654",
            "sentiment_compound": 0.7152
        },
        {
            "id": "i4bvfai",
            "score": 6,
            "text": "This is very well-meaning advice, but I just want to sprinkle a bit of a caveat-grain-of-salt here - a good number of people who end up 'lonely' as elderly people do so because it's a natural consequence of how they have lived their lives; hateful, judgmental, and even bigoted. Some old people are alone not because they've outlived everyone or something, but because they have chased all their living family and friends away by being miserable people who never absorbed the lesson that being unpleasant to be around means that others won't want to be around you.   \n\n\nSo... if you go engaging strangers on the basis of 'they might be lonely, and this would be nice for them,' be ready to handle part two of the emotional labor of initiating contact, and know how to disengage if it turns out they're someone you'd rather not talk to.",
            "title_similarity": "0.76952446",
            "sentiment_compound": 0.254
        },
        {
            "id": "i4bvlix",
            "score": 1,
            "text": "As an old person, please do. I would be so flattered. \n\nPlus I don't care what you look like because anyone under 50 looks young and fresh and good looking. And if you're shy or have social anxiety, you can practice conversation with no repercussions if you act awkwardly.",
            "title_similarity": "0.67930716",
            "sentiment_compound": 0.5481
        },
        {
            "id": "i4bvmuz",
            "score": 1,
            "text": "My great grandma died two months ago, she was 96, she outlived her parents, siblings, friends, and cousins. My grandpa now is the eldest in the whole family and all his siblings/parents are dead. He had a breakdown realizing this.",
            "title_similarity": "0.49762702",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4bvmyx",
            "score": 1,
            "text": "You can't outlive your friends if you don't have any...",
            "title_similarity": "0.3774568",
            "sentiment_compound": -0.3724
        },
        {
            "id": "i4bwh5j",
            "score": 1,
            "text": "honey - if an \"old person\" is out and about in McDonald's they are doing quite good & probably don't want to be bothered by the likes of you (so self-serving in your recommendations).  if you *really* want to relate with old people - volunteer at an \"old folks home\" where many are going around in circles in their wheelchairs cause there isn't enough staff to walk around with them.  \n(ps - i'm an \"old person\") geez - remember when jerry seinfeld did the one w/the old folks?",
            "title_similarity": "0.8457328",
            "sentiment_compound": 0.6204
        },
        {
            "id": "i4bwoxf",
            "score": 1,
            "text": "In the grocery store the other day, I asked the first person taller than me to help me reach something off the top shelf.  She was elderly, but had several inches on me.   She was very happy to be asked FOR help:).",
            "title_similarity": "0.5805806",
            "sentiment_compound": 0.907
        },
        {
            "id": "i4bwpmd",
            "score": 1,
            "text": "Bro I’m not even over 30 yet and everyone ignores me - why would I try to freak old people out? We get ignored our whole lives, why start paying attention to people when they’re about to die?",
            "title_similarity": "0.6948547",
            "sentiment_compound": -0.89
        },
        {
            "id": "i4bwpxs",
            "score": 1,
            "text": "But whats in it for me?",
            "title_similarity": "-0.021921895",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bwrjv",
            "score": 1,
            "text": "It's a nice thing to do ok\nBut wtf should this be a life pro tip?",
            "title_similarity": "0.31055403",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i4bwyx1",
            "score": 1,
            "text": "I'd say this also goes for disabled people. So many of us are chronically lonely.",
            "title_similarity": "0.40047538",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4bx0wn",
            "score": 1,
            "text": "Gym \n\nThe gym is a PRIME example of this. I can't get to a restaurant or library frequently, but I'm at the gym all the time. There's a TON of elderly guys there, and saying hi, chatting about sports, complementing them on an exercise literally takes ZERO effort. \n\nJust do it!",
            "title_similarity": "0.63290375",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bx5u5",
            "score": 1,
            "text": "Also, elderly ladies are usually dtf",
            "title_similarity": "0.2803372",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bx840",
            "score": 2,
            "text": "Please don’t. I don’t want to talk to you fuckers",
            "title_similarity": "0.21409965",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i4bxbk8",
            "score": 1,
            "text": "Jesus Christ what a depressing fucking thread. All you folks complaining about being lonely and dying alone, go outside and talk to real people. It’s not hard to make friends",
            "title_similarity": "0.76009476",
            "sentiment_compound": -0.5429
        },
        {
            "id": "i4bxgbc",
            "score": 1,
            "text": "Just to add to this. Their family may not realize they are lonely. Many of the elderly feel like a burden on their children, grandchildren, etc. \n\nMy parents had 11 children and I was the youngest.  I have a family (husband and 4 kids) but I stopped by nearly daily at my parents house. They always loved the visit especially with my kids.  No matter how many times they would say in text or calls they didn’t need help they had a task they needed done (clearing the snow off satellite dish, putting salt in water softener, getting decorations down from the garage). They wouldn’t text/call for help even if one of their kids asked specifically.  They didn’t want to be a burden. \n\nSo even if your elderly family or neighbor says they don’t need help or doesn’t ask for help, it doesn’t mean that’s true. They likely don’t want to feel like a burden.",
            "title_similarity": "0.6748224",
            "sentiment_compound": 0.9538
        },
        {
            "id": "i4bxhg9",
            "score": 1,
            "text": "I’m a socially awkward person who fumbles over the simplest phrases. So when I don’t feel confident in that department, I give them the largest smile I can muster. As if they were my grandma. I can’t tell you how many warm smiles I got back. Like they were my grandma. It feels so nice. I encourage all to at least smile at them like they’re your grandma. I’ve never spoken to them after I’ve done this but I can almost guarantee they appreciated it.",
            "title_similarity": "0.66243577",
            "sentiment_compound": 0.9517
        },
        {
            "id": "i4bxih5",
            "score": 1,
            "text": "My toddler and I go on walks around our neighborhood. We stopped and talked to his older lady a few houses down. We exchanged numbers and I told her when we go on a walk again that I can give her a call and she’s welcome to come. She’d often tell me she was really lonely. \n\nShe brought cookies for our kid one time and was overall sweet. Then she got into talking about politics more, very conservative id just nod and smile and overall be polite. We went on walks with his lady several times and she’d call me every few days just to chat. \n\nI mentioned in conversation that my family and I came here as refugees nearly 30 years ago. Never heard from her again after that lol we were waking one day a few weeks after that I waved at her and as we got closer she quickly walked in her house lol like what in the world…",
            "title_similarity": "0.6557108",
            "sentiment_compound": 0.8981
        },
        {
            "id": "i4bxiny",
            "score": 1,
            "text": "Worked at a grocery store for awhile in my late teens.  There was an older gent who shopped in the evenings by himself and would always make a point to say hi to all the employees and make small talk with each of them (- telling them how well they looked, too).  He always had a golf putter in his shopping cart and naive me asked questions about his golf game, once.  I don't know how much time passed before I realized he likely lived in walking distance to the store and the putter was for self defense.",
            "title_similarity": "0.7648201",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4bxkiq",
            "score": 1,
            "text": "Alot of old people complain about younger generations. Im in my mid 20s and I complain about younger generations. If your old and dont have new freinds.  Its probably because your not so freindly.",
            "title_similarity": "0.5444943",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i4by06u",
            "score": 1,
            "text": "It's such a small thing but in my experience it's pretty much always nice. People should exchange small talk and pleasantries more, I will always look to say hello when I'm passing people on a walk for example. It's just part of it for me",
            "title_similarity": "0.5338192",
            "sentiment_compound": 0.899
        },
        {
            "id": "i4by0iv",
            "score": 1,
            "text": "I don't have friends now...",
            "title_similarity": "0.24450067",
            "sentiment_compound": -0.3724
        },
        {
            "id": "i4bybtk",
            "score": 1,
            "text": "Read this as \"if you spy on...\" and for a moment I had so many questions",
            "title_similarity": "0.3088977",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4byiql",
            "score": 1,
            "text": "For women especially, at least being friendly with an elderly stranger wont be interpreted as flirting [most of the time]. I think it is great idea to purposely interact/be-friendly with lone elderly people.",
            "title_similarity": "0.61798835",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i4byqbw",
            "score": 1,
            "text": "What an incredibly helpful tip.",
            "title_similarity": "0.15151684",
            "sentiment_compound": 0.4754
        },
        {
            "id": "i4byr6x",
            "score": 1,
            "text": "Commiserate over a long line of crack. Got it.",
            "title_similarity": "0.35333693",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4bz4bq",
            "score": 1,
            "text": "As someone with very old grandparents that live far away, this gave me the feels.\n\nI do this whenever I see older people by themselves in hopes that someone out there will do the same for my grandparents.",
            "title_similarity": "0.6044696",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4bz75j",
            "score": 1,
            "text": "The last time I did this the guy stared at my chest and said, without making direct eye-eye contact, \"I like your titties\".",
            "title_similarity": "0.52433836",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4bz7uo",
            "score": 1,
            "text": "As a librarian I understood this all too well. I always took extra time with my senior patrons. Thank you for mentioning this",
            "title_similarity": "0.45116013",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i4bz8ia",
            "score": 1,
            "text": "I'm 38 and this is pretty much me everywhere I go",
            "title_similarity": "0.13580574",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4bzawg",
            "score": 1,
            "text": "I would but my face reads like I’m angry they’re still alive",
            "title_similarity": "0.50475264",
            "sentiment_compound": 0.296
        },
        {
            "id": "i4bzcdw",
            "score": 1,
            "text": "Fuck that, live in Florida, more old fucks than grains of sand.",
            "title_similarity": "0.3962837",
            "sentiment_compound": -0.7832
        },
        {
            "id": "i4bzdks",
            "score": 1,
            "text": "Assholes can live to be 100 as well",
            "title_similarity": "0.23668627",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4bziw1",
            "score": 1,
            "text": "I enjoy old people so much. They're full of wisdom and experience. I could listen to most of them tell me stories all day.\n\nMan, I miss my grandparents.",
            "title_similarity": "0.5358156",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i4bzjvy",
            "score": 1,
            "text": "There is this old lady, maybe 75, that hangout everyday at this place call Rodeo 39 in southern Cali. She just buy something to eat, then sit alone the whole day.\n\nI recent have a breakup, so I sorta of doing the same thing; going to malls and social places to waste my time, but everytime I goes there she is always at the same spot.\n\nNot sure how to say hi though.",
            "title_similarity": "0.7366997",
            "sentiment_compound": -0.5917
        },
        {
            "id": "i4bzl2r",
            "score": 1,
            "text": "I did this one time. Had a conversation with an 87 year old man, asked him about his life and past. He immediately started crying because pretty much everyone that he ever loved is gone. Despite that, he appreciated the interaction and just talking to someone.",
            "title_similarity": "0.67427176",
            "sentiment_compound": 0.3178
        },
        {
            "id": "i4bzoa8",
            "score": 1,
            "text": "This is great.  I’m a 51 year old man and I’m starting to feel that social isolation. \nPandemic did not help at all with more people leaning toward introversion than ever. \nIt seems like being friendly and open with a stranger, even in a common public situation as you described in your post, is long gone. \nI’ve made a lot of friends and had some fine laughs just interacting with the person next to me in line or maybe sitting at an adjacent table. \nI really hope the new generations start to open up socially a bit more and not be afraid to put down technology to just stop and smell the roses in their day to day lives.",
            "title_similarity": "0.77996004",
            "sentiment_compound": 0.9317
        },
        {
            "id": "i4c06pm",
            "score": 1,
            "text": "A lot of people in this thread miss the definition of \"elderly\".  Are you 90 years old?\n\nMy grandfather told me a thing, and if you ever cared about anyone but yourself, you will see the point:\n\nYoung people do not really think about funerals, because they do not go to many.  But once you get into your 60s-70s, you will start watching this pattern.  Funerals start escalating and you go to more and more, and when you get older into your 80s you eventually start going to less and less.  That is when you realize that you have outlived everyone you ever knew and loved.  Grandparents, parent, aunts and uncles, cousins and friends, and eventually spouses and children.  That is when it gets lonely.",
            "title_similarity": "0.6851181",
            "sentiment_compound": 0.1666
        },
        {
            "id": "i4c074y",
            "score": 1,
            "text": "My great aunt died after seeing her husband, two sons, and the other nine of her siblings go before her. I’ve already seen my husband die and I have two children. Dying alone scares me more than actually dying.",
            "title_similarity": "0.5415298",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i4c0dvn",
            "score": 1,
            "text": "Agree 💯 I live in apartment with lots of older people. We’re a younger couple with a 1 year old. I always try to engage that bit further with everyone in the lift or foyer. You can see the value of a small exchange. A brief discussion. Just being present and acknowledging someone else’s presence by doing what’s suggested by OP. It really makes me feel connected as well and builds a sense of community that I really love.",
            "title_similarity": "0.56124574",
            "sentiment_compound": 0.9168
        },
        {
            "id": "i4c0k2o",
            "score": 1,
            "text": "“Stop trying to talk to me! 45 isn’t ‘old’ and I’m not lonely!”",
            "title_similarity": "0.46808922",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c0olv",
            "score": 1,
            "text": "I wonder how the age demographic is split on this shitty advice? I'm guessing teenagers are concocting bizarre fantasies about random strangers' lives based on absolutely nothing, and the adults are going fuck no",
            "title_similarity": "0.6268406",
            "sentiment_compound": -0.9052
        },
        {
            "id": "i4c0ooy",
            "score": 1,
            "text": "I look pretty unapproachable. Tattoos all over my hands and face, I wear leather with studs and metal band patches, combat boots, hair black and blonde, usually giant winged liner etc. I love making a point to be as nice as I can to old people who give me a sideways glance, I love changing their perceptions. Even better is the conversations I have with them. It makes a miserable cramped bus ride a million times more interesting when you get to talk about your tattoos to the old lady you gave your seat to. \n\nExcept one time I helped an old lady at the grocery store pack up her groceries and she was having a hard time understanding how to pay. She had $100 cash and still owed about $30, and was holding her bank card but couldn't understand she could put $30 on the card and the rest in cash. The line was getting long and the cashier was getting frustrated and I had already packed up all her groceries so putting items back would be a hassle. So I said \"I'll get it\" and reached over, tapped my card for the remaining $30, and quickly turned to leave. Suddenly this lost old lady was ALERT and she was PISSED at me, screaming at me saying she didn't want anyone to pay for her etc. I turned and apologized and said it was nothing, and to give the $30 to someone in need but she wouldn't have it, she suddenly produced $20 from her purse and insisted I take it. I did and booked it out of there with her still yelling and me feeling actually guilty. Sometimes you can't win. Maybe I should have asked first I don't know. She acted like she had no idea where she was for a solid five minutes, I thought it would be fine.",
            "title_similarity": "0.716668",
            "sentiment_compound": -0.8748
        },
        {
            "id": "i4c0p9p",
            "score": 1,
            "text": "I work in a field where a lot of my customers are quite elderly and I always make sure to joke around with them whenever we're waiting on a computer or something, they really enjoy it",
            "title_similarity": "0.67958516",
            "sentiment_compound": 0.7902
        },
        {
            "id": "i4c0pbd",
            "score": 1,
            "text": "Anyone else think this is a weird post?",
            "title_similarity": "0.18028525",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4c0sg1",
            "score": 1,
            "text": "I’m 65 and lonely. I like it when someone speaks to me in public.",
            "title_similarity": "0.49929023",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c1cid",
            "score": 1,
            "text": " Check out the song Hello in There by John Prine",
            "title_similarity": "0.14668933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c1cmb",
            "score": 1,
            "text": "Elderly people have way more insight and interesting stories than millennials. I love chatting with them.",
            "title_similarity": "0.48887908",
            "sentiment_compound": 0.8
        },
        {
            "id": "i4c1ra0",
            "score": 1,
            "text": "I don't know if it's my age, where I live, my personality, or what but my god some people are assholes. For 90%+ of the elderly, this would make their day. You'll quickly pick up on the 10% of the people who don't like any human interaction.",
            "title_similarity": "0.57071555",
            "sentiment_compound": -0.7364
        },
        {
            "id": "i4c1rum",
            "score": 1,
            "text": "I dunno why but my most recent Saturday was chock full of random social interactions which is very unusual for me. Ended up chatting with an older guy while we were waiting to have our propane tanks filled at the wholesale club, and I surprised myself by being the one to start it. Was kind of nice though, trying to be less of a recluse this year.",
            "title_similarity": "0.73221374",
            "sentiment_compound": 0.6819
        },
        {
            "id": "i4c28xh",
            "score": 1,
            "text": "While I absolutely agree with the OP, and am one of those people who really do chat up a long line at the gas station, I can promise you, introvert friends and spouses will hate you for this.",
            "title_similarity": "0.7440784",
            "sentiment_compound": 0.5413
        },
        {
            "id": "i4c2b8x",
            "score": 1,
            "text": "Aw shit.  I was at a local take out place, recently, by myself.  I saw an older woman eating alone and though \"oh, poor soul, I feel so bad for her\" then I though \"why do you feel bad for her, you're eating alone - you chose to eat alone, no one should feel sorry for you\"\n\nThen she offered me some french fries because there were too many for her to eat, which I politely declined with a laugh and a chuckle.\n\nAnd... now I feel like shit for not engaging with her.",
            "title_similarity": "0.79628104",
            "sentiment_compound": -0.9585
        },
        {
            "id": "i4c315c",
            "score": 1,
            "text": "The fact that someone is taking time to give this advice in itself is great! Kindness is cheap and easy and means more to the right people at the right time than money! Cheers 😁",
            "title_similarity": "0.46270055",
            "sentiment_compound": 0.9492
        },
        {
            "id": "i4c3c8u",
            "score": 1,
            "text": "I love this LPT. I always do this too - be nice to older people and chat them up if they're receptive to it. I would want someone to treat my sweet nana kindly and make her day so if I can make some other Nana's (or grandpas) day I am happy to",
            "title_similarity": "0.52718484",
            "sentiment_compound": 0.9633
        },
        {
            "id": "i4c3lbl",
            "score": 1,
            "text": "Often do that standing in long queues",
            "title_similarity": "0.18673566",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c3o5m",
            "score": 1,
            "text": "ummmm I tried this and was promptly told to \"get fucked\"...not saying OP is wrong...but each case is different.",
            "title_similarity": "0.38166922",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c3pma",
            "score": 1,
            "text": "I don't talk to random strangers that's a hard pass.",
            "title_similarity": "0.33107388",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i4c40ab",
            "score": 1,
            "text": "To add to this - there are a lot of people who we treat as invisible or don’t interact with for various reasons…try to extend the same kindness to everyone; not just elderly folks.",
            "title_similarity": "0.60837203",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i4c4bov",
            "score": 2,
            "text": "Obligatory go and listen to “Hello in There” by John Prine.",
            "title_similarity": "0.28409293",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c4d1e",
            "score": 1,
            "text": "*Hello, in there. Hello*",
            "title_similarity": "-0.0374952",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c4tcp",
            "score": 1,
            "text": "\"So if you're walking down the street sometime\nAnd spot some hollow ancient eyes\nPlease don't just pass 'em by and stare\nAs if you didn't care, say, \"Hello in there, hello\"\"\n-John Prine",
            "title_similarity": "0.59299624",
            "sentiment_compound": -0.0844
        },
        {
            "id": "i4c4yuk",
            "score": 1,
            "text": "Got an apartment in the city me and my wife like living there...",
            "title_similarity": "0.21336636",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4c59yw",
            "score": 2,
            "text": "As an old person, leave me the fuck alone kid",
            "title_similarity": "0.43438482",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i4c5agh",
            "score": 1,
            "text": "Listen to John Prine - Hello in there.",
            "title_similarity": "0.16181368",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c5pe7",
            "score": 1,
            "text": "I thought we were suppose to ignore them to rid ourselves of the boomers faster",
            "title_similarity": "0.39276615",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4c5wih",
            "score": 1,
            "text": "I always try to do this, if they don’t wanna be talk to hey atleast I tried",
            "title_similarity": "0.32116306",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c60kg",
            "score": 1,
            "text": "As an elderly person who goes out alone all the time, if someone did this to me, I would think:  \"How sad.  They must be really lonely and missing their grandma or something.  I will talk to them and cheer them up!\"  :)",
            "title_similarity": "0.6976745",
            "sentiment_compound": -0.5185
        },
        {
            "id": "i4c6ft1",
            "score": 1,
            "text": "Many have not only outlived their friends, but also their family, their kids, etc.",
            "title_similarity": "0.48496372",
            "sentiment_compound": 0.2617
        },
        {
            "id": "i4c6i52",
            "score": 1,
            "text": "Understand the lonely part, it's gotta be rough",
            "title_similarity": "0.20064226",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4c6l04",
            "score": 1,
            "text": "Husband and I regularly eat Sunday breakfast at a local old fashioned diner. Now almost every time we have a great chat about engineering and history with John, who is in his 70s and lives on a boat.  \n\nEveryone leaves that conversation happier for the connection 🥰",
            "title_similarity": "0.6239739",
            "sentiment_compound": 0.9413
        },
        {
            "id": "i4c6lr6",
            "score": 1,
            "text": "Solid LPT right here",
            "title_similarity": "0.08579336",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i4c6ntn",
            "score": 1,
            "text": "It’s a very low risk activity. At worst, you get a nod and they move on. At best they start talking and you learn something and get to make someone’s day a little brighter by being willing to chat a bit. \n\nI try to talk to older people when we are in a waiting room or something. I’m in medical offices a lot and I can’t imagine how hard it is to not be used to people on their phones all the time and how invisible you’d feel as someone outside of that. Doom scrolling can wait, I’m going to tell this old lady her skirt is beautiful and hear about how she made it with her granddaughter.",
            "title_similarity": "0.6550547",
            "sentiment_compound": -0.1442
        },
        {
            "id": "i4c6obw",
            "score": 1,
            "text": "Many of them have not outlived their friends and many are not lonely as hell dumbass zoomer. You’re a fucking creep for approaching elderly people like that.",
            "title_similarity": "0.75486696",
            "sentiment_compound": 0.2778
        },
        {
            "id": "i4c6qwj",
            "score": 7,
            "text": "I'll treat them like everyone else and leave them alone",
            "title_similarity": "0.3627157",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i4c6ufx",
            "score": 1,
            "text": "Spy on old people.",
            "title_similarity": "0.45218277",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c70z0",
            "score": 1,
            "text": "This might be the first and only post about older people that has been filled with love and not scorn or dismissiveness. Younger people seem to hate older people these days.. find ways to insult them/ us. \n\n&#x200B;\n\nthank you",
            "title_similarity": "0.6610311",
            "sentiment_compound": 0.2401
        },
        {
            "id": "i4c749s",
            "score": 1,
            "text": "I talk to alot of the old and disabled people in our building.  \n\nThey have had some interesting lives,  ahaving experienced the fall of the Berlin wall on both sides and the governments before and after.   \n\nIt can be a little hard as they can speak very good Berliner Schnauze so the understanding can be a little hard.",
            "title_similarity": "0.5719042",
            "sentiment_compound": 0.6887
        },
        {
            "id": "i4c74gs",
            "score": 2,
            "text": "This is how I met my best friend. I worked in a diner and she would come in by herself super early every morning. Her husband had died a few years before then and she was just used to their routine, waking up early and going out for breakfast together. The other severs would get annoyed by her because she loved to talk, but I could tell she was just lonely and wanted a friend. I worked overnights so I would be getting off not long after she came in, and we would talk for hours and started hanging out regularly. Turns out she lived down the road from me so we started hanging out even more. I left that job and eventually she moved across town but we still hang out every week, she says I’m like the daughter she never had. She spoils me with homemade cookies and clothing she finds on sale and endless conversations. I am truly so so thankful I met her, she’s been the biggest blessing in my life and the best friend I’ve ever had. We are 40 years apart but it genuinely doesn’t feel that way, so moral of my story is don’t judge a book by it’s cover ❤️",
            "title_similarity": "0.6760169",
            "sentiment_compound": 0.9891
        },
        {
            "id": "i4c7tjw",
            "score": 1,
            "text": "This goes for most males too. As we age our friends tend to dwindle generally because of family and work obligations. Then it can end unexpectedly. \nBe Kind Rewind!",
            "title_similarity": "0.6097678",
            "sentiment_compound": 0.7777
        },
        {
            "id": "i4c7yao",
            "score": 1,
            "text": "This is the best LPT I’ve seen in a while",
            "title_similarity": "0.18228042",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4c8uv2",
            "score": 1,
            "text": "My grandfather died last year at the age of 84, he was the youngest of 6 children and while his oldest sister lived the longest to 98 I she died about four years ago. He had three kids, nine grandkids, and seven great grandkids when he died. I miss him more than I can put into words. He was my absolute favorite person in the world.\n\nHe lived alone but one of his neighbors told us after he passed, \"I never worried about him, in fact Im a bit jealous, he always had visitors through the week* and most weekends at least one of the grandkids were there. You could tell he was loved by his family.\"\n\n\n*He retired in 96 but his group of teacher friends from work never stopped coming over every Thursday for poker, football, shit stirring, and world problem solving up to the week he was hospitalized last March. He was good at cultivating friendship of all ages and keeping them.",
            "title_similarity": "0.62673545",
            "sentiment_compound": 0.8414
        },
        {
            "id": "i4c8zwa",
            "score": 1,
            "text": "All good until I notice the red MAGAt hat perched ignorantly upon their numbskulls, I decline offering any humanity to persons who deny humanity in others by kowtowing to fascist ideology.",
            "title_similarity": "0.5343101",
            "sentiment_compound": -0.836
        },
        {
            "id": "i4c97mp",
            "score": 1,
            "text": "Hey im not considered elderly but I still appreciate a lot when you come and talk to me when I’m eating alone. Thanks stranger",
            "title_similarity": "0.69858646",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i4ca08q",
            "score": 1,
            "text": "Or they’re an asshole that has alienated everyone in their life.",
            "title_similarity": "0.40957692",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ca1m1",
            "score": 1,
            "text": "Counterpoint: leave people the hell alone in public",
            "title_similarity": "0.27480903",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i4ca3nv",
            "score": 1,
            "text": "But when I do this with a child I'm \"creepy\"",
            "title_similarity": "0.30682153",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4carxx",
            "score": 1,
            "text": "I like to carry around some Werther's to get them to do tricks.",
            "title_similarity": "0.32804585",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4cauxp",
            "score": 1,
            "text": "Once my band profesor told us, I know many of you 9th graders are being invited to a ton of XV parties, don’t feel bad about going to them, because at my age you will go to the same amount of funerals in a year.",
            "title_similarity": "0.48737133",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i4cayiy",
            "score": 1,
            "text": "Idk man. Talking to some random guy is kinda weird here in Germany",
            "title_similarity": "0.48663348",
            "sentiment_compound": -0.204
        },
        {
            "id": "i4cb5di",
            "score": 1,
            "text": "No. I’m still a little pissed at them for you know destroying the world.",
            "title_similarity": "0.4162051",
            "sentiment_compound": -0.818
        },
        {
            "id": "i4cbfj8",
            "score": 1,
            "text": "Corollary, make friends younger than you, you can be the first to die, not the last.",
            "title_similarity": "0.48588973",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4cbl8d",
            "score": 1,
            "text": "My Nana lost my grandad when she was 88. She got a bit lonely sometimes so I moved in with her when she hit 90. Became closer than anything, we hung out, enjoyed TV shows, had a drink and were genuinely great friends.\nShe one day said how grateful she was that I was with her in her final few Months and how much it meant to her.\n\nThen she lived til 102!!!\n\nI miss her every day, and I always enjoy going out of my way to talk to or assist any elderly folk that I see about in any way I can.",
            "title_similarity": "0.64782333",
            "sentiment_compound": 0.9213
        },
        {
            "id": "i4cc421",
            "score": 1,
            "text": "What a nice observation to put into print. 👏👏👏",
            "title_similarity": "0.118793815",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4cc7i6",
            "score": 1,
            "text": "And if they tell you to fuck off, it might have made their day to be able to do that again.",
            "title_similarity": "0.39480522",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4cc8gq",
            "score": 1,
            "text": "This is how you get shot.",
            "title_similarity": "0.17935827",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cc8si",
            "score": 1,
            "text": "I’ll do this when they stop treating retail associates like shit and demanding respect when they haven’t earned it just because they’re old. Congrats. You made it this far being that big of a prick. No wonder you’re lonely.",
            "title_similarity": "0.7220486",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i4ccf5x",
            "score": 1,
            "text": "No thanks, I am introverted and don’t enjoy talking to strangers.",
            "title_similarity": "0.4994024",
            "sentiment_compound": 0.2008
        },
        {
            "id": "i4cchaj",
            "score": 1,
            "text": "Not to mention lots of old people are some of the coolest people you’ll ever meet. Which reminds me of a passage out of kids book I’ve been reading to my son at night called the velveteen rabbit. \n\n“'It doesn't happen all at once,' said the Skin Horse. 'You become. It takes a long time. That's why it doesn't happen often to people who break easily, or have sharp edges, or who have to be carefully kept. Generally, by the time you are Real, most of your hair has been loved off, and your eyes drop out and you get loose in the joints and very shabby. But these things don't matter at all, because once you are Real you can't be ugly, except to people who don't understand.”",
            "title_similarity": "0.6331557",
            "sentiment_compound": 0.685
        },
        {
            "id": "i4ccr2f",
            "score": 1,
            "text": "This makes me sad. My moms side of the family is huge and they all are in constant conversation and visits, if most ages. My dads is small but they all are sticking close and still growing. I have terrible anxiety and a lack of understanding how to not be unselfish and reach out more. They’re always there though at the drop of a hat.",
            "title_similarity": "0.59914017",
            "sentiment_compound": -0.875
        },
        {
            "id": "i4ccssc",
            "score": 1,
            "text": "“Man this line is so long.  I don’t have time for this.”  “ You have even less time for this.”  \n\nGot it.  I’ll try this out next time",
            "title_similarity": "0.42194897",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ccxzp",
            "score": 1,
            "text": "Do this for me. I'm 42.",
            "title_similarity": "0.058410615",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cdtll",
            "score": 1,
            "text": "No they be boring",
            "title_similarity": "0.26498103",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4ce4n4",
            "score": 1,
            "text": "I worked at a bank and this is how elder abuse happens",
            "title_similarity": "0.3832413",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i4celfy",
            "score": 1,
            "text": "That is so true when my grandfather passed it was only one couple that was there who was not family . They were the only friends that outlived my grandfather the rest of us we’re all family my sisters and I.",
            "title_similarity": "0.57086307",
            "sentiment_compound": 0.7728
        },
        {
            "id": "i4cer1x",
            "score": 1,
            "text": "I saw two pretty old ladies at a small restaurant and the servings you get are huge.  I was at the next table from them and looking at the huge mound of food I said \"are you ladies going to eat all that?\"  They laughed and we talked a bit.  My family was embarrassed I asked them that but they obviously knew I was joking and it was fine.\n\nAnother time I saw an old guy with his dog, I asked him what his dog's name was and I could tell he was super happy to talk and talk and talk about his day. I like dogs anyway so didn't mind hearing about it.",
            "title_similarity": "0.7408298",
            "sentiment_compound": 0.9714
        },
        {
            "id": "i4cevji",
            "score": 1,
            "text": "Better LPT: learn to read body language. If someone wants to be interacted with, they'll have 'open' body language toward you and others, and if they don't, that will also show. If someone wants to be interacted with and you're comfortable with it, go ahead, but don't go out of your way to disturb someone who wants to be left alone, and don't go out of your own comfort zone with perfect strangers.",
            "title_similarity": "0.39240503",
            "sentiment_compound": 0.7469
        },
        {
            "id": "i4cey7j",
            "score": 1,
            "text": "Please don't do this.\n\nLeave me the fuck alone.",
            "title_similarity": "0.15841967",
            "sentiment_compound": -0.5346
        },
        {
            "id": "i4cf1bt",
            "score": 1,
            "text": "I always imagine little old ladies are my Nana(rip). I loved my Nana so much, she was the nicest person in the world to me. And that little old lady is probably someone’s Nana and she’s probably a rad Nana.",
            "title_similarity": "0.43720454",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i4cfm0n",
            "score": 1,
            "text": "Some of these elderly people are horrible narcissists like my father. The reason they are alone is because of their shitty treatment of others and their belief they are better than everyone else.",
            "title_similarity": "0.6169251",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i4cfta7",
            "score": 1,
            "text": "Yeah but some old people suck serious ass and are mean as all hell. Gonna be hard pass chief",
            "title_similarity": "0.52301645",
            "sentiment_compound": -0.9549
        },
        {
            "id": "i4cgeiu",
            "score": 1,
            "text": "I always stop and let the old dude that smokes a pipe play with my puppy when he's out on a walk, doesn't matter if I need to try back for a meeting; the old lad wants to play with the dog and he's welcome to do it until he gets bored.",
            "title_similarity": "0.6253978",
            "sentiment_compound": 0.5308
        },
        {
            "id": "i4cgk65",
            "score": 1,
            "text": "Can't outlive your friends if you don't have any to begin with 😎🔥",
            "title_similarity": "0.44734883",
            "sentiment_compound": -0.2392
        },
        {
            "id": "i4cglz0",
            "score": 1,
            "text": "Thi! But also don't forget to send them A HAND written letter....even throw in a printed picture of yourself. \n\nI find my 97 yr old grandma doesn't react and feel the same when you show her a digital photo on my phone, orreads a message from the screen. \n\nA photo/letter they can hold and look at it with ease. It makes a world of difference to them :)",
            "title_similarity": "0.6195448",
            "sentiment_compound": 0.9427
        },
        {
            "id": "i4ch3dp",
            "score": 1,
            "text": "Striking up a conversation can yield a mixed bag of experiences.  The mean ones live forever.  Source:  my MIL.",
            "title_similarity": "0.4221966",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ch7ph",
            "score": 1,
            "text": "I work in a town popular with older residents (very posh English town with a private college etc). As a doctor's receptionist I see a lot of older people and always try to chat but simply don't have the time often.\n\nWe have a wonderful team callled 'transforming care of older patients' aka TCOP team. We have a nurse who can go out and do home visits particularly if they aren't eligible for other home visit services. A social prescriber who can recommend local groups/hobbies and even come along on your first couple of visits so you aren't alone  (and often someone in the group will know her so it's a good meeting point) and a care coordinator who can help arrange respite carer affordable care at home, home aids or even just go round for a cup of tea and a chat so the person is aware of what help there is available or even if it's just to chat if they have no one else to talk to. She also organises for a few of these people to meet (with their consent of course!) and works as a befriender. All of this is an NHS provided service at no cost to the patient and I honestly think it's the best thing about my job. If ever I think someone may be a little lonely I can just pop them a message and they call up for a casual chat to introduce the team and offer to meet up and talk (they don't know that I've flagged them up). Honestly it makes the job so much more enjoyable rather than worrying about that person who seemed a bit lonely knowing you can put them in touch with people without them feeling pitied. Anyone over 75 can access this with no other obligations.\n\nSorry for the long slightly off topic reply but more and more doctors are getting social prescribers etc and I feel like it isn't talked about enough",
            "title_similarity": "0.6141597",
            "sentiment_compound": 0.9938
        },
        {
            "id": "i4chbre",
            "score": 1,
            "text": "This is a VERY good pro tip.\n  \nMy mom is 92 and one thing I've seen that's heartbreaking are all the friends she's had to bury.  Also 2 husbands (my bio dad and stepdad) and 1 son (brother).   \n\nAlso her best friend and maid-of-honor at her wedding, and so many very close friends along the way.  Her list of friends gets smaller and smaller but she keeps her spirits high and is delightful to be around.",
            "title_similarity": "0.6513407",
            "sentiment_compound": 0.9398
        },
        {
            "id": "i4chfcl",
            "score": 1,
            "text": "A little kindness goes a long way.",
            "title_similarity": "0.1540896",
            "sentiment_compound": 0.4033
        },
        {
            "id": "i4chk45",
            "score": 1,
            "text": "I don’t know. The ones I run into at the supermarket are plain cranky. I’m 50 and can’t relate.",
            "title_similarity": "0.6307274",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cht8c",
            "score": 1,
            "text": "Well, considering your average person admits in studies how lonely and friendless they are, I think this applies to more than just elderly. Also considering what Boomers have done to our lives and futures on their way out, no thanks.",
            "title_similarity": "0.70148045",
            "sentiment_compound": -0.4777
        },
        {
            "id": "i4cigw4",
            "score": 1,
            "text": "My grandmother stopped her subscription to the local newspaper this month. \n\nShe had the oldest continous subscription that wasn't for a company they said.\n\nShe told me that she only used it to check the obituaries, and everyone she knew in town except me is dead.\n\nJust wanted to share.",
            "title_similarity": "0.5909496",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i4cii28",
            "score": 1,
            "text": "Feel free to ignore me when I get old.  The idea of random people interacting with me in public spaces for no treason when I get old makes me want to die young.\n\nWhy do we assume because someone is old they are some adorable munchkin that just wants to talk to everyone.  You know how we all hate everybody that breathes too close to us at CVS-they do too.",
            "title_similarity": "0.76498187",
            "sentiment_compound": -0.2249
        },
        {
            "id": "i4cikdk",
            "score": 1,
            "text": "I mean, I guess we can talk about how their generation ruined the economy, retirement for everyone but themselves, and in general the American Dream and even if they weren't party to its destruction they sat by and watched it happen without saying anything.\n\nI guess we could talk about that.",
            "title_similarity": "0.6487512",
            "sentiment_compound": -0.817
        },
        {
            "id": "i4cikmr",
            "score": 1,
            "text": "Pro tip, don’t refer to them as elderly but rather an older adult.",
            "title_similarity": "0.38346648",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cj8m5",
            "score": 1,
            "text": "We're all lonely this planet is horrible",
            "title_similarity": "0.378892",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i4cjq3x",
            "score": 1,
            "text": "https://youtu.be/r5Cd764BnyQ",
            "title_similarity": "0.057506815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cjuj0",
            "score": 1,
            "text": "I’m an introvert so this doesn’t come naturally to me.   By my 5 year old son has done this entirely on his own since he was 2 or three.   He loves starting up an interaction with older people, or really with anyone.   I’m always amazed at how delighted people are to talk with him - their eyes and faces just light up.    I have to override my instinct to keep him from “bothering” people and just let him be the little extrovert he is.",
            "title_similarity": "0.6968097",
            "sentiment_compound": 0.8807
        },
        {
            "id": "i4cjy3h",
            "score": 1,
            "text": "I love buying them dinner but I don’t tell them. They find out after I’m gone that their meal is paid for. Hope it makes them smile.",
            "title_similarity": "0.70040184",
            "sentiment_compound": 0.8658
        },
        {
            "id": "i4ck063",
            "score": 1,
            "text": "When I was younger I saw something like this online and I started volunteering at a local nursing home to just go talk to residents and I immediately became an instant hit.  All the residents wanted to talk to me and I was happy to give a few hours a week to speaking to people that had exponentially more life experience than me.  It got really fucking rough when people died, it really got to me.  I own two companies now, i'm married, and I have a young child so I don't have to time to do what I did when I was younger but in my opinion that's probably the best thing a teenager can do, go hang out with old folks at a retirement home. The random advice is irreplaceable.",
            "title_similarity": "0.62152815",
            "sentiment_compound": 0.8225
        },
        {
            "id": "i4ck2h4",
            "score": 1,
            "text": "My mother is 78. She said to me today, “I could commit a murder in broad daylight and no one would convict me because no one ever sees me”. She’s told me that she’s invisible for about 10 years now.",
            "title_similarity": "0.5668788",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i4ckvzu",
            "score": 1,
            "text": "That’s one of the sweetest LPT I’ve ever read.",
            "title_similarity": "0.20952292",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ckyul",
            "score": 1,
            "text": "Don't do this. Leave people alone.",
            "title_similarity": "0.1612696",
            "sentiment_compound": -0.3071
        },
        {
            "id": "i4cl34q",
            "score": 1,
            "text": "Nice tip.  I'm always looking for opportunities to make someone feel good.",
            "title_similarity": "0.36254108",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i4cl73i",
            "score": 1,
            "text": "I always love to smile and nod whenever I’m walking past someone on the older side. And always have my phone away too. On St. Patrick’s Day I was incredibly lucky to have a long conversation with an incredibly kind old woman, and she said the biggest change in societies is the phone. Everyone has their face down in their screens. So I put mine in my pocket",
            "title_similarity": "0.65272796",
            "sentiment_compound": 0.9258
        },
        {
            "id": "i4cle6r",
            "score": 1,
            "text": "Is that spy or spot?",
            "title_similarity": "0.12111662",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cm6u3",
            "score": 1,
            "text": "This is a great tip. Thank you! Needed to hear this.",
            "title_similarity": "0.21303649",
            "sentiment_compound": 0.784
        },
        {
            "id": "i4cmc7j",
            "score": 1,
            "text": "God help them though if they enter a store and stop right at the entrance. MOVE OLD MAN!!!",
            "title_similarity": "0.51309925",
            "sentiment_compound": 0.5386
        },
        {
            "id": "i4cmfxu",
            "score": 1,
            "text": "Many want to be left alone. Like you said they are people and they are all different. Some still hate people.",
            "title_similarity": "0.50963336",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4cmtsq",
            "score": 1,
            "text": "And then they start joking about how they don't get any traction with the college girls..",
            "title_similarity": "0.5656119",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i4cn7wc",
            "score": 1,
            "text": "This is such a sweet and thoughtful point.",
            "title_similarity": "0.13717775",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i4cnjv8",
            "score": 1,
            "text": "Not sure why I would spey an older person at a mcD's",
            "title_similarity": "0.4761581",
            "sentiment_compound": -0.2411
        },
        {
            "id": "i4cnzwt",
            "score": 1,
            "text": "I don’t want to talk to people though",
            "title_similarity": "0.22088316",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4co30i",
            "score": 1,
            "text": "Nobody got time for that. .",
            "title_similarity": "0.13445258",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cofhg",
            "score": 1,
            "text": "I want to hunt them like sheep",
            "title_similarity": "0.26002085",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4covck",
            "score": 1,
            "text": "I find it so sad that being nice has to even be mentioned but thanks for saying it.",
            "title_similarity": "0.5300154",
            "sentiment_compound": 0.5031
        },
        {
            "id": "i4cp549",
            "score": 1,
            "text": "Why are people spying on old people anywhere?",
            "title_similarity": "0.5152811",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cp9ky",
            "score": 1,
            "text": "This is very heart warming.   And is something I will from now on try and always remember",
            "title_similarity": "0.17008828",
            "sentiment_compound": 0.7485
        },
        {
            "id": "i4cpdcn",
            "score": 1,
            "text": "I met an old dude while hiking once, we chatted a bit as I got some water but he kept on talking. Stayed for a bit because I could tell he was lonely, his wife passed a few years ago and he hikes that mountain every day. Been trying to run into him again but haven't yet",
            "title_similarity": "0.67932296",
            "sentiment_compound": -0.5023
        },
        {
            "id": "i4cpel2",
            "score": 1,
            "text": "Fuck no! Delete this shit, man. Leave us alone, we're not props who exist to make you feel better about yourself.",
            "title_similarity": "0.3989542",
            "sentiment_compound": -0.8096
        },
        {
            "id": "i4cpqbq",
            "score": 1,
            "text": "I was about to ask why arent there apps for older people to connect with each other, then I realized even if there were they wouldn't use them. Or even know how to :(",
            "title_similarity": "0.49900877",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4cpyrc",
            "score": 1,
            "text": "Old people aren't the only ones lonely as hell. Be nice to everyone.",
            "title_similarity": "0.5493152",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i4cpyrh",
            "score": 1,
            "text": "This literally just happened to me Friday. Took my car in to get brakes done (had no pads and rotors were grinding)\nWhile waiting there was a older gentleman next to me who I overheard being told that his cars problem are as just the battery. The joy in his face and voice was so uplifting I couldn't help but to smile. He noticed and started talking to me and told me how he was expecting to spend at least $1k on repairs. For it just to just be a couple hundred for a battery is a nice come up. We chatted for a while longer while he waited and he told me how his 80 birthday just passed (he looked good for 80 I thought he was in his early 60s) he then told me how he's lucky to still be here because all his friends have passed away. I told him \"take some of that money you saved and treat yourself to a nice dinner\"\nHe said he planned to with a huge smile. Did a fist pump as we both parted ways. Really cool dude.",
            "title_similarity": "0.6907723",
            "sentiment_compound": 0.9902
        },
        {
            "id": "i4cq0q4",
            "score": 1,
            "text": "They are prob talking to their aunt Nunya, mind ya business.",
            "title_similarity": "0.49292377",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cq9px",
            "score": 1,
            "text": "It's such an easy way to make two people smile.",
            "title_similarity": "0.26754856",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i4cqjwx",
            "score": 1,
            "text": "Hey you, I like you",
            "title_similarity": "0.08620538",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4cqjxf",
            "score": 1,
            "text": "my grandma just passed away and this reminds me of the time she called me super excited because she just made 5 new great friends - highschoolers that talked to her when she was eating at mcdonalds",
            "title_similarity": "0.64610684",
            "sentiment_compound": 0.926
        },
        {
            "id": "i4cqkxe",
            "score": 1,
            "text": "I dont have friends so I guess I’m ahead of my peers",
            "title_similarity": "0.51378703",
            "sentiment_compound": -0.3724
        },
        {
            "id": "i4cr34f",
            "score": 1,
            "text": "i work grocery and it is part of the reason i love my job.  \n\n\nnot many of the customers are awesome, but a few just want to be friends and share life stories from 2+ generations ago.  \n\n\ni appreciate it maybe as much as they do.",
            "title_similarity": "0.6443155",
            "sentiment_compound": 0.9442
        },
        {
            "id": "i4crdzk",
            "score": 1,
            "text": "If I somehow manage to live to old age. No idea how that'll happen but if I did. None of you better approach me while I'm trying to eat. Godamn I'll whip ya with my cane. Whippersnappers approaching me like that. Ruined my day",
            "title_similarity": "0.62091154",
            "sentiment_compound": -0.6817
        },
        {
            "id": "i4crhmj",
            "score": 1,
            "text": "Man, I like \"me\" time a lot, and I dread of people doing that to me as I get older.",
            "title_similarity": "0.5476036",
            "sentiment_compound": -0.128
        },
        {
            "id": "i4crhzj",
            "score": 1,
            "text": "What a beautiful suggestion. I will.",
            "title_similarity": "0.019303545",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i4csd21",
            "score": 1,
            "text": "Not to be a dick, but I find most old people to be unfunny, self-absorbed religious fanatics.\n\nAgain, not trying to be a dick.",
            "title_similarity": "0.6450449",
            "sentiment_compound": -0.765
        },
        {
            "id": "i4cslpy",
            "score": 1,
            "text": "\"Many have outlived their friends and are lonely as hell.\" My god, OP's right and he just blew my mind. Will do.",
            "title_similarity": "0.6134898",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4ctbtc",
            "score": 1,
            "text": "I work a delivery service as a second job and do just this. The amount of repeat customer's I deal with that I go in knowing \"this is going to be their only social interaction this week/month\" makes me want to treat them a bit better. I drop the customer service mask, talk more frankly, ask a genuine question on something to get them to think+respond- it may be only a minute or two of my time, but it often means the world to these kinds of people. Often times, it's hard leaving to go to the next stop/ect without feeling like you're walking away from the conversation. Also keep in mind, it's not always the elderly- you learn pretty quickly who needs some kind of social interaction, and take the time to make their day/week/year- it's a world of a difference to a lot of people.",
            "title_similarity": "0.6415507",
            "sentiment_compound": 0.4367
        },
        {
            "id": "i4ctn1l",
            "score": 1,
            "text": "I try to start conversation with older people who are alone when I check out their groceries (if they seem to be in the mood to talk). I always spend extra time talking to this one older guy, especially after he told me how he was buying stuff to make the recipes that his wife used to make him, as she recently had passed away. I can’t imagine how lonely that must feel for a person, especially since I’m only a young adult who has many living friends, relatives, and a partner. I hope I’ll get the same thing in return when I become that age",
            "title_similarity": "0.7684641",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4ctvtr",
            "score": 1,
            "text": "Yeah, but, then they might talk back!",
            "title_similarity": "0.10441466",
            "sentiment_compound": 0.2244
        },
        {
            "id": "i4cu5dz",
            "score": 1,
            "text": "Just don’t crack deez nuts jokes",
            "title_similarity": "0.31594425",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i4cucvt",
            "score": 1,
            "text": "Speaking as a nurse here. Please do this. They need all of us. ❤️",
            "title_similarity": "0.21245885",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4cuepg",
            "score": 2,
            "text": "I’m not even old, and unfortunately have outlived my friends.",
            "title_similarity": "0.54803574",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i4cught",
            "score": 1,
            "text": "It's fine to make the offer, but if they don't want the company, accept that gracefully. I'm not that old yet, and I have to admit I'm a little wary of being approached by strangers because so many people want something.",
            "title_similarity": "0.5731956",
            "sentiment_compound": 0.9024
        },
        {
            "id": "i4cuqea",
            "score": 1,
            "text": "If you see someone alone in general, it never hurts to say hello.",
            "title_similarity": "0.47878197",
            "sentiment_compound": 0.1416
        },
        {
            "id": "i4cuzdq",
            "score": 1,
            "text": "Perhaps I would but.. what if they're like me and really do t want to be bothered?",
            "title_similarity": "0.39288402",
            "sentiment_compound": 0.2836
        },
        {
            "id": "i4cvomg",
            "score": 1,
            "text": "We have a little arl fella who drinks in this nice little bar every night. No matter what everyone always looks after him, staff and other customers, always being bought a pint and getting shopping sorted for him. Sometimes England's drinking culture has a positive side and i love it.",
            "title_similarity": "0.6448372",
            "sentiment_compound": 0.8996
        },
        {
            "id": "i4cvteo",
            "score": 1,
            "text": "I know how that feels. I’m 27 and haven’t had a friend for years. It’s definitely lonely but I’m glad I’m getting used to it now so I don’t have memories to haunt me later.",
            "title_similarity": "0.6198466",
            "sentiment_compound": 0.3919
        },
        {
            "id": "i4cwdxq",
            "score": 1,
            "text": "I won’t say the decline of religion isn’t contributing to this, but I think it has more to do with larger societal changes. Changes in technology make it much easier for people to move around and leave home. Well-paying jobs aren’t always available close to home, forcing people to move to wherever the jobs are. \n\nWhere “home” is really matters. My parents live in a rural area of the Midwest, 45 minutes from the nearest Walmart. There are no well-paying jobs in that area that would allow me to live close to home and support myself.",
            "title_similarity": "0.61896324",
            "sentiment_compound": 0.7958
        },
        {
            "id": "i4cwo8f",
            "score": 1,
            "text": "I completely agree. If you don’t talk about those who have passed, it’s like they never lived. I visited the husband of a friend in hospice and started asking him about his life (family and work). He wanted to remember his life and tell me about it. I learned a lesson that day.",
            "title_similarity": "0.60279846",
            "sentiment_compound": 0.8173
        },
        {
            "id": "i4cwovn",
            "score": 1,
            "text": "Just today I asked the tall elderly man to help me and get a can of veggies from the top shelf for me. He was like, “oh, I don’t know if I can reach that…” and I assured him that his 8 inches of height, and obviously strong arms will be great for the task.  He laughed, handed me me beets and then asked where he could find the spices. Got him sorted and we were on our way.",
            "title_similarity": "0.60142773",
            "sentiment_compound": 0.9584
        },
        {
            "id": "i4cwpkh",
            "score": 1,
            "text": "One of my favorite things to do is go to the casino by my house and sit next to old people and talk with them. I’ve met so many interesting people and learn a lot. My grandma goes there for social interaction now that my grandpa has passed away. So I know how important it is to some of them just to have someone to talk to.",
            "title_similarity": "0.6333567",
            "sentiment_compound": 0.7769
        },
        {
            "id": "i4cwshj",
            "score": 1,
            "text": "If I don't want randos coming up to me talking to me know, why would I want thing when I'm old?",
            "title_similarity": "0.4369926",
            "sentiment_compound": 0.0201
        },
        {
            "id": "i4cxaur",
            "score": 1,
            "text": "My greatest fear is growing old and alone... Hell that's my life right now and I'm only in my 20s lol. Oh God.",
            "title_similarity": "0.5186821",
            "sentiment_compound": -0.0
        },
        {
            "id": "i4cxfjt",
            "score": 1,
            "text": "37 and feel the same way.  Talk to us too!",
            "title_similarity": "0.17094995",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cxte2",
            "score": 1,
            "text": "Do this for everyone regardless of age.",
            "title_similarity": "0.07228987",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cy812",
            "score": 1,
            "text": "I did this once on a long road trip and she told me the most fascinating stories. I felt really good about it.",
            "title_similarity": "0.39234272",
            "sentiment_compound": 0.7897
        },
        {
            "id": "i4cya1v",
            "score": 1,
            "text": "Maybe they are just hungry or buying gas?",
            "title_similarity": "0.48045778",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4cye6h",
            "score": 1,
            "text": "When my great aunt died, we found boxes of happy meal toys. Turns out she would go to McDonald’s once a week and order a meal (happy meal was all she could manage) just so she could eat lunch around people.",
            "title_similarity": "0.6525829",
            "sentiment_compound": 0.836
        },
        {
            "id": "i4cyg03",
            "score": 1,
            "text": "I think this kind of tip can be said for all people. Many people are lonely and having a kind word said to them or not even a small positive interaction can make their whole day.",
            "title_similarity": "0.64410734",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i4cz87z",
            "score": 1,
            "text": "My Dad is 85 and he has always been a little kid magnet. They just come up to him and start talking to him and he responds with interest and asks them questions back.  He genuinely loves chatting with kids because there minds are so creative and open.  Parents always try to rush their kids away, and it makes him a little sad.",
            "title_similarity": "0.63319504",
            "sentiment_compound": 0.8241
        },
        {
            "id": "i4czr2o",
            "score": 1,
            "text": "Ooohhh I agree! I work with the elderly and am naturally drawn to them it seems. I was leaving the grocery store the other day and smiled at an elderly woman. She said \"I wish I had some of your warmth, I'm just so frustrated today!\" She then told me about her morning and how the store didn't have her vitamin supplements. I listened and sympathized and made small talk, which is hard for me sometimes. But the interaction brightened my day, and I hope it brightened her's as well. She called me *warm*. :)",
            "title_similarity": "0.74595785",
            "sentiment_compound": 0.9757
        },
        {
            "id": "i4czz9r",
            "score": 1,
            "text": "As a very lonely person without any friends, it would upset me very much to have random people interact with me in that way! When I am out and about in public, shallow interactions with random people is an annoyance to put up with at best.\n\nAlso, how is going out of your way to interact with old people in a way that you might not normally interact with anyone else seems patronizing and absolutely does NOT reassure old people that they are still people. That is ludicrous!",
            "title_similarity": "0.64286804",
            "sentiment_compound": -0.8566
        },
        {
            "id": "i4d078b",
            "score": 1,
            "text": "I’m not a fan of socializing with strangers. But old people… they are my exception. I will chat them up right back, even when I don’t feel like it.",
            "title_similarity": "0.6393429",
            "sentiment_compound": 0.4155
        },
        {
            "id": "i4d08sv",
            "score": 1,
            "text": "I had recently the reverse of this. An old woman complimented my dress while in the supermarket line. We made small talk in as much as I could handle the language. Was all very sweet.",
            "title_similarity": "0.5502729",
            "sentiment_compound": 0.7264
        },
        {
            "id": "i4d09wl",
            "score": 1,
            "text": "Love this...thank you",
            "title_similarity": "0.0340818",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4d109x",
            "score": 1,
            "text": "You can also be nice to a 49 year old. I will not complain.",
            "title_similarity": "0.38997447",
            "sentiment_compound": 0.6007
        },
        {
            "id": "i4d11t8",
            "score": 1,
            "text": "My dad has been saved by kind strangers several times, and I’m always grateful for that. It’s gotten to the point (at 83) that we may need to become a multigenerational household this year. I live about 30 minutes from him, and it’s just too much when things go sideways. I’m one of 4, and the only person he sees most weeks. The only one who chats with him daily (alive and well checkins).",
            "title_similarity": "0.6259872",
            "sentiment_compound": 0.9169
        },
        {
            "id": "i4d16ll",
            "score": 1,
            "text": "A selfless tip.  Pro humanitarian tip.\n\nBut disclaimer is if he turns out to be a Trump lover.",
            "title_similarity": "0.45161968",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i4d1b8q",
            "score": 1,
            "text": "This is a great advice indeed. I work at a community center and not only do we have dance/music/theater classes and a youth center, but also the very same for the pensioners. Every day between 10-14 they are having all sorts of activities. Tons of dances, useful IT-classes, workouts, arts, various hobbies and get togethers and once every week there's an old jazz band playing there. Plus special events every now and then. It's VERY appreciated.",
            "title_similarity": "0.44103682",
            "sentiment_compound": 0.9592
        },
        {
            "id": "i4d1qoi",
            "score": 1,
            "text": "This feels like a tip for sugar babies.",
            "title_similarity": "0.2769719",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4d1uiu",
            "score": 1,
            "text": "\"if you see an old person make sure you go out of your way to interact with them and let them know its not because they're old because they're about to die\" \n\nwhat a weird lpt. treating people differently isn't how you show them they're like everyone else lmao.",
            "title_similarity": "0.60165644",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i4d1yzv",
            "score": 1,
            "text": "Fuck, do this to young people too. I'm lonely as hell",
            "title_similarity": "0.4133071",
            "sentiment_compound": -0.891
        },
        {
            "id": "i4d2660",
            "score": 1,
            "text": "This is the most wholesome pro tip I've ever heard",
            "title_similarity": "0.21518487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4d2a3k",
            "score": 2,
            "text": "My grandfather died Christmas eve before last. He buried three brothers, a sister, a wife, and countless friends. He was lonely toward the end. Its not fair that a long life is awarded with dispair. He taught me a lot about respect, especially for older folks. Told me stories about his youth that were almost parallel to stories of my own. He was very promiscuous as a teen and when I got to my 20's he'd hit me with little snippets of vulgarity that was beyond delighting. Old people had fill rich lives and did the same shit we do now. Maybe a bit slower than we could do them, but still. They were just as raucous, disgusting, entertaining, rude, polite, and enchanting as we are now. \n\nI try to set aside as much time as I can for old folks. To hear their stories and just their general take on today's society. \n\nI held a door open for an old man in gas station once and he bought me the case of twisted teas I was about to buy. All I did was say hi and hold the door. He told me he hoped I'd remember him some day and buy some beer for some young guy one day, and i fuckin plan to.",
            "title_similarity": "0.6899998",
            "sentiment_compound": 0.0058
        },
        {
            "id": "i4d2l3x",
            "score": 1,
            "text": "I humor old people as often as possible honestly",
            "title_similarity": "0.5097438",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i4d2n72",
            "score": 1,
            "text": "Can’t outlive your friends if you don’t have any 😉",
            "title_similarity": "0.45187393",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i4d2vll",
            "score": 1,
            "text": "This is not a Life Pro Tip. This is a Be Nice in Life Tip",
            "title_similarity": "0.39123982",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4d30to",
            "score": 1,
            "text": "I'm old enough to remember the excitement of the first tv, and a few years later, the COLOR tv. \n\nI just met today with a friend I didn't see since December and almost cried. I can count my friends with two fingers.",
            "title_similarity": "0.57753253",
            "sentiment_compound": 0.8016
        },
        {
            "id": "i4d40p6",
            "score": 1,
            "text": "My 80-something grandfather was widowed 15 years ago, and never had many friends. He walks himself to the Burger King down the street every other day, where the employees load him up with as many free fries, desserts, and drinks as they can get away with without getting in trouble. \n\nHe goes at less busy times so he can chat with \"the young ladies and gents\" behind the counter without holding up a line. I earnestly believe those Burger King employees are giving him a reason to keep living.",
            "title_similarity": "0.7823328",
            "sentiment_compound": 0.3191
        },
        {
            "id": "i4d47o3",
            "score": 2,
            "text": "Yep, my father went on a downward spiral after all his siblings, their spouses and most of his friends were gone.   It’s pretty tough to make new friends when you’re 85+.",
            "title_similarity": "0.54791623",
            "sentiment_compound": 0.885
        },
        {
            "id": "i4d49ck",
            "score": 2,
            "text": "We as a society should make greater efforts to take care of our elderly.",
            "title_similarity": "0.2108717",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i4d4a54",
            "score": 1,
            "text": "Well…this made me really sad",
            "title_similarity": "0.20995483",
            "sentiment_compound": -0.5256
        },
        {
            "id": "i4d4j98",
            "score": 1,
            "text": "Old people are by far my favorite people. At my girlfriends family dinner I always sit next to her grandma. She’s so sweet and has so much knowledge. At my bar id much rather talk to the 80 year old dude whose only friend is the bar than the young guys who all the same shit.",
            "title_similarity": "0.7289312",
            "sentiment_compound": 0.7555
        },
        {
            "id": "i4d4xtb",
            "score": 1,
            "text": "My favorite activity is commiserating with elderly people about long lines, rude morons, the price of soda going up. A good kvetch makes you live longer",
            "title_similarity": "0.71538854",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i4d5he4",
            "score": 1,
            "text": "I agree with this tip and I'm sure it's fine and whatever but wouldn't going out of my way to specifically talk to old people when I wouldn't talk to any other person in that situation mean I'm specifically treating them like old people?\n\nAgain, I get that it doesn't matter what I'd usually do because all that really matters is how it makes them feel but it feels weird to me.",
            "title_similarity": "0.60223764",
            "sentiment_compound": 0.6682
        },
        {
            "id": "i4d5itw",
            "score": 1,
            "text": "It seems like such positivity here, but this idea of getting old is the reason I plan to check out at 65/70",
            "title_similarity": "0.47645718",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4d5m7a",
            "score": 1,
            "text": "America has a terrible attitude towards its elderly population. It is shameful.",
            "title_similarity": "0.4450757",
            "sentiment_compound": -0.743
        },
        {
            "id": "i4d5yma",
            "score": 1,
            "text": "Shit…I thought that was a benefit of getting old. People leave you the fuck\nAlone.",
            "title_similarity": "0.5503597",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4d63qm",
            "score": 1,
            "text": "Except if you're in Finland.",
            "title_similarity": "0.15323398",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4d67kt",
            "score": 1,
            "text": "I work as a cable guy, it's not glamorous but I interact with alot of people. My favorite people are the elderly, I stop being the guy to fix shit and become me for a moment. I talk to them, hear their stories and share my own, many thanking me for staying a bit over my time just to chat. I've met vets who worked on b-25s, ladies who used to be talk of the town. Men who were masters of their craft. Sometimes I'm the only person outside of the caregivers they see, sometimes I get the same customers, which bring me joy. I'm sorry I couldn't fix the cable the first time but I'm damn glad I got to see you a second Lou, Susan, Diana, Steve.",
            "title_similarity": "0.74727976",
            "sentiment_compound": 0.5344
        },
        {
            "id": "i4d6l5x",
            "score": 1,
            "text": "Listen to John Prine Hello in There.",
            "title_similarity": "0.21047133",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4d6lxo",
            "score": 1,
            "text": "Without knowing this post existed, I actually had a small conversation with two older ladies at the supermarket today.  It started with me attempting to be polite, but they opened up and joked with me.  Before I exited, I saw they were nearby and wished them a pleasant day.\n\nI'm \"only\" 38 but...I never thought I'd be this age, and before I know it I'll be their age.  So it's good to be nice to people from now.\n\nBut honestly, I went through a moment so bad in my life, that the kind words of a checkout worker at a supermarket saved me.  So ever since then man...I try and repay that favor one person at a time.  It feels good to be nice.",
            "title_similarity": "0.76836824",
            "sentiment_compound": 0.9867
        },
        {
            "id": "i4d6qud",
            "score": 1,
            "text": "They allowed for the world to get this way. Fuck em.",
            "title_similarity": "0.21532902",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4d77gm",
            "score": 1,
            "text": "Nope. Fuck boomers. They destroyed the planet, the economy & wont let the younger generations fix it. They deserve to he lonely amoungst much more.",
            "title_similarity": "0.54029596",
            "sentiment_compound": -0.431
        },
        {
            "id": "i4d81ub",
            "score": 1,
            "text": "Not to mention you can always learn great stories from them. I’ve heard COUNTLESS military, love, work, life, and school stories, along with life advice that has helped me beyond anything I learned in high school. \n\nI worked at a small town cafe at home and now work at a Physical Therapy clinic and my “regulars” were and are elderly for the most part. The best ones are the ones you have to crack, which are mostly little old men. One customer from home barely spoke to anyone. I started asking him about his injuries and wound care stuff since I’m familiar with it. One day he came in with a new wound and when I told him I should bubble wrap him he nearly fell out of his chair from laughter. \n\nI’m in the process of getting recipes from some of the patients at the pt clinic. I talk to a Marine about his stories from Vietnam. One mans wife is in the exercise class in the gym next door, and I had him doubled over laughing when I asked if he thought about cycling class with her. \n\nI’m only 20 years old but I feel like I’ve lived 100 lives through talking to these people. I still keep up with my regulars from my hometown cafe and they interact with my parents/granddad/facebook to keep up with me in college. \n\nThey may have a tough exterior, but they’ve probably lost a lot of people they love. Talk to them. Learn from them. They’ll enjoy it more than you think; they still have a lot of love and life left in them.",
            "title_similarity": "0.7226557",
            "sentiment_compound": 0.9828
        },
        {
            "id": "i4d84lm",
            "score": 1,
            "text": "My grandmother is in her 90s. She told me that the worst thing about it is outliving all your friends",
            "title_similarity": "0.5648575",
            "sentiment_compound": -0.25
        },
        {
            "id": "i4d8dj4",
            "score": 1,
            "text": "How’s the weather, ya ol bag?",
            "title_similarity": "0.15728971",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4d8qh1",
            "score": 1,
            "text": "Do this even for “young seniors”, like 60+. My dad has commented how invisible he’s felt in society since getting older, even being a working professional still, and healthy and active.",
            "title_similarity": "0.6579058",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i4d9030",
            "score": 1,
            "text": "Back when I was in college I used to stop at Hardee's for breakfast every morning. Eventually I earned a seat at the elderly table. I was there 2 days a week in the morning. They are so fun to talk with and have the craziest stories.",
            "title_similarity": "0.53342944",
            "sentiment_compound": 0.4294
        },
        {
            "id": "i4d95oo",
            "score": 1,
            "text": "John Prine said this as well as anyone ever has. \n[Hello in There](https://youtu.be/VKoYHFVBpEA)",
            "title_similarity": "0.2957607",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4d9o03",
            "score": 1,
            "text": "My brother gets to church early and tells all the older women how good they look and gives them a hug.\n\nI showed up one weekend for my nieces confirmation. Every lady in the church came up to me and told me how much they loved my brother and how he put a smile on their face every Sunday.",
            "title_similarity": "0.4610229",
            "sentiment_compound": 0.9081
        },
        {
            "id": "i4d9wsp",
            "score": 1,
            "text": "This is the one thing I dread about aging, more than anything else- outliving my friends / family and being alone.",
            "title_similarity": "0.5666528",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i4da5x3",
            "score": 1,
            "text": "During pokemon go's release I would go for lunch by myself at a local Chinese spot. One time a nice old lady brought her food to my table and at first I was like wtf but she shared a ton of cool stories of her in the military fixing planes. She shared photos of her husband that passed and I got to share some of my life with her.  One of my favorite experiences to this day",
            "title_similarity": "0.7122617",
            "sentiment_compound": 0.9451
        },
        {
            "id": "i4dac41",
            "score": 1,
            "text": "There have been several times eating that we have invited people in that position to join us.  Last year at Easter we invited a gentleman to join me and my family for Easter dinner.  After all was said and done and we parted ways I saw him crying in his car so I went to check on him.  He told me that his family had forgotten about him and how thankful he was that he got to join us.",
            "title_similarity": "0.66749704",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i4db68j",
            "score": 1,
            "text": "I don't do this to people, so doing it to an old person would not be acting normal.\n\nIt's good advice, just don't try to play it as treating them like they're \"still just people \".",
            "title_similarity": "0.53444827",
            "sentiment_compound": 0.521
        },
        {
            "id": "i4db767",
            "score": 1,
            "text": "Aw man this is so true. Thanks for that reminder, I needed that.",
            "title_similarity": "0.221777",
            "sentiment_compound": 0.7779
        },
        {
            "id": "i4dbjzb",
            "score": 1,
            "text": "If you're ever at a restaurant and an elderly man by himself, wearing a clean, pressed, decade old button-up tucked into his jeans/slacks invites you to sit down and share a meal... just do it!   \n\n\nEvery time I've done this, the person turned out to be a gem of a human. Every time they have been a widower who shared their entire life with one person and they're just lonely.",
            "title_similarity": "0.759766",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i4dbkvc",
            "score": 1,
            "text": "I’m 36 and lonely has hell",
            "title_similarity": "0.29558364",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i4dbp1p",
            "score": 1,
            "text": "I do this all the time in the supermarket I work at. For some older folks, this is the *one and only* trip out each week/month",
            "title_similarity": "0.5009195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dbubm",
            "score": 1,
            "text": "What if they have a MAGA hat on?",
            "title_similarity": "0.03973817",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dcaf8",
            "score": 1,
            "text": "I used to take my daughter to McDonald’s after school sometimes and the elderly people were super creepy and trying to take pictures of her I definitely wouldn’t be striking up conversation with them.",
            "title_similarity": "0.76225936",
            "sentiment_compound": 0.765
        },
        {
            "id": "i4dce84",
            "score": 1,
            "text": "Best LPT ever, thank you.",
            "title_similarity": "0.14266004",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i4dci17",
            "score": 1,
            "text": "i love getting paired with older people on the golf course for this very reason.",
            "title_similarity": "0.4186588",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4dcojt",
            "score": 1,
            "text": "I hope people continue to leave me alone when I’m old",
            "title_similarity": "0.54579175",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i4dcvg9",
            "score": 1,
            "text": "One of my favorite memories as a brand new adult(I was either 18 or 19 idr for sure) was me and my friend had been out all night raising hell doing what people who can't legally drink do in the middle of Oklahoma, and decided to stop at McDonald's for breakfast around like 8am or something and there were two elderly gentlemen in line too and they let us in front of them and all that. We struck up a conversation waiting for our food and these two guys were ww2 vets and had been in Europe during the liberation of Paris and I remember they were both kinda poking fun at each other about how they caught \"some such disease from one of those French brothels\" and just going on about the war and how they've been friends their entire life and before we knew it it was almost noon and I could tell when we had to finally pack up and go that we had made their day just the same as they had made ours it was a genuinely wholesome experience. My only regret was that I didn't think to ask to record their stories because it was all fascinating and they were exceedingly happy to share and tell their stories with us two random young men that just happened to bump into them at breakfast.",
            "title_similarity": "0.752744",
            "sentiment_compound": 0.8666
        },
        {
            "id": "i4ddyd2",
            "score": 1,
            "text": "Made me so sad and what a great idea. Thank you. Will surely do this",
            "title_similarity": "0.33501887",
            "sentiment_compound": 0.6714
        },
        {
            "id": "i4degay",
            "score": 1,
            "text": "I met an elderly couple at McDs the other day and after chatting for about 30 minutes about war stories and tales of the 60s and 70s, I asked them if they lived in the area. They said no, but they commute about an hour to this McDonalds every day because their friends at the McDonald’s by their house started to die out and they wanted to meet new friends.",
            "title_similarity": "0.7481853",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4detr6",
            "score": 1,
            "text": "I don't know. Some might just want to be left alone.",
            "title_similarity": "0.31318045",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4dfcnp",
            "score": 1,
            "text": "Ok this just broke mah fucking heart mate",
            "title_similarity": "0.27431232",
            "sentiment_compound": 0.5984
        },
        {
            "id": "i4dg5tc",
            "score": 1,
            "text": "Ive outlived my friends and im only 26…",
            "title_similarity": "0.46279073",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i4dgvgi",
            "score": 1,
            "text": "Say, \"Hello in there\"",
            "title_similarity": "0.025845936",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dh1b7",
            "score": 1,
            "text": "LPT if spying on old people is your hobby, maybe consider a new hobby.",
            "title_similarity": "0.49263862",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dh1op",
            "score": 1,
            "text": "Who the hell is upvoting this patronizing non-sense? I'm having a nice quiet meal, mind your own business.",
            "title_similarity": "0.6210145",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4dh2cw",
            "score": 2,
            "text": "Worked at McDonald's in the late 90s.  We had a nice old man come in almost every day and order a coffee and a hamburger.  As soon as we saw him, we'd get his order ready. He had to be pushing 90.  Rest in Piece Elmer.",
            "title_similarity": "0.6214046",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i4dh9s2",
            "score": 2,
            "text": "There’s an older guy who visits the cafe I work at every day, and whenever business slows down and there’s nothing that needs my attention I take some time to sit with him and have coffee together. He’s 89 and has outlived a lot of his friends, and I’ve noticed how he’s become a lot more cheerful since we met a few months ago. He’s a wonderful guy and I’m really grateful to have met him.",
            "title_similarity": "0.68654615",
            "sentiment_compound": 0.9311
        },
        {
            "id": "i4dhbau",
            "score": 1,
            "text": "Instructions unclear, time to spy on old people at McDonald's",
            "title_similarity": "0.7451441",
            "sentiment_compound": -0.25
        },
        {
            "id": "i4dhhhw",
            "score": 1,
            "text": "This Life Pro Tip has the idea that I am skilled with social interaction.\n\nAnd I assure you, I am not. Otherwise, I would.",
            "title_similarity": "0.49072248",
            "sentiment_compound": 0.34
        },
        {
            "id": "i4dhijh",
            "score": 1,
            "text": "Anyone else in their 30s and thinking welp I guess my lack of a social circle means I'm 70 now.",
            "title_similarity": "0.44857293",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i4dhrll",
            "score": 1,
            "text": "I hope elderly people don't let others \"casually interact\" with them. That's how they get robbed. Source: my mother, just wanting to be \"nice\" to the young man who was friendly. \n\nIf you really want to help senior citizens, please volunteer at a local senior center or nursing home.  Be serious about helping, don't just approach random old strangers thinking you're their savior ffs.",
            "title_similarity": "0.72553873",
            "sentiment_compound": 0.8844
        },
        {
            "id": "i4dicbo",
            "score": 1,
            "text": "If you guys come up and start talking to me while I'm enjoying myself alone, I'm going to tell you to kindly bugger off.",
            "title_similarity": "0.6142112",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i4diu6s",
            "score": 1,
            "text": "Um anytime an elderly person has interacted with me in a store I have been concerned about my safety, their safety, and the other people who will also have interact with them in the energy future. They are racists trolls out trying to drain any bit of happiness from the youth around them. I’ve had to actively No engage so that I will avoid being arrested. One time I was concerned he’d beat me with the fifteen loaves of bread he was buying all while complaining about lines and biden and some other things I will not repeat. He was awful to me and the cashier and i apologized for him. My new motto is to avoid them unless needed. But hey that’s just me 🤣🤣",
            "title_similarity": "0.7328615",
            "sentiment_compound": 0.8455
        },
        {
            "id": "i4diz7m",
            "score": 1,
            "text": "We had one old lady scream at us for doing holiday carols at the old folks apartments, when I was in high school.  Some people don’t like to be bothered.",
            "title_similarity": "0.62629104",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i4dj3gu",
            "score": 1,
            "text": "Tried the tip and came to say this\n\nDon’t do that in Gardena,Ca out on Figueroa and Redondo! big NO, don’t do it.",
            "title_similarity": "0.3357945",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dj71a",
            "score": 1,
            "text": "See also \"hello in there\" by John Prine",
            "title_similarity": "0.0958646",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4djbf3",
            "score": 1,
            "text": "This tip makes me want to cry in a good way",
            "title_similarity": "0.2698951",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4djc33",
            "score": 1,
            "text": "High quality LPT. Great share. More of this.",
            "title_similarity": "0.04915501",
            "sentiment_compound": 0.743
        },
        {
            "id": "i4djet9",
            "score": 1,
            "text": "My grandmother lives alone now in a community with mostly elderly persons. She's always busy doing something with them. She even has a smartphone now. They may be a little trumpy in their beliefs, but I can't help but be grateful that she isn't alone. Every week she tells me of another friend of hers who's broken something since she's the young one at 75 yrs old.",
            "title_similarity": "0.7145517",
            "sentiment_compound": 0.4354
        },
        {
            "id": "i4djg0b",
            "score": 1,
            "text": "Imma pass on that one",
            "title_similarity": "0.03806981",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dkbj7",
            "score": 1,
            "text": "Love this. Thank you :)",
            "title_similarity": "0.06725183",
            "sentiment_compound": 0.8658
        },
        {
            "id": "i4dkbo4",
            "score": 1,
            "text": "\"So if you're walking down the street sometime\n\nAnd spot some hollow ancient eyes\n\nPlease don't just pass 'em by and stare\n\nAs if you didn't care, say, \"Hello in there, hello\"\"\n\n- John Prine",
            "title_similarity": "0.59299624",
            "sentiment_compound": -0.0844
        },
        {
            "id": "i4dlahf",
            "score": 1,
            "text": "I am 20 and outlived my friend. Shit sucks. All my other ones I am less close with and they are at college anyways.",
            "title_similarity": "0.5843859",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4dlco3",
            "score": 1,
            "text": "I thought all people did this normally lol. Must be a southern thing.",
            "title_similarity": "0.30095264",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4dlrya",
            "score": 1,
            "text": "I see this frequently. It's sad and this is a good post",
            "title_similarity": "0.33177447",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i4dlwfa",
            "score": 1,
            "text": "See: John Prine, \"Hello in There\"",
            "title_similarity": "0.11819956",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dm130",
            "score": 1,
            "text": "I read this and immediately turned to this old lady sitting next to me at the bar and told her I liked her jacket. I could tell it made her day, gonna do that more often.",
            "title_similarity": "0.5184758",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4dnghd",
            "score": 1,
            "text": "I miss getting lunch with the ladies at my grandma’s building so much. I wish more senior centers did community-wide events. I know its not really possible right now because of COVID, but when things are more manageable I hope there’s more initiative to get entire communities involved with their elderly.",
            "title_similarity": "0.6803434",
            "sentiment_compound": 0.712
        },
        {
            "id": "i4dnuv3",
            "score": 1,
            "text": "[Hello In There ](https://youtu.be/RfwGkplB_sY) by John Prine fits well here",
            "title_similarity": "0.19871639",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4doa80",
            "score": 1,
            "text": "When i get old i’m going to wear sick shades and hangout at the skate park, so you dont have to worry about me!",
            "title_similarity": "0.6645911",
            "sentiment_compound": -0.2928
        },
        {
            "id": "i4dodsm",
            "score": 1,
            "text": "Please don't do this, as a person who regularly does things by myself (albeit I'm only 25) I hate when people (extroverts) think they have to interact with every single person who they see. Let me eat, fill up, etc in peace and alone. I'm there for a reason\n\nDon't assume just because someone is old they're lonely and need your communication",
            "title_similarity": "0.7918531",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4dojfd",
            "score": 3,
            "text": "Lmao fuck no, treat people the way you want to be treated and I sure as hell don't want random strangers approaching me and trying to start a conversation so why would I subject other people to that either?",
            "title_similarity": "0.4616291",
            "sentiment_compound": -0.0315
        },
        {
            "id": "i4dopyy",
            "score": 1,
            "text": "True! I met a wonderful older gentleman named Chuck on my walk with my dog and he talked about his show dog for literally 45 minutes. Just hearing his enthusiasm was so wonderful. He constantly told me \"thank you for listening to an old geezer like me. Sorry i ramble a lot,\" and I had to reassure him it was my pleasure. I was sad he felt like he had to keep apologizing.",
            "title_similarity": "0.6503033",
            "sentiment_compound": 0.9705
        },
        {
            "id": "i4dp067",
            "score": 1,
            "text": "\\#1 complaint of my female friends over 80 is that they feel invisible in public ... people just ignore them. Eye contact and a nice smile with a friendly \"Good afternoon\" can go a long way to making someone's day brighter.",
            "title_similarity": "0.73372364",
            "sentiment_compound": 0.9081
        },
        {
            "id": "i4dp97z",
            "score": 1,
            "text": "They're friendlier and have better stories than most people.",
            "title_similarity": "0.3624664",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i4dpagz",
            "score": 1,
            "text": "I know friends make you strong I watched the same musical you did.",
            "title_similarity": "0.27178133",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i4dpga5",
            "score": 2,
            "text": "I started feeling invisible at work when I turned 60. I retired at 62 and took all my knowledge with me.\n\nCall me grandma? Go f\\*\\*k yourself.",
            "title_similarity": "0.553001",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4dplma",
            "score": 1,
            "text": "Don't get me venting on friends who resent you 'cause all you've ever done is been a noose to hang on to. They thought was a necklace, and reckless, they fell into hell where you both hang with nothing to do but scratch, kick, let gravity win like…\nFuck this, let gravity win like…\nYou could leave it all behind.\nEven the Devil needs time alone sometimes.",
            "title_similarity": "0.6422931",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i4dq3gj",
            "score": 1,
            "text": "Old men like to go get coffee at 7 am at the mcdonals and “jack” in the handicapped stall",
            "title_similarity": "0.6229054",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i4dq4kv",
            "score": 1,
            "text": "Just got done with old man ranting about woke. Just nodded moved on. Old people are scary.",
            "title_similarity": "0.61528945",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4dq71x",
            "score": 1,
            "text": "Im mid 30s and already feel neglected by society and lonely as hell",
            "title_similarity": "0.51540613",
            "sentiment_compound": -0.8885
        },
        {
            "id": "i4dqrb5",
            "score": 1,
            "text": "I did this with a nice black man outside of my university on the walk back to my car. I walked into a whataburger on the way to get a Dr. Pepper because well why not. As I was sitting by self in a booth, this man was looking at me like he knew me, I knew I just had to play along and so I struck up a conversation with him. Yknow what’s my major, a little backstory, what I plan on doing. The usual. He went on to tell me about himself and how were lucky were guys and proceeded to completely dumpster on woman. He then talked about the civil rights era and how he was a professor at some university and how he was arrested? The whole encounter gets a little fuzzy there because he would not stop talking especially when I’m a little uncomfortable about this man going on a Malcolm X black panther tirade, while also degrading women. Honestly I felt bad, all I could do was sit there and laugh awkwardly while trying to sincerely listen. He didn’t look to hot though.",
            "title_similarity": "0.6686236",
            "sentiment_compound": 0.6136
        },
        {
            "id": "i4dr115",
            "score": 1,
            "text": "I had a kind of old guy come into my store, asked if we had relish. I said what I usually say, \"if it's not up here, we probably don't have any.\"\n\nhe apparently really liked that, he took it as me saying \"if it's not here, it's not here.\" which I guess isn't wrong, but...\n\nhe came in with a friend, and he told him about what I said to. at that point I was kinda getting weirded out, cuz this was like a full minute after I said it and he was talking about how he liked it and people he know would say that.\n\neventually the guys' friend walks out and he says he was intentionally being slow with what he was doing so he could stay.\n\nbut eventually after all that, it was like he was trying to apologize for something, I think he thought that I was taking offense in some way, which I wasn't.\n\nmaybe he got that idea because I'm not usually talkative, and don't really get much positive feedback for stuff like that so I didn't really know what to do.",
            "title_similarity": "0.7079985",
            "sentiment_compound": 0.9838
        },
        {
            "id": "i4dr8bu",
            "score": 1,
            "text": "They don’t think any of our lives should be easy so I’m good on giving them any solace.",
            "title_similarity": "0.49924427",
            "sentiment_compound": 0.8166
        },
        {
            "id": "i4drfv3",
            "score": 1,
            "text": "Yeah but I'm the old guy.",
            "title_similarity": "0.25541776",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i4drnmn",
            "score": 1,
            "text": "I always spy on the elderly. Gain their trust. Ask a few innocent questions like “what’s your mothers maiden name?” And “can you remember the last four digits of your social security number?” Makes them feel good and pays off dividends.",
            "title_similarity": "0.67520523",
            "sentiment_compound": 0.9456
        },
        {
            "id": "i4drpvd",
            "score": 1,
            "text": "Until old people respect me, I will absolutely not be taking this advice.",
            "title_similarity": "0.39363104",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i4drumv",
            "score": 1,
            "text": "I swear every time I am at the grocery store that an older person always stops me to reach something from the top of the shelf for them even though I think they could clearly reach it. I always help and have a small conversation with them. I secretly love it.",
            "title_similarity": "0.73002887",
            "sentiment_compound": 0.8689
        },
        {
            "id": "i4ds5zd",
            "score": 1,
            "text": "We all lonely out here bruv",
            "title_similarity": "0.36029446",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4dsimq",
            "score": 1,
            "text": "“Outlive your friends.” No, im dying first. Im not watching those assholes go before me, I can’t do it.",
            "title_similarity": "0.5175981",
            "sentiment_compound": 0.4717
        },
        {
            "id": "i4dsjud",
            "score": 1,
            "text": "seeing this right after a post that argued its ok to treat all men like loaded guns is funny, but refreshing",
            "title_similarity": "0.6287855",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4dsxby",
            "score": 1,
            "text": ">Many have outlived their friends and are lonely as hell\n\nTIL I’m an old person",
            "title_similarity": "0.616838",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i4dt3t0",
            "score": 1,
            "text": "I remember when my grandma said that her and my grandfather had to get younger friends because everyone their age had died. Didn’t think about having everyone around you die if you live to a very old age. They both were like 99 when they passed.",
            "title_similarity": "0.61948264",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4dtcke",
            "score": 1,
            "text": "This is absolutely true. They were young once, too. Many of them were light years cooler than you ever were. Respect their right to personhood.",
            "title_similarity": "0.3033588",
            "sentiment_compound": 0.7346
        },
        {
            "id": "i4du9ek",
            "score": 1,
            "text": "I heard social isolation is equivalent to smoking 2 packs per day to elderly people.",
            "title_similarity": "0.51560426",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4dueo9",
            "score": 1,
            "text": "I worked at a Chili's when I was in my early 20's. I was also going through the existential dread of not having insurance and needing to deal with oh so degrading body. I had an older couple as one of my tables. I thought to myself, \"wow, they've seen it all, they've felt this pain and are here to tell about it\". I kneeled down and got chummy like I've never got chummy before. They were obviously irritated by the end of their meal. \n\nMoral of the story: you might be helping someone emotionally, or you might just be needing it yourself, but know the line",
            "title_similarity": "0.74511683",
            "sentiment_compound": -0.5604
        },
        {
            "id": "i4dug1c",
            "score": 1,
            "text": "Old people are not the real life version of where's Waldo..",
            "title_similarity": "0.36208463",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dum3b",
            "score": 1,
            "text": "When I’m old do not talk to me. Don’t talk to me now but also don’t talk to me when I’m old",
            "title_similarity": "0.49208575",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dur07",
            "score": 1,
            "text": "Good intent. But I also feel like assuming old people are lonely is condescending a bit.",
            "title_similarity": "0.5068185",
            "sentiment_compound": 0.2382
        },
        {
            "id": "i4dv5sx",
            "score": 1,
            "text": "Thank you for this thought and comment. My Mom and Dad were desperate for connections as they got older.",
            "title_similarity": "0.5353069",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i4dv65e",
            "score": 1,
            "text": "Yes, 100% \nI work as a healthcare provider at a Hospital so it’s mainly an older population. For most patients their appointment is the highlight of their day. They get dressed up for their appointment like it’s a special occasion, and many times I’ll be the only person they’ll talk to for the day. They usually talk to me and tell me stories & jokes for more than my appointment slots allow, but I’m happy to indulge because they deserve it. Kindness goes a long way.",
            "title_similarity": "0.58876956",
            "sentiment_compound": 0.9446
        },
        {
            "id": "i4dw8rg",
            "score": 1,
            "text": "No shit, it called just being nice.",
            "title_similarity": "0.2269407",
            "sentiment_compound": 0.6931
        },
        {
            "id": "i4dw9ak",
            "score": 1,
            "text": "Hello in There - John Prine",
            "title_similarity": "0.064696774",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dwr0u",
            "score": 1,
            "text": "John Prine’s “Hello in There” covers this perfectly.",
            "title_similarity": "0.17339276",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i4dx7dk",
            "score": 1,
            "text": "I’m going to try this sometime, my grandfather died from COVID and lots of days I feel deeply saddened that we didn’t have more conversations in the last stretch of his life. I hope I can make it up to him by making somehow",
            "title_similarity": "0.587152",
            "sentiment_compound": -0.659
        },
        {
            "id": "i4dxa2f",
            "score": 1,
            "text": "I love talking to old people, at least they will hold a conversation & not look at you like a 3 headed,bugged eyed,4 armed, 20 finger alien",
            "title_similarity": "0.680907",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i4dxock",
            "score": 1,
            "text": "I wonder how many people are just gonna get battered for interacting with deranged old people.",
            "title_similarity": "0.5744903",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dy0b6",
            "score": 1,
            "text": "And this way you can check in on them and see if the Lu have their wits about them or are “confused”",
            "title_similarity": "0.2785683",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dyioh",
            "score": 1,
            "text": "The irony of this post is it goes against the suggestion of not singling out old people by singling out old people.",
            "title_similarity": "0.50721896",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i4dyu3j",
            "score": 1,
            "text": "In France old people voted either to keep Macron in power or the far right they can die lonely idc they stole my future and my sibilings chance at life",
            "title_similarity": "0.53518236",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i4dzbwg",
            "score": 1,
            "text": "I did that one time while waiting to board for a flight. While we were talking, he let out this really loud fart and just continued talking like nothing happened. It smelled by the way and it lingered for awhile.",
            "title_similarity": "0.58231413",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4dzjtt",
            "score": 1,
            "text": "Fuck... I'm 42 and you just described me.",
            "title_similarity": "0.17975748",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4dzz8r",
            "score": 1,
            "text": "My grandpa live til he was 86. He’d had a stroke right before I was born, couldn’t walk or talk. The older I got the more I loved that old man who always wore a baseball cap. Chewed tobacco, loved Milky Way, cheese balls & Long John silver’s fish. He had a pretty shitty life, his mother died when he was 13 months old, at 9 he left home. He lived from neighbor to neighbor, stole watermelon & things from the gardens to not starve. I always thought I’d give anything to sit down & have a long hard talk about growing up in the depression, how he survived without much help as a young boy. He was a bootlegger among other things. He lived a very colorful life.There was a lot of hurt in his crystal,pale,blue eyes. Eyes so beautiful that you would swear you were looking into some never before found gem, that was so beautiful you could hardly pull your gaze away. There was a lot of love in his eyes & I for one hope he saw that love in my eyes too. Hopefully someday I’ll get to sit down & have a very long talk with him. Enjoy your grands, aunts, uncles, neighbors who might be older.  Don’t be afraid to just make even small talk out in public with them. We’ll be old & feeble, our children & no one else wanting us either. Much can be learned from their wisdom. RIP Papa",
            "title_similarity": "0.69983697",
            "sentiment_compound": 0.983
        },
        {
            "id": "i4e1lyk",
            "score": 1,
            "text": "Did this in a grocery store once. Listened to a guy's entire life story, from his time in the air force in the 70's, to him smoking weed and having group sex with Philippino hookers in the 80's, being in and out of jail, up to his current situation, just got done with back surgery and then almost died of Covid.\nI had the time to listen, not sure I will ever do that again. Interesting, but that's a long time to stand in the beverage isle.",
            "title_similarity": "0.6527048",
            "sentiment_compound": -0.1985
        },
        {
            "id": "i4e1ywh",
            "score": 1,
            "text": "Half the comments here is \"leave me the Fuck alone\" Lmao.",
            "title_similarity": "0.394356",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4e241j",
            "score": 1,
            "text": "If you're a young person that would look a bit suspicious",
            "title_similarity": "0.16630462",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4e361x",
            "score": 1,
            "text": "My grandfather always went to the coffee shop to chat with people, it made him happy.",
            "title_similarity": "0.56136817",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i4e4w9a",
            "score": 1,
            "text": "It gets worse as you become a townie. The adults grew up faster than I did",
            "title_similarity": "0.43681014",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4e9j9g",
            "score": 1,
            "text": "I was helping an older man out when I used to sell phones, we need to get their info from their IDs to make the account. I noticed this man had just had a birthday a few days prior so I said to him “oh you recently just had a birthday, happy birthday!! :)” \n\nHis entire face lit up with happiness & said to me “thank you very much, I really appreciate that. No one had wished me a happy birthday this year.” \n\nMy heart broke.. I forgot how old he was but heh was in his late 70’s early 80’s 🥺🥺",
            "title_similarity": "0.65424407",
            "sentiment_compound": 0.8046
        },
        {
            "id": "i4eaea7",
            "score": 1,
            "text": "I did this with an elderly person who I noticed was often coming into the music building of my college campus to play jazz piano. Did an interview of him for my creative writing class where we had to choose a member of the community, and I found out he had traumatic brain injury from a ski accident. He lost his wife, most of his friends, his family... and then I personally experienced why. He kept sending me very inappropriate texts, like wanting to know what my shoe size is (presumably so he could give me shoes) or asking me out to dinner. I showed I was uncomfortable and vacillated every time and started avoiding him but I think he couldn't recognize healthy boundaries anymore. I found out he would go up to random people in the music building and ask about me. Many other young female students said they found him creepy and he would try to talk to them... so I asked the staff to please escort him out the building whenever he came in.\n\nI feel bad cause I know that he had a rough set of cards dealt to him and that was the only place he could access his hobby, jazz piano, but man that was uncomfortable.",
            "title_similarity": "0.6697737",
            "sentiment_compound": -0.8962
        },
        {
            "id": "i4ech0p",
            "score": 1,
            "text": "I heart this sub",
            "title_similarity": "0.01411612",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4ed0lo",
            "score": 1,
            "text": "I totally get this. I work as a consultant in a store and see manu people every day. And usually the elderly will come over to just talk about whatever.\nAnd I certainly don't mind it. Feels good that they think they can casually talk to me. Benefits both sides.\nI guess I have that look that people are just comfortable coming over and talking 😊",
            "title_similarity": "0.64618814",
            "sentiment_compound": 0.9509
        },
        {
            "id": "i4edt3s",
            "score": 1,
            "text": "Mmm ok. But why? Nobody does that with me when I’m alone in the same situations (42M). \nI mean, it’s a good advice but why limit it to elderly?",
            "title_similarity": "0.61422086",
            "sentiment_compound": 0.4039
        },
        {
            "id": "i4efnhc",
            "score": 1,
            "text": "I recall going to an elderly ladies funeral in my neighbourhood and there was hardly anyone there. Turns out all of her friends and family had died before her. She was 94. One of the old ladies attending said \"thats the last of my friends now, theyre all gone. Im now the last one\".  I always assumed the older you are the more people you have at your funeral. Guess not.",
            "title_similarity": "0.6226152",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4efnl4",
            "score": 1,
            "text": "Am a black woman then clutch their purses tight when I get close. In every supermarket isle. Passing on street\n In the mall. It's an instict they have",
            "title_similarity": "0.44068074",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4eimmk",
            "score": 1,
            "text": "No I don't think I will",
            "title_similarity": "0.022878667",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4ej8r7",
            "score": 1,
            "text": "When I've visited Singapore, I've experienced that random old guys at the hawker markets have the most interesting lifestories 😃",
            "title_similarity": "0.68177575",
            "sentiment_compound": 0.6962
        },
        {
            "id": "i4ejqjd",
            "score": 1,
            "text": "Well true, but I'm my own person and I already don't like to speak with most people.",
            "title_similarity": "0.44593865",
            "sentiment_compound": -0.0554
        },
        {
            "id": "i4f0yqx",
            "score": 1,
            "text": "I don't want people to feel so terribly lonely, and feel like they're abandoned and unloved by everyone.",
            "title_similarity": "0.48006707",
            "sentiment_compound": -0.9004
        },
        {
            "id": "i4fly7u",
            "score": 1,
            "text": "My mom and I used to deliver Christmas baskets in my town of ~7,000. One of the deliveries we made was to an elderly woman, probably around 85, living alone in one of those 55+ communities. She had framed photos of her husband, friends, siblings, and it really pained me to see such a social woman be left all alone. I’ll never forget how her face lit up when she opened her basket to a blue knit blanket, she said it was her husband’s favorite color",
            "title_similarity": "0.60936546",
            "sentiment_compound": 0.1712
        },
        {
            "id": "i4g1w4w",
            "score": 1,
            "text": "I'd say don't bother people. If I was in their shoes it would be weird as hell having some random person walking up and trying to awkwardly start a conversation.",
            "title_similarity": "0.52466214",
            "sentiment_compound": -0.7625
        },
        {
            "id": "i4g652v",
            "score": 1,
            "text": "How about mind your business",
            "title_similarity": "0.2816516",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gcn49",
            "score": 1,
            "text": "I do this every now and again, however recently all they want to talk about is political or how schools are failing kids and covid this and covid that. I'm not saying don't talk to these people it has just left a bad taste in my mouth",
            "title_similarity": "0.618042",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i4h1iex",
            "score": 1,
            "text": "I try and sneak into their will.",
            "title_similarity": "0.17671925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4mprr2",
            "score": 1,
            "text": "I emotionally can't handle the idea of old people being lonely...so much so that I hang out with my Nana as much as possible.",
            "title_similarity": "0.633893",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4o9wnk",
            "score": 1,
            "text": "Been there done that and promptly got told to piss off. 🤷🏻‍♀️",
            "title_similarity": "0.30483586",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4uebdy",
            "score": 1,
            "text": "This is more advice than a tip.",
            "title_similarity": "0.14183886",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4w8qnh",
            "score": 1,
            "text": "There's longevity on both sides of my family, and I'm just sitting here feeling sad for my eventual senescence because both my partners have a lot of young death on both sides of their family, and both of my partners are older than me.\n\nI guess I have lots of time to make friends and improve my future, but I'm just having a moment of sadness here.",
            "title_similarity": "0.6902217",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i4xyoc7",
            "score": 1,
            "text": "Just as a counterpoint, I often go to McDonalds or a café or wherever on my own precisely because I want some alone time, I do not want random people chatting. My time is my time. I know it doesn't apply to everyone, but it's worth bearing in mind.",
            "title_similarity": "0.7007834",
            "sentiment_compound": 0.2237
        },
        {
            "id": "i60jw0q",
            "score": 1,
            "text": "I work as a lobby person at McDonald's, and there are various elderly folk like this. I chat with them when I have lulls in my work",
            "title_similarity": "0.71795535",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i6brztj",
            "score": 1,
            "text": "Working in IT and set up an 80yo man's computer in his house today. While copying his data, he had me open a few random pictures to see what was in them and one photo I pulled up completely broke his heart.\n\nIt was him and his grandson when he was 5 or 6 years old. He proceeded to tell me that he died from a fentanyl overdose as a teenager just a few months ago and he nearly cried telling me.\n\nI couldn't imagine being someone who feels so lonely, only to hear something so tragic as that happen.\n\nSo yeah, when you run into an elderly person, or *anyone* for that matter (I'm 22 and feel lonely sometimes!), make some noise, drop the filter and just start talking. Can't think of anything good to say, you have a dry throat, you're 'hangry', so what. Just say hi, or what's up at least, and see if you can get a conversation started. Let's all stop being so narcissistic and talk to each other, we're the only species that really can.",
            "title_similarity": "0.61628413",
            "sentiment_compound": -0.9035
        },
        {
            "id": "i7acmms",
            "score": 1,
            "text": "This is essential, another fantastic way to show them they are not just waiting to die and give everything they own to their grown adult offsprings that can’t stop asking about these old farts Will,is to  make sure u tell challenge them in a race, maybe ask them to change the input on the tv , or help u connect ur phone to their Bluetooth car radio any of those things will make them feel so young again",
            "title_similarity": "0.5957668",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i7bdhsn",
            "score": 1,
            "text": "That give a false sense of hope. Joe Biden should never have hope.",
            "title_similarity": "0.36045855",
            "sentiment_compound": 0.1265
        }
    ]
}