{
    "LPT: If you are signing a new rental agreement or lease, copy plain text from the old one and the new one into different Word documents. Then use the Review->Compare feature to see every detail of what your landlord changed.\nI just did this with a new lease they emailed out, and found all the little charges they increased or doubled, such as the \"after hours non-emergency calls fee\" and the \"no admittance maintenance fee.\" They also added a term stating if I fail to notify them of emergency situations that cause damage, they will charge me to repair the damages.": [
        {
            "id": "i7cznx3",
            "score": 1,
            "text": "Hello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by up or downvoting this comment. \n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "title_similarity": "0.5837537",
            "sentiment_compound": 0.9615
        },
        {
            "id": "i7dpmva",
            "score": 6,
            "text": "You could just read it lol",
            "title_similarity": "0.23422262",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i7drifs",
            "score": 1,
            "text": "If someone sends you a lease in Word that's a no-brainer!  Good call!\n\nHowever, if someone sends a lease in Word instead of a PDF they should be set on fire and dumped in a quarry wrapped in chains.  That's the dumbest thing ever.\n\nI've seen companies do that and you can bust them on all kinds of things. Do a select all and copy/paste to a word doc.  That way, if there's white text, you can see it.\n\nIt may seem paranoid, but found companies writing a $200k lease on equipment that will throw weird stuff in and then try to claim that \"You signed off on it so it's true\" when you e-sign.  That's why when I e-sign, I also mail a wet signed copy and confirm receipt.\n\nSeriously, $500m companies are just as bad as $500k companies.",
            "title_similarity": "0.668954",
            "sentiment_compound": -0.7825
        },
        {
            "id": "i7dpzdv",
            "score": -7,
            "text": "This is why anyone with a brain would create a simple read only Pdf and provide only that.",
            "title_similarity": "0.39144954",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i7dgnxi",
            "score": 39,
            "text": "Also request verbiage like “this is a lease extension of the original lease dated x/x/xxx all terms to remain the same except ……”\n\nSource, am landlord. \n\nThat being said, my leases do say that if you are aware of a constant, deteriorating maintenance issue, you need to tell me. \n\nI don’t come into your apartment uninvited, you gotta tell me the plumbing/roofs leaking.   \nEdit:\n\nRead further and am thrilled I don’t rent to some of you :)\n\nDo get a signed copy of your lease from the landlord. Do make sure both sides initial ALL pages of the lease and the pages are marked one of five , two of five etc - no sneaking in an extra page later.   \n\n\nDon’t accept a digital lease. Make sure it’s hard copy, signed and initialed by both sides, two copies identical.\n\n I’d consider not renting from someone who doesn’t sit down and read the lease with you before signing.   \n\n\nI have refused to rent to someone who refused to review the lease with me before signing. They gave every indication that they did not care what was in the lease.",
            "title_similarity": "0.8338898",
            "sentiment_compound": 0.8059
        },
        {
            "id": "i7dyyzv",
            "score": 0,
            "text": "good stuff, thanks",
            "title_similarity": "0.019073837",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i7dzt5r",
            "score": 0,
            "text": "You telling meI could change stuff when renewing contracts?! Thanks for the lpt!  🙂",
            "title_similarity": "0.652818",
            "sentiment_compound": 0.7344
        },
        {
            "id": "i7e1fqi",
            "score": 0,
            "text": "Now that’s a top tip",
            "title_similarity": "0.08302091",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i7e1mi4",
            "score": 0,
            "text": "Did you sign the new rental agreement then?",
            "title_similarity": "0.51343",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i7e32t8",
            "score": 0,
            "text": "Programmy boi here and u bet imma use my \"merge-diff\" tool to do this",
            "title_similarity": "0.505136",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e4e0f",
            "score": 0,
            "text": "Every state/city should have a law where any changes in a rental contract need to be stated in bold on the 1st page of any rental agreement.",
            "title_similarity": "0.6275815",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i7e4kbj",
            "score": 0,
            "text": "There’s websites for this.\nFree too.\nI use different ones to compare my JavaScript",
            "title_similarity": "0.44363186",
            "sentiment_compound": 0.596
        },
        {
            "id": "i7e4re3",
            "score": 0,
            "text": "Print the old and new text and lay it side by side, then cross your eyes until the double image merges into one, and the differences will stick out like a sore thumb.",
            "title_similarity": "0.58671016",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e52ny",
            "score": 0,
            "text": "actual lifeprotip",
            "title_similarity": "0.18720579",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e5bsx",
            "score": 0,
            "text": "[Diffchecker](https://www.diffchecker.com/) is also pretty good if for what ever reason you dong have access to MS Word.",
            "title_similarity": "0.4502833",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i7e5hao",
            "score": 0,
            "text": "You are very clever",
            "title_similarity": "-0.023138147",
            "sentiment_compound": 0.5095
        },
        {
            "id": "i7e5t39",
            "score": 0,
            "text": "Lmao I do this for all my work docs. Find a sample from my superior. Compare to what I'm writing if a lot of it is form and see all the small changes they like to the form. Look like a superstar. Definitely more relevant in certain fields.",
            "title_similarity": "0.7007442",
            "sentiment_compound": 0.9474
        },
        {
            "id": "i7e6jlb",
            "score": 0,
            "text": "then, of course, make your own version (where all bulshit statements are turned to your favor, and also add your own), and sign and return that. bet you they won't notice\n\nbut they get a dick when you break the lease, and similar\n\nphoto and photocopy the signed version!",
            "title_similarity": "0.7666261",
            "sentiment_compound": -0.5983
        },
        {
            "id": "i7e6n1o",
            "score": 0,
            "text": "Haven't been fucked yet but am glad I saved a copy of the last lease.",
            "title_similarity": "0.45756057",
            "sentiment_compound": 0.8738
        },
        {
            "id": "i7e6u3t",
            "score": 0,
            "text": "Attorney here. Absolutely do this. This is like 50% of our job lol",
            "title_similarity": "0.3672791",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i7e6vl5",
            "score": 0,
            "text": "That is absolute genius...",
            "title_similarity": "0.0010211654",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e7l97",
            "score": 0,
            "text": "Is it common in other countries to sign a new rental agreement without moving?",
            "title_similarity": "0.55379426",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i7e7y3r",
            "score": 0,
            "text": "But then what do you do ? Do you negociate the terms? Are there any legal actions you can take if the changes are too much?",
            "title_similarity": "0.48105872",
            "sentiment_compound": 0.316
        },
        {
            "id": "i7e7yjl",
            "score": 0,
            "text": "I’ve been reading LPT for months and this is by far the best one I’ve read. Great advice.",
            "title_similarity": "0.47558364",
            "sentiment_compound": 0.8519
        },
        {
            "id": "i7e86o8",
            "score": 0,
            "text": "Brilliant suggestion! Notepad++ offers the same functionality for free.",
            "title_similarity": "0.30715284",
            "sentiment_compound": 0.8122
        },
        {
            "id": "i7fh16a",
            "score": 0,
            "text": "Just an FYI, all of those are very standard. \n\n* Calling your landlord at 1am because a light is flickering is a dick move. \n\n* Your landlord is required to keep the space habitable. If you’re refusing their entry to maintain the property, you’re being stupid, and also a dick. \n\n* If the basement floods, that’s not your fault. If the basement floods, you see it’s flooded, and just say nothing. You’re a dick. And you’re responsible for the *excess damage, that could have been prevented*, but not for the initial issue that caused the flood. \n\nThis is just standard language that’s essentially just asking tenants to not be a dick.",
            "title_similarity": "0.7053068",
            "sentiment_compound": 0.0128
        },
        {
            "id": "i7frban",
            "score": 0,
            "text": "As a landlord, I totally support this.",
            "title_similarity": "0.3518706",
            "sentiment_compound": 0.4576
        },
        {
            "id": "i7dfv0t",
            "score": 24,
            "text": "My landlord straight up increased the rent without bothering to mention it.  Fucking scumbags.",
            "title_similarity": "0.67701447",
            "sentiment_compound": 0.6351
        },
        {
            "id": "i7djjx5",
            "score": 1,
            "text": "agree that this is a smart idea.   It would have been fun in advance to ask \"what changed\" and then when they inevitably say \"not much\" or \"nothing really\"  you could call them out a little.",
            "title_similarity": "0.42513907",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i7dmpzd",
            "score": 1,
            "text": "Thank you OP. Very useful.",
            "title_similarity": "0.06722494",
            "sentiment_compound": 0.6901
        },
        {
            "id": "i7drz87",
            "score": -1,
            "text": "Wow your landlords are shit, ours only increased rent $70 this year because inflation was so high/ property tax increases. Last year was $25 increase so we consider them to be extremely fair people.\n\nNo new sketchy terms and our contract doesn’t have any of those fees. Granted it’s individually managed by them, (at least now it is as it was through a property management company) but none of those fees with the management company either.\n\nIt’s astounding the degree of landlords that do exist",
            "title_similarity": "0.58988464",
            "sentiment_compound": 0.7625
        },
        {
            "id": "i7e10hr",
            "score": 1,
            "text": "Or just… you know… read it.",
            "title_similarity": "0.23823327",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e2v6k",
            "score": -1,
            "text": "You can use a version tracking tool like git as well to make it even easier to compare",
            "title_similarity": "0.36886823",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i7e3i3l",
            "score": 1,
            "text": "Where you live will make all the difference but in most places a landlord can just serve you with a notice of change in terms of tenancy. New owners will often add their own addenda and lease terms can sometimes be revised between annual renewals due to a variety of reasons. \n\nYou should definitely read your lease but not sure this qualifies as a true life pro tip. It’s far better to get to know your local landlord / tenant law and consider it when reviewing any lease.",
            "title_similarity": "0.8370733",
            "sentiment_compound": 0.8644
        },
        {
            "id": "i7e6qm1",
            "score": -1,
            "text": "Is this an American thing. Every lease I've had has been an unwritten hand shake deal.",
            "title_similarity": "0.5597999",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i7dfk2p",
            "score": 39,
            "text": "Seems reasonable to charge you for damages if you fail to notify them.",
            "title_similarity": "0.48827788",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i7dos68",
            "score": 29,
            "text": "As a plumber, I can understand the last part. The amount of damage I have seen caused by people neglecting simple repairs that they don't even pay for amazes me how shitty renters can be.",
            "title_similarity": "0.590626",
            "sentiment_compound": -0.7188
        },
        {
            "id": "i7drk4b",
            "score": 30,
            "text": "> They also added a term stating if I fail to notify them of emergency situations that cause damage, they will charge me to repair the damages\n\nI gotta say, as a person renting out their home while temporarily overseas, whose renter used the non-emergency repair portal on a weekend (i.e. no one saw it for a day) to report a f'ing flooding water line that eventually cost me about 4 or 5 grand (it was more, but homeowners covered xyz of it), I'm not...entirely sure that's an unfair change?\n\nWe're very chill about everything, and we make every update and repair that's asked of us by a tenant immediately, but man, that one really upset me.  Like, if it was your house, would you just shoot off an email on Friday night and be like, \"whelp, my job's done!\"  If they'd called the emergency line, we'd have saved most of the damage and most of the cost.  I don't expect the average person to be a contractor or anything, but gush water that stands on the floor?  come on, now. \n\nthere's a line of reasonable between \"this is probably an emergency\" and \"this can wait until Monday or Tuesday\"\n\nBut also, I wouldn't try to sneak it into a new contract, either.  That's just weasel-y.",
            "title_similarity": "0.7117442",
            "sentiment_compound": -0.9468
        },
        {
            "id": "i7dwy8j",
            "score": 19,
            "text": "My landlord started allowing dogs in order to collect “pet rent” even though I moved to a dog-free building on purpose and made sure before moving in that they actually enforced it because I have a TBI which caused my cochlear hair cells to die and then reappear at about twice the normal number giving me superhuman hearing which is officially the lamest superpower ever because it means most every day noises are painful, and the frequency of the average apartment-size dog barking is *absolutely agonizing*. Not only did he change the nature of the building, it seems he specifically sought out high-noise and high-risk breeds which are usually on ban lists, like beagles and pit bulls, no doubt as an excuse to charge higher “pet rent”. I wear ear plugs 24/7 but it’s like trying to block out a monsoon with a spiderweb. \n\nA wave of extremely entitled west coast transplants with pandemic impulse adoptions moved in, and nobody knows or cares how to take care of a pet. They leave them here alone all day while they bark and howl in that horrific screechy rat dog tone. Then the tenants come home and scream at them for pissing on the carpet or whatever. They all let them run around off leash, a few days ago someone’s off leash beagle, with his owner still on a different floor of the walk-up, decided to get between me and my apartment door and shriek-bark at me. The owner literally couldn’t catch him. I thought a little too long about what it would feel like to be waiting in front of that tenants door with a golf club next time *he* wanted to get into his own apartment. \n\nI finally snapped and got on the landlord, I pointed out the all-day chaos is a violation of the “quiet enjoyment” part of my lease and I’m entitled to stop paying rent until he does something about it. This week he sent out the lease renewals, then followed up with an email saying “wait ignore that one had spelling errors” and sent a new one. There were no errors, he had simply taken the “quiet enjoyment” clause out of the lease. \n\nThese people are clowns.",
            "title_similarity": "0.69848347",
            "sentiment_compound": -0.9592
        },
        {
            "id": "i7doi9x",
            "score": 3,
            "text": "What can you do once you detected those amendments, and disagree to it? Negotiate for the clauses' removal? What if the landlord disagrees? Should you accept it? Move out?",
            "title_similarity": "0.59236974",
            "sentiment_compound": -0.504
        },
        {
            "id": "i7dsjxe",
            "score": 4,
            "text": "If you know terminal or are a programmer, just use `diff`",
            "title_similarity": "0.40242678",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dxfd3",
            "score": 2,
            "text": "Have them send a pull request on GitHub that way you can see the diff and run automated checks.",
            "title_similarity": "0.5895123",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e2wf4",
            "score": 5,
            "text": "I've only ever had paper leases.",
            "title_similarity": "0.27461025",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7d9kib",
            "score": 112,
            "text": "Great advice on always looking for and reviewing changes, but as someone that has worked in construction for years I fully understand why they would add those lines in your example.\n\nYou would be amazed at some of the \"emergency\" calls people make. Call in for service at 2AM because the apartment is flooding? Arrive to find a bathroom sink that takes 2 minutes to drain instead of 30 seconds...\n\nAnd for the no admittance fee, how about having raw sewage flooding a unit for 3 months because the resident won't let anybody in... I can not even imagine what the cleaning bill from that mess was.\n\nKinda funny how you have some people at both extreme ends of the reporting problems spectrum. Sadly those extreme cases cause the new rules in the rental agreement that can then be exploited by less upstanding landlords to hit normal tenants with undue charges.",
            "title_similarity": "0.69651955",
            "sentiment_compound": -0.8312
        },
        {
            "id": "i7ed7g5",
            "score": 7,
            "text": "How do i copy and pasta from an actual printed document?",
            "title_similarity": "0.50965214",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7d4dx0",
            "score": 69,
            "text": "Make copies with highlighted differences and pass to neighbors.",
            "title_similarity": "0.504132",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7d8zlg",
            "score": 11,
            "text": "VS Code if you don't have Word. Free and much better compare tool.",
            "title_similarity": "0.3435674",
            "sentiment_compound": 0.0511
        },
        {
            "id": "i7d7t7q",
            "score": 16,
            "text": "Or Google text compare if you don’t have Word",
            "title_similarity": "0.3482061",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7d3a3q",
            "score": 658,
            "text": "Counterpoint- slightly tweak the terms aggressively to your liking, sign it and remind them they forgot to sign on their line.\n\n\n\n(Please for the love of god don’t actually do this! It’s just a joke!)",
            "title_similarity": "0.5431112",
            "sentiment_compound": 0.8953
        },
        {
            "id": "i7dpvth",
            "score": 26,
            "text": "Rare thing to see a true LPT.",
            "title_similarity": "0.08743451",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i7d7qyl",
            "score": 213,
            "text": "I've never seen a lease presented as a Word document. Can you do that in pdfs?\n\nEdit: I've never signed a lease without being onsite, so this is an interesting thing to know about.",
            "title_similarity": "0.56906855",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i7dj6ds",
            "score": 2078,
            "text": "One thing I like in Ontario Canada. The lease agreement is provided by the government. The landlord can add certain things in certain places, but only those places. Any extra pages or other changes made are unenforceable. We have pretty good tenant protection here.",
            "title_similarity": "0.6343498",
            "sentiment_compound": 0.9201
        },
        {
            "id": "i7diwk2",
            "score": 205,
            "text": "Lpt get the rental insurance. Its cheap and covers your ass.",
            "title_similarity": "0.34315065",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i7dluw5",
            "score": 1403,
            "text": "I just commit my lease to git and the landlord sends me a pull request.",
            "title_similarity": "0.7479744",
            "sentiment_compound": 0.296
        },
        {
            "id": "i7dcjpo",
            "score": 307,
            "text": "Notepad++ can do this too",
            "title_similarity": "0.2136224",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7czwtq",
            "score": 5425,
            "text": "This is a really good idea!",
            "title_similarity": "0.014818409",
            "sentiment_compound": 0.54
        },
        {
            "id": "i7dfhvq",
            "score": 1,
            "text": "Save original text on file A ... save the second one in file B and use a software like winmerge to open both files.\n\nWill flag you the text that's been changed.",
            "title_similarity": "0.6644754",
            "sentiment_compound": 0.8807
        },
        {
            "id": "i7dmbuh",
            "score": 2,
            "text": "There’s text-compare.com too",
            "title_similarity": "0.346251",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dpks5",
            "score": 1,
            "text": "There's also some text to word doc apps out there that can take a picture and import into text or scanners wirh that tech in case you get physical copy",
            "title_similarity": "0.47398788",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dq9cn",
            "score": 2,
            "text": "You could also use Winmerge",
            "title_similarity": "0.22850552",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7drwmj",
            "score": 1,
            "text": "I get mine in the mail and have to compare every word from the last lease like a Scrooge.",
            "title_similarity": "0.7137631",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i7dsm27",
            "score": 1,
            "text": "My landlord lady is helping us negotiate a lower price from the increases they are making to rent. She’s extremely helpful.",
            "title_similarity": "0.58215797",
            "sentiment_compound": 0.4754
        },
        {
            "id": "i7dt60o",
            "score": 1,
            "text": "Side question : I’m not from the US but I live here.\n\nI’m month to month at this point. My landlord is forcing me to go back to yearly.\nExcept I know I will be gone in 3 to 8 months.\n\nHe added that as long as a tenant take over, he won’t pursue to rest of the « yearly rent »\n\nFine. \nBut is it normal that he keeps the deposit no matter the state of the house if I leave before the 12 months ?",
            "title_similarity": "0.6623621",
            "sentiment_compound": 0.1996
        },
        {
            "id": "i7dt6cg",
            "score": 2,
            "text": "You should really do this with anything remotely important",
            "title_similarity": "0.23363493",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i7dujdl",
            "score": 2,
            "text": "That’s a great idea for ANY contract. Ty",
            "title_similarity": "0.2567491",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i7dv9ut",
            "score": 1,
            "text": "Those assholes should be sharing a redline version anyway",
            "title_similarity": "0.4814261",
            "sentiment_compound": -0.25
        },
        {
            "id": "i7dvqkd",
            "score": 1,
            "text": "Or just use beyond compare….",
            "title_similarity": "0.18099947",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dwwbu",
            "score": 1,
            "text": "Try https://draftable.com/compare ! Free and can compare PDF and word directly.  Do not work for the company - just an ex attorney who had to compare too many documents on Word…",
            "title_similarity": "0.6676481",
            "sentiment_compound": 0.5562
        },
        {
            "id": "i7dx79c",
            "score": 2,
            "text": "Lawyers don't want you to know this one weird tip!",
            "title_similarity": "0.36440527",
            "sentiment_compound": -0.2991
        },
        {
            "id": "i7dxfdz",
            "score": 1,
            "text": "So did you move out or amend the lease?",
            "title_similarity": "0.45918578",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dzc5t",
            "score": 1,
            "text": "Is there a way you can fight changes like this?",
            "title_similarity": "0.37201262",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i7dzemy",
            "score": 2,
            "text": "Or you could just read it.",
            "title_similarity": "0.20164044",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dzked",
            "score": 1,
            "text": "I did this for student housing years ago and they added a stipulation that you could not make moonshine or wine in your room.",
            "title_similarity": "0.55384994",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dzq28",
            "score": 1,
            "text": "You can also use www.diffchecker.com\n\nIt also works on images",
            "title_similarity": "0.29154262",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7dzvod",
            "score": 1,
            "text": "Yes this! And especially also with car dealerships. Make them give you a working copy of the agreement and compare it. Fucking right in front if them!\n\nAlas I have never done this so they might flat out refuse to cooperate.",
            "title_similarity": "0.63836706",
            "sentiment_compound": 0.4912
        },
        {
            "id": "i7e03uo",
            "score": 1,
            "text": "If you wanna get fancy, use kdiff3 or something similar to compare the text files",
            "title_similarity": "0.4204973",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e0l0w",
            "score": 1,
            "text": "This is like patch notes for your lease",
            "title_similarity": "0.49285355",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i7e0mzv",
            "score": 1,
            "text": "Would be easier if they send you a red line version. Transparency would make this so much easier.",
            "title_similarity": "0.32079053",
            "sentiment_compound": 0.7076
        },
        {
            "id": "i7e10yw",
            "score": 1,
            "text": "I've seen places that treat the entire lease as a stripped image file so you can't copy/paste the text or use the search function in any software with it. Great advice otherwise though!",
            "title_similarity": "0.61840093",
            "sentiment_compound": 0.7959
        },
        {
            "id": "i7e1mea",
            "score": 2,
            "text": "Even better is using a diff tool like WinMerge which is explicitly designed for this purpose.",
            "title_similarity": "0.3478483",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i7e1yuw",
            "score": 2,
            "text": "The program meld (https://meldmerge.org/) is free and perfect for this task.",
            "title_similarity": "0.2296609",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i7e2m6q",
            "score": 2,
            "text": "Alternatively:\n\nhttps://text-compare.com/",
            "title_similarity": "0.24609187",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e3l2s",
            "score": 1,
            "text": "You need to audit every revision of every contract about anything. It's unbelievably common for people to try to slip things in.",
            "title_similarity": "0.6500844",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e49me",
            "score": 1,
            "text": "r/shittylifetips if your landlord sends you a word version, change it before signing it",
            "title_similarity": "0.70660454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e87pf",
            "score": 1,
            "text": "What do you do if someone forged your signature on Estoppel certificate?",
            "title_similarity": "0.49791372",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7e92ey",
            "score": 1,
            "text": "https://diffchecker.com, or a number of like-minded websites can do that without using a program.",
            "title_similarity": "0.38070655",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i7e99i2",
            "score": 1,
            "text": "I live in a place where leases are standardized, but if you don't happen to (which I'm led to believe is most of the US) you shouldn't sign anything without having your attorney look over it first. This applies for all legally binding documents, not just leases. It would take 2 seconds of emailing your lawyer to review a document, yet everyone and their mother goes and signs away their life in some shady backroom deal without a second thought.",
            "title_similarity": "0.750229",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i7e9cgs",
            "score": 1,
            "text": "Also know that is is common for lease agreements to have parts in them that do not follow local laws",
            "title_similarity": "0.4614448",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i7eabiq",
            "score": 1,
            "text": "Where I live we use pretty standard leases.  Items can be crossed out but absolutely no changes.  If necessary a rider can be attached so any changes are very easy to see.  It's not a law to use those leases but I'm always suspicious of those that don't.\n\nAnd the part mentioned about notifying a landlord is absolutely standard in all leases.  Delaying notifying a landlord for any reason could potentially make things much worse.",
            "title_similarity": "0.6683575",
            "sentiment_compound": -0.6428
        },
        {
            "id": "i7eabx3",
            "score": 1,
            "text": "And if you don't have word, I always use [DiffChecker](https://www.diffchecker.com/)",
            "title_similarity": "0.54095685",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eazfb",
            "score": 1,
            "text": "CA has a dedicated lease renewal form, where they just list what they want changed.",
            "title_similarity": "0.703879",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i7eb8if",
            "score": 1,
            "text": "I thought this was a joke for a moment.",
            "title_similarity": "0.15158762",
            "sentiment_compound": 0.296
        },
        {
            "id": "i7ebbbk",
            "score": 1,
            "text": "This is great advice. We found out they added 2 dogs to our lease this way - as in we could bring home PUPPIES!",
            "title_similarity": "0.4554187",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i7ebjtf",
            "score": 2,
            "text": "This is why we need “GitHub for Lawyers”. Send me my contract change as a pull request please.",
            "title_similarity": "0.75257456",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i7ebpm1",
            "score": 1,
            "text": "This is an A1 life pro tip",
            "title_similarity": "0.22845982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ebshr",
            "score": 1,
            "text": "I wonder if the supreme court knows this",
            "title_similarity": "0.19525462",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i7ebthh",
            "score": 1,
            "text": "First ask your landlord for a copy with remarks on all the changes. A good person or company will do that. If not, then you can do the research by yourself.",
            "title_similarity": "0.755718",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i7ec5wy",
            "score": 1,
            "text": "I mean, who cares what was there before if what you have ti agree with is what’s on there now 🤷🏽‍♂️",
            "title_similarity": "0.3781392",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i7eccvs",
            "score": 1,
            "text": "This would be good for any new contracts. I’ve saved this post for later. Thanks OP!",
            "title_similarity": "0.5092186",
            "sentiment_compound": 0.8356
        },
        {
            "id": "i7ecgrm",
            "score": 1,
            "text": "LPT: this works for all kinds of documents you have to sign after somebody sent it to you - work related too.",
            "title_similarity": "0.6360087",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ecvdc",
            "score": 1,
            "text": "Or just use this site: https://text-compare.com/",
            "title_similarity": "0.3357849",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ed6dq",
            "score": 1,
            "text": "Yup classic review technique . I wish they provided a redline version",
            "title_similarity": "0.46027634",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i7ed7wc",
            "score": 1,
            "text": "Haha, this assumes the land lord gives you a copy which is accessible for screen readers and visually impaired people rather than a scanned document.\n\nWhat a great joke.",
            "title_similarity": "0.4749872",
            "sentiment_compound": 0.8519
        },
        {
            "id": "i7edydi",
            "score": 1,
            "text": "We use kdiff, a free tool. It also can compare files from folders.",
            "title_similarity": "0.38452667",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i7edzi2",
            "score": 1,
            "text": "I've only ever gotten paper copies of an apartment lease.",
            "title_similarity": "0.44735384",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eec2e",
            "score": 1,
            "text": "If you don't have word:\n\n- Open \"docs.new\" in the browser\n- Paste the text of the old lease \n- Paste the new lease \n- See the change history",
            "title_similarity": "0.6183009",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eeecr",
            "score": 1,
            "text": "Copy the lease. Change the terms. Hand it back to him to sign",
            "title_similarity": "0.637099",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i7eeqjv",
            "score": 1,
            "text": "Also as a linux user...its just vim diff...its been around...",
            "title_similarity": "0.3222841",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7efo6t",
            "score": 1,
            "text": "The f\\*ck is this ridiculous bullsh\\*it? \"after hours non-emergency fee\" you guys seriously need consumer protection laws and it's baffling how much stuff such people get away with...\n\nLike that stuff wouldn't even remotely fly in most countries",
            "title_similarity": "0.61699736",
            "sentiment_compound": -0.2675
        },
        {
            "id": "i7egyit",
            "score": 1,
            "text": "If you are only provided a hard copy, you can use Google Lens to copy text right away and copy it to a Word file",
            "title_similarity": "0.61062026",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i7eh4qa",
            "score": 2,
            "text": "This is what lawyers (or more likely their Assistants) do for *every* document they negotiate.",
            "title_similarity": "0.613273",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ehgeg",
            "score": 1,
            "text": "Or idk, just read everything you are going to sign no matter what it is?",
            "title_similarity": "0.49725094",
            "sentiment_compound": -0.1215
        },
        {
            "id": "i7ehhhk",
            "score": 1,
            "text": "There is a much simpler way! You can use www.draftable.com to compare two documents of any file type and see all changes that have taken place, I would highly recommend!",
            "title_similarity": "0.5254601",
            "sentiment_compound": 0.5231
        },
        {
            "id": "i7ehqen",
            "score": 1,
            "text": "finally a tip that isnt \"LPT be nice\"",
            "title_similarity": "0.26012483",
            "sentiment_compound": -0.3252
        },
        {
            "id": "i7eipjm",
            "score": 1,
            "text": "Are rental agreements usually that complicated? Mine have always just had contact info, some details about the apartment and the landlords bank details. Never even hd a second page.",
            "title_similarity": "0.66486657",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i7ej6ze",
            "score": 1,
            "text": "how does one negotiate after one found out one's landlord changed stuff?",
            "title_similarity": "0.6189156",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ekykh",
            "score": 1,
            "text": "I mean, you could just read them both?",
            "title_similarity": "0.25687158",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eloy3",
            "score": 1,
            "text": "There is no such thing as rental agreements in my country for home rental and small commercial rentals.",
            "title_similarity": "0.32526344",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i7emuf1",
            "score": 1,
            "text": "Notepad ++ has a really good compare setting \n\nAnd it's free",
            "title_similarity": "0.22750533",
            "sentiment_compound": 0.7574
        },
        {
            "id": "i7en3k0",
            "score": 1,
            "text": "my landlord had me resign my lease that said \"the same as the last one\" \n\nok not literally but essentially.",
            "title_similarity": "0.643943",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i7en6lz",
            "score": 1,
            "text": "To add to this, as personally I've never had a lease as a Word or PDF: You can scan the text and convert it to a Word file with Microsoft Lens. It's free.",
            "title_similarity": "0.48316538",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i7endkb",
            "score": 1,
            "text": "If you are signing something, it should be published as a PDF. You should refuse to sign a word document because how does anyone know you didn't change something? If you know what you are doing you can accept changes and the tracking disappears.  Also, what does it matter what changed in the contract? That was the last person this is the contact for you. If it's simply negotiations that's not really in good faith.",
            "title_similarity": "0.62537205",
            "sentiment_compound": -0.2043
        },
        {
            "id": "i7eniv9",
            "score": 1,
            "text": "It's easier to just do ctrl-f for dollar sign to see all the charges mentioned in the lease",
            "title_similarity": "0.61702037",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i7env25",
            "score": 1,
            "text": "In most of Canada leases go month to month on the same terms with no requirement to sign a new lease (it's actually uncommon and not recommended).\n\nJust mentioning it for those affected that don't know.",
            "title_similarity": "0.5840647",
            "sentiment_compound": -0.5255
        },
        {
            "id": "i7eo0to",
            "score": 1,
            "text": "I see everyone going on about houses, what's the opinion on high-rise/apartment landlords?",
            "title_similarity": "0.56042355",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eo4mr",
            "score": 1,
            "text": "Imo the emergency clause is reasonable. The repair cost becomes increasingly worse the longer you wait.",
            "title_similarity": "0.5163028",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i7eoeuy",
            "score": 1,
            "text": "This has probably been mentioned already but.. most leases I’ve signed have stated that they are subject to change by landlord and I always thought that was their right to do so… have I just been missing something huge for the entirety that I have rented out in my area?",
            "title_similarity": "0.7661439",
            "sentiment_compound": 0.0387
        },
        {
            "id": "i7ep3p7",
            "score": 1,
            "text": "Addendum added from poor previous experiences",
            "title_similarity": "0.3505748",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i7epvjm",
            "score": 1,
            "text": "Suggestion, request all changes in bold.",
            "title_similarity": "0.41071504",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i7eq1zm",
            "score": 1,
            "text": "This is something I routinely do when receiving new or \"signed\" versions of contracts.\n\nIn general, you are looking to get plain text out of the before and the after versions and then you want to *diff* them.\n\nThere are lots of ways to do each step.\n\nNerds like me might use a command line, something like `diff <(pdftotext before.pdf -) <(pdftotext after.pdf -)`. Others might copy/paste from the source documents then paste in to any of dozens of websites resulting from a web search for \"online diff\".",
            "title_similarity": "0.77549994",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i7eqblv",
            "score": 1,
            "text": "Or just use a website (no need for MS Word)\n\nhttps://text-compare.com/\n\nhttps://www.diffchecker.com/\n\nhttps://countwordsfree.com/comparetexts\n\nhttps://globalvision.co/tools/compare-text/\n\nhttps://www.textcompare.org/\n\netc...",
            "title_similarity": "0.43141884",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eqg46",
            "score": 1,
            "text": "Nice idea in theory, but I'd imagine most people are in the same position as myself. Which is to say that even if we spot the changes, all we can really do is shrug and accept them.",
            "title_similarity": "0.52826816",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i7eqyq8",
            "score": 1,
            "text": "You assume landlords don’t just use scanned paper copies of leases",
            "title_similarity": "0.48172882",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7erjdk",
            "score": 1,
            "text": "Going to use this for our EBA..",
            "title_similarity": "0.2456863",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ernnp",
            "score": 1,
            "text": "So what did you decide to do after seeing the changes?",
            "title_similarity": "0.3203115",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ersl7",
            "score": 1,
            "text": "The world would be so much simpler if everyone used git",
            "title_similarity": "0.2850686",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7es9nn",
            "score": 1,
            "text": "Do this, as long as they sign it as well.",
            "title_similarity": "0.3138299",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i7etijw",
            "score": 1,
            "text": "Or if you're in Europe just mark the bits that are actually reasonable charges because anything else can be debated in court and possibly thrown out for being \"unreasonable\"",
            "title_similarity": "0.54491633",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i7etohy",
            "score": 1,
            "text": "Also take timestamped photos of bloody everything when you do the condition report. Too many shifty bastard real estate agents out there",
            "title_similarity": "0.63780224",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i7eu3i2",
            "score": 1,
            "text": "You also have online text comparison tools, check diffchecker",
            "title_similarity": "0.41393876",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7eun1d",
            "score": 3,
            "text": "Lol, here in Aus I've never received a softcopy of any of my leases. It's always just the paper stapled together.",
            "title_similarity": "0.3984511",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i7ev8de",
            "score": 1,
            "text": "Better yet, renew via addendum to the expiring lease. It only takes one sentence to change the move out date.",
            "title_similarity": "0.5761156",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i7evmg9",
            "score": 1,
            "text": "Wish I saw this a week ago 😅",
            "title_similarity": "0.4096228",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i7evo9s",
            "score": 1,
            "text": "Now, change what you like, sign it, and see if they notice.",
            "title_similarity": "0.50101364",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i7ewu2j",
            "score": 1,
            "text": "Oooo that's good\n Noted",
            "title_similarity": "-0.0063602254",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i7exbfd",
            "score": 1,
            "text": "Git is also really good for this if you’re more of a programming person. Anything that lets you show diffs between files is super useful",
            "title_similarity": "0.42181635",
            "sentiment_compound": 0.8748
        },
        {
            "id": "i7eyi8t",
            "score": 1,
            "text": "Or use git if you're a Chad",
            "title_similarity": "0.33016777",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ezqnn",
            "score": 1,
            "text": "Or save both as word files...",
            "title_similarity": "0.3397342",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i7ezuxw",
            "score": 1,
            "text": "My landlord sends a 1 page renewal document that shows the lease increase. Previous ones may have sent a new addendum. I've never signed a full new lease when renewing a yearly one.",
            "title_similarity": "0.6545474",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i7f03uk",
            "score": 1,
            "text": "That third one: not reporting problems that can cause damages  (ex: water leaks that you ignore) I see as reasonable Statment.   If you know there is a water leak under the sink, tell the landlord.  Don’t just put a pot under the counter or ignore it.   Would you rather be proactive on your part or have the landlord going in and looking under every sink every month?",
            "title_similarity": "0.72594416",
            "sentiment_compound": -0.6419
        },
        {
            "id": "i7f0rlb",
            "score": 1,
            "text": "Works with open document files too.",
            "title_similarity": "0.24586762",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7f13sn",
            "score": 1,
            "text": "Why you didn't read the first one anyway!",
            "title_similarity": "0.26792488",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7f1s9c",
            "score": 1,
            "text": "Wow, a useful LPT!",
            "title_similarity": "0.07806969",
            "sentiment_compound": 0.7901
        },
        {
            "id": "i7f2dsg",
            "score": 1,
            "text": "I need this for my work contracts.",
            "title_similarity": "0.4996022",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7f3sr3",
            "score": 1,
            "text": "Yea totally good idea",
            "title_similarity": "0.04753393",
            "sentiment_compound": 0.4927
        },
        {
            "id": "i7f5cac",
            "score": 1,
            "text": "This new lease was the first one I ever received that was digital. All my previous ones were paper only. Your trick doesn’t work for me.",
            "title_similarity": "0.4569507",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i7f5ygl",
            "score": 1,
            "text": "This was very helpful",
            "title_similarity": "-0.00997745",
            "sentiment_compound": 0.4754
        },
        {
            "id": "i7f6bkt",
            "score": 1,
            "text": "If they don't point out any changes move. Don't work with anyone that pulls that shit if you don't have to.",
            "title_similarity": "0.39404854",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i7f7ekd",
            "score": 1,
            "text": "Now this is a life pro tip!",
            "title_similarity": "0.3097055",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7f87x9",
            "score": 1,
            "text": "Side note, there are also programs you can use to compare things side-by-side. My personal favorite is Kdiff3, you copy and paste both articles in the program and it’ll highlight any difference between them. Very useful in multiple situations, like debugging code or contract changes.",
            "title_similarity": "0.58761513",
            "sentiment_compound": 0.8777
        },
        {
            "id": "i7f8izv",
            "score": 1,
            "text": "That’s smart dude!!! Thanks!",
            "title_similarity": "0.03161359",
            "sentiment_compound": 0.7762
        },
        {
            "id": "i7f9w4p",
            "score": 1,
            "text": "Don't be lazy read it, it could cost more.",
            "title_similarity": "0.3384208",
            "sentiment_compound": 0.2755
        },
        {
            "id": "i7fbd92",
            "score": 1,
            "text": "This only works under the assumption I read it the first time.",
            "title_similarity": "0.449982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7fee9l",
            "score": 2,
            "text": "...that'd be so much typing.\n\nI cant say this is pro unless you get digital leases or contracts.\n\nI request everything in paper so this overcomplicates things. I would just read it lol",
            "title_similarity": "0.7075397",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i7feqdo",
            "score": 1,
            "text": "Even if you do this what recourse do you have? Tell them you don’t like it? Won’t they just say so what, go live somewhere else?",
            "title_similarity": "0.34328717",
            "sentiment_compound": 0.466
        },
        {
            "id": "i7feww1",
            "score": 1,
            "text": "Or just, you know, read your lease.",
            "title_similarity": "0.48447958",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ffaa2",
            "score": 1,
            "text": "There’s a software program called beyond compare that I use for so many things like this. Can compare most file types, even images. It’s nice because you can quickly see just changes or can see the entire document with highlighted changes.",
            "title_similarity": "0.5304399",
            "sentiment_compound": 0.6771
        },
        {
            "id": "i7fhd7v",
            "score": 1,
            "text": "My lease was given to me on yellow carbon paper. I'm pretty sure it was printed on a dot-matrix printer.\n\nI also can't pay my rent electronically, I have to drop off a paper check each month.",
            "title_similarity": "0.58602357",
            "sentiment_compound": 0.5713
        },
        {
            "id": "i7fhe0v",
            "score": 1,
            "text": "If you’re on Linux you can use vimdiff on both the old and new file which essentially does the same thing as op described, I’m just a massive nerd",
            "title_similarity": "0.58633524",
            "sentiment_compound": -0.296
        },
        {
            "id": "i7fi9tz",
            "score": 2,
            "text": "Assuming the thing you sign isn't a janky page that's been printed and photocopied 10x over with a shit ton of artifacts.",
            "title_similarity": "0.4691624",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i7fidj6",
            "score": 1,
            "text": "Unethicallifeprotip: change the terms the way you want them, sign and send back. Without highlighting your changes. If they sign it then too bad for them, you beat them at their own game.",
            "title_similarity": "0.5975103",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i7fihc4",
            "score": 1,
            "text": "and then retype it with all the changes you want, sign it, and send it back.",
            "title_similarity": "0.60683596",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i7fim08",
            "score": 1,
            "text": "Not a LPT.   \n\n\nRule 6, Rule 8.",
            "title_similarity": "0.14609444",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7fj7n6",
            "score": 2,
            "text": "Just used this to compare two contracts.  Thank you for saving me HOURS of work!!!",
            "title_similarity": "0.59977245",
            "sentiment_compound": 0.5229
        },
        {
            "id": "i7fjbml",
            "score": 1,
            "text": "Or you can do it the analog way and print them in clear paper, then hold them together up in the light and see where the text doesnt line up.",
            "title_similarity": "0.45182025",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i7fjirl",
            "score": 1,
            "text": "\"after hours non-emergency calls fee\"\n\nIs this still a thing in the US? Sometimes i feel like the US has all the tech but are living in the 90s..",
            "title_similarity": "0.5457038",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i7fl2mt",
            "score": 1,
            "text": "Then play techno-phobic boomer! Tell them you can't figure it out and print out a new version with little minor changes in your favor.",
            "title_similarity": "0.63176405",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i7flcx5",
            "score": 1,
            "text": "Can you edit the document to remove undesirable additions?  You can then sign it and hope the landlord did not reread the contract.  This way he will be unable to enforce the new additions to the lease.",
            "title_similarity": "0.67420626",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7flrnj",
            "score": 1,
            "text": "In my experience most places don't send a brand new lease, you just sign an addendum which is really easy to read since it's like one page long.",
            "title_similarity": "0.55089897",
            "sentiment_compound": 0.6901
        },
        {
            "id": "i7fmaog",
            "score": 1,
            "text": "Y'all are getting digital leases? I've only ever gotten physical papers.",
            "title_similarity": "0.4782249",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7fmatr",
            "score": 1,
            "text": "This is called running a redline, and it is the absolute cornerstone of legal practice in the USA.",
            "title_similarity": "0.5094327",
            "sentiment_compound": 0.128
        },
        {
            "id": "i7fmdu7",
            "score": 1,
            "text": "I'm in property management. Most of you didn't even read the first lease. lol",
            "title_similarity": "0.53518045",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i7foi5z",
            "score": 1,
            "text": "How does this work? I've never received a lease document that was digital, they're always been long papers in unusual sizes like legal size or sometimes a nonstandard width.",
            "title_similarity": "0.41018748",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i7fowke",
            "score": 1,
            "text": "Can this feature also be used with google docs ? I am about to renew my lease and they’re already raising my rent but I would love to be able to see it they are changing anything else",
            "title_similarity": "0.741959",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i7fqekn",
            "score": 1,
            "text": "That’s not a LPT but pretty much the first thing a lawyer does when receiving a document. Get a lawyer guys!!",
            "title_similarity": "0.54150194",
            "sentiment_compound": 0.7081
        },
        {
            "id": "i7fsstm",
            "score": 1,
            "text": "Unless it is a commercial lease of more than 20 pages, just read both leases. Residential leases are usually only a couple of pages long.",
            "title_similarity": "0.48806477",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7fulpb",
            "score": 1,
            "text": "Or use BeyondCompare or KDiff",
            "title_similarity": "0.14791504",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7futi6",
            "score": 1,
            "text": "Word also has a “compare” feature within the review ribbon, this will show the changes in one doc (red for deletions, green for additions and orange for sections moved around)",
            "title_similarity": "0.6185354",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7fxdez",
            "score": 1,
            "text": "Shit I’ve been using GitHub to version control my leases.",
            "title_similarity": "0.62485933",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i7g3lln",
            "score": 1,
            "text": "You should be charged if you fail to warn your landlord about a situation that is causing damage.",
            "title_similarity": "0.5905937",
            "sentiment_compound": -0.836
        },
        {
            "id": "i7g43f6",
            "score": 1,
            "text": "Redlines, baby! Are you a Legal Administrative Assistant?",
            "title_similarity": "0.5417418",
            "sentiment_compound": 0.2003
        },
        {
            "id": "i7g5gor",
            "score": 1,
            "text": "Or if your landlord is good at their job they will tell you the changes",
            "title_similarity": "0.560351",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i7gc3pi",
            "score": 1,
            "text": "Fees for them to fix broken shit?   \n\n\nI don't fucking think so. Immediately I'm out.",
            "title_similarity": "0.48652425",
            "sentiment_compound": -0.7717
        },
        {
            "id": "i7gfpxc",
            "score": 1,
            "text": "Does that work for paper leases?",
            "title_similarity": "0.33774084",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ggwb8",
            "score": 1,
            "text": "Mine was just sent through the post.... I did read it cover to cover though.",
            "title_similarity": "0.53894794",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7gj404",
            "score": 1,
            "text": "I feel very thankful to have rented privately from the same people for most of my adult life. There are of course things I wish they’d do differently but they don’t raise my rent and they don’t ever do shady shit to me. They leave me pretty much alone and let me treat my space as it’s mine. Closest I can get to ownership at the moment. I see posts like this and I know I’m unusually lucky",
            "title_similarity": "0.5924362",
            "sentiment_compound": 0.8976
        },
        {
            "id": "i7gokkm",
            "score": 1,
            "text": "Other than awareness, what are you able to do with this information? Living in an apartment complex, all I get from the landlord is \"you're free to not sign and go live somewhere else\". Curious if this leads to different outcomes.",
            "title_similarity": "0.5813346",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i7gqb3j",
            "score": 1,
            "text": "Woah a actually note worthy tip. Very cool stuff.",
            "title_similarity": "0.17660087",
            "sentiment_compound": 0.6697
        },
        {
            "id": "i7grl8g",
            "score": 1,
            "text": "You can also ask your landlord to boldface/underline/highlight any changes they made from the previous lease. If they are honest, they will do so. If not, they're lazy, mean or just plain uncaring. But this is still a great tip, OP.",
            "title_similarity": "0.75944436",
            "sentiment_compound": 0.8539
        },
        {
            "id": "i7gt6uo",
            "score": 1,
            "text": "Where I live once your lease is up you’re automatically month to month and do not need to sign a new lease. Landlords can also only legally increase rent by a certain % once per tenancy year. It’s good to know the specific rules where you live, in case a landlord tries to get you to re sign when you do not have to",
            "title_similarity": "0.7113668",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i7gy0ui",
            "score": 1,
            "text": "Did you still sign?",
            "title_similarity": "0.19811733",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7h2043",
            "score": 1,
            "text": "So what? What are you going to do with that information?",
            "title_similarity": "0.1352894",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7hdk1s",
            "score": 1,
            "text": "Change the terms on your end, sign it and send it back for them to sign. If they don’t read it over, then too bad for them",
            "title_similarity": "0.62150824",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i7hgh6k",
            "score": 1,
            "text": "After hours non-emergency call fee should be mandated by law for every part of human existence... I live better life after putting that in my business contracts. \n\nLPT: always do that wherever you can.",
            "title_similarity": "0.6493662",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i7hh93j",
            "score": 1,
            "text": "Did you cross out the newly-added bits before signing?",
            "title_similarity": "0.5293962",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7jj3ku",
            "score": 1,
            "text": "just sign every page of both yours and his copies",
            "title_similarity": "0.5695528",
            "sentiment_compound": 0.0
        },
        {
            "id": "i7ll9sw",
            "score": 1,
            "text": "I leased apartments for a few years and the company’s lease was 40 pages long. If someone wanted me to go page by page thru it I was happy to since I could explain the stupid thing better in four minutes (“Don’t park in a spot that has a large handicapped sign on a post in front of it. You’ll get towed.” I personally stuck parking passes on people’s windshields when I thought they were too stupid to figure out how to do it themselves. They still got towed within a week for some reason or another.) rather than the renters taking an hour to read it all.",
            "title_similarity": "0.6999029",
            "sentiment_compound": -0.296
        }
    ]
}