{
    "Manhattan to stop prosecuting prostitution, dismissing cases dating back decades\n": [
        {
            "id": "gvc1433",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.48945254",
            "sentiment_compound": -0.6537
        },
        {
            "id": "gvcg10i",
            "score": 10,
            "text": "You Americans are decades behind the rest of the civilized world.",
            "title_similarity": "0.6494168",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvciaad",
            "score": -2,
            "text": "I’m a _woman_ and I support this. In college I knew at least one young woman who was putting herself through college by pole dancing.\n\nLegalize it; rigorously regulate it; and (the best part) _tax the shit out of it_.",
            "title_similarity": "0.40786552",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gvd6bcw",
            "score": -1,
            "text": "Sex work should be legal. We sell everything else in this capitalist hellhole why can’t we sell our bodies without fear of jail?",
            "title_similarity": "0.5732441",
            "sentiment_compound": 0.4815
        },
        {
            "id": "gvccwbb",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvcurus",
            "score": -12,
            "text": "This whole fucking thread, this whole fucking stance... is pretty fucking gross.\n\nI just saw a comment saying they couldn't wait for prostitution to be legal so there can be competition and drive the prices down.\n\nCapitalism has fucking won, man. We're all so ok with being exploited, it's to the point where just selling your valuable time and life isn't enough, your body must be a commodity too. Our society is so fucked.\n\nFuck whatever gross bastard you want for money, I guess, but damn dude. It's a real boring dystopia out here.\n\nLol wow, this is a pretty tame comment but I see the neets who can't wait to pay for sex found it. Pay Per Pussy won't make you actually happy or the chick empowered, though.",
            "title_similarity": "0.57618845",
            "sentiment_compound": 0.8595
        },
        {
            "id": "gvcpe00",
            "score": 3,
            "text": "I genuinely don't understand how you can make being a professional sex worker not criminal anymore but the people who utilize them are still criminals?\n\nOk...  lol",
            "title_similarity": "0.52224493",
            "sentiment_compound": -0.1184
        },
        {
            "id": "gvc82ng",
            "score": 4,
            "text": "LA and NY should just legalize it... there are hookers everywhere. Clearly there is a demand, just tax it or something.",
            "title_similarity": "0.5206158",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvd3b0n",
            "score": 0,
            "text": "Seems like a weird move...",
            "title_similarity": "0.191097",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvc4qzh",
            "score": -5,
            "text": "\"In other news, both Ivanka and Kellyanne Conway have been seen having lunch together at Le Bernardin... and were over heard shopping for apartments...\"",
            "title_similarity": "0.3225947",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd24bl",
            "score": -1,
            "text": "Oh man, I was totally going to go to NYC but now I can’t. This is the last straw",
            "title_similarity": "0.6075524",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3ff7",
            "score": 1,
            "text": "They still plan on prosecuting the Johns involved. Which is sad, just let consenting adults do what wish.",
            "title_similarity": "0.5295619",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvd0h0a",
            "score": -3,
            "text": "As much as I'm generally in favor of the government staying all the way out of consenting adults' sex lives, this is one area that I think could benefit from licensing and regulation. \n\nI think it should absolutely be legalized. But you should have to get a license to practice your trade. Part of that licensing should at least 20 hours of classroom time going over all the legal, financial, health, and safety issues related to the profession. \n\nMake sure the sex workers know how to protect themselves, how to avoid people taking advantage of them, and what steps they can take to seek help if they need it.\n\nAlso, require either an SSN or permanent residency card to be eligible to work in order to cut down on the trafficking of foreign workers. If a brothel is caught using foreign workers fine and jail the owner to set an example.",
            "title_similarity": "0.56423926",
            "sentiment_compound": 0.9377
        },
        {
            "id": "gvcl7rs",
            "score": 11,
            "text": "They should just legalize it.  It will be safer for the sex workers and their clients.  Sex workers could have mandatory STD testing and labor protections.  Rapes would decrease too.",
            "title_similarity": "0.49685627",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvdc164",
            "score": -10,
            "text": "This is the downfall of a moral society",
            "title_similarity": "0.48048428",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcsgsc",
            "score": -3,
            "text": "Phew!\n-Cuomo",
            "title_similarity": "0.1747295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvclzlz",
            "score": 0,
            "text": "That’s awesome! Legalize it, regulate it, tax it! And let people do whatever the fuck they want to do with their bodies. God knows student loans, car loans, and mortgages are turning us all in to prostitutes anyways. We just give our lives instead of bodies to low paying employers.",
            "title_similarity": "0.58479667",
            "sentiment_compound": 0.3578
        },
        {
            "id": "gvd2ips",
            "score": 2,
            "text": "Legalize sex work nationwide",
            "title_similarity": "0.4196399",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3v2g",
            "score": 2,
            "text": "Not enough. Legalize and regulate it. Make it safer for workers and John's and get that tax money from all involved.",
            "title_similarity": "0.51616114",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvcmvkl",
            "score": 0,
            "text": "I’m getting laid tonight!",
            "title_similarity": "0.27854866",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcnfr9",
            "score": 0,
            "text": "I need to get to manhattan right now",
            "title_similarity": "0.42234725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcnhoe",
            "score": 0,
            "text": "\"That's when the whores came in.\" - Old Lady from Tommy Boy",
            "title_similarity": "0.5313345",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gvcwybn",
            "score": 0,
            "text": "A victory for heauxs everywhere",
            "title_similarity": "0.068874165",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3825",
            "score": 0,
            "text": "Hope elliot spitzer gets some of dis👈👈😆😆😆😆😆",
            "title_similarity": "0.1968652",
            "sentiment_compound": 0.9246
        },
        {
            "id": "gvdhbwu",
            "score": 0,
            "text": "Escape from New York wasn't supposed to be a blueprint, guys. lol.",
            "title_similarity": "0.51090986",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvcs5xd",
            "score": 3,
            "text": "Years ago, if you got caught pissing in public, at worse, you'd get  a ticket. Now, they try to get you on a sex offender registry. Pissing isn't a sex crime. In general, prostitution is a victimless crime. Two people using each other. We have to stop vilifying the human body. We can do with our bodies what we want, when we want, as long as nobody gets hurt.",
            "title_similarity": "0.63658965",
            "sentiment_compound": -0.9331
        },
        {
            "id": "gvc3813",
            "score": 31,
            "text": "Legalize, protect workers, tax, regulate and let these horny fucks get off so they can leave the rest of us alone. /s",
            "title_similarity": "0.57414484",
            "sentiment_compound": -0.4522
        },
        {
            "id": "gvcs8je",
            "score": -13,
            "text": "Oh God manhattan is going downhill again, welcome back to the 80s.. sigh",
            "title_similarity": "0.611089",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvcg7e9",
            "score": 4,
            "text": "How are cops gonna shake down hookers for pussy?",
            "title_similarity": "0.5519618",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvcom7e",
            "score": 3,
            "text": "As they should. Legalize drug use, prostitution, etc. You will never stop it, so why not regulate- may even profit.",
            "title_similarity": "0.46754628",
            "sentiment_compound": 0.5842
        },
        {
            "id": "gvcq1r9",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvcrh8u",
            "score": 4,
            "text": "Nevada has legal prositution. \n\nYou can do a lot of good for women if you make it legal, require licenses, check ups, registration, and essentially make it akin to a professional service like lawyers, doctors, nurses, teachers, etc. In fact basically all services that could risk hurting people except...cops...they get a pass.",
            "title_similarity": "0.3754052",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvde7hh",
            "score": -3,
            "text": "Good luck with your nasty herpes...prostitutes are a plague.",
            "title_similarity": "0.49207753",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvcx87f",
            "score": -7,
            "text": "Just like that, another generation of young Eastern European teenagers will soon be offered an \"acting job\" in the USA. Legal prostitution fuels slavery and trafficking, but noone wants to talk about that because that.",
            "title_similarity": "0.49379542",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvco1j8",
            "score": 10,
            "text": "Now regulate, tax it, and let them unionize.",
            "title_similarity": "0.33762544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcm5js",
            "score": 6,
            "text": "In my opinion they should be a regulated industry. Through regulation you can protect the safety of the sex worker and of the client. No more with a sex worker have to worry about being physically abused or catching an STD (actually there will still be some worry about that but far less than there is now), and the client will know that this person providing the service is not doing so against their will, furthermore they will be protected from undesired consequences Of purchasing sex, be in the form of an arrest, an STD, or fear of feeding the sex trafficking market. Additionally the state can make a substantial gain in taxes by legalizing the sex industry.",
            "title_similarity": "0.48077494",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvckrto",
            "score": -35,
            "text": "Here come the hookers. Any other ideas to make New York any shittier?",
            "title_similarity": "0.5752412",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvcn5ep",
            "score": 11,
            "text": "why is paying for sex illegal anyways??\n\nTwo consensual adults making an exchange of services.\n\nStupid fucking laws. It is only there to stop females from making more money (i am a guy)..",
            "title_similarity": "0.6143222",
            "sentiment_compound": -0.8611
        },
        {
            "id": "gvcga06",
            "score": 1,
            "text": "Good!",
            "title_similarity": "-0.1098865",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gvcjuf4",
            "score": 1,
            "text": "Selling is legal.  Fucking is legal.  So why isn't selling fucking legal!?",
            "title_similarity": "0.33296096",
            "sentiment_compound": 0.2461
        },
        {
            "id": "gvcnd1g",
            "score": 1,
            "text": "Hey everyone, we’re all gonna get laid!",
            "title_similarity": "0.25407633",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcohrg",
            "score": -1,
            "text": "This just in: \"Families moving back to Manhattan giving the city back life after COVID. What could have prompted this sudden surge back to the city?\"",
            "title_similarity": "0.6005679",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvcos1h",
            "score": 1,
            "text": "If people really care about exploitation, human life and freeing up law enforcement resources we would be pushing for legalization of sex work.",
            "title_similarity": "0.44609913",
            "sentiment_compound": 0.7645
        },
        {
            "id": "gvcqrmf",
            "score": 1,
            "text": "Cuomo caught soliciting the police chief or what?",
            "title_similarity": "0.47920793",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcse3m",
            "score": 1,
            "text": "Legalize sex work for us ugly folk who can’t get laid and to get rid of pimps/sex traffickers",
            "title_similarity": "0.6708605",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvd1qsq",
            "score": 1,
            "text": "I never understood how sex for profit in america is illegal unless you film it",
            "title_similarity": "0.5697445",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvd1s3k",
            "score": 1,
            "text": "Various parts of NYC have already done this. It increases prostitution in surrounding areas, public gets outraged, then it gets repealed. \n\nProstitution should be decriminalized AND legalized.",
            "title_similarity": "0.63426864",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvd28iu",
            "score": -1,
            "text": "Great news for all the neighbors who live next to prostitutes. Cause for celebration!",
            "title_similarity": "0.26403612",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gvd2wb8",
            "score": 1,
            "text": "Ah, but when will they stop prostituting prosecution?",
            "title_similarity": "0.5735784",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gvd3w9b",
            "score": 1,
            "text": "NYPD has more important things to do than police what 2 consenting adults choose to do. How about all states stop with the BS. Harm reduction is key and a legal venue/area for this is better than letting the “black market” take care of it.",
            "title_similarity": "0.56014454",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gvd4vop",
            "score": -1,
            "text": "That’s one way to lure people back to this dead city.",
            "title_similarity": "0.5244671",
            "sentiment_compound": -0.729
        },
        {
            "id": "gvd7ye1",
            "score": -1,
            "text": "It seems like now a days people have this idea that there is no consequence for anything....what’s next ? Outlaw murder punishments because their just people with anger issues who are angry at society? And what bout rape, no punishment for that right either because they are just poor victims who have too much of a sexual urge they can’t help themselves? It’s like many in this generation have failed to understand why these laws were put in place in the first place. As if there wasn’t a reason in the first place.",
            "title_similarity": "0.65528953",
            "sentiment_compound": -0.9695
        },
        {
            "id": "gvd8q12",
            "score": -1,
            "text": "Awesome now daughters can legally but pushed into prostitution rings! Way to go America",
            "title_similarity": "0.5386188",
            "sentiment_compound": 0.4664
        },
        {
            "id": "gvd95gq",
            "score": 1,
            "text": "Why not? Who needs morals anyhow?",
            "title_similarity": "0.23380607",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdc2cw",
            "score": 1,
            "text": "As a guy who sees escorts a few times a month, I applaud this step forward in protecting sex workers.",
            "title_similarity": "0.3576745",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvdiwnw",
            "score": 1,
            "text": "Legalize prostitution so people can get loads blown into them instead of guns.  Really this should be as important as marijuana legalization.",
            "title_similarity": "0.5274861",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvcvav3",
            "score": -7,
            "text": "All the pimps who got locked up for “human trafficking” deserve to be compensated.",
            "title_similarity": "0.44435263",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvccz7t",
            "score": 10,
            "text": "Marriage is sometimes prostitution.",
            "title_similarity": "0.43254113",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcufep",
            "score": -16,
            "text": "Just what Manhattan needs, now we can have homeless drug addicts, homeless mentally ill people and now prostitutes everywhere! I would say the city is in the toilet but it’s been there for a while now.",
            "title_similarity": "0.6738738",
            "sentiment_compound": -0.2942
        },
        {
            "id": "gvcmll4",
            "score": 11,
            "text": "Prostitution needs to be legalized, and strictly regulated! It's simply a business transaction, between consenting adults! Pimps need to feel the full force of law, no one should ever be forced into prostitution!",
            "title_similarity": "0.5227952",
            "sentiment_compound": -0.7249
        },
        {
            "id": "gvcmqc7",
            "score": 3,
            "text": "Legalize being human.",
            "title_similarity": "0.04018151",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd270m",
            "score": 2,
            "text": "About time.  Most drugs, adult prostitution should all be legalized or decriminalized. Take $ away from crime groups who oppress women and empower those who see prostitution as a work option. Pay taxes and hire real protection not pimps who use & abuse women. Conservatives (& I’m one morally) need to wake up. The war on drugs & prostitution is an abysmal failure only serving to ruin society, communities.",
            "title_similarity": "0.6984325",
            "sentiment_compound": -0.9643
        },
        {
            "id": "gvdk0ls",
            "score": 3,
            "text": " the amount of human trafficking that goes on in the sex industry is insane, this won’t help it. It will make it worst.",
            "title_similarity": "0.527388",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvcnh64",
            "score": 7,
            "text": "Now do it nationwide",
            "title_similarity": "0.10724634",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcyqvl",
            "score": -10,
            "text": "so is Pimp Jizzlane Maxwell still under arrest? \n\nCan’t wait to hear that teenagers  pimping out other teenagers because they wanted the money but didn’t want to massage Jeffrey Epstein = female empowerment \n\nOr that ‘white supremacy’ is what made Jizzstain and Epstein pimp out teenagers that then pimped younger weaker girls. \n\nMaybe Jizzlane can do the commencement for Harvard’s Graduation. Or West Point? She’d be popular wherever politicians are created! \n\n“Sex work is real work” -\nsaid Vice Pervert Harris",
            "title_similarity": "0.6128093",
            "sentiment_compound": -0.6126
        },
        {
            "id": "gvcg6re",
            "score": 18,
            "text": "Good, its so fucking dumb that its illegal. What two consenting adults do with their lives in regards to fucking shouldn't be that big of a deal. Just go after the pedophiles and the bestiality freaks and call it a day",
            "title_similarity": "0.6564859",
            "sentiment_compound": -0.7159
        },
        {
            "id": "gvctnzg",
            "score": 3,
            "text": "Why not just legalize it like Nevada than you can regulate it and tax the shit out of it",
            "title_similarity": "0.47598943",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gvcwtla",
            "score": 3,
            "text": "Legalize Marijuana ✅ \n\nLegalize prostitution ☑️ \n\nAffordable housing ☑️ \n\n\nGet those last two things taken care of and New York might be a nice place to live",
            "title_similarity": "0.48826793",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gvcb0ur",
            "score": 7,
            "text": "Good. If a person's body belongs to them, they can do as they please with it - sell it, give it away, whatever.",
            "title_similarity": "0.23872718",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvczk4r",
            "score": -7,
            "text": "Good for Hunter Biden",
            "title_similarity": "0.087036476",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvcs7pw",
            "score": 0,
            "text": "Nice....",
            "title_similarity": "-0.08442482",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvctovn",
            "score": 0,
            "text": "Have to read the details but it's been a long time coming",
            "title_similarity": "0.26616472",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcwhci",
            "score": 0,
            "text": "Still wonder how this would effect human trafficking. Thats the main reasons I haven't gone to see a sex worker to lose my virginity. There's a probability of sexually assaulting a woman being trafficked when you're a John.",
            "title_similarity": "0.64899373",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gvcxlel",
            "score": 3,
            "text": "The Swedish model. Outlaw the johns, decriminalize the sex workers.",
            "title_similarity": "0.60216856",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcz2m1",
            "score": 4,
            "text": "Legalize sex work!",
            "title_similarity": "0.42809537",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd2h8o",
            "score": 0,
            "text": "Russian Mafia has joined the chat.",
            "title_similarity": "0.29099137",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd3q8l",
            "score": 0,
            "text": "Whats next. ARE THEY GONNA LEGALIZE MURDER?\n-Someones uncle on facebook",
            "title_similarity": "0.5238878",
            "sentiment_compound": -0.7531
        },
        {
            "id": "gvd4h09",
            "score": 0,
            "text": "Go Manhattan! This seriously needs to be decriminalized. It's the world's oldest profession, it crosses all financial levels, all careers, and many lifestyles. I can't think of a good reason to keep prostitution illegal that can possibly outweigh the bad.",
            "title_similarity": "0.7522043",
            "sentiment_compound": -0.7482
        },
        {
            "id": "gvd50sm",
            "score": 0,
            "text": "Sounds like a lot of people will be off the hook.",
            "title_similarity": "0.38657945",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvd5ewh",
            "score": 0,
            "text": "Step in the right direction. What’s the most apt way to tailor statutes towards sex trafficking?",
            "title_similarity": "0.2933557",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd5xdt",
            "score": 0,
            "text": "Remember kids, now you don't have to pay for a 1k+ escort to not get arrested for doing the same thing some Wall Street prick does on a nightly basis.",
            "title_similarity": "0.53104323",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gvd60ny",
            "score": 0,
            "text": "yeah it really just should be a fine",
            "title_similarity": "0.028226187",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvd847r",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvd8xxb",
            "score": 0,
            "text": "Prostitution legal but gun’s not what typa shit is this",
            "title_similarity": "0.4697067",
            "sentiment_compound": 0.6293
        },
        {
            "id": "gvd91d3",
            "score": 0,
            "text": "The OF chicks gonna light that city up this summer LOL",
            "title_similarity": "0.34001556",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gvd93pn",
            "score": 0,
            "text": "Glad to see this. Prosecuting sex workers isn’t ever going to solve the problem, just like prosecuting drug users isn’t going to stop people from doing drugs. Get them off the streets and into treatment.",
            "title_similarity": "0.61327994",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvda39z",
            "score": 0,
            "text": "Prostitution should be legal. I mean, people are allowed to sell nudes and porn videos of themselves on only fans. The only difference is buying a hooker is done in person.",
            "title_similarity": "0.52233756",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvda6q6",
            "score": 0,
            "text": "So they're basically deleting the browser history of all the higher ups",
            "title_similarity": "0.4603462",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdacxy",
            "score": 0,
            "text": "So we're finally going to make it illegal for cops to coerce sex workers into sleeping with them while on the clock or no? It's still wild to me that \"they wanted to have sex\" makes it ok for cops to be fucking people on the clock. College professor can't fuck their students even if they do consent cause of the power dynamics so why do we allow people with guns and handcuffs to fuck people (and if the sex workers say it wasn't consensual, guess which party the judge is more inclined to believe)\n\nAmerica is a polished turd",
            "title_similarity": "0.6110827",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gvdalw8",
            "score": 0,
            "text": "The Vienna talks are positive, and the plan discussed in these talks includes a joint return with Iran to the nuclear deal.",
            "title_similarity": "0.2774156",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gvdat1j",
            "score": 0,
            "text": "You can sell your body but do not put a soda over 16 ounces into it!",
            "title_similarity": "0.5354489",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvde3eg",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvdfexu",
            "score": 0,
            "text": "Just here to say fuck the Nordic model",
            "title_similarity": "0.4133715",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdg2g8",
            "score": 0,
            "text": "“Manhattan fails to come for prostitutes”",
            "title_similarity": "0.67829335",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvdmay8",
            "score": 0,
            "text": "Shit, that's why Matt Gaetz is moving to NYC.",
            "title_similarity": "0.37176666",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvf1cp0",
            "score": 0,
            "text": "And the cycle of objectifying women continues. Thank you, Humanity.",
            "title_similarity": "0.28043243",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvfidg2",
            "score": 0,
            "text": "And we keep lowering the bar.",
            "title_similarity": "0.3623609",
            "sentiment_compound": -0.25
        },
        {
            "id": "gvcvf9v",
            "score": 21,
            "text": "Selling is legal... fucking is legal... why isn’t selling fucking legal?\n\nRIP",
            "title_similarity": "0.37371957",
            "sentiment_compound": 0.4716
        },
        {
            "id": "gvcm2uk",
            "score": 57,
            "text": "While everyone was trying to legalize marijuana, this was what I was fighting for! I donated lots of money to prostitution over the years, definitely feel I should get some credit",
            "title_similarity": "0.51498187",
            "sentiment_compound": 0.4753
        },
        {
            "id": "gvcv8i2",
            "score": -10,
            "text": "this change is misogynist and misandrist. because it will allow pimps to flourish and be trafficking women even more, and also its misandrist because men are still criminalized for their half (buying) meanwhile the women are decriminalized for selling.",
            "title_similarity": "0.5505762",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvcoe2m",
            "score": 4,
            "text": "Been legal in New Zealand since 2003!",
            "title_similarity": "0.2477138",
            "sentiment_compound": 0.2003
        },
        {
            "id": "gvcoo7l",
            "score": 4,
            "text": "Baby steps. But maybe now that weed is slowly becoming legal we can start moving towards undoing our backwards and draconian sex work laws as well.",
            "title_similarity": "0.5324137",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gvcr3yr",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvcgz2w",
            "score": -16,
            "text": "Do you want prostitutes ? Because this is how you get prostitutes.",
            "title_similarity": "0.39404982",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvcqfb2",
            "score": -11,
            "text": "weed:  legal   (sort of)\n \nprostitution:  legal  (kind of)\n\n\npeople:   unimaginably dumber every single day\n \n\nidiocracy was prophetic",
            "title_similarity": "0.604111",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvco74o",
            "score": -6,
            "text": "Cool, now do Weed....",
            "title_similarity": "0.18718036",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvcfmvc",
            "score": 1,
            "text": "To late for Elliot Spitzer",
            "title_similarity": "0.38028097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcg597",
            "score": -1,
            "text": "I predict they are going to start calling these arrests “human trafficking”.",
            "title_similarity": "0.465384",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvcj433",
            "score": 1,
            "text": "Why not just make it legal?",
            "title_similarity": "0.23297691",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvcor01",
            "score": -1,
            "text": "This and weed!? Now it’s literally new Amsterdam",
            "title_similarity": "0.39042902",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcpc2h",
            "score": 1,
            "text": "Now make it legal. Why the fuck having sex for money is illegal is beyond me lol. When if you throw a camera in the mix it’s totally fine.",
            "title_similarity": "0.5188459",
            "sentiment_compound": -0.4033
        },
        {
            "id": "gvcppwm",
            "score": 1,
            "text": "Cy Vance is a liar. He's announced a dozen of these \"we're no longer prosecuting X\" things only to see these cases come through arraignments for years after the announcement. And yet still he gets the good press.",
            "title_similarity": "0.62915504",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvcqijy",
            "score": -1,
            "text": "I guess old New York is one again new Amsterdam",
            "title_similarity": "0.46010435",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcrpc3",
            "score": 1,
            "text": "This is big.",
            "title_similarity": "-0.04872235",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcslyr",
            "score": -1,
            "text": "Guess Gaetz should move to Manhattan",
            "title_similarity": "0.49157196",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcyhpd",
            "score": 1,
            "text": "Big win for Trojan and other condom manufacturers.",
            "title_similarity": "0.25610244",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvd0mjz",
            "score": 1,
            "text": "Good. What a waste of tax payer dollars. Hunting down consensual transactions between adults. Legalizing prostitution would have far reaching benefits.",
            "title_similarity": "0.6177302",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvd1hpt",
            "score": 1,
            "text": "New Amsterdam is back!",
            "title_similarity": "0.2170676",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd1wqc",
            "score": -1,
            "text": "I need to visit Manhattan.",
            "title_similarity": "0.4418432",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd2tc0",
            "score": -1,
            "text": "*Mayor: ok people, the rich have been leaving NYC for a year now because of COVID and if Biden pases higher taxes, they’ll never come back. We need __ideas__ people. We need a “Hail Mary”. How do we get them to come back?!*",
            "title_similarity": "0.75736487",
            "sentiment_compound": 0.7263
        },
        {
            "id": "gvd2xn1",
            "score": -1,
            "text": "Ah, maybe, just maybe, New Amsterdam will become Amsterdam...they are taking it one step at a time.",
            "title_similarity": "0.39960992",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4baf",
            "score": 1,
            "text": "Just fucking legalize it already. You get to move it off the streets and into a more controlled and secure facility. Will help to cut down on human trafficking, create jobs, stop the spread of disease, tax revenues",
            "title_similarity": "0.509336",
            "sentiment_compound": 0.4877
        },
        {
            "id": "gvd4z9m",
            "score": 1,
            "text": "Ok now legalize it so you can regulate it.",
            "title_similarity": "0.19017866",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvd6att",
            "score": 1,
            "text": "I’m sorry but until they criminalize sugar dating there is not point to this effort. The horses have left the barn already.",
            "title_similarity": "0.6691631",
            "sentiment_compound": -0.0387
        },
        {
            "id": "gvd7c6m",
            "score": 1,
            "text": "I had to read the whole damn article to find this:\n\n>\tThe DA’s office will continue to prosecute other crimes relating to prostitution, including sex trafficking and patronising sex workers.\n\nSo, are abusive pimps considered human traffickers?  \n\nI’m very glad that prostitutes are no longer going to be arrested, but I want to know about the pimps.",
            "title_similarity": "0.5979913",
            "sentiment_compound": -0.6546
        },
        {
            "id": "gvd8ri3",
            "score": 1,
            "text": "Excellent. The state has no right to meddle in people's personal lives. If someone sells sex or wants to take drugs let them. There's more important issues to focus on and prohibition just made things worse.",
            "title_similarity": "0.64188707",
            "sentiment_compound": 0.1263
        },
        {
            "id": "gvd8tor",
            "score": 1,
            "text": "Legalize prostitution already. Cash in on that nut money.",
            "title_similarity": "0.55132234",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd9d84",
            "score": 1,
            "text": "The decriminalization and destigmatization of sex work is long, long overdue. I'm totally sympathetic to the argument that there's a risk of making exploitation even easier, and that this needs to be consideration #1 moving forward. No objection there, but every path forward on that front requires these steps too just as a starting point. Bringing sex work out of the shadows will help in combatting sex trafficking.  \n\nAs I've got more into true crime, one thing that becomes apparent is that whenever society marginalizes a group, the worst we have to offer *very* deliberately target that group. They use our prejudices to fly under the radar while they commit terrible acts against victims whose deaths we've elected not to care about. But everyone should care, because people don't stop being people when they engage in sex work. And shit, even an absolute sociopath should care because it's always in everyone's best interest that the worst of us are caught early. When the next Gary Ridgway gets caught on his first or second victim instead of his 48th, I'd say we're all much better off.",
            "title_similarity": "0.52532",
            "sentiment_compound": -0.2002
        },
        {
            "id": "gvd9qol",
            "score": 1,
            "text": "Great way to increase tourism 😍😍😍",
            "title_similarity": "0.11414857",
            "sentiment_compound": 0.9371
        },
        {
            "id": "gvdc57i",
            "score": 1,
            "text": "So 15 y/o sex trafficking victims aren’t criminals? /s",
            "title_similarity": "0.39581668",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gvde5g7",
            "score": 1,
            "text": "It’s about fucking time. Now how about they license the sex workers. Which makes them get blood work regularly. And also give them the power to call the cops if someone gets cagy with them.",
            "title_similarity": "0.527055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdfbgj",
            "score": 1,
            "text": "Sex work is work.\n\nThe fact that we ever prosecuted prostitution is a black mark on progress. It's good to see New York (or Manhattan specifically) is continuing to take these steps forward.",
            "title_similarity": "0.4847376",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gvdfkbb",
            "score": -1,
            "text": "They’re still planning to keep one half of the transaction illegal, absolutely nonsensical, it’s illegal or it isn’t.",
            "title_similarity": "0.5329412",
            "sentiment_compound": -0.8158
        },
        {
            "id": "gvdg3t3",
            "score": 1,
            "text": "Stop it period. There life and there bodies.",
            "title_similarity": "0.48109698",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvdiqcf",
            "score": 1,
            "text": "The Nordic Model is the only humane and pro-women way to deal with this. \n\nhttps://en.m.wikipedia.org/wiki/Nordic_model_approach_to_prostitution\n\nThere’s simply not enough local supply to support demand in a fully legalized model so people should stop advocating for it. Full legalization of buying sex actually increases foreign illegal trafficking of girls to supplement because the demand from men will always outweighs the supply of legal, willing, local women.",
            "title_similarity": "0.53473115",
            "sentiment_compound": -0.5945
        },
        {
            "id": "gvdo0oi",
            "score": 1,
            "text": "This is very good as it will help protect minors and victims of sex trafficking. Hopefully it will also make things safer for everyone who chose sex work voluntarily as their profession.",
            "title_similarity": "0.28750423",
            "sentiment_compound": 0.8932
        },
        {
            "id": "gvdouog",
            "score": -1,
            "text": "Prosecute the johns and pimps, please.",
            "title_similarity": "0.46378586",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvdpho7",
            "score": 1,
            "text": "Prostitution should be Legal - We don't need the government telling people what they can and can't do with their bodies.",
            "title_similarity": "0.5105648",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvdpm7o",
            "score": 1,
            "text": "That’s fucking awesome.",
            "title_similarity": "-0.051067933",
            "sentiment_compound": 0.659
        },
        {
            "id": "gvdue2w",
            "score": 1,
            "text": "Somewhere in hell, Jeffrey Epstein just popped the cork on a warm bottle of expensive champagne.",
            "title_similarity": "0.3991436",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvdxxhz",
            "score": 1,
            "text": "Its been a job since the Bible times, not sure it’s been illegal for so long. Long as the men/women are clean and make sure no one get hurt by the other party make it legal",
            "title_similarity": "0.44109955",
            "sentiment_compound": -0.4519
        },
        {
            "id": "gvdyypy",
            "score": -1,
            "text": "This will be great news for Hunter Biden’s hos",
            "title_similarity": "0.05472192",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gve5acn",
            "score": 1,
            "text": "Its almost as if one gender thinks mainly about sex and one thinks mainly about money. But say that clear fact and youll be called a bigot.",
            "title_similarity": "0.4368941",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gve9ru7",
            "score": -1,
            "text": "John's need to be punished.  Look at Bob Kraft.  He got away with no charges but the woman did not.  This guy has more money than GOD and got off with doing nothing.",
            "title_similarity": "0.54457486",
            "sentiment_compound": 0.5502
        },
        {
            "id": "gveie70",
            "score": 1,
            "text": "Human traffickers celebrate",
            "title_similarity": "0.17007978",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvcoxxj",
            "score": -21,
            "text": "We really are just asking for another great flood.",
            "title_similarity": "0.3251757",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvc7woy",
            "score": 646,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvcodgs",
            "score": -8,
            "text": "STDs are gonna skyrocket! Yeeeowwch!!!",
            "title_similarity": "0.22483873",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvczf03",
            "score": -9,
            "text": "sex work is nasty",
            "title_similarity": "0.41170102",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvcr4ey",
            "score": 2,
            "text": "“Selling is legal.  Fucking is legal.  Why isn’t selling fucking legal?”  -George Carlin",
            "title_similarity": "0.40227717",
            "sentiment_compound": 0.3134
        },
        {
            "id": "gvct7op",
            "score": 2,
            "text": "Looks like Manhattan’s back on the menu, boys!",
            "title_similarity": "0.5176839",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gvctddx",
            "score": 2,
            "text": "Meet me at ricks cabaret",
            "title_similarity": "0.26837185",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcubu6",
            "score": 2,
            "text": "Legalize, tax, put taxes towards universal healthcare alongside weed. Thanks.",
            "title_similarity": "0.36648685",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvcuudo",
            "score": -2,
            "text": "Found my next vacation spot",
            "title_similarity": "0.18528448",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcvmwm",
            "score": -2,
            "text": "Well, here come the Korean/Asian Massage Parlors post pandemic. They totally disappeared during covid.",
            "title_similarity": "0.6658648",
            "sentiment_compound": -0.024
        },
        {
            "id": "gvcvnp5",
            "score": -2,
            "text": "Some of you in this thread are either courageous, idealistic proponents of pure truth in the presentation of data, or you just really, really want Amsterdam to be a shining example of how sex work can be beneficial to everyone involved without detrimental effects upon individual, community, or society. Eh, everyone has a personal narrative about themselves that they tell themselves. But character is fate.",
            "title_similarity": "0.34785527",
            "sentiment_compound": 0.7299
        },
        {
            "id": "gvcwgm3",
            "score": 2,
            "text": "Great. Now New York can go back to its colonial roots as a major human trafficking outpost",
            "title_similarity": "0.48555917",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvcx3mj",
            "score": 2,
            "text": "Legalize it, tax it & force people to take a free health class.\n\nWon't kill the black market but definitely would reduce it.",
            "title_similarity": "0.48785472",
            "sentiment_compound": 0.7946
        },
        {
            "id": "gvczbw0",
            "score": 2,
            "text": "I guess Night Court is out of date now.",
            "title_similarity": "0.49351656",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvczr76",
            "score": 2,
            "text": "Prostitution needs to be legalized and regulated. Lets be real here. Prostitution is never going away. Prohibition only enables human trafficking and other illicit associated criminal activity to thrive. Through strict regulation it could be done safely with only consenting parties involved.",
            "title_similarity": "0.44956982",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvd1dfv",
            "score": 2,
            "text": "I say decriminalize it, not legalize it. Legalizing it runs into the HUGE problem of human exploitation. Look up the abuse in the porn industry, and you'll see that rape and drug abuse is rampant. However, decriminalizing it let's people utilize it for themselves, without risk of getting exploited. It also let's the police focus on human traffickers by letting victims be unafraid of coming to the police.",
            "title_similarity": "0.5867904",
            "sentiment_compound": -0.9535
        },
        {
            "id": "gvd21dh",
            "score": -2,
            "text": "its called sex work but yay",
            "title_similarity": "0.34941024",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gvd21k2",
            "score": 2,
            "text": "Let’s go a bet going .. no money\n\nI say Trump moves back to Manhattan quicker than everyone thinks LOL",
            "title_similarity": "0.6503638",
            "sentiment_compound": 0.3254
        },
        {
            "id": "gvd3e7m",
            "score": -2,
            "text": "Finally I can get back on the corner!",
            "title_similarity": "0.1565357",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4rbo",
            "score": -2,
            "text": "The article refers to unlicensed massage also which in Las Vegas deputies use to take in strippers from one of the 60 strip clubs there. They also take girls in, supposedly, for mentioning sex acts in their sales pitch for VIP rooms. Idk. I don't know all that goes on; but,  I don't believe in human trafficking and it seems like the men that keep these derailed and disenfranchised girls in this situation are the one's that should be arrested. That includes the managers of the clubs that stand guard on the matters at hand. #metoo #lvrj #latimes #sagaftra",
            "title_similarity": "0.60079867",
            "sentiment_compound": 0.415
        },
        {
            "id": "gvd4vdm",
            "score": -2,
            "text": "Guess I found out where im visiting heh heh 😈",
            "title_similarity": "0.19653505",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvd54pg",
            "score": 2,
            "text": "\"Selling is legal. Fucking is legal. Why isn't selling fucking legal?!\" - Carlin",
            "title_similarity": "0.38162577",
            "sentiment_compound": 0.2461
        },
        {
            "id": "gvd5hkx",
            "score": -2,
            "text": "I can’t wait to see those shitty Non licensed avengers in Times Square get replaced by hookers again. To be fair it was their corner since the 80’s so it’s only fair.",
            "title_similarity": "0.63881224",
            "sentiment_compound": 0.0679
        },
        {
            "id": "gvd5nb3",
            "score": 2,
            "text": "Just legalize it already... Legal prostitution would reduce human trafficking significantly, not to mention improve working conditions for the workers.",
            "title_similarity": "0.5085926",
            "sentiment_compound": -0.2278
        },
        {
            "id": "gvd6kzs",
            "score": -2,
            "text": "You pick up this working girl\nWho's hooked on smack\nWho hustles and scores\nThat's all I do, she says\nShe says, ten bucks for head, fifteen for half and half\nShe says, three hits a day at thirty-five per\nYou say, that's seven tricks a day at least\nBut she says, sometimes I get lucky\nOnce this guy gives me a bill and a half just to eat me\nOnly time I ever came\n\nYou figure you can save her\nYou sell your color TV\nThat keeps her off the streets a whole day\nYou hawk your typewriter for one jobe\nThen your shotgun, your watch\nA week later you say, listen I'm a little short\nBut she says, no scratch, no s*****\nYou say, look, it is better to give\nBut she says, beat off, creep\n\nOne night they spot you on the street in your skivvies\nTrying to sell your shoes\nYou tell them who you are\nBut they nail you\nThen she happens by\nAnd she says, Christ you look f*****\nShe says, hang tough\nBut you don't say anything\nYou just think, what a b** wrap for a nice sensitive guy like me",
            "title_similarity": "0.523793",
            "sentiment_compound": 0.9541
        },
        {
            "id": "gvdaoon",
            "score": 2,
            "text": "Good!! Regulate it. Tax it. Get it off the streets. Make it as safe as possible for everyone. Stop wasting resources on prosecuting it.",
            "title_similarity": "0.4098773",
            "sentiment_compound": 0.3578
        },
        {
            "id": "gvdayak",
            "score": 2,
            "text": "Sex work should never be illegal, just regulated.",
            "title_similarity": "0.3542217",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gvdbi3n",
            "score": -2,
            "text": "We won’t have to worry about that. There will be no police after the Democrats get done with us.",
            "title_similarity": "0.52565306",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvdc42z",
            "score": 2,
            "text": "Let me guess. Johns still get persecuted. Just the ladies get off. Smh",
            "title_similarity": "0.5938209",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvdc90z",
            "score": 2,
            "text": "Nice! Finally someone putting forward a jobs bill.",
            "title_similarity": "0.29215872",
            "sentiment_compound": 0.4753
        },
        {
            "id": "gvdd45b",
            "score": -2,
            "text": "Where the rich live wow!!! Pagans",
            "title_similarity": "0.30205786",
            "sentiment_compound": 0.851
        },
        {
            "id": "gvddwja",
            "score": -2,
            "text": "Trashy society",
            "title_similarity": "0.34629804",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdh3gl",
            "score": 2,
            "text": "This is great news especially for trans people who were targeted in the “walking while trans” laws were in use. They deserve reparations, too",
            "title_similarity": "0.36773378",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvdhbz4",
            "score": -2,
            "text": "How many of you pro-prostitution people on here would be happy if your daughters became prostitutes? Or is it only ok for other peoples daughters to become prostitutes?",
            "title_similarity": "0.4774906",
            "sentiment_compound": 0.7399
        },
        {
            "id": "gvdq31r",
            "score": 2,
            "text": "No politician will get behind it, but consenting adults should really be able to pay for intimacy, in a clean, safe and regulated environment.  Going to the brothel should be as normal as going to therapy.",
            "title_similarity": "0.48559594",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gvdq6k9",
            "score": -2,
            "text": "Hunter Biden is excited",
            "title_similarity": "-0.01826584",
            "sentiment_compound": 0.34
        },
        {
            "id": "gve7yb1",
            "score": -2,
            "text": "Great news for sex traffickers",
            "title_similarity": "0.29380387",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvec965",
            "score": 2,
            "text": "r/politics can finally get some after watching their wives have sex for years now",
            "title_similarity": "0.545643",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc9ew2",
            "score": 24,
            "text": "Rudy Giuliani is both excited and in shambles.",
            "title_similarity": "0.24323456",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvchwhz",
            "score": 3,
            "text": "PSA: soliciting a prostitute is still a crime in Manhattan.",
            "title_similarity": "0.6126909",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvci3vn",
            "score": -3,
            "text": "This may let Trump off the hook!",
            "title_similarity": "0.29378933",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcnouw",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvcom40",
            "score": 3,
            "text": "Question why is the article from the UK not from NY ?",
            "title_similarity": "0.40392923",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcr1xp",
            "score": -4,
            "text": "So the Attorney’s office makes the laws. Sigh... when the executive begins making laws through the nonprosecution of lw breakers, laws cease to be important. And this wont necessarily force the legislature. \n\n\nBad idea. The legislature needs to do it, not the executive.",
            "title_similarity": "0.60280406",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvct4wf",
            "score": 4,
            "text": "Does this include politicians prostituting their souls, integrity and self respect to corporations?",
            "title_similarity": "0.3753535",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gvcv505",
            "score": 4,
            "text": "Eliot Spitzer going to make a run for New York governor again?",
            "title_similarity": "0.48347056",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcv79u",
            "score": 4,
            "text": "The Weimar Republic sound great if you don't know how the story ends.",
            "title_similarity": "0.30862802",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvczl9r",
            "score": 3,
            "text": "The war on drugs and hookers is the longest in record",
            "title_similarity": "0.5074501",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvd2624",
            "score": -2,
            "text": "Finally, a solution to the rising violent crime rate!",
            "title_similarity": "0.3808251",
            "sentiment_compound": -0.75
        },
        {
            "id": "gvd3gjl",
            "score": -4,
            "text": "Time to move to Manhattan!",
            "title_similarity": "0.42975464",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdb2ml",
            "score": 3,
            "text": "Let’s be honest- why is prostitution illegal anyway? It really only hurts the prostitutes. Wouldn’t legalizing prostitution help stop the illegal sex trade industry?",
            "title_similarity": "0.60594106",
            "sentiment_compound": -0.7986
        },
        {
            "id": "gvdcabu",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvdd3gu",
            "score": 3,
            "text": "Probably so they can start legalizing it and taxing it.",
            "title_similarity": "0.31304047",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvddauv",
            "score": 2,
            "text": "I do not understand why it is illegal to sell something that is perfectly legal to give away for free or to record and sell.\n\n\nMaking prostitution illegal does one thing and that’s out the men and women who work in prostitution at risk of exploitation.",
            "title_similarity": "0.5481989",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvcv3rz",
            "score": 11,
            "text": "Unfortunately. When you stop enforcing a law then laws become meaningless. If it's worth changing, *it's worth actually changing the law*, not just arbitrarily deciding not to enforce it.",
            "title_similarity": "0.5609673",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvcdx22",
            "score": 5,
            "text": "What I always find funny is the word Freedom and what that means. There are a lot of freedom conservatives and they freak when dems make any new law that they can in some way decipher as freedom taking, some times they are.\n\nBut they don't give credit to:\nFreedom of drugs.\nFreedom of Prostitution.\nFreedom of sex related things.\n\nThe last is a huge freedom, the others are pretty strong freedoms.\nSo why can't they see/credit dems when they see these freedoms expanded? No need to answer.",
            "title_similarity": "0.5323716",
            "sentiment_compound": 0.9931
        },
        {
            "id": "gvcqkty",
            "score": -3,
            "text": "Maybe the prices will go down,, 😂",
            "title_similarity": "0.4175499",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvd5el7",
            "score": -4,
            "text": "Capitalism continues to exacerbate the moral decline of the world.",
            "title_similarity": "0.56146884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd5ioy",
            "score": 4,
            "text": "Prosecute the pimps and give the workers what the pimps took from them that would be the real win on top of this",
            "title_similarity": "0.45955324",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvdbbon",
            "score": -4,
            "text": "So, Drugs are legal, Prostitution is legal, Marijuana is legal, the police are the bad guys and Donald Trump is being erased from city history.  You know if I hadn't already moved out of NYC to a nice, safe, red state city, I would already be packing my bags.  Why in the world did anyone look at the mess the radical left has made in LA, SF, Oakland, Seattle and Portland and say we should totally do that in NYC.  What a real shame.",
            "title_similarity": "0.68933225",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvcv75e",
            "score": 14,
            "text": "I really hate this trend we’re on that executive branches can ignore things that the legislature says are crimes through passing laws.  I agree that we shouldn’t prosecute sex workers or certain drug crimes, etc, but by changing the law — not just ignoring the law’s enforcement.  We’re waking into chaos.",
            "title_similarity": "0.5792441",
            "sentiment_compound": -0.7149
        },
        {
            "id": "gvcn6lk",
            "score": 31,
            "text": "Sex work should be decriminalized look at how the UK looks at it \n\nRemember 5 years ago sports gambling was seen as taboo as well.\n\nLegal or not people are still gonna do it",
            "title_similarity": "0.63643765",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvcpinh",
            "score": 6,
            "text": "USA is not the land of the free at all. Anywhere in Europe prostitution is legalized, marijuana is legalized, drugs are decriminalized. The USA seeks to live in the 1950s and would rather incarcerate americans that create a FREE America that also brings in more tax revenue",
            "title_similarity": "0.6466738",
            "sentiment_compound": 0.8567
        },
        {
            "id": "gvcvhix",
            "score": -6,
            "text": "Trump was alright",
            "title_similarity": "-0.019507108",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvcxzgd",
            "score": 5,
            "text": "I mean... why is illegal to sell something you could give away for free legally?!",
            "title_similarity": "0.45912436",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gvcyo4t",
            "score": 5,
            "text": "\"We're stopping prosecutions of prostitution but we'll still prosecute johns\" 🥴",
            "title_similarity": "0.6851151",
            "sentiment_compound": -0.5927
        },
        {
            "id": "gvcyob0",
            "score": -5,
            "text": "Yes, because every woman dreams of a career spent on her back servicing gross men.\nExploitation has now been given state sanction. What a day!",
            "title_similarity": "0.41326547",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gvcjzex",
            "score": 5,
            "text": "There are thousands of products and services that require a license to provide and/or a license to purchase, to ensure that industry-relevant safety and security measures are upheld. Nothing unusual about that.\n\nSo make sex work require a consensual qualifying license and/or registration to sell or buy. \n\nTraffickers can't license under-aged or non-consensual workers, brothels and massage parlors have to display their sex-work license. \n\nAnd johns are made to own (and by fees cover the direct societal costs of) their portion of the responsibility for the well-being of the people they want to use as toys.",
            "title_similarity": "0.5804281",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gvdneul",
            "score": -5,
            "text": "Prostitution is a threat to public health and should be discouraged",
            "title_similarity": "0.58119905",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gvcwpww",
            "score": 106,
            "text": "Legalize prostitution, license it, set government health standards, and tax the hell out of it. Between marijuana and prostitution, we should be able to afford healthcare, the infrastructure, and whatever else we can think of.",
            "title_similarity": "0.44353586",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gvc5y5r",
            "score": 9,
            "text": "Wow, I'm impressed. This is pretty big.",
            "title_similarity": "-0.05514981",
            "sentiment_compound": 0.8779
        },
        {
            "id": "gvc4agn",
            "score": 270,
            "text": "Are they trying to get Trump to move back?",
            "title_similarity": "0.40423575",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc9fr3",
            "score": 243,
            "text": "Before reading the article: this is just for the sex workers isnt it?\n\nAfter reading the article:  \n\n>[Manhattan](https://www.independent.co.uk/topic/manhattan) district attorney [Cyrus Vance Jr](https://www.independent.co.uk/topic/cyrus-vance-jr) has announced that his office will no longer prosecute [prostitution](https://www.independent.co.uk/topic/prostitution) and unlicenced massage.  \n>  \n>The move is a big step forward for a growing movement to change how sex work is approached by the [criminal justice system](https://www.independent.co.uk/topic/criminal-justice-system).  \n>  \n>Mr  Vance said in a statement: “Over the last decade we’ve learned from  those with lived experience, and from our own experience on the ground:  Criminally prosecuting prostitution does not make us safer, and too  often, achieves the opposite result by further marginalising vulnerable  New Yorkers.”  \n>  \n>Appearing  virtually in court on Wednesday, Mr Vance asked a judge to dismiss 914  open cases involving prostitution and unlicenced massage.  \n>  \n>In  addition to a further 5,080 cases in which the charge was loitering for  the purpose of prostitution, a move that follows New York State’s repeal  of a statute known as “Walking While Trans” earlier this year.\n\n&#x200B;\n\nyes it does seem to be not prosecuting those that are sex workers, but BONUS! It also removes loitering and trans charges!\n\n&#x200B;\n\nWe should not be prosecuting those that work in the sex industry, no matter what that capacity is. We need legislation to protect them, physically, and both them and their clients health wise.",
            "title_similarity": "0.75052226",
            "sentiment_compound": 0.9237
        },
        {
            "id": "gvc3f0c",
            "score": 935,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvcfw4r",
            "score": 109,
            "text": "Prostitute gets arrested -> gets criminal record -> can’t get a job because of the criminal record -> goes back to prostitution",
            "title_similarity": "0.63721013",
            "sentiment_compound": -0.872
        },
        {
            "id": "gvc6je1",
            "score": 197,
            "text": "The only thing prosecution of prostitution does it make it more dangerous for sex workers.",
            "title_similarity": "0.5104291",
            "sentiment_compound": -0.7645
        },
        {
            "id": "gvc58la",
            "score": 1592,
            "text": "Why are there open cases dating back decades?",
            "title_similarity": "0.4519534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvc2bop",
            "score": 7747,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvc9ao5",
            "score": 469,
            "text": "I mean the fact that there is an industry of escorts for wall street execs that has existed and operated freely for decades should have made this a no-brainer decades ago.",
            "title_similarity": "0.56387866",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvcfezg",
            "score": 8,
            "text": "Watch the police get real interested in sex trafficking suddenly, and use that as an excuse to continue arresting prostitutes even if there won't be prosecution.",
            "title_similarity": "0.50062764",
            "sentiment_compound": 0.6836
        },
        {
            "id": "gvcg4dz",
            "score": 1,
            "text": "Officer, I'm not paying for sex.  I'm shooting an art piece and the actress is being paid.",
            "title_similarity": "0.54932415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvchxu0",
            "score": 1,
            "text": "That's pimpin",
            "title_similarity": "0.22756518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvciqp6",
            "score": 1,
            "text": "This just outdated a bunch of Law and Order SVU episodes even more.",
            "title_similarity": "0.5365827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcj70e",
            "score": 1,
            "text": "Lot of confused Johns about to get the wrong kinda bustin",
            "title_similarity": "0.37479472",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvcjdr5",
            "score": 1,
            "text": "\"Selling is legal. Fucking is legal.\nWhy isn't selling fucking legal?\"\n-George Carlin",
            "title_similarity": "0.40975183",
            "sentiment_compound": 0.1758
        },
        {
            "id": "gvcl6p5",
            "score": 1,
            "text": "I read it as \"stop prosecuting *pollution*\" and was VERY confused.",
            "title_similarity": "0.5726155",
            "sentiment_compound": -0.6732
        },
        {
            "id": "gvcljap",
            "score": 1,
            "text": "If NYC wants to turn it's budget crisis around all it needs to do is legalize and regulate prostitution.",
            "title_similarity": "0.6071346",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvclmf2",
            "score": 1,
            "text": "Decriminalize adults.",
            "title_similarity": "0.52747095",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcltuu",
            "score": 1,
            "text": "ELI5 how is this different from legalising prostitution?",
            "title_similarity": "0.47914356",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcmj7a",
            "score": 1,
            "text": "Glazers need to go back to bed.",
            "title_similarity": "0.41482696",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcmm2r",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.10888073",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvcnfp0",
            "score": 2,
            "text": "Finally joining Europe ey?",
            "title_similarity": "0.26632148",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcnjo3",
            "score": 3,
            "text": "All I can picture with NY lately is when Little Nicky’s brothers first take over NYC.",
            "title_similarity": "0.49424267",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcnzj4",
            "score": 2,
            "text": "First weed, and now hookers? New York got cool as shit real quick.",
            "title_similarity": "0.41124335",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvcouel",
            "score": 2,
            "text": "Weird and I just started watching The Duece on HBO, it super good.",
            "title_similarity": "0.30863407",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gvcovn2",
            "score": 1,
            "text": "Not criticizing the policy, but how does a Prosecutor choose which laws to prosecute?  I don't think a \"policy\" does much to protect prostitutes, should a different \"policy\" come into play.\n\nThe \"oldest profession in the world\" is not prostitution, but its closely-related, evil uncle, politics.\n\nEdited typo",
            "title_similarity": "0.61931545",
            "sentiment_compound": -0.5566
        },
        {
            "id": "gvcp23d",
            "score": 1,
            "text": "And out of the blue, deep red family values conservatives from all over the country fell in love with the big apple again; and fucked as many prostitutes as possible.",
            "title_similarity": "0.43661985",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvcp4kk",
            "score": 1,
            "text": "I mean, all sex is transactional at some level. Why make it a criminal offense. That's just weird when you step back and take a look it.  Hmm...let me rephrase that...",
            "title_similarity": "0.5014899",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gvcp852",
            "score": 2,
            "text": "License. Regulate. Tax. Use the tax money to provide healthcare to these people.",
            "title_similarity": "0.3799013",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcphxg",
            "score": 23,
            "text": "I am happy for this. I remember during the height of stop and frisk, there were many heartbreaking stories of NYPD targeting LGBTQ youth and arresting them for \"prostitution\" or \"soliciting prostitution\". Some of the evidence used against them were the condoms they carried. That is fucked up, counterintuitive and doesn't help the public.",
            "title_similarity": "0.57533157",
            "sentiment_compound": -0.7997
        },
        {
            "id": "gvcpm26",
            "score": 11,
            "text": "Good. I hope that any resources they put into investigating and prosecuting prostitutes they redirect towards investigating and prosecuting human traffickers. That way they can target the actual criminals rather than the victims. Way too many women are forced into prostitution against their will and punishing them for it is just fucked up.\n\nAnd if a woman independently chooses to be a sex worker, good on them. They also don't deserve to be punished.",
            "title_similarity": "0.5491265",
            "sentiment_compound": -0.9062
        },
        {
            "id": "gvcq7yz",
            "score": 1,
            "text": "their politicians must be happy",
            "title_similarity": "0.085570484",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvcq9ow",
            "score": 1,
            "text": "New York really becoming paradise ❤️",
            "title_similarity": "0.28399155",
            "sentiment_compound": 0.6682
        },
        {
            "id": "gvcqb5q",
            "score": 1,
            "text": "Fire!!!",
            "title_similarity": "0.17129192",
            "sentiment_compound": -0.5067
        },
        {
            "id": "gvcqjyh",
            "score": 2,
            "text": "Good!  Now let them create a union. There is so much positive potential for legalizing sex work and almost no negative.",
            "title_similarity": "0.27823508",
            "sentiment_compound": 0.8909
        },
        {
            "id": "gvcqkem",
            "score": 2,
            "text": "In the criminal justice system",
            "title_similarity": "0.23515926",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcqmzv",
            "score": 2,
            "text": "Government has no right to dictate what people do with their bodies likewise what they decide to put in them unless it directly endangers society such as driving while under the influence",
            "title_similarity": "0.53830135",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvcqyio",
            "score": 1,
            "text": "NY showing the way, as always...",
            "title_similarity": "0.11589563",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcqzed",
            "score": 1,
            "text": "It’s about time to regulate sex work in favor of their safety",
            "title_similarity": "0.45145383",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gvcr1lw",
            "score": 2,
            "text": "Scenario; prostitute sells intercourse for $x+$1, John agrees to sell HIS services for $1, so technically both are committing prostitution. \n\nDo both get charged because they’re both on the beneficiary side of the transaction or would neither get charged because they’re both committing prostitution? \n\nI’m not a lawyer - far from it - just curious how that would work.",
            "title_similarity": "0.5653412",
            "sentiment_compound": 0.7644
        },
        {
            "id": "gvcr420",
            "score": 1,
            "text": "Return 42nd to its former glory",
            "title_similarity": "0.32854295",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvcr6c7",
            "score": 1,
            "text": "Good for them.",
            "title_similarity": "-0.064665906",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvcr727",
            "score": 1,
            "text": "Damn, they get weed and hookers? LUCKY!!",
            "title_similarity": "0.3626995",
            "sentiment_compound": 0.3436
        },
        {
            "id": "gvcr7io",
            "score": 1,
            "text": "Prostitution should be legal. Goods in services in the white market are easily regulated and taxed. it also prevents secondary and teritary crimes.",
            "title_similarity": "0.32563332",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvcr9v2",
            "score": 2,
            "text": "Arrest pimps.",
            "title_similarity": "0.49532598",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvcreac",
            "score": 2,
            "text": "Holy shit",
            "title_similarity": "0.090734676",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvcrgk6",
            "score": 2,
            "text": "This should be a state wide thing. This is gonna just funnel a lot of prostitution to Manhattan. Not that I have a problem with sex work, but a lot of people involved are getting abused and shit.  \n\nWe often do just as much harm dilly dallying in the solution, as the problem itself.\n\nSex work simply put shouldn’t be illegal. Especially when you have idolized politicians in office who brag about hookers.",
            "title_similarity": "0.6265463",
            "sentiment_compound": -0.9732
        },
        {
            "id": "gvcrpg7",
            "score": 1,
            "text": "Then just make it legal",
            "title_similarity": "0.1337273",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvcrqrn",
            "score": 1,
            "text": "2021 is turning into an interesting year.",
            "title_similarity": "0.1639774",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvcrr6q",
            "score": 2,
            "text": "WTF you doing with decades old open prostitution cases?",
            "title_similarity": "0.632921",
            "sentiment_compound": -0.6739
        },
        {
            "id": "gvcrtig",
            "score": 5,
            "text": "All I can think is what trillionaire just whitewashed all the Johns in NYC to avoid getting a solicitation charge.",
            "title_similarity": "0.72222495",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvcs2t4",
            "score": 2,
            "text": "So... it’s no longer hard out here for a pimp?",
            "title_similarity": "0.20985596",
            "sentiment_compound": -0.2273
        },
        {
            "id": "gvcs3cm",
            "score": 1,
            "text": "Is this important?",
            "title_similarity": "-0.024043916",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvcs4m5",
            "score": 1,
            "text": "New York looking better every day.",
            "title_similarity": "0.2720045",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvcs9y8",
            "score": 1,
            "text": "It’s still against the law, but w/e ...",
            "title_similarity": "0.3351494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcsapc",
            "score": 1,
            "text": "My moneys no good here?",
            "title_similarity": "0.35299784",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gvcscla",
            "score": 2,
            "text": "This needs to not be on the black market, make it legal and safe",
            "title_similarity": "0.33295396",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gvcsncm",
            "score": 1,
            "text": "Oh nice, so hedge fund guys can go get fucked. Literally this time.",
            "title_similarity": "0.4699655",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvcsqoj",
            "score": 1,
            "text": "I want to see a study how much rape is prevented by prostitution. Certainly some will be prevented by offering sex for money.",
            "title_similarity": "0.5942577",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvcswc0",
            "score": 1,
            "text": "That’s excellent",
            "title_similarity": "-0.09874956",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvcsxs1",
            "score": 10,
            "text": "Sex traffickers and pimps need to be prosecuted, not women who are down on their like trying to make quick cash.",
            "title_similarity": "0.5323656",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvctgwb",
            "score": 1,
            "text": "I'm glad they are changing their approach on certain activities. A step in the right direction!",
            "title_similarity": "0.12087484",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gvctuen",
            "score": 2,
            "text": "So the John's still can't be legal? why though?",
            "title_similarity": "0.37223774",
            "sentiment_compound": -0.1852
        },
        {
            "id": "gvctwcj",
            "score": 1,
            "text": "They should just follow in Scotland footsteps. Legalize it but prohbit advertising it in public. That includes street walkers and such. That way it can be regulated and taxed while also helping to keep the streets clean. \n\nPlus in the end, those in that line of work should not be criminalized.  Sex traffickers and pimps, those that exploit the women should be held accountable.",
            "title_similarity": "0.45342577",
            "sentiment_compound": 0.6956
        },
        {
            "id": "gvctwi1",
            "score": 2,
            "text": "welp this a slightly more interesting tourism campaign than Alaska's free covid shots. Do they get 2 covid shots, do they quarantine, how does that work?",
            "title_similarity": "0.37830007",
            "sentiment_compound": 0.7197
        },
        {
            "id": "gvctzqb",
            "score": 1,
            "text": "Save the hookers. Shoot the pimps.",
            "title_similarity": "0.52404517",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvcu14g",
            "score": 1,
            "text": "So is DC going to do anything about the prostitutes on Capitol Hill?",
            "title_similarity": "0.5532116",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcu2su",
            "score": 2,
            "text": "Good! Now if we can just make all prescription drugs legal at the pharmacy  for adults we can get rid of the cartels. The last few months have been insane at the border, and we’ve lost enough people to fentanyl.",
            "title_similarity": "0.68383646",
            "sentiment_compound": -0.2244
        },
        {
            "id": "gvcu4g2",
            "score": 2,
            "text": "Good.  It's long overdue.  Like thousands of years overdue.\n\nNow the police can actually start busting abusive pimps and Johns. \n\nAnd maybe set up health services to control the spread of disease?\n\nAnd maybe they can set up unions and establish some minimum standards.\n\nAnd start paying taxes into the community, rather than being arrested at a cost to the community.\n\nYou know, like any decent, civilized country would do?",
            "title_similarity": "0.6499068",
            "sentiment_compound": -0.1926
        },
        {
            "id": "gvcua5l",
            "score": 2,
            "text": "Just legalize it already. Sex work is real work.",
            "title_similarity": "0.34529716",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcueg7",
            "score": 1,
            "text": "Anyone else read \"Manhattan to stop Prostituting Prosecution, dismissing cases dating back decades\"?",
            "title_similarity": "0.91265285",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvculmb",
            "score": 2,
            "text": "Bankers need pussy too",
            "title_similarity": "0.41333106",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcultz",
            "score": 1,
            "text": "If selling is legal and fucking is legal. Why isn’t selling fucking legal?",
            "title_similarity": "0.4108601",
            "sentiment_compound": 0.4716
        },
        {
            "id": "gvcuoqe",
            "score": 1,
            "text": "Bout time.",
            "title_similarity": "0.10076444",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcuti9",
            "score": 2,
            "text": "Bout damn time. It’s an outdated law. Especially if escorts are legal.",
            "title_similarity": "0.5149462",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvcuuk9",
            "score": 1,
            "text": "Who knew the expense of taking a taxpayer out of circulation AND THEN spending thousands to house them is a bad idea.",
            "title_similarity": "0.6078955",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvcv2jm",
            "score": 3,
            "text": "They need to regulate it or this is going to send a message for people to pimp up.",
            "title_similarity": "0.3821907",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcv5ll",
            "score": 1,
            "text": "I’m not disagreeing with the policy, but how is this the prosecutor’s decision? Isn’t it their job to enforce the laws that are on the books?\nCould the prosecutors office change public policy by, for example:\nStop prosecuting environmental laws?\nStop prosecuting parental punishment even if it injures a child?\nStop prosecuting trespass if people need shelter or theft if people need food?",
            "title_similarity": "0.53072345",
            "sentiment_compound": -0.9208
        },
        {
            "id": "gvcv7zn",
            "score": 2,
            "text": "Bravo",
            "title_similarity": "0.015372531",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcvm21",
            "score": 2,
            "text": "Wow we are caught up to this century, Oldest profession",
            "title_similarity": "0.32166243",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvcvpcd",
            "score": 2,
            "text": "Good. And in many cases, the woman is the actual victim.",
            "title_similarity": "0.2981999",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvcwmmb",
            "score": 3,
            "text": "LAWLESS POT SMOKING SEX JUNKIES... that, uh, doesn’t sound so bad. Like not the kind of place a freaked out incel would shoot up",
            "title_similarity": "0.55635715",
            "sentiment_compound": -0.744
        },
        {
            "id": "gvcwmml",
            "score": 2,
            "text": "I mean ok that’s great and all, but... it still was? Is there some reason they haven’t until now?",
            "title_similarity": "0.18972912",
            "sentiment_compound": 0.5439
        },
        {
            "id": "gvcx304",
            "score": 1,
            "text": "Based",
            "title_similarity": "0.018564519",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcx81y",
            "score": 1,
            "text": "This is wonderful news.",
            "title_similarity": "-0.06791572",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvcxnog",
            "score": 1,
            "text": "\"dating\"",
            "title_similarity": "0.22411117",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcy72x",
            "score": 3,
            "text": "Time to unionize.",
            "title_similarity": "0.25498798",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcydzs",
            "score": 1,
            "text": "Mom will be thrilled",
            "title_similarity": "0.059090987",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvcyfvc",
            "score": 3,
            "text": "Somehow the mainstream media will weaponize this and make it about race/gender.",
            "title_similarity": "0.33797175",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvcyka9",
            "score": 1,
            "text": "In unrelated news, the Manhattan DA was arrested for solicitation of a prostitute.",
            "title_similarity": "0.6683166",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvczck9",
            "score": 2,
            "text": "Your mom must be so happy",
            "title_similarity": "0.07141467",
            "sentiment_compound": 0.6948
        },
        {
            "id": "gvczqt6",
            "score": 3,
            "text": "Now to the same for weed convictions!",
            "title_similarity": "0.27785623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvczsbg",
            "score": 1,
            "text": "🤘🤘🤘🤘 we love to see it",
            "title_similarity": "-0.08188412",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvczus0",
            "score": 1,
            "text": "I wonder if this includes the John’s too?",
            "title_similarity": "0.25749835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvczvvf",
            "score": 1,
            "text": "I'm not an expert, just another internet philosopher with more opinions than intellect, but I really don't think most women who prostitute themselves do it because it's a career asperation. People need to survive. It's not ethical to continue to enforce laws based on archiac social or religious norms when people are starving and being evicted for lack of money. As if it needs to be said again, we are the wealthiest country in the world, and most people live paycheck to paycheck or in various degrees of poverty. This is punishing people for being poor in a place where there should be no poor. Even legalizing/dispensing low dose of drugs could have a hugely positive effect on our society. Let people get low doses of drugs if they enroll in rehab program. This will cut down on quality of life crimes in an area, and possibly help women who prostitute themselves for drug money, to get help. It's wrong to punish people for things they most likely wish they were not compelled to do. As a society we seem to be ok with that because after all, they're just bad people anyway ...",
            "title_similarity": "0.54336005",
            "sentiment_compound": -0.9546
        },
        {
            "id": "gvd0320",
            "score": 1,
            "text": "Finally",
            "title_similarity": "0.0731198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd07u9",
            "score": 2,
            "text": "I'm torn about this.\n\nFor one, there should be no prohibitions between two consenting adults agreeing to sex for money.  And note \"consenting\" - they have to be able to give consent and give it freely.\n\nAt the same time... this is something that the legislative bodies of the polity should decide, not just someone who decides that they're going to ignore passed law.",
            "title_similarity": "0.55435693",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvd0i6r",
            "score": 1,
            "text": "Elliot Spitzer must be pissed",
            "title_similarity": "0.30294597",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvd0qx0",
            "score": 5,
            "text": "Imagine how boring Night Court would have been without them......",
            "title_similarity": "0.4741888",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvd0smi",
            "score": 1,
            "text": "So will they scrub Night Court from MeTV?",
            "title_similarity": "0.5186575",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd1502",
            "score": 2,
            "text": "Wow legal recreational weed, online gambling, and now prostitution! What a year for New York.",
            "title_similarity": "0.571177",
            "sentiment_compound": 0.68
        },
        {
            "id": "gvd1nd8",
            "score": 1,
            "text": "Better late than never.",
            "title_similarity": "0.3337462",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvd1x0x",
            "score": 1,
            "text": "Damn decades?",
            "title_similarity": "0.36284763",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvd2kgg",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.104819216",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvd3065",
            "score": 2,
            "text": "Well, writing for Law and Order just got a lot more difficult.",
            "title_similarity": "0.39657095",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gvd3hnd",
            "score": 3,
            "text": "Eww",
            "title_similarity": "0.031157382",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd4yzu",
            "score": 1,
            "text": "I am for legalization, but i encourage everybody to read the bullet points of this study.  It was surprising to me.  Extremely challenging issue.\n\nhttps://orgs.law.harvard.edu/lids/2014/06/12/does-legalized-prostitution-increase-human-trafficking/",
            "title_similarity": "0.4342345",
            "sentiment_compound": 0.8569
        },
        {
            "id": "gvd6t7x",
            "score": 1,
            "text": "TIL prostitution is a misdemeanor.",
            "title_similarity": "0.50986624",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd6xks",
            "score": 1,
            "text": "Nice.",
            "title_similarity": "-0.102756046",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvd7m4k",
            "score": 1,
            "text": "So the John’s don’t get fucked twice lol",
            "title_similarity": "0.29210764",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvd7uyv",
            "score": 1,
            "text": "Well I’m glad for all those trespassers who were prostituted",
            "title_similarity": "0.36455908",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvd7xqq",
            "score": 1,
            "text": "What’s when the hoors move in. Doin their little booty dance for the men-folk!",
            "title_similarity": "0.25911885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd80m9",
            "score": 1,
            "text": "Oh my God cyberpunk is actually going to happen",
            "title_similarity": "0.2685176",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvd83ju",
            "score": 1,
            "text": "How can I invest?",
            "title_similarity": "0.20987076",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd84yw",
            "score": 1,
            "text": "But what will the reboot of Night Court use as fodder?\n\n/s",
            "title_similarity": "0.4300261",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd86lm",
            "score": 1,
            "text": "Well it's about 'f*cking' time",
            "title_similarity": "0.3054815",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvd88h0",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.104819216",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvd8kbg",
            "score": 1,
            "text": "So, they legalized weed, now this... I guess it's time to call it New Amsterdam again 😄\n\nGood job NYC!!",
            "title_similarity": "0.5019033",
            "sentiment_compound": 0.8395
        },
        {
            "id": "gvd8m86",
            "score": 1,
            "text": "Ophelia is about to get her record cleaned, much to the dismay of Mortimer and Randolph",
            "title_similarity": "0.43852025",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvd8u1t",
            "score": 1,
            "text": "I bet Eliot Spitzer is pissed.",
            "title_similarity": "0.34903476",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvd8wdi",
            "score": 1,
            "text": "Probably because they need to focus on the skyrocketing murder and theft.",
            "title_similarity": "0.4585163",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gvd8wn3",
            "score": 1,
            "text": "Holy shit, the government actually giving people back some freedom. Not something you see every day.",
            "title_similarity": "0.5350674",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvd97wk",
            "score": 1,
            "text": "“Hey everybody! We’re all gonna get laid!”",
            "title_similarity": "0.25383562",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd988v",
            "score": 4,
            "text": "Hah. Looks like someone’s moving back from Mar a Lago soon...",
            "title_similarity": "0.43245125",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvd9az8",
            "score": 2,
            "text": "I hope this can help people from getting  hurt. Does any body know if you can order a lady  on amazon. Have her delivered to your door? Then put a sticker on her butt and send her back. Just kidding!!!",
            "title_similarity": "0.48460397",
            "sentiment_compound": 0.6341
        },
        {
            "id": "gvd9nrz",
            "score": 1,
            "text": "So does this mean they are legalizing prostitution in manhattan or?",
            "title_similarity": "0.6188914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvd9ylm",
            "score": 1,
            "text": "So fascinating that prostitution is still illegal even in places like LA and NY",
            "title_similarity": "0.61651504",
            "sentiment_compound": 0.4005
        },
        {
            "id": "gvda4au",
            "score": 1,
            "text": "So those girls from decades back are now free to continue their business?",
            "title_similarity": "0.37328798",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvdahzq",
            "score": 1,
            "text": "Does this mean Elliot Spitzer will be governor again?",
            "title_similarity": "0.33996108",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdalun",
            "score": 1,
            "text": "now that's the way to it. Bring back all the things that made NYC great back in the 80s. Prostitution and cocaine, LETS GO!\n\n\n\n\nplease don't kill me, I kid. I only read the title and I know that NYC is struggling. So obvious joke.",
            "title_similarity": "0.6537417",
            "sentiment_compound": 0.8781
        },
        {
            "id": "gvdavfr",
            "score": 2,
            "text": "This is one area where liberal Democrats and Libertarians tend to agree the laws against consensual sex for money between adults is outdated. There are many people in NYC especially that would be Ok with fully legalized and regulated sex work.",
            "title_similarity": "0.59921384",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvdaxux",
            "score": 1,
            "text": "🎉🎉🎉 this is a step in the right direction!!!",
            "title_similarity": "0.009604824",
            "sentiment_compound": 0.8392
        },
        {
            "id": "gvdb4u2",
            "score": 1,
            "text": "I don't understand how NYC works. Can one part of NYC just make this decision without an overriding NYC entity saying no?",
            "title_similarity": "0.52446884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdb6g9",
            "score": 1,
            "text": "It’s about time.",
            "title_similarity": "0.0890014",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdbirb",
            "score": 1,
            "text": "Fuck mugs",
            "title_similarity": "0.39569983",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdbkea",
            "score": 1,
            "text": "Ho ho ho",
            "title_similarity": "0.119490124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdbmzb",
            "score": 1,
            "text": "Yikes",
            "title_similarity": "0.17635426",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdbr76",
            "score": 1,
            "text": "Good. Let people do what they want.",
            "title_similarity": "0.01911802",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvdbtce",
            "score": 2,
            "text": "Finally, women are now truly being empowered.",
            "title_similarity": "0.07786766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvdbto2",
            "score": 2,
            "text": "A teacher once told me that if you are a woman and you can’t make money you aren’t worth shit.",
            "title_similarity": "0.46910164",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvdbu91",
            "score": 1,
            "text": "In other news, travel to NYC up 300%",
            "title_similarity": "0.36971682",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdbyfe",
            "score": 1,
            "text": "Alright!   Where can I go to invest in Manhattan cathouses?!?!",
            "title_similarity": "0.41214824",
            "sentiment_compound": 0.5
        },
        {
            "id": "gvdbywn",
            "score": 1,
            "text": "So I can get laid?",
            "title_similarity": "0.26637727",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdceb1",
            "score": 2,
            "text": "Legalizing sex work only helps middle to upper class white women. Prove me wrong.",
            "title_similarity": "0.57962704",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvdck0b",
            "score": 2,
            "text": "In Norway they have a very good legal system regarding prostitution, the clients can be prosecuted, sexual workers cannot. So it is illegal, yet the most vulnerable people involved are protected by the law.",
            "title_similarity": "0.3920542",
            "sentiment_compound": -0.1987
        },
        {
            "id": "gvdd1a3",
            "score": 1,
            "text": "Lets bring the sex trade back to times square!",
            "title_similarity": "0.53237885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdd5lp",
            "score": 1,
            "text": "About fucking time, no pun intended",
            "title_similarity": "0.27638504",
            "sentiment_compound": -0.3566
        },
        {
            "id": "gvdd664",
            "score": 1,
            "text": "I wonder what wealthy person called in a favor",
            "title_similarity": "0.30384362",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvddbe3",
            "score": 2,
            "text": "Tax it!",
            "title_similarity": "0.29457146",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvddvk1",
            "score": 2,
            "text": "Yay so I can have sex finally!",
            "title_similarity": "0.22659776",
            "sentiment_compound": 0.5707
        },
        {
            "id": "gvddwvs",
            "score": 1,
            "text": "Robert Kraft has entered the chat.",
            "title_similarity": "0.21543905",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdeczc",
            "score": 3,
            "text": "Government should legalized it and tax it as self-employed. Have regulations for safety & move on. Much less headache",
            "title_similarity": "0.43285745",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdenw8",
            "score": 1,
            "text": "What's to stop someone from having sex with a sex worker then just buying a small item from the sex worker instead of paying for the sex? Like, the sex worker sells you a $300 keychain and you just happen to fuck rather than $300 sex services.",
            "title_similarity": "0.6120041",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvdep6v",
            "score": 1,
            "text": "That include politicians?",
            "title_similarity": "0.24892192",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdeuw1",
            "score": 2,
            "text": "Sanity in our justice system?  (Checks around for the other Horsemen of the Apocalypse.)",
            "title_similarity": "0.46629018",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gvdevda",
            "score": 3,
            "text": "They should stop prosecuting sex workers, but if people are being exploited or forced into it (is that sex trafficking?), that should absolutely be prosecuted.",
            "title_similarity": "0.597355",
            "sentiment_compound": -0.9248
        },
        {
            "id": "gvdf3mr",
            "score": 1,
            "text": "OF COURSE it's Manhattan rofl",
            "title_similarity": "0.3523156",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gvdf42x",
            "score": 1,
            "text": "A person has a right to sell their body. What they don't have is the right to sell somebody else's body, so the law should go after the pimps and madams, the people that arrange, exploit, and profit off of the misery of others. I also think pimping should be a capital crime cuz I fucking hate pimps but that's my own little bit of insanity.",
            "title_similarity": "0.5720365",
            "sentiment_compound": -0.875
        },
        {
            "id": "gvdf9wt",
            "score": 2,
            "text": "It’s about time. Legalize prostitution and eliminate pimps and sex trafficking.",
            "title_similarity": "0.65525264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdfaht",
            "score": 1,
            "text": "Well that should certainly delight a host of Manhattan wives!! (go figure)\n\nmelkisadek",
            "title_similarity": "0.30651867",
            "sentiment_compound": 0.8395
        },
        {
            "id": "gvdfd62",
            "score": 2,
            "text": "it's honestly insane that prostitutes themselves are ever charged with prostitution. Like, how the hell is that supposed to benefit or help society at all?",
            "title_similarity": "0.5174844",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvdfgqz",
            "score": 1,
            "text": "Johns get Trowser History Erased?\n\nNope:\n\n>The DA’s office will continue to prosecute other crimes relating to prostitution, including sex trafficking and patronising sex workers.",
            "title_similarity": "0.6420844",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvdfhl4",
            "score": 1,
            "text": "Of course. \n\nEverywhere there are always powerful men among the clients. \nJudges, Police Chief, politicians , Church members , Business men , famous athletes etc ..",
            "title_similarity": "0.20028637",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdfmkd",
            "score": 1,
            "text": "When they find a way to tax it.... it’ll all be legal",
            "title_similarity": "0.22605191",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvdfp04",
            "score": 2,
            "text": "That makes sense!! Legalize services!!",
            "title_similarity": "0.06844086",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdfpid",
            "score": 1,
            "text": "Why aren’t they arresting Instagram hoes that explicitly post their lewd pictures of sexual acts and pricing lists for those specific acts?",
            "title_similarity": "0.5517",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdfsvx",
            "score": 1,
            "text": "It's about time ,maybe NYPD can spend more time training their officers to be professional police officers and also investigating all the gun running from red state and rural gun dealers bring guns into the city.",
            "title_similarity": "0.4939322",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gvdg62w",
            "score": 2,
            "text": "What’s the difference between a pimp and an agent?",
            "title_similarity": "0.44380286",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdghv0",
            "score": 2,
            "text": "They gonna prorate their lost wages from their arrests?",
            "title_similarity": "0.5357231",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvdgkn5",
            "score": 3,
            "text": "There are decades old prostitution cases....that are open?",
            "title_similarity": "0.54335326",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdgnfm",
            "score": 3,
            "text": "In an unrelated story, Matt Gaetz and other big name Republicans are considering political conference in NYC.",
            "title_similarity": "0.5706685",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdherl",
            "score": 4,
            "text": "Just legalize it already. Let adults do what they want with their bodies. Regulate it and drive traffickers out of the market.",
            "title_similarity": "0.5673561",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvdhl43",
            "score": 3,
            "text": "I always found it weird that prostitution was illegal but porn isn’t.  It’s the same thing.",
            "title_similarity": "0.45998734",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gvdhnkf",
            "score": 2,
            "text": "I need to invest in Manhattan hotels. There will be tons more occupancy.",
            "title_similarity": "0.41508406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdi1l3",
            "score": 2,
            "text": "Finally",
            "title_similarity": "0.0731198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdi6jo",
            "score": 3,
            "text": "Sounds to me like some judges and lawyers have something to hide...OR who the fuck cares as long as its not hurting anyone. Dont like prostitutes, dont hire one. Making it legal makes it safer and clean up the streets by adding legal protections and regulating the market.",
            "title_similarity": "0.56340235",
            "sentiment_compound": 0.8247
        },
        {
            "id": "gvdiezv",
            "score": 1,
            "text": "I think Nevada had this figured out decades ago.",
            "title_similarity": "0.4314406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdif3b",
            "score": 3,
            "text": "Don’t prosecute sex work, prosecute human trafficking!",
            "title_similarity": "0.5479895",
            "sentiment_compound": -0.69
        },
        {
            "id": "gvdifjv",
            "score": 1,
            "text": "Velvet Jones approves.",
            "title_similarity": "0.099004455",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvditxg",
            "score": 1,
            "text": "what about the Jhons?",
            "title_similarity": "0.20399722",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdj0q7",
            "score": 1,
            "text": "Elliot Spitzer dislikes this post",
            "title_similarity": "0.34151077",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvdj3mi",
            "score": 1,
            "text": "The Johns too?",
            "title_similarity": "0.18814321",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdj9ot",
            "score": 1,
            "text": "finally ppl come to their senses.",
            "title_similarity": "0.0882646",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdjepp",
            "score": 3,
            "text": "\"Hey Grandma, a guy called. He said they're dismissing all your cases from the 80's. What is he talking about?\"",
            "title_similarity": "0.72315335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdjfeq",
            "score": 3,
            "text": "Besides conservatives hating anything to do with sex unless it’s a subservient wife and her husband, why the fuck is prostitution banned, it’s two consenting adults, if it’s only money, illegal, but if it’s filmed than put online, it’s a major industry",
            "title_similarity": "0.6495396",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gvdjfvt",
            "score": 1,
            "text": "That’s one step, but I’m not sure what that has to do with curtailing their harassment by law enforcement, or getting the police to actually protect them. It’s a start, though.",
            "title_similarity": "0.4163822",
            "sentiment_compound": -0.5849
        },
        {
            "id": "gvdjqu6",
            "score": 1,
            "text": "Make prostitution legal!",
            "title_similarity": "0.38874197",
            "sentiment_compound": 0.2003
        },
        {
            "id": "gvdjseq",
            "score": 1,
            "text": "Would never pay for sex lawl but those that want to should be able to as long as it’s consensual. Those that want to offer it, should be able to offer it, sometimes it’s easier to give a blow job then work an 8-10 hour shift....",
            "title_similarity": "0.55339336",
            "sentiment_compound": 0.7542
        },
        {
            "id": "gvdjt14",
            "score": 1,
            "text": "As it should be. Now to marijuana",
            "title_similarity": "0.23633698",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdjuny",
            "score": 2,
            "text": "Well there goes half the ID Network’s fall lineup.",
            "title_similarity": "0.39659765",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvdjx20",
            "score": 2,
            "text": "I love how this is phrased:\n\n> Mr Vance said in a statement: “Over the last decade we’ve learned from those with lived experience, and from our own experience on the ground: criminally prosecuting prostitution does not make us safer, and too often, achieves the opposite result by further marginalising vulnerable **New Yorkers**.”\n\n\nNew Yorkers, not prostitutes...\n\nAt the same time, this seems to only apply to half the people involved:\n\n>The DA’s office will continue to prosecute other crimes relating to prostitution, including sex trafficking and **patronising sex workers**.\n\n>Advocates for sex workers oppose the prosecution of customers.\n\nDoesn't seem to matter what organized sex workers actually want. \n\nBy the patronising means the following:\n\nA person commits the offense of Patronizing a Prostitute when they knowingly perform any of the following acts with a person not his or her spouse:\n\n    *Engages in an act of sexual penetration with a prostitute\n\n    *Enters or remains in a place of prostitution with the intent to engage in an act of sexual penetration\n\n    *Engages in any touching or fondling with a prostitute of the sex organs of one person by the other person, with the intent to achieve sexual arousal or gratification.",
            "title_similarity": "0.6748028",
            "sentiment_compound": 0.3387
        },
        {
            "id": "gvdkft8",
            "score": 1,
            "text": "It all started with Krasner of Philly.",
            "title_similarity": "0.27526864",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdkmep",
            "score": 1,
            "text": "But won't this mean that women now own their bodies and are no longer the legal property of men?\n\nIf we legalize prostitution then women get to share in the power men have.\n\nAn no I'm not a christian conservative writing this unironically. It is satirical.",
            "title_similarity": "0.61673486",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gvdkwwi",
            "score": 1,
            "text": "Fucking he’ll yeahs",
            "title_similarity": "0.09004556",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdl0ue",
            "score": 2,
            "text": "Imagine being prosecuted and going to jail for being forced to do something so dehumanizing in order to survive.",
            "title_similarity": "0.51319957",
            "sentiment_compound": -0.874
        },
        {
            "id": "gvdl3mh",
            "score": 1,
            "text": "Hey oldest profession in the books! 🤷‍♀️Let them be!💃",
            "title_similarity": "0.37316442",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdl67q",
            "score": 3,
            "text": "Bet Robert Kraft had something to do with this so he doesn’t have to go to Florida anymore",
            "title_similarity": "0.45918423",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdl6wd",
            "score": 1,
            "text": "And they said pimpin wasn’t easy",
            "title_similarity": "0.41288677",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvdl78p",
            "score": 1,
            "text": "I honestly hope a more lax prostitution policy/approach helps the incel problem. If there’s a population of incels in Manhattan lol. But if this spreads to other cities/states, I think it could help ‘ease their tensions’",
            "title_similarity": "0.5743505",
            "sentiment_compound": 0.81
        },
        {
            "id": "gvdld9o",
            "score": 1,
            "text": "Cuomo might get a pass for that. At least lol.  There love gov has got to go!",
            "title_similarity": "0.35543287",
            "sentiment_compound": 0.807
        },
        {
            "id": "gvdle91",
            "score": 1,
            "text": "I had hope for the modern man til I read the comment after joy in the headline. Basically, being there are more numbers in men inquiring the services than women providing them. you can effect more people by going after those that want the goods, so to speak. And also, it would make the sting operations extra illegal. The ones in which they have female cop pose as a prostitute and secure a deal then a bunch of cops swarm the guy. Basically, this is the new norm in policing.",
            "title_similarity": "0.5441241",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvdlhq3",
            "score": 1,
            "text": "Leave it to “the land of the free” to criminalize the most basic part of our natural biology besides eating food and drinking water.",
            "title_similarity": "0.4118741",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvdlmbd",
            "score": 1,
            "text": "Got to do something to bring back the tourists.",
            "title_similarity": "0.34381068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdmf0y",
            "score": 2,
            "text": "It’s outrageous to women to prosecute prostitution. Women are free to do with their body whatever they want to, including selling sex. God news.",
            "title_similarity": "0.48178068",
            "sentiment_compound": -0.0
        },
        {
            "id": "gvdmf3t",
            "score": 2,
            "text": "Let’s stop prosecution of prostitution and start ousting the obscenity that is human trafficking/modern day slavery.",
            "title_similarity": "0.64342046",
            "sentiment_compound": -0.8807
        },
        {
            "id": "gvdmn7d",
            "score": 1,
            "text": "Prostitution dating back decades? Those prostitutes must be in a nursing home right now.",
            "title_similarity": "0.5732976",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdmswa",
            "score": 1,
            "text": "But you’re still arresting the buyers, THIS IS NOT FAIR!",
            "title_similarity": "0.4957809",
            "sentiment_compound": -0.5497
        },
        {
            "id": "gvdn26q",
            "score": 5,
            "text": "Good news for your mom.",
            "title_similarity": "0.13765378",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvdn6rs",
            "score": 1,
            "text": "Unless, of course, they are prosecuting minorities, poor people or unsavory types.",
            "title_similarity": "0.36920753",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gvdng2x",
            "score": 1,
            "text": "Policing prostitution is archaic and does nothing to improve the health and livelihood of sex workers, and prevent the spread of sti's.",
            "title_similarity": "0.6128006",
            "sentiment_compound": -0.1295
        },
        {
            "id": "gvdnnwj",
            "score": 1,
            "text": "Is Manhattan somehow separate from the rest of New York City that it can do this, or is it just a shitty headline?\n\nStill very happy to see this.",
            "title_similarity": "0.5097075",
            "sentiment_compound": 0.101
        },
        {
            "id": "gvdnq1k",
            "score": 1,
            "text": "It’s my time to shine",
            "title_similarity": "0.023374723",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdnx12",
            "score": 1,
            "text": "Yeah but let’s just arrest their customer base? A step in the right direction but still not out of the woods there yet.",
            "title_similarity": "0.6182668",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvdo3wk",
            "score": 2,
            "text": "So SF did this in the 70s, and the residents were largely behind it.  But then it not only spilled out onto almost every street, SF became a tourist attraction for people coming in from all over the area to get BJs in their cars.\n\nSo While I'm totally on board with the idea here, there needs to be some zoning and regulation, so to speak.",
            "title_similarity": "0.4974488",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvdougr",
            "score": 2,
            "text": "fuck the nordic model",
            "title_similarity": "0.38274014",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvdpxrs",
            "score": 1,
            "text": "Oh wow, actual breaking news.",
            "title_similarity": "0.30962098",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvdq930",
            "score": 1,
            "text": "r/dating is full of zooloos 😳",
            "title_similarity": "0.22114846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdqxqs",
            "score": 1,
            "text": "It’s about time",
            "title_similarity": "0.09644089",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdr50p",
            "score": 1,
            "text": "> “It’s time for Dida to return!!!",
            "title_similarity": "0.24286452",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdr77t",
            "score": 1,
            "text": "It's happening!!!",
            "title_similarity": "-0.013875188",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdr7dw",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.10888073",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdrhky",
            "score": 3,
            "text": "news at 11:  see why onlyfans accounts in new york have tripled.",
            "title_similarity": "0.43961066",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdrjj5",
            "score": 2,
            "text": "Never understood why it's not completely legal. Then regulated and taxed.",
            "title_similarity": "0.49627507",
            "sentiment_compound": -0.1498
        },
        {
            "id": "gvdrkza",
            "score": 2,
            "text": "Paying for sex should be regulated and legal",
            "title_similarity": "0.29915047",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvds58u",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.10888073",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdst4q",
            "score": 2,
            "text": "As fun as it is to say “prosecuting prostitution” I completely agree with this position and it’s nice to see. Let’s go a little further and see more jurisdictions legitimize the occupation so as to extend health and safety protection to those workers as well though.",
            "title_similarity": "0.3598889",
            "sentiment_compound": 0.9294
        },
        {
            "id": "gvdsvka",
            "score": 1,
            "text": "Wow! A lot of fixers for Wall Street will lose jobs.",
            "title_similarity": "0.63726735",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gvdsx2m",
            "score": 1,
            "text": "Fucking good. These women have it hard enough as it is.",
            "title_similarity": "0.14617409",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gvdtuc7",
            "score": 1,
            "text": "*cries in Dick Wolf*\n\nNow what are Olivia and Finn going to do?\n\nSeriously though, am I right in thinking that this hasn't actually made sex work legal in Manhattan? Just because the DA won't file charges, doesn't mean it's now legal, right? So they could still get arrested, but it would be a waste of everyone's time. Or how wrong am I?",
            "title_similarity": "0.6626194",
            "sentiment_compound": -0.9232
        },
        {
            "id": "gvdtybd",
            "score": 1,
            "text": "Well .... They need to regulate  SexWork like the Porn Industry or \nMaybe Nevada ....\nAll involved need to be tested treated\nAccess to medical treatment ....\nActivities and business in defined\nAreas .... All the mechanics to \nRunning a wide variety of sexual \nProfessions .....\nIn the open .... safe .... clean etc ....\n\nTime for another little blue pill\nAnd back to the grind ....\n\n👍👍👍",
            "title_similarity": "0.453286",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gvdu05p",
            "score": 1,
            "text": "Great article with a happy ending. 😍",
            "title_similarity": "0.07033545",
            "sentiment_compound": 0.8957
        },
        {
            "id": "gvduerb",
            "score": 2,
            "text": "Imagine living in a country where prostitution is illegal",
            "title_similarity": "0.51516986",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvdvx8y",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.38147765"
        },
        {
            "id": "gvdwl5e",
            "score": 1,
            "text": "Hasn’t really any feature that’s worth prosecuting",
            "title_similarity": "0.3329975",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvdx7ba",
            "score": 1,
            "text": "Of all things 4 the statists 2 outlaw, they chose consensual sex",
            "title_similarity": "0.47021884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdxmsi",
            "score": 1,
            "text": "Yey! Now go after everyone involved with Epstein!!!!’ In Florida AND New York!",
            "title_similarity": "0.4801445",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdyhfz",
            "score": 1,
            "text": "Good on them!",
            "title_similarity": "-0.08599512",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gvdyhs7",
            "score": 2,
            "text": "Maybe we can get medical grade hookers now",
            "title_similarity": "0.3872274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdz0gp",
            "score": 1,
            "text": "Nice, about 4 years behind Philly and it’s worked tremendously here.",
            "title_similarity": "0.24041077",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvdz6hz",
            "score": 1,
            "text": "Gotham city?",
            "title_similarity": "0.35483158",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvdzb8u",
            "score": 1,
            "text": "Cars are legal to posses and there is a giant industry that produces them, but driving is prohibited",
            "title_similarity": "0.44773012",
            "sentiment_compound": 0.0644
        },
        {
            "id": "gvdzfwr",
            "score": 3,
            "text": "Legalize and regulate prostitution and drugs. \nEveryone wins, in time. Compared to keeping what we currently have with no end in sight and only insanely depressing statistics to never change",
            "title_similarity": "0.54193187",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvdzl5n",
            "score": 3,
            "text": "Legalize it and give people safe environments to work in. Same with the customers - mandatory background checks and health checks would go a long way to protect vulnerable populations. Time to grow up and stop pretending sex work isn’t happening everywhere. Treat it like a public health matter, which it is, tax it, and stay out of the business of consenting adults.",
            "title_similarity": "0.5513135",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gvdzzih",
            "score": 1,
            "text": "Whoa",
            "title_similarity": "-0.025753736",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve224m",
            "score": 2,
            "text": "Time to eradicate marijuana charges as well.",
            "title_similarity": "0.5368533",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve2ivb",
            "score": 1,
            "text": "Ayyyyeeee, backpage open again?",
            "title_similarity": "0.18596008",
            "sentiment_compound": 0.0
        },
        {
            "id": "gve3qpm",
            "score": 2,
            "text": "The Epsteins and Gaetzs' of the world throwing parties like the closing of ReturnoftheJedi",
            "title_similarity": "0.52498215",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gve4h2l",
            "score": 1,
            "text": "Just Manhattan?  clears the way for eros.com to really blow up in NYC lol",
            "title_similarity": "0.5846006",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gve53vv",
            "score": 1,
            "text": "Why is prostitution illegal?",
            "title_similarity": "0.49182558",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gve5fda",
            "score": 2,
            "text": "Good. Most of the prostitutes are victims themselves, and even if they're not victims...f someone wants to sell their body for sex, it has nothing to do with me.",
            "title_similarity": "0.6115433",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gve6dn8",
            "score": 1,
            "text": "Cool, road trip!",
            "title_similarity": "0.17331478",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gve6rlt",
            "score": 3,
            "text": "I hope they go after the pimps.  \n\n\nWomen in it of their own volition AND with options \"out\" are one thing, but black markets see to it that these are not the majority of \"services available\"-- and the abusers can't simply be let off simple as that.",
            "title_similarity": "0.5316489",
            "sentiment_compound": -0.6059
        },
        {
            "id": "gve76vq",
            "score": 3,
            "text": "Can we just decriminalize prostitution completely for fucks sake?! Get Christianity out of the law already!!",
            "title_similarity": "0.652073",
            "sentiment_compound": -0.6433
        },
        {
            "id": "gve9nt1",
            "score": 1,
            "text": "r/libertarian",
            "title_similarity": "0.14797765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvea01l",
            "score": 2,
            "text": "Maybe a controversial thought but like the war on drugs, I believe prostitution should be legalized and regulated - like how Singapore does it. The girls do their job by choice, get tested regularly, and practice safe sex will greatly reduce all the problems and illicit activities while reducing crime rate and just general sexual tension in the population (IMO a lot of crimes such as rape or domestic abuse would be decreased dramatically)",
            "title_similarity": "0.52618396",
            "sentiment_compound": -0.9719
        },
        {
            "id": "gveaekm",
            "score": 2,
            "text": "If both parties are happy at the end, no harm no foul.. tax it.\n\nThe Dutch and the Germans had figured this shit out decades ago.",
            "title_similarity": "0.45967588",
            "sentiment_compound": 0.7085
        },
        {
            "id": "gveafhk",
            "score": 3,
            "text": "A lot of women died due to the laws on the books now. This is a good thing",
            "title_similarity": "0.43234757",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvedtzc",
            "score": 2,
            "text": "Woo hoo sex workers!!!",
            "title_similarity": "0.3614365",
            "sentiment_compound": 0.6093
        },
        {
            "id": "gvedvph",
            "score": 1,
            "text": "Female prostitution. Male prostitution will remain illegal.",
            "title_similarity": "0.61620855",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gveeolz",
            "score": 2,
            "text": "It’s about time dude",
            "title_similarity": "0.14312623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveh0rd",
            "score": 1,
            "text": "4,000 politicians just found out they’re not allowed back at home.",
            "title_similarity": "0.6024635",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvejmc3",
            "score": 1,
            "text": "Well I think that's not fair, anyway I need one sweet sugar baby, chat me up if you're Interested",
            "title_similarity": "0.33812183",
            "sentiment_compound": 0.7039
        },
        {
            "id": "gvelegf",
            "score": 1,
            "text": "So now you can smoke a blunt out in the street and pick up some ladies of the evening, all with no consequence? I guess we're really progressive now.",
            "title_similarity": "0.46260658",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvempvd",
            "score": 3,
            "text": "As an American, why are are Americans so hung up on sex? There is so much effort and expense put into prohibiting sex. People like sex. Always have, always will. There are a million reasons to justify pro services and making it shady and risky makes it shady and risky. The sex trade will just go underground. Private clubs, escort services, modeling agencies, strip clubs, etc will flourish and LEO & mob will profit from payoffs and protection.",
            "title_similarity": "0.577386",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvemzk2",
            "score": 1,
            "text": "*NOW* they tell me?! Just when I'm about to retire!",
            "title_similarity": "0.5255665",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveodhk",
            "score": 4,
            "text": "Sex work shouldn’t be illegal. 🤷🏻‍♀️",
            "title_similarity": "0.2736824",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gveoe6n",
            "score": 1,
            "text": "Pimps boutta be pimpin!",
            "title_similarity": "0.32886112",
            "sentiment_compound": 0.0
        },
        {
            "id": "gveolop",
            "score": 1,
            "text": "Wall street are partying now",
            "title_similarity": "0.29588008",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gveplgo",
            "score": 1,
            "text": "This is one of the charges they were going to bring against tru^^p? Idk just spit ballin’ guys",
            "title_similarity": "0.42420334",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gveu1t6",
            "score": 3,
            "text": "So many ignorant comments. This doesn’t mean sex work is legal, it means it’s not going to be prosecuted. If you think every city in the US doesn’t already have girls working in it, you’re blind. As an escort that travels for work almost constantly, I think I’d know. This only means they won’t charge us. This doesn’t mean police won’t arrest us, get us kicked out of hotels, steal our money, use our phones to set up other girls or our clients, take over our social media accounts with our stolen phones, post our photos on the media, hold sting operations in order to “find those being trafficked” or a number of other crimes constantly committed against us. So joke all you want, but police are often just as harmful to us as those who think we’re disposable, and some don’t think twice about killing us. \nOne step forward, usually is followed by 2 steps back.",
            "title_similarity": "0.6122042",
            "sentiment_compound": -0.9063
        },
        {
            "id": "gvewhyg",
            "score": 1,
            "text": "Legalize it!! As long as they are doing it voluntarily they could be paying taxes and have different sanitary/health conditions.",
            "title_similarity": "0.3998389",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvewt92",
            "score": 3,
            "text": "Oldest gig in human history... still ilegal,  never understood this ... while living in Belgium , condemning prostitution is Insaine :))",
            "title_similarity": "0.66940093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf0oeo",
            "score": 2,
            "text": "Fuck yes. Trans equality. Leggo",
            "title_similarity": "0.16209227",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvf2s77",
            "score": 1,
            "text": "Should come in handy.",
            "title_similarity": "-0.05215524",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvf3urd",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.10888073",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvffvjj",
            "score": 1,
            "text": "Well damn, now marjorie taylor green gets a pass :(",
            "title_similarity": "0.21678814",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvfjoys",
            "score": 2,
            "text": "That’s awesome. I can stop calling myself John Doe.",
            "title_similarity": "0.33072424",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvfo1rk",
            "score": 1,
            "text": "This has always been a massive waste of police resources. Legalize prostitution and focus on violent crimes.",
            "title_similarity": "0.59746325",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gvfoesm",
            "score": 1,
            "text": "Officials just want people to come back to NYC! If it's for the purpose of picking up a hooker, so be it.",
            "title_similarity": "0.57356584",
            "sentiment_compound": 0.1511
        },
        {
            "id": "gvfwb4r",
            "score": 1,
            "text": "Honestly might be a good thing idk. Might help stop sex trafficking or increase it. It could be a good or bad but sure they will just make people get a sex workers license or something. There is always money behind people who are pushing evil among us.",
            "title_similarity": "0.5140556",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvfwul0",
            "score": 2,
            "text": "Paying for things is legal.  Fucking is legal.  Why is paying for fucking illegal?  - George Carlin",
            "title_similarity": "0.35583168",
            "sentiment_compound": -0.3848
        },
        {
            "id": "gvfwyv3",
            "score": 1,
            "text": "Now if they would do the same for human trafficking it could become a Republican paradise",
            "title_similarity": "0.42327327",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvg8060",
            "score": 1,
            "text": "Bonk",
            "title_similarity": "0.14430538",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvgbhtz",
            "score": 1,
            "text": "First read this as prosecuting prosecutors, glad I clicked the article",
            "title_similarity": "0.35398525",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvgfrsk",
            "score": 1,
            "text": "I know it's an unpopular opinion on Reddit but prostitution is not a victimless crime.  Yes some women choose to do it but some women choose to do it cuz that's the only option they have to live. I work in an industry where I see it and it is heartbreaking seeing it happen. 90% of women would choose not to do it if they had a choice. Help the people Force into prostitution and prosecute the people that support a horrible industry.  If well regulated yes it could work out but right now it's too dangerous to the people that are forced to prostitution whether due to coercion or by economic choice.",
            "title_similarity": "0.5762526",
            "sentiment_compound": -0.3593
        },
        {
            "id": "gvglm1f",
            "score": 1,
            "text": "John's beware.... it's a trap!",
            "title_similarity": "0.3418253",
            "sentiment_compound": -0.3802
        },
        {
            "id": "gvgr1m2",
            "score": 1,
            "text": "The real news is the dating back decades, why were they still in arbitration for decade or more? What a fukking scam",
            "title_similarity": "0.6196443",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvgxrca",
            "score": 1,
            "text": "Besides human trafficking, I don’t see the issue in safe prostitution",
            "title_similarity": "0.46939704",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvhb3la",
            "score": 1,
            "text": "Ha. Good one.",
            "title_similarity": "-0.0615083",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvi14vu",
            "score": 1,
            "text": "They should stop prosecuting prostitutes. This has been going on since the beginning of time! It is a profession, if that is what they want to do with their life, so be it! Leave them alone!",
            "title_similarity": "0.73694456",
            "sentiment_compound": -0.6416
        },
        {
            "id": "gvkld5d",
            "score": 1,
            "text": "Baby steps, I guess.",
            "title_similarity": "0.06853346",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvkxi7a",
            "score": 1,
            "text": "How can a political party be so strong in their opposition of misogyny and the objectification of women, but also call for the legalization of prostitution?",
            "title_similarity": "0.5356143",
            "sentiment_compound": 0.4848
        },
        {
            "id": "gwfisq7",
            "score": 1,
            "text": "It's sad to see this is still problematic after so many decades of efforts to improve the situation. The fight for 'reform' or 'legalisation' is always a losing one. Decriminalization is the only way to go. Sex work is work. The values, motives, and decisions of individuals is private and not a proper subject for legislation.",
            "title_similarity": "0.6253277",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gwqg9kh",
            "score": 2,
            "text": "How is ethically possible to prosecute the “buyer” of an illegal service while simultaneously refusing to prosecute the “seller”?",
            "title_similarity": "0.5029703",
            "sentiment_compound": -0.8934
        },
        {
            "id": "gxmwvkq",
            "score": 1,
            "text": "More lawlessness. 🤦‍♂️",
            "title_similarity": "0.35402137",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8xj6x",
            "score": 1,
            "text": "Either strike the laws from the book or enforce them. Period.",
            "title_similarity": "0.5083678",
            "sentiment_compound": -0.128
        },
        {
            "id": "gyfvckt",
            "score": 1,
            "text": "a big step forward! sex workers will be able to conduct their business in safer conditions instead of putting themselves in risky situations.",
            "title_similarity": "0.32386875",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h2x2qgd",
            "score": 1,
            "text": "Meanwhile, my conviction for jumping a turnstile from 40 years ago still stands. At least I got to meet Judge Jerry Sheindlin - Judge Judy’s husband!",
            "title_similarity": "0.4511748",
            "sentiment_compound": 0.0
        }
    ]
}