{
    "Calls Mount for Biden to Form Presidential 1/6 Commission After GOP's 'Cowardly Filibuster'\n": [
        {
            "id": "gzw9prj",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.5451981",
            "sentiment_compound": -0.6537
        },
        {
            "id": "gzwuy1r",
            "score": -21,
            "text": ">spend years lamenting about how trump's justice department is out of control \n\n>.02 seconds after biden is sworn in\n\n>JUST CANCEL STUDENT DEBT VIA EA, IGNORE CONGRESS, LAUNCH YOUR OWN SPECIAL INVESTIGATIONS AND CIRCUMVENT THE SENATE\n\nIronic considering the group throwing a fit about the end of democracy wants to do everything they can to circumvent our system of checks and balances to further their political narrative",
            "title_similarity": "0.76398885",
            "sentiment_compound": -0.5213
        },
        {
            "id": "gzwzxgw",
            "score": 5,
            "text": "Anyone who voted against literally the only violent attack on our Capitol in the country’s history is considered a traitor in my view.  Like 100%.  There is zero reason any person elected to Congress should ever be against an investigation for this type of openly treasonous activity.",
            "title_similarity": "0.56973153",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gzwcod4",
            "score": 9,
            "text": "I am so surprised by the lamewrist actions of the Democrats.        \nI can not understand why they are so hesitant to fight.",
            "title_similarity": "0.4947781",
            "sentiment_compound": -0.4568
        },
        {
            "id": "gzwk7es",
            "score": -28,
            "text": "Who the fuck cares, healthcare, housing, and a livable planet now.",
            "title_similarity": "0.288256",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzwwjkz",
            "score": -27,
            "text": "The top comments are pure delusional thinking. This is just a leftist circle jerk.",
            "title_similarity": "0.5304855",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzx0oxk",
            "score": -4,
            "text": "Y’all would be complaining if the gop had the majority and we’re trying to push through their political agenda. Don’t be hypocrites guys. The filibuster is there for a reason. Just becuz it doesn’t benefit you now doesn’t me it won’t sometime in the future.",
            "title_similarity": "0.668683",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzwj206",
            "score": -7,
            "text": "Joe needs to get out the Executive Order book and release the DOJ dogs of war and investigate and charge every QGP-tRump ass licker. Expose them for the cowards that they are.",
            "title_similarity": "0.6126823",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gzwrko4",
            "score": 3,
            "text": "I'm not sure if i agree with this. The justice department is currently investigating crimes. The FBI has already been aware of the threat of right wing extremists, and the FBI is using the criminal justice system to disrupt criminal terrorist organizations. \n\nThe last thing i want is homeland security investigating citizens.. guilty or not guilty.",
            "title_similarity": "0.5463495",
            "sentiment_compound": -0.7453
        },
        {
            "id": "gzwo9x3",
            "score": -1,
            "text": "As much as I want the investigation, it is not going to happen. Government officials are not going to ever agree to have their crimes looked into. It’s like if I robbed a bank but I got to decide if the robbery was going to even be looked at legally, of course I would vote no. Also if it is looked at, nothing will come from it. The report will be redacted and no big names will ever go down.",
            "title_similarity": "0.4825108",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gzx7x0j",
            "score": -1,
            "text": "You Americans are fucking dumb, the DNC and GOP are sides of the same coins, why are you ignorant to this simple fact.",
            "title_similarity": "0.4547903",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gzwtzfw",
            "score": 2,
            "text": "Calls? By whom? People who want to set a trap for Biden? People who don’t know how the process works? I swear this is Republican planted ridiculousness. Who the fuck other than people who want Biden to lose in 2024 would EVER WANT TO ASSOCIATE HIM WITH THIS GRENADE? \n\nActual solution: Pelosi should form her special committee and invite the non-insane Republicans to participate.\n\nEdit: typo",
            "title_similarity": "0.70132774",
            "sentiment_compound": -0.5464
        },
        {
            "id": "gzxszia",
            "score": 0,
            "text": "Calls mount for a President who doesn’t perv on children.",
            "title_similarity": "0.5718622",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsuqw",
            "score": -3,
            "text": "Or just end the filibuster? Why pretend anyone but Democrats are actually preventing this from happening?",
            "title_similarity": "0.58682066",
            "sentiment_compound": -0.1803
        },
        {
            "id": "gzwuagy",
            "score": -47,
            "text": "The Dems want to blow 1/6 out of proportion.  The Left had been rioting and looting all summer long.  We need to investigate election fraud.",
            "title_similarity": "0.6223095",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwwaej",
            "score": -19,
            "text": "A riot commission that ignores 300+ violent riots attacking federal officers & federal facilities, but investigates only one specific riot isn't a riot commission.  It's a politically driven witch hunt, and an act of open corruption.",
            "title_similarity": "0.53238976",
            "sentiment_compound": -0.9138
        },
        {
            "id": "gzwrov1",
            "score": -6,
            "text": "Blame the cowardly Dems who refuse to nuke the filibuster.",
            "title_similarity": "0.48786655",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzwe71c",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzwbr13",
            "score": 5,
            "text": "I wouldn’t count on it. Biden seems intent on not going after the guy who continues to wage war on the US.",
            "title_similarity": "0.51854366",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzwz30p",
            "score": -10,
            "text": "Biden has had 5 months to do fucking *something* about the massive problems undercutting our country and so far he's too much of a complacent pussy to get anything done. \n\nAnd don't act like the vaccination rollout was all his doing. If you don't give trump credit because the vaccines were out of his corner, you can't go give Biden credit when it keeps following the same path. \n\nDemocrat incompetence is going to lose them the midterms, just like they lose *every fucking midterm* when they are given any power. \n\n\n\"Oh no but the 2020 election was close we can't go stepping on toes\". How about voter reform that lets people actually fucking vote. Republicans account for like 40% of the country but Democrats are so fucking inept that they just let republican states strip voter rights, then say they can't do anything because the margins are now thin in states that republicans break the law. \n\nGive me a fucking break, I'm tired of this shit.",
            "title_similarity": "0.5939778",
            "sentiment_compound": -0.9176
        },
        {
            "id": "gzx61c2",
            "score": 0,
            "text": "Bootlickers the lot of you",
            "title_similarity": "0.2873382",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx570f",
            "score": -16,
            "text": "I’m just wondering why riots killing more people aren’t being currently investigated and shut down in other states",
            "title_similarity": "0.47478014",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gzwj5w5",
            "score": -2,
            "text": "Isn’t that Pelosi’s job?\n\nBut yes I agree. I also approve of the strategy of getting Republicans on record as supporting fascist violence.",
            "title_similarity": "0.46753114",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzx5ysx",
            "score": -1,
            "text": "Upvote if a 1 party government sounds really good right now, or at least a two state solution.",
            "title_similarity": "0.42101187",
            "sentiment_compound": 0.8016
        },
        {
            "id": "gzxo2j4",
            "score": -1,
            "text": "Most left wing board on Reddit strikes again.",
            "title_similarity": "0.50374645",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzyv0j0",
            "score": -2,
            "text": "Those who supported violent protests, mad because there is no commission to investigate a violent protest. Film at 11.",
            "title_similarity": "0.45051327",
            "sentiment_compound": -0.93
        },
        {
            "id": "gzx6esm",
            "score": -15,
            "text": "what a joke and a waste of tax payer money. funny how they act like this was so bad yet BLM terrorists are looting and burning cities including federal buildings and nobody gives a shit. woke liberals are too busy canceling kids books to to realize how much worse BLM is than anything that happened on the 6th.",
            "title_similarity": "0.54027486",
            "sentiment_compound": -0.9098
        },
        {
            "id": "gzwsilc",
            "score": 0,
            "text": "Y’all are seething",
            "title_similarity": "0.26648903",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx3kmc",
            "score": 0,
            "text": "When will the Democrats propose a health care bill?",
            "title_similarity": "0.48132086",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxa4is",
            "score": 0,
            "text": "Literally is Jeff Dunam’s doll LOL",
            "title_similarity": "0.3455933",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gzxsxfs",
            "score": 0,
            "text": "Idk about you guys but when a group of people takeover a couple of square blocks with AR-15s for a few months. . . That sounds more insurrection or civil war attitude to me.",
            "title_similarity": "0.5846453",
            "sentiment_compound": -0.836
        },
        {
            "id": "gzy8np8",
            "score": 0,
            "text": "I think fixing tax law loopholes for the wealthy, increasing taxes on the highest earners, taking student loan debt and legalizing marijuana are a bit more important",
            "title_similarity": "0.49701145",
            "sentiment_compound": 0.2716
        },
        {
            "id": "gzyhlty",
            "score": 0,
            "text": "Primitive minds fill these comments. Dems vs Repubs... Us vs Them.... Is this bullshit ever going to end? The weak minded attempt to conform all of the world to their own predefined boxes. Stop",
            "title_similarity": "0.5619195",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gzyqnnf",
            "score": 0,
            "text": "Just like the Warren commission found JFK's killer, and the 9/11 commission found who did that, we'll definitely get to the bottom of this one.",
            "title_similarity": "0.5515752",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzyz22i",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzwwkrv",
            "score": -23,
            "text": "Am I the only one who thinks it’s a bit much to name a bunch of hooligans walking in the Capitol because security didn’t do anything an “insurrection”?",
            "title_similarity": "0.53102326",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzwwkgn",
            "score": -8,
            "text": "Commission or not, it will still be mentioned with each passing day on MSNBC and CNN. I'd rather save the time and money, thank you very much.",
            "title_similarity": "0.4392715",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzx7y8n",
            "score": -8,
            "text": "Democrats idea of Unity:\n\nHold Republicans accountable, but completely ignore the Democrats riots, looting and burning.\n\nThat’s separation and hypocrisy.",
            "title_similarity": "0.5701429",
            "sentiment_compound": -0.8458
        },
        {
            "id": "gzx86zy",
            "score": -5,
            "text": "Love these salty leftist comments.  \n\nMore please.",
            "title_similarity": "0.29701096",
            "sentiment_compound": 0.7778
        },
        {
            "id": "gzxf3co",
            "score": -2,
            "text": "Calls mount for dems to have balls",
            "title_similarity": "0.3667832",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx0zcw",
            "score": -5,
            "text": "Fuck this, abolish the filibuster.  But they won't because THE DEMOCRATS DON'T WANT TO WIN.  The party leadership has no interest in exercising power because they don't actually oppose the GOP agenda.",
            "title_similarity": "0.47823346",
            "sentiment_compound": -0.8397
        },
        {
            "id": "gzwezby",
            "score": 16,
            "text": "Call me crazy but idk, maybe the Democrats should have abolished the filibuster last week when they had the votes and gop on vacation?",
            "title_similarity": "0.6376519",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzwkyn4",
            "score": -50,
            "text": "Any word on a commission to investigate the rioting, burning looting thugs that destroyed US cities in 2020? Didn’t think so.",
            "title_similarity": "0.56341404",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzwfofj",
            "score": 9,
            "text": "Can we get a commission to investigate the people that turned this bill down?",
            "title_similarity": "0.5989585",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwm0a0",
            "score": 6,
            "text": "I still don't see why DC itself doesn't do the investigation. The laws in DC apply everywhere in DC including the capital.",
            "title_similarity": "0.40512186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxaufo",
            "score": -6,
            "text": "I’m down for this.\n\nWhile we are at it can we call for the same investigation for protests that turned into violent riots across the country and the support they garnered from individuals like AOC an Maxine? No … ? Hmm … why not",
            "title_similarity": "0.62602174",
            "sentiment_compound": -0.755
        },
        {
            "id": "gzy0u6n",
            "score": -5,
            "text": "Joe Bidens a clown",
            "title_similarity": "0.26265946",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwj8t6",
            "score": 4,
            "text": "It was probably the GOPs plan all along.  This way they can legitimately politicize any such commission and use it against the Cowardcrats in the midterms, oops I meant Democrats.",
            "title_similarity": "0.6208786",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzlcm",
            "score": 1,
            "text": "Like Biden will do it. He’s still trying to “ cooperate” and “ reach across the aisle” with these fucking facist.",
            "title_similarity": "0.4988094",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzx01bi",
            "score": 1,
            "text": "I'm legitimately starting to get Trump era anxiety about Democrats not doing enough to keep it from happening again",
            "title_similarity": "0.63516",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzx05ob",
            "score": 1,
            "text": "It would be hilarious, watching tribalists get duped time and again by a false dichotomy if it weren’t so goddamned bad for society.",
            "title_similarity": "0.5110779",
            "sentiment_compound": -0.8174
        },
        {
            "id": "gzxhzqx",
            "score": -1,
            "text": "Antifa only exists because they cause civil discourse it's all about misdirection. Help me get to a 100 down votes.",
            "title_similarity": "0.56475204",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzxj6lt",
            "score": 1,
            "text": "Democrats will do anything to keep up the illusion that they aren't in power right now. We elected you to all three branches, we can see you, we know you have the numbers to do the shit we elected you to do. Dems will lose hard in the mid terms and they'll deserve it.",
            "title_similarity": "0.5949089",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzxqt9q",
            "score": -1,
            "text": "lol, because the 9/11 Commission and the Warren Commission was so honest and helpful.\n\nReally need a commission to investigate all these empty lots, parks and other non-residential places that magically voted in 2020...LOL...but that'll never happen.",
            "title_similarity": "0.45062742",
            "sentiment_compound": 0.8521
        },
        {
            "id": "gzy1pwk",
            "score": -1,
            "text": "lmao. your country is the shithole",
            "title_similarity": "0.5080795",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzypxg5",
            "score": -1,
            "text": "Calls mount for Biden to stop being a corporate shit-licking imperialist but go unanswered as the status quo continues to be maintained for money grubbing old white politicians as the wealthy further strangle the poor into early graves.",
            "title_similarity": "0.60772884",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzwt5as",
            "score": -12,
            "text": "Biden should assign Kamala Harris to this.\n\nShe's done an excellent job as border czar thus far.\n\nEdit:  Why do people hate Kamala?",
            "title_similarity": "0.488576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwucd8",
            "score": -6,
            "text": "The cowards are the democrats. You can just sit through a filibuster; every time the democrats let a filibuster succeed it’s because they wanted to. That’s the only reason the GOP gets away with it.",
            "title_similarity": "0.556064",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzx1ac6",
            "score": -17,
            "text": "Meanwhile, Portland has been rioting for over a year, and the one time the gov’t did anything to stop it (under Trump) every leftist coward cried “Tyranny!”",
            "title_similarity": "0.51072395",
            "sentiment_compound": -0.7959
        },
        {
            "id": "gzwpz63",
            "score": 3,
            "text": "Can someone explain what’s different about the fbi, cia investigation that are ongoing vs. this?",
            "title_similarity": "0.582187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxdl8q",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzwxy9t",
            "score": -8,
            "text": "Also, Biden isn’t going to help you on your student debt like he said he would, another fucking lie on top of another.  Look I get it, the republicans are beyond fucked, but when are you going to accept the Democrats are not even close to progressive.",
            "title_similarity": "0.6055008",
            "sentiment_compound": 0.4735
        },
        {
            "id": "gzwgo47",
            "score": 12,
            "text": "The White House is white because it was the only colour available in large quantity after the British burned it, and the rest of Washington, to the ground. \n\nThis time it’s Americans wanting to burn it down. \n\nWhat a weird country.",
            "title_similarity": "0.55800563",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzx6h87",
            "score": -9,
            "text": "Why isn't 1 Democrat calling to investigate all the riots in Portland, Milwaukee or any of the other cities BLM supporters terrorized",
            "title_similarity": "0.4363696",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzws31m",
            "score": -29,
            "text": "Then let’s also form an election fraud commission and a BLM/Antifa criminal probe and a probe into why the State Department was told by Biden to stand down on the Wuhan Lab I mean Covid origins probe. Cowards.",
            "title_similarity": "0.80503535",
            "sentiment_compound": -0.802
        },
        {
            "id": "gzx5gww",
            "score": -11,
            "text": "Yeah they should really investigate the things that led to the 1/6 protests ..  you know like .. investigating widespread voter fraud 🤔",
            "title_similarity": "0.6215836",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzwtlhm",
            "score": -5,
            "text": "Biden is 49% Republican",
            "title_similarity": "0.38054246",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxe96r",
            "score": -6,
            "text": "people are starving and homeless,  billionaires are becoming trillionaires.  This is political theater bullshit and you all should be ignoring it.",
            "title_similarity": "0.57158965",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gzxyrcb",
            "score": -5,
            "text": "The DoJ is already looking into this. The Democrats did this just to make the Republicans look bad. It's a great political move.",
            "title_similarity": "0.6227776",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzx0vbc",
            "score": -1,
            "text": "Lol. The government is useless. Why do people think anything will change?",
            "title_similarity": "0.49058896",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx96ud",
            "score": 1,
            "text": "He looks like Jeff Dunhams puppet Walter.",
            "title_similarity": "0.36077535",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxabbl",
            "score": -1,
            "text": "Where is the justice for Ashli Babbitt?!!\n\n\n\n\n\n\n\n\nlol",
            "title_similarity": "0.47235852",
            "sentiment_compound": 0.7772
        },
        {
            "id": "gzxzuuk",
            "score": -3,
            "text": "The resist crowd complaining about resistance",
            "title_similarity": "0.40777996",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzypv98",
            "score": -2,
            "text": "I'm all for forming a commission, so long as it investigates all of the riots that happened in 2020, and not just Capitol Hill",
            "title_similarity": "0.44139063",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzwz78m",
            "score": -10,
            "text": "My name is Joe Biden and I forgot this message.",
            "title_similarity": "0.42799392",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx1ukj",
            "score": -9,
            "text": "I crack up every time someone calls it an \"insurrection\"",
            "title_similarity": "0.47845292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx35mf",
            "score": -11,
            "text": "How about we go after the BLM riots that cost over 2 billion dollars in damages and shut down city blocks for weeks and months. The only person that died on 1/6 was one of the rioters.",
            "title_similarity": "0.50552356",
            "sentiment_compound": -0.8934
        },
        {
            "id": "gzwtts3",
            "score": -18,
            "text": "Pedo Joe needs to sit down and shut up",
            "title_similarity": "0.4132656",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwt4js",
            "score": -15,
            "text": "If you support either Republicans or Democrats- you are fucking the rest of us over.",
            "title_similarity": "0.63103247",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzx27x4",
            "score": -7,
            "text": "Do people still care about 1/6?",
            "title_similarity": "0.28840014",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzx2pxg",
            "score": -5,
            "text": "Waste of time",
            "title_similarity": "0.24813479",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzx2xed",
            "score": -5,
            "text": "If it involves wasting tax $$, Biden will jump all over it.",
            "title_similarity": "0.5935724",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzx86xe",
            "score": -6,
            "text": "Are we still talking about this? It’s been 6 months now. No one cares at all. Trump isn’t going to jail. Let’s focus on some really shit.",
            "title_similarity": "0.46340546",
            "sentiment_compound": -0.8212
        },
        {
            "id": "gzwvz8v",
            "score": -16,
            "text": "Biden doesn’t even know where he is lol.  Does anyone think he has a single clue about what is happening?",
            "title_similarity": "0.34701744",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwpxje",
            "score": 3,
            "text": "How do Manchin and Sinema not do something about this?\n\nThe filibuster being used by a party to prevent it from being investigated for wrongdoing is all the proof you need that it needs to die. \n\nIt exists for parliamentarianism. It's not parliamentary if you are abusing the ever-loving shit out of it.\n\nBiden shouldn't have to do it. The Senate should have been holding hearings. That's where it belongs.\n\nWhich brings me to my final point:\n\nIt's high time we abolish the senate. We no longer need a senate. Congress is enough. All of the functions of the Senate can be accomplished by Congress, state governors (preferably Lt govs) and direct democracy. \n\nHaving a senate just adds a worthless layer of bureaucracy. It could only ever exist as long as parliamentarianism was a thing. That genie can't ever go back in the bottle. So the senate needs to go.",
            "title_similarity": "0.7032157",
            "sentiment_compound": -0.872
        },
        {
            "id": "gzwr5qh",
            "score": 3,
            "text": "How about we form a presidential commission on healthcare for all? Or climate change? Student loan forgiveness? Funny how that works",
            "title_similarity": "0.5792489",
            "sentiment_compound": 0.6747
        },
        {
            "id": "gzwx606",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzx8ujz",
            "score": -3,
            "text": "What happened to accountability?\n\nHold the Republicans accountable for Jan 6th, but completely ignore the riots looting and burning.",
            "title_similarity": "0.5780261",
            "sentiment_compound": -0.8603
        },
        {
            "id": "gzxaaec",
            "score": -4,
            "text": "Dems are fucking up so bad...",
            "title_similarity": "0.38973868",
            "sentiment_compound": -0.7023
        },
        {
            "id": "gzy2q2r",
            "score": -2,
            "text": "I don't understand why we need a commission. What questions still need answering? We already know the who, what, where, why, when, how, and timeline of the events. We know it was Trump and his supporters, republicans, and some far right groups. I can't imagine a commission give us any additional useful knowledge.",
            "title_similarity": "0.5679774",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzypaco",
            "score": -3,
            "text": "My question  is why? Everyone saw it, Everyone knows what happened. A commission or a presidential inquiry will change nothing. I do not wish my taxpayer dollars to go to exposing traitors that have already exposed themselves. \n\nEdit: what they need to be worried about is I can't pay my rent. I'm a 40 something white guy,can't pay the rent.WTF does history tell you all....assholes",
            "title_similarity": "0.57593095",
            "sentiment_compound": -0.6447
        },
        {
            "id": "gzz156y",
            "score": -3,
            "text": "Four people calling seven hundred times each.  We know there were no weapons.  One murder of a veteran who was standing by a wall.  Possibly could look into why the police encouraged the crowd to break through barriers and did nothing to stop the window breaking.",
            "title_similarity": "0.3530866",
            "sentiment_compound": 0.0243
        },
        {
            "id": "gzwpmrr",
            "score": 0,
            "text": "Fuck these cowards! In the wise words of the Supreme Chancellor... \"DO IT.\"",
            "title_similarity": "0.6134912",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gzwq4wt",
            "score": 0,
            "text": "Can he do this?",
            "title_similarity": "0.19100082",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx5f8v",
            "score": -3,
            "text": "Just let the old man go in peace in a nursing home",
            "title_similarity": "0.24541867",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzx6uno",
            "score": -3,
            "text": "Maybe people should care a little more about holding China accountable for killing millions of people?",
            "title_similarity": "0.55612016",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx7y1o",
            "score": 0,
            "text": "He looks just like Walter from Jeff Dunham",
            "title_similarity": "0.2508734",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx9xbh",
            "score": 0,
            "text": "If he doesn’t, he losses my vote in the next election.",
            "title_similarity": "0.6619743",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzxbku0",
            "score": -5,
            "text": "How bout a COVID COMMISSION probably would be better time spent on that than a day people got out of control 4 months ago.",
            "title_similarity": "0.4620504",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxfx0p",
            "score": 0,
            "text": "Who tf is actually calling it 1/6?",
            "title_similarity": "0.36640376",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxgs2x",
            "score": 0,
            "text": "How bout justice just starts arresting people",
            "title_similarity": "0.49762803",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzxkqee",
            "score": 0,
            "text": "Does anyone else think his eyes look soulless ?",
            "title_similarity": "0.28021234",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxmzd4",
            "score": -4,
            "text": "Quit trying to make 1/6 the new 9/11 its not going to happen. These two theatrical productions are on different planes of magnitude.",
            "title_similarity": "0.49515888",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxqum6",
            "score": -4,
            "text": "Can we impeach Sleepy Joe for not canceling student loans. He lied to the Millennials for votes. We should of voted for Bernie Sanders or Elizabeth Warren.",
            "title_similarity": "0.7143898",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzxu8g8",
            "score": 0,
            "text": "Y'all remember when they were talking about forgiving student loans before Biden said \"Fuck you,\" to everyone under the age of 40?\n\nAnyway, I sure hope those folks still want to come out & vote blue in 2022.  This stuff is probably just as important to them, right?",
            "title_similarity": "0.54785955",
            "sentiment_compound": 0.7236
        },
        {
            "id": "gzxvds5",
            "score": 0,
            "text": "GOP? Democratic senators SKIPPED THE FUCKING VOTE",
            "title_similarity": "0.6055488",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvwen",
            "score": 0,
            "text": "I was going to go to a comedy show tonight but instead I listened to Biden speak for 3 minutes with no notes or a teleprompter.",
            "title_similarity": "0.35692817",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gzy7i39",
            "score": -4,
            "text": "I get that 600 people died that day, which was less half that died fromt fast food buts its still half of what cheeseburgers did that day..",
            "title_similarity": "0.35090464",
            "sentiment_compound": -0.7867
        },
        {
            "id": "gzz32f9",
            "score": 0,
            "text": "Since we only have two agencies investigating now I think we should appoint at least 6 more as that will certainly clarify and speed up the process.  \nWhat do we expect to find out that we do not already know?   Several hundred have already been arrested and a couple groups appear to have had some not well thought out plans.",
            "title_similarity": "0.52529",
            "sentiment_compound": -0.3641
        },
        {
            "id": "gzzjio8",
            "score": 0,
            "text": "That seems to be the way they want to go, if they can't get it through Congress, just do an executive order and declare it. Don't you just love a dictatorship?",
            "title_similarity": "0.679237",
            "sentiment_compound": -0.471
        },
        {
            "id": "gzzlnu2",
            "score": 0,
            "text": "Outside observer here (Brit). Hillary Tweeted out today one of the reasons why there needs to be a commission is rioters killed a police office which is demonstrably false. \n\nThey did however drag the police officer out the building and assault him amongst other things. Dems could literally tell 100% the truth and justify an investigation. No wonder the GOP blocked it.",
            "title_similarity": "0.5924866",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h00zyfs",
            "score": 0,
            "text": "When are they going to look at all those so called peaceful protest, where they burned down buildings and looted.",
            "title_similarity": "0.5119531",
            "sentiment_compound": 0.2992
        },
        {
            "id": "h02zjh2",
            "score": 0,
            "text": "Biden is not running the UsA. We have no president right now. 😞",
            "title_similarity": "0.4438219",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h031ea9",
            "score": 0,
            "text": "There have already been 4 independent investigations. Why would you want your taxpayer dollars to go toward another government investigation?? So dumb!’",
            "title_similarity": "0.53204024",
            "sentiment_compound": 0.2387
        },
        {
            "id": "h033twl",
            "score": 0,
            "text": "You just buy whatever the liberal media is selling.  IT WAS NOT THE WORST ATTACH SINCE 1812!  Review you History.  There have been worse attacks since then, including one bombing.  This attack has been thoroughly investigated already.  Anymore is just a waste of time and tax payer dollars.",
            "title_similarity": "0.5509737",
            "sentiment_compound": -0.8351
        },
        {
            "id": "gzwpkmh",
            "score": -6,
            "text": "And People still wonder why liberals refuse to vote democratic...fucking roll over like dogs to a minority Republican Party",
            "title_similarity": "0.6172847",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzwvsz4",
            "score": -4,
            "text": "So they can waste 10s of millions for a joke like the 9/11 omission right",
            "title_similarity": "0.497267",
            "sentiment_compound": 0.1621
        },
        {
            "id": "gzx404o",
            "score": -6,
            "text": "Oh that pesky insurrection, aka loitering in the atrium with no real goal in mind except to take a selfie and steal some ‘officially licensed merch’.",
            "title_similarity": "0.4952168",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzx89e7",
            "score": -4,
            "text": "No Antifa commission though",
            "title_similarity": "0.13892105",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxmnjd",
            "score": -5,
            "text": "Oh joe, you aborting mass murdering fraud.   For 4 straight years, nothing put hate and rage directed at Donald trump, thru mass propaganda and fear campaign, even to threaten the holy land and Iran, to homes around the globe, while everything crumbles both emotionally and spiritually that it reaches a point that a release valve has to pop, that was Jan, 6, the biggest election fraud in history.   Never before in the history of democracy has a ballot passed by so many hands to be counted,  left in mail boxes, in post offices, in trucks, in bags, in containers, anywhere but a polling both to be instantly counted and confirmed in person, and in that sense huge fraud was committed by liberal fanatics against Donald Trump, with giant stone walls put up at any sort of investigation and to go as so much as to silence him on Twitter.  When all I ever heard him say is he wants to make his county great, loves God and his family, is against abortion, wants his people to prosper as much as him, yet he was attacked mercilessly for 4 straight years and because of him people are much more aware of the alien threat, in dolce hides the snake underground, protected by aliens from zeta plotting humanities destruction.",
            "title_similarity": "0.566864",
            "sentiment_compound": -0.7469
        },
        {
            "id": "gzymq72",
            "score": -5,
            "text": "So they want Biden to implement fascism? Funny, I thought you guys hated that stuff",
            "title_similarity": "0.6052371",
            "sentiment_compound": -0.1832
        },
        {
            "id": "gzz1jqg",
            "score": -4,
            "text": "Gtfo, there was no insurrection. Move on and worry about how bidens destroying the US",
            "title_similarity": "0.5169015",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gzwrpph",
            "score": -16,
            "text": "You pussies can't handle a riot you didn't start!  The fuck out of here with this weak shit",
            "title_similarity": "0.4216717",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gzwu4j1",
            "score": -15,
            "text": "He is to stupid to tie his own shoes. The dems just want to stir more shit which is already backfiring",
            "title_similarity": "0.54658294",
            "sentiment_compound": -0.7902
        },
        {
            "id": "gzwvdcq",
            "score": -6,
            "text": "Waste of tax dollars, nothing ever comes from these commissions",
            "title_similarity": "0.31672603",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzwz2j6",
            "score": -5,
            "text": "This mf couldn’t form a turkey sandwich 🥪",
            "title_similarity": "0.35516942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx566h",
            "score": -6,
            "text": "How about a Commission on the guard that shot and killed a unarmed white woman? Whats his name? How long has he been on the job? \n\nHow about a Commission on Hunter Biden raking in millions from Communist China and funneling it up to Dementia Joe?",
            "title_similarity": "0.54806143",
            "sentiment_compound": -0.7622
        },
        {
            "id": "gzx7j29",
            "score": -4,
            "text": "Do you support the pedophile thirsting after a 9 year old?",
            "title_similarity": "0.47399166",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzx7jff",
            "score": -5,
            "text": "F liberals!!!",
            "title_similarity": "0.35875258",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx7ohh",
            "score": -5,
            "text": "Y’all are a bunch of commies",
            "title_similarity": "0.2601201",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx9dg0",
            "score": -6,
            "text": "Yeah, from partisan hacks who want to prosecute their political rivals and authoritarian dipshits",
            "title_similarity": "0.6634199",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzxbusu",
            "score": -7,
            "text": "There didn't need to investigation. Y'all didn't care when dens stored the capital. Or when black lives matter was burning it 2 the ground",
            "title_similarity": "0.3540411",
            "sentiment_compound": -0.367
        },
        {
            "id": "gzyv29z",
            "score": -4,
            "text": "Democrats need to move on. there is nothing to investigate. this is just politically motivated, nothing to do with finding the truth. America is a democratic country so you should accept the vote. don't try to abuse presidential power because things didn't go your way. what happened on the Capitol wasn't that serious, just a protest which got out of hand. the BLM has caused more damage during its riots and no investigation was done.\n\nalso Trump is innocent.",
            "title_similarity": "0.52648497",
            "sentiment_compound": 0.7477
        },
        {
            "id": "gzwqreq",
            "score": 1,
            "text": "Maybe there should be a law that all crimes committed on federal property gets a commission- too loose? All crimes on federal property that result in a death get a commission? Not strict enough? All crimes where more than 100 traitorous y’allqueda fucksticks get hosed by the outgoing reality tv star failure of a President to attack a federal building get a commission?",
            "title_similarity": "0.63312906",
            "sentiment_compound": -0.8823
        },
        {
            "id": "gzwv0rh",
            "score": -1,
            "text": "Posturing calls,  nothing will come of what happened.  Ever.",
            "title_similarity": "0.32014146",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvm4r",
            "score": -1,
            "text": "Also, student loan forgiveness. Remember that? We all know who did what. Who are we proving this to? Those that will never be proven?",
            "title_similarity": "0.4867366",
            "sentiment_compound": 0.3899
        },
        {
            "id": "gzx3skf",
            "score": -1,
            "text": "Man y’all are such fucking scumbags.",
            "title_similarity": "0.39238232",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxbu9x",
            "score": -1,
            "text": "It pisses me off to no end that the only viable option we have is to either vote for: spineless democrats who go above and beyond the call of duty, stretching themselves and my tax dollars thin playing \"nice\", trying to placate each and every special interest group on the planet, or, the lunatics in the QOP who would rather be Russian piss sponges instead of American. A gigantic majority of them would rather I not have the right to vote to begin with.",
            "title_similarity": "0.6228503",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzxdif8",
            "score": 1,
            "text": "Biden holds up invisible sandwich filled with GOP bullshit. Naturally, it a very large sandwich.",
            "title_similarity": "0.35612527",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzxkuq7",
            "score": -1,
            "text": "im sure he'll furrow his brow and say he cant do it until after the midterms",
            "title_similarity": "0.5671413",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxl3l4",
            "score": -1,
            "text": "Republicans proceeded with the election hours later...\n\nThe Democrats praise the filibuster when they are the minority but hate it when they are the majority.\n\nIt was a few idiots who posed very little threat while BLM caused 2.1+ billion dollars in damage rioting and sieging cities yet no investigation.\n\nThia 'commission' is to distact the public on Biden's cause of vaccine hesitancy, inflation, huge spending on silly things, failure at the border with far more kids in cages and stagnated economy and put big bad Trump as the enemy again.",
            "title_similarity": "0.6146853",
            "sentiment_compound": -0.986
        },
        {
            "id": "gzxnqmb",
            "score": -1,
            "text": "What a joke.",
            "title_similarity": "0.21421924",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxove0",
            "score": -1,
            "text": "Ah yes, the part of the government we set up to make to decisions isn’t cooperating, so your solution is to make your own little comity of only people who agree with you. Where have we seen that?",
            "title_similarity": "0.54318357",
            "sentiment_compound": 0.7769
        },
        {
            "id": "gzxpvn9",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzxqh7e",
            "score": -1,
            "text": "Calls for everything. Damn whiners. \n\nThe guy just put out a six trillion dollar budget. Some people won’t ever be happy.",
            "title_similarity": "0.6399655",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzxr5ha",
            "score": -1,
            "text": "\"cowardly\" is a weird way to spell completely fucking predictable",
            "title_similarity": "0.44410282",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxsfeg",
            "score": -1,
            "text": "I worry that Biden will cave to Republicans.",
            "title_similarity": "0.6244703",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzxsm4z",
            "score": 1,
            "text": "Tell me why a senate minority has the ability to block something so big that also implicates them? Why is nothing consistent? A majority in favor exists for a fucking reason.",
            "title_similarity": "0.66916406",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gzxw91r",
            "score": -1,
            "text": "By all means — whatever keeps actual gov work from getting done. Remind me again the success rate of Democrat-led “investigations” over the past six years? Stop f**king around and get back to work, jackasses",
            "title_similarity": "0.62391007",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzxwcfw",
            "score": -1,
            "text": "Biden looks like one of Jeff Dunham’s puppets. That old cranky one. Not Disparaging - just an observation from the posted photo",
            "title_similarity": "0.4391603",
            "sentiment_compound": 0.6283
        },
        {
            "id": "gzxwhv9",
            "score": -1,
            "text": "No need just when the FBI is done with their investigation declassify the entire thing and release it with no redactions.",
            "title_similarity": "0.44445175",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzxx6de",
            "score": -1,
            "text": "why do i still feel like hes the bad guy😢",
            "title_similarity": "0.44867983",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gzxxjay",
            "score": -1,
            "text": "That wouldn’t be very bipartisan of him.",
            "title_similarity": "0.35291964",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy2o7z",
            "score": -1,
            "text": "Lots of name-calling and no charges for anyone and nothing accomplished, sounds like a great idea.\n\nAren't there a ton of criminal investigations already?  Why not learn something from those first so there will be actual evidence to do something with, instead of allegations and incessant arguing?\n\nAnyone?\n\nEdit: sp",
            "title_similarity": "0.44305196",
            "sentiment_compound": -0.6749
        },
        {
            "id": "gzya3zj",
            "score": -1,
            "text": "He looks like Jeff Dunhams Walter puppet.",
            "title_similarity": "0.34913582",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzyr0a3",
            "score": -1,
            "text": "What are the chances that he would look like someone's puppet?! LOL",
            "title_similarity": "0.42871523",
            "sentiment_compound": 0.7978
        },
        {
            "id": "gzytbf1",
            "score": 1,
            "text": "But first, kill the dang filibuster.",
            "title_similarity": "0.5336925",
            "sentiment_compound": -0.8201
        },
        {
            "id": "gzzhdn6",
            "score": -1,
            "text": "Calls from cretins.  Didnt even top democrats bombing the senate building, let alone Pearl Harbor, 9/11, 1st WTC bombing, ALL other bombings that took > 0 lives.  People are dumb AF anymore.",
            "title_similarity": "0.52831876",
            "sentiment_compound": -0.7088
        },
        {
            "id": "gzzp525",
            "score": -1,
            "text": "Wow the cowardly Biden Crime Family wants justice but fails to include the Democrats residing in Congress! Filibuster was in place years ago, but to complete the destruction of America requires the removal to complete their mission of communism!",
            "title_similarity": "0.6956307",
            "sentiment_compound": -0.8684
        },
        {
            "id": "gzzysoy",
            "score": -1,
            "text": "Smart. I’ve not seen Dems leaders be honest about anything these days.  Let’s look at what they say about the southern border? They say it’s closed but yet illegals are entering at a record rate. Get serious about democrats",
            "title_similarity": "0.5512867",
            "sentiment_compound": 0.3716
        },
        {
            "id": "gzwvha0",
            "score": -6,
            "text": "This sub has the same vibe as that N. Korean broadcaster chick reading anything about the Kim family.\n\nhttps://www.youtube.com/watch?v=Gewq-TxP8QE",
            "title_similarity": "0.3045572",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx7bht",
            "score": -5,
            "text": "The Dems. are gonna get smoked in 22! Unless they can rig those elections too!",
            "title_similarity": "0.61127144",
            "sentiment_compound": -0.2695
        },
        {
            "id": "gzx9vt2",
            "score": -7,
            "text": "We gonna ignore bidens pedo comment lol",
            "title_similarity": "0.49378854",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzxafwc",
            "score": -5,
            "text": "They said, while trying to block every ballot audit in battleground states.",
            "title_similarity": "0.7098541",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzxd0x0",
            "score": -7,
            "text": "This is the biggest joke in US history. Democrats are the picture of idiocy.",
            "title_similarity": "0.505657",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxdyf0",
            "score": -8,
            "text": "Because they are lying about how it's written. This is not just an investigation it's a witch hunt. Still trying to hold Donald Trump responsible for it and now for the \"6 deaths\" that were attributed to it. (Which has already been dismissed.) The left can't figure anything out on their own so they keep trying to go after the previous administration.  It's ridiculous and a total uneeded devisive technique to tear our country further apart than it already is.",
            "title_similarity": "0.66345096",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzx1bx4",
            "score": -14,
            "text": "Hilarious that THIS is insurrection and now all of a sudden the “we must protect the government”. \nBunch of stupid fucking people being let into the buildings and  milling around aimlessly. Sure, there were some even dumber people that took things... but THIS is what y’all decide is too far?  Give me a fucking break... the left has done absolutely no less than tried to set gov buildings on fire with people inside, attacked and destroyed gov property and attacked multiple law enforcement personnel, and OPENLY called for insurrection and injury of republican politicians and  conservatives. Must have forgot about that huh.  fucking hypocrites...at this point, what difference does it make?",
            "title_similarity": "0.6111085",
            "sentiment_compound": -0.9731
        },
        {
            "id": "gzwjgwp",
            "score": -8,
            "text": "He won’t. He wants to stay friends with these guys. \n\nExpect some half-assed house panel. That’s all we will get.",
            "title_similarity": "0.483979",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzx4u75",
            "score": -7,
            "text": "https://nypost.com/2021/05/28/hunter-biden-boasted-that-he-smoked-crack-with-late-dc-mayor-marion-barry/amp/",
            "title_similarity": "0.5341145",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxyc1d",
            "score": -7,
            "text": "lol the capitol riots are old news. Sleepy Joe is now presiding over an imminent recession caused by his reckless government spending, as well as the beginnings of WW3 in israel and palestine. Nevermind the fact that the left basically refuses to play hardball with communist China, even though the evidence is pointing in the direction of COVID starting in one of their labs. By the time any investigation concludes we may all be standing on the breadlines getting our weekly rations from Winnie the Poo.",
            "title_similarity": "0.608009",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzwtbz0",
            "score": -16,
            "text": "Translation:\"They used our tactics against us that's not fair\".\"Now we're going to cry and riot and show our true colors for the cowards we really are.\"",
            "title_similarity": "0.5409318",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzwttzz",
            "score": -9,
            "text": "Biden is the coward.",
            "title_similarity": "0.4541501",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzwy20n",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzx3xch",
            "score": -2,
            "text": "Nah, no one's calling for any of that. I do hear a lot of talk/need for student loan debt cancellation though.",
            "title_similarity": "0.37770623",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gzx48wv",
            "score": -2,
            "text": "Yeah do it pussy",
            "title_similarity": "0.15126814",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzx5os1",
            "score": 2,
            "text": "I don’t see why he wouldn’t do this, he needs a win after going back on almost everything he said he would do so far with Covid relief checks and student loan forgiveness etc, he’s a lot better than the disaster of Trump, but this is a chance for a win amongst all democrats and probably many republicans that will admit it and those who won’t.",
            "title_similarity": "0.5366926",
            "sentiment_compound": 0.9231
        },
        {
            "id": "gzx6o4r",
            "score": -2,
            "text": "wOrSe tHaN 9/11 gUySsSs!11!!!1",
            "title_similarity": "0.38222194",
            "sentiment_compound": -0.6449
        },
        {
            "id": "gzxajgl",
            "score": -2,
            "text": "Ok, serious question.\n\nThe law was broken, people were hurt and murdered by the attackers,\n\nWouldn’t there be a criminal investigation into all the actions amd people involved \n\nwouldn’t the investigating agency have the power to interview witnesses and determine if charges are appropriate.\n\nWhy is a commission required? \n\nWouldn’t the FBI handle this?",
            "title_similarity": "0.5622457",
            "sentiment_compound": -0.9673
        },
        {
            "id": "gzxamoc",
            "score": -2,
            "text": "“Unity”",
            "title_similarity": "0.11299941",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxgjxf",
            "score": -2,
            "text": "Oof please. Dems are feckless",
            "title_similarity": "0.2648924",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxn2sj",
            "score": -2,
            "text": "it was ANTIFA no looking into it necessary, there was an attack on the synagogue of our system but DONT LOOK INTO IT because... heres hop on pop",
            "title_similarity": "0.5262123",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gzxvao0",
            "score": -2,
            "text": "Can't wait for the commission over the 2020 riots...",
            "title_similarity": "0.48513114",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxvrh9",
            "score": -2,
            "text": "whats there to investigate? like i literally dont fucking care. end the filibuster and pass healthcare reform. this is all bullshit to distract from the fact that democrats have done approximately 0 things for the people in the past 6 months even with a majority.",
            "title_similarity": "0.5759607",
            "sentiment_compound": -0.7465
        },
        {
            "id": "gzxx2rn",
            "score": 2,
            "text": "Go for it Mr. President.   Arrest all criminals including Trump.",
            "title_similarity": "0.53877616",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzy1adb",
            "score": 2,
            "text": "Wtf? Why wouldn’t Biden want a commission? This was all about trying to take away his win.",
            "title_similarity": "0.6122044",
            "sentiment_compound": 0.168
        },
        {
            "id": "gzy86pz",
            "score": -2,
            "text": "I read there are currently 6 investigations already ongoing, including Biden’s Justice department and the FBI. Do we need to waste more media and money for politics?",
            "title_similarity": "0.5778053",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzyfftx",
            "score": 2,
            "text": "America is fucked up beyond recignition and probably beyond return.\n\n\nSad!",
            "title_similarity": "0.51417804",
            "sentiment_compound": -0.8313
        },
        {
            "id": "gzym47z",
            "score": -2,
            "text": "Biibided... we couldn't get it done using the process... can you do it by executive order plewase... pretty please\n\nWay to use a senile old man to get what you want",
            "title_similarity": "0.6410351",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzyojje",
            "score": 2,
            "text": "My dream: Eliminate filibuster, nominate Barack Obama to Supreme Court",
            "title_similarity": "0.7087209",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzz13bt",
            "score": 2,
            "text": "neither the president  nor congress needs to investigate, this is a job for the Justice Department,",
            "title_similarity": "0.28108168",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzwf15d",
            "score": 30,
            "text": "We need a DOJ investigation and, eventual, reports. But the key here is legal accountability for organizing, promoting, or aiding the insurrection. This is a criminal investigation.",
            "title_similarity": "0.5202051",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzwipoh",
            "score": 9,
            "text": "Absolutely form that commisssion. Absolutely.",
            "title_similarity": "0.14118534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwy4h9",
            "score": -10,
            "text": "Insurrection my ass lol worst attack since the civil war? Gultonus fear mongering, I pity the fools who believe this.",
            "title_similarity": "0.59301686",
            "sentiment_compound": -0.969
        },
        {
            "id": "gzx0nv8",
            "score": -10,
            "text": "Some MAGA boomers occupying a public government building for a couple hours does not give them functional control over the United States government. This sub will be clutching its pearls about MuH inSurrection for the next 15 years. 🤡",
            "title_similarity": "0.5795176",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzxe1ex",
            "score": -11,
            "text": "The commission is a joke , just like Russia was. Its all about demonizing the right",
            "title_similarity": "0.51302254",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzwp0rm",
            "score": 4,
            "text": "Get off your fucking ass Biden and do something. Get the commission, forgive student loans, cut military budgets and police budgets, or shit just pick one.",
            "title_similarity": "0.66556644",
            "sentiment_compound": -0.8122
        },
        {
            "id": "gzwsedl",
            "score": 3,
            "text": "RepubliKKKlans never have to answer for any of their heinous attacks on Democracy. That’s why THEY KEEP DOING IT.",
            "title_similarity": "0.36031616",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzwtvey",
            "score": -2,
            "text": "His face looks like pancake",
            "title_similarity": "0.28539085",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwuhsd",
            "score": -1,
            "text": "I wish dems would quit being fucking pussies and get shit done.",
            "title_similarity": "0.4728521",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzx014y",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzx46zv",
            "score": 3,
            "text": "Republicans are of no value to humanity",
            "title_similarity": "0.35028756",
            "sentiment_compound": -0.2584
        },
        {
            "id": "gzx4e2c",
            "score": -2,
            "text": "Biden and the milquetoast democrats are such a bunch of pussies. When you have the power to make change, you use it.",
            "title_similarity": "0.64955467",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx672a",
            "score": 4,
            "text": "Is it just me or the photo posted makes Biden look like Jeff Dunham's old man dummy? I can't remember his name.",
            "title_similarity": "0.550793",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx6x7j",
            "score": -3,
            "text": "Democrats: “republicans can’t take no for an answer”\n\nAlso Democrats:",
            "title_similarity": "0.49277025",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxat96",
            "score": -4,
            "text": "Cope",
            "title_similarity": "0.09166831",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxbdvz",
            "score": -3,
            "text": "What a total waste of money and time!",
            "title_similarity": "0.308868",
            "sentiment_compound": -0.5244
        },
        {
            "id": "gzxbrrc",
            "score": -4,
            "text": "It don’t matter who’s in charge both parties are just as corrupt as the other",
            "title_similarity": "0.35990548",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzxcm11",
            "score": -3,
            "text": "But they didn't actually filibuster it. Nobody flibustered anything. McConnell just said fucking 'filibuster' or something and then the Dems caved. \n\nMake them actually spout bullshit 24/7. Make them make fools of themselves and actually put some effort into it.",
            "title_similarity": "0.47655943",
            "sentiment_compound": -0.8885
        },
        {
            "id": "gzxg3f9",
            "score": 2,
            "text": "As if Trump is really going to win the next election.  🙄",
            "title_similarity": "0.5266232",
            "sentiment_compound": 0.6204
        },
        {
            "id": "gzxgkcq",
            "score": -1,
            "text": "Senile old man that is not qualified for the job",
            "title_similarity": "0.34554294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxgvr4",
            "score": -2,
            "text": "Ahhh Newsweek. Another great “jounalustic” truthful piece!!! 🤦🏻‍♂️\n\n(More Reddit fake news postings to make the dumb dumber)",
            "title_similarity": "0.57274187",
            "sentiment_compound": -0.4505
        },
        {
            "id": "gzxhpy1",
            "score": -3,
            "text": "He won’t do it because ultimately the republicans and democrats want the same thing...",
            "title_similarity": "0.5463829",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzxhsrg",
            "score": -5,
            "text": "Might as well become the Führer and stop wasting everyone's time.",
            "title_similarity": "0.57843566",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzxhylf",
            "score": -3,
            "text": "Why can't calls mount for Biden to lower insulin prices back to what they were gonna be under Trump? Yall's priorities seem wacked up man.",
            "title_similarity": "0.62015253",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxrzuo",
            "score": -3,
            "text": "Lol. Biden doesn't even know what day it is!",
            "title_similarity": "0.30240032",
            "sentiment_compound": 0.4753
        },
        {
            "id": "gzxtl55",
            "score": -4,
            "text": "oh, get over it. Yeah it happaned. No you dont need a “comission” to look into it. The FBI already is. If want to beef up security in the capitol, than beef up security in tue capitol.\nEverything else is just partisan bullshit.",
            "title_similarity": "0.624548",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzxvv5p",
            "score": -3,
            "text": "Good. They can ask Pelosi why she weakened security measures. Ask why capitol police were waving people in. Ask why Ashli Babbit was killed.",
            "title_similarity": "0.6550473",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzxypyq",
            "score": -3,
            "text": "Hes got more important things to do: getting more federal money for his benefactors.",
            "title_similarity": "0.46674308",
            "sentiment_compound": 0.2716
        },
        {
            "id": "gzy3gm6",
            "score": -2,
            "text": "He'll do nothing because sitting on his hands for \"unity\" is more important to him than getting shit done.",
            "title_similarity": "0.31292194",
            "sentiment_compound": -0.3626
        },
        {
            "id": "gzy51sd",
            "score": 3,
            "text": "Careful, the mods might remove this because it says something bad about Republicans.  Can't hurt their precious fee fees anymore.  It has to be a super safe place so the super special snowflakes won't melt.",
            "title_similarity": "0.4653924",
            "sentiment_compound": 0.8961
        },
        {
            "id": "gzy6g1n",
            "score": -2,
            "text": "Joe Manchin will keep that from ever happening.",
            "title_similarity": "0.2832711",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy9lvp",
            "score": -4,
            "text": "I don't get why republicans care about the commission. Whatever it finds is just more proof that the left are loonies and must be stopped at all costs that will further radicalize their base. It would probably help them.",
            "title_similarity": "0.6085358",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzyg2ti",
            "score": -4,
            "text": "I love meaningless political theater",
            "title_similarity": "0.3635922",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzyi08v",
            "score": -4,
            "text": "NO NO NO NO!!! JANUARY 6 WAS THE PLAN OF THE COMMIE DEEP STATE HE IS TRYING TO TRICK US INTO ARRESTING THE REPUBLICAN PARTY AND THEN AMERICA WILL BE A BIG COMMIE STATE!!!!",
            "title_similarity": "0.7386052",
            "sentiment_compound": 0.8007
        },
        {
            "id": "gzypgga",
            "score": 2,
            "text": "I say have your AG bring charges of treason against MGT, Josh Hawley, ted Cruz, and the q anon congresswoman Lauren whatever.  Let them face their day in court.... and we have an investigation!  Fuck this bipartisanship bullshit, it is just a joke, the only thing both parties agree on is staying in control.",
            "title_similarity": "0.62919873",
            "sentiment_compound": -0.7345
        },
        {
            "id": "gzyu76h",
            "score": -4,
            "text": "There are MORE calls for bidons RESIGNATION!",
            "title_similarity": "0.5312016",
            "sentiment_compound": -0.4981
        },
        {
            "id": "gzz1mq2",
            "score": -3,
            "text": "Is this website backed by China who is responsible for a brain addled, Corrupt President?",
            "title_similarity": "0.6593179",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzzebeb",
            "score": -3,
            "text": "It’s such a good thing that Biden wants to take more freedoms from Americans…those despicable Americans who weren’t even burning down buildings and murdering people in the streets like peaceful protestors are supposed to do these days.\n\nDo you remember the patriot act? This is the Patriot act 2.0. Such a good thing.",
            "title_similarity": "0.5752156",
            "sentiment_compound": 0.8268
        },
        {
            "id": "gzwhhb5",
            "score": 10,
            "text": "I do hope he at least tries. It'd be strange for him to call the attack the worst such incident since the Civil War and then not take any action. I suspect politics, like not distracting from his infrastructure agenda and negotiations, is going to get in the way though.",
            "title_similarity": "0.62470233",
            "sentiment_compound": -0.8322
        },
        {
            "id": "gzwwa4a",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.2671185"
        },
        {
            "id": "gzwxm73",
            "score": -3,
            "text": "The best part of reading comments on reddit.\nWhen you are on conservative sub reddits all they do is talk about how liberals listen,believe and follow what ever the democrats say,while believing everything rebulicans say.\nAnd when you are on liberal sub reddits all they do is talk about how all conservatives listen,believe and follow what ever the republicans say,while believing everything democrats say.Basically you are the same people with different political beliefs.",
            "title_similarity": "0.48991525",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzwyksn",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.26711842"
        },
        {
            "id": "gzx15qk",
            "score": -3,
            "text": "Both the Biden and Trump administration were and are cowardly.",
            "title_similarity": "0.6051866",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzx6ntv",
            "score": -4,
            "text": "Looks like he’s describing the last dump he took.\n\nFor the record this is a nonpartisan comment.",
            "title_similarity": "0.48584816",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzx7pk2",
            "score": -6,
            "text": "good idea, if only he could remember where he was an hour ago",
            "title_similarity": "0.34858182",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzx7ro8",
            "score": 5,
            "text": "Lots of conservative internet balls here. Nothing but a bunch of “wannabe patriots” who spend all their money on shitty tactical LARP style tactical gear, and Onlyfans subscriptions. You stormed the capitol. Suffer the consequences.",
            "title_similarity": "0.6179435",
            "sentiment_compound": -0.8922
        },
        {
            "id": "gzx828y",
            "score": -4,
            "text": "Joe just does what he’s told..",
            "title_similarity": "0.1559415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx9h4d",
            "score": -2,
            "text": "Biden looks like that puppet.",
            "title_similarity": "0.2543825",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx9jag",
            "score": -4,
            "text": "What a silly game.",
            "title_similarity": "0.245716",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzxd2ba",
            "score": -4,
            "text": "Rofl at this headline.",
            "title_similarity": "0.41986436",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxgnb1",
            "score": -5,
            "text": "The mental illness and ignorance is strong on this thread. Do yourselves a favor and just lookup how many americans are still in jail without a hearing or bail after 1/6 compared with the hundreds that have been let of with slaps on the wrists for violent antifa related riots.",
            "title_similarity": "0.5124481",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzxhk2f",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.26711842"
        },
        {
            "id": "gzxk6o8",
            "score": -5,
            "text": "Nothing to investigate, it was a mostly peaceful protest like the ones that took place all summer.",
            "title_similarity": "0.14584503",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxlir3",
            "score": -6,
            "text": "Let it go.",
            "title_similarity": "0.23782104",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxodiz",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzxsynl",
            "score": 3,
            "text": "As a conservative this upsets me. We need to know the truth. My guess the gop doesnt want the commission because some reps may be implicated.storming  the capitol was anti american.",
            "title_similarity": "0.71099055",
            "sentiment_compound": -0.4761
        },
        {
            "id": "gzxtxd0",
            "score": -4,
            "text": "Annnd the kangaroo court returns",
            "title_similarity": "0.36597222",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvgqe",
            "score": -6,
            "text": "Just so we are on the same page, where were your calls for a 9/11 commission when Democrats stormed the capital a few years ago?\n\nhttps://www.google.com/amp/s/amp.usatoday.com/amp/1453524002\n\nTired of Democrat bullshit. You are scum",
            "title_similarity": "0.720092",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gzxvvqa",
            "score": -5,
            "text": "Fuck people. This was a random bunch of weirdos wondering around.  This was no insurrection.",
            "title_similarity": "0.27347794",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gzxx0g7",
            "score": -5,
            "text": "Cowardly calls for Biden to form1/6 commission after GOPs filibuster. There I fixed it.",
            "title_similarity": "0.73613834",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzxx7ib",
            "score": 3,
            "text": "Form the 1/6 commission and while you're at it:  \nEnd the filibuster  \nRecognize the Palestinian genocide  \nRecognize Taiwan as a country  \nCancel student debt  \nPardon Snowden",
            "title_similarity": "0.6348212",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxy379",
            "score": -4,
            "text": "https://www.google.com/amp/s/www.washingtonexaminer.com/news/democrats-used-filibuster-over-300-times-GOP-once%3f_amp=true",
            "title_similarity": "0.561468",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxzkzl",
            "score": -4,
            "text": "Yeah, we need to know why nancy refused national guard protection prior to the event",
            "title_similarity": "0.5800182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy1n4r",
            "score": -5,
            "text": "Biden is hoping he won’t be shot against a wall because he was “buddies” with the insurrectionists.\n\nThis should terrify you.",
            "title_similarity": "0.5308882",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzy8pig",
            "score": -5,
            "text": "I think the Democrats should focus on voting rights instead of banning protests.",
            "title_similarity": "0.5201471",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzyou89",
            "score": -4,
            "text": "so when the GOP use the filabuster they are considered cowards, the next time the democrats use it we'll makle sure they are known as TRAITORS",
            "title_similarity": "0.6850704",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwgezq",
            "score": 175,
            "text": "I’m so tired of Democrats worrying about optics and bipartisanship with a bunch of anti-democracy lunatics who almost got them killed.\n\nIt’s idiotic performative high roading and it’s unnecessary. We get the message, republicans aren’t going to do their jobs.",
            "title_similarity": "0.64118546",
            "sentiment_compound": -0.9435
        },
        {
            "id": "gzwmgwg",
            "score": -5,
            "text": "He's not doing anything else for the next 3 months or so, so might as well do something with the office...",
            "title_similarity": "0.3304997",
            "sentiment_compound": 0.3321
        },
        {
            "id": "gzx0qfx",
            "score": -5,
            "text": "Can he form a commission on reducing the military spending budget and investing in maternity/paternity leave, after school programs, vocational training programs, renewable energy infrastructure, or a host of other more pressing matters that could use government funding? I mean the insurrection was bad but they waste so much time and money continuously looking backwards.",
            "title_similarity": "0.63477373",
            "sentiment_compound": -0.6498
        },
        {
            "id": "gzx1e94",
            "score": -5,
            "text": "And Dems cowardly bending over for them.",
            "title_similarity": "0.45038316",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzx48xs",
            "score": -5,
            "text": "Biden is weak. Where is the public option he promised??",
            "title_similarity": "0.50835884",
            "sentiment_compound": -0.1926
        },
        {
            "id": "gzx4nm9",
            "score": -5,
            "text": "Let's investigate why they turned down Trump's offer for additional security.\nSpeaker of the house is actually responsible for security.\nWhy did cops flag people to go in the capital and say yes it's ok to go in \nWhy BLM and antifa activist were in most the photo opps inside.\nMSM lieing about a cop getting his head bashed in with a fire extinguisher. \nThe 5 folks who died on that day were all Republicans.\nWhat was the gold coin pence was given after counting the electoral votes (looked like a Judas gets his silver moment)?\nAnd! How did him and bucket of gin Pelosi all of a suden get so chummy(playing elbow grab ass right after getting his gold coin)?\nThat is what the establishment looks like. They been there forever.",
            "title_similarity": "0.6400213",
            "sentiment_compound": 0.7312
        },
        {
            "id": "gzx4t2f",
            "score": -7,
            "text": "This guy is just the old puppet",
            "title_similarity": "0.29029822",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6x6a",
            "score": -6,
            "text": "Biden had prevented Pompeo from wanting to look into looking the China lab theory. Look for Pomeo to bring this up again as they NOW want to look into this. 🤦‍♀️",
            "title_similarity": "0.5882758",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzx76d0",
            "score": -6,
            "text": "Whatever keeps him away from our children.",
            "title_similarity": "0.4024391",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx7dac",
            "score": -7,
            "text": "HA! but isn't that the BS the Democratic party pulled along with legally questionable defamation practices against former president trump? Not even gonna waste my energy laughing at this one",
            "title_similarity": "0.69274884",
            "sentiment_compound": 0.9116
        },
        {
            "id": "gzx9lla",
            "score": -4,
            "text": "Who cares.. stop ruining the country, stop the useless distractions.",
            "title_similarity": "0.42313397",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzxgjum",
            "score": -3,
            "text": "Still waiting on the antifa comission",
            "title_similarity": "0.3617193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxil69",
            "score": -4,
            "text": "[Dude was flirting with a 10 year old girl](https://www.dailymail.co.uk/news/article-9631457/Creepy-Joe-Biden-slammed-remarks-elementary-school-aged-girl.html), but yeah those darn GOP filibusters.",
            "title_similarity": "0.4586659",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxja85",
            "score": -6,
            "text": "All Democrats are useless. Let’s do another investigation on some pointless shit and waste taxpayers money.",
            "title_similarity": "0.5607463",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gzy9hzt",
            "score": -4,
            "text": "Leftists said property doesnt matter, that was taught during 2020 Floyd Riots, so no commission needed.",
            "title_similarity": "0.41458935",
            "sentiment_compound": -0.7384
        },
        {
            "id": "gzybz9m",
            "score": -4,
            "text": "I call for Biden to resign because of this.",
            "title_similarity": "0.6155273",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzyexh9",
            "score": -6,
            "text": "Nice Dictator",
            "title_similarity": "0.22415282",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwueny",
            "score": 18,
            "text": "If they don’t axe the filibuster at this point, then they are too weak to lead, which  leaves America in a precarious situation.",
            "title_similarity": "0.54449546",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzwy4dr",
            "score": 5,
            "text": "The solution to many of our problems is simple; Do not vote for any republican ever. From president, down to dog catcher. If they are a republican, just say no.",
            "title_similarity": "0.47719413",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzxfcuz",
            "score": -5,
            "text": "Terrible president",
            "title_similarity": "0.50506914",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxh5g8",
            "score": -6,
            "text": "Imagine having a pedo president with a crackhead son who has deep business ties to communist states and the FBI is weaponized against senior citizens and unarmed blue collar Americans who walked across a door threshold.",
            "title_similarity": "0.6002675",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy3pav",
            "score": 5,
            "text": "To all of you who think that an investigation will somehow prevent another one, you need to realize that these people think that they are the \"children of light\" and the rest of us are of the devil. They believe that these are the last days of the earth, and that forcing a war with the government will bring on the Rapture and the Second Coming. You are NOT going to be able to reason with people like that. We are facing the \"Christian\" version of the American Taliban that Evangelicals, the GOP and white supremacists are all merging into, with Trump as their \"savior\".",
            "title_similarity": "0.65537214",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gzyd9nf",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzyjj6s",
            "score": -6,
            "text": "BLM = Buy Large Mansions",
            "title_similarity": "0.3905733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwh0ji",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzwtdw0",
            "score": 7,
            "text": "End the F-ing filibuster!",
            "title_similarity": "0.45179856",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwxj31",
            "score": -7,
            "text": "How many Palestinian children were killed by Joe sending missiles to Israel this month? Form a commission for that.\n\nAll you downvoters are supporting genocide and the old man you voted for is funding it.",
            "title_similarity": "0.544582",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzx02z3",
            "score": 6,
            "text": "Hahaha, politics aside, this photo of Biden looks like Jeff Dunham's old guy puppet.",
            "title_similarity": "0.5438013",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzx6j8k",
            "score": -8,
            "text": "When is the commission for something that has killed 600k Americans? \n\nDon’t want that because it would make the left look fucking stupid?",
            "title_similarity": "0.6425054",
            "sentiment_compound": -0.8501
        },
        {
            "id": "gzxbvgy",
            "score": -7,
            "text": "Dems want A 1/6 commission because they don't want the other 5/6 being discovered",
            "title_similarity": "0.4329015",
            "sentiment_compound": 0.0201
        },
        {
            "id": "gzy6s14",
            "score": -8,
            "text": "Biden is is joke. A bad one at that.",
            "title_similarity": "0.3498537",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzyffxy",
            "score": -8,
            "text": "Oh, but if the shoe was in the other foot it would be fine, sad bunch of miserable crybabies Democrats",
            "title_similarity": "0.46319324",
            "sentiment_compound": -0.8047
        },
        {
            "id": "gzyg7h6",
            "score": -6,
            "text": "who gives a shit where’s my $15 min wage and the other $600 from the 2k you promised \n\nhappy I voted for Hillary in 2020, voting is a joke and should be treated as such",
            "title_similarity": "0.58045894",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzymoyt",
            "score": -7,
            "text": "How do y'all feel about the 300+ times Dems filibustered during Trump's term?  I'm guessing that was 'heroic' instead of 'cowardly' right?",
            "title_similarity": "0.5605657",
            "sentiment_compound": 0.3313
        },
        {
            "id": "gzyqhuz",
            "score": -6,
            "text": "Arizona is flipping. Michigan and PA are next. They were right to protest. Stolen election.",
            "title_similarity": "0.68853676",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gzwimgq",
            "score": 192,
            "text": "A substantial portion of the GOP is complicit in this ongoing assault on US democracy. They should be rightfully excluded from any proceedings as they have left rationality behind in pursuit of fascism.\n\nThe only upside is that the majority of them are stupid beyond the reach of any education.",
            "title_similarity": "0.5654784",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gzwfkby",
            "score": 66,
            "text": "DO IT ALREADY!  Quit trying to reason with those idiots on the other side of the aisle",
            "title_similarity": "0.44916052",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwy00f",
            "score": -7,
            "text": "Move on whiners.😂",
            "title_similarity": "0.3925349",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwzqxq",
            "score": -7,
            "text": "He's to concerned with little girls hair and crossed legs... can't believe yall suoport this blatant pedophile",
            "title_similarity": "0.49404645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy95z0",
            "score": -7,
            "text": "Calls mount for Dog Faced Pony Soldier Biden to form a coherent sentence.",
            "title_similarity": "0.41759858",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzyh1wp",
            "score": -7,
            "text": "There are no “calls” this is bs.  It’s just more mass media manipulation to program the masses who will listen to it into thinking people give a shit and stir up “discussion” so that they can then justify there are “calls for this”.  They create through mass brain washing what they need to justify wasting more of tax payers money for this bs cause and investigation.  Thus giving one more angle and avenue to wastefully use said money and pay their cronies through backdoor deals.\n\nAnyone who’s seen the video of the police guiding and telling the “actors” to go in, knows this is more lies and bs.  Wake up Americans.. f!",
            "title_similarity": "0.6037486",
            "sentiment_compound": -0.882
        },
        {
            "id": "gzwqenb",
            "score": 46,
            "text": "only in america where the score is 54-35 with 10 QOP missing and the minority wins. We investigated Benghazi and looking for bamboo in Arizona but no investigation for January 6? What is the QOP hiding? Is it insurrection?",
            "title_similarity": "0.5431323",
            "sentiment_compound": -0.6586
        },
        {
            "id": "gzwr0xi",
            "score": 27,
            "text": "My biggest fear before he was elected was that he'd try too hard to work with Republicans. Republicans are actively attempting to overthrow our democracy.",
            "title_similarity": "0.71037245",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzwpm85",
            "score": 11,
            "text": "It would be like if we gave Taliban a choice whether to form a 9/11 Commission -_-",
            "title_similarity": "0.59222126",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwxb78",
            "score": -9,
            "text": "Biden’s is a joke of a president! We will get attacked …. Look at everything that is happening in Israel and Iran! Wake up America! All this is in the Bible, the most reliable book in history!",
            "title_similarity": "0.5665822",
            "sentiment_compound": -0.453
        },
        {
            "id": "gzx6vpm",
            "score": -9,
            "text": "Investigate the fake election and fake ass president",
            "title_similarity": "0.77439106",
            "sentiment_compound": -0.8658
        },
        {
            "id": "gzx6zr7",
            "score": -11,
            "text": "Calls mount for this pervert President to be impeached.",
            "title_similarity": "0.728106",
            "sentiment_compound": -0.596
        },
        {
            "id": "gzxcksf",
            "score": -9,
            "text": "Imagine actually considering the sixth to be an insurrection, instead of a bunch of idiots doing the same thing people did all year during 2020. With markedly less damage, and loss of life.",
            "title_similarity": "0.47061664",
            "sentiment_compound": -0.6051
        },
        {
            "id": "gzy2oue",
            "score": -7,
            "text": "You folks are crazy this whole “insurrection” which was clearly planned by the democrats to try and isolate a whole group of people who believed the election was stolen to destroy there credibility. Why was there barely any guards at the capital at that time?Normally protecting the capital is a top priority but at this one specific time no huh? Why were the offenders allowed to do all they did where was security,military,or police while all this was going on . The other crazy thing is the BLM and antifa community are currently and have been for years taking over cities with riots and death businesses burned hell they even took over part of Seattle for a substantial time while they rapped and beat people but that’s not an insurrection?🤔",
            "title_similarity": "0.6081213",
            "sentiment_compound": -0.9832
        },
        {
            "id": "gzwmujv",
            "score": 55,
            "text": "HEADLINES FROM THE FUTURE: GOP decries partisan investigation into the January 6th insurrection, suggest the Democrats should have tried to form of a bi-partisan commission instead.",
            "title_similarity": "0.7629765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwqny1",
            "score": 9,
            "text": "More like: Biden should get his ass in front of the camera and shame senate Republicans (and 2 dems) for such abhorrent dereliction of duty. On the heels of memorial day no less",
            "title_similarity": "0.7197452",
            "sentiment_compound": -0.8781
        },
        {
            "id": "gzx02h9",
            "score": -10,
            "text": "We’re so lucky there’s no real problems in the world right now so we can focus on this same tired bullshit some more!",
            "title_similarity": "0.18294898",
            "sentiment_compound": -0.6255
        },
        {
            "id": "gzxd7nu",
            "score": -10,
            "text": "Biden will do whatever he is told to do. It’s clear he is the most clueless president we have ever had. Not sure if he even knows he is president. 😂 But he knows his ice cream!",
            "title_similarity": "0.551319",
            "sentiment_compound": 0.1691
        },
        {
            "id": "gzxdehe",
            "score": -8,
            "text": "Please stop this. Let’s move on.",
            "title_similarity": "0.35255438",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzxbi00",
            "score": -11,
            "text": "TRUMP2024 😘",
            "title_similarity": "0.33750802",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzx2cfw",
            "score": -13,
            "text": "The attack was done by Democrats, just to put blame on republicans to influence the election.",
            "title_similarity": "0.6385102",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzwq3i8",
            "score": 16,
            "text": "I don't know why the Democrats aren't using more aggressive language here.  This is a cover-up.  Call it that.",
            "title_similarity": "0.61415267",
            "sentiment_compound": -0.1379
        },
        {
            "id": "gzx75ax",
            "score": 17,
            "text": "Republicans. The Democrats are responsible for the insurrection!   \n\nDemocrats. We need to do an investigation.   \n\nRepublicans. Nope!",
            "title_similarity": "0.6808616",
            "sentiment_compound": 0.4374
        },
        {
            "id": "gzx8pl2",
            "score": 22,
            "text": "GOP “It was Antifa! Antifa I’s tells ya! It was all an attack by Democrats posing as ****p supporters!”\n\nDEM “Ok, we’re going to form a commission to look into the whole event.”\n\nGOP “Wait… you can’t do that!  We won’t allow you to investigate the insurrection caused by Democrats!”",
            "title_similarity": "0.709599",
            "sentiment_compound": -0.5216
        },
        {
            "id": "gzwelpo",
            "score": 763,
            "text": "The Nazis weren’t able to oversee the Nuremberg trials, so why the fuck does the GOP get to derail this investigation?",
            "title_similarity": "0.54550433",
            "sentiment_compound": -0.7152
        },
        {
            "id": "gzwijx5",
            "score": 309,
            "text": "Form the Presidential commission.  Investigate who was involved, arrest and try all those who were involved and move on.  We aren't talking about a minor offense here, we are talking about a political party (GOP) who actually tried to overthrow the Federal Government and illegally change the results of a presidential election.  Those involved including Donald Trump need to face the music if they were involved and be put away for a long, long time!",
            "title_similarity": "0.7028937",
            "sentiment_compound": -0.2481
        },
        {
            "id": "gzwd9z4",
            "score": 987,
            "text": "Just.....do....it!\n\nSeriously, at this point I would like the Democrats to take a page from Republicans and do practically anything to just push their damn agenda through.  This is a hyper partisan, cut-throat, political arena now.  Taking the moral high ground as your image isn't going to work at this time.  We need more action and less failed compromises.\n\nI'm fairly certain any concerns about the Democrats becoming as nutty as the GOP are dampened by how low the GOP has sunk in the past decade alone.",
            "title_similarity": "0.7021998",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzwbq60",
            "score": 3189,
            "text": "The Dems are over here fucking wasting months trying to \"work with\" gop... They should be bulldozing over all this shit and get it moving. Like what the fuck. Obviously the gop isn't going to act in good faith on ANYTHING. Should have started with committee subpoenas and whatnot right out of the gate\n\nEDIT: Furthermore, the Dems got both sides of Congress + presidency. What the fuck more mandate do you need...? Mark my words, Dems won't have this much power again for next decade if they keep this up. Just like 2008-2010.. history repeating itself.\n\nYou know damn well if the gop had this situation, they'd be putting their foot on the throat of everyone immdiately",
            "title_similarity": "0.70757776",
            "sentiment_compound": -0.7305
        },
        {
            "id": "gzwdliw",
            "score": 1394,
            "text": "It wasn't cowardice on the part of republicans, it was self-preservation.\n\nThey're willing to commit arson, but then only dress up as firefighters.",
            "title_similarity": "0.35778683",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzwcpb5",
            "score": 8862,
            "text": "> \"While McConnell and his GOP allies in the Senate may be able to stop the House bill from becoming law, that need not prevent a special commission investigation of the worst attack on the Capitol since the War of 1812 and the worst act of insurrection in the United States since the Civil War. Biden can and should create a blue-ribbon commission to investigate the attack,\" Cole wrote in the article published Friday.\n\nPretty fuckin clear - we need a commission. Failure to investigate this only invites more insurrection.",
            "title_similarity": "0.71647906",
            "sentiment_compound": -0.964
        },
        {
            "id": "gzwo4k4",
            "score": 215,
            "text": "End the god damned filibuster, or at least change it back to it's original state where you have to talk and when you stop talking you vote.",
            "title_similarity": "0.6136235",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzwd13e",
            "score": 6,
            "text": "This is the best tl;dr I could make, [original](https://www.newsweek.com/calls-mount-biden-form-presidential-1-6-commission-after-gops-cowardly-filibuster-1596136) reduced by 80%. (I'm a bot)\n*****\n> &quot;In light of the GOP&#039;s cowardly filibuster of a bipartisan Jan 6th commission I urge President Biden to form and appoint a Presidential Commission to fully investigate the insurrection of January 6th at the US Capitol,&quot; Connolly tweeted.\n\n> In light of the GOP&#039;s cowardly filibuster of a bipartisan Jan 6th commission I urge President Biden to form and appoint a Presidential Commission to fully investigate the insurrection of January 6th at the US Capitol.\n\n> &quot;While McConnell and his GOP allies in the Senate may be able to stop the House bill from becoming law, that need not prevent a special commission investigation of the worst attack on the Capitol since the War of 1812 and the worst act of insurrection in the United States since the Civil War. Biden can and should create a blue-ribbon commission to investigate the attack,&quot; Cole wrote in the article published Friday.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/nnu2t3/calls_mount_for_biden_to_form_presidential_16/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~579983 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **commission**^#1 **investigate**^#2 **Biden**^#3 **form**^#4 **presidential**^#5",
            "title_similarity": "0.65688217",
            "sentiment_compound": -0.9426
        },
        {
            "id": "gzwibus",
            "score": 3,
            "text": "If that is a thing do it. Clearly the criminals are not going to try themselves",
            "title_similarity": "0.30665877",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzwirq0",
            "score": 4,
            "text": "Should have just done that in the first place",
            "title_similarity": "0.32444996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwjbc6",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzwjkm8",
            "score": 2,
            "text": "He’s got all the power to create a commission to investigate this travesty (the travesty our GOP friends want to white wash).",
            "title_similarity": "0.5266851",
            "sentiment_compound": -0.5537
        },
        {
            "id": "gzwl13d",
            "score": 2,
            "text": "Make it bigger than Benghazi.",
            "title_similarity": "0.31598368",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwoa4u",
            "score": 3,
            "text": "We offered an olive branch and when they get the whip closer to election season when a commission starts releasing all the dirt the GQP cult will be utterly destroyed as Americans bear witness to all their seditious and traitorous acts as they go to the voting booth.",
            "title_similarity": "0.6953422",
            "sentiment_compound": -0.8221
        },
        {
            "id": "gzwoa5o",
            "score": 2,
            "text": "Also pass voting rights legislation, because our democracy depends on it.",
            "title_similarity": "0.5472827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwoukh",
            "score": 2,
            "text": "You had a chance to make it a bipartisan issue.  Now the democrats are just gonna do it themselves.",
            "title_similarity": "0.57304174",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzwoxx1",
            "score": 2,
            "text": "I don't know why we have to have a commission and not an independent counsel investigation, but perhaps Biden can't do that.\n\nHe should.\n\nHe should also counter those voting changes.\n\nYou know, or people claiming to be Democrats could start behaving like Democrats.",
            "title_similarity": "0.6299852",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gzwp391",
            "score": 2,
            "text": "That would require him to have a pair of testicles",
            "title_similarity": "0.27897146",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwp80c",
            "score": 17,
            "text": "I mean, big shocker, the obvious subjects of an investigation would prefer not to be investigated. So they stopped the investigation from happening. It was only the most obvious cover-up in the history of time.",
            "title_similarity": "0.53859866",
            "sentiment_compound": -0.6436
        },
        {
            "id": "gzwpu6k",
            "score": 2,
            "text": "It's clear that the GOP want to just move on and brush 1/6 under the rug.\n\nWe shouldn't let them get away with that. Biden should form a commission and start holding press conferences. Release tape from sitting Republicans.  Announce the status at weekly press conferences the current charges facing the insurrectionists. Hell, put James Comey in charge in some capacity of the investigation just a trigger Republicans. \n\nAgain, Republicans want to sweep this under the rug. We can't let them. Why are we letting them control the narrative?",
            "title_similarity": "0.7494756",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzwpwo3",
            "score": 2,
            "text": "Where is the petition?! I will gladly sign",
            "title_similarity": "0.29725462",
            "sentiment_compound": 0.4003
        },
        {
            "id": "gzwqiwf",
            "score": 1,
            "text": "if biden doesn't do this, he proves he is a republican poppet",
            "title_similarity": "0.5834525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwqj64",
            "score": 3,
            "text": "The fact that he didn't have an Executive Order, ready to sign, expecting this to happen honestly surprises me. The GOP is many things, but unpredictable isn't one of them. Radical? Sure. Malicious? Absolutely. Selfish? 100%. Unpredictable though? Not at all.",
            "title_similarity": "0.43574378",
            "sentiment_compound": 0.3654
        },
        {
            "id": "gzwqt78",
            "score": 2,
            "text": "We're never getting real things accomplished, huh? \n\nWe'll be talking about this for years.",
            "title_similarity": "0.38426766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzwqy0z",
            "score": 32,
            "text": "We gave them an opportunity to take part in the investigation and they declined so now they can watch from the outside.",
            "title_similarity": "0.35661465",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzwr9be",
            "score": 3,
            "text": "Republicans are the hidden enemies of this country.",
            "title_similarity": "0.59839463",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzwremw",
            "score": 3,
            "text": "Kill the filibuster!",
            "title_similarity": "0.50292754",
            "sentiment_compound": -0.7177
        },
        {
            "id": "gzwrhgh",
            "score": 1,
            "text": "Spoiler: he won’t do it",
            "title_similarity": "0.31377187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwrvik",
            "score": 2,
            "text": "Yeah just do it without them and only invite the few republicans into the group that actually voted in favor of it",
            "title_similarity": "0.48209095",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzws8v6",
            "score": 3,
            "text": "Gotta fight hard during the midterms next year",
            "title_similarity": "0.45410854",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzwsarn",
            "score": 2,
            "text": "The life of the vice-president was openly threatened in public on federal ground. Secret Service could be all over this if they got the order.",
            "title_similarity": "0.66728675",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzwsb1y",
            "score": 2,
            "text": "Whys everyone obsessed with an arbitrary commission?  This has been a heavily investigated event, with hundreds of convictions.  Its quite out of the ordinary just how much its been investigated.  Why not some commissions for all these black victims of police violence?  How about hundreds of convictions there?  Wealthy politicians are getting billions of dollars in security when their country has none.  DC needs to get over this shit and get to work.",
            "title_similarity": "0.5481997",
            "sentiment_compound": -0.8398
        },
        {
            "id": "gzwsjn5",
            "score": 3,
            "text": "Why is this even a debate?",
            "title_similarity": "0.2616777",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsqnp",
            "score": 2,
            "text": "why do we need a separate commission? don't we have committees with subpoena powers? how did republicans investigate Benghazi for 5,000 years?",
            "title_similarity": "0.53823054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwsqon",
            "score": 5,
            "text": "To use one of thier arguments, if they have nothing to hide they have nothing to fear from law enforcement...committee's investigating them.",
            "title_similarity": "0.2933271",
            "sentiment_compound": 0.1144
        },
        {
            "id": "gzwssln",
            "score": 1,
            "text": "Make it happen Joe",
            "title_similarity": "0.24027269",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwstcc",
            "score": 2,
            "text": "He won't. Just like he failed on $2000 checks immediately. Just like a backed off the public option. Just like he folded on $15 hr minimum wage. Just like he caved on student loan forgiveness, he's a do nothing president that will secure future republican victories.",
            "title_similarity": "0.64352566",
            "sentiment_compound": 0.6898
        },
        {
            "id": "gzwsvxf",
            "score": 2,
            "text": "The House can hold their own, just like the @GOP (Trey Gowdy) did with HRC and Benghazi...",
            "title_similarity": "0.32224023",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwt1vw",
            "score": 1,
            "text": "[I really don’t know how I haven’t seen this before.](https://imgur.com/gallery/GMJr61g)",
            "title_similarity": "0.3079294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwt33p",
            "score": 1,
            "text": "Narrator: He didn't",
            "title_similarity": "0.17736098",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwt6da",
            "score": 15,
            "text": "People please continue to press the issue that the gqp blame antifa for the insurrection and there’s ABSOLUTELY NO REASON to believe their motivations to turn down an investigation given this fact. The ONLY explanation for their veto is that THEY ARE CO-CONSPIRATORS.",
            "title_similarity": "0.5745564",
            "sentiment_compound": -0.6198
        },
        {
            "id": "gzwt6z5",
            "score": 13,
            "text": "Democrats: Hey,  we're voting on a commission to investigate whether or not you guys helped in an attempted overthrow of our democracy. What do you think? \n\nRepublicans: Nah.",
            "title_similarity": "0.7107903",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzwt9wt",
            "score": 7,
            "text": "Of course, you'd find the majority of the Republicans wanted to overthrow the democracy/hluse/senate/election.",
            "title_similarity": "0.7119702",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwtjho",
            "score": 1,
            "text": "The DOJ IS investigating, its just quiet because thats how the DOJ works.\n\nPelosi is likely to form a select committee investigation.\n\nBiden does NOT want to be involved and well, politically, it is agreed that, that is the correct move, due to a history of banana republics investigating the past admin as soon as power flips.\n\nAG garland is investigating under his sole authority as AG.",
            "title_similarity": "0.57348305",
            "sentiment_compound": 0.507
        },
        {
            "id": "gzwtr85",
            "score": 3,
            "text": "Why wouldn't the GOP want to investigate this? It was just a bunch of undercover ANTIFA agents, right? >!/s!<",
            "title_similarity": "0.55705434",
            "sentiment_compound": -0.2883
        },
        {
            "id": "gzwtrag",
            "score": 1,
            "text": "He leads the executive and DOJ is already investigating. Wouldn’t this just dupe efforts?",
            "title_similarity": "0.59302646",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzwts8w",
            "score": 1,
            "text": "Ahh who else “loves” losing more and more rights because the rich and powerful are scared",
            "title_similarity": "0.5313744",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzwtspp",
            "score": 7,
            "text": "The fillibuster needs to go \n\nThe GOP have shown time and time again that it's nothing but a tool to sabotage the will of the majority",
            "title_similarity": "0.5298102",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzwu1to",
            "score": 2,
            "text": "Joe's a nice hopeful guy from a different era; any R now that works like the ones he knew back in the day wouldn't last a month. (Nodding to you, Liz)  Stop dealing with terrorists; get shit done **NOW**!",
            "title_similarity": "0.5507264",
            "sentiment_compound": -0.3802
        },
        {
            "id": "gzwu48b",
            "score": 1,
            "text": "I really don’t see why we need a bipartisan vote. Simply create the committee and ask for 5 Republican volunteers to participate.",
            "title_similarity": "0.5190486",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzwu4o2",
            "score": 6,
            "text": "Biden must do this. For the good of the nation, and for just plain ethical reasons. The GOP need to be stopped from spinning the narrative of what happened on 1/6.",
            "title_similarity": "0.58748066",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzwu69w",
            "score": 2,
            "text": "Indeed, it is not just our \"democracy,\" which means so little to the Gophers Of Putin, but our COUNTRY that is at stake.  Russia and China must be laughing all the time at the dissension they have BOTH sowed here.  It is time for Dems to take action and use the 2nd Amendment, as pedophile Gaetz keeps pushing, against the GOP.  If the Gophers (which are different from good Repubs with ethics) want civil war, give it to them.  The North won once and it will win again.",
            "title_similarity": "0.6084382",
            "sentiment_compound": 0.9382
        },
        {
            "id": "gzwu79o",
            "score": 5,
            "text": "We should ask another country to investigate it for us.",
            "title_similarity": "0.456123",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwuf0e",
            "score": 1,
            "text": "Joe if you don’t like the situation then eliminate the filibuster.",
            "title_similarity": "0.47855085",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzwuff5",
            "score": 1,
            "text": "“Fine. I’ll do it myself.”",
            "title_similarity": "0.13842365",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwum6y",
            "score": 3,
            "text": "Game Theory: If you're not penalized for cheating, it's worth to do again.",
            "title_similarity": "0.35175115",
            "sentiment_compound": 0.5892
        },
        {
            "id": "gzwuode",
            "score": 1,
            "text": "Oh don’t worry. He won’t. “I’m more interested in looking forward” and all that shit",
            "title_similarity": "0.3065104",
            "sentiment_compound": -0.5434
        },
        {
            "id": "gzwuoim",
            "score": 1,
            "text": "In my opinion, comities proposed by those wanting to investigate the attempted insurrection do nothing substantially. Hear me out.\n\nWe have seen this type of event play out twice with the impeachment, yes it was unprecedented to have a US president impeached twice; but it never did anything substantially to move towards justice.\n\nI believe people's perspectives on how those are to be held accountable for the choas they foster needs to be approached differently. We cant expect anyone elected to hold the rule of law if the justice sought implys that they are to be held accountable. It simply does not happen. So what do you do?\n\nWell, the only thing you can do is make sure it doesnt go forgotten what happened. The re-writing of history and the actions of those who mean to harm the systems of democracy that we value are at jeopardy if we dont analyze why they occur, how they occured, and what we can do to prevent them.\n\nI believe Americans have a responsibility now more than ever to be present in the discussion of the responsibilities of their politicans they elect. Because as far as I can tell, most of the people who are, have given up on doing the right thing.",
            "title_similarity": "0.5736272",
            "sentiment_compound": 0.9135
        },
        {
            "id": "gzwur69",
            "score": 2,
            "text": "FO Republicans.  They’re just covering their ass.  We’re not living in an alternative reality.  The country saw and heard everything.  Why do they oppose an investigation?. \nThose who nothing hide, nothing fear.",
            "title_similarity": "0.5621018",
            "sentiment_compound": -0.6354
        },
        {
            "id": "gzwurme",
            "score": 1,
            "text": "How about forgive student loans",
            "title_similarity": "0.42782354",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzwuxj5",
            "score": 3,
            "text": "I hope this happens and I hope they investigate why McConnell asked the GOP to opppose the commission as a “personal favor”",
            "title_similarity": "0.5847341",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzwv90v",
            "score": 3,
            "text": "This is exactly why those GOP senators were arguing to vote for the commission. They knew if the GOP voted it down the democrats would just do a commission without them anyways (as they should). \n\nBut Mitch McConnell knows he can easily discredit the results with his base so it’s completely irrelevant who participates in it.",
            "title_similarity": "0.6100282",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzwvdxs",
            "score": 1,
            "text": "Wasn’t that the plan for some time? Pelosi almost immediately alluded to a house commission in her same day comments. \n\nThis is 24-hour news cycle crap.",
            "title_similarity": "0.59525776",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzwve1j",
            "score": 2,
            "text": "Absolutely, and if the Judiciary mounted investigations, they aught to do one, also. But this needs to be in addition to a Congressional committee, not in lieu of one.\nKeep holding representatives and senators to account. No one should forget that day.",
            "title_similarity": "0.55086195",
            "sentiment_compound": -0.631
        },
        {
            "id": "gzwveql",
            "score": 2,
            "text": "Can’t the House form their own commission as well?  Since when does the Senate gets to tell the House what they can or can not investigate?",
            "title_similarity": "0.59651434",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gzwvfls",
            "score": 1,
            "text": "Can he do such a thing!?!??\n\nSERIOUS ANSWERS PLEASE!",
            "title_similarity": "0.31908423",
            "sentiment_compound": 0.5293
        },
        {
            "id": "gzwvhbo",
            "score": 1,
            "text": "I’ve always liked Keith Olbermann. Going back to his days as an MSNBC anchor when I was a mid-teen, “Countdown with Keith Olberman”. His tossing of papers near the end of his show was exciting (apparently Joy Reid thinks so, too, because she does the same thing on her show) (maybe Keith’s the inspiration behind it, not sure). I’m not sure I understand what a “presidential commission” is.",
            "title_similarity": "0.4916848",
            "sentiment_compound": 0.8827
        },
        {
            "id": "gzwvpvo",
            "score": 3,
            "text": "It's a God damn waste of time running to the Republicans looking for approval, for fuck's sake, *they're the ones trying to kill you.*",
            "title_similarity": "0.64304453",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzwvte8",
            "score": 1,
            "text": "How about the government form a commission on the Wuhan virus?",
            "title_similarity": "0.5828049",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvtgu",
            "score": 1,
            "text": "It will be a witch-hunt.",
            "title_similarity": "0.4100094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwvtl6",
            "score": 2,
            "text": "That feeling when democrats filibuster more for longer and when they get it to them they cry like little babies about it",
            "title_similarity": "0.4911046",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzww3jf",
            "score": 1,
            "text": "Every single one of these jagoffs got geofenced once they entered the capitol building. \n\nFeed them to the DOJ and wait for them to flip on a MTG or Boebert.",
            "title_similarity": "0.5373024",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzww522",
            "score": 2,
            "text": "America is just regressing to Deadwood. An outlaw nation but now with technology. I don’t want to see the US fail or continue to embarrass itself on a global stage but I also don’t see how it improves from this point, the corruption and corporate greed machine is just so advanced. The entire culture has eaten itself.",
            "title_similarity": "0.5940138",
            "sentiment_compound": -0.5462
        },
        {
            "id": "gzww5qa",
            "score": 1,
            "text": "At this point, the GQP is basically just actively living, \"stop hitting yourself, stop hitting yourself!\" against their opponents.",
            "title_similarity": "0.37312466",
            "sentiment_compound": -0.3382
        },
        {
            "id": "gzww7un",
            "score": 1,
            "text": "Dems are weak and don't have the will to stand up to Republicans. Sorry but they are horrible at their jobs. They refuse to get rid of the filibuster. In four years we can welcome back Trump when they walk all over Biden.",
            "title_similarity": "0.585611",
            "sentiment_compound": -0.6858
        },
        {
            "id": "gzww997",
            "score": 1,
            "text": "End the filibuster or go around congress",
            "title_similarity": "0.6560528",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwwao8",
            "score": 1,
            "text": "Can Biden create a commission for this with an executive order? If so, then why wait for so long for this to fail in the Senate? Just get it going so we can stop wasting time.",
            "title_similarity": "0.69612277",
            "sentiment_compound": -0.786
        },
        {
            "id": "gzwwf59",
            "score": 2,
            "text": "If I ever need to insure myself that delusional people really exist, all I have to do is come here and see the top comments. Sadly, they never disappoint.",
            "title_similarity": "0.33658096",
            "sentiment_compound": 0.0665
        },
        {
            "id": "gzwwge1",
            "score": 3,
            "text": "Then he and Harris should stop being fucking cowards and do something about Joe Manchin. While they're at it, replace that limp-dick Chuck Schumer with someone that won't let McConnell walk all over him.",
            "title_similarity": "0.6444144",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzwwi4g",
            "score": 2,
            "text": "Biden wanted a bi-partisan thing because otherwise it will be seen solely as a political thing.",
            "title_similarity": "0.50910443",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwwit2",
            "score": 1,
            "text": "If Biden doesn't, I'm done with this party.",
            "title_similarity": "0.45668387",
            "sentiment_compound": 0.481
        },
        {
            "id": "gzwwk74",
            "score": 2,
            "text": "Democrats need to lean hard on the \"If you have nothing to hide, you have nothing to fear\" trope that Republicans love to use.",
            "title_similarity": "0.45204553",
            "sentiment_compound": 0.7873
        },
        {
            "id": "gzwwq24",
            "score": 1,
            "text": "This is one seriously fucked up bunch of sheep. Too stupid to see the evil right in front of you!  God will not take pity on those so ignorant. Good luck",
            "title_similarity": "0.39277768",
            "sentiment_compound": -0.8178
        },
        {
            "id": "gzwwqhs",
            "score": 2,
            "text": "Our democracy and our government was almost overthrown because idiots listened to and believed a psychopathic lunatic and his equally demented enablers. FORM A COMMISSION NOW!!!",
            "title_similarity": "0.6612249",
            "sentiment_compound": -0.6219
        },
        {
            "id": "gzwwqsr",
            "score": 2,
            "text": "It's vital to Russians and Republicans the American people are kept in the dark about the traitors to the flag who tried conducted a bloody, failed coup.",
            "title_similarity": "0.65248966",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzwws8y",
            "score": 16,
            "text": "I don't see what Republicans are so worried about. When it comes out definitivley that Ted Cruz, Josh Hawley, Jim Jordan, Tom Cotton, and the other GOP goons took part in inciting this violence, it won't hurt their chances of re-election in 2022, it'll most likely **boost** their profile among Republican voters.  \n\n\nThis country is so fucked up.",
            "title_similarity": "0.6096016",
            "sentiment_compound": -0.8805
        },
        {
            "id": "gzwwvdj",
            "score": 2,
            "text": "The Republican senators will pee in their depends if Biden did this.",
            "title_similarity": "0.62510306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwwybr",
            "score": 2,
            "text": "Since the Right is so concerned about the Constitution, why don’t we also use the punishments of that time? I wonder exactly how the fathers would condemn seditionists and traitors?",
            "title_similarity": "0.6822152",
            "sentiment_compound": -0.6966
        },
        {
            "id": "gzwx40v",
            "score": 2,
            "text": "I don't understand why this isn't a DOJ matter to begin with or a military matter. There should be tribunals where individual one is compelled to provide testimony in regards to the stochastic terrorism and insurrection he caused on 1/6 through the statements made on that day, the years of misinformation and propaganda he spread, and the direction coordination his party had with the individuals that commited treason .",
            "title_similarity": "0.6369694",
            "sentiment_compound": -0.8349
        },
        {
            "id": "gzwx608",
            "score": 2,
            "text": "Do we really need a commission to tell us that an insurrection backed by Donald Trump, with asperations to lynch Pence, Pelosi and others. attempted to overthrow America's lawmaking body of government.     All you need is a functioning pair of eyes and ears.",
            "title_similarity": "0.74545914",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzwx75y",
            "score": 2,
            "text": "Do it and include the republican members that voted in favor of the commission",
            "title_similarity": "0.4923579",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwx9w6",
            "score": 1,
            "text": "The Biden/Harris Administration already has an investigation going on through the DOJ.",
            "title_similarity": "0.39920038",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwxc8k",
            "score": 3,
            "text": "Make weed legal. That is all.",
            "title_similarity": "0.20946883",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzwxccb",
            "score": 3,
            "text": "“Though Biden has not specifically outlined a plan to form a presidential commission, the White House said Friday that he \"remains committed\" to pushing for an independent investigation of the January riot.”\n\nGod, I hope so 👏🏻",
            "title_similarity": "0.5106162",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzwxfg9",
            "score": 1,
            "text": "Could we get a TL;DR for all the people who aren't American or don't care pretty please?",
            "title_similarity": "0.45675814",
            "sentiment_compound": -0.7366
        },
        {
            "id": "gzwxfym",
            "score": 1,
            "text": "We the people who voted for you, Joe, demand accountability. We refuse to support any initiatives without accountability for criminal activities committed during the administration of the other guy.",
            "title_similarity": "0.5739803",
            "sentiment_compound": 0.5962
        },
        {
            "id": "gzwxi1u",
            "score": 2,
            "text": "Yeah can we also see what was actually uncovered by the previous investigation into trump? Like there was an entire report by a lifelong conservative that was brushed under the rug. Let's see it.",
            "title_similarity": "0.66603935",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzwxii8",
            "score": 1,
            "text": "Can we just have a new vote to end the filibuster and vote on the commission again this week? Doesn’t the majority leader set the schedule?",
            "title_similarity": "0.64300346",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwxpd1",
            "score": 1,
            "text": "I think we'd all like a 9/11 like a commission on the pandemic.\n\nThe internet feels aren't replacing the paychecks we lost.",
            "title_similarity": "0.6141544",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzwxr10",
            "score": 1,
            "text": "That's how checks and balances work. The Judiciary and the Executive branches hold the Legislative in check. The Legislative branch doesn't SELF-REGULATE!",
            "title_similarity": "0.4954505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwxr7d",
            "score": 1,
            "text": "This is all so stupid. If Dems want to investigate something, they can. They control the Justice Department, they control at least ~10 Congressional committees with subpoena power.",
            "title_similarity": "0.5192398",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gzwxyxr",
            "score": 2,
            "text": "End the filibuster and stop “studying the Supreme Court” and add more members. Also, make DC a state",
            "title_similarity": "0.6385436",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzwylkv",
            "score": 2,
            "text": "Filibuster is just an waste of money and there is moving forward result. I want the result, soon or later, majority of the discussion/problem has to be solve in order to move forward. Fk republican",
            "title_similarity": "0.5784183",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzwyo38",
            "score": 2,
            "text": "If we can’t do things democratically because of fascists, then we’ve got to do things presidentially. Sign those executive orders. Use your authority and make sure the right thing is done.",
            "title_similarity": "0.6735909",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzwyodu",
            "score": 1,
            "text": "How about he does away with student debt first",
            "title_similarity": "0.51981086",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzwysa2",
            "score": 1,
            "text": "The Republicans who voted against have set their own trap.  If they are implicated in any way, we'll look back at their vote.  Should be a fun news day.",
            "title_similarity": "0.61491454",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzwyvtu",
            "score": 1,
            "text": "Hear me out: maybe this is the play all along? If the GQP actually did come together to vote for a commission, then great. However, now that they have, unilaterally, blocked the commission (even when other GQP members were in favor), the Dems can (and should) announce a Presidential Commission with the support of GQP members that voted in favor of the commission that was blocked. \n\nAs far as political plays go, it allows for the GQP to continue to show their obstruction and rejection of bipartisanship, and Democrats now have this (along with much more) ammo to go after the GQP in the 2022 midterms.",
            "title_similarity": "0.7725353",
            "sentiment_compound": 0.836
        },
        {
            "id": "gzwz2we",
            "score": 1,
            "text": "Please do. Don’t let the thugs get away with this",
            "title_similarity": "0.3346656",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzwz5nq",
            "score": 1,
            "text": "Republicans can easily discount House hearings as partisan because we've had a quite a few of them recently, and they may have lost their luster to the public as a result.  For it to have any impact, something really earth-shattering needs to be uncovered.  We had several such smoking guns while Trump was in office, but he is no longer in any position to quash them with any authority.",
            "title_similarity": "0.54367876",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzwz7qn",
            "score": 1,
            "text": "I want a commission on why we still have a fucking filibuster after this.",
            "title_similarity": "0.6164356",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzwzbd7",
            "score": 1,
            "text": "100% I voted for Biden because Trump is a dictator who HAS TO be stopped.\n\n\n100% he needs to be more assertive. Nobody is worried about Biden breaking the law. Crack a few goddamn eggs to make an omelette.\n\n100% he also looks like this guy\nhttps://media.giphy.com/media/tITteBs39mnoA7EzbW/giphy.gif",
            "title_similarity": "0.58865833",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzwzbg7",
            "score": 1,
            "text": "This needs to happen.",
            "title_similarity": "0.21566126",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzj0p",
            "score": 1,
            "text": "What about Michigan?",
            "title_similarity": "0.26295087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzlul",
            "score": 1,
            "text": "If he can he BETTER...",
            "title_similarity": "0.22601302",
            "sentiment_compound": 0.5622
        },
        {
            "id": "gzwzpiu",
            "score": 1,
            "text": "Didn't know a presidential commission was a thing",
            "title_similarity": "0.5123373",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzwzsgx",
            "score": 3,
            "text": "Makes you wonder if they took some of those Republican lives to make them take it seriously on that day...if only.  What a sad reality they are living in",
            "title_similarity": "0.59474677",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzwzt11",
            "score": 6,
            "text": "fucking do it.   make the republicans pay for what they did",
            "title_similarity": "0.5905666",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzwzv26",
            "score": 3,
            "text": "The GOP doesn't want the 1/6 insurrection investigated because they know they are the reason it happened.",
            "title_similarity": "0.49821532",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gzx09zr",
            "score": 1,
            "text": "> Honoring our responsibility to the Congress in which we serve and the Country which we love, Democrats will proceed to find the truth\n\nWhat truth? It was a pretty straightforward event, was it not? These are the same folks that have declared loudly and often that trump publicly called for an insurrection and are openly and regularly referring to their colleagues as terrorists.\n\nSo what truth exactly are we looking for here?\n\nAlso, big lolz at expecting Biden to lift a finger here. That's actually hilarious",
            "title_similarity": "0.64537394",
            "sentiment_compound": 0.9624
        },
        {
            "id": "gzx0cdd",
            "score": 1,
            "text": "Should be the dirt of a sitting President to investigate the last person. See a president. Make em behave.",
            "title_similarity": "0.7729806",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzx0ezq",
            "score": 1,
            "text": "Oh, we can just do it that way? Full send.",
            "title_similarity": "0.2319662",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx0gpr",
            "score": 1,
            "text": "This is where I filter r/politics for a month and check back to see if this can has been kicked closer to the recycling bin.",
            "title_similarity": "0.47937143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx0j0m",
            "score": 1,
            "text": "If calls mounted for removing the filibuster after the fiasco over min wage, we wouldn’t even be here right now.",
            "title_similarity": "0.58949614",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzx0nqi",
            "score": 2,
            "text": "The Warren Commission, officially known as the [President's Commission on the Assassination of President Kennedy,](https://en.wikipedia.org/wiki/Warren_Commission) was established a week after the assassination of JFK by Executive Order 11130.\n\nI think Biden will do it.",
            "title_similarity": "0.6686377",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gzx0w98",
            "score": 3,
            "text": "The filibuster was essentially a guilty plea. I’m surprised they did that honestly because it seems more politically advantageous for them to have equal weight then try to tank the findings. Now they can’t really do that - the most they can do is cry “partisanship” and “witch hunt” but I think that’s gotten pretty stale for anyone who wasn’t already in their camp.",
            "title_similarity": "0.52506316",
            "sentiment_compound": 0.6897
        },
        {
            "id": "gzx0zyi",
            "score": 3,
            "text": "Let's do this shit. Let's beat these crybaby Republicans again",
            "title_similarity": "0.61778116",
            "sentiment_compound": -0.6428
        },
        {
            "id": "gzx165u",
            "score": 4,
            "text": "GOP is the party of the I got mine fuck yous of the world.",
            "title_similarity": "0.51591325",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzx1gnc",
            "score": 2,
            "text": "This will be a defining moment for his presidency.  If he doesn't do this, he's failed as president in his first 6 months.",
            "title_similarity": "0.61636513",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzx1h5d",
            "score": 2,
            "text": "Can you imagine if the parties were reversed and Trump was in charge.  Put a vote together to investigate?   Pffft.  He'd grab that committee right in the pussy and put them to work.",
            "title_similarity": "0.70055294",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzx1ios",
            "score": 2,
            "text": "Just do it!",
            "title_similarity": "0.14918606",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx1sfq",
            "score": 1,
            "text": "Don’t hold your breathe while you wait for this to happen.",
            "title_similarity": "0.31568038",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx1t95",
            "score": 2,
            "text": "I highly doubt he will.  He's still stuck in this delusional mindset that he can \"work with\" Republicans. \n\nIt's a shame.  We had to fight hard to get him into the White House.  If he doesn't nut up, and get shit done, it'll all be for naught when Trump reruns in '24.",
            "title_similarity": "0.70693403",
            "sentiment_compound": -0.9259
        },
        {
            "id": "gzx1xrt",
            "score": 1,
            "text": "Isn't the justice department investigating Jan. 6th? This all feels like a distraction.",
            "title_similarity": "0.512919",
            "sentiment_compound": -0.4359
        },
        {
            "id": "gzx23in",
            "score": 1,
            "text": "I would argue not only should Biden do this, but constitutional the Executive and Judicial branch are supposed to be another check and balance against the legislative branch, so it’s his constitutional obligation",
            "title_similarity": "0.59811413",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzx25v3",
            "score": 2,
            "text": "Republicans make me feel profound shame for being American.",
            "title_similarity": "0.58352476",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzx26ae",
            "score": 1,
            "text": "moot point. it'll be cast as nothing but a dem witch hunt and exacerbate political tensions when 30% of the country wouldnt mind at all killing democrats. there will be no investigation.",
            "title_similarity": "0.56296587",
            "sentiment_compound": -0.9493
        },
        {
            "id": "gzx28a2",
            "score": 2,
            "text": "If anything, this whole process has made me feel that they are all working for the billionaires of this world and everyone else is fucked. The GOP blatantly break all laws and the democrats just waste time trying to be \"civil\". THAT HASN'T WORKED IN OVER 2 DECADES. Fuck politics and fuck the few thousand billionaires on this planet. Maybe we need to all come together and rid ourselves of these parasites.",
            "title_similarity": "0.61680865",
            "sentiment_compound": -0.9349
        },
        {
            "id": "gzx28jp",
            "score": 3,
            "text": "And maybe prosecute the cowardly bastards for permitting the coup attempt and now trying to cover it up?",
            "title_similarity": "0.6369042",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gzx2bae",
            "score": 8,
            "text": "The commission was the GOPs last chance to change the narrative.  If they don’t want that, I’m comfortable with the DoJ conducting its own investigation free from political input",
            "title_similarity": "0.428586",
            "sentiment_compound": 0.836
        },
        {
            "id": "gzx2ew3",
            "score": 1,
            "text": "More like Fillabusted!",
            "title_similarity": "0.25309289",
            "sentiment_compound": 0.474
        },
        {
            "id": "gzx2jib",
            "score": 2,
            "text": "1/6 was the worst attack on American soil\n\n9/11 = wet fart",
            "title_similarity": "0.4536205",
            "sentiment_compound": -0.802
        },
        {
            "id": "gzx2l67",
            "score": 2,
            "text": "Was Sanders filibuster ‘cowardly’?",
            "title_similarity": "0.584554",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx2mfb",
            "score": 1,
            "text": "Dunno why this wasn’t the first option anyway...seeing as those who aided and abetted, incited, participated, perpetuated the lie would be investigating themselves. Like, they can’t be trusted to do anything other than destroy America. Bin Laden’s legacy was Trump and now the GQPeen party is *the* white nationalist party of the century trying to herald in a new plausibly denied Nazi (or whatever rebranding they have now) era. \n\nWhat a time to be alive.",
            "title_similarity": "0.71649814",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzx2mw4",
            "score": 1,
            "text": "Why isn't this simply referred to the attorney general?",
            "title_similarity": "0.48657525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx2p5b",
            "score": 1,
            "text": "How does any actual supporter for a replication take their party seriously with these actions? Theirs no accountability or power in our government anymore.",
            "title_similarity": "0.6064885",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzx2unq",
            "score": 16,
            "text": "Hang on a minute, I thought the narrative used to be that January 6th was secretly an antifa thing. If Republicans really believe that, why aren't they beside themselves trying to get this commission started to get to the truth of the matter. Oh wait, I think I understand now.",
            "title_similarity": "0.6660429",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzx2wrl",
            "score": 1,
            "text": "\"Calls Mount\" Aka this is what we at Newsweek want to happen. Tired of these opinion pieces being disguised as news. (This is coming from someone who supports a January 6th investigation)",
            "title_similarity": "0.7021985",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx2zau",
            "score": 3,
            "text": "Get rid of the filibuster first, otherwise a Presidential Commission would be the excuse that “see? we don't need to fix anything after all.”",
            "title_similarity": "0.63849425",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzx31ig",
            "score": 3,
            "text": "One. Hundred. Percent.\n\nObviously they have something to hide. Do you ask criminals if it's ok to investigate them? No!",
            "title_similarity": "0.50806123",
            "sentiment_compound": -0.5411
        },
        {
            "id": "gzx365p",
            "score": 2,
            "text": "What exactly is the point of this investigation?  What do they hope to find?  Serious questions.",
            "title_similarity": "0.4061916",
            "sentiment_compound": 0.4515
        },
        {
            "id": "gzx36zb",
            "score": 6,
            "text": "Conservative cowards. Most of them.",
            "title_similarity": "0.36359832",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx3et9",
            "score": 5,
            "text": "Jesus Christ, as someone outside the US ..i cant believe some of the shit that goes on there. Hope ye hold everyone accountable",
            "title_similarity": "0.47284618",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gzx3h0r",
            "score": 3,
            "text": "Republican efforts to turn the U.S. into a shithole, corrupt country need to be stopped already.",
            "title_similarity": "0.6661107",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzx3hiw",
            "score": 1,
            "text": "It’s about to be June - this should have happened day 1, immediately after resuming Congress. Same with impeachment and conviction.\n\nLetting the assembled leave was an absolute mistake by congressional leadership. They abandoned the nation after an attack",
            "title_similarity": "0.73021686",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gzx3hve",
            "score": 1,
            "text": "As the top cop in the land, let’s see if he’s got the cahones.",
            "title_similarity": "0.37885988",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzx3kdu",
            "score": 3,
            "text": "~~Cowardly~~\n\nTraitorous",
            "title_similarity": "0.3952109",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzx3nuz",
            "score": 1,
            "text": "IIRC, the executive branch already has an investigation underway.",
            "title_similarity": "0.4017517",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx3t40",
            "score": 3,
            "text": "Not taking action on this issue is tacit defeat. Democracy dies in darkness.",
            "title_similarity": "0.497338",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzx3tna",
            "score": 2,
            "text": "If Biden doesnt stop the bullshit across the aisle attempts and start fixing shit i will NOT vote for him or any dem next presidential election. I voted against my own interests again for this? Seriously?",
            "title_similarity": "0.6914289",
            "sentiment_compound": 0.2132
        },
        {
            "id": "gzx3ujm",
            "score": 2,
            "text": "How about Medicare for those who want it? Any calls for that?",
            "title_similarity": "0.40819916",
            "sentiment_compound": 0.168
        },
        {
            "id": "gzx3xt5",
            "score": 6,
            "text": "And one of its goals should be to uncover exactly why Mitch McConnell called in a personal favor to vote against it.",
            "title_similarity": "0.6600505",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzx3zc2",
            "score": 2,
            "text": "Break the filibuster.  Pass what we out in or be prepared to be replaced.",
            "title_similarity": "0.5892697",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzx41zv",
            "score": 2,
            "text": "This needed to happen two months ago haha.  The window is closed, midterms are around the corner, sometimes I wonder if the dems really care about GOP control at all.  Without them who would they blame?",
            "title_similarity": "0.57480645",
            "sentiment_compound": 0.624
        },
        {
            "id": "gzx43v6",
            "score": 4,
            "text": "If he doesn’t, I will seriously start questioning if caring about the future of our country is even worth it… It’s like we’re all on this big ass bus with the gear stuck in reverse and the gas pedal pinned down, speeding towards a ledge of fear and uncertainty. \n\nMeanwhile the driver is in the back fixing a stuck window for the asshole passenger who jammed it intentionally for the sole purpose of being able to loudly complain about the bus and service being provided. Oh, and the driver expected this unruly behavior all along but had hoped the asshat would “do the right thing”. We’re doomed.",
            "title_similarity": "0.46500963",
            "sentiment_compound": -0.8151
        },
        {
            "id": "gzx47zt",
            "score": 4,
            "text": "“Guys we asked the republicans and they said no",
            "title_similarity": "0.48452276",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzx4d6h",
            "score": 1,
            "text": "Swear to god this system makes me feel like a hostage. What do they say? Cutting the nose to spite the face?",
            "title_similarity": "0.5709875",
            "sentiment_compound": -0.2168
        },
        {
            "id": "gzx4koj",
            "score": 6,
            "text": "So... the folks that had 465336764665 Bengazi hearings and Buttery Males BS give us this? What a bunch of duds.",
            "title_similarity": "0.5462689",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx4mk8",
            "score": 2,
            "text": "It won't be Biden.  Pelosi will do this.",
            "title_similarity": "0.31378978",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx4ul7",
            "score": 1,
            "text": "The deadliest attack on the Capitol. Except for:  \n\nhttps://en.wikipedia.org/wiki/1954_United_States_Capitol_shooting",
            "title_similarity": "0.5427164",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzx54ae",
            "score": 2,
            "text": "Forget about filibuster. Use executive order and plow over them.",
            "title_similarity": "0.6004891",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzx54pp",
            "score": 1,
            "text": "More interested In the origins of covid.",
            "title_similarity": "0.39751834",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gzx55ha",
            "score": 1,
            "text": "If anyone can answer, what would this designated commission do that is different in its investigations or would it be able to act on special powers that the current bureaus investigating are not able to presently?\n\nIs this something needed for a secured handling of the process to eliminate any bias?",
            "title_similarity": "0.46802923",
            "sentiment_compound": 0.6553
        },
        {
            "id": "gzx59b7",
            "score": 1,
            "text": "Why is Biden always exaggerating his dick size in photos?",
            "title_similarity": "0.4381025",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzx5a5e",
            "score": 1,
            "text": "Could someone dumb this down for me please.",
            "title_similarity": "0.3940308",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzx5dk0",
            "score": 2,
            "text": "Lemmie guess what's gonna happen:\n\n\"We must seek bi-partisanship and therefore we should not look into the events of January 6th.\"\n\nExpect the Democrats to shoot themselves in the foot AGAIN and allow Republicans to get people killed in the Capitol, all because the Democratic leadership is so disconnected from what their constituents want and reality itself. I'd put money on this.",
            "title_similarity": "0.7292341",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzx5efl",
            "score": 1,
            "text": "America hasn't been selling 'the American dream' for decades, it's time to fix that.",
            "title_similarity": "0.4454341",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzx5ehn",
            "score": 3,
            "text": "Traitorous filibuster*",
            "title_similarity": "0.49678677",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx5n66",
            "score": 3,
            "text": "The democrats could have called a vote. I do not understand, 11 republicans were gone so why did they not call for it?",
            "title_similarity": "0.539118",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx5sfi",
            "score": 1,
            "text": "The most important thing to do before anything else is to pass the VOTING RIGHTS BILL - pass that and everything else will eventually be taken care of - FAIL and we will turn into an authoritarian nation and democracy will be dead.",
            "title_similarity": "0.6679727",
            "sentiment_compound": -0.6416
        },
        {
            "id": "gzx5sjr",
            "score": 2,
            "text": "Biden should be on a full court press to get his and the progressive agenda across the line. \n\nRepubs like Cruz and turtle neck will just burn it all down whenever they get back power. \n\n2 steps forward, 1 step back will at least keep progress in the right direction.",
            "title_similarity": "0.56335276",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzx5xyk",
            "score": 2,
            "text": "Double edged sword.\n\nManchin can say see there are alternatives to getting around the filibuster without ending it.",
            "title_similarity": "0.45545378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6203",
            "score": 3,
            "text": "They're fighting so hard to keep it from being investigated. At first it looked like some like MTG had provided then some info and encouraged the attack, but with how hard they're pushing right now it seems like nearly the entire Republican congress had a direct hand in what happened.",
            "title_similarity": "0.6197702",
            "sentiment_compound": 0.7886
        },
        {
            "id": "gzx62f0",
            "score": 2,
            "text": "Whats the difference in judicial power between the Congressionally voted 1/6 Commission and Bidens Blue Ribbon Commission? Is there a reason Congress went first?",
            "title_similarity": "0.60093546",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx630e",
            "score": 3,
            "text": "Nail these fuckers down",
            "title_similarity": "0.41171536",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzx64h4",
            "score": 2,
            "text": "Serious question. I am not in the USA, so can’t know. But 90% of the comments here say the “Democrats need to stop worrying about their image and stop trying to compromise” etc. \n\nBut what is the likelihood that they (Dems) aren’t acting more forcefully, due to fear of igniting massive and violent civil unrest by the GOP base against the country and government, if they were to actually prosecute, jail, punish? Is the horrifying prospect what it could unleash be the reason they seem to do so little? \n\nI am not for a second suggesting that all involved and responsible should not be punished due to fear of potential reprisal. But nobody ever mentions that as a consideration that may be a huge factor in the Dems’ strategies, nor how that might be mitigated if so. And the GOP base being “too dumb to understand” even if true clearly doesn’t stop them from expressing themselves violently.",
            "title_similarity": "0.6508045",
            "sentiment_compound": -0.9868
        },
        {
            "id": "gzx6bby",
            "score": 1,
            "text": "I’m so tired of bipartisan fighting....",
            "title_similarity": "0.5017925",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gzx6h8z",
            "score": 2,
            "text": "Bipartisanship is code for sucker to the GQP. Get this thing started.",
            "title_similarity": "0.6307622",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzx6ha5",
            "score": 2,
            "text": "First mention of Keith Olbermann I've seen in a while.  Wish he were still a regular on MSNBC.",
            "title_similarity": "0.5042691",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzx6lya",
            "score": 2,
            "text": "Can I get \"Absolutely nothing is going to happen\" for $600 please.",
            "title_similarity": "0.45029667",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzx6sp9",
            "score": 1,
            "text": "Holy shit. Imagine being this compliant to the same government you all say you hate.",
            "title_similarity": "0.6162528",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gzx6ssp",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzx6wmf",
            "score": 1,
            "text": "The Democrats aren't an opposition to Republicans. They're a more polite alternative. There were enough Republicans out of DC for them to end the filibuster and they didn't do it.",
            "title_similarity": "0.444241",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx6zqb",
            "score": 3,
            "text": "It’s time to stop caring about bipartisanship. The gop did whatever they wanted for the last four years. No reason to meet them halfway now. How did the saying go….. “fuck your feelings “?",
            "title_similarity": "0.56501293",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzx718x",
            "score": 3,
            "text": "You know who would have made power moves? Bernie fucking Sanders.",
            "title_similarity": "0.51366985",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx74mm",
            "score": 6,
            "text": "Just get rid of the fucking filibuster already.",
            "title_similarity": "0.4714954",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx75eh",
            "score": 2,
            "text": "In the thumbnail he literally looks like Jeff Dunhams Walter puppet",
            "title_similarity": "0.36167687",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx76kh",
            "score": 3,
            "text": "How the hell are people more up in arms about this than healthcare or minimum wage? This is why America is broken. We only seem to care about the performative stuff.",
            "title_similarity": "0.61167216",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzx7amy",
            "score": 6,
            "text": "Dude I fucking LOVE how the people over at r/conservative are the type of people to jerk themselves off endlessly about the troops and now they are literally fucking pissing on their graves on Memorial Day fucking weekend.",
            "title_similarity": "0.5095272",
            "sentiment_compound": -0.0943
        },
        {
            "id": "gzx7c4v",
            "score": 6,
            "text": "I think it's literally criminal that there isn't some form of investigation going on already.  It was televised... people died... this country was very close to being overthrown by a cheeto throwing a temper tantrum",
            "title_similarity": "0.6326499",
            "sentiment_compound": -0.9118
        },
        {
            "id": "gzx7i67",
            "score": 3,
            "text": "McConnell is a cancer.. GOP is trash...Republicans are idiots",
            "title_similarity": "0.5232953",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzx7ivy",
            "score": 3,
            "text": "We don't have time to pretend the GQP will ever act with good will and do the right thing.  \n\nLet's just move forward and get to the bottom of all of this.",
            "title_similarity": "0.4887609",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzx7jp8",
            "score": 2,
            "text": "If there were discernible facts indicating that left wing extremists had stolen the 2020 presidential election, then it would be a matter of critical importance that a commission be established so the nation could have an agreed upon and thoroughly investigated narrative to teach future generations about the episode.\n\nLikewise, future generations need to know how republican officials, including the president, spouted conspiratorial and jingoistic nonsense to whip up and direct a mob to attack the capitol building in a failed coup attempt.",
            "title_similarity": "0.73297054",
            "sentiment_compound": -0.872
        },
        {
            "id": "gzx7jxd",
            "score": 1,
            "text": "It's already being investigated on multiple levels by multiple agencies with results. This is redundant theatrics to placate people's bias.",
            "title_similarity": "0.46503708",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzx7niv",
            "score": 2,
            "text": "Isn’t the Federal Bureau of Investigations investigating this?",
            "title_similarity": "0.44220328",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx7uss",
            "score": 2,
            "text": "The real message here is that it's OK to storm the capital when you disagree with anything. So feel free to storm anytime everybody.",
            "title_similarity": "0.36796927",
            "sentiment_compound": 0.6009
        },
        {
            "id": "gzx83d7",
            "score": 3,
            "text": "This is insane. How can the republicans still be seen as patriots at all??? They’re literally working against the country.",
            "title_similarity": "0.6143233",
            "sentiment_compound": -0.5007
        },
        {
            "id": "gzx83wm",
            "score": 3,
            "text": "I’ll never understand how people didn’t know the GQP would filibuster bomb an investigation into themselves when they were very open about their corruption for the last 4 years. \n\nThe only hope of getting this done was through presidential action to begin with. \n\nBiden has been doing much better than expected in his first 100 days. I really hope he doesn’t start slipping now.",
            "title_similarity": "0.5732104",
            "sentiment_compound": 0.6997
        },
        {
            "id": "gzx88rc",
            "score": 2,
            "text": "And if it happens, please Republicans, tell us more about *Executive overreach*...",
            "title_similarity": "0.6081957",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzx8gab",
            "score": 2,
            "text": "Im a bit of a stickler meeseeks?  What does the republican party stand for these days?",
            "title_similarity": "0.6514192",
            "sentiment_compound": 0.4696
        },
        {
            "id": "gzx8ghr",
            "score": 1,
            "text": "cool. can we actually do something about it?",
            "title_similarity": "0.18505287",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzx8x7m",
            "score": 1,
            "text": "Each of the member of both Representative and Senate pledged an Oath of   \nAllegiance, with the words \" To defend the Constitution and laws of the   \nUnited States against all enemies both foreign and domestic \" , if   \nRepublicans cannot understand that January 6th was an attack against   \nboth the Constitution and The Laws of the United States by domestic   \nenemies then maybe they are also domestic enemies of Democracy and the   \nConstitution. Republicans are by their actions, or lack there of,   \nsupporting the chaos of a Trump Presidency that culminated in the   \nstorming of the Capital by his supporters. The people deserve to know   \nhow and what lead these thousands of citizens to believe that the   \nelection was fixed and why the Republican party are so reluctant to   \ninvestigate.",
            "title_similarity": "0.6854607",
            "sentiment_compound": -0.7841
        },
        {
            "id": "gzx8y2x",
            "score": 6,
            "text": "I'm shocked that Republicans aren't champing at the bit to prove once and for call that it was ANTIFA.\n\n&#x200B;\n\n(comment drenched in sarcasm)",
            "title_similarity": "0.59043336",
            "sentiment_compound": -0.5744
        },
        {
            "id": "gzx8ypk",
            "score": 2,
            "text": "Anytime there is a commission formed, it's only an attempt to cover up the government's own involvement. They can't afford for their deceptions to be exposed. In the power struggle of American \"democracy\", our \"elected\" corrupt leadership is made up of white collared criminals and sex offenders.",
            "title_similarity": "0.65454787",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gzx91pv",
            "score": 2,
            "text": "Is it just me? Or does joe biden look like walter? Jeff dunham's old man puppet, in this picture.",
            "title_similarity": "0.45816654",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gzx93rt",
            "score": 6,
            "text": "At this point we'd probably be better off renaming the country to the States of America. We're certainly not united on anything and I don't think I'll see it again in my lifetime. It sucks.",
            "title_similarity": "0.58810025",
            "sentiment_compound": 0.12
        },
        {
            "id": "gzx97kq",
            "score": 5,
            "text": "This is what they want.  If the left forms the commission, they can band together and claim its biased and partisan and therefore must be lies.",
            "title_similarity": "0.5784043",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzx9dr2",
            "score": 2,
            "text": "[Is it just me?](https://www.jeffdunham.com/wp-content/uploads/2016/02/walter-4.png)",
            "title_similarity": "0.37150928",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx9j6g",
            "score": 8,
            "text": "Innocent people don’t need to hide. Innocent people should embrace an investigation with open arms. \n\nBy the GOP blocking this they are further cementing their responsibility for the attack.",
            "title_similarity": "0.4122208",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzx9oo6",
            "score": 2,
            "text": "$1,000 dollars says Biden will not do this.",
            "title_similarity": "0.51556265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx9x8y",
            "score": 2,
            "text": "He should have done this as soon as he came into office.  \n\nLack of strong action and messaging regarding 1/6 has sent a very clear message to the fascists that their bullshit will be tolerated",
            "title_similarity": "0.5476388",
            "sentiment_compound": -0.1796
        },
        {
            "id": "gzxabca",
            "score": 3,
            "text": "there wasnt even a filibuster. \n\nthat is the actual problem. a fake filibuster costs the opposition nothing. they won the lottery without even buying a ticket. \n\nMake Them Speak! Force the Vote!",
            "title_similarity": "0.4902794",
            "sentiment_compound": -0.8549
        },
        {
            "id": "gzxawv4",
            "score": 2,
            "text": "“A purely political exercise”.. uhm, yeah... aren’t you in politics?",
            "title_similarity": "0.5189066",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxb1az",
            "score": 3,
            "text": "Do it Joe",
            "title_similarity": "0.16812068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxbcn1",
            "score": 2,
            "text": "I bet 80 million people would vote yes for this",
            "title_similarity": "0.2904324",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzxbvt6",
            "score": 2,
            "text": "he's been attempting to stay above the fray, but the fray has reached his heels.\n\nhe should do it.",
            "title_similarity": "0.37504148",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzxbwwu",
            "score": 2,
            "text": "Hell yes they should. The dems need to stop pussy-footing around and go after the G.O.P. the way they would, do, and continue to attack the Dems. I would love to see that fat orange blop in the hot seat for 11 hours.",
            "title_similarity": "0.5398772",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzxcbdy",
            "score": 7,
            "text": "I am so sick and tired of these Republicans. I can’t remember a time in my life (and I’m 46 now) where I have had the disdain for a political party than I do now and it’s never been that way for me as I’ve always felt like there were part of each party’s philosophical ideas I could understand and get behind. Not anymore these people are nuking futz.",
            "title_similarity": "0.49478504",
            "sentiment_compound": -0.7434
        },
        {
            "id": "gzxcs8p",
            "score": 1,
            "text": "The picture of Biden they used for this article [looks like Walter](https://miro.medium.com/max/371/0*zOvXWKV9hTqnl2X5.png) from Jeff Dunham’s act.",
            "title_similarity": "0.4786473",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxcslb",
            "score": 4,
            "text": "President Biden needs to stand up to this mockery of injustice . The republicans have proven to world by voting against the commission that Democracy is a sham , they have shown the world their party is the Trojan horse  of democracy and freedom living nations of the world and America cannot be trusted.Why did our grandfathers and great grandfathers shed blood and lost their lives fighting against tyranny throughout the world, if the so called American party , Republican Party would vote against a commission of truth, a bipartisan commission of integrity. That would investigate fairly the reason for insurrection committed by the very president of United States against the government and people of the United States of America.  Their vote against such a commission shows our founding Fathers envisioned that America would lead the nations of the world by example  and its hold to its values of truth and liberty and justice for all is just a joke. And America is no better than Russia China and North Korea. Thanks Moscow Mitch, NRA and others.  The reason for  George Washington and others declaring independence from England  because y’all time travel  back to the  Colonial period and told them America would pay homage to King Putin and Benedict trump! Thanks guys! Great job!",
            "title_similarity": "0.74542",
            "sentiment_compound": 0.9901
        },
        {
            "id": "gzxcz4w",
            "score": 3,
            "text": "That’s not what’s gonna happen. Pelosi is gonna launch a House investigation in the same way the House GOP did Benghazi",
            "title_similarity": "0.69377893",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxdc5j",
            "score": 3,
            "text": "Nuke the filibuster.",
            "title_similarity": "0.4414187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxdjf7",
            "score": 2,
            "text": "How come 35 republicans can filibuster under Biden, but democrats didnt filibuster under Trump, when he was appointing judges and what not?",
            "title_similarity": "0.53509104",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxe0g0",
            "score": 3,
            "text": "How does anyone not want justice to be served? I mean, they're not guilty of wrongdoing and/or breaking laws, right?",
            "title_similarity": "0.32679033",
            "sentiment_compound": -0.2561
        },
        {
            "id": "gzxe1ug",
            "score": 1,
            "text": "Couldn’t we try to have a peaceful March in Washington demanding the senators and congressmen investigate the insurrection and get rid of the filibuster. We can’t just sit and watch and comment. I’m so scared for our country despite all her imperfections.",
            "title_similarity": "0.67561734",
            "sentiment_compound": -0.3488
        },
        {
            "id": "gzxe38p",
            "score": 3,
            "text": "How about just starting the criminal investigations? A large number of the elected Republicans, including Trump, aided abetted criminals attempting to overthrow the U.S. government. Many of them are still aiding and abetted the criminals. All one has to do is \"roll the tape\" to see the clear cut evidence.",
            "title_similarity": "0.6188169",
            "sentiment_compound": -0.875
        },
        {
            "id": "gzxe4x6",
            "score": 4,
            "text": "\"But the republicans will say it's a politically motivated hatchet job!\"\n\nYeah and? That's all they fucking do these days. Fuck em. Don't work with people that want a hostile takeover of your government. You bulldoze them.",
            "title_similarity": "0.7033186",
            "sentiment_compound": -0.2942
        },
        {
            "id": "gzxe69f",
            "score": 5,
            "text": "Johnson established the Warren Commission a week after Kennedy was shot and, while there are plenty of valid criticisms of the Warren Report, nobody says \"oh that's bullshit because the president created it by executive order.\" Biden has been given a gift by these chumps to just create the investigation and staff and mandate it how he pleases. They can complain about partisanship all they want from jail.",
            "title_similarity": "0.60107625",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzxejoj",
            "score": 2,
            "text": "Non-traitors cannot let this stand.",
            "title_similarity": "0.3096978",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxenyz",
            "score": 1,
            "text": "I don't know how your system of law works. But just skip the investigation and charge everyone (big wigs) involved. Every one saw what happen. There seems to be enough evidence. We heard the speeches. Saw the violence. And the aftermath. Why do we need to draw it all out again. Have actual consequences for these laws. A police officer was lynched on the steps of your capitol building in front of the entire world. I don't get how you don't stand the fuck up for this? It doesn't matter what 'team' you cheer for. They know the technique of constantly deflecting questions about scandals until another scandal happens to dilute the spotlight. Enough is enough. The FBI or whoever should be kicking in doors of all the people on stage that day. Drag them all in dressed in orange and have them, (not their lawyers) answer all the questions.",
            "title_similarity": "0.54019654",
            "sentiment_compound": -0.8416
        },
        {
            "id": "gzxf0ar",
            "score": 3,
            "text": "Let pelosi do it. Put liz Cheney on there, claim bipartisan and sit back.",
            "title_similarity": "0.5945872",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxf23o",
            "score": 3,
            "text": "Crazy how the minority can just not show up and still win. They should be made to go or not get paid. Who else can not do their job and still take advantage of their constituents?",
            "title_similarity": "0.5541591",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzxf7u3",
            "score": 2,
            "text": "Come back to it later. Stay focused",
            "title_similarity": "0.08332241",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzxfncc",
            "score": 3,
            "text": "Do that shit! Charge every single seditionist and insurrectionist to the full extent of the law in order to quell any further attempts at hindering our electoral process",
            "title_similarity": "0.566303",
            "sentiment_compound": -0.5983
        },
        {
            "id": "gzxfviy",
            "score": 2,
            "text": "All we need to do is outlaw the republican party as terrorist insurrectionists and ban their candidates from running for office and the takeover will be complete.",
            "title_similarity": "0.62796134",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzxfyb7",
            "score": 2,
            "text": "Yep. And dismiss the GOP entirely. Form a commission with Dems and never Trump GOP and pound the MAGA GOP into the ground.",
            "title_similarity": "0.5968753",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxg373",
            "score": 1,
            "text": "I thought we didn’t negotiate with terrorist.",
            "title_similarity": "0.46502334",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzxgg7r",
            "score": 1,
            "text": "cowardly it is, well said.",
            "title_similarity": "0.32988647",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzxgoz8",
            "score": 2,
            "text": "Yes please.  Yes please figure this out.   At this point who cares if all think partisan folks are not willing to talk.   The other side has spoken.   They are not willing to talk.   This event was absolutely horrendous.   Tears.   I will not understand how anyone is not on board for getting truths.   ( as many were coward under desks and protection from capital police).  How on Gods green earth does anyone deny this horrifying event on our capital?   Americans did these actions.   Seriously????? We need truth not lies.  No coverups, no knucklehead politicians who are ultimately worried about control and reelection .   Some did not even bother to show up to vote.   What has happened to us ?    This vote was horrifying.  Yes, get a commission.   I don’t care what the current administration does they will get hate.   To bad so sad for those who insist on denial.   We need truth.  If your ass was part of this you need to be held accountable.  \nFrightening vote!!!",
            "title_similarity": "0.61612934",
            "sentiment_compound": -0.9316
        },
        {
            "id": "gzxh59d",
            "score": 1,
            "text": "Get 'em, Joe.",
            "title_similarity": "0.29642993",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxh5g0",
            "score": 1,
            "text": "Yeah no shit",
            "title_similarity": "0.071261734",
            "sentiment_compound": 0.6278
        },
        {
            "id": "gzxhj48",
            "score": 1,
            "text": "Just wait until the GOP takes back Congress and eliminates the filibuster with a stacked Supreme Court and likely presidency because Democrats won’t get their heads out of their asses. \n\nDoes anyone **really** think McConnell won’t eliminate the filibuster when it’s his turn?  The only reason he didn’t before is because he didn’t have to. \n\nEvery time the GOP says something along the lines of “if the evil democrats do this, they are ruining democracy,” it means “holy crap we need to do this when it’s our turn.”\n\nLook at Supreme Court nominees, completely blocking all legislature, creating bills and then filibustering those same bills they create… it’s all projection. \n\nI would bet my life that McConnell has already promised to overthrow the filibuster behind the scenes to his donors just like he did about rushing through SCOTUS when they blocked Garland.",
            "title_similarity": "0.75074744",
            "sentiment_compound": 0.1045
        },
        {
            "id": "gzxhs9l",
            "score": 1,
            "text": "Yes its important to stop negotiating with people who refuse to compromise. One day the Democrats will learn this, that will be a wonderful day.",
            "title_similarity": "0.5402398",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzxhxro",
            "score": 1,
            "text": "There needs to be something resembling consequences (CONSEQUENCES!) for those in power who are responsible. \n\nbecause thus far the worst perpetrators have had no ramifications at all. zero. even worse than zero, they gain support and money off the propaganda machine. they are emboldened to do more of the same without fear of reprisal. \n\neven worse, without consequences now politicians in the future (likely make the same ones responsible for this BS) will have precedent to point at and say “look this is just normal accepted conduct that hasn’t been in the least bit sanctioned when similar events occurred in the past.”",
            "title_similarity": "0.4409757",
            "sentiment_compound": -0.3322
        },
        {
            "id": "gzxhycj",
            "score": 3,
            "text": "Hey Republicans, got a question for you. You've been telling us that Antifa stormed the capital, so why aren't you more pissed off that the Republicans in the senate aren't pushing for a commission, because shouldn't it show us who these Antifa thugs are? Even worse than that, your senators are actually aiding Antifa in getting away with storming the capital, how are you ok with that?",
            "title_similarity": "0.6902199",
            "sentiment_compound": 0.4669
        },
        {
            "id": "gzxi3ll",
            "score": 2,
            "text": "There needs to be a commission to do an investigation, fuck republican support they're trying to keep investigations from happening because there was a bunch of them who conspired with the rioters. What do you think the gallows were built for? Also its been almost 6 months at this point the people who live with the traitors that stormed the capital should be arrested for aiding and abetting.",
            "title_similarity": "0.6506767",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzxi8w9",
            "score": 1,
            "text": "Not really sure how it would even be up for debate. I ain't voting for Biden again if he doesn't do this. Fucking investigate this shit, we have people working in our government that conspired with the psychos that stormed our capitol and tried to seize power.",
            "title_similarity": "0.70504344",
            "sentiment_compound": -0.7756
        },
        {
            "id": "gzxic2o",
            "score": 3,
            "text": "I guess I see why the GOP is fighting this.  They truly believe that the only votes they can get are from Qultists and Qult qandidates.  Little do they realize they can only save the party by imprisoning all guilty parties, no matter how many people voted for them, and rebuilding the GOP from the ankles up.",
            "title_similarity": "0.6093",
            "sentiment_compound": 0.7291
        },
        {
            "id": "gzxijrp",
            "score": 1,
            "text": "Why can't we form a commission without them? We have proven that we can pass something without them... Why is this any different?",
            "title_similarity": "0.4494403",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxijz5",
            "score": 1,
            "text": "Both parties have used filibuster many times. Gross for them to call it partisan.",
            "title_similarity": "0.4967118",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzxirf6",
            "score": 2,
            "text": "Time to end the filibuster and screwup Moscow Mitch!",
            "title_similarity": "0.5782635",
            "sentiment_compound": -0.4574
        },
        {
            "id": "gzxivd3",
            "score": 1,
            "text": "I can already hear republicans crying about the partisan witch hunt.",
            "title_similarity": "0.6176019",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzxixr3",
            "score": 1,
            "text": "“Nothing will meaningfully change”",
            "title_similarity": "0.057713147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxiyri",
            "score": 1,
            "text": "He should have already. It does not seem like it’s gonna happen.",
            "title_similarity": "0.2910893",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gzxized",
            "score": 1,
            "text": "Get ‘em Joe!!!",
            "title_similarity": "0.3390609",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxizs8",
            "score": 1,
            "text": "Until then, keep printing out those dollar bills",
            "title_similarity": "0.29550558",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxjhmy",
            "score": 1,
            "text": "There are so many ways to address this without the cooperation of the Senate Republicans. House committee investigations, the DOJ investigations, or this. The Republicans had their chance to have a bipartisan investigation. Time to do it without them.",
            "title_similarity": "0.6525654",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzxjhs0",
            "score": 1,
            "text": "Love how pathetic dems are. They have the power to end the filibuster but won't. And then the have the audacity to blame republican obstructionism lol.",
            "title_similarity": "0.65590787",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gzxjk7d",
            "score": 1,
            "text": "You know who else opposed the filibuster? Trump.",
            "title_similarity": "0.5785369",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxjkkh",
            "score": 5,
            "text": "I imagine Obama on the phone with him, \"Damn it Joe, get it together. They rubbed poop on the walls of the capitol.\"",
            "title_similarity": "0.6272081",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzxjrf6",
            "score": 1,
            "text": "Unless it's a last resort, I'd like to see Biden stay out of it. It opens him up too much to politicizing the investigation. The Justice Department is on it. Congress can handle it with select special committees without Republicans even being involved. It was probably naïve to even think Republicans would be genuinely bipartisan. Of course they will accuse anything critical of Trump as political, but what really happened has to come out and the people who put that attack together should be called to account at least as much as the foot soldiers who are losing their jobs and going to jail. It's pointless to try to work with the Greedy Old Patriarchs, but it probably is best for Biden to stay above this fray unless it becomes necessary.",
            "title_similarity": "0.62866855",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gzxjthv",
            "score": 1,
            "text": "Status Quo Joe...",
            "title_similarity": "0.23275906",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxk4r7",
            "score": 1,
            "text": "However you feel about filibuster is fine but let's not pretend that only one side uses it. BOTH PARTIES HAVE USED FILIBUSTERS MANY TIMES.",
            "title_similarity": "0.32659245",
            "sentiment_compound": 0.7575
        },
        {
            "id": "gzxk4t5",
            "score": 4,
            "text": "I don't understand. Isn't this an opportunity for the republicans to prove it was antifa that stormed the capitol?",
            "title_similarity": "0.7289609",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gzxkdgk",
            "score": 1,
            "text": "If the pukes were in charge, they would do what they want and give the Dems a big f.u. and middle finger.\n\nWe know this.\n\nSo, lets fucking get shit done with the less than two years we have... SHOW the world what progress actually DOES... to the point if the Pukes get control ad try to to reverse, their own constituents would yell at them, seeing the facts before them.\n\nBi partisan my ass, with total power...GET SHIT DONE.",
            "title_similarity": "0.6322299",
            "sentiment_compound": -0.9402
        },
        {
            "id": "gzxkeei",
            "score": 4,
            "text": "I know Biden said he wanted to lower the temperature as president but that was before a group of domestic terrorists attacked our capital. Forming a partisan committee to get to the bottom of 1/6 might cause some political strife at first but if a bone heals incorrectly the doctor rebreaks it so it they can set it to heal proper.\n\nDoing nothing is not an option. You've got Gaetz and MtG out there calling the election a farce, equating the democratic party to nazis, telling their base they have a right to revolt, and 1/3rd of them actually believe this. It will absolutely happen again if they are allowed to act this brazenly with no repercussions for their political machine.",
            "title_similarity": "0.7023431",
            "sentiment_compound": -0.9331
        },
        {
            "id": "gzxkfmg",
            "score": 1,
            "text": "Too bad the president is busy sleeping in his applesauce.   A moment as important as this and we managed to elect Mr. MaGoo.",
            "title_similarity": "0.62083167",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzxkpg2",
            "score": 1,
            "text": "A commission would be just another Benghazi, trump dossier, fast and furious, etc witch hunt. It will only benefit the party in control and cost taxpayers millions. Just more partisan politics.\n\nYes I voted Trump. And Biden is my/our President.",
            "title_similarity": "0.67681664",
            "sentiment_compound": 0.3535
        },
        {
            "id": "gzxkv9s",
            "score": 1,
            "text": "Why are his eyes ink black every time I see a photo of Biden. Fucking creepy as hell!!",
            "title_similarity": "0.43580085",
            "sentiment_compound": -0.7542
        },
        {
            "id": "gzxl08n",
            "score": 1,
            "text": "DS Patty Murry missed the vote, enough said.",
            "title_similarity": "0.41540313",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxl3g3",
            "score": 1,
            "text": "This title thoooo lol",
            "title_similarity": "0.22548565",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzxl5ql",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzxl6ge",
            "score": 1,
            "text": "Vote blue no matter who or what\n\nWho cares if it destroys the country?",
            "title_similarity": "0.5215201",
            "sentiment_compound": -0.1714
        },
        {
            "id": "gzxlagr",
            "score": 1,
            "text": "Seeing r/Conservative cheering for the defeat of the commission is baffling. It's almost as if they have been taken over by the MAGA lemmings; might mean that it'd be high time to let Reddit know about it and put that subreddit in quarantine.",
            "title_similarity": "0.67742085",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzxlb3p",
            "score": 1,
            "text": "10 bengazi investigations.",
            "title_similarity": "0.26428968",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxlh35",
            "score": 2,
            "text": "Nice barrettes",
            "title_similarity": "0.1039491",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzxlu1c",
            "score": 1,
            "text": "Just realized that Biden is also [Walter](https://i.imgur.com/v9F9IjV.png)",
            "title_similarity": "0.38449153",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxmemc",
            "score": 2,
            "text": "What is the positive of not wanting an independent investigation? Like what is the spin that voting against this makes any sense? I don't understand and I am also kind of lost why something of this magnitude doesn't deserve a long thorough investigation of just the basic who, when, what, why and how and how this can be prevented. Please explain why an investigation isn't actually a good thing because i don't understand why its bad?\n\nEdit: fixed the spelling",
            "title_similarity": "0.55599976",
            "sentiment_compound": 0.1383
        },
        {
            "id": "gzxmiwe",
            "score": 1,
            "text": "Indeed, seems like there’s a few republicans that will join the commission, that bipartisan right!",
            "title_similarity": "0.49391294",
            "sentiment_compound": 0.6114
        },
        {
            "id": "gzxmoda",
            "score": 1,
            "text": "**STOP IT!**\n\nStop saying the GOP is being cowardly.  They're not.  They're being treasonous.\n\n1. The GOP is protecting their members who committed treason by attempting to overthrow our government, including GOP members of congress who gave reconnaissance tours on the days leading up to their attempted coup.\n\n2. More importantly, the GOP is betting their next attempt at overthrowing the government will be successful.\n\nThey're not cowards.  They're traitors.",
            "title_similarity": "0.6750957",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gzxmp1m",
            "score": 1,
            "text": "Too late, Dems are stupid if they play to GQP games , just subpoena repubs phone records; people gonna be shocked when they see the coordinated involvement; Trumps kids, top repubs leaders, even that shithead Paxton who wouldn’t release his phone records due to “ client privileges”, we have been taken over by a bunch of gangsters  and Dems are too stupid to do anything about it; gonna lose our country sports fans,",
            "title_similarity": "0.60044396",
            "sentiment_compound": -0.9136
        },
        {
            "id": "gzxmu0a",
            "score": 1,
            "text": "It’s been nearly 5 months since the insurrection. It shouldn’t take this long to investigate treason. There was obviously help from the inside, considering there were reports of missing panic buttons. Aka it was planned and they were torn out beforehand. Not to mention the tours that were given just before the attack happened. What the hell are Dems waiting for? Grow a fucking spine. Clearly, trying to work with the GOP isn’t getting us anywhere. The approach hasn’t led to any significant investigation. This is self-preservation on behalf of Republicans. Fuck cooperation; just do it. The 2022 midterms will get here sooner than you think and if Republicans gain the house and senate, you can kiss the committee goodbye",
            "title_similarity": "0.6136656",
            "sentiment_compound": -0.8369
        },
        {
            "id": "gzxmvgo",
            "score": 2,
            "text": "Biden is too soft. I get “bringing the country together”,  but when the vast majority of the Republican Party is actively obstructing your every move while their voter base are so indoctrinated in right wing propaganda that they don’t think you’re the president, you gotta count your losses.\n\nMake the commission. Show the country how Republicans tried to steal the election and upend American democracy. Then throw every seditious politician and citizen away in prison for acting against our country and its democracy.\n\nI’m tired of this.",
            "title_similarity": "0.7083804",
            "sentiment_compound": -0.9584
        },
        {
            "id": "gzxn4iy",
            "score": 1,
            "text": "Biden looks an awful lot like Geoff Dunham’s puppet Walter in the headline thumbnail",
            "title_similarity": "0.45222643",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzxn59b",
            "score": 1,
            "text": "When your country and your government get attacked, you INVESTIGATE it. This is what normal societies do!!!",
            "title_similarity": "0.56904703",
            "sentiment_compound": -0.5962
        },
        {
            "id": "gzxn6e1",
            "score": 1,
            "text": "Does the President have the authority to simply convene a formal commission like this, or does it have to go through Congress?",
            "title_similarity": "0.60254985",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzxn6fu",
            "score": 1,
            "text": "The laws are absolute rubbish when Steve Bannon was dismissed with his crime.",
            "title_similarity": "0.5191883",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzxnprt",
            "score": 1,
            "text": "Republicans have proven through the last few presidents, that they will not work with the Democrats, on any commission or bill that might bring out the Truth that would show the Republicans in a bad light.  Nor will they pass a bill that hurts their contributors.  They would rather tax the middle class and the poor, than to tax the wealthy or the big Corporations.  McConnell even has stated, \"he's '100 percent' focused on 'stopping' Biden's administration\".  Yeah, he might be back stepping, but in reality, I doubt that he will work with the Democrats.  He doesn't want the people helped by Democrats, because the Republicans would probably lose votes at the next election.",
            "title_similarity": "0.5939199",
            "sentiment_compound": -0.8395
        },
        {
            "id": "gzxnrlr",
            "score": 1,
            "text": "Why, why, why do we keep trying to include the obstructionist crybaby GOP in the adult discussions? They are clearly not ready for the responsibility - leave thier asses at the kiddie table!",
            "title_similarity": "0.54200524",
            "sentiment_compound": 0.1734
        },
        {
            "id": "gzxo66w",
            "score": 1,
            "text": "Is a white commission more powerful than something like a special counsel?",
            "title_similarity": "0.40583917",
            "sentiment_compound": 0.807
        },
        {
            "id": "gzxo8dl",
            "score": 1,
            "text": "I'm praying the Democrats go through with it. And keep Republicans 100% shut out. I mean \"NOTHING\". Make them panic by them having guessing if we have found out the truth because once the truth comes out.... I believe some people with big names are going to at a minimum will be humiliated and other's will be finally charged with the insurrection. \nThere is no way that could have happened without inside help and Mcconnell knows it. I don't think he was involved but he understands that there is at least a handful that are directly involved. He should be held accountable for the cover-up. Especially since he considered it a \"Personal Favor\" to vote against the commission. He is everything wrong with politics. I was an Independent my whole life until he said they (Republicans) would do everything they could to make sure President Obama was a 1 term President and I voted for McCain. I voted for McCain because I'm Ex-military and to this day believe serving in the Military should be a prerequisite in running for president. It blows me away that someone could be \"Commander In Chief\" of the largest military in the history of the world with NO EXPERIENCE in that field....",
            "title_similarity": "0.6493571",
            "sentiment_compound": -0.5828
        },
        {
            "id": "gzxoq48",
            "score": 1,
            "text": "And Manchin and Sinema are on the Republicans side I’m sure.",
            "title_similarity": "0.4089982",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxou9w",
            "score": 2,
            "text": "What can a commission do? It's more like a ruse to allow drum beating but won't really solve anything. What most expect, (criminal charges), won't happen. \n\nThe Iran-Contra commission blew the lid off of the CIA importing cocaine into the States, selling missiles to Iran and then using the profits for fighting Nicaragua. Thank Oliver North for that. North later became a radio jockey on conservative radio. \n\n9 11 commission showed Saudi involvement. Nothing happened, lawsuit still underway.",
            "title_similarity": "0.578694",
            "sentiment_compound": -0.6225
        },
        {
            "id": "gzxouz2",
            "score": 1,
            "text": "I thought they were getting rid of the filibuster.",
            "title_similarity": "0.4900447",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxoxrk",
            "score": 1,
            "text": "This. They woudln't budge, so let's go for the deadblow hammer.",
            "title_similarity": "0.40496132",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxpagi",
            "score": 2,
            "text": "McConnell is acting as if he can derail the establishment of a 1/6 Commission and get away with it. I don’t believe that Biden will just move on and forget his duty to protect and defend, foreign or Domestic.\n I am betting on Biden not McConnell.",
            "title_similarity": "0.70114255",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzxphry",
            "score": 1,
            "text": "So I’m confused. I was reading an article last night (that I can’t find now) that lays out the three ways a Special Counsel can be appointed. Two are through Congress and one is by the AG. I didn’t think that POTUS *could* appoint one. I hope he can and I hope he will, but I wish I could find a clear run down of how special counsels are appointed.",
            "title_similarity": "0.60007966",
            "sentiment_compound": 0.9255
        },
        {
            "id": "gzxplwp",
            "score": 1,
            "text": "BuT iT wILl Be ThE bIgGeSt WiTcH hUnT iN hIsToRy.",
            "title_similarity": "0.38152444",
            "sentiment_compound": -0.5023
        },
        {
            "id": "gzxpm9k",
            "score": 1,
            "text": "Time to take off the goddamn gloves.",
            "title_similarity": "0.3569957",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxpr3m",
            "score": 1,
            "text": "Except it was cowardly and more intentionally designed to shield republican fascists from criminal liability.",
            "title_similarity": "0.50254303",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gzxpxrh",
            "score": 1,
            "text": "Please just fucking enforce the laws on the books so we don’t have to overthrow this bullshit government.",
            "title_similarity": "0.42496604",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzxr9az",
            "score": 2,
            "text": "And he should go on national television and explain why he is doing it. The traitors are running the show and he needs to use the power of the presidency to expose it.",
            "title_similarity": "0.6764977",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzxrdc2",
            "score": 1,
            "text": "1/6 commission? Idk 3/5 compromise sounds cooler",
            "title_similarity": "0.26562226",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzxrmt4",
            "score": 1,
            "text": "The GOP’s filibuster wasn’t cowardly, it was them playing to their base/Trump’s base.",
            "title_similarity": "0.41454136",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzxsav1",
            "score": 1,
            "text": "As an anarchist I find this amusing.",
            "title_similarity": "0.21761115",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzxsf8b",
            "score": 1,
            "text": "(Republicans barricading the doors like their life depended on it)\n\nAlso Republicans: let’s not figure out how and why all that happened.",
            "title_similarity": "0.5979929",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxsh8j",
            "score": 1,
            "text": "Seems clear now. Jan 6 is insurection day but, only Republicans because if the Democrats did it Reps would loose their mind and Dems would do the right thing.😑",
            "title_similarity": "0.55498505",
            "sentiment_compound": -0.2846
        },
        {
            "id": "gzxsrzp",
            "score": 1,
            "text": "Better do it or this “Democracy” is done",
            "title_similarity": "0.4444491",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxt85u",
            "score": 1,
            "text": "Welp. Good news is there's plenty of room in Canada.",
            "title_similarity": "0.18740904",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxtlfk",
            "score": 1,
            "text": "Also, it shouldn’t be bipartisan anymore. Because the republicans expressed their disinterest we should respect their wishes.",
            "title_similarity": "0.54013413",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzxuh2w",
            "score": 1,
            "text": "This should have been done from the start. Why did we just waste time trying to get it through a deadlocked Congress",
            "title_similarity": "0.63910145",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzxuz4g",
            "score": 1,
            "text": "It may be cliché at this point, but quite accurate for this issue.  \"When someone shows you who they are, believe them\".  The GOP is now the unapologetic party of Q.   It's time to believe them and respond accordingly.",
            "title_similarity": "0.46340883",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gzxv1z4",
            "score": 1,
            "text": "Get rid of the fucking filibuster!",
            "title_similarity": "0.49438214",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxv2c4",
            "score": 1,
            "text": "Yeah what the fuck Joe. Have some balls since Congress can't for some reason.",
            "title_similarity": "0.5296694",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzxv53a",
            "score": 1,
            "text": "Omg this picture is literally the old guy puppet from Jeff Dunham.\n\nI wonder why VERY old people keep being put into presidency now...",
            "title_similarity": "0.6151865",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxv5e3",
            "score": 1,
            "text": "It has to be presidential, the senate and house we're in on it.",
            "title_similarity": "0.6165243",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxv5vb",
            "score": 1,
            "text": "This needs to be done. Republicans can not block a Presidential commission.",
            "title_similarity": "0.45733207",
            "sentiment_compound": 0.3412
        },
        {
            "id": "gzxve5u",
            "score": 1,
            "text": "\"Cowardly filibuster\" is incredibly generous.  Republicans are trying to overturn a Presidential election, if necessary by force.  They and their fake Supreme Court justices, Barrett and Kavanaugh, are insurrectionists, following a Russian fascist playbook.",
            "title_similarity": "0.7113361",
            "sentiment_compound": -0.2748
        },
        {
            "id": "gzxve9k",
            "score": 1,
            "text": "i wonder why the republicans blocked it 🤔",
            "title_similarity": "0.55838144",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzxvgo1",
            "score": 2,
            "text": "“Russia if you’re listening”",
            "title_similarity": "0.34823424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvkao",
            "score": 1,
            "text": "Please do.. and while we are at it just pass an infrastructure bill.  Shove a boot up the seditionist party’s ass..  This means you Ron and Jim Watkins.",
            "title_similarity": "0.6767809",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxvkvx",
            "score": 2,
            "text": "the man needs to strike now and end these trump era shenanigans....trump doesnt play nicely or by the rules and mitch mcconnel has destroyed what honor senate Republicans still had. dont pussyfart around its time to shove it in their greedy little faces.",
            "title_similarity": "0.7106986",
            "sentiment_compound": -0.7385
        },
        {
            "id": "gzxvkz3",
            "score": 1,
            "text": "We should get rid of the senate. A disproportionate branch of government is a relic from a bygone era when we wanted the south to join the union, and then they tried to leave anyway.",
            "title_similarity": "0.7386308",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzxwdcz",
            "score": 1,
            "text": "He should at all costs.",
            "title_similarity": "0.18620193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxwj1p",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzxwnmy",
            "score": 1,
            "text": "Oh so one day a filibuster is \"cowardly\" then the next day its an example of dedication and our democracy. A coin toss is better then this government, lets just decide everything on that.",
            "title_similarity": "0.6051909",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzxwpql",
            "score": 4,
            "text": "I'm pretty curious why some dumbass like me could go on the website that replaced t_d and see this coming weeks before hand and yet nobody in DC or the alphabet boys did anything to stop it, the people who broke into the capital should be charged to the fullest extent but so should the people who allowed this to happen so they could use it for political reasons. Two sides of the same shit coin Randy.",
            "title_similarity": "0.56338423",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzxyiif",
            "score": 2,
            "text": "If this is not done, Democracy will die, in four years Trump or one in his inbred clan will run from their jail cells and we will have an indefinite corporate facist running the US and other countries around the world, it is insane!",
            "title_similarity": "0.6336577",
            "sentiment_compound": -0.784
        },
        {
            "id": "gzxz6v2",
            "score": 4,
            "text": "Time to expose the enemies of the United States. Those who put candidate and party over country.",
            "title_similarity": "0.75961626",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzxzed5",
            "score": 3,
            "text": "Immediately following the commission can we arrest the traitors",
            "title_similarity": "0.588838",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzxzk4a",
            "score": 2,
            "text": "A bipartisan Presidential Commission could have respected GOP members (most likely former, sane ones) who care more about getting to the truth and protecting the Constitution than playing short-term politics and protecting Trump.",
            "title_similarity": "0.57788223",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gzxzzgs",
            "score": 6,
            "text": "The GQP doesn't want any investigation because they are covering the guilty.  Wasn't it the gqp that said it was antifa and blm.. why not prove it... oh yeah they can't because they know they wer lying.",
            "title_similarity": "0.4778812",
            "sentiment_compound": -0.6395
        },
        {
            "id": "gzy03mo",
            "score": 2,
            "text": "Do it!",
            "title_similarity": "0.14207336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy0ayb",
            "score": 2,
            "text": ">Presidential 1/6 Commission\n\nHe already has one.  It's called the DoJ.",
            "title_similarity": "0.58364344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy0ofh",
            "score": 4,
            "text": "Tbh, they should have shut down the stupid ass filibuster months ago.",
            "title_similarity": "0.5759007",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gzy1d3z",
            "score": 5,
            "text": "Screw the GOP!",
            "title_similarity": "0.44181806",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gzy1jqu",
            "score": 2,
            "text": "Could we also get an actual fucking investigation into Epstein while we are at it?",
            "title_similarity": "0.5208566",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy20u6",
            "score": 6,
            "text": "Cant do good faith with Republicans, have to start something ok your on. Republicans cant start a probe bc a probe will prove they are the ones responsible for encouraging the insurrection.",
            "title_similarity": "0.6663008",
            "sentiment_compound": 0.4874
        },
        {
            "id": "gzy29se",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.2833761"
        },
        {
            "id": "gzy2vg5",
            "score": 2,
            "text": "Do it!",
            "title_similarity": "0.14207336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy38r6",
            "score": 3,
            "text": "at the end of the day the reps will just call it a partisan commission. even if they convince some reps to vote with them. the result will be the same. reps claiming its partisan. so what is the actual point of them trying so hard to work with them? nothing",
            "title_similarity": "0.5651913",
            "sentiment_compound": 0.0345
        },
        {
            "id": "gzy3kkr",
            "score": 5,
            "text": "Stop trying to appease the GOP and go for the fucking jugular",
            "title_similarity": "0.4980024",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzy4r40",
            "score": 1,
            "text": "Lol, this photo tho",
            "title_similarity": "0.17108959",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzy4tnk",
            "score": 2,
            "text": "They should, and the house needs to establish a select committee and put Benghazi \"investigation\" To shame.\n\nGOP will call it partisan no matter what. So might as well make it a fucking hyperpartisan event.",
            "title_similarity": "0.7829286",
            "sentiment_compound": -0.2048
        },
        {
            "id": "gzy7rpm",
            "score": 5,
            "text": "Ahh republicans the party if terror treason traitors and hate.",
            "title_similarity": "0.64706075",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gzy8jxs",
            "score": 1,
            "text": "This is for the soul of America. Forget optics--it's clear America isn't paying attention anyway.",
            "title_similarity": "0.5512137",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzy9cwg",
            "score": 6,
            "text": "Fuq the corrupt, evil Republicans.",
            "title_similarity": "0.52936316",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzy9t53",
            "score": 3,
            "text": "It's not cowardly. It's terrorist-supportung.\n\nY'know, the same shit the US was supposed to be fighting abroad.",
            "title_similarity": "0.52566534",
            "sentiment_compound": -0.6015
        },
        {
            "id": "gzybr9n",
            "score": 7,
            "text": "The GOP are terrorists. They need to be seen as such and they KNOW an investigation would undo them. This goes beyond short term memory, and they know it.",
            "title_similarity": "0.52060354",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gzydpm4",
            "score": 5,
            "text": "They don’t want an investigation because most of them had a part in it. Everyone from the obvious ones to the slick old ones like turtle man. Either from promoting the big lie, refusal to impeach, ties with Russia, covid denial aka mass murder, and god knows what else...They’re all guilty!!",
            "title_similarity": "0.5317874",
            "sentiment_compound": -0.3987
        },
        {
            "id": "gzye35e",
            "score": 1,
            "text": "His \"scrunched up thinky face\" in the header looks somewhat like if you Bush JR and Clinton after their presidencies. Back to normalcy indeed.",
            "title_similarity": "0.57055134",
            "sentiment_compound": 0.2975
        },
        {
            "id": "gzyew33",
            "score": 1,
            "text": "How big are they😈😈😜😏😏😏😝",
            "title_similarity": "0.18234363",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzyhazg",
            "score": 7,
            "text": "Fuck you GOP",
            "title_similarity": "0.38661283",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzyhmfe",
            "score": 7,
            "text": "Wow this thread are being siege by the_donald or something\n\nSome of these comments are just so crazy I thought I accidentally sorted by controversial \n\nThey aren’t even talking about this issue anymore. They just bring up some crazy comments that’s not even related to this topic. \n\nWtf people.",
            "title_similarity": "0.5406543",
            "sentiment_compound": -0.8279
        },
        {
            "id": "gzyhwia",
            "score": 3,
            "text": "This commission has to happen.",
            "title_similarity": "0.3135621",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyjcu1",
            "score": 1,
            "text": "And then they can blame Biden and call him a commu-socal-something-ist when he does it and vote to impeach him for misuse of power.  \n\nOr we'll get Tucker/Shapiro/Greene/Tomi to never stfu about it ever again.",
            "title_similarity": "0.6829442",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzyjtt8",
            "score": 6,
            "text": "Just saying, but if we let the Nazis have a vote on whether or not to have the Nuremberg Trials, we probably wouldn't have had the Nuremberg Trials, either.",
            "title_similarity": "0.55207473",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzykwrg",
            "score": 1,
            "text": "I remember you could at one time smoke on a plane. Then it was in this section with a curtain drawn to block the smoke, then gets banned. We think of it now as being ridiculous.\nServing alcohol on board with be the same thinking soon enough.",
            "title_similarity": "0.45865905",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gzynu79",
            "score": 5,
            "text": "r/conservative are so brain dead, celebrating this as a win. I thought you said it was Antifa and BLM that did it?",
            "title_similarity": "0.6145086",
            "sentiment_compound": 0.4914
        },
        {
            "id": "gzyo7re",
            "score": 2,
            "text": "Why not empower the FBI to investigate every aspect of the attack without any political restrictions? Politicians are almost guaranteed to avoid looking into anything embarrassing.",
            "title_similarity": "0.4994505",
            "sentiment_compound": -0.7675
        },
        {
            "id": "gzypwtn",
            "score": 1,
            "text": "I wonder if it'll end like Mueller's report and the impeachment hearings?",
            "title_similarity": "0.6461973",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzyttcz",
            "score": 2,
            "text": "…and don’t invite the terrorists.",
            "title_similarity": "0.36959195",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzyuohe",
            "score": 1,
            "text": "How did he not have a major “fireside chat” address prepped for the inevitability that this commission would get killed in congress?  How is that possible?",
            "title_similarity": "0.72164667",
            "sentiment_compound": -0.7059
        },
        {
            "id": "gzyvzxw",
            "score": 1,
            "text": " He won't democrats act like they're opposition to the GOP they work in tandem.",
            "title_similarity": "0.6070756",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gzyximl",
            "score": 1,
            "text": "Weird. I don’t remember a republican standing and endlessly talking to stale. Oh that’s cause it’s not even a real filibuster now? Cool cool.",
            "title_similarity": "0.45343876",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzyz749",
            "score": 2,
            "text": "Anyone who doesn’t understand the unbelievable severity of this, needs to take a minute and imagine that the politicians and protesters behind this had been BLM. \n\nI’m sick of this bs party before country politics.",
            "title_similarity": "0.6980099",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzz07iw",
            "score": 3,
            "text": "There's only one question here...If this attack were by an outside country, what would be the plan?  Damned right there would be a commission.",
            "title_similarity": "0.46753195",
            "sentiment_compound": -0.7371
        },
        {
            "id": "gzz152z",
            "score": 2,
            "text": "The fact you have to “call for it” and this goofball and his admin let Trump and Barr “off the hook” for their crimes.. not some Willy nilly politics bullshit but straight up obstruction of justice that can’t be covered up. I regret voting for this imbecile and any democrat. Some of us have a knack for seeing shit strategically. At this point there is nothing at all that will stop or impede a Republican autocracy. I believe once it’s here the real deal cream will rise to the top and not these permanent bitchassness clowns we had the last decade. And that includes Obama.. I said it. People will totally abandon these dudes that cower towards all of our true enemies that stand as a real threat but aggressive towards weaker ones. \n\nThere is one thing you can always bank on in American culture on both sides… they will always always punch down and cower and take the path to least resistance. We always always let shit go too far and not address threats head on. Who the hell is advising these dudes? \n\nExhibit A Russia.. 😂 They been openly attacking us via cyber attacks and our actual elections for 5-6 years straight and no response and this gump is meeting with Putin. Obama told them to “knock it off” like literally. They can’t square up against anyone that can punch back. I get nobody wants a nuclear holocaust but it’s complete bitchassness.",
            "title_similarity": "0.6493424",
            "sentiment_compound": -0.9902
        },
        {
            "id": "gzz2ipw",
            "score": 2,
            "text": "Senator Warren should lead it...just cause.",
            "title_similarity": "0.49445236",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzz6h5r",
            "score": 1,
            "text": "Status quo Joe",
            "title_similarity": "0.20566683",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzbsr8",
            "score": 6,
            "text": "Did you think the nazis were going to help you investigate themselves for their crimes?  Go it alone.  Fuck the nazis.",
            "title_similarity": "0.5511819",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzzeuxk",
            "score": 3,
            "text": "GOP: The rioters were ANTIFA.\n\nAlso GOP: There were no rioters, they were just tourists.\n\nDEM: OK, let's investigate and get to the bottom of it then.\n\nGOP: Hell No! Once the findings are revealed it will hurt us in the next election.\n\n&#x200B;\n\nThere were a lot of Senators that did not bother to show up and vote on this, even ones in favor of it. There would not have been enough yes votes though.\n\nThe commission still needs to go froward though. If a Mueller/Russia investigation could go forward during a GOP lock, this can go forward as well.",
            "title_similarity": "0.58106995",
            "sentiment_compound": -0.4508
        },
        {
            "id": "gzzh0j4",
            "score": 1,
            "text": "Just give the GOP some chocolate chocolate chip ice cream",
            "title_similarity": "0.28269857",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzznnql",
            "score": 3,
            "text": "I hate this country with every part of my soul. Twenty years in, it’ll be like the handmaids tale. I’m planning my exit strategy ASAP!!!",
            "title_similarity": "0.5578569",
            "sentiment_compound": -0.4724
        },
        {
            "id": "gzzocnl",
            "score": 2,
            "text": "Is it just me or does this picture look identical to Jeff Dunham’s character “ Walter”?",
            "title_similarity": "0.3306533",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzqths",
            "score": 1,
            "text": "yes",
            "title_similarity": "0.034635864",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzzvzbg",
            "score": 2,
            "text": "Why not a Nuremburg style show trial as a TV special with major, you can't miss it, star power. After the repugs are convicted Gaetz can tell people to hunt and shoot them",
            "title_similarity": "0.5899992",
            "sentiment_compound": 0.2518
        },
        {
            "id": "gzzwjmc",
            "score": 3,
            "text": "God I hate the Democrats being too weak and trying to compromise with these evil fuckers. This is why this shit keeps happening because they keep letting the bullies keep bullying them.",
            "title_similarity": "0.45343447",
            "sentiment_compound": -0.9718
        },
        {
            "id": "h01domq",
            "score": 1,
            "text": "I’d call Joe a pussy but that’s an insult to something I admire.",
            "title_similarity": "0.39690143",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h01m41f",
            "score": 2,
            "text": "I believe that all of this pandering is ridiculous. The pukelicons have expressed that they have no desire to work with the Dems, so why are they, the Dems, insisting on working with them? Give them a shot at sanity, then diss them completely. Manchin needs to be invited to a special meeting and explained to, in the starkest terms how he needs to get his dumbness out of the way. He is gonna be DE-elected anyway. And he knows this. He is NOT gonna hold on to that seat when the hicks in red are seething that Georgia went blue. He can't win that seat if he assassinated his repukelicon opponent on the day before the election!. Dumb!\n\nIf you can't find the balls to support this investigation, you need to resign. You can't care anything about the country, the constitution, or anything else that supports their beloved \"democracy\", and vote against this bill. It's really sick.",
            "title_similarity": "0.7033982",
            "sentiment_compound": -0.9008
        },
        {
            "id": "h01ozpd",
            "score": 2,
            "text": "This is a must. We have now been seeing some of the terrible things that have been swept under the rug in America. Like TODAY the 100 years of the Tulsa Oklahoma massacre. It got pushed under the rug. Never made the History Books. Just as a lot of things that have happened over the years. It is time for this to all come out. For if it don't then we become hypocrites, all of us that love our country. So we the people that saw all this on T V and just really do not understand the ramifications of this will sit in the dark and the Republicans will do all they can to never let what really happened out. Oh sure the Democrats can have there own investigation, but that will just denied. Or lies will just take the place of what happened. Remember the great lying President said he made a call to someone, but that someone said he never got a call. So Trump sat home and watched what was happing. Being the coward he is, that is just what he would do. So all my friends lets not let this end. The President can select a special commission made up of some of the great statesmen in America.  It can be bipartisan because there many retired Republicans that would love to do just this.",
            "title_similarity": "0.6031414",
            "sentiment_compound": 0.9489
        },
        {
            "id": "h020mws",
            "score": 2,
            "text": "Republicans are terrible human beings",
            "title_similarity": "0.41382954",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h026n0d",
            "score": 3,
            "text": "Hey let's all calm down maybe we didn't really see what we thought we did . Maybe it truly was just blown out of proportion by the fake media . Maybe all the lies coming out of Humpty trumptys mouth wasn't really what we thought we heard . Maybe if we just give Humpty trumpty another chance he really could be the biggest the smartest and the bestest , most compassionate leader of the free world we have ever seen !  Or we can embrace reality that the radical right has taken over the Republican party and this is a battle for democracy and everything that we hold dear . When money can't buy the election any more the radical right will change the rules to hold on to power . It's time to grow a set of nuts  and hold all of cult of Humpty trumpty responsible for their actions . And the removal of the filibuster would be a great step in the right direction .",
            "title_similarity": "0.6633816",
            "sentiment_compound": 0.9661
        },
        {
            "id": "h035cho",
            "score": 1,
            "text": "putting titles on the filibuster does not make it such. Democrat's use it to the max when they are out of power",
            "title_similarity": "0.61019045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03p2k8",
            "score": 1,
            "text": "A bunch of disgruntled unarmed hill billies overtaking the most powerful country in the world does not qualify as an insurrection, just something else to cry about.",
            "title_similarity": "0.5249748",
            "sentiment_compound": -0.0018
        },
        {
            "id": "h04jg0q",
            "score": 1,
            "text": "I don't know.  I read the moderator's comments here and all these tilites to these posts seemed to be just the opposite.",
            "title_similarity": "0.41722316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h05diss",
            "score": 1,
            "text": "I would like the government to release all of the videos of this event. If they have, please share them with me. Thanks!",
            "title_similarity": "0.35539812",
            "sentiment_compound": 0.8478
        },
        {
            "id": "h09l9z0",
            "score": 1,
            "text": "These bots are working overtime pushing this nonsense.  And I’ve noticed Reddit has gone into repost hell as of lately.",
            "title_similarity": "0.4503416",
            "sentiment_compound": -0.8283
        },
        {
            "id": "h0bra8s",
            "score": 1,
            "text": "Having at least two parties is very important, but the GOP has gone fascist, and is dangerous to democracy.  For some reason they seem to think that working with the other party for the good of the country is not good.  Republicans need to seriously think about the people they vote for.  It seems they only want to vote for narcissists and psychopaths these days.",
            "title_similarity": "0.64959353",
            "sentiment_compound": -0.6076
        },
        {
            "id": "h0ijuv4",
            "score": 1,
            "text": "Biden is a Embarrassment to our country I can’t wait till he is charged with treason",
            "title_similarity": "0.6279914",
            "sentiment_compound": -0.765
        },
        {
            "id": "h1cbef7",
            "score": 1,
            "text": "Why wouldn’t we want to investigate this? If the republicans are right and it was ANTIFA it would come out in a bipartisan commission. \n\nI’m sure ANTIFA forced the trump supporters to show up and then storm the capitol. \n\nMass brainwash event that has never happened before in human history.",
            "title_similarity": "0.704952",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2eij1u",
            "score": 1,
            "text": "Why do you need to investigate the COUP? Trump and GOP wanted a coup. The evidence is online free for everyone to see.",
            "title_similarity": "0.45122057",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2eiy0e",
            "score": 2,
            "text": "What can and should the ctiziens do about this when Trump and GOP attempted and wanted a coup but failed yet there is no accountability?",
            "title_similarity": "0.6400044",
            "sentiment_compound": -0.8047
        },
        {
            "id": "h9hjzkh",
            "score": 1,
            "text": "You know what we do with traitors....",
            "title_similarity": "0.5221063",
            "sentiment_compound": 0.0
        }
    ]
}