{
    "Texas valedictorian goes viral after giving unapproved speech blasting state's anti-abortion bill\n": [
        {
            "id": "h0e0td0",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.5282948",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h0ejjnw",
            "score": 7,
            "text": "That was a tear jerker.  I think Texas should be kicked out of the union!",
            "title_similarity": "0.657078",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eolva",
            "score": 10,
            "text": "“Unapproved” lmao freedom of speech does NOT need to be approved by anyone! God bless America",
            "title_similarity": "0.46466744",
            "sentiment_compound": 0.9441
        },
        {
            "id": "h0f2zfk",
            "score": 10,
            "text": "Abort Texas. We don't need em.",
            "title_similarity": "0.3360191",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fbpd5",
            "score": 6,
            "text": "She aborted her first speech before it came into the world 💓🙏🏻",
            "title_similarity": "0.4874893",
            "sentiment_compound": 0.875
        },
        {
            "id": "h0ev012",
            "score": -27,
            "text": "Where is the responsibility of the men in all this .. how bout if the women can’t get the abortions if that is their choice for whatever reason... then those men who get these women pregnant should also get vasectomies this way they can’t get women pregnant \nIt should be a law if a male gets a female pregnant and he doesn’t step up as a father automatic Vasectomy... and he should not be given a choice",
            "title_similarity": "0.60809",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ei6fc",
            "score": 22,
            "text": "Great. What's being done about the country-wide right-wing legislative spree? That's what I want to hear about.",
            "title_similarity": "0.47506064",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0e19ta",
            "score": -93,
            "text": "If it was a speech against abortion, I would have been for it too. A valedictorian should have the right to say what they want in their own graduation speech, even if it makes people uncomfortable or is politically uncomfortable for the audience",
            "title_similarity": "0.670996",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0f0dru",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0fuoqf",
            "score": 1,
            "text": "The pro-life males should refrain from masturbating as that’s genocide as well...",
            "title_similarity": "0.45463586",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0ei6p9",
            "score": 27,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0eqq3g",
            "score": 19,
            "text": "Living in texas its like the 40s and not the good kind .I fucking hate texas",
            "title_similarity": "0.5432862",
            "sentiment_compound": -0.7701
        },
        {
            "id": "h0fv0l8",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0ep6or",
            "score": 2,
            "text": "\"Don't give a fuck as long as we can bust nuts\"",
            "title_similarity": "0.31432426",
            "sentiment_compound": 0.1406
        },
        {
            "id": "h0f6rfb",
            "score": 13,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0eik9h",
            "score": 6,
            "text": "Powerful speach!! Will make a difference.",
            "title_similarity": "0.19176394",
            "sentiment_compound": 0.5242
        },
        {
            "id": "h0ezm96",
            "score": 17,
            "text": "No uterus no opinion",
            "title_similarity": "0.16289863",
            "sentiment_compound": -0.0803
        },
        {
            "id": "h0euari",
            "score": 10,
            "text": "Beautiful speech! Watch out, gen Z isn’t take any of the patriarch!!!",
            "title_similarity": "0.36615825",
            "sentiment_compound": 0.7243
        },
        {
            "id": "h0etk1p",
            "score": 3,
            "text": "Good for her!!! All the boys in that class didn't even clap they're pathetic",
            "title_similarity": "0.3935521",
            "sentiment_compound": -0.3971
        },
        {
            "id": "h0f97hi",
            "score": -6,
            "text": ">unapproved speech\n\nI guess they're not really in to free speech in the USA.",
            "title_similarity": "0.46232486",
            "sentiment_compound": 0.2878
        },
        {
            "id": "h0fhbm4",
            "score": 5,
            "text": "This decision shouldn’t be made political. \n\nAgreeing with person below me. It should be between a woman and her doctor.",
            "title_similarity": "0.3574895",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0endtd",
            "score": -36,
            "text": "Can I upvote this more than once? Or is it not like casting ballots?",
            "title_similarity": "0.30068403",
            "sentiment_compound": -0.3549
        },
        {
            "id": "h0gdnfe",
            "score": -2,
            "text": "Why do we care about high schooler's speech if they dont offer additional political, philosophical, or biological insight on the topic?\n\nOr is that the state of this sub? A knee jerk reaction to anything topical about a small set of protected class topics?",
            "title_similarity": "0.55273455",
            "sentiment_compound": 0.6416
        },
        {
            "id": "h0f16ng",
            "score": -3,
            "text": "Auto mod: This is for civil discussion \n\nReddit: We don’t do that here",
            "title_similarity": "0.5065024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0enloh",
            "score": 33,
            "text": "Hero.\n\nP.S. fuck Texas.",
            "title_similarity": "0.49767888",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0f93mb",
            "score": 7,
            "text": "Wow if that was my daughter I would be bursting with so much pride. These kids honestly give me so much hope for the future. Just another 10-30 years and these fucking boomer pieces of shit are done. I can’t wait for them all to fuck of and die already",
            "title_similarity": "0.495666",
            "sentiment_compound": 0.1672
        },
        {
            "id": "h0fnqvi",
            "score": 1,
            "text": "Maybe we could actually create a ‘conspiracy theory’ that would make Republicans support abortion...?\n\nRepublicans are worried about the Replacement theory (immigrants of colour being encouraged to move to US to ‘replace’ the white majority). Since the sort of laws restricting abortion appear to affect PoC disproportionately to their white base, could we not spread the theory that if abortion is banned or severely restricted than we won’t need to worry about using immigrants as the ‘replacements’ cos all the babies of colour born right here in America will replace the white majority in just a generation or so...\n\nLet’s start a new conspiracy theory that actually helps rather than hinders progress. \n\nI am not an American but couldn’t we use their own fear against them and in support of women’s rights?\n\nSo every time someone says they are pro-life, agree with them but make it clear that your motivation is that because in just 18 years time whites will be in the minority.",
            "title_similarity": "0.6760631",
            "sentiment_compound": 0.6921
        },
        {
            "id": "h0guyma",
            "score": -1,
            "text": "I feel like anti abortion bills probably aren’t about limiting a woman’s right to abortion and healthcare. They are probably about the stock investment in Plan B and such and restricting access to abortion is just one way to make Plan B stock rise.",
            "title_similarity": "0.61228245",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0fecf9",
            "score": 7,
            "text": "Y'know, school trains you for obedience. The kids that are seen as 'good' are the ones that follow all the rules, do their homework, give the right answers, etc. So when the valedictorian, theoretically the single most obedient student in the school, does something this subversive in front of the entire world, it must turn these poor authoritarian teachers' world upside down.",
            "title_similarity": "0.45164013",
            "sentiment_compound": -0.3237
        },
        {
            "id": "h0exuak",
            "score": -17,
            "text": "I call a General Womens strike! No chores at home, dont fuck your boyfriends or husbands even if they are against this law. Use da powa",
            "title_similarity": "0.59941363",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h0fn0s7",
            "score": 0,
            "text": "Fuck the GOP.",
            "title_similarity": "0.25911853",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0gvq2x",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0e3tf6",
            "score": 55,
            "text": "Maybe real people are fed up with the 24/7 cultural wars made up to keep Republicans in office.\n\nEnough already",
            "title_similarity": "0.5541487",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0h40ua",
            "score": -5,
            "text": "Over 600k abortions end up happening a year. The chances of you getting raped then pregnant is very low. I’m surprised to see people try and blame GOP for wanting to protect the life of an innocent child. 99% of abortions are elective. .065% were the protect the mothers life. What are you all fighting and speaking out for? the less than 1%. You guys can’t even find a better issue to talk about. I’m surprised you haven’t opened to your mind to the abuse of power with Biden’s Administration. If you want to talk about human rights violation. We as a country are getting so bad that Russia is monitoring the US’ actions for violating human rights rn…",
            "title_similarity": "0.6618434",
            "sentiment_compound": -0.9277
        },
        {
            "id": "h0f25iw",
            "score": -5,
            "text": "So many people are saying that they are proud of her. I don't understand that. I am not proud of her, but I am very very thankful to her.",
            "title_similarity": "0.3232664",
            "sentiment_compound": 0.8009
        },
        {
            "id": "h0fhhhk",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0fyz5k",
            "score": 2,
            "text": "I love this so so much. The idea that a bunch of old white men whom I’ve never met can tell me what I have to do with my body is disgusting. The fact that I will be forced to raise a child out of rape or incest is appalling. Fuck these lawmakers.",
            "title_similarity": "0.6179753",
            "sentiment_compound": -0.9169
        },
        {
            "id": "h0g2f98",
            "score": 0,
            "text": "Wow she looks really good in this picture",
            "title_similarity": "0.05623053",
            "sentiment_compound": 0.7902
        },
        {
            "id": "h0e66u6",
            "score": 20,
            "text": "[Link for the lazy](https://youtu.be/mrfe27VDuRA) because god forbid it is easy to access",
            "title_similarity": "0.26487386",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0f2qz3",
            "score": -21,
            "text": "First, why does the link have the governor as the photo instead of the girl who did the speech. Second, I guess I’m pro-choice to a point. Is 6 weeks not enough time to get an abortion? Or before a heartbeat is present in the fetus? It doesn’t seem like it takes away the right to an abortion but just lets a time limit.",
            "title_similarity": "0.66524166",
            "sentiment_compound": 0.2755
        },
        {
            "id": "h0e1fmr",
            "score": -108,
            "text": "So sad she was booed but not surprising since it's Texas",
            "title_similarity": "0.5393405",
            "sentiment_compound": -0.5295
        },
        {
            "id": "h0g4gdg",
            "score": -11,
            "text": "I don’t get why it’s such a big deal honestly. Texas is a big state, but you are never more than a few hours from another state where it’s perfectly legal. Abortion shouldn’t be easy. It shouldn’t be like just going to pick up some groceries to end a life. I do wish there was an exception for cases of rape/incest tho",
            "title_similarity": "0.6594419",
            "sentiment_compound": 0.9648
        },
        {
            "id": "h0elanq",
            "score": -44,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0er86j",
            "score": -5,
            "text": "Unapproved speech? Hows that first amendment working?",
            "title_similarity": "0.40340906",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h0eivvm",
            "score": -57,
            "text": "if we are gonna be honest here, she's not even gonna be remembered by next week",
            "title_similarity": "0.37159202",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0ev5n5",
            "score": -13,
            "text": "Seeing as the word blasted is used i am doubtful of this article containing a real blasting.\n\n\n\n\nWas it a blasting or More of a mild roast",
            "title_similarity": "0.43336415",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0g2tfw",
            "score": 1,
            "text": "Looking at the picture I thought “holy shit that guy’s old to be valedictorian!!!”",
            "title_similarity": "0.37408197",
            "sentiment_compound": -0.6679
        },
        {
            "id": "h0geuq2",
            "score": 1,
            "text": "Even though people have the right to choose whatever they stand for, I strongly agree with those who choose \"Pro-choice\".",
            "title_similarity": "0.24483043",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0wae4p",
            "score": -1,
            "text": "https://www.liveaction.org/news/mother-graduates-college-10-years/?utm_content=168961810&utm_medium=social&utm_source=twitter&hss_channel=tw-18001922\n\nYou can have kids and have a career. Anyone who tells you otherwise is a liar and an awful human being in general.",
            "title_similarity": "0.6240343",
            "sentiment_compound": -0.743
        },
        {
            "id": "h0em7hc",
            "score": -114,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0fla38",
            "score": -13,
            "text": "For those that agree with what she did Ask yourself if she made a speech regarding an issue you disagree with (i.e. how QAnon conspiracy is real, or she was pro life) would you still regard this as a positive thing to do? Does Freedom of speech mean you can say whatever you want up there? Should you be applauded if you settle old high school scores etc?\n\nJust something to think about",
            "title_similarity": "0.58076036",
            "sentiment_compound": 0.8243
        },
        {
            "id": "h0ey1wm",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0f5rfz",
            "score": -21,
            "text": "If a woman can abort the baby even if the dad wants it, then the man should be able to give up the baby and not pay child support.",
            "title_similarity": "0.55689144",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0ej2zz",
            "score": -39,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0f7hhv",
            "score": -37,
            "text": "Why don’t we just label r/politics as r/leftwinghearsay, every time I visit this joint there isn’t one good thing to hear",
            "title_similarity": "0.5342822",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0fm2ph",
            "score": -2,
            "text": "Wow crazy",
            "title_similarity": "0.14074151",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0g1253",
            "score": -2,
            "text": "That valedictorian looks a lot like Greg Abbott.",
            "title_similarity": "0.30423382",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0ewfr9",
            "score": -45,
            "text": "Abortion is murder.",
            "title_similarity": "0.5552826",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0evyxd",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0epsnh",
            "score": 43,
            "text": "Fascists legislating a women's womb. \n\nI never liked you Texas, but I fucking hate you now. \n\nYour governor is a piece of shit. And fuck any of you who are ok with this. \n\nA 17 year old, on the day she should be celebrating her achievements, is talking how worried she is about a bill written by your sorry ass Governor. \n\nI hope bad shit happens to that wheelchair bound piece of shit! \n\nFuck Texas. Always and Forever.\n\nTexas strong? Fuck outta here\n\nA woman's agency means fuck all to you bible thumping fucking idiots, huh?",
            "title_similarity": "0.7341664",
            "sentiment_compound": -0.992
        },
        {
            "id": "h0erxxv",
            "score": -53,
            "text": "Agree or disagree, a high-school graduation isn't the place to force others to listen to your political beliefs... imagine if she had been on the other side of the argument (i.e., pro-life) and did the same thing. Many would call that totally inappropriate.\n\nHigh-school graduation is about celebrating achievement and having a moment of joy. Politics doesn't need to be a part of everything...",
            "title_similarity": "0.5142331",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0erfce",
            "score": -31,
            "text": "It's not anti-abortion. It's \"Common sense abortion control.\"",
            "title_similarity": "0.42863327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0evgpi",
            "score": -34,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0fcc53",
            "score": -33,
            "text": "I agree that this bill is trash but your highschool graduation ceremony is not the appropriate place to give out your political opinion. I'm tired of politics trying to bleed into every aspect of people's lives. There is nothing brave about what he did, it's just annoying.\n\nEdit: Since you fuckwads can't seem to read. I am fully against the bill and I fully support young peoples right to have a voice. This is just not an appropriate venue.\n\nEdit 2: Bring on the hate. None of you have had a single valid point yet to the reason that this is an appropriate place to talk about politics.\n\nTLDR: tOpIc GoOd...PlAcE bAd",
            "title_similarity": "0.59341264",
            "sentiment_compound": -0.9526
        },
        {
            "id": "h0epw69",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0fyi8g",
            "score": 4,
            "text": "There is supposed to be a separation of church and state. THIS ISNT NAM, THERE ARE RULES. AM I THE ONLY ONE THAT GIVES A FUCK ABOUT THE RULES!? MARK IT NONE OF YOUR FUCKING BUSINESS.",
            "title_similarity": "0.519662",
            "sentiment_compound": -0.6731
        },
        {
            "id": "h0elvr3",
            "score": -64,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0ei5wb",
            "score": 52,
            "text": "It was never about pretending a fetus is a baby. It was always about maintaining the surplus of disposable labor by encouraging dead beat dads and baby mamas.",
            "title_similarity": "0.4683358",
            "sentiment_compound": -0.2951
        },
        {
            "id": "h0e3pju",
            "score": 38,
            "text": "Ooh do voting rights next!",
            "title_similarity": "0.20565698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0erm8o",
            "score": -81,
            "text": "A high school kid throwing a tantrum to get internet fame....\nLol...",
            "title_similarity": "0.5520531",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0g5wfg",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0kfqs7",
            "score": -5,
            "text": "Man, the amount of responsibility people don't have to take for their own choices is baffling. A sex educated person can just exterminate a life even knowing sex causes babies sometimes. My wife is 9 weeks pregnant my baby has teeth \"buds\", eyes and four chambers of the heart. Outside of cases of rape, I just can't fathom justifying murdering a child like that. It's quite a lack of acceptance and extremely selfish to assume your whole life and all its goals are now ruined. I had my first two kids at 18 and 20 and used every government program available in my conservative leaning state and it was more than enough. If your state doesn't have  programs like WIC or others I could see being afraid but I was pretty taken care of and wouldn't change letting my children live for 10 more years of my own desires.",
            "title_similarity": "0.65930486",
            "sentiment_compound": 0.8285
        },
        {
            "id": "h0elf0c",
            "score": -122,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0et0g4",
            "score": -59,
            "text": "Gotta love it when “smart” people think killing human life that can’t communicate and was created out of ignorance and stupidity is ok. This isn’t even a religious argument; conception is the start of life, and if we’re going to consider any form of bacterium/ single-cellular life we find in space (if at all) a life form, then human life needs to be considered at all stages. Fuck abortion.",
            "title_similarity": "0.6507912",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h0ezn35",
            "score": -42,
            "text": "Don’t want to raise a child, don’t have sex. It’s a very simple concept.",
            "title_similarity": "0.29133445",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0edmm4",
            "score": -18,
            "text": "       w",
            "title_similarity": "-0.0603907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ewibi",
            "score": -5,
            "text": "It seems you can order what you need online. Hope you can ditch the dirtbags driving it to this extent.",
            "title_similarity": "0.34008366",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0fprj4",
            "score": 4,
            "text": "What a great speech, this girl is a hero. The religious fruitcakes cannot be allowed to win and with each passing year they try harder and harder to inject our government with their warped ideologies. The stranglehold they'd like to have would destroy this country.",
            "title_similarity": "0.679067",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h0epg4v",
            "score": -20,
            "text": "Im wondering how a valedictorian speech even goes to that subject.",
            "title_similarity": "0.38530433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eo7x4",
            "score": -87,
            "text": "Abortion should be illegal.",
            "title_similarity": "0.5500197",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0ez9yo",
            "score": -19,
            "text": "I wonder how Reddit would react to a speech about the sanctity of life. Probably call her an Aunt Tina or something.",
            "title_similarity": "0.54540205",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f02hp",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0f7so5",
            "score": -18,
            "text": "I will never understand why democrats frame pro-life as wanting to control and subjugate women. Pro-lifers believe that an embryo is a baby full stop. Why do we insist on arguing against a made up point. 43% of women and 51% of men are pro-life. We’re never going to sway people to pro-choice if the best argument we can make is that they hate women. Honestly all it takes is one minor shift in society and pro-choice will be the minority. \n\nI’m pro-choice but I’m sick and tired of the handmaids tale arguments. \n\nSource: https://news.gallup.com/poll/244709/pro-choice-pro-life-2018-demographic-tables.aspx\n\n\nEdit: I’m not backing down from this stance. You can continue whatever twisted logic you use to believe that 43% of women “don’t know what’s good for them” but I’m not going to be apart of that club",
            "title_similarity": "0.6707522",
            "sentiment_compound": -0.881
        },
        {
            "id": "h0f3mjs",
            "score": 7,
            "text": "What is it with some men? Stay THE FUCK OUT OF IT.",
            "title_similarity": "0.23052025",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h0fo45n",
            "score": 7,
            "text": "She nailed her speech. She said everything I’ve been yelling at pro-birthers for last god knows how long and I’m so happy she got her moment to shine and went viral for it. \n\nThis ban is ridiculous. I’m super irregular, when I was 25 I just happen to find out I was five week pregnant (something just didn’t feel right) despite being on the pill with my then boyfriend. Like I’m used to not having a period and my pill has the lowest hormones possible so it never occurred that I should take a test. Doctor caught it during a routine visit but unfortunately I miscarried not too long after. That was five weeks in finding out by chance. Most women on a regular cycle don’t know until 8 weeks maybe and they want to ban abortions at 6 weeks? \n\nWhen will they just admit this has never been about “saving the children’s lives” and it’s really about punishing women for having sex and wanting a life?",
            "title_similarity": "0.68347543",
            "sentiment_compound": -0.8435
        },
        {
            "id": "h0fyk3v",
            "score": -8,
            "text": "Texas and Florida are two great states. As an outsider, I am most impressed by their ability to do *something*.",
            "title_similarity": "0.32243222",
            "sentiment_compound": 0.8687
        },
        {
            "id": "h0elil0",
            "score": -108,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0exoio",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0ff3mw",
            "score": -26,
            "text": "Abortion is homicide. Simple as that",
            "title_similarity": "0.5015541",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ehxm7",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0eypvu",
            "score": -6,
            "text": "this may be a little insensitive, so just excuse me if it is: cant people just go to another state to get the abortion? im not from the US, idk how these things work. im just curious.",
            "title_similarity": "0.5829793",
            "sentiment_compound": 0.2195
        },
        {
            "id": "h0ftmil",
            "score": -7,
            "text": "ITT: a lot of people who don’t understand that free speech doesn’t apply to valedictorians’ speeches at PUBLIC high school graduation ceremonies",
            "title_similarity": "0.56103194",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0ftnps",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0hm139",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0e1pdt",
            "score": 367,
            "text": "Congrats to her school. \n\nThey taught her to think critically.",
            "title_similarity": "0.2510739",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0elh4d",
            "score": 26,
            "text": "My niece graduated as well in Austin and she is terrified.  It set her mind on attending an out of state college and I dont blame her.  I am a native Texas and have fought all my life for women rights , Mr Abbot is repulsive.",
            "title_similarity": "0.69098365",
            "sentiment_compound": -0.4878
        },
        {
            "id": "h0f62lo",
            "score": -29,
            "text": "Killing the unborn is immoral. Hopefully the tide will turn against abortion.",
            "title_similarity": "0.6438926",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0eumc5",
            "score": 9,
            "text": "How is it that women don’t run the world? One runs my house and it’s awesome.",
            "title_similarity": "0.46857148",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0fesqe",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0fo0u1",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0fv8cg",
            "score": -9,
            "text": "It's not an anti abortion bill though.",
            "title_similarity": "0.31205854",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h0fxztd",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0g9p37",
            "score": -9,
            "text": "I’m quite happy with the step Texas has taken. Why should a life be taken because of the choices of others?",
            "title_similarity": "0.37989843",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h0ek9qg",
            "score": -51,
            "text": "Don’t get me wrong. 100%agree with everything. But she not a good public speaker.",
            "title_similarity": "0.38633564",
            "sentiment_compound": -0.6321
        },
        {
            "id": "h0eg5zg",
            "score": 31,
            "text": "If this speech didn’t make you tear up, I fear you lack a heart",
            "title_similarity": "0.33013904",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0etupe",
            "score": -31,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0f7a09",
            "score": -31,
            "text": "Everyone should have the right to murder unborn children",
            "title_similarity": "0.4761445",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0eou9u",
            "score": -12,
            "text": "Im for abortion except for when its close to the due date unless there is an emergency.",
            "title_similarity": "0.43195957",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0ebyca",
            "score": 11,
            "text": "I was 33 years old when I learned it's Valedictorian and not Valedvictorian",
            "title_similarity": "0.38496923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0frxxh",
            "score": -12,
            "text": "…and just like that valedictorian speeches will be banned. Sorry girl, but nobody at your high school graduation gives a fuck about what you’re saying. If your sense of self importance is so much that you must express your opinions at any given opportunity, please just join twitter like everyone else.",
            "title_similarity": "0.6399125",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h0ek625",
            "score": -35,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0ekenx",
            "score": 41,
            "text": "White Jesus America is terrified of female sexual power and freedom.",
            "title_similarity": "0.5624449",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0essi3",
            "score": -39,
            "text": "She says from the safety of having already been born...\n\nThey should have pulled the plug on her speech by the second sentence. You know, aborted her speech.\n\nAbortion is the premeditated killing of an innocent human life.",
            "title_similarity": "0.7174239",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0fkqti",
            "score": -14,
            "text": "I do agree. Like the vaccine your body your choice.",
            "title_similarity": "0.2953587",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0fs2ca",
            "score": -14,
            "text": "Hey democrats and whoever can do whatever they want .. I’m totally pro choice .. but understand with the pro choice comes no vaccine no mask ... lol glad we r on the same page",
            "title_similarity": "0.48333842",
            "sentiment_compound": 0.8117
        },
        {
            "id": "h0e3c3m",
            "score": 193,
            "text": "looks like Texas is about to be more familiar with brain drain as people that aren't idiots leave their backwards shithole",
            "title_similarity": "0.5285691",
            "sentiment_compound": 0.3915
        },
        {
            "id": "h0esoav",
            "score": -14,
            "text": "This is a public service announcement: the term \"viral\" is antiquated, meaningless bullshit. Thank you.",
            "title_similarity": "0.59689075",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0ebhj6",
            "score": -77,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0eu1kj",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0flln7",
            "score": -17,
            "text": "I couldn't even get past the first 20 seconds of the speech, it was awful. Idk why it's going \"viral\" I didn't share it or upvote it.",
            "title_similarity": "0.55992055",
            "sentiment_compound": -0.6472
        },
        {
            "id": "h0fd95x",
            "score": -20,
            "text": "If she doesn’t like the bill can’t she move to a new state that has better abortion laws that suit her life style? \n\nThat’s what the States is all about. \n\nYou choose which state to live in that best suits your lifestyle. Why doesn’t anyone understand this. Go to California where they praise abortion. Not that difficult.",
            "title_similarity": "0.6092717",
            "sentiment_compound": 0.9361
        },
        {
            "id": "h0f5bfp",
            "score": -17,
            "text": "This subreddit is BlueAnon",
            "title_similarity": "0.12160817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0epqt5",
            "score": 19,
            "text": "An inherent danger of letting the smartest kids give speeches.",
            "title_similarity": "0.35521507",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0fbit3",
            "score": -20,
            "text": "Seems weird to think your rights are stripped from you because you can’t terminate your pregnancy once the child is viable.\n\n1. If you’ve been assaulted take a pregnancy test everyday until it’s positive then get your abortion \n\n2. If you had sex with your brother or something take a pregnancy test everyday until it’s positive then get your abortion\n\nI’m sure I’m going to get a ton of hate but it’s not like they outlawed everything.  Speaking in generalities the left wants the option to always be available and the right wants it completely off the table other than medical emergencies so isn’t compromising good?  Neither side completely gets what they want\n\nI feel like very few circumstances would disallow someone from getting an abortion unless they take their time, have been held captive, or another uncommon scenario.",
            "title_similarity": "0.67515993",
            "sentiment_compound": 0.7671
        },
        {
            "id": "h0fc252",
            "score": -20,
            "text": "This all depends on where one believes life begins at. I personally think that as soon as the sperm enters the egg the “spark” of that future consciousness also enters. Which means that FUTURE UNITED STATES CITIZENS ALSO HAVE RIGHTS, even in the womb!",
            "title_similarity": "0.42240757",
            "sentiment_compound": 0.5893
        },
        {
            "id": "h0fkiuj",
            "score": -21,
            "text": "She wants no responsibilities in life, what a shock.",
            "title_similarity": "0.27218342",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0ft0ng",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0f1hm8",
            "score": -22,
            "text": "Whats wrong with having sex solely to reproduce?",
            "title_similarity": "0.41353515",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0f5g2c",
            "score": -22,
            "text": "I believe in equality. So in the interests of equality I apply the same standards to women that are applied to men.\n\nDon't want to have a baby? Keep it in your pants.\n\nRape, incest? We don't absolve men from their responsibility/obligation just because he was raped by his teacher. At age 18 he has to pay his rapist support.\n\nEquality: nothing more, nothing less.",
            "title_similarity": "0.53263324",
            "sentiment_compound": -0.9338
        },
        {
            "id": "h0ftnb8",
            "score": -20,
            "text": "Yes, let's celebrate the killing of millions of unborn babies. Disgusting",
            "title_similarity": "0.60426545",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0fcev8",
            "score": -22,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0ea090",
            "score": 101,
            "text": "This is the most insane bill, there should a mass exodus from that state for all people who value autonomy and reason. What a fucking shit fest.",
            "title_similarity": "0.61940277",
            "sentiment_compound": -0.669
        },
        {
            "id": "h0eh2o0",
            "score": 25,
            "text": "I bet you the Texas legislature is prepping a bill making violence against these valedictorians legal like they want to make violence against protesters legal.",
            "title_similarity": "0.7594651",
            "sentiment_compound": -0.743
        },
        {
            "id": "h0eniey",
            "score": 24,
            "text": "Honestly, if you're a Valedictorian, you've earned your 5 minutes to talk about *whatever* you wanna talk about. That should be your right; good on her!",
            "title_similarity": "0.38752535",
            "sentiment_compound": 0.7345
        },
        {
            "id": "h0epijl",
            "score": -24,
            "text": "Coochie",
            "title_similarity": "0.051076595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0epy6n",
            "score": -23,
            "text": "Looks a bit old for a valedictorian",
            "title_similarity": "0.14749596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0es0zm",
            "score": -23,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0fagl4",
            "score": -27,
            "text": "Doesn’t matter. Abortion is murder.",
            "title_similarity": "0.4846395",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0famdj",
            "score": -23,
            "text": "Heartbreaking that this young lady has been brainwashed to believe that her hopes and dreams are dependent on her ability to murder her children",
            "title_similarity": "0.5324321",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0fbsnb",
            "score": -24,
            "text": "That’s cool, celebrate irresponsibility and lack of accountability! Have sex and get pregnant then get pissed off when tax payers don’t want to fund it… that’s nots women’s rights, that’s stupidity.",
            "title_similarity": "0.6583023",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h0fckr2",
            "score": -25,
            "text": "Abortion (outside cases of sexual assault, imo) is murder.\n\nEdit: Lol stay mad Redditards. Seethe and cope",
            "title_similarity": "0.6633613",
            "sentiment_compound": -0.872
        },
        {
            "id": "h0fhreg",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0fhzzo",
            "score": -24,
            "text": "Poor snowflake",
            "title_similarity": "0.22710337",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0fiwoh",
            "score": -27,
            "text": "What an embarrassment.  A 17 year old who knows nothing about life given a platform to provide a toxic message.  You did well in some HS courses, no one gives a damn about your opinion in the same way no one cares about an actors political views in an award show.",
            "title_similarity": "0.60213906",
            "sentiment_compound": -0.7077
        },
        {
            "id": "h0fskpq",
            "score": -26,
            "text": "What a pathetic person. Advocating for the mass genocide of the unborn.",
            "title_similarity": "0.5408126",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0ekfw2",
            "score": -66,
            "text": "I wonder if she’d say the same billcrap if she was an abortion survivor",
            "title_similarity": "0.59509873",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0eepsb",
            "score": 35,
            "text": "The cheers are not loud, but the fact they aren't booing in Dallas is significant.",
            "title_similarity": "0.18186274",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h0ekg7l",
            "score": 36,
            "text": "It’s really mind boggling to me how men are trying to tell women what they can do with their bodies, and it’s a priority for the republican party to do this. It’s just crazy to me.",
            "title_similarity": "0.5930604",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0eophm",
            "score": -36,
            "text": "[removed]",
            "title_similarity": "0.082859926"
        },
        {
            "id": "h0e5xvh",
            "score": 172,
            "text": "Its no surprise that the GOP is trying to usurp power and instate a single party authoritarian regime since they are rapidly fading from being able to get to power be democratic means. The best indicator is their continued embrace of a failed businessman as savior despite his obvious lack of skills, morals and qualification. This was not an aberration, this is the GOP endgame",
            "title_similarity": "0.5393208",
            "sentiment_compound": 0.7226
        },
        {
            "id": "h0eoerj",
            "score": -45,
            "text": "Murder",
            "title_similarity": "0.3018728",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0e7bbk",
            "score": 198,
            "text": "What a brave hero.  I wish it didn't take such a young woman to call out disrespectful and evil men that tell them what to do with their own bodies.  We shouldn't even be having this issue here in America in this day and age.  It's time to see progress and respect toward the oppressed and marginalized.",
            "title_similarity": "0.51785564",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h0ees3u",
            "score": 45,
            "text": "It's people like her that give me hope for the future generations.",
            "title_similarity": "0.14408307",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0edxng",
            "score": 57,
            "text": "Doesn't affect the rich where they will send their child off to \"camp\".",
            "title_similarity": "0.20237236",
            "sentiment_compound": -0.4449
        },
        {
            "id": "h0ek4ea",
            "score": 55,
            "text": "Congratulations, Texas. You now require a teenager to explain how to respect the rights of a woman and their bodies. Good job!",
            "title_similarity": "0.5494336",
            "sentiment_compound": 0.8805
        },
        {
            "id": "h0efa5n",
            "score": 61,
            "text": "I was valedictorian.  I gave a shitty feel good speech about the good times me and my friends had in high school.  In retrospect, I wish I had given a much more charged speech.  Something with meaning.  A message.  One of my biggest regrets.",
            "title_similarity": "0.5254503",
            "sentiment_compound": 0.5279
        },
        {
            "id": "h0eekw1",
            "score": 252,
            "text": "The party of small government wants to be all up in your vagina.  Imagine that.",
            "title_similarity": "0.39943892",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0ebdoe",
            "score": 163,
            "text": "Made me tear up. Texas is a fucked up place, but there is hope, and I lies in the educated youth. As a father myself I see so much hope for the generation to come. If we don’t shit the bed first.",
            "title_similarity": "0.49094498",
            "sentiment_compound": -0.4909
        },
        {
            "id": "h0e4bo8",
            "score": 66,
            "text": "Go, girl.",
            "title_similarity": "0.110405646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0emv1f",
            "score": 72,
            "text": "America, the only country in the world where an unborn fetus has more rights than a person.  Once they're born, take away the health insurance and forget about them.",
            "title_similarity": "0.5771543",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0ekt04",
            "score": 86,
            "text": "[The youngest “woman” to ever give birth was Lina Medina, who gave birth when she was 5 years old.](https://en.wikipedia.org/wiki/Lina_Medina)\n\nThanks to Greg Abbot, Texas could potentially beat that record since obviously theres no reason mom should be limited to be old enough to attend preschool.",
            "title_similarity": "0.530547",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0e66qu",
            "score": 652,
            "text": "Here is the a link to her speech in full:\n\nhttps://www.youtube.com/watch?v=mrfe27VDuRA\n\nHere are the snippets:\n\n>“Today I was going to talk about TV and media and content, because it's something that's very important to me. However, under light of recent events, it feels wrong to talk about anything but what is currently affecting me and millions of other women in the state,”  \n...  \n“I have dreams, and hopes, and ambitions, every girl graduating today does, and we have spent our entire lives working towards our future. And without our input, and without our consent, our control over that future has been stripped away from us,”  \n...  \n“I am terrified that if my contraceptives fail, I am terrified that if I am raped, then my hopes and aspirations and dreams and efforts for my future will no longer matter,”  \n...  \n“I hope that you can feel how gut-wrenching that is. I hope you can feel how dehumanizing it is to have the autonomy over your own body taken away from you,”  \n...  \nShe called the bill “a problem that cannot wait,” and said she decided to voice her concerns on a day “where you are most inclined to listen to a voice like mine, a woman’s voice.”  \n\n>“I cannot give up this platform to promote complacency and peace when there was a war on my body and a war on my rights. A war on the rights of your mothers, a war on the rights of your sisters, a war on the rights of your daughters. We cannot stay silent,\"\n\nI want every local and national reporter asking this question to Manchin and Sinema (oh look at that: [Hickenlooper](https://www.cpr.org/2021/03/12/hickenlooper-still-pushing-for-fed-minimum-wage-hike-isnt-ready-to-ditch-the-filibuster-yet/), too) until they can give a straight answer: \"Why do you want to be bipartisan with a party that is looking to strip away women's rights?\"",
            "title_similarity": "0.56858885",
            "sentiment_compound": -0.9823
        },
        {
            "id": "h0e40ln",
            "score": 1020,
            "text": "Paxton is a hero.  I love this - “ I cannot give up this platform to promote complacency and peace when there was a war on my body and a war on my rights. A war on the rights of your mothers, a war on the rights of your sisters, a war on the rights of your daughters. We cannot stay silent”",
            "title_similarity": "0.52909863",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0ebzi4",
            "score": 123,
            "text": "Don’t worry Texas Governor will pass a law outlawing girls giving speeches about controlling their bodies. I guarantee it.",
            "title_similarity": "0.74514693",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0e7bud",
            "score": 2438,
            "text": "Texans: dOnT TeLl mE tO weAr No mAsk mUh BOdY mUh FreEdumS! \n\nAlso Texas: Raped? Gonna have to push that baby out. Sorry it’s the law.",
            "title_similarity": "0.7151804",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h0e2i0b",
            "score": 1247,
            "text": "This took guts. \n\nI do worry about the consequences. She should be alert for backlash, and not just verbal.",
            "title_similarity": "0.42785484",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0e1gni",
            "score": 3344,
            "text": "Amazing when teenagers are speaking more common sense than the entire republican party.",
            "title_similarity": "0.31941715",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0ejmmk",
            "score": 167,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0e3iiy",
            "score": 1820,
            "text": "Good to see a Texan named Paxton not be a complete waste of atoms.",
            "title_similarity": "0.2374532",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0ecp0h",
            "score": 2282,
            "text": "How long before Texas legislature makes it a crime to go off script in validictory speeches.",
            "title_similarity": "0.66528034",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0e36cj",
            "score": 4149,
            "text": "Party of small government telling people what to do with their bodies.",
            "title_similarity": "0.31001884",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0e2new",
            "score": 6955,
            "text": "Great speech.  She was scared at the beginning, but then she found her groove and you could tell how passionate she is about the topic.  She really nailed it.",
            "title_similarity": "0.37867",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0e0v39",
            "score": 8932,
            "text": "> A Texas high school valedictorian has gone viral for ditching her approved graduation speech to instead denounce the state's anti-abortion bill, which was signed into law last month.\n\n> Paxton Smith, the valedictorian at Lake Highlands High School, had planned to deliver a speech about television and the media, which was approved by school administrators. \n\n> When she was called to the podium at her school’s graduation ceremony, however, she said it “feels wrong” to speak about anything else other than the state’s “heartbeat bill.” \n\n> ...\n\n> “I am terrified that if my contraceptives fail, I am terrified that if I am raped, then my hopes and aspirations and dreams and efforts for my future will no longer matter,” Paxton added.\n\n> ...\n\n> Hillary Clinton praised Paxton on Twitter, writing that it “took guts” to deliver her speech.\n\n> “Thank you for not staying silent, Paxton,” she added.\n\n> ...",
            "title_similarity": "0.7987218",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h0e3i84",
            "score": 3,
            "text": "WAY TO GO, PAXTON!!!!!!!\n\n100%",
            "title_similarity": "0.2732227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e8g26",
            "score": 3,
            "text": "Amazing!!! Thank you Paxton Smith!!!!!",
            "title_similarity": "0.18196417",
            "sentiment_compound": 0.816
        },
        {
            "id": "h0ebmjb",
            "score": 21,
            "text": "I know her family must be so proud of her!!  Go, girl!",
            "title_similarity": "0.28106028",
            "sentiment_compound": 0.7066
        },
        {
            "id": "h0ednij",
            "score": 20,
            "text": "definition of a bamf",
            "title_similarity": "0.060270566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0edx1b",
            "score": 3,
            "text": "My dumb school got rid of Validictorians and anything but \"top 10% get to sit closer to the front\" 6 years before I graduated 4 years ago. Unbelievable but ¯\\_(ツ)_/¯. Republican state and local gov. No one likes to listen to students here.",
            "title_similarity": "0.6069161",
            "sentiment_compound": -0.5496
        },
        {
            "id": "h0ehdf8",
            "score": 2,
            "text": "Is this when the GOP teaches everyone about cancel culture?",
            "title_similarity": "0.3848487",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0ehiy0",
            "score": 31,
            "text": "Yes!!! May she be safe and protected from all harm, including the patriarchy who is wrongfully making decisions for her! Let the youth lead us towards a better future of freedoms for all!",
            "title_similarity": "0.38197112",
            "sentiment_compound": 0.8825
        },
        {
            "id": "h0ehrfv",
            "score": 3,
            "text": "Anybody else notice the folks on stage weren't clapping?",
            "title_similarity": "0.22905022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eid5h",
            "score": 11,
            "text": "That was amazing! She's the hero we need.",
            "title_similarity": "0.22707145",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h0eipo4",
            "score": 12,
            "text": "I am surprised that the school administrators didn't try to physically pull the plug on an unapproved speech.\n\nI'm grateful that they didn't. Powerful speech.",
            "title_similarity": "0.4482097",
            "sentiment_compound": 0.0433
        },
        {
            "id": "h0eis9h",
            "score": 6,
            "text": "There will be a bunch of new rules for deviating from valedictorian speech subjects now.",
            "title_similarity": "0.42324883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ekems",
            "score": 1,
            "text": "https://www.reddit.com/r/PublicFreakout/comments/nqwq3c/texas_high_school_student_paxton_smith_secretly/h0dlvtd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3",
            "title_similarity": "0.5246161",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ekiha",
            "score": 4,
            "text": "I wonder if this district replaces speeches with something else next year. Who knows what other thing they’ll come up with, but I’m 99.9% sure it will happen.",
            "title_similarity": "0.46347034",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h0ekq4v",
            "score": 5,
            "text": "I don’t know why the speech isn’t being made public rather than the issue of her giving it. I thought Texas was part of the United States where freedom of speech is the law. It’s a sad state of affairs when the freedom of speech is a controversial subject.",
            "title_similarity": "0.63846266",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h0ekq6w",
            "score": 3,
            "text": "Keep it up!",
            "title_similarity": "-0.043855693",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ekwo4",
            "score": 163,
            "text": "She better run! Them rednecks don’t like smart women",
            "title_similarity": "0.44196957",
            "sentiment_compound": 0.8122
        },
        {
            "id": "h0ekzxj",
            "score": 41,
            "text": "We need more people like her 🌟",
            "title_similarity": "0.176326",
            "sentiment_compound": 0.4173
        },
        {
            "id": "h0ellqi",
            "score": 1,
            "text": "Wait that’s not her! It’s old man Abbott",
            "title_similarity": "0.28125715",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0elpbv",
            "score": 1,
            "text": "The guy in the thumbnail is far too old to just be graduating high school.",
            "title_similarity": "0.32462856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0em2rz",
            "score": 3,
            "text": "I 👏🏻 that girl. Great work and courage - full and utter respect from me.",
            "title_similarity": "0.1566031",
            "sentiment_compound": 0.8932
        },
        {
            "id": "h0em4uy",
            "score": 2,
            "text": "I graduated in ‘01 and our principal didn’t like our valedictorian mentioning high times magazine",
            "title_similarity": "0.5684171",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0emfk4",
            "score": 1,
            "text": "More students need to stop being afraid of their former administrations and use their moment to speak their minds.",
            "title_similarity": "0.2911278",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0emkv9",
            "score": 3,
            "text": "The pic on this post should be her not that horrible man.",
            "title_similarity": "0.32304743",
            "sentiment_compound": 0.431
        },
        {
            "id": "h0emlsc",
            "score": 3,
            "text": "Great job! You are a very brave individual. Thank you for speaking out.",
            "title_similarity": "0.12910023",
            "sentiment_compound": 0.8968
        },
        {
            "id": "h0emrd6",
            "score": 3,
            "text": "Sucks that asshole’s face is on the main image and not her brave face.",
            "title_similarity": "0.39202288",
            "sentiment_compound": -0.6458
        },
        {
            "id": "h0emt24",
            "score": 36,
            "text": "Why does Texas consistently elect politicians with eyes like pissholes in sand",
            "title_similarity": "0.5855125",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0en371",
            "score": 2,
            "text": "I really miss when old people just got mad at cartoons and how they’re an awful example for the children. This is what they really wanted Nickelodeon to tell us",
            "title_similarity": "0.51545596",
            "sentiment_compound": -0.796
        },
        {
            "id": "h0endjt",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.08285999"
        },
        {
            "id": "h0engtf",
            "score": 1,
            "text": "Was her diploma withheld afterwords? Schools are known to do that type of thing after unapproved graduation ceremony stunts.\n\nGood for this girl.",
            "title_similarity": "0.47670215",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0enjq4",
            "score": 6,
            "text": "went to high school with her! incredible person, very well spoken",
            "title_similarity": "0.23649055",
            "sentiment_compound": 0.4495
        },
        {
            "id": "h0ens19",
            "score": 1,
            "text": "Wheres the recording 2021 calling",
            "title_similarity": "0.15443581",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ensd7",
            "score": 15,
            "text": "Get this fuckers picture down and show the brave valedictorian.",
            "title_similarity": "0.5109477",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0enu8v",
            "score": 3,
            "text": "Hook ‘em.",
            "title_similarity": "0.058729306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eo0xg",
            "score": 3,
            "text": "I'm so proud of the children of the United States of America.  The State of our Nation is strong.",
            "title_similarity": "0.28030533",
            "sentiment_compound": 0.8588
        },
        {
            "id": "h0eo5ki",
            "score": 7,
            "text": "Oh my goodness, thank you Paxton Smith!!  Fuck yeah!!",
            "title_similarity": "0.24864864",
            "sentiment_compound": 0.6562
        },
        {
            "id": "h0eo90y",
            "score": 5,
            "text": "The kids are alright. But the current state of the union is a hot mess.",
            "title_similarity": "0.31889713",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h0eofk7",
            "score": 5,
            "text": "whoa this is my high school! Love the gumption and conviction of our valedictorian!",
            "title_similarity": "0.32183978",
            "sentiment_compound": 0.6988
        },
        {
            "id": "h0eoluq",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0ep2ok",
            "score": 11,
            "text": "Why do all Texas governors look like different variations of the same person? Bush, Perry and Abbott all look like clones of each other that got fucked up in the process.",
            "title_similarity": "0.5955014",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0ep60y",
            "score": 5,
            "text": "Excellent.",
            "title_similarity": "-0.07549495",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0ep9kz",
            "score": 4,
            "text": "Shit like this keep my hope lamp going..",
            "title_similarity": "0.09325425",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0epb33",
            "score": 11,
            "text": "Her name is Paxton Smith, and this is the speech: \n\nhttps://youtu.be/XpJkErsb7UE",
            "title_similarity": "0.31153345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eph5u",
            "score": 3,
            "text": "There's a clause in the Texas state constitution for when we wanna drop the state legislature into the Gulf of Mexico, right?\n\nCLARIFY: not advocating any extrajudicial action against elected officials.",
            "title_similarity": "0.6254364",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0ephr7",
            "score": 5,
            "text": "Good for her. \nYou don't have to agree with her to acknowledge that it takes balls to stand up to the establishment like that.",
            "title_similarity": "0.257424",
            "sentiment_compound": 0.509
        },
        {
            "id": "h0eplsj",
            "score": 29,
            "text": "Fuck extremists christians.",
            "title_similarity": "0.5081284",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0eqcme",
            "score": 7,
            "text": "It’s frustrating to watch an almost neolithic regression like this play out. It’d call it shameful of the Republicans, but they wouldn’t know the meaning of the word.",
            "title_similarity": "0.46050203",
            "sentiment_compound": -0.1423
        },
        {
            "id": "h0eqf0b",
            "score": 3,
            "text": "Do we not have audio of what the hell she actually said?  Come on.",
            "title_similarity": "0.38582397",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0eqh7x",
            "score": 5,
            "text": "Good. Fuck this bill.",
            "title_similarity": "0.24128188",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0eqnzn",
            "score": 1,
            "text": "Same goes for Golden Oozaru",
            "title_similarity": "0.050382778",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0er38f",
            "score": 10,
            "text": "This girl was amazing, and I wish her the best. I seriously hate my state on most days.  \n\n\n\nNot only did this BS get passed, but also it just became illegal for businesses to enforce wearing a mask. So, even if they want to, companies will be fined if they try to make people wear one in the fucking store. So much for staying out of the affairs of businesses, huh republicans? Fuck. Abbott.\n\nEdit: I was wrong about this, mask mandates were prohibited in government facilities, including schools, but not businesses. [Source](https://www.cnbc.com/2021/05/18/texas-gov-abbott-threatens-to-fine-cities-and-local-officials-if-they-impose-mask-mandates.html) But still, fucking stupid. Abbott still sucks.",
            "title_similarity": "0.63736165",
            "sentiment_compound": -0.9661
        },
        {
            "id": "h0er81s",
            "score": 5,
            "text": "What a brave, and beautiful young girl. As a father of two daughters I hope I am raising girls with the ability to speak out against things that don’t work for them. Go Paxton!",
            "title_similarity": "0.4356761",
            "sentiment_compound": 0.9151
        },
        {
            "id": "h0erf95",
            "score": 18,
            "text": "I’m so proud of her for speaking up. Thank you for actually voicing what needed to be said. Female rights are going backwards & it makes me cry.",
            "title_similarity": "0.40185452",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0ergq7",
            "score": 4,
            "text": "Good for her! Makes me have some hope about my state. But how do we make a long term change? 22, wanting to do something, but never know how.",
            "title_similarity": "0.39996517",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h0erib0",
            "score": 5,
            "text": "If legislators and pro-lifers insist on forcing women to give birth to babies. They should, at the very least, be personally required to raise and provide for every single one of them, personally, from their own pockets and with their own time.\n\nAlthough, even then, this forced pregnancy/birth would still be much too dehumanizing.",
            "title_similarity": "0.6127914",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h0ersch",
            "score": 4,
            "text": ">A Texas high school valedictorian has gone viral for ditching her approved graduation speech...\n\nI absolutely fucking LOVE that school administrations still thinks young, soon to be/sometimes are, adults will listen to their bullshit when they know 100x better how to find informative information.",
            "title_similarity": "0.7215127",
            "sentiment_compound": 0.8128
        },
        {
            "id": "h0erv48",
            "score": 5,
            "text": "That bill is horrific. Religious nuts can fuck off out of women’s uterus’",
            "title_similarity": "0.63400686",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h0esce9",
            "score": 2,
            "text": "Imagine working hard for four years to be the best of the best, only to be told you can’t be trusted to give a speech, and that it needs to be approved by some asshat’s on the school board.\n\nI think if you achieve valedictorian, you’ve earned the right to say whatever the fuck you want during your ten minutes.",
            "title_similarity": "0.5583886",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h0escg5",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.055989794",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0esfna",
            "score": 3,
            "text": "I graduated from Lake Highlands in 2013. There are 2 churches within walking distance that have handed out bibles in the parking lot when I was there. My parents live within spitting distance of the school still, and it's just as conservative, \"small town vibe\" as I remember it. Every family knows every other family's business, and it's all they talk about in church or in group gatherings. The school administrators constantly looked the other way when coaches or organization leaders made racist comments (former baseball coach) or pressured you to lead the group/team in prayer (this happened to me as a member of Espree). It's a damaging right wing place, and she is no doubt being talked shit about by a horde of Presbyterian and Baptist moms who do nothing but drink wine and proselytize their neighbors. The good news is, that shitty neighborhood hasn't mattered an ounce since I left over 8 years ago now. Fuck that place, and good for her.",
            "title_similarity": "0.49329215",
            "sentiment_compound": -0.8314
        },
        {
            "id": "h0esqya",
            "score": 3,
            "text": "That girl is a hero and a complete gangsta. That took a lot of courage to do and I am so proud of her.",
            "title_similarity": "0.32660317",
            "sentiment_compound": 0.8955
        },
        {
            "id": "h0essi2",
            "score": 8,
            "text": "Seriously, what the fuck is it your business is a person’s fucking abortion? None. The answer is none.",
            "title_similarity": "0.5492242",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0et1ym",
            "score": 3,
            "text": "She should have just said guns, Jesus and trump and she would be governor tomorrow",
            "title_similarity": "0.6141043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0et2de",
            "score": 4,
            "text": "Courage.  Nicely done young lady.",
            "title_similarity": "0.0052971933",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0et368",
            "score": 1,
            "text": "Here's the non bullshit ad infested website version\n\nhttps://youtu.be/XpJkErsb7UE",
            "title_similarity": "0.32506275",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0et4du",
            "score": 1,
            "text": "“Approved speech”.... aren’t Texan all about freedom?",
            "title_similarity": "0.38408458",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0etasv",
            "score": 16,
            "text": "No human has a right to use another human's body against their will. The unborn do not get rights over the mother. These are laws in most of the civilized world. Abortion is justified and the mother should be the only one to decide.",
            "title_similarity": "0.58883667",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0etbuo",
            "score": 3,
            "text": "     But...\n\n         Rural America refused to change.",
            "title_similarity": "0.22590071",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0etbyi",
            "score": 1,
            "text": "i saw about a minute of her speech, but it was so amazing. i can definitely see why she got valedictorian.",
            "title_similarity": "0.4458301",
            "sentiment_compound": 0.9072
        },
        {
            "id": "h0etjo2",
            "score": 2,
            "text": "And she’s fresh outta highschool. \n\nGoddamn. I like the youth. For a long time I thought millennials would teach these zoomer shits how it’s done. \n\nNow. It seems more like an United front.",
            "title_similarity": "0.44197628",
            "sentiment_compound": 0.5356
        },
        {
            "id": "h0etkgz",
            "score": 2,
            "text": "What a fucking badass",
            "title_similarity": "0.22200577",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h0etry8",
            "score": 2,
            "text": "Good stuff, and good for her.",
            "title_similarity": "0.02728991",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0ets4d",
            "score": 2,
            "text": "I bet we'll be hearing more from this impressive young lady in the future!",
            "title_similarity": "0.18154454",
            "sentiment_compound": 0.6701
        },
        {
            "id": "h0etsyn",
            "score": 4,
            "text": "Unapproved speech in the \"Land of Free Speech\"?",
            "title_similarity": "0.3855328",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0eu96f",
            "score": 5,
            "text": "It's all awful, but this makes the while thing even worse (From the Texas Tribune):\n\n\"Instead of having the government enforce the law, **the bill turns the reins over to private citizens — who are newly empowered to sue abortion providers or anyone who helps someone get an abortion after a fetal heartbeat has been detected.** The person would not have to be connected to someone who had an abortion or to a provider to sue.\n\nProponents of the new law hope to get around the legal challenges that have tied up abortion restrictions in the courts. While abortion providers typically sue the state to stop a restrictive abortion law from taking effect, there’s no state official enforcing Senate Bill 8 — so there’s no one to sue, the bill’s proponents say.\"\n\nThis is so fucked up in so many ways.",
            "title_similarity": "0.743832",
            "sentiment_compound": -0.9376
        },
        {
            "id": "h0eu9xx",
            "score": 3,
            "text": "Incoming Republican't law sending graduates to jail for going outside the lines on their approved public speech.",
            "title_similarity": "0.641127",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0euhcn",
            "score": 6,
            "text": "Party of “freedom” out here taking peoples rights as usual.",
            "title_similarity": "0.3022618",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0euw3i",
            "score": 3,
            "text": "I am so ashamed to be from Texas. I am proud of this girl and I think she will go far but I hate my home state. It is completely bullshit to scream “ My body my choice” about masks but when it comes to abortion it isn’t the same. Women will just find some other way to get an abortion if they truly want it. Whether it be a side ally doctor, out of state, or an unsafe way herself. This was proven to happen when abortion was illegal across the country. I wouldn’t be surprised if there is some kind of uptick in rapes, especially in cases of the woman doesn’t want a baby but the man does. (Ever heard of stealthing? It is considered rape too)\n\nThis is so ass-backwards and I am so upset about this. I worry for my family and friends that still lives there and any other women who live there that are pro-choice. As a women I am glad I don’t live there anymore.",
            "title_similarity": "0.73795426",
            "sentiment_compound": -0.9848
        },
        {
            "id": "h0euzmm",
            "score": 1,
            "text": "Bold strategy Cotton, let’s see if it pays off for her",
            "title_similarity": "0.28917515",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0ev489",
            "score": 3,
            "text": "This woman speaks not only for herself or the hundreds or  thousands of Texan women who may not have her platform and will urgently  need to avoid a forced pregnancy in the coming years; she is also protecting the countless families the GOP intends to bilk through *de facto* private prosecutions. \n\nWe will soon hear established a new sermonizing template. One that exhorts aLl ChRiStiaNs, GoOd AnD tRuE to part with their meager pensions to sign a letter of engagement with the Oh-So-Very-Ethical Slipping^onfetaltissue Jimmy, suddenly-local attorney at law. \n\nThe religious right has found in this legislation a way to get a legal free ride AND perpetuate the poverty cycle so you young'uns have no time or resources to get uppity.  They'll  have Grandmother Jones finance such a court-clogging slew of SLAPP bullshit that when a Smith child is sued for his search term of \"help! my mom may be  pregnant\"  before driving her to Phoenix, all that court time will break Grandmother's already fragile finances. She'll cash in her chips due to the stress, be eulogized by Reverend McStickyfinger as a saint and your family will take this as comfort until you learn that her  estate will no longer be able to pay back the loan financed by your parents' second mortgage.  She lied to them to please her pastor. You will be homeless.  \n\nBut there was \"no political involvement\" in the case she brought against a family in far worse  financial straits than your own is now.  Hopefully you all get along- because the 15 year old mom can't work or afford child care to go to court-ordered school. So you've volunteered your time to mind her baby while you cook and clean for the other residents at the shelter.",
            "title_similarity": "0.65699303",
            "sentiment_compound": 0.7777
        },
        {
            "id": "h0evisr",
            "score": 5,
            "text": "Your body your choice and no one else's.",
            "title_similarity": "0.124970034",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0evpnv",
            "score": 4,
            "text": "Good.  It is a bill aiming for control and nothing more but the sheer hypocrisy and lack of empathy conservatives hold is put on full display each and every day.\n\nIt is a pox upon the world.",
            "title_similarity": "0.6127381",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0evuhl",
            "score": 4,
            "text": "republicans and their ideas of freedom. makes no sense",
            "title_similarity": "0.38874707",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0evwnc",
            "score": 3,
            "text": "I'm tearing up, courageous",
            "title_similarity": "0.2036106",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0ewave",
            "score": 2,
            "text": "We should ban greg abbott's wheelchair. that should fix the problem.",
            "title_similarity": "0.51270753",
            "sentiment_compound": -0.743
        },
        {
            "id": "h0ewclf",
            "score": 10,
            "text": "Bravery isnt doing something without being afraid.\n\nBravery is being afraid, and doing something anyway, *because it's the right thing to do.*\n\nPaxton Smith is one brave woman. Well done Paxton!",
            "title_similarity": "0.36021048",
            "sentiment_compound": 0.7479
        },
        {
            "id": "h0ewh5z",
            "score": 1,
            "text": "That speech was one of the most powerful speeches I’ve ever heard. It’s hard to imagine that there can be a human being who isn’t moved by that. I’d rate it along side this amazing speech by Bernie Sanders in the 1992 [Bernie Sanders: “No, I Will Not Yield!” (6/4/1992)](https://youtu.be/Vabeos-F8Kk) They both give me chills",
            "title_similarity": "0.56249964",
            "sentiment_compound": 0.8169
        },
        {
            "id": "h0ex4d1",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.11934905",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0exjen",
            "score": 3,
            "text": "Fuck any country or state that have anti abortion laws",
            "title_similarity": "0.6883308",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0exjjv",
            "score": 1,
            "text": "Very powerful. I'm stunned she didn't get a standing applause out of these kids.",
            "title_similarity": "0.37722355",
            "sentiment_compound": 0.6404
        },
        {
            "id": "h0exka5",
            "score": 2,
            "text": "Gosh dang! Her courage, passion, and “fuck you,” attitude to those who try to oppress her and other women is powerful! Brought tears to my eyes. She’s a brave and powerful woman who I hope will have more to say in the future, or as she’s already done, help encourage more women to take their power back!",
            "title_similarity": "0.4883188",
            "sentiment_compound": 0.9722
        },
        {
            "id": "h0exkyw",
            "score": 1,
            "text": "Nice.",
            "title_similarity": "-0.11997991",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0exl2m",
            "score": 5,
            "text": "Sadly, this won't change anything.   Later, when the Supreme Court tosses their anti-abortion laws, Texas will immediately pass new, nearly identical laws and the cycle will start over.\n\nJust once I'd like the Supreme Court to say, \"and we fucking mean it\" when they toss these laws.",
            "title_similarity": "0.68735456",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0exo4d",
            "score": 3,
            "text": "Great speech",
            "title_similarity": "0.056832884",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0exsjg",
            "score": 1,
            "text": "This kid is gonna fuck these dinosaurs up in their own election fiefdom in 10 or 15y top",
            "title_similarity": "0.5919467",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0extp3",
            "score": 1,
            "text": "Slightly relevant but it's worth noting that Texas has been experiencing brain drain for a minute.\n\n\nOne of the largest state to state migrations (second largest if not mistaken) is educated Texans moving to California.",
            "title_similarity": "0.5582277",
            "sentiment_compound": 0.6143
        },
        {
            "id": "h0ey7ed",
            "score": 2,
            "text": "So in the country where people are always bringing up their First Amendment to say to most fucked up shit, a valedictorian speech has to be approved beforehand ?",
            "title_similarity": "0.6179531",
            "sentiment_compound": -0.7755
        },
        {
            "id": "h0eyobn",
            "score": 2,
            "text": "Proud of Ms Paxton",
            "title_similarity": "0.085664265",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0eypz2",
            "score": 2,
            "text": "The video source youtube https://www.youtube.com/watch?v=mrfe27VDuRA",
            "title_similarity": "0.25376987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eyqvo",
            "score": 3,
            "text": "Fucking proud as hell.",
            "title_similarity": "0.14938533",
            "sentiment_compound": -0.355
        },
        {
            "id": "h0eys5l",
            "score": 3,
            "text": "That was an insanely courageous thing to do, I’m speechless.",
            "title_similarity": "0.3121634",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0ez12e",
            "score": 1,
            "text": "If you have free speech how can there be an unapproved speech?",
            "title_similarity": "0.34490025",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0ez4ph",
            "score": 3,
            "text": "Can all of you GOP and Republican wives in loveless marriages finally leave your husbands so that they will stop trying to govern the rest of us in an effort to obtain something that they’ll never get?",
            "title_similarity": "0.5691431",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0ezbxq",
            "score": 4,
            "text": "This kind of BS is why I’m embarrassed to be from Texas despite  some of the good stuff.  The valedictorian is wonderful, I mean the law.  We don’t all approve.  It’s a voting issue for me and I’m a dude.  Separation of church and state  is just words down here.  Hell, you can’t buy beer before noon on Sunday.  What kind of crazy bullshit is that?",
            "title_similarity": "0.71304953",
            "sentiment_compound": -0.7902
        },
        {
            "id": "h0ezetu",
            "score": 1,
            "text": "Texas: \\*is Texas\\*\n\nArizona: Hold my beer",
            "title_similarity": "0.44866997",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ezjph",
            "score": 5,
            "text": "I watched it yesterday and it was amazing. I even shed a tear or two.\n\nIt's crazy how scared she probably was while doing this. It has to be hell seeing your own country turn against you.",
            "title_similarity": "0.5996541",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h0ezvpn",
            "score": 4,
            "text": "Great speech. He parents must  be so proud of her. What she did was sent a strong message to all those who try to control what a woman can do or not do with her body.",
            "title_similarity": "0.4378147",
            "sentiment_compound": 0.908
        },
        {
            "id": "h0ezxbf",
            "score": 2,
            "text": "Glad to hearvfreedom of expression is still a right in texas",
            "title_similarity": "0.24755777",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0f00y7",
            "score": 5,
            "text": "I really despise Republicans",
            "title_similarity": "0.33929178",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h0f05b6",
            "score": 8,
            "text": "Nothing says freedom like needing your speech approved by a governing body.",
            "title_similarity": "0.39894933",
            "sentiment_compound": -0.3975
        },
        {
            "id": "h0f0bwj",
            "score": 2,
            "text": "Great of America – [**4K**](https://youtu.be/0gSFanbgtXE)",
            "title_similarity": "0.4180899",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0f0mxm",
            "score": 4,
            "text": "Land of free speech needs to approve valedictorian speeches, what the hell!?",
            "title_similarity": "0.55808",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h0f103b",
            "score": 3,
            "text": "Unapproved speech? I thought Texas loves their freedom. This is not North Korea, Texas, and valedictorians don't need to have some government minder pre-approving their speech.",
            "title_similarity": "0.5566051",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0f1c8o",
            "score": 21,
            "text": "\"Pro-lifers\" sending death threats to a teenage girl in 3...2...1...",
            "title_similarity": "0.56763834",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h0f1fmi",
            "score": 10,
            "text": "The irony that is lost on all comments I’ve read about this is Tucker Carlson arguing that people shouldn’t take the vaccine because people should have autonomy over their own bodies.\n\nWhich is it conservatives ?  Fuckin hacks talkin out both sides of their mouths, but using neither side of their brains.  I’m an independent voter , but if this country even lasts long enough to vote a few more times, it will never be for a Republican.  I’ll take my dual citizenship to the EU where the governments at least give the appearance that they’re working for the people.",
            "title_similarity": "0.6850294",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h0f1fxx",
            "score": 7,
            "text": "Abbott is an idiot. He can’t even get a girl pregnant without in-vitro and he’s making bills about women’s bodies and aiding corporations to break up families and send all these work at home shit jobs back in office shit jobs. Shut the fuck up Greg and sit your ass down out of these conversations.",
            "title_similarity": "0.6617085",
            "sentiment_compound": -0.9552
        },
        {
            "id": "h0f1gye",
            "score": 5,
            "text": "She is exactly the type of women the republican,maga and GQP fears.",
            "title_similarity": "0.47563037",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0f1isi",
            "score": 7,
            "text": "The guts on this young woman. I hate looking around seeing EVERYONE around me in this country willfully blind to what Republicans are trying to do with this country. They want to turn this place into Gilead for Christ sake. Skipping along blindly, watching sports highlights, taking pictures of their food, talking about utter bullshit when their country, their freedoms, their very way of life is under assault. It disgusts me. Everyone needs to fight this kind of shit like what they are doing in Texas with every fiber of their being. Never give an inch. You cannot compromise with people like this. Fight them, every step of the way.",
            "title_similarity": "0.6559659",
            "sentiment_compound": -0.9656
        },
        {
            "id": "h0f1lxe",
            "score": 4,
            "text": "It might be that pro life rhetoric and policy is no longer a winner for Republicans.\n\nWe might be seeing now that even across idealogical lines, the idea that a woman can’t choose is more motivating than religious zealotry\n\nAnd it makes sense given how each generation more people are turning away from religion. \n\nI think its going to be near impossible to convince people without the religious indoctrination that pro life is better than pro choice.\n\nThis and more videos and protests like it could be a surprise ground swell among voters in 2022",
            "title_similarity": "0.57934886",
            "sentiment_compound": 0.9087
        },
        {
            "id": "h0f1qin",
            "score": 1,
            "text": "youtube Valedictorian Paxton Smith viral speech",
            "title_similarity": "0.58051574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f1xiu",
            "score": 3,
            "text": "Pretty damn inspiring.",
            "title_similarity": "0.08247968",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0f22v3",
            "score": 1,
            "text": "And he goes with the \"it's just haters\".",
            "title_similarity": "0.31717798",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0f28r2",
            "score": 9,
            "text": "My son went to this high school.  I am so proud of this young woman.",
            "title_similarity": "0.3127043",
            "sentiment_compound": 0.6113
        },
        {
            "id": "h0f2h1g",
            "score": 3,
            "text": "What a beautiful, powerful speech.",
            "title_similarity": "0.107806616",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0f38b7",
            "score": 6,
            "text": "How any woman can vote for the GOP in light of what they do to constantly try to abolish, reduce or control voting rights and the rights of women,requires people with knowledge I do not possess, other than frigging  common sense ! Then again, to use common sense, you first must be able to think, critically.",
            "title_similarity": "0.5776817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f3ayd",
            "score": 3,
            "text": "I’m from Texas and can’t stand Greg abbot he’s been doing some really dumb shit lately and I hope he gets voted out",
            "title_similarity": "0.64244044",
            "sentiment_compound": -0.6779
        },
        {
            "id": "h0f3dkt",
            "score": 8,
            "text": "Respect her for using what platform she had to convey her message. It wasn’t political, it was real and the fact a lot of southern residents consider it purely politically motivated pisses me  off greatly.",
            "title_similarity": "0.5113579",
            "sentiment_compound": 0.574
        },
        {
            "id": "h0f3ity",
            "score": 3,
            "text": "ITT a lot of people confused what \"freedom of speech\" actually is.",
            "title_similarity": "0.33212763",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0f3v7n",
            "score": 10,
            "text": "And I worry for her, the conservative pro-lifers are going to come after her big time.  They can't stand it when a woman stands up for her rights.",
            "title_similarity": "0.61487484",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0f4830",
            "score": 5,
            "text": "Holy shit. What a speech.",
            "title_similarity": "0.21293989",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0f48zs",
            "score": 8,
            "text": "Abortion should always be a choice!",
            "title_similarity": "0.3875798",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f4oee",
            "score": 22,
            "text": "She has more balls than the entire republican party combined. The party who is against \"cancel culture\" sure does want to cancel her though.",
            "title_similarity": "0.5581722",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0f53a7",
            "score": 12,
            "text": "Sounds like Texas is turning into Saudi Arabia fast. Ironic.",
            "title_similarity": "0.5290161",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0f5560",
            "score": 6,
            "text": "It’s a genuine shame that this is going to fall on deaf ears. You can provide these people with as many counter arguments to their points as possible, shout in their face and until your throat is hoarse, and organise as many protests as you want, but at the end of the day we all know the Republicans aren’t going to listen.",
            "title_similarity": "0.5967866",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0f59zz",
            "score": 1,
            "text": "Brava!",
            "title_similarity": "0.0646678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f5amz",
            "score": 2,
            "text": "Imagine writing a passable valedictorian speech just for decoy.",
            "title_similarity": "0.4028774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f5gmi",
            "score": 9,
            "text": "What a hero. Stand up ladies, these fuckers are trying to steal your rights and turn you into an incubator.",
            "title_similarity": "0.59441876",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0f5j8u",
            "score": 137,
            "text": "I'm a dude, but I think it's a pretty easy call to say that getting raped is the worst thing that can happen to somebody. Now living somewhere where the government tells you that  getting raped is \\*your fucking problem and you're not getting any help\\* is pretty much the worst possible outcome to the worst possible thing you can experience. What in the goddamn fuck is wrong with people.",
            "title_similarity": "0.5555491",
            "sentiment_compound": -0.9919
        },
        {
            "id": "h0f5k6d",
            "score": 2,
            "text": "So, will every Texan woman vote against state Republicans in the next election? Or do a substantial number actually agree with these laws?",
            "title_similarity": "0.60429025",
            "sentiment_compound": 0.6072
        },
        {
            "id": "h0f61ao",
            "score": 4,
            "text": "Now we need a Texas valedictorian to give a speech about voting rights.",
            "title_similarity": "0.66443074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f67ok",
            "score": 1,
            "text": "Not to worry, first bill up in the next session is a law that criminalizes saying anything other than the “ approved” speech at any graduation.",
            "title_similarity": "0.6078081",
            "sentiment_compound": 0.3412
        },
        {
            "id": "h0f6e9x",
            "score": 1,
            "text": "I am sure I could find the information if I looked, but can anyone explain in a very simple way how bills like this can pass?\n\nWhat does Roe v. Wade actually mean? Nothing?",
            "title_similarity": "0.40475148",
            "sentiment_compound": 0.6641
        },
        {
            "id": "h0f6h12",
            "score": 3,
            "text": "Good for her. She could have even thrown in a few jabs about how the Bible even states that life isn't declared until first breath.",
            "title_similarity": "0.5101576",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0f6mm9",
            "score": 5,
            "text": "I pray her generation was taught how important it is to vote! They can make a difference, just need them to vote.",
            "title_similarity": "0.37524897",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h0f6pcd",
            "score": 6,
            "text": "She is the type of 'leader(s)' of future  America needs. The courage and strength in her voice is more than the whole GOP in the last 20 years. God bless her! If I see her name pop up I'll make sure to vote yes with her.",
            "title_similarity": "0.47928274",
            "sentiment_compound": 0.9392
        },
        {
            "id": "h0f6qht",
            "score": 1,
            "text": "Good student.",
            "title_similarity": "-0.03367031",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0f6z0k",
            "score": 11,
            "text": "Crazy fucking Republicans are destroying America.  I think the election of Obama really fucked them up.  The election of Trump enabled them to be open with their hatred.  The defeat of Donald made them all say “fuck this shit we are never giving up power”.  All of those Republican sycophants do not even comprehend how they are destroying their own future.  They are totally insane.",
            "title_similarity": "0.6901095",
            "sentiment_compound": -0.9849
        },
        {
            "id": "h0f7346",
            "score": 3,
            "text": "The Republican Party is doing so much damage, on so many aspects of your lives.. Courage my American friends. Courage & résistance. Love will overcome",
            "title_similarity": "0.56613517",
            "sentiment_compound": 0.9173
        },
        {
            "id": "h0f78lu",
            "score": 1,
            "text": "We did it, Reddit!",
            "title_similarity": "0.27568513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f78w4",
            "score": 1,
            "text": "Abbots ideas are as idiotic as gagging on a hogs dong",
            "title_similarity": "0.5051579",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0f7kue",
            "score": 2,
            "text": "I mean its texas. Lol...  they dont care.",
            "title_similarity": "0.39259893",
            "sentiment_compound": 0.0444
        },
        {
            "id": "h0f7qx2",
            "score": 1,
            "text": "And there goes the round/chick",
            "title_similarity": "0.2232557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f8s2y",
            "score": 36,
            "text": "The part about contraceptives failing really hit it home in my opinion. You can be responsible and *still* have your life ruined in Texas",
            "title_similarity": "0.6549262",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0f8zu4",
            "score": 1,
            "text": "Where is the video that went viral?",
            "title_similarity": "0.36738837",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f979t",
            "score": 7,
            "text": "I’m proud of her.  And I support her.",
            "title_similarity": "0.08714481",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0f97rg",
            "score": 4,
            "text": "I’m just surprised someone had the guts to say something meaningful. Graduations are so stupid because they just have a bunch of speeches sucking up to authority.",
            "title_similarity": "0.57403266",
            "sentiment_compound": -0.2183
        },
        {
            "id": "h0faelw",
            "score": 4,
            "text": "Good on her!",
            "title_similarity": "0.018790966",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h0faf3p",
            "score": 1,
            "text": "I'll let you know how it goes my friend",
            "title_similarity": "0.021879833",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0faj8z",
            "score": 2,
            "text": "Unapproved speech in the land of the free? Unpossible!",
            "title_similarity": "0.41480887",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h0fbakw",
            "score": 1,
            "text": "What’s a valedictorian?",
            "title_similarity": "0.22393078",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fbcni",
            "score": 5,
            "text": "Her speech was beautiful. Here’s to hoping that the conservative ninnies I work with get into a tizzy in the lunchroom today.",
            "title_similarity": "0.461524",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0fbi2n",
            "score": 4,
            "text": "She did the right thing.She stood up for her principles. Unfortunately this will probably be the last valedictorian speech at this institution. They’ll shut it down.",
            "title_similarity": "0.5286594",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0fbp02",
            "score": 2,
            "text": "The school actually discussed not giving her the diploma because of this, wow Texas lol...",
            "title_similarity": "0.67169476",
            "sentiment_compound": 0.7402
        },
        {
            "id": "h0fcdq8",
            "score": 3,
            "text": "Anyone else shocked they let her finish?",
            "title_similarity": "0.22976544",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0fck3d",
            "score": 3,
            "text": "Surprised they didn’t cut her off",
            "title_similarity": "0.17443919",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0fcpy7",
            "score": 3,
            "text": "That was beautiful",
            "title_similarity": "-0.028354365",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0fcyl3",
            "score": 3,
            "text": "Ha! Texas is a mess!!! Ignorant out of touch politicians",
            "title_similarity": "0.52636623",
            "sentiment_compound": -0.6973
        },
        {
            "id": "h0fd698",
            "score": 5,
            "text": "The only thing in the south that will rise is the youth.",
            "title_similarity": "0.112023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fdbiw",
            "score": 1,
            "text": "As it should be",
            "title_similarity": "-0.07853265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fdk0s",
            "score": 2,
            "text": "I’m amazed they let her finish",
            "title_similarity": "0.19090742",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0fdstv",
            "score": 7,
            "text": "T-2 Hours until Texas GOP does something incredibly stupid in reaction.",
            "title_similarity": "0.6027926",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h0fe01q",
            "score": 38,
            "text": "Girl get pregnant.  Right wing anti abortion people:  I want my government to think of the welfare of that child!  My religion forbids such things.  They need to intervene and stop abortions! \n\nAfter the baby is born and the parents need social assistance due to having a kid they couldn't support:  Right wing arseholes again:  Why did you have a kid you can't afford!  Fck you and your socialism!  Let the now born baby starve!\n\nThe hypocrisy is mind numbing",
            "title_similarity": "0.7096703",
            "sentiment_compound": -0.9174
        },
        {
            "id": "h0fe6xy",
            "score": 4,
            "text": "The sad thing is, that it’s come to the point where teenagers have to address it in their valedictorian speech whereas is should be a time for celebration",
            "title_similarity": "0.5268276",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0feptl",
            "score": 5,
            "text": "Abbott’s threatened to freeze Smith’s allowance via a recently passed ‘Texas Punitive Parental Standards’ law which permits state actions against parents whose offspring commit acts or make statements which the state seems abhorrent.",
            "title_similarity": "0.7333899",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h0feqqa",
            "score": 1,
            "text": "What is the new law?",
            "title_similarity": "0.23522785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fewu9",
            "score": 5,
            "text": "Power to the fucking people !\n\nFuck Texas for Abortion Laws, Fuck Georgia for Voting Laws, Fuck Republicans for trying to ruin the country !",
            "title_similarity": "0.7493222",
            "sentiment_compound": -0.9446
        },
        {
            "id": "h0fezat",
            "score": 7,
            "text": "Paxton Smith is the heroine we don't deserve, but need.                                                   \n   \"While the law makes an exception for medical emergencies, it does not exempt   \n   pregnancies caused by rape or incest.\"                                                                                   \nHow evil to force the victim to bear her attacker's child.",
            "title_similarity": "0.6384672",
            "sentiment_compound": -0.9468
        },
        {
            "id": "h0ff77q",
            "score": 4,
            "text": "Now Texas is gonna impose something super stupid like valedictorian speeches can’t be made unless by a staff member",
            "title_similarity": "0.7105834",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0fffou",
            "score": 2,
            "text": "What is wrong with the people of Texas?",
            "title_similarity": "0.413076",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0ffqr4",
            "score": 7,
            "text": "Its strange to me people aren't calling it what it is. Its an abortion ban, when you legally can't ban abortions.  Same as a ban on ammunition is a gun ban when you can't ban guns. The lawmakers are well aware that you can't figure out you are pregnant and decide fast enough to make the 6 week cutoff. And when they do find out people were fast enough, they'll add on a 3 week waiting period before you can get one so you \"can be sure of your decision.\"",
            "title_similarity": "0.6806601",
            "sentiment_compound": -0.6544
        },
        {
            "id": "h0ffwhv",
            "score": 7,
            "text": "I am so happy I don’t live in a land where old men use middle eastern folklore to justify the oppression of women.",
            "title_similarity": "0.4583631",
            "sentiment_compound": 0.6948
        },
        {
            "id": "h0ffxjh",
            "score": 3,
            "text": "Texas just passed so many insane bills in this past legislative session. The Republican Party is dead. In its place there is an ultra-conservative party, and a bunch of listless moderates trying to tag along for the scraps.",
            "title_similarity": "0.70151484",
            "sentiment_compound": -0.4364
        },
        {
            "id": "h0fgdj5",
            "score": 3,
            "text": "A brave girl. Gives me hope for the future.",
            "title_similarity": "0.14145194",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0fgstk",
            "score": 1,
            "text": "What a hero!",
            "title_similarity": "0.079456106",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h0fh5nr",
            "score": 3,
            "text": "Why are southerners so obsessed with controlling women? It's a sign of extreme weakness imo. Like, you shouldn't have to control them to get ass. Just don't be gross.",
            "title_similarity": "0.52417445",
            "sentiment_compound": -0.5449
        },
        {
            "id": "h0fhgoo",
            "score": 3,
            "text": "Love the speech, sad to see she's going to college in Texas.  I hate to say but the days are numbered for Roe and states like Texas, Alabama, Mississippi and other red states will ban abortion.\n\nEvery woman of means should start voting with their feet.  If abortion is important to you and you can afford to move, do it.  Take your tax dollars and get the fuck out.  The other half of this Country has great colleges and jobs and would love to have her  I'm sure.",
            "title_similarity": "0.7263823",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h0fhhkq",
            "score": 4,
            "text": "Texas is so backward and reactionary! Can’t wait to see it go Blue! GOP voter suppression is cowardly, disgraceful, and unmanly!",
            "title_similarity": "0.6619845",
            "sentiment_compound": -0.5386
        },
        {
            "id": "h0fhhtl",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.11669731"
        },
        {
            "id": "h0fhi6t",
            "score": 6,
            "text": "Gov Abbot and Lt Gov Patrick trying to figure out how to pass a law banning female valedictorians from aborting prepared speeches",
            "title_similarity": "0.68876994",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0fht9l",
            "score": 6,
            "text": "Abortion is not about pro life. it is about how much money the state can wrench from that fetus when it is birthed, in child care, in pre-school, in kindergarten, in elementary school, in church bible camps, in high school, college, etc., It is about power, control, extortion. plain and simple.",
            "title_similarity": "0.653952",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0fhthe",
            "score": 5,
            "text": "Good for her!\n\nValedictorians of both sexes should include the phrase **\"and move out of this state as soon as humanly possible until the law is fair for everyone**\" in every speech at every graduation.",
            "title_similarity": "0.60426164",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h0fhtim",
            "score": 4,
            "text": "You can give brave and feel good speeches like that all you want. But if Texans keep voting in these crazy right wing extremists, those feel good speeches won't mean any more than a fart in the wind. As long as the crazy right wing holds the levers of power, a college speech won't mean anything. Texans have only one path to change things- STOP voting in these right wing nutjobs before they strip away the right to vote completely.",
            "title_similarity": "0.6490806",
            "sentiment_compound": -0.2958
        },
        {
            "id": "h0fi3h4",
            "score": 1,
            "text": "Has she been permabanned from voting yet?",
            "title_similarity": "0.37556493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fiee5",
            "score": 7,
            "text": "All these pro lifers present anti abortion laws as affecting everyone. But it won’t affect them, they’re rich enough to get their mistress a private abortion. It’ll just make it something just for the rich and not for the poor.",
            "title_similarity": "0.57883036",
            "sentiment_compound": 0.9257
        },
        {
            "id": "h0fiex9",
            "score": 3,
            "text": "Wait, did I understand correctly from the article that this is actually happening in September??\n\nI thought it was just something proposed by some absolute religious lunatics, never would have ever thought it could happen",
            "title_similarity": "0.5970584",
            "sentiment_compound": -0.4515
        },
        {
            "id": "h0fijbo",
            "score": 7,
            "text": "My body* my choice**\n- Texas\n\n*except if you’re a woman\n**must be a man",
            "title_similarity": "0.45421588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fit4d",
            "score": 7,
            "text": "Fucking hell yes, atta girl!!",
            "title_similarity": "0.23384014",
            "sentiment_compound": -0.5421
        },
        {
            "id": "h0fj35x",
            "score": 4,
            "text": "May Phyllis Schlafly forever rot in hell",
            "title_similarity": "0.44661292",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0fj8er",
            "score": 2,
            "text": "They weren't cut off by the approved speech nazis?",
            "title_similarity": "0.31957018",
            "sentiment_compound": 0.5594
        },
        {
            "id": "h0fjfmm",
            "score": 1,
            "text": "I cried a little listening to her. Feels bad man.",
            "title_similarity": "0.3205364",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h0fjrd9",
            "score": 8,
            "text": "The abortion fight is a fight against women, it’s about control, domination, if a man ...any man.. incest, .rape... that man has the control the domination of that woman to make her have his baby.  That young woman made the case, she talked to women, such bravery.  Women all over the entire country can make a difference and assure that  these women hating politicians are shown the door. I hope she is called into the media and tells her story.",
            "title_similarity": "0.6894811",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h0fjwb7",
            "score": 3,
            "text": "Republicans should be pro sterilization.",
            "title_similarity": "0.43159664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fkgfj",
            "score": 6,
            "text": "The texas government is shameful",
            "title_similarity": "0.4979284",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0fl7et",
            "score": 2,
            "text": "The irony that the best, brightest and valedictorian are not yet out of school and are already being muzzled is just another failure of the academia.\n\nCan you imagine being the best in school but still needing to get your speech checked on…",
            "title_similarity": "0.51064986",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h0fleu4",
            "score": 1,
            "text": "https://www.youtube.com/watch?v=mrfe27VDuRA",
            "title_similarity": "0.22609068",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0flit8",
            "score": 2,
            "text": "This is all very simple. They want to claim the moral high ground only as long as it costs THEM nothing. No money, no inconvenience. For them.\n\nIt's okay if it literally costs YOU everything. As long as THEY don't have to pay one cent extra in taxes.",
            "title_similarity": "0.27526596",
            "sentiment_compound": 0.625
        },
        {
            "id": "h0fljwn",
            "score": 3,
            "text": "Absolute legend. Hearing how terrified she was on the front end of that speech, then her transition to strength with cheers from her peers and on-lookers, MAN. Wild.",
            "title_similarity": "0.5995861",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0flmkc",
            "score": 1,
            "text": "I love how the GOP is building its platform for the next generation.",
            "title_similarity": "0.20738345",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0flwss",
            "score": 5,
            "text": "Let's put this in terms even Greg Abbott can understand.\n\nAnti-abortion legislation is tantamount to making it illegal to get post-exposure prophylaxis treatments if some random person injects you with an HIV infected needle without your consent.\n\nNot that the GOP cares anyways, this legislation is pure political virtue signaling to a gullible and easily manipulated base.",
            "title_similarity": "0.7423478",
            "sentiment_compound": -0.656
        },
        {
            "id": "h0fmmpo",
            "score": 3,
            "text": "Here’s to the hope that the smart valedictorian will take her talents elsewhere, far from the chaotic, bigoted, & discriminatory circumstances which dominate Gov. Greg Abbott’s violent, sick, dystopian version of Texas.",
            "title_similarity": "0.63988656",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0fmvvi",
            "score": 4,
            "text": "Damn. Powerful words from the generation witnessing the collapse of the middle class, environment, civil rights, education and RvW.  Now that this is going viral, the countdown begins for her to be stripped of her honors and diploma. The GQP will not let her words go unpunished.",
            "title_similarity": "0.68479836",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0fnogf",
            "score": 1,
            "text": "What are a they going to do, give her detention?",
            "title_similarity": "0.35669702",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0fouo2",
            "score": 3,
            "text": "What a fucked up state of affairs. The concept of most developed country in the world is such a sham.",
            "title_similarity": "0.42123988",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0fovf2",
            "score": 1,
            "text": "SHIBArmy: join the fight and grow the community.... buy shib, donate shib, burn shib. Also look at this article, would look great with a shib!!!!",
            "title_similarity": "0.4793128",
            "sentiment_compound": 0.7067
        },
        {
            "id": "h0fpc4h",
            "score": 2,
            "text": "They need to sell Plan B like Flintstones vitamins if this shit continues.  Take one every morning just to be sure.",
            "title_similarity": "0.52111316",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h0fpmir",
            "score": 6,
            "text": "This valedictorian is already braver than so many people. Putting a face on an issue that so many people only see through 1 tiny lense.\n\nYou can be Christian and pro-choice. You can be married and have 6 children and be pro-choice. You can be all of those things and more, and be pro-life for yourself, pro-choice for everyone else.\n\n... because being forced to carry a rapists baby is cruel... and ectopic pregnancies can't be reimplanted... and yes, children should be wanted and loved, not unwanted and despised.",
            "title_similarity": "0.58133596",
            "sentiment_compound": 0.2081
        },
        {
            "id": "h0fppoe",
            "score": 6,
            "text": "Just now saw a news clip about Texas not requiring “vaccination passports”, with the governor saying, “…we’ll continue to protect public health, without treading on Texan’s personal freedoms.” Lol, what a fuckin joke",
            "title_similarity": "0.71860445",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h0fps66",
            "score": 3,
            "text": "Republicans are facists for being angry about this",
            "title_similarity": "0.52458",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0fpy00",
            "score": 1,
            "text": "Freedom of speech/freedom of expression",
            "title_similarity": "0.068128675",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0fq3dr",
            "score": 6,
            "text": "Makes me sick to be a Texan. I'm so sick of these ass backward fucks signing laws that only benefit them and their religious base. Isn't the government supposed to be here for everyone, not just GQP members and religious nutjobs?",
            "title_similarity": "0.62187195",
            "sentiment_compound": -0.903
        },
        {
            "id": "h0fqcd8",
            "score": 3,
            "text": "Hero.",
            "title_similarity": "0.02638127",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0fqd0l",
            "score": 2,
            "text": "Texas, the land of the censored and abused. \nThey didn't need approval for speaking their mind. \nOH, I'M SORRY, I THOUGHT THIS WAS AMERICA!",
            "title_similarity": "0.5965169",
            "sentiment_compound": -0.8307
        },
        {
            "id": "h0fqoe5",
            "score": 4,
            "text": "Brave young woman. I hope people listen.",
            "title_similarity": "0.17020202",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0fqw6u",
            "score": 1,
            "text": "Bless her sweet heart.",
            "title_similarity": "0.032887988",
            "sentiment_compound": 0.875
        },
        {
            "id": "h0fr41r",
            "score": 2,
            "text": "Educated - and I mean widely.worldly, openly educated - people like her...the hope for the future.",
            "title_similarity": "0.19817996",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0frc9e",
            "score": 5,
            "text": "What about Texas’ anti-voting bill? Or its abysmal and dangerous fully privatized energy grid? There’s just too much to complain about in Texas to fit into one speech I suppose.",
            "title_similarity": "0.6914139",
            "sentiment_compound": -0.269
        },
        {
            "id": "h0frd40",
            "score": 6,
            "text": "Reminder that fetuses aren't sentient and therefore don't matter, we can abort them all day long and it means nothing until they actually have cognition.",
            "title_similarity": "0.45839036",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h0frgn1",
            "score": 2,
            "text": "A leader that doesn't serve the people's best interests is just a dictator.",
            "title_similarity": "0.40410638",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0frsjb",
            "score": 4,
            "text": "Yeah a State where they \"don't need no big government poking there nose in our business\" doesn't mind using big governmrnt to control women's vaginas.\n\nWomen politicians need to start putting forth legislation requiring that boys get reversible vasectomy at puberty to prevent unwanted pregnancies, and that the vasectomy can only be reversed at the age of 21 with proof of attending a sexual education class and an affidavit from a partner verifying that the reversal is for the purpose of procreation.",
            "title_similarity": "0.63911843",
            "sentiment_compound": 0.3156
        },
        {
            "id": "h0fs0qv",
            "score": 9,
            "text": "Ahh the party of free speech and personal freedom threatening to withhold her diploma for the unpardonable sin of... checks notes, using her free speech to defend her personal freedom.",
            "title_similarity": "0.64875495",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h0fs25p",
            "score": 4,
            "text": "Hey I know this person! Saw her post about on FB the other day. Of course she is in band! Band students are the best! :)",
            "title_similarity": "0.3954625",
            "sentiment_compound": 0.8433
        },
        {
            "id": "h0fs60d",
            "score": 2,
            "text": "They turned our girl's mic off at our graduation.",
            "title_similarity": "0.5367849",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fsfv6",
            "score": 2,
            "text": "There’s so much negativity about the out look of humanities future. But Paxton and many others like her are bringing hope for our future!! I hope this becomes uplifting news for those who are dismayed and dejected with American politics.",
            "title_similarity": "0.53289294",
            "sentiment_compound": 0.272
        },
        {
            "id": "h0fsutj",
            "score": 6,
            "text": "> Additionally, the law, which goes into effect on Sept. 1, allows most private citizens to sue an abortion provider if they suspect the provider has violated the new ban.\n\nHow is that in any way constitutional? People with no standing can’t sue another one. Typical knee jerk, shitty bill from thug republicans in Texas.",
            "title_similarity": "0.8149814",
            "sentiment_compound": -0.9468
        },
        {
            "id": "h0ft390",
            "score": 5,
            "text": "Bruh she gave me goosebumps with her delivery at the end, I hope she goes into some sort of public speaking role.",
            "title_similarity": "0.49849612",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0fv7ec",
            "score": 7,
            "text": ">\"I am terrified that if my contraceptives fail, I am terrified that if I am raped, then my hopes and aspirations and dreams and efforts for my future will no longer matter,” Paxton added.\n\nThat's not a bug; that's a feature. Can't have the uppity women forget their place.",
            "title_similarity": "0.51099",
            "sentiment_compound": -0.9403
        },
        {
            "id": "h0fval7",
            "score": 4,
            "text": "I'm surprised she wasn't cut off.",
            "title_similarity": "0.11828441",
            "sentiment_compound": 0.4047
        },
        {
            "id": "h0fvi7d",
            "score": 1,
            "text": "Do you guys think the recent Texas passing of fetal heartbeat bill will make its way onto the Supreme Court?",
            "title_similarity": "0.6414157",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0fvkr2",
            "score": 1,
            "text": "The stars at night are big and bright....",
            "title_similarity": "0.17162341",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0fvn8a",
            "score": 13,
            "text": "texas- \"muh freedum!!\"\n\nalso texas- \"haha woman can't have bodily autonomy\"",
            "title_similarity": "0.5646254",
            "sentiment_compound": 0.555
        },
        {
            "id": "h0fvumk",
            "score": 12,
            "text": "Forcing poor people to have children while also cutting/discouraging welfare 👍🏼 sounds like Con policy to me",
            "title_similarity": "0.47707552",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0fw87p",
            "score": 6,
            "text": "Wildcard voter here.\n\nAfter the abortion legislation and yanking unemployment benefits for Texans, I will not be voting for Abbott for reelection.",
            "title_similarity": "0.7078564",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0fwl4y",
            "score": 2,
            "text": "he looks kinda old to be in high school",
            "title_similarity": "0.15564285",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fxc3x",
            "score": 3,
            "text": "This is what happens when the federal government can’t make decision. They leave it up to the states to decide on there own and some states are way to fucked up for that kind of responsibility.",
            "title_similarity": "0.47201955",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0fy7uu",
            "score": 6,
            "text": "I’m a Texas conservative and even I disagree with this bill. 6 weeks is not enough time. I’m against abortions for several reasons, but the clinics are here for a reason.",
            "title_similarity": "0.6749747",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0fyx6s",
            "score": 3,
            "text": "Shows what a shithole texas is that they'd insist on preapproving a valeditorian's speech.",
            "title_similarity": "0.6956608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0g09zp",
            "score": 3,
            "text": "Thanks for using her platform, rather than putting everyone to sleep on graduation day.\n\nChoosing action was gutsy and right.",
            "title_similarity": "0.39032358",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0g36gb",
            "score": 3,
            "text": "Yeah she killed it. Great message and delivery. Nerves at the start but you could tell this means something to her and she didn’t need her cards at all. Well done",
            "title_similarity": "0.4282382",
            "sentiment_compound": 0.431
        },
        {
            "id": "h0g3djy",
            "score": 4,
            "text": "Got more courage than the entire Republican Party.",
            "title_similarity": "0.24302053",
            "sentiment_compound": 0.7346
        },
        {
            "id": "h0g3i9c",
            "score": 1,
            "text": "[Link](https://youtu.be/mrfe27VDuRA?t=275).",
            "title_similarity": "0.16304451",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0g3io1",
            "score": 3,
            "text": "What an amazingly brave thing for that young woman to do.\n\nThe utter immorality of taking control over the body of another human being, even one, is appalling. That these white sepulchers believe that their god wants them to control the bodies of all women is beyond the pale.",
            "title_similarity": "0.58512336",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0g3y4f",
            "score": 4,
            "text": "Bravo to that girl for sticking up for herself and others. \n\nI don’t get why people give a flying shit about what I do with my body. Are you gonna fucking pay my bills? Are you gonna pay my “unwanted” child’s bills because you’re some asshole fuck that decided to make not only myself but yet an innocent child suffer?\n\nI understand there’s adoption choices, but theres over 120,000 children waiting to be adopted.. it’s a long process, it’s expensive, it’s not easy and you have to jump through hoops to get it done. \n\nI fucking hate people, I’m so glad I don’t live in a Red state.",
            "title_similarity": "0.6168746",
            "sentiment_compound": -0.8861
        },
        {
            "id": "h0g4kws",
            "score": 1,
            "text": "Props to her. I’m just amazed that the school let her give that speech at all. My old high school in Texas would’ve cut that mic the second she went off-script",
            "title_similarity": "0.6738397",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0g4rd2",
            "score": 3,
            "text": "Good for this young woman I hope she goes far in life.",
            "title_similarity": "0.18112049",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0g4whc",
            "score": 1,
            "text": "When will technology bury this issue for good? Some kind of super-contraceptive maybe. Couldn't come soon enough.",
            "title_similarity": "0.4410804",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0g555c",
            "score": 3,
            "text": "Same people who claimed wearing a mask was a violation of their civil rights cheer these laws. Despicable and hypocritical. Great speech by that young lady. Now let's watch as that high school gets petty and withholds transcripts meant for college as a form of revenge. Bastards.",
            "title_similarity": "0.7044598",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h0g5cfr",
            "score": 1,
            "text": "How many death threats has she and her family received so far? Have they shot up her house yet?",
            "title_similarity": "0.5295173",
            "sentiment_compound": -0.7941
        },
        {
            "id": "h0g6boc",
            "score": 6,
            "text": "I started tearing up ngl, that was so strong and powerful... I’ve heard a lot of speeches in my life and even without my bias this is the best speech I’ve ever heard. It’s honest, emotional, and drives a hard clear point across. I love it and I hope she keeps herself safe from the after results..",
            "title_similarity": "0.43515095",
            "sentiment_compound": 0.9816
        },
        {
            "id": "h0g8wci",
            "score": 5,
            "text": "There are some smart people in Texas",
            "title_similarity": "0.13811585",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0gf212",
            "score": 4,
            "text": "Best thing I've seen this week. Amazing",
            "title_similarity": "0.22158507",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h0ghbs2",
            "score": 6,
            "text": "That kid is brave. Bravo.",
            "title_similarity": "0.034577448",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0gkxo7",
            "score": 9,
            "text": "A high school graduating valedictorian in the absolute prime of her life giving a speech that is likely to be the proudest moment of her life and she is using it to lecture you, a grown man, Greg Abbot. Take a hint. You KNOW you've fucked up. \nIf I was this lady's father I'd be absolutely SCREAMING praises. They'd have to escort me out as I wouldn't be able to contain how proud I was. I sincerely wish her the best in life!",
            "title_similarity": "0.59611344",
            "sentiment_compound": 0.933
        },
        {
            "id": "h0glbqz",
            "score": 5,
            "text": "They don't want government interfering in their lives, but are ok with interfering in my uterus.",
            "title_similarity": "0.4174356",
            "sentiment_compound": 0.3997
        },
        {
            "id": "h0gyo3m",
            "score": 5,
            "text": "The heartbeat bill shouldn’t even be called legislature. It’s straight up a bounty hunting. $10,000 + court fees paid for each person turned in and successfully convicted of unlawful abortion.",
            "title_similarity": "0.70595336",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0h1fz9",
            "score": 1,
            "text": "Stop normalizing “approved or unapproved” speech, you either believe in the 1st amendment or you are a fake ass patriot traitor!",
            "title_similarity": "0.60332465",
            "sentiment_compound": -0.8439
        },
        {
            "id": "h0h5jv2",
            "score": 2,
            "text": "My hope has been restored by the future leaders emerging. TikTok had pretty much destroyed it.",
            "title_similarity": "0.38513446",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0h5vzo",
            "score": 9,
            "text": "Lol, Texas is \"pro-life\", but execute 5 times as many people between 1976 and 2020 as the second highest state.\n\nTexas isn't pro life, it's pro forced birth.",
            "title_similarity": "0.5720247",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0h747u",
            "score": 2,
            "text": "Thank you for letting her have free speech.",
            "title_similarity": "0.16278708",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0hycch",
            "score": 2,
            "text": "too bad people like her are going to have to wait a good 10 or 15 years when the boomers die to have nice things.",
            "title_similarity": "0.5267364",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0i4zw5",
            "score": 2,
            "text": "young women in the generation after mine, have never had to live in a society where men could tell her what to do with her body. They won't go quietly away because these laws are passed, they will fight, and they will win.",
            "title_similarity": "0.5069873",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0i5unh",
            "score": 2,
            "text": "I assume virtually all pro-lifers are actually pro-abortion, it's just a matter of to what degree. Why can't they thoughts-and-prayers and now-is-not-the-time their way out of other people's business like they do with other issues?\n\nI swear they're the fastest at driving out of state when their teenage daughter gets pregnant.",
            "title_similarity": "0.72643507",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0iiiop",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.11934906",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0jpwdn",
            "score": 2,
            "text": "Paxton Smith for PRESIDENT!",
            "title_similarity": "0.40801525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l73ht",
            "score": 1,
            "text": "She is one brave young woman.  I don’t think I would have the guts to do what she did at that age, glad she did it.",
            "title_similarity": "0.34247094",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0mq1xm",
            "score": 2,
            "text": "God, I'd kill to have been in the audience watching all the conservative parents squirm. I can only imagine the expressions on their faces.",
            "title_similarity": "0.5687113",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0vo3v0",
            "score": 1,
            "text": "He should have watched this first! -->  \nhttps://www.youtube.com/watch?v=mYWAq48zMdk",
            "title_similarity": "0.34206766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13qj3d",
            "score": 2,
            "text": "Very proud of her.",
            "title_similarity": "0.084117316",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h34gn4h",
            "score": 1,
            "text": "So? Its a kid and there are plenty who agree and disagree with her",
            "title_similarity": "0.32651174",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h39o9w0",
            "score": 1,
            "text": "“I am terrified that if my contraceptives fail, I am terrified that if I am raped, then my hopes and aspirations and dreams and efforts for my future will no longer matter,” Paxton added……\n\nTo many people, a woman’s only aspirations and dreams should be having children.",
            "title_similarity": "0.48511094",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h54opgb",
            "score": 1,
            "text": "This is some 3rd world country shit right here",
            "title_similarity": "0.31273335",
            "sentiment_compound": -0.5574
        }
    ]
}