{
    "Texas AG Says Trump Would've 'Lost' State If It Hadn't Blocked Mail-in Ballots Applications Being Sent Out\n": [
        {
            "id": "h0q217d",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.54986",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h0rwfuj",
            "score": -13,
            "text": "Hate Trump, but wanking off about his failed term instead of focusing on relevant political conversations now won't solve anything. \n\nYou won't find an r politics conversation about campaign finance reform hitting the front page. You won't hear anything about reform or the contributions from the financial sectors aka wall street.\n\nBy design, this sub pushes  inflammatory content that absolves underlying power structurs for creating the issues leading to the very problems described.",
            "title_similarity": "0.7650641",
            "sentiment_compound": -0.7862
        },
        {
            "id": "h0q93co",
            "score": 73,
            "text": "So in other words the republicans stole the election. If you know a republican, you know a fascist piece of garbage",
            "title_similarity": "0.64867425",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0s666t",
            "score": 0,
            "text": "So everyone was cheating for the president and committing federal offenses. These are supposed to be religious folks. No wonder the prophet in the Bible said Hell has move up from beneath the earth to meet thee!",
            "title_similarity": "0.5611676",
            "sentiment_compound": -0.921
        },
        {
            "id": "h0ql06o",
            "score": 66,
            "text": "I really don’t understand why people in Texas think this is ok, Paxton blatantly says he blocked people from voting.  My state only does mail in voting and it’s fucking awesome and it works very well!  Texas should be kicked out of the union!",
            "title_similarity": "0.8093337",
            "sentiment_compound": 0.7407
        },
        {
            "id": "h0qumdf",
            "score": -16,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0qmo8g",
            "score": -69,
            "text": "the incident of Jimmy Carter crying after being briefed about classified information regarding UFO’s is largely believed to be true by the serious researchers on the subject. As a forewarning, the following information is very unsettling and will explain why Carter never “kept his promise” of revealing classified UFO information to the public.\n\nAccording to the story that was corroborated by more than one witness, U.S. presidents are only given a cursory overview of the subject. Apparently, the CIA runs the program, only provide information to the President on a need to know basis, and do not consider presidential curiosity as sufficient need to know. This was implemented after Kennedy, and all presidents after him have been given only summary briefings (some presidents for unknown reasons were given more than others).\n\nOkay on to your question. President Carter is a deeply religious man who had also witnessed a UFO with 6 other people. Everyone thought that he would be the one to finally release UFO info to the public but as the story goes, he was repeatedly stonewalled. Eventually, the CIA had “the talk” with him, and afterward it was reported that he sunk his head in his hands and not only began to deeply sob, but was visibly disturbed for some weeks afterward.\n\nWhat was he told and shown?\n\nHe was told that the major religions including Christianity were programs created by extraterrestrials to prevent us from destroying ourselves while they ran their experiments on us – and that they made us. At this moment it became clear to Carter that such information could cause tremendous economic and social upheaval",
            "title_similarity": "0.6243391",
            "sentiment_compound": -0.7103
        },
        {
            "id": "h0thx5k",
            "score": 1,
            "text": "hmm...That’s an interesting way of saying- he only lost because of difficult to verify mail in ballots that were sent en masse, in multiples, and sometimes by those who do not possess the right to vote. 🤔",
            "title_similarity": "0.67526543",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0uf7d4",
            "score": -1,
            "text": "I wish the Republican Party would just dissolve. Let the Democrats take over. With the mounting debt crisis, the Democrats will run the country into the ground in no time. \n\nThen maybe we could have some political parties that actually represent the people and not the oligarchy.",
            "title_similarity": "0.7610041",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0qnn7j",
            "score": 21,
            "text": "I'm beyond sick of the old Confederate states. They've been nothing but an anchor on the rest of the country.",
            "title_similarity": "0.52851367",
            "sentiment_compound": -0.2846
        },
        {
            "id": "h0r3is3",
            "score": -22,
            "text": "Numerous times in the past, r/politics has BLASTED this AG, but now we take him on his word just because he said something r/politics likes?? Please be consistent",
            "title_similarity": "0.53261244",
            "sentiment_compound": 0.7912
        },
        {
            "id": "h0ql7ys",
            "score": 41,
            "text": "So, they actually committed the voter fraud then right",
            "title_similarity": "0.56952333",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0r16hb",
            "score": -40,
            "text": "Do you guys actually wake up and go to sleep thinking about Donald Trump every day?",
            "title_similarity": "0.49394318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qui8n",
            "score": 13,
            "text": "Lol, this guy is the single most blatantly corrupt politician in the US. I almost respect him for it.",
            "title_similarity": "0.5095022",
            "sentiment_compound": 0.6815
        },
        {
            "id": "h0sf6ee",
            "score": -4,
            "text": "License to operate a vehicle? Use your license to vote. End of story. You dont get to vote for who has the nuke codes like American idol",
            "title_similarity": "0.6766609",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0qgdbh",
            "score": 57,
            "text": "I’m a Texas resident and home bound quadriplegic, I sent in paperwork for mail in vote in July of 2020. Never got a ballet. Any lawyers that want to take my case and File suit against Ken Paxton, please contact me.",
            "title_similarity": "0.6095812",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0qeq42",
            "score": -49,
            "text": "Trump is long gone and he even fueled the insurrection, and you still want to call him a US president (past)???",
            "title_similarity": "0.6858981",
            "sentiment_compound": 0.212
        },
        {
            "id": "h0sfrl8",
            "score": -4,
            "text": "\"If we'd lost Harris County—Trump won by 620,000 votes in Texas. Harris County mail-in ballots that they wanted to send out were 2.5 million, those were all illegal and we were able to stop every one of them,\"..... read the article. They stopped illegal mail in ballots not all mail in ballots.... cmon guys. We're better than this.",
            "title_similarity": "0.79564345",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0rs0s7",
            "score": -2,
            "text": "he literally said all them were illegal...",
            "title_similarity": "0.35569936",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0ti4xb",
            "score": -4,
            "text": "The only way Democrats can win in Texas is to count illegitimate votes or make all voting illegitimate.",
            "title_similarity": "0.7170675",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0r9bji",
            "score": -10,
            "text": "I doubt it — Texas wouldn’t have leaned leftwards far enough and “muh Biden’ll take our guns!”",
            "title_similarity": "0.7169938",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h0re5wy",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.117222495"
        },
        {
            "id": "h0r4085",
            "score": -10,
            "text": "Texans are voter suppressed. Please allow someone who isn't \"Beto\" lead voter registration and aid organisation. I'm not a Texan, but cannot stand Beto. Anyone know who could be their Stacy Abrams?",
            "title_similarity": "0.76002026",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0qqtck",
            "score": -53,
            "text": "People who actually think Texas is blue/will ever be blue either don’t live here or are completely delusional lol\n\nEdit: loving all these replies! Just reassuring me Reddit is still dumber than ever lmao",
            "title_similarity": "0.5737392",
            "sentiment_compound": 0.9076
        },
        {
            "id": "h0qwhzv",
            "score": -41,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0qkz0s",
            "score": 18,
            "text": "Just a reminder that our state AG, Ken Paxton, is under indictment. That should tell you all you need to know about that.",
            "title_similarity": "0.48835796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qw8ab",
            "score": -3,
            "text": "Why is texas still a state?  Just let them go already.  They want to be their own country so bad, lets oblige them and let them find out just how isolated they will be as a stand-alone country.",
            "title_similarity": "0.6424295",
            "sentiment_compound": -0.7573
        },
        {
            "id": "h0swgk8",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qmjmg",
            "score": 12,
            "text": "This tells your more about Republicans than it does Trump",
            "title_similarity": "0.5483698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qmg2b",
            "score": 12,
            "text": "This is my biggest fear in my state, Florida, Desantis is definitely willing to use Paxton and Abbott's playbook for the next election.",
            "title_similarity": "0.5568214",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0qqc5q",
            "score": 5,
            "text": "Texas? You mean the state that let's criminals and mentally ill people legally own a gun. 🤡",
            "title_similarity": "0.58950174",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h0slpf0",
            "score": -3,
            "text": "Texas AG says trump would've 'lost' state if we could have just cheated.  Fixed it for you",
            "title_similarity": "0.895681",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0u9wpm",
            "score": 0,
            "text": "Democrats should educate their followers on how to vote.  Stop blaming all losses on the voting systems. When someone shows up at the polls, they are not turned away based on their voting intentions",
            "title_similarity": "0.64872897",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h0ujj75",
            "score": 0,
            "text": "I hope more deceased people, illegal immigrants with a driver’s license, everyone’s pets and also cartoon characters are allowed to vote in the next election. We have to be more inclusive…. Lol",
            "title_similarity": "0.59935546",
            "sentiment_compound": 0.2766
        },
        {
            "id": "h0uuv4x",
            "score": 0,
            "text": "Any state would’ve lost if sanctioned voter fraud was allowed. Lost, more like stolen.",
            "title_similarity": "0.7541741",
            "sentiment_compound": -0.8436
        },
        {
            "id": "h11lzak",
            "score": 0,
            "text": "Trump👍",
            "title_similarity": "-0.074239574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h12oj0f",
            "score": 0,
            "text": "Trump is a big man, because he is good!",
            "title_similarity": "0.2999643",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h0qkrha",
            "score": 21,
            "text": "Republicans aren’t even shy about this....:they essentially boast about it.   They want to limit the franchise because our soon to be non-white majority in the U.S. probably won’t vote for the open racism that is the modern GQP",
            "title_similarity": "0.70743763",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0rikg8",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0q8mjj",
            "score": 4,
            "text": "This guy only wants the diaper wearing geriatrics to vote by mail. The same people that give foreigners their banking info over the phone.",
            "title_similarity": "0.50123155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qz4l2",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0rmu8e",
            "score": 5,
            "text": "Anybody who wants their vote to count 10 years from now have got to vote against Republicans. Conservative or Liberal (it doesn’t matter whether you lean left or right) your vote with be meaningless if the Republicans are allowed to continue. They don’t represent “family values”, they certainly don’t represent Christianity, they only represent wealthy white people… period. Republican voters consistently vote against their own best interests because they believe a lie that the wealthy give a crap about them. The super wealthy (almost without exception) gained their wealth by cheating others as a way of life; most billionaires pay less in taxes than a grocery store checker. Corruption under Republican leadership has siphoned hundreds of billions of tax dollars into the coffers of the rich instead of providing for the common good of the nation. They are driving this country to a minority rule and a classic fascist state. This is not hyperbole or a baseless rant, it is a course that has been set and will come to pass very soon if they can’t be stopped. And if this happens those who support the Republican Party today will suffer just as much as those who are willing to stand and fight for democracy.",
            "title_similarity": "0.72888374",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h0r106q",
            "score": -20,
            "text": "Yea, how many people didn't vote, didn't plan on voting. Yet voted democrat down the board. Nursing homes, hospice, people with dementIA, people with Parkinsons.. All voted Democrat.. LOL. No no.. Then saying hey I'll buy you a hamburger today if you vote democrat.. Then I'll fuck you , your kids, and your grandkids for the rest of your lives..",
            "title_similarity": "0.65080655",
            "sentiment_compound": -0.2885
        },
        {
            "id": "h0r8ghl",
            "score": -20,
            "text": "Fraudulent Mail-In ballots...",
            "title_similarity": "0.5082829",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0rg77m",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qov06",
            "score": 7,
            "text": "I received multiple ballot applications FROM TRUMP here in Texas. Had his name on it and his face and his autograph. There were applications going out from all sorts of groups and candidates.",
            "title_similarity": "0.5198485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rbpvm",
            "score": -6,
            "text": "Arizona audits folks! #panic",
            "title_similarity": "0.44444102",
            "sentiment_compound": -0.5562
        },
        {
            "id": "h0s10ds",
            "score": -5,
            "text": "It’s been 8 months since he was in office, I’m tired of seeing his name. Regardless of side you have to admit it gets boring and old fast “trump this, trump that”. Cover real news",
            "title_similarity": "0.48234254",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0rmqws",
            "score": 1,
            "text": "I’ve already decided to retire to Texas from New Jersey. Who the hell wants to retire to and have to live in Florida anymore. 40 years or so, if I’m alive, I voting blue in Texas.",
            "title_similarity": "0.6112152",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0rv6l0",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0sa30b",
            "score": -1,
            "text": "Delusional... at best.",
            "title_similarity": "0.1193019",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0sgf1y",
            "score": -1,
            "text": "'Would've lost state'...Coulda, woulda, shoulda. I have some property for you in LOL. Lower Obscure Louisiana... it's beachfront...It's not a swamp at all.",
            "title_similarity": "0.39465588",
            "sentiment_compound": 0.0085
        },
        {
            "id": "h0skmah",
            "score": -1,
            "text": "The weird part was that the groups filled in the void and many people received more than one Application for Ballot by Mail because of this dude.    Which was confusing to many, but the number of people (D;s) voting by mail increased dramatically in 2020.",
            "title_similarity": "0.5570965",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0skpsu",
            "score": -1,
            "text": "Duh. How else were you supposed to stuff the ballot box.\n\nBe better.",
            "title_similarity": "0.5283892",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0t6pp6",
            "score": -1,
            "text": "2.5 million mail in ballots in a county with 4.8 million people according to the most recent census? ThT math doesn’t add up but it’s anti-trump in nature so let’s get on board!!",
            "title_similarity": "0.73774874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0tabgp",
            "score": -1,
            "text": "Can any of you explain how the Fake Pipe Burst used to empty out the polls in Atlanta wasn't fraudulent behavior please? Or do we stick our heads in the sand while pretending not to see the evidence of fraud on video???",
            "title_similarity": "0.6438813",
            "sentiment_compound": -0.8222
        },
        {
            "id": "h0tff1b",
            "score": 1,
            "text": "So mail in ballots which are easy to fraud were blocked and Trump won? That should show you guys just how fucked this last election was.",
            "title_similarity": "0.80457556",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0tfubr",
            "score": -1,
            "text": "Since half of them were fake I suppose so...",
            "title_similarity": "0.31194437",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0ubq93",
            "score": -1,
            "text": "Because of the influx of tons of illegitimate mexican voters",
            "title_similarity": "0.54082686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qkt1f",
            "score": 25,
            "text": "Openly bragging about voter suppression. This is not a good trend for America.",
            "title_similarity": "0.6364015",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h0qm8mv",
            "score": -25,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qmde3",
            "score": -23,
            "text": "Here’s an idea. Let’s stop worrying about who says what to try and make a highlight on the news and pay attention to real action going on. Words mean nothing. Every politician lies. Welcome to the real world. You want change? Implement term limits and get these fucks out, Democrat, republican, it DOESN’T MATTER. This is all a fuckin dog and pony show. Wake up. Nothing you believe is actually going on. THEY want division to maintain control over YOU. You want real accountability? Let’s audit and see where all of our tax dollars are truly spent. Let’s ban lobbying. Let’s shut down congress and senate from being able to trade stocks while in office. Let’s follow the paper trail folks. WAKE THE FUCK UP.",
            "title_similarity": "0.6255152",
            "sentiment_compound": -0.6402
        },
        {
            "id": "h0qqc7j",
            "score": -26,
            "text": "If Democrats in Texas didn’t vote because they couldn’t vote by mail then we have bigger problems than Paxton and Abbott.",
            "title_similarity": "0.81450343",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0qw921",
            "score": -28,
            "text": "Alternative headline; Dems may have won the state if they got off of their lazy asses like the repubs did.",
            "title_similarity": "0.63918877",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0qyrzu",
            "score": -27,
            "text": "Obviously.... Anyone could have won the election with enough dead voters and fraudulent mail in ballots..",
            "title_similarity": "0.70172167",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0r2v95",
            "score": -15,
            "text": "Damn so why didn’t these people who would have mailed their vote in just go out to the polls ? Laziness? Didn’t actually care that much ? Make it make sense",
            "title_similarity": "0.6920216",
            "sentiment_compound": 0.2593
        },
        {
            "id": "h0rjytt",
            "score": -17,
            "text": "Why do democratic voters mail in as opposed to vote in person?",
            "title_similarity": "0.62065274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0quohr",
            "score": 9,
            "text": "Texas going blue next election.",
            "title_similarity": "0.4651413",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qwpe7",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0r2wgz",
            "score": -7,
            "text": "Trump is Americas father and mother",
            "title_similarity": "0.43053016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rkiiu",
            "score": -9,
            "text": "I find it funny, a party that is so concerned about external countries manipulating the voting process are also concerned with voter ID laws. ID laws just makes sense.",
            "title_similarity": "0.61408895",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0sbob1",
            "score": -10,
            "text": "Texas AG admits Trump would have lost Texas if they let people cheat.  There fixed it for you",
            "title_similarity": "0.8752126",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0sh4ee",
            "score": -9,
            "text": "You don’t say??? Meaning more votes than registered voters would be counted. Same way how pedo joe got over 84Million votes.",
            "title_similarity": "0.5079662",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ql68d",
            "score": 16,
            "text": "So, in other words, Texas Attorney General confesses to election fraud? Great! That saves a lot of time and trouble. When's his sentencing hearing?",
            "title_similarity": "0.64649963",
            "sentiment_compound": -0.565
        },
        {
            "id": "h0qxxdk",
            "score": -16,
            "text": "Ie. Biden would’ve won if we were able to cheat like we did in other states",
            "title_similarity": "0.63008225",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0qxz9d",
            "score": -16,
            "text": "Texas democrats will complain about every bit of our infrastructure but trust that 2.5 million individuals ballots will be processed securely being sent out to random addresses.",
            "title_similarity": "0.6904937",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0r8xxp",
            "score": -15,
            "text": "So you're saying Biden would have stolen Texas, too?",
            "title_similarity": "0.66887134",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0qodiw",
            "score": 10,
            "text": "Conservatives can't win without cheating. Typical.",
            "title_similarity": "0.5820718",
            "sentiment_compound": -0.67
        },
        {
            "id": "h0qipvm",
            "score": 2,
            "text": "So. He admits to voter suppression then?",
            "title_similarity": "0.5224699",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0quoh2",
            "score": 2,
            "text": "Paxton is long overdue for his day in court. Texas will be better off (hopefully) once he, Abbott, & Patrick are finally gone.",
            "title_similarity": "0.6059871",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0qup54",
            "score": 2,
            "text": "Election interference said out loud?!",
            "title_similarity": "0.4529792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qwlcs",
            "score": 2,
            "text": "He’s trying to cover by saying that other states elections were stolen\n\nHe knows it’s a crock of shit.",
            "title_similarity": "0.6698558",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h0qzc9m",
            "score": 2,
            "text": "Well we got em right? That should be all the evidence you need. Lock em up.",
            "title_similarity": "0.33656988",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0qzvge",
            "score": 2,
            "text": "Good thing they got those  new voter  laws!",
            "title_similarity": "0.3942343",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h0r78y3",
            "score": 2,
            "text": "So at least it’s good to see them admitting this. Their ideology is unpopular and their base is dying off. The Republican Party’s only path forward is voter suppression and cheating.",
            "title_similarity": "0.6562612",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0rvp52",
            "score": 2,
            "text": "Wait... So you’re telling me that there was voter suppression during the 2020 election? Das crazy",
            "title_similarity": "0.71182656",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0ryvep",
            "score": -2,
            "text": "He's a liberal communist who hates freedom, obviously we need to point at and mock him.",
            "title_similarity": "0.57614106",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0sjvwa",
            "score": -2,
            "text": "Wrong.",
            "title_similarity": "0.11843943",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0smx5f",
            "score": -2,
            "text": "In Michigan they sent out unsolicited absentee ballot applications, which was ruled illegal by the state Supreme Court as our law reads. We have absentee voting but requests have to be made in person, at the county clerk’s office. Michigan probably would have gone the other way had they not bulk mailed them.",
            "title_similarity": "0.74807864",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0smxre",
            "score": -2,
            "text": "Not surprised, ppl too lazy to go to a poll vote with mail ins\nEdit:  to clarify, if it’s ok to protest in the streets, it’s ok to vote in person.  I like mail in ball outs for disabled ppl",
            "title_similarity": "0.53750575",
            "sentiment_compound": 0.1862
        },
        {
            "id": "h0syxc3",
            "score": -2,
            "text": "So y’all trump 2024?",
            "title_similarity": "0.41857997",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0t03ux",
            "score": -2,
            "text": "The fact that people continue to flee from states like California, New York and go to Arizona, Texas and Florida for jobs and better quality of life yet still vote for what ruined their home state is infuriating.",
            "title_similarity": "0.6769506",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0t2xc3",
            "score": -2,
            "text": "Yes, because of all the mail in ballot fraud! Any state can be lost on either ticket with mail in ballots because there is no way to traffic the level of corruption associated with it. Both parties have, in their on right fought against this.",
            "title_similarity": "0.74875677",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h0t5hqp",
            "score": -2,
            "text": "Duh. Most disinterested people are going to vote democrat. The less you know, the more likely you are to vote for bad ideas.",
            "title_similarity": "0.6608564",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0u990w",
            "score": -2,
            "text": " those mail in ballots that were illegal. Which happened in more than Just Texas. We need to protect the integrity of our elections or else your vote counts for nothing because they will just feed the votes they need to get who they want elected... Something like Cuba does.\n\nTruth will come out and you all going to be eating crow.",
            "title_similarity": "0.73214066",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0qkv3a",
            "score": 10,
            "text": "Oh, cool.  What a fuckface.",
            "title_similarity": "0.097573526",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0qgntt",
            "score": -77,
            "text": "When everyone can vote, smart people lose. Democracy is mob rule.",
            "title_similarity": "0.6072773",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qqdka",
            "score": -42,
            "text": "Unsolicited mail in ballots will destroy democracy.",
            "title_similarity": "0.6528672",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0q40vr",
            "score": 35,
            "text": "Unfortunately just like everything else, this won’t matter. Admitting on tape he downplayed the virus didn’t matter. admitting he helped cover up the murder of a journalist didn’t matter and losing an election that his own admin said was the most secure in history didn’t matter. This asshole gets away with everything.",
            "title_similarity": "0.6345333",
            "sentiment_compound": -0.6258
        },
        {
            "id": "h0qupi4",
            "score": 3,
            "text": "Your damn straight and this is why the GOP continues to try to suppress voting.",
            "title_similarity": "0.6023208",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0qwico",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0qx485",
            "score": 4,
            "text": "So trump is the one who cheated isn’t that ironic",
            "title_similarity": "0.61035013",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0r1g4y",
            "score": -3,
            "text": "And I can say unicorns fucking exist. Just because someone says something doesn’t mean it’s true",
            "title_similarity": "0.4415011",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0r2nsy",
            "score": -5,
            "text": "Yah buddy",
            "title_similarity": "-0.05516181",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r8798",
            "score": -2,
            "text": "Probably not",
            "title_similarity": "0.08361838",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rokwx",
            "score": -4,
            "text": "This type of behaviour is just going to fast track a civil war.  One to rival the last one.",
            "title_similarity": "0.5268918",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0s9fhq",
            "score": -1,
            "text": "Sure",
            "title_similarity": "-0.16478354",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0sdium",
            "score": -1,
            "text": "Are we still talking about this?",
            "title_similarity": "0.07437093",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sfljh",
            "score": -4,
            "text": "This is not what he was talking about lol. The articles posted on this subreddit are getting a little out of hand on just making stuff up.",
            "title_similarity": "0.46999946",
            "sentiment_compound": 0.6943
        },
        {
            "id": "h0soutf",
            "score": -1,
            "text": "Why are we still talking about this?",
            "title_similarity": "0.11716728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rlp69",
            "score": -13,
            "text": "I don’t understand. Why don’t democrats vote in person?",
            "title_similarity": "0.579167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qqsxz",
            "score": -27,
            "text": "Ballot applications should be mailed out to all voters, for what purpose?\n\nIs there any sort of worthwhile verification process?",
            "title_similarity": "0.49717474",
            "sentiment_compound": 0.3542
        },
        {
            "id": "h0r4u5f",
            "score": -4,
            "text": "Fact check this. Come on *Fact Checkers* do your job on this one please. Maybe some deplatforming for these baseless claims by the AG and anyone who shares this. Can I get a fact check please?",
            "title_similarity": "0.50961244",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0r72qz",
            "score": 5,
            "text": "It's unamerican to prevent americans from voting.  \nPeople fought and died for our right to vote but the party of corruption would only want that liberty to exist if they knew that they could win.  \n\nThey are scared.",
            "title_similarity": "0.71520674",
            "sentiment_compound": 0.8422
        },
        {
            "id": "h0rm50h",
            "score": -5,
            "text": "Well, why does it matter now?",
            "title_similarity": "0.12618434",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0rt3er",
            "score": -4,
            "text": "Yeah and I have some ocean front property for you to buy in Arizona if you believe this one.",
            "title_similarity": "0.34063768",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0ruey2",
            "score": -4,
            "text": "It’s almost as though the politics subreddit is bias!",
            "title_similarity": "0.49919137",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h0s5dn6",
            "score": -2,
            "text": "Oh give it up",
            "title_similarity": "0.10279579",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0s77sr",
            "score": -6,
            "text": "Rent free",
            "title_similarity": "0.055047795",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0sjx37",
            "score": -4,
            "text": "Good. Fuck Beto",
            "title_similarity": "0.050987206",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0sn77k",
            "score": -3,
            "text": "How is it racist ? People can go to polls. People can request a mail in ballot. It’s just lazy for someone to do neither.",
            "title_similarity": "0.63767177",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0udrlo",
            "score": -5,
            "text": "Sad all them liberal maggots leave their dumpy states and are now on their way to destroying Texas as well.",
            "title_similarity": "0.601457",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h0qgju7",
            "score": -42,
            "text": "I get mailing out vote by mail ballots but mailing out applications for those ballots is kind of ridiculous when anyone can download the application online or grab one very easily.",
            "title_similarity": "0.600468",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h0qogng",
            "score": -34,
            "text": "Democrats will still whine, \"BiPaRTisaNsHiP\". Cucks",
            "title_similarity": "0.45959547",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0qxor8",
            "score": -16,
            "text": "Texas AG admits if voter fraud in Texas was legal Republicans would have lost. “Breaking News!!!”",
            "title_similarity": "0.88037694",
            "sentiment_compound": -0.6458
        },
        {
            "id": "h0rcak4",
            "score": -14,
            "text": "In other context... Trump wouldve ‘lost’ the state of Texas if it allowed democrats reach to cheat. Boohoo",
            "title_similarity": "0.8716028",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0riy8r",
            "score": -6,
            "text": "Apparently he’s not well versed in simple arithmetic. There weren’t enough ballots to cover the difference. Unless of course Biden won 90%. More silly nonsense by Reddit fools to further a narrative.",
            "title_similarity": "0.62575",
            "sentiment_compound": -0.4403
        },
        {
            "id": "h0rjjik",
            "score": -7,
            "text": "Liberal are smart as a wall.",
            "title_similarity": "0.19603756",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0rtcvv",
            "score": -5,
            "text": "UCSB under investigation for mail in ballot fraud. All the student were not at the dorms or on campus due to covid shutdowns Yet 3000 ballots were sent to the school dorms filled out and mailed in. THATS HOW TRUMP WOULD OF LOST TX.",
            "title_similarity": "0.63706994",
            "sentiment_compound": -0.7804
        },
        {
            "id": "h0s8o3r",
            "score": 5,
            "text": "Trump and his … followers… live in a world that is totally opposite of reality… yet republicans pass 200+ voter suppression laws across the country anyways. \n\nWho’s cheating again? The projection is amazing.",
            "title_similarity": "0.7022966",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0t694n",
            "score": -5,
            "text": "Wow this is such bs lmao. Well he would’ve won Cali if it wasn’t swarming with illegal voters too but we don’t talk about that",
            "title_similarity": "0.7908164",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h0qc65e",
            "score": 5,
            "text": "I mean, if true, that's kinda great news. Boomers dying and gen z coming of age in the next couple years plus a rearranging of democratic tactics creates a pretty winnable situation in the next four years. Yes I know that's why suppressor bills are in place but shit dude, get voters registered with a plan abd you got a good shot at Texas",
            "title_similarity": "0.6727673",
            "sentiment_compound": 0.7686
        },
        {
            "id": "h0qliz0",
            "score": 5,
            "text": "Someone should repost this to r/conservative. So how those fragile babies take the truth. I would but I'm banned for shitting on those idiots",
            "title_similarity": "0.59950453",
            "sentiment_compound": -0.7935
        },
        {
            "id": "h0qylqs",
            "score": 6,
            "text": "This is what Democrats need to realize-- the only thing that matters to Republicans is winning. That's it. They don't care about kids, or schools, or the environment, or jobs, or national security, or crime, or border control, or justice, or peace, or health care, or *anything*. ALL they care about is being in power. They are not honest brokers; they're enemies of the state.",
            "title_similarity": "0.68381655",
            "sentiment_compound": 0.8003
        },
        {
            "id": "h0rq5gc",
            "score": -6,
            "text": "If you aren’t there you shouldn’t get a vote, unless you are in the military",
            "title_similarity": "0.5253941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sjp1y",
            "score": -5,
            "text": "So, I know everyone here is democratic and is going to destroy me for no reason.\n\nWhy on earth did they do mail in ballots?\nI understand the whole covid reason, but shouldn't both parties have to oblige to that?\nBecause it clearly was a stupid and improper way to go about it.\nIt was also clearly helping the democrats because everyone's a democrat now, bc of BLM and shit and so anyone who shouldn't vote but has the opportunity to is going to vote democrat.\n\nIt was an EXTREMELY scuffed election and I wouldn't be surprised if it becomes known as the most scuffed election ever.",
            "title_similarity": "0.69587415",
            "sentiment_compound": -0.6119
        },
        {
            "id": "h0sl04m",
            "score": -6,
            "text": "Who would of thought sending out millions of ballots to incomplete voter rolls, to people no longer alive, to people that moved, could swing an election.   Yeah no kidding.  It’s called sanctioned cheating.",
            "title_similarity": "0.7410817",
            "sentiment_compound": -0.7253
        },
        {
            "id": "h0srh87",
            "score": -4,
            "text": "Ya because they could’ve used fraudulent ballot like they did in Georgia Pennsylvania Arizona and Michigan.",
            "title_similarity": "0.71845824",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0su3kh",
            "score": -6,
            "text": "Yes. Fraudulent mail-in ballots.",
            "title_similarity": "0.48900408",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0qumbb",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qwmu4",
            "score": -21,
            "text": "Sure, Texas has gone red in every election since 1980 and Trump got the exact same % of vote - 52.1 - as he got in 2016. So I’m sure the republican suppression tactics really changed things up and were the only reason Trump won. \n\nThose dastardly republican tactics were so effective Biden only got 5.2M votes, 1.4M more than Hillary in 2016 and 1.7M more than Obama ever did. Totally suppressed the Democrat turnout.",
            "title_similarity": "0.6951678",
            "sentiment_compound": 0.9113
        },
        {
            "id": "h0qynwn",
            "score": -25,
            "text": "Cause Democrats never cheat in elections. /s",
            "title_similarity": "0.42335567",
            "sentiment_compound": 0.357
        },
        {
            "id": "h0qyui6",
            "score": -23,
            "text": "Trump Trump Trump Trump Trump, and in the mean time, not one word about Fauci. Reddit is fucking disgusting.",
            "title_similarity": "0.6644958",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h0qghyd",
            "score": -80,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qq5pa",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0r35vq",
            "score": -9,
            "text": "Every state that there is mail voting democrats are fighting for less and less fraud protections like not requiring an ID. It makes it easy for them to fill out ballots of out of date people on voter rolls. (That's why they fighting cleaning voter rolls so there are only legitimate voters) are fighting to audit any of these mail in votes.",
            "title_similarity": "0.6742018",
            "sentiment_compound": -0.6815
        },
        {
            "id": "h0rbak8",
            "score": -5,
            "text": "Nooo! Evil drumpf man cheated! Biden would never cheat!",
            "title_similarity": "0.4450677",
            "sentiment_compound": -0.7962
        },
        {
            "id": "h0rfqi9",
            "score": -6,
            "text": "good mail in vote is a silly idea with a few exceptions.",
            "title_similarity": "0.46043807",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0rj8bg",
            "score": -5,
            "text": "Yeah...Illegals can’t vote in person...",
            "title_similarity": "0.46561828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0s90qp",
            "score": -6,
            "text": "Y'all still just can't stop talking about him, huh?",
            "title_similarity": "0.21409425",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h0scsld",
            "score": -8,
            "text": "Trump 2024",
            "title_similarity": "0.37317544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0q6mcr",
            "score": 8,
            "text": "Did he just say the quiet part out loud?",
            "title_similarity": "0.24886043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0q90vo",
            "score": 8,
            "text": "\"T**** would have won in Texas if we hadn't actively suppressed our citizens' ability to vote!\"\n\nIsn't that just fucking fantastic.",
            "title_similarity": "0.85856134",
            "sentiment_compound": 0.849
        },
        {
            "id": "h0qt2aj",
            "score": -8,
            "text": "Misleading title btw. Read the article...",
            "title_similarity": "0.29061896",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0qvxep",
            "score": -9,
            "text": "People are still talking about this? It’s over.",
            "title_similarity": "0.17930458",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qwftx",
            "score": -8,
            "text": "Bullshit",
            "title_similarity": "0.10631777",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0qwwz2",
            "score": -7,
            "text": "He's lying and using hyperbole to pump himself up.  This is a non-story.",
            "title_similarity": "0.37466228",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0r3mrp",
            "score": -6,
            "text": "Fake news is so annoying",
            "title_similarity": "0.34259236",
            "sentiment_compound": -0.7644
        },
        {
            "id": "h0rdvvs",
            "score": -9,
            "text": "Regardless of who would have won, mail in ballots shouldn't be a thing. It's just as dangerous as if we made it available online.",
            "title_similarity": "0.66537744",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0rglxv",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0sao39",
            "score": -9,
            "text": "So why do people think biden is doing well as president? Because he says nice things about black and gay people?",
            "title_similarity": "0.4184382",
            "sentiment_compound": 0.644
        },
        {
            "id": "h0sdoob",
            "score": -8,
            "text": "Mail in ballots make as much sense as letting a 5 year old be the Banker in a game of Monopoly..",
            "title_similarity": "0.48002324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qoxgg",
            "score": -33,
            "text": "Maybe.  When republicans wanted to check signatures and registrations they were accused of ‘disruption’ and were thrown out and the windows boarded up in at least 2 locations in ballot harvesting states.",
            "title_similarity": "0.7395152",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0qtbwv",
            "score": -7,
            "text": "Trump, lol",
            "title_similarity": "0.317165",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0qwt8a",
            "score": -9,
            "text": "Making votes more honest is so R@C!zt!!!!",
            "title_similarity": "0.35804105",
            "sentiment_compound": 0.6967
        },
        {
            "id": "h0qhko1",
            "score": -32,
            "text": "I'm sure that making a post on r/politics with 200 comments all with same content will get him into prison, we just have to keep trying hard enough!",
            "title_similarity": "0.4656465",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h0r0m6h",
            "score": -13,
            "text": "There is no auditing any of the mail in votes to know they are legit. Especially is democrats cities where corrupt officials are running the votes. There are many instances of vote drops in democrat controlled cities in 2020 that are statistical impossibilites. In the middle of the night when they said they are for some reason done counting for the night then start back up at 2 am? Pure corruption.",
            "title_similarity": "0.70503736",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0r7p1c",
            "score": -15,
            "text": "Continued distortion: we have to produce ID for everything……we should for Election….dead simple…..if folks are against being ID’d then we know you’re up to no good…\n\nThe fact that this remains a debate is laughable….",
            "title_similarity": "0.6400664",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0r80jr",
            "score": -15,
            "text": "Trump Won",
            "title_similarity": "0.35557264",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0rlx8u",
            "score": -15,
            "text": "Why is it too much to ask someone to physically go to a polling place and cast a ballot?",
            "title_similarity": "0.56778777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0s3hkv",
            "score": -14,
            "text": "Y’all want tighter restrictions on GUNS rather than voting. Voting should be the most secure process in america, but you liberals want 73 background checks and a psych evaluation just to have your amendment rights, but want ballots sent out to everyone, and without verification. When are you gonna realize that your corrupt democrats are just trying to cheat...",
            "title_similarity": "0.74498564",
            "sentiment_compound": -0.274
        },
        {
            "id": "h0s4mig",
            "score": -14,
            "text": "Ahh yes because blocking clear election fraud seems to prevent...fraud...whod've thought?!\n\nYou need an ID to do almost ANYTHING today....you should need one to vote too",
            "title_similarity": "0.7045825",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h0qss4n",
            "score": -13,
            "text": "That should tell you how crooked the mail in votes were in the first place, they seem never to get it .",
            "title_similarity": "0.6291368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r5lu9",
            "score": -13,
            "text": "Trump will never lose TX. The insufferable blue people will never take over the greatest country in the world",
            "title_similarity": "0.5791024",
            "sentiment_compound": 0.7549
        },
        {
            "id": "h0qvi3s",
            "score": -17,
            "text": "thats like saying \"if we could have drugged the other horses ours would have one\" ....MASS mail-in ballots are FRAUD, period. there isn't room for \"well what about this\" no, there isn't a world where mass mail-in ballots aren't ripe with fraud and rigged elections",
            "title_similarity": "0.7565836",
            "sentiment_compound": -0.5065
        },
        {
            "id": "h0r6vwg",
            "score": -17,
            "text": "Shocking for Democrats who want cheaters to win https://home.frankspeech.com/tv/video/mike-lindell-presents-absolutely-9-0",
            "title_similarity": "0.6091259",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0qsc38",
            "score": -18,
            "text": "With how much the lunatics of this sub hate trump it’s amazing to me how much you guys talk about him. The only ones keeping him alive in the world. It’s hilarious",
            "title_similarity": "0.36975276",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0r7shv",
            "score": -17,
            "text": "Because mail in ballots are corrupt",
            "title_similarity": "0.5271822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r6xg5",
            "score": -19,
            "text": "Yes. Because mail in ballots is fraud. Lmfao. Simple equation. And who cares if Trump would’ve lost. I’m talking every election that allows that shit. Or even better yet, having fukn Facebook drop boxes. Fuck you facebook.",
            "title_similarity": "0.7488884",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0quqh2",
            "score": -21,
            "text": "Fauci emails",
            "title_similarity": "0.08013813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qxgdx",
            "score": -24,
            "text": "And Democrats would never win if illegals and dead people couldn’t vote",
            "title_similarity": "0.6951059",
            "sentiment_compound": -0.8112
        },
        {
            "id": "h0qlvie",
            "score": -24,
            "text": "God bless my great state of Texas. 🇺🇸",
            "title_similarity": "0.35935926",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h0qmm5s",
            "score": -27,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qoxik",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qoywr",
            "score": -24,
            "text": "Thankfully there will be less mail in ballots next time around. Although Democrats would love to make it permanent number one voting option.",
            "title_similarity": "0.62779784",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0q52tk",
            "score": 399,
            "text": "AOC did say “Georgia isn’t a red state, it’s a voter suppressed state”\n\nI think this applies here in Texas as well. The reality is that many of today’s “Red” States are more purple than we think. If GA can turn blue then there is hope. The difference is the blatant cheating. In this specific case we have to thank the Texas Supreme Court for ruling against mail voting before the elections. GOP traitors are backed by GOP courts. Stacey Abrams-type of grassroots work is our only hope. Stop the steal indeed.",
            "title_similarity": "0.7478273",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0qp0ub",
            "score": -30,
            "text": "LOL Biden won but here we are in June and trump is still rent free in most heads",
            "title_similarity": "0.4284005",
            "sentiment_compound": 0.8429
        },
        {
            "id": "h0qp1aj",
            "score": -38,
            "text": "No shit? You rig an election with mail-in ballots, you win it with face-to-face voting.",
            "title_similarity": "0.59651595",
            "sentiment_compound": 0.7371
        },
        {
            "id": "h0q2s0t",
            "score": 193,
            "text": "Saying the quiet part out loud yet again.",
            "title_similarity": "0.11522146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0q36co",
            "score": 202,
            "text": "How is this corrupt clown not arrested yet?",
            "title_similarity": "0.4544371",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h0q3n4x",
            "score": 667,
            "text": "So is their argument that mail in ballots make it easier to commit fraud? Despite there being no evidence to support this? Or are they just straight up saying they want to limit the number of people who vote now? And what do Republican voters have to say about all this?",
            "title_similarity": "0.7550081",
            "sentiment_compound": 0.6688
        },
        {
            "id": "h0q2h89",
            "score": 7620,
            "text": "Yeah, when everyone can vote, Republicans lose.",
            "title_similarity": "0.6262078",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0q4vjr",
            "score": 1143,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0q5erj",
            "score": 1585,
            "text": "Meanwhile I can't convince a single Texas Republican that the Texas GOP relies on voter suppression to maintain their majority. They also deny polls that say the majority of Texas identify as Democrat and then cite election results.",
            "title_similarity": "0.8196496",
            "sentiment_compound": -0.4836
        },
        {
            "id": "h0q2hif",
            "score": 10946,
            "text": "I wish statements like this would matter.  Hopefully it gets more people to vote.",
            "title_similarity": "0.45464543",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0q2n74",
            "score": 8132,
            "text": "Statements like this actually do matter when challenging things like Texas voting laws in court.",
            "title_similarity": "0.584762",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0q4k2v",
            "score": 9084,
            "text": "Correct headline: **Texas AG Admits To Partisan Vote Suppression**.",
            "title_similarity": "0.6924559",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0q87vv",
            "score": 511,
            "text": ">\"If we'd lost Harris County—Trump won by 620,000 votes in Texas. Harris County mail-in ballots that they wanted to send out were 2.5 million, **those were all illegal** and we were able to stop every one of them,\" Paxton told former Trump adviser Steve Bannon during the latter's War Room podcast on Friday.\n\nThe irony of Ken Paxton telling this to Steve Bannon might be lost on some, but they are both literally criminals.  \n\n\n* **Ken Paxton**\n   * [Texas Attorney General Ken Paxton was indicted 5 years ago. He still hasn't gone to trial.](https://www.texastribune.org/2019/06/19/ken-paxton-criminal-case-timeline-texas-attorney-general-fraud/)\n   * [No pardon for Texas Attorney General Ken Paxton in last-minute list: A federal investigation which centers on allegations that Paxton committed bribery, abuse of office and other crimes remains in play.](https://www.dallasnews.com/news/politics/2021/01/20/no-pardon-for-texas-attorney-general-kex-paxton-in-last-minute-list/)  \n\r\n   * [Texas Attorney General Is Accused by Top Aides of Abusing His Office: Ken Paxton, one of the most prominent conservative attorneys general, is already under indictment. The allegations of impropriety raised in a recent letter draw intense new scrutiny.](https://www.nytimes.com/2020/10/04/us/paxton-texas-AG-bribery.html)\n* **Steve Bannon**\n   * [Steve Bannon Is Charged With Fraud](https://www.nytimes.com/2020/08/20/nyregion/steve-bannon-arrested-indicted.html)\n   * [Trump pardons Steve Bannon as one of his final acts in office](https://www.cnn.com/2021/01/19/politics/steve-bannon-pardoned-by-trump/index.html)\n   * [Trump campaign CEO Steve Bannon reportedly abused his ex-wife](https://www.vox.com/2016/8/26/12657400/trump-stephen-bannon-domestic-violence)",
            "title_similarity": "0.7794165",
            "sentiment_compound": -0.9536
        },
        {
            "id": "h0q3fd6",
            "score": 55,
            "text": "Well that’s pretty damning.",
            "title_similarity": "0.12480176",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0q3gso",
            "score": 1,
            "text": "So, in other words, they rigged the election. I'm shocked.",
            "title_similarity": "0.58304197",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0q3ocu",
            "score": 44,
            "text": "Ken Paxton can pack tons of corruption into a single term",
            "title_similarity": "0.366757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0q59ia",
            "score": 87,
            "text": "\"We need to cheat even more next time to maintain minority rule!\"",
            "title_similarity": "0.47459745",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h0q5nfh",
            "score": 11,
            "text": "This is the best tl;dr I could make, [original](https://www.newsweek.com/texas-ag-says-trump-wouldve-lost-state-if-it-hadnt-blocked-mail-ballots-applications-being-1597909) reduced by 75%. (I'm a bot)\n*****\n> Texas Attorney General Ken Paxton, a Republican, said former President Donald Trump would have lost in Texas in the 2020 election if his office had not successfully blocked counties from mailing out applications for mail-in ballots to all registered voters.\n\n> &quot;If we&#039;d lost Harris County-Trump won by 620,000 votes in Texas. Harris County mail-in ballots that they wanted to send out were 2.5 million, those were all illegal and we were able to stop every one of them,&quot; Paxton told former Trump adviser Steve Bannon during the latter&#039;s War Room podcast on Friday.\n\n> Democratic lawmakers in the Texas state House blocked what they viewed as a voter suppression bill from moving forward at the end of May. The Democrats walked out of the late evening legislative session on May 30, denying Republican lawmakers quorum to pass the legislation.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/nt5bev/texas_ag_says_trump_wouldve_lost_state_if_it/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~581260 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **vote**^#1 **Texas**^#2 **state**^#3 **ballot**^#4 **election**^#5",
            "title_similarity": "0.88041294",
            "sentiment_compound": -0.7108
        },
        {
            "id": "h0q5pq2",
            "score": 37,
            "text": "Sounds like a confession.",
            "title_similarity": "0.02556407",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0q7nxh",
            "score": 3,
            "text": "Was his implication that this was because of the impact on voting patterns or because of some imagined fraud potential?\n\nThe second one makes him nuts, but only the first one makes him corrupt.",
            "title_similarity": "0.63081914",
            "sentiment_compound": -0.4678
        },
        {
            "id": "h0q7wxz",
            "score": 3,
            "text": "Saying the quiet part out loud.",
            "title_similarity": "0.056622982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0q7zgh",
            "score": 23,
            "text": "Oh, we know that.\nTexas would have turned blue long time ago if it wasn’t for GOP fraud at every level of politics….",
            "title_similarity": "0.7038468",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0q8lb0",
            "score": 8,
            "text": "So, admission they cheated..... well thank God for the partisan court system that can punish him for this. S/",
            "title_similarity": "0.46763694",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0q8zpz",
            "score": 10,
            "text": "So they cheated",
            "title_similarity": "0.23368147",
            "sentiment_compound": -0.5542
        },
        {
            "id": "h0q95xg",
            "score": 25,
            "text": "“A 2020 analysis of U.S. election laws by Northern Illinois University ranked Texas as the most difficult state for voting. While absentee voting is allowed in the state for anyone over the age of 65 without an excuse, the state requires those younger to have a valid reason for requesting an absentee ballot. While Democrats believed the COVID-19 pandemic should be an acceptable excuse for any registered voter to cast their ballots by mail, Paxton and other Texas Republicans disagreed.”",
            "title_similarity": "0.8250854",
            "sentiment_compound": -0.5596
        },
        {
            "id": "h0q9nhf",
            "score": 86,
            "text": "Ken Paxton has been skirting an indictment for years. \n\nDan Patrick asked us to sacrifice our grandparents to COVID-19 and then called himself brave for it.\n\nAnd Greg Abbott is currently threatening Texas Democrats by trying to withhold their pay if they don’t allow the Republicans to ram through a discriminatory voting law. \n\nAs a Texan, I hate our government. And no, I would not recommend living here for a myriad of other reasons.",
            "title_similarity": "0.79132974",
            "sentiment_compound": -0.6497
        },
        {
            "id": "h0qa0oy",
            "score": 1,
            "text": "OMG, if we could flip TX blue, and take their 38 electoral votes in the future, that would be amazing.",
            "title_similarity": "0.5009719",
            "sentiment_compound": 0.7925
        },
        {
            "id": "h0qa1c4",
            "score": 1,
            "text": "Still dont understand how he isn't in jail yet.",
            "title_similarity": "0.3336336",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qad39",
            "score": 1,
            "text": "Get out and vote! They are so afraid, it’s sad, I almost for bad for these people hiding behind gun rights and religion clinging to what power they have at the cost of our great nation.\nActually, I don’t feel bad at all.",
            "title_similarity": "0.6186085",
            "sentiment_compound": -0.8713
        },
        {
            "id": "h0qaoex",
            "score": 1,
            "text": "So, if we allowed people to vote with no limits we’d lose elections.",
            "title_similarity": "0.73821473",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0qatg5",
            "score": 5,
            "text": "How about actual fucking consequences for these “patriots” please!",
            "title_similarity": "0.3752226",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h0qbquc",
            "score": 17,
            "text": "I've yet to see a valid reason why sending a mail-in ballot to every registered voter automatically is problematic.\n\nIt's not like some random guy can steal ballots, fill them out, and send them back to get counted. It wouldn't even pass the security measures they take when counting votes. \n\nRepublicans just know that the easier it is for registered voters to vote, then they will never win another election.",
            "title_similarity": "0.7904364",
            "sentiment_compound": -0.7254
        },
        {
            "id": "h0qbqxm",
            "score": 4,
            "text": "Isn’t that an admission of guilt to interfering in the election process?",
            "title_similarity": "0.6042037",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0qcrdd",
            "score": 8,
            "text": "\"I would have lost if we ...*checks notes* uh...counted all the votes and respected the will of the people\" - this asshole",
            "title_similarity": "0.5639848",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0qd8aa",
            "score": 1,
            "text": "So, if he hadn’t disenfranchised mostly non white voters they would have lost.",
            "title_similarity": "0.7131296",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0qd8n4",
            "score": 1,
            "text": "wow, yeah. thats really fucked up, if not criminal",
            "title_similarity": "0.31582612",
            "sentiment_compound": 0.4737
        },
        {
            "id": "h0qdazz",
            "score": 21,
            "text": "This is blatant election fraud.  They admit to it because they know they're above the law.  There will be more election fraud because these criminals are not being thrown in prison.",
            "title_similarity": "0.6288265",
            "sentiment_compound": -0.9334
        },
        {
            "id": "h0qdktd",
            "score": 3,
            "text": "God I hope we can FINALLY put this dude in jail. He’s so corrupt it’s not even funny.",
            "title_similarity": "0.5179988",
            "sentiment_compound": 0.3806
        },
        {
            "id": "h0qdp7s",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0qdvxy",
            "score": 3,
            "text": "I'm not even American and I could have told you this in November",
            "title_similarity": "0.49941915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qeeq3",
            "score": 4,
            "text": "If your party's strategy is to have as few Americans vote as possible, then your party is unAmerican trash.",
            "title_similarity": "0.6815449",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0qeljl",
            "score": 2,
            "text": "Sounds an awful lot like cheating to me.",
            "title_similarity": "0.36898547",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0qev2k",
            "score": 9,
            "text": "It’s true too. \n\nIf republicans didn’t systematically prevent people from voting Texas wouldn’t be republican. \n\nSo. They keep changing the laws so more republicans can vote and less democrats. \n\nhttps://www.nytimes.com/2020/06/26/us/supreme-court-texas-vote-by-mail.html",
            "title_similarity": "0.7736131",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0qf1qe",
            "score": 4,
            "text": "Sounds like Texas is about ready to flip, then.",
            "title_similarity": "0.48017976",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0qf535",
            "score": 7,
            "text": "So basically what he’s saying is “if we hadn’t stopped people from voting we would have lost”",
            "title_similarity": "0.73118675",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0qf64l",
            "score": 1,
            "text": "What does he mean that they would be \"illegal\"?",
            "title_similarity": "0.36619446",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0qfkqd",
            "score": 2,
            "text": "More people voted for Biden in Texas than any other state outside of California and New York. Biden got zeros from Texas.",
            "title_similarity": "0.5983745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qfqcb",
            "score": 4,
            "text": "Voter suppression works!",
            "title_similarity": "0.37537584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qfvs8",
            "score": 2,
            "text": "Oh",
            "title_similarity": "-0.13487184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qfx4k",
            "score": 3,
            "text": "This MFer knows nothing BUT to be a criminal.",
            "title_similarity": "0.3795291",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0qfy51",
            "score": 5,
            "text": "Republicans, time and time again, have made it very clear that they are not interested in maintaining an actual democracy. Oust these clowns.",
            "title_similarity": "0.62940395",
            "sentiment_compound": 0.1618
        },
        {
            "id": "h0qg29f",
            "score": 2,
            "text": "Can't wait for Trump to get arrested. Finally prove the world he is dead broke. Though I doubt his followers will believe it, they'll probably blame John F. Kennedy for framing him.",
            "title_similarity": "0.74801695",
            "sentiment_compound": -0.9337
        },
        {
            "id": "h0qg34b",
            "score": 2,
            "text": "More Republican fraud, then?",
            "title_similarity": "0.53405166",
            "sentiment_compound": -0.6222
        },
        {
            "id": "h0qgge6",
            "score": 2,
            "text": "That’s what you call “democracy”\n\nAbsolutely astonishing",
            "title_similarity": "0.23219281",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qgi06",
            "score": 1,
            "text": "But just like Biden, he won. Move on.",
            "title_similarity": "0.19771373",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h0qgl7a",
            "score": 1,
            "text": "again they have nothing but fuckery, the people dont want the gop again and again, why would they?",
            "title_similarity": "0.51345015",
            "sentiment_compound": -0.0857
        },
        {
            "id": "h0qgx9g",
            "score": 14,
            "text": "Brazenly admitting Texas acted officially to corrupt the vote.",
            "title_similarity": "0.6420725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qhj44",
            "score": 1,
            "text": "> \"We would've been one of those battleground states that they were counting votes in Harris County for three days and Donald Trump would've lost the election.\"\n\nHE ***DID.***",
            "title_similarity": "0.8026888",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0qhjfh",
            "score": 11,
            "text": "A few take-aways from this idiot AG:\n\n1. Trump *did* lose the election. The guy doesn't seem to realize that yet.\n2. He admits that by stopping mail-in applications, more people could have voted and it could have flipped Texas blue.\n3. Does the GQP not believe in the quiet part anymore? By this point, I really suspect they collectively just don't feel like lying about all the shit plays and illegal deeds they commit to say in power.",
            "title_similarity": "0.8484719",
            "sentiment_compound": -0.0521
        },
        {
            "id": "h0qhm6w",
            "score": 3,
            "text": "Just remember, in 2016 Trump didn't even win the popular vote (though his cult followers would say that's fake news)",
            "title_similarity": "0.7827917",
            "sentiment_compound": -0.5223
        },
        {
            "id": "h0qhojb",
            "score": 1,
            "text": "First off, no it wouldn’t. Second, way to give away your objectives guys.",
            "title_similarity": "0.3516839",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0qhw4x",
            "score": 5,
            "text": "So the people who blocked the mail in ballot applications should be arrested for obstructing the right to vote in a Presidential election. A Federal offence. Yes or no?",
            "title_similarity": "0.71543795",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0qhyqd",
            "score": 2,
            "text": "How long has he been under investigation????",
            "title_similarity": "0.17161784",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qi9v2",
            "score": 5,
            "text": " The fact that he purposely suppressed the will of the people and is proud of it is a scary chapter in America's long fight against authoritarianism. \n\nRepublicans are now applauding rigged elections.",
            "title_similarity": "0.6980215",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0qijp9",
            "score": 1,
            "text": "Republicans can’t win fair elections and they know it. They can’t win their arguments with facts and they know it. They can’t prove their stupid conspiracy theories and they know it. They no longer represent mainstream voters and they know it. They don’t care about truth, decency, democracy or ordinary Americans and we know it. They remain the party of hypocrisy, racism, cruelty and childish stupidity and the rest of the world knows it.",
            "title_similarity": "0.7228488",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h0qijyt",
            "score": 1,
            "text": "Fix our image or fix the system? Pathetic GOP, just pathetic.",
            "title_similarity": "0.42437834",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h0qip05",
            "score": 1,
            "text": "How are these corrupt totalitarian mother fuckers not in jail?",
            "title_similarity": "0.5869725",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h0qiyr6",
            "score": 1,
            "text": "This fucking criminal shouldn’t even be in a position of power.\n\nHim and governor HotWheels are two of the worst things to happen to this state.",
            "title_similarity": "0.58668184",
            "sentiment_compound": -0.8313
        },
        {
            "id": "h0qj3mu",
            "score": 2,
            "text": "So now Republicans just flat out admit that as voter turnout goes up their chances of winning go down.",
            "title_similarity": "0.66444397",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0qja5d",
            "score": 3,
            "text": "Well congratulations KP on being a traitor to democracy as well as being under felony indictment. Worst AG in history, would be in prison by now in states that aren’t run by white nationalist Christo-fascists.",
            "title_similarity": "0.6517587",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0qjbwj",
            "score": 1,
            "text": "Lot of messes left behind in the past four years that must be acknowledged, but tackling voter suppression has to be a high priority. Right-wing states have already put in work to complicate elections, and it's only going to continue from here on out.",
            "title_similarity": "0.6572299",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qjc3z",
            "score": 4,
            "text": "Seriously, my fucking god, was it always this bad and there just wasn't information being shared in the 245 years of our existence?  Like, how on Earth is a sentence like this said, straight faced, to a member of the media and charges not immediately drawn up on these people?  We prevented people from voting in a legally acceptable fashion that we simply don't like and know will go against us and that allowed us to win.  And for that matter, we called it out as being illegal despite the fact that no law exists that makes it illegal and THE FUCKER THAT WE WANTED TO ELECT LITERALLY VOTES FOR THE PRESIDENCY HIMSELF IN THIS SAME MAIL IN MANNER.",
            "title_similarity": "0.772128",
            "sentiment_compound": -0.8903
        },
        {
            "id": "h0qjcvo",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0qjful",
            "score": 2,
            "text": "Wait, that guy who had like his entire staff whistle blow him as corrupt as fuck?\n\nWhy isn't he in jail yet?",
            "title_similarity": "0.49209166",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h0qjfwv",
            "score": 5,
            "text": "Shouldnt the title be \"texas AG admits tampering with election\"",
            "title_similarity": "0.74135935",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0qjjwy",
            "score": 2,
            "text": "Unfortunately, that's a feature, not a bug.",
            "title_similarity": "0.05508749",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0qjkju",
            "score": 2,
            "text": "This is exactly what happened to me, those fuckers.",
            "title_similarity": "0.22862251",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0qjkqt",
            "score": 2,
            "text": "Very legal, very cool!",
            "title_similarity": "0.061986014",
            "sentiment_compound": 0.6049
        },
        {
            "id": "h0qjtk7",
            "score": 5,
            "text": "Yea no shit, why do you think states controlled by Republicans are making it harder to vote. Once texas goes blue, Republicans are going to have a hard time winning.",
            "title_similarity": "0.7542998",
            "sentiment_compound": 0.7117
        },
        {
            "id": "h0qju5y",
            "score": 2,
            "text": "This statement demands federal investigation.",
            "title_similarity": "0.3114112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qjxay",
            "score": 1,
            "text": "For all that Republicans go ON AND ON about how it's a Republic, not a democracy, they simultaneously seem to have a very simple position on the matter: \"Fuck the Constitution and the representative republic it established\".",
            "title_similarity": "0.61343026",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0qjzco",
            "score": 1,
            "text": "Amazes me ceaselessly how openly they continue to admit this. And depressing and scary as well.",
            "title_similarity": "0.25131232",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0qk2n5",
            "score": 1,
            "text": "This is why they're desperate to crush voting rights.",
            "title_similarity": "0.54363084",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0qk4t2",
            "score": 1,
            "text": "How in the hell is this even an angle to take. Publicly admitting you lost an election unless you make alterations to it.",
            "title_similarity": "0.7280561",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h0qk70d",
            "score": 1,
            "text": "What's so crazy is that these were just APPLICATIONS.  Not like they were sending out actual ballots, which in itself should even be that divisive...",
            "title_similarity": "0.5908913",
            "sentiment_compound": -0.5863
        },
        {
            "id": "h0qk90w",
            "score": 1,
            "text": "Saying the quiet part out loud. When everyone can vote republicans will always lose. Hence their desperation. \n\nThey could, you know, work on some decent policies and platforms that could help everyday Americans but no. That would actually require doing real work.",
            "title_similarity": "0.7269925",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0qkcir",
            "score": 5,
            "text": "“Beware the evil libs who want every single person to vote easily and conveniently! If it weren’t for my valiant efforts to block those who would vote liberal from voting conveniently, they would have dared to vote! I saved our democracy from democracy!!!!”\n\n-Texas AG and all Republicans probably\n\nEdit: sorry, my bad. I forgot that a lot of republicans would change that last line to “I saved our party from democracy!”",
            "title_similarity": "0.7715826",
            "sentiment_compound": -0.5053
        },
        {
            "id": "h0qke8k",
            "score": 2,
            "text": "So voting fraud was committed in Texas? How many people didn’t get a chance to vote because of this?",
            "title_similarity": "0.7384889",
            "sentiment_compound": -0.3266
        },
        {
            "id": "h0qkex3",
            "score": 1,
            "text": "Funny how George P Bush is licking Trump’s asshole in an effort to unseat this idiot.",
            "title_similarity": "0.61376905",
            "sentiment_compound": -0.2441
        },
        {
            "id": "h0qkheb",
            "score": 1,
            "text": "Has anyone asked Joe Manchin whether this is \"bipartisan\" enough for him?",
            "title_similarity": "0.49721074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qki9h",
            "score": 1,
            "text": "Now...how in the hell can he say something like that with absolutely NO PROOF...and why would he? Does he understand how BAD that makes the Republican Brand look?",
            "title_similarity": "0.63912874",
            "sentiment_compound": -0.8983
        },
        {
            "id": "h0qkieo",
            "score": 1,
            "text": "He must be so proud of himself then.",
            "title_similarity": "0.11800718",
            "sentiment_compound": 0.6113
        },
        {
            "id": "h0qkjek",
            "score": 1,
            "text": "Meanwhile here in Arizona this scam audit continues. I have some nameless unqualified monkey handling my ballot!",
            "title_similarity": "0.49364156",
            "sentiment_compound": -0.6875
        },
        {
            "id": "h0qkkae",
            "score": 1,
            "text": "So stopping people from their constitutional right to vote is ok??  Typical republicans, lie cheat steal, any way to win.  Shame on texasss.",
            "title_similarity": "0.79912794",
            "sentiment_compound": -0.7752
        },
        {
            "id": "h0qkl5a",
            "score": 1,
            "text": "Infuriating that these guys can just admit to this stuff and get away with it.",
            "title_similarity": "0.43143994",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0qklq2",
            "score": 2,
            "text": "We’re trying, y’all. We’re really trying to get rid of these incompetent fucksticks",
            "title_similarity": "0.42448187",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0qkm5w",
            "score": 2,
            "text": "What does it mean when your party requires treachery to win?",
            "title_similarity": "0.48295897",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0qkmnl",
            "score": 1,
            "text": "Texas AG Ken Paxton is a criminal who is just waiting for his court date to be set.",
            "title_similarity": "0.5292504",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0qkplr",
            "score": 4,
            "text": "Blue America is being held captive.",
            "title_similarity": "0.16149771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qkrx6",
            "score": 1,
            "text": "interesting, hes admitting to it",
            "title_similarity": "0.018865954",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0qkw5d",
            "score": 1,
            "text": "So much for a democratic country! Votes dont count anyways.",
            "title_similarity": "0.55734843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ql1ga",
            "score": 2,
            "text": "This speaks volumes.",
            "title_similarity": "-0.07907805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ql5k6",
            "score": 1,
            "text": "Hey Ken, you're a little late to try and get that pardon.",
            "title_similarity": "0.42417365",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0qlf8n",
            "score": 1,
            "text": "As someone who is not from the US I need to ask, how is this legal? He's pretty much admitting he stopped applications for mail in voting knowing if they had been allowed Trump would lose. How is that not straight up vote manipulation or illegal? I don't understand US voting laws at all with this kind of shit",
            "title_similarity": "0.819533",
            "sentiment_compound": -0.8884
        },
        {
            "id": "h0qlhal",
            "score": 2,
            "text": "If more people participated as poll workers during elections, there would be much less distrust for the system.",
            "title_similarity": "0.56097645",
            "sentiment_compound": -0.3626
        },
        {
            "id": "h0qliao",
            "score": 2,
            "text": "Oh that's ... That's nice.",
            "title_similarity": "-0.11823974",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0qljpv",
            "score": 2,
            "text": "Honestly fuck this guy - guarantee he feels perfectly fine with this grossly anti democratic behavior, genuine scum of the earth",
            "title_similarity": "0.39025962",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0qlmlo",
            "score": 5,
            "text": "Finally, the evidence of voter fraud we've been waiting for !",
            "title_similarity": "0.5640988",
            "sentiment_compound": -0.6239
        },
        {
            "id": "h0qlnb4",
            "score": 2,
            "text": "So essentially voter suppression. Got it.",
            "title_similarity": "0.42357975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qlo1o",
            "score": 4,
            "text": "It’s actually wild that it’s been virtually impossible for Republicans to win the popular vote for an entire GENERATION....and yet we are still pretending that these tactics aren’t about voter suppression..",
            "title_similarity": "0.70973563",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0qlouw",
            "score": 3,
            "text": "GOP:  We can't win on ideas.  We only win when we cheat and suppress the vote.  \n\n&#x200B;\n\nGot it.  I hope people are listening.  The only way to stop this is to vote the next election no matter what.\n\n&#x200B;\n\nEdit: Forgot a word",
            "title_similarity": "0.7361591",
            "sentiment_compound": -0.1645
        },
        {
            "id": "h0qlp0b",
            "score": 2,
            "text": "So what? What a bunch of gutless turds",
            "title_similarity": "0.22558644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qlvt4",
            "score": 5,
            "text": "“If it were up to the voters, Trump would’ve lost Texas”.",
            "title_similarity": "0.9016095",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0qlxl8",
            "score": 2,
            "text": "Nothing will happen. \n\nDemocrats will drag their feet. \n\nConcerned citizens will make some news. \n\nRepublicans will shrug this off as another criminal ploy. \n\nAG is White so no criminal prosecution...",
            "title_similarity": "0.6226958",
            "sentiment_compound": 0.2529
        },
        {
            "id": "h0qlxns",
            "score": 1,
            "text": "You just wait... it'll shift on you no matter what you do.",
            "title_similarity": "0.20967579",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h0qlz35",
            "score": 1,
            "text": "What about other elections?  Senate and Representatives?  Even local offices.",
            "title_similarity": "0.38101974",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qlz5k",
            "score": 3,
            "text": "I mean he tried to shut down the post office… How in the world did he hate Americans enough that he told them to hate the post office for chrissake",
            "title_similarity": "0.6104417",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h0qm3ky",
            "score": 1,
            "text": "Would've? That's exactly what happened to quadriga.",
            "title_similarity": "0.15840355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qm51y",
            "score": 3,
            "text": "Republicans did massive voter suppression and Trump still lost. They aren't going to stop, they're going to do more.",
            "title_similarity": "0.76014626",
            "sentiment_compound": -0.1058
        },
        {
            "id": "h0qm526",
            "score": 3,
            "text": "Speaking as a Texan, fuck indicted felon Ken Paxton. If there’s one person less popular than Trump and Cruz in Texas, it’s Paxton.",
            "title_similarity": "0.692271",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h0qm55j",
            "score": 3,
            "text": "Wow. So that's where we are? Where the GOP can extol their election fraud?",
            "title_similarity": "0.58402044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qm5c7",
            "score": 2,
            "text": "And he calls himself an attorney?",
            "title_similarity": "0.18909366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qmb1s",
            "score": 5,
            "text": "What’s nuts to me is why are they All In on a politician that they know can’t win without cheating? Why THIS man?",
            "title_similarity": "0.6434514",
            "sentiment_compound": 0.6988
        },
        {
            "id": "h0qmb2f",
            "score": 4,
            "text": "I'm pretty sure that's voter suppression.",
            "title_similarity": "0.49999446",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0qmmug",
            "score": 2,
            "text": "Outright calls a citizens vote illegal, get fucked",
            "title_similarity": "0.5437219",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h0qmx4p",
            "score": 2,
            "text": "When voting is easy it's illegal?!?",
            "title_similarity": "0.48862767",
            "sentiment_compound": -0.3296
        },
        {
            "id": "h0qmxnm",
            "score": 3,
            "text": "How is this not obstruction of justice, treason, and election tampering?!",
            "title_similarity": "0.53676665",
            "sentiment_compound": -0.7156
        },
        {
            "id": "h0qmyb2",
            "score": 3,
            "text": "Sounds like election tampering.",
            "title_similarity": "0.47672722",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0qn0a4",
            "score": 8,
            "text": "In other words, he did lose Texas but due to voter suppression democracy was subverted.",
            "title_similarity": "0.7568154",
            "sentiment_compound": -0.2144
        },
        {
            "id": "h0qn3l5",
            "score": 3,
            "text": "If trump didn’t cheat and try to rig the game in his favor, it would have been the worst defeat a presidential nominee has ever faced, on top of it already being that. \n\nIt was already a landslide victory for Biden, but with out the cheating..man a lot of hearts would have broke 💕Fuck that clown. He did such a bad job it made someone like me who swore off politics and said I would never vote in my life actually vote. It was that important that he got the fuck out. \n\nDude lost Arizona. What A disgrace. I know me personally, I will never vote republican the rest of my life. Not that it matters. I’m getting the fuck out of this shit whole 3 world country of America. \n\nServed in the military, was going to uni to serve in the cia, but after that insurrection fuck America. I’m not doing shit for you clowns. Don’t deserve my services. Population is as dumb as chinas and north koreas put together. Docile, cult fucks. My life and any member of my team is worth more than the 50% of America that voted for that clown.",
            "title_similarity": "0.793879",
            "sentiment_compound": -0.9877
        },
        {
            "id": "h0qn53l",
            "score": 2,
            "text": "Oh, so there was voter fraud...",
            "title_similarity": "0.526475",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0qn6sq",
            "score": 3,
            "text": "Killer virus rampaging any public gathering?  I know, lets make that not a valid reason to mail in votes.\n\n/Thats absolutely evil and wrong.",
            "title_similarity": "0.5757923",
            "sentiment_compound": -0.924
        },
        {
            "id": "h0qn8lo",
            "score": 2,
            "text": "Does anybody know of a historical example of a democracy becoming this openly corrupt & having this much anti-democratic sentiment among the population recovering without any kind of catastrophe before the recovery?",
            "title_similarity": "0.6545116",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h0qn9ut",
            "score": 13,
            "text": "Isn't that an admission of guilt?",
            "title_similarity": "0.23502928",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0qng18",
            "score": 5,
            "text": "So. Let me get this right..\n\nIf everyone who wanted to vote had a chance to vote.\n\nTexas would have voted against Trump?\n\n\nI might not be an American. But that does not sound like equality for everyone. And even being thousands of miles from USA I can almost feel the rotation of the founding fathers of America like a turbine right now.",
            "title_similarity": "0.85826665",
            "sentiment_compound": 0.2698
        },
        {
            "id": "h0qnknw",
            "score": 6,
            "text": "How do people, regardless of party, not see this as a red flag. If I voted for someone and they said they only won because not all the votes were counted I would be pissed. That’s not democracy, I want\nA true democracy, not a democracy only in my favor. How are we all not on the same page about this? It seems like such an obvious thing, yet somehow, in America, the land of the “free” this is a controversial topic.",
            "title_similarity": "0.74867",
            "sentiment_compound": 0.8008
        },
        {
            "id": "h0qnurn",
            "score": 3,
            "text": "Sounds like another commie.",
            "title_similarity": "0.084937885",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0qo6ep",
            "score": 1,
            "text": "Not just saying the quiet part out loud, he ran all the way up UT Main Building tower and shouted it.",
            "title_similarity": "0.32834536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qo6ye",
            "score": 5,
            "text": "I requested my ballot as soon as I could, received the formal request in the mail in August, sent it registered from Australia to Galveston and it got back to them in August. I waited until the middle of September to check on why I hadn’t received it yet and found out I had become unregistered after requesting it because my address had changed since 2016. (I had notified them of this when I voted in 2018.) \n\nDidn’t receive my ballot until after the election and thus didn’t get to vote in 2020. I find it very hard to believe it was a clerical error as I’m registered as a Democrat.",
            "title_similarity": "0.6747985",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h0qo71x",
            "score": 1,
            "text": "I pledge to do whatever I can to get people to vote - vote these corrupt pawns out - no matter how labyrinthine and difficult they try to make that process. Shame on them for subverting democracy under the guise of patriotism. They plan and we will plan, and vote!",
            "title_similarity": "0.61045897",
            "sentiment_compound": -0.7154
        },
        {
            "id": "h0qo7t8",
            "score": 1,
            "text": "Make voting easier, the Regressive Party loses. They know that, and that's why we have to keep fighting to make voting easier and keep resisting their attempts to make it harder.",
            "title_similarity": "0.57255095",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0qo8nj",
            "score": 6,
            "text": "Where are all the Anti Maskers talking about Freedom and rights??? This is a blatant abuse by a government official.",
            "title_similarity": "0.51347864",
            "sentiment_compound": -0.4291
        },
        {
            "id": "h0qo9f6",
            "score": 3,
            "text": "Well this explains why I never received it 😂😂😂. Just kidding. I knew which is why I walked my happy ass to the polls. Get these @ssholes out of office.",
            "title_similarity": "0.59435153",
            "sentiment_compound": 0.886
        },
        {
            "id": "h0qochx",
            "score": 2,
            "text": "So they’re admitting to fraud basically",
            "title_similarity": "0.3632989",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0qoe14",
            "score": 4,
            "text": "Saying the quiet part out loud. What a moron.",
            "title_similarity": "0.24218826",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0qoes4",
            "score": 2,
            "text": "More GOP voter fraud comes to light. Sigh.",
            "title_similarity": "0.56871414",
            "sentiment_compound": -0.6077
        },
        {
            "id": "h0qogip",
            "score": 3,
            "text": "why is trump the hill these people want to die on?  you couldn't have picked a bigger piece of shit to back...",
            "title_similarity": "0.6780598",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0qoizu",
            "score": 1,
            "text": "Terrorist attack. Really.",
            "title_similarity": "0.36733815",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h0qokea",
            "score": 2,
            "text": "The AG that's under indictment?",
            "title_similarity": "0.30627882",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qomg2",
            "score": 3,
            "text": "Maybe the GOP should conduct an audit to get to the truth since they care so much about election integrity, and definitely haven’t turned into a cult for the proverbial golde.. I mean orange calf.",
            "title_similarity": "0.6894942",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h0qoo0z",
            "score": 3,
            "text": "So republicans have lost texas",
            "title_similarity": "0.61244845",
            "sentiment_compound": -0.3744
        },
        {
            "id": "h0qopsi",
            "score": 3,
            "text": "It just shows how dirty the Republican Party really is trying to turn our country and this site into a non-democratic so let's kill all these Democrats minorities and in that way it could all be white and Rich before people need to go to",
            "title_similarity": "0.70771164",
            "sentiment_compound": -0.3774
        },
        {
            "id": "h0qoroh",
            "score": 7,
            "text": "“Trump would’ve lost if we let more people vote”",
            "title_similarity": "0.8216746",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0qosoj",
            "score": 1,
            "text": "This is high treason.",
            "title_similarity": "0.2664365",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0qoss1",
            "score": 1,
            "text": "Red Flag",
            "title_similarity": "0.17907599",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qov6h",
            "score": 1,
            "text": "Nice.",
            "title_similarity": "-0.11844972",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0qovvo",
            "score": 5,
            "text": "I don't mean to be that \"get off my lawn\" person, but i remember when shit like this actually affected someone's career.",
            "title_similarity": "0.5519614",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h0qoweg",
            "score": 13,
            "text": "The fact that Republicans can whine about \"the steal\" and at the same time brag about their own attempts to steal the election tells you a lot about the intelligence of their supporters.",
            "title_similarity": "0.61109906",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0qoxbj",
            "score": 4,
            "text": "So, uh, is anybody gonna arrest that guy then?",
            "title_similarity": "0.4180392",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0qp5k4",
            "score": 5,
            "text": "How is this guy still outside of a jail cell?",
            "title_similarity": "0.19218874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qp5o9",
            "score": 2,
            "text": "Ken Paxton looks and acts like a literal Bond villain. We don’t care what your opinion is.",
            "title_similarity": "0.47653198",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0qp8d9",
            "score": 8,
            "text": "Imagine being proud that you blocked the will of the people.",
            "title_similarity": "0.41255206",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0qpbz0",
            "score": 5,
            "text": "I’m convinced we’re Democrat state that is disenfranchised. Our government spends so much to market us as deeply Republican.",
            "title_similarity": "0.641438",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0qpek7",
            "score": 5,
            "text": "Republican’ts: we can only win if we prevent people from voting. No platform, no vision, just suppressing democracy every way we can!",
            "title_similarity": "0.6501365",
            "sentiment_compound": 0.4836
        },
        {
            "id": "h0qpeud",
            "score": 2,
            "text": "You know, it’s really a shame. I, like a lot of people when they were younger, used to always dream of saving their school from terrorists/russians/whatever either with super powers or John Wick style stuff. Now if I have a dream like that? It’s about getting these politicians to actually work for the people.",
            "title_similarity": "0.6235543",
            "sentiment_compound": 0.8187
        },
        {
            "id": "h0qphrx",
            "score": 2,
            "text": "Yo, he *did* lose hahaha",
            "title_similarity": "0.2946955",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0qphta",
            "score": 2,
            "text": "Holy shit so I go to college out of state and requested my ballot months before the election. Months. It arrived probably three days before Election Day and I could only hope my vote actually made it.",
            "title_similarity": "0.5699435",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0qpi41",
            "score": 2,
            "text": "Whether you are or are not a resident of Texas, what happens in Texas doesn’t stay in Texas.  Go to Actblue - directory - texas and start donating!  Please!",
            "title_similarity": "0.6663424",
            "sentiment_compound": 0.4374
        },
        {
            "id": "h0qpox8",
            "score": 5,
            "text": "Which is why Dejoy worked so hard to sabotage the post office ahead of the election. Trump tried every trick in the book and still lossed despite incumbents usually having the advantage in presidential elections. Pathetic. Lol",
            "title_similarity": "0.76336306",
            "sentiment_compound": -0.6838
        },
        {
            "id": "h0qppqx",
            "score": 4,
            "text": "Yeah no shit... and the GOP wouldn’t have even gotten Trump in the first time without gerrymandering and Russian interference... but hey cheating is sort of their gig.",
            "title_similarity": "0.736328",
            "sentiment_compound": -0.5168
        },
        {
            "id": "h0qptcz",
            "score": 5,
            "text": "It's a stupid thing to say, because it gives the game away. It shows that the GOP voting restrictions are not about maintaining the integrity of the elections, but about changing the outcomes of elections.\n\nThat said, I think Trump would definitely have won Texas no matter what. He won by 600k votes, which was about 6% of the total cast. it wasn't particularly close.",
            "title_similarity": "0.79908943",
            "sentiment_compound": 0.9342
        },
        {
            "id": "h0qpwae",
            "score": 2,
            "text": "Lost state bc people who could vote had the ability to vote..hmm talk about freedom",
            "title_similarity": "0.53852224",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0qpwor",
            "score": 6,
            "text": "This is proof that the Texas GQP are scared. The lesson here is VOTE, VOTE, VOTE!",
            "title_similarity": "0.5560261",
            "sentiment_compound": -0.4926
        },
        {
            "id": "h0qpxmf",
            "score": 4,
            "text": "Trump sucks",
            "title_similarity": "0.41073644",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0qpzrl",
            "score": 2,
            "text": "So..... You admit that your state would have been blue.... Hmmm tine for texans to rise up.",
            "title_similarity": "0.3684974",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0qq250",
            "score": 1,
            "text": "Completely afraid of a fair competition",
            "title_similarity": "0.44177422",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0qq5s3",
            "score": 1,
            "text": "Cheaters gotta cheat",
            "title_similarity": "0.34968656",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h0qq8aq",
            "score": 1,
            "text": "Tell me you cheat to win, without telling me you cheat to win.",
            "title_similarity": "0.5273415",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0qq9fs",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.11722244"
        },
        {
            "id": "h0qqb4x",
            "score": 8,
            "text": "Imagine genuinely thinking a mail in vote should count less or means less than an in person vote... sounds an awful lot like a person who believes in a human being being counted as 3/5ths of a person too doesn’t it?",
            "title_similarity": "0.49924117",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0qqb7e",
            "score": 5,
            "text": "Texas is corrupt. I had to register a bunch of times to vote until I showed up as registered. They somehow magically lost my in-person registration 2 times.",
            "title_similarity": "0.71639466",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0qqbx0",
            "score": 2,
            "text": "Oh for crap sake, don't tell all the repubs before the 2022 elections or they'll pull the same stunt next year for all the states.",
            "title_similarity": "0.7213248",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0qqf9r",
            "score": 2,
            "text": "Fuck Ken Paxton, Gov Abbott, and Dan Patrick with a giant spiked mickey mouse shaped stainless steel dildo",
            "title_similarity": "0.3925079",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0qqgz8",
            "score": 3,
            "text": "So when can we actually get the DOJ to do its job and start removing some of these corrupt politicians?",
            "title_similarity": "0.6077914",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qqk3w",
            "score": 1,
            "text": "If you only can win couse vote suppression there is something wrong with the goverment. It is also a major threat to the democrasy and legitimizy of said rulers. Quite funny how the Republicans would start lose more or less every election would only the elector system be removed/changed and mail in voting being accepted everywhere.",
            "title_similarity": "0.78763103",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0qqkmr",
            "score": 3,
            "text": "Just a friendly reminder to non-Texans: We have an actual fucking criminal as our AG.",
            "title_similarity": "0.45726636",
            "sentiment_compound": -0.1263
        },
        {
            "id": "h0qqlyu",
            "score": 3,
            "text": "I can't believe this mother fucker still hasnt stood trial. 5 fucking years indicted for felonies. There is no law saying elected officials can't be tried. Even with the President, it was only a memo, never challenged in a court of law.",
            "title_similarity": "0.5893861",
            "sentiment_compound": -0.8659
        },
        {
            "id": "h0qqng4",
            "score": 2,
            "text": "\"If we had been allowed to cheat, we wouldn't have lost.\"",
            "title_similarity": "0.52636826",
            "sentiment_compound": -0.2589
        },
        {
            "id": "h0qqnjt",
            "score": 5,
            "text": "In other words, he would've lost if they let all eligible voters vote.",
            "title_similarity": "0.74826515",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0qqp04",
            "score": 1,
            "text": "Wait, isn't this the definition of Facism?",
            "title_similarity": "0.10573956",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qqu0w",
            "score": 2,
            "text": "I’m angry this asshat is stealing oxygen from us",
            "title_similarity": "0.42835143",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h0qr181",
            "score": 3,
            "text": "So you committed election fraud and this is your qualification to be AG? Da fuk?",
            "title_similarity": "0.6042494",
            "sentiment_compound": -0.4179
        },
        {
            "id": "h0qr1et",
            "score": 4,
            "text": "People need to vote even harder in 2024 than they did in 2020. If it's even remotely close the Republicans will start a civil war.",
            "title_similarity": "0.7270763",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0qr1i8",
            "score": 1,
            "text": " Politicians are snakes.",
            "title_similarity": "0.33486888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qr4ja",
            "score": 1,
            "text": "I hate living here....",
            "title_similarity": "0.24386412",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0qr6uc",
            "score": 13,
            "text": "I've been telling people for 3 years that Texas is actually a blue state. They just keep passing so many voter restrictions that it's bottle necking progress.",
            "title_similarity": "0.5596971",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0qr7di",
            "score": 3,
            "text": "Jail.",
            "title_similarity": "0.07284283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qrb62",
            "score": 5,
            "text": "Literally admitting voter suppression is only way they win.",
            "title_similarity": "0.589658",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0qrc2s",
            "score": 3,
            "text": "This should get every anti-Trump person off their rest ends and vote every election that happens. Make sure all these people are voted out of office!",
            "title_similarity": "0.6234373",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h0qrg3z",
            "score": 2,
            "text": "America land of the free lmao",
            "title_similarity": "0.21072772",
            "sentiment_compound": 0.802
        },
        {
            "id": "h0qrmso",
            "score": 5,
            "text": "I was skeptical until I looked up the most recent Texas political demographics.  39% Republican/Republican leaning.  40% Democrat/Democrat leaning.\n\nIt could be possible.  That’s surprising.",
            "title_similarity": "0.6471477",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0qrplt",
            "score": 3,
            "text": "How dumb is that guy? Why would he say that even if it’s the truth? Use your fucking weasel words or shut up! There’s no “plausible deniability” now. Man I used to live in Texas and I should have stayed because being stupid is amply rewarded by failing as hard as you can upward as fast as the velocity of money will take you. I’m also dumb as center pivot irrigation in a fucking desert. Coulda been a senator there at the rate I fail at making good decisions.",
            "title_similarity": "0.7446811",
            "sentiment_compound": -0.9127
        },
        {
            "id": "h0qrppp",
            "score": 2,
            "text": "What a piece of shit. At least that confirms that Texas is moving in a purple direction. Good for them.",
            "title_similarity": "0.3122791",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0qrqmc",
            "score": 2,
            "text": "So what this tells us is that Texans overwhelmingly don't like Republican politics or policies. It also tells us that the GOP knows this and they don't care what the Texans think.",
            "title_similarity": "0.6756973",
            "sentiment_compound": -0.6414
        },
        {
            "id": "h0qrrot",
            "score": 2,
            "text": "I feel like this would qualify as election tampering. He's openly admitting he used his powers to influence the election.",
            "title_similarity": "0.6135061",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0qru6t",
            "score": 1,
            "text": "What the fuck! Just when Texas had a few uplifting headlines this gets released! Cries in Texan.",
            "title_similarity": "0.551183",
            "sentiment_compound": -0.7772
        },
        {
            "id": "h0qrupw",
            "score": 2,
            "text": "Jesus H. Christ. So, he’s admitting to suppressing the vote?",
            "title_similarity": "0.52006674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qrxbd",
            "score": 2,
            "text": "AG already indicted for securities fraud commits more crimes. i’m shocked... openly admitting voter suppression",
            "title_similarity": "0.6080614",
            "sentiment_compound": -0.6204
        },
        {
            "id": "h0qryol",
            "score": 1,
            "text": "Overturned the will of the people.",
            "title_similarity": "0.3546092",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qrze4",
            "score": 2,
            "text": "So basically we have the Texas AG admitting to voter suppression because he knows nothing bad will come from being out in the open about trying to suppress democracy.",
            "title_similarity": "0.73020816",
            "sentiment_compound": 0.431
        },
        {
            "id": "h0qs4q8",
            "score": 1,
            "text": "Things I learned about Republicans over the last 40 years: \n\nIf you kneel during an anthem, they will accuse you of hating America, and insist you are desecrating the memory of veterans who fought and died for our freedoms and rights. \n\nBut they also really don’t want you to vote.",
            "title_similarity": "0.73880804",
            "sentiment_compound": -0.4647
        },
        {
            "id": "h0qs5lo",
            "score": 1,
            "text": "I am confused by the headline, so no matter what he would have lost…",
            "title_similarity": "0.5278104",
            "sentiment_compound": -0.3151
        },
        {
            "id": "h0qs6o1",
            "score": 2,
            "text": "This makes me ashamed of America. Hate to admit it, but to witness the blatant corruption that America has the power to overcome, depresses me. \n\nIt made me realize how fragile our country is towards maintaining justice and democracy.",
            "title_similarity": "0.58272773",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0qs91u",
            "score": 2,
            "text": "Googlie eyed fuck",
            "title_similarity": "0.18314062",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0qsasg",
            "score": 2,
            "text": "I'm so tired. What are the chances something is done to fix this?",
            "title_similarity": "0.30848223",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h0qsbn5",
            "score": 2,
            "text": "With all the talk about a civil war, and the upset in Georgia- if they lost Texas their fears of Democratic cheating would be even more fervent.",
            "title_similarity": "0.6974194",
            "sentiment_compound": -0.9154
        },
        {
            "id": "h0qsd2d",
            "score": 2,
            "text": "Texas Dems should post this all over social media from now through 2024. Remind folks that they aren’t the minority party in Texas they think they are. If the Republicans are this scared of you voting, prove them right in every election from here on out!",
            "title_similarity": "0.7827815",
            "sentiment_compound": -0.2422
        },
        {
            "id": "h0qsd6z",
            "score": 2,
            "text": "Remember when Republicans were smart enough to hide their relentless cheating?  It's nice to see they've devolved.",
            "title_similarity": "0.5165037",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0qsdhp",
            "score": 2,
            "text": "Texas is much more purple than people realize",
            "title_similarity": "0.35822076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qseug",
            "score": 3,
            "text": "So, voter fraud then.",
            "title_similarity": "0.47954297",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0qsfch",
            "score": 2,
            "text": "I don't understand how we can blatantly have voter suppression happening and nobody gets held accountable because apparently they can get away with it even though the evidence is clear as fucking day.",
            "title_similarity": "0.6442672",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0qshdj",
            "score": 2,
            "text": "“Had I not suppressed the legitimate vote, he would’ve lost by more that 10 million!”.\n\nThis guy should be breaking rocks in a federal prison before the year 2021 is done.",
            "title_similarity": "0.7002363",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h0qshvl",
            "score": 3,
            "text": "So they're admitting that they interfered with the democratic process. Sadly this wont change anything and we already knew rhey did this shit anyway",
            "title_similarity": "0.59294426",
            "sentiment_compound": -0.7935
        },
        {
            "id": "h0qsien",
            "score": 2,
            "text": "If we had a popular voting system, Trump would have lost just about *every single* state.",
            "title_similarity": "0.8651408",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0qsmxk",
            "score": 4,
            "text": "The Republicans have never been in an election they weren't happy to rig.",
            "title_similarity": "0.60237646",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0qsnpy",
            "score": 5,
            "text": "So…did he just admit to committing a crime and suppressing votes?",
            "title_similarity": "0.5397213",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0qssk3",
            "score": 8,
            "text": "I am moving from Indiana to Texas in a month for a job and I looked up how to get all set up for voting and Jesus fucking Christ there are so many unnecessary hoops. Ik people on here know and talk about it all the time but it is so much more infuriating and worse actually having to deal with it.",
            "title_similarity": "0.5870688",
            "sentiment_compound": -0.8997
        },
        {
            "id": "h0qsthm",
            "score": 3,
            "text": "“…and Donald Trump would've lost the election.”  \n\nUm…he *did* lose the election, dumbass.",
            "title_similarity": "0.8507199",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h0qsu76",
            "score": 3,
            "text": "Outright treasonous statement. Should be met with an arrest warrant.",
            "title_similarity": "0.4027916",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h0qsvas",
            "score": 7,
            "text": "We need new representatives in Texas, right fucking yesterday.",
            "title_similarity": "0.5162274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qsvql",
            "score": 2,
            "text": "No shit",
            "title_similarity": "0.036628786",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0qt32f",
            "score": 3,
            "text": "This is the same guy that Texas is trying to give more powers to for elections.",
            "title_similarity": "0.60244197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qt5ro",
            "score": 5,
            "text": "Any bad news for Trump is good news",
            "title_similarity": "0.5159042",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0qtcoo",
            "score": 5,
            "text": "Ken Paxton has been running from felony charges since he took office let’s start to lock up these corrupt politicians.",
            "title_similarity": "0.61223793",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0qtd7l",
            "score": 2,
            "text": "Wow.  That revalation doesn't upset me at all. /s",
            "title_similarity": "0.10648994",
            "sentiment_compound": 0.717
        },
        {
            "id": "h0qte9r",
            "score": 6,
            "text": "Classic Paxton, a piece of shit impersonating a piece of shit.",
            "title_similarity": "0.29804045",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0qtymy",
            "score": 1,
            "text": "Excuse me what the fuck.",
            "title_similarity": "0.0761443",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0qu053",
            "score": 1,
            "text": "Enough with the bitching do something about it bc the gqp is openly rigging the upcoming elections but we are doing fuck all about it and that includes the corporate dems. If you feel that the end of stability in the US is not acceptable then stage a work strike no excuses or just roll over and accept your fates bitching isnt helping.",
            "title_similarity": "0.7080321",
            "sentiment_compound": -0.9165
        },
        {
            "id": "h0qu8fu",
            "score": 3,
            "text": "I swear it's almost like republicans have to cheat to win, and then they project their corruption on everyone else while they cover-up their own crimes.",
            "title_similarity": "0.6300717",
            "sentiment_compound": 0.1548
        },
        {
            "id": "h0quadf",
            "score": 3,
            "text": "Does this imply we have a realistic shot at taking Texas next time?",
            "title_similarity": "0.5808358",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qubjg",
            "score": 2,
            "text": "r/leopardsatemyface",
            "title_similarity": "0.28885907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qugn9",
            "score": 1,
            "text": "We actually still had mail in ballots in Texas. Not sure what blocking of mail-in ballots happened.",
            "title_similarity": "0.595775",
            "sentiment_compound": 0.0572
        },
        {
            "id": "h0quj6g",
            "score": 1,
            "text": "So.. does that mean Trump stole Texas?",
            "title_similarity": "0.6692586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qujuw",
            "score": 2,
            "text": "Is this serious or some weird fraud accusation that I don't understand",
            "title_similarity": "0.39748907",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h0quqnk",
            "score": 6,
            "text": "The fact that he would say that is not surprising at all. Everyone here seems to be completely ignoring the fact that he also thinks mail in ballots allow fraud. He’s saying Trump would have lost because of fraud. That’s obviously BS but there is no revelation to be had here. More of both sides saying the same thing to mean different things.",
            "title_similarity": "0.7127764",
            "sentiment_compound": -0.8483
        },
        {
            "id": "h0qv3a6",
            "score": 2,
            "text": "Weird flex, but ok....",
            "title_similarity": "0.1507422",
            "sentiment_compound": -0.09
        },
        {
            "id": "h0qv6pe",
            "score": 2,
            "text": "This guy has always been scum. No one likes him.",
            "title_similarity": "0.34069428",
            "sentiment_compound": -0.5472
        },
        {
            "id": "h0qv7yz",
            "score": 6,
            "text": "So they admitted that if they allowed all us citizens to vote that they would lose. This is bs. This should be grounds for some kind of lawsuit against the Republican Party bc they admit that they would lose if it weren’t for the fact that they are actively trying to prohibit people from voting so they can keep their pos party in office.",
            "title_similarity": "0.81065243",
            "sentiment_compound": 0.3788
        },
        {
            "id": "h0qv8z3",
            "score": 1,
            "text": "This will never end...",
            "title_similarity": "0.0035467707",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qvhqo",
            "score": 1,
            "text": "Republicans in charge. What, you want a Rump Medal of Peedumb?",
            "title_similarity": "0.4523558",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0qvhqt",
            "score": 1,
            "text": "“I don’t get it. Why is he confessing?”\n“No, he’s bragging.”\n\nhttps://youtu.be/PgGLgygsqus",
            "title_similarity": "0.4273647",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qvigc",
            "score": 1,
            "text": "It’s like they think voting suppression is a new tactic. OF CORSSS!!!!",
            "title_similarity": "0.5266027",
            "sentiment_compound": 0.5673
        },
        {
            "id": "h0qvjj3",
            "score": 1,
            "text": "My grandparents have a flag on their house that says Trump 2024 Make Votes Count Again",
            "title_similarity": "0.61452603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qvjmy",
            "score": 1,
            "text": "i'm just sayin if we let democracy die because we can't wear a mask and vote thats weak as hell",
            "title_similarity": "0.6688521",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h0qvkmn",
            "score": 3,
            "text": "More proof RepubliKKKlans hate Democracy",
            "title_similarity": "0.52563417",
            "sentiment_compound": -0.6077
        },
        {
            "id": "h0qvkqa",
            "score": 2,
            "text": "Stupid things to say.",
            "title_similarity": "0.25462532",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0qvpxt",
            "score": 1,
            "text": "Republicans just air their crimes publicly now because they knew they won’t suffer any consequences, and unfortunately they are correct.",
            "title_similarity": "0.5239701",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h0qvr6a",
            "score": 1,
            "text": "Just like if I don't lock the door, all my stuff gets stolen.",
            "title_similarity": "0.53853357",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0qvron",
            "score": 1,
            "text": "Look people, before you all jump on this bozos bandwagon ya should know that he said.",
            "title_similarity": "0.5046483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qvuqi",
            "score": 2,
            "text": "Blatantly admitting to voter suppression.",
            "title_similarity": "0.47925782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qvzgf",
            "score": 1,
            "text": "Idiot. He just admitted to rigging an election.",
            "title_similarity": "0.60739344",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0qw3n6",
            "score": 4,
            "text": "This is obscene.  According to the article, the election officials wanted to mail *applications* for ballots to people.  It wasn't even the actual ballots.  People still had to fill it in to get a ballot sent to them.\n\nNot that these people care about consistency, but Trump himself voted by mail by requesting a mail-in ballot, so what the !%!& is wrong with these people?",
            "title_similarity": "0.7548466",
            "sentiment_compound": -0.7214
        },
        {
            "id": "h0qw488",
            "score": 3,
            "text": "What I'm hearing from this piece of shit is \"We committed so many felonies this last election cycle that any reasonable interpretation of the law would see us all in jail for life without parole\". Though, Texas is a capital punishment state, so execution for treason would be more fitting.",
            "title_similarity": "0.6925975",
            "sentiment_compound": -0.9126
        },
        {
            "id": "h0qw4jv",
            "score": 2,
            "text": "Republicans- The Party of Joseph McCarthy. And they prove it over and over again.",
            "title_similarity": "0.37619776",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0qwgau",
            "score": 2,
            "text": "As usual republicans cheat.",
            "title_similarity": "0.42005166",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0qwgmf",
            "score": 3,
            "text": "So trump was doing the fraud, funny that...",
            "title_similarity": "0.60826766",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0qwiz3",
            "score": 5,
            "text": "Republicans. They're Nazis ver. 2.0.",
            "title_similarity": "0.36698377",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qwok1",
            "score": 3,
            "text": "I'm getting fucking tired of hearing about all the bad shit they've done. I want to know what is going to be DONE ABOUT IT",
            "title_similarity": "0.38000846",
            "sentiment_compound": -0.8748
        },
        {
            "id": "h0qx0se",
            "score": 1,
            "text": "Anyone know where I can find the full conversation?\n\nEdit: found it, https://listen.warroom.org/e/episode-1000-%e2%80%93justliketheaztecs-%e2%80%a6-election-auditstherealunemployment-rate-and-the-nihs-experimentsin-child-sacrificew-ken-paxtonphill/ starts around 16 minutes in",
            "title_similarity": "0.42298383",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qx373",
            "score": 4,
            "text": "Is this not an admission of voter suppression, and from a person with political power.",
            "title_similarity": "0.52830493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qxf4k",
            "score": 1,
            "text": "I don't wanna live here anymore.",
            "title_similarity": "0.3433359",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qxfk2",
            "score": 1,
            "text": "Noooo not the truth noooo",
            "title_similarity": "0.1386182",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0qxh4r",
            "score": 1,
            "text": "Keep pushing. I want Texas like I used to covet\nKamchatka.",
            "title_similarity": "0.4321804",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0qxlcs",
            "score": 1,
            "text": "...Not the sort of thing you want to admit.",
            "title_similarity": "0.21000655",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0qxmgv",
            "score": 2,
            "text": "Any news I see about Trump I just delete and block. Delete, block. Delete, block.",
            "title_similarity": "0.5720848",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h0qxmm8",
            "score": 3,
            "text": "The GOP loses if everyone votes, so don't want to do mail in for everyone, but they also lose if the older voters that can't get to the poll don't vote, so dangerous position, mail in for some but not for all argument.",
            "title_similarity": "0.74702376",
            "sentiment_compound": -0.8509
        },
        {
            "id": "h0qxo55",
            "score": 3,
            "text": "> would've been one of those battleground states that they were counting votes in Harris County for three days and Donald Trump would've lost the election,\"\n\nand how long has that audit been going on in AZ?\n\nrepublicans complained that counting the votes would take too long and were taking too long in some places but they got the longest running recount in american history in AZ.",
            "title_similarity": "0.75601894",
            "sentiment_compound": -0.5187
        },
        {
            "id": "h0qxp8g",
            "score": 5,
            "text": "republicans cheating is pretty much normal :/\n\nnice of them to confess tho",
            "title_similarity": "0.40746117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qxqpd",
            "score": 3,
            "text": "You young people are the ones that make the difference now in elections, so keep on voting no matter how difficult they try to make it.",
            "title_similarity": "0.43448913",
            "sentiment_compound": -0.3765
        },
        {
            "id": "h0qxr04",
            "score": 1,
            "text": "No shit",
            "title_similarity": "0.036628786",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0qxt3s",
            "score": 2,
            "text": "And he's now singing in hopes to alleviate his own downfall and indictment. The GOP is fucking garbage.",
            "title_similarity": "0.5107051",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0qxto9",
            "score": 3,
            "text": "Remember when not spelling tomato correctly was enough. What the fuck happened.",
            "title_similarity": "0.50791746",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0qxw4f",
            "score": 4,
            "text": "This shit is insidious. Texas lawmakers want republicans scared so they come out to vote. By admitting this, they are actually trying to scare their (shrinking) base in the state. Fuck this. And fuck the elected officials that push this shit.",
            "title_similarity": "0.73706484",
            "sentiment_compound": -0.9668
        },
        {
            "id": "h0qxybb",
            "score": 1,
            "text": "Conspiracy theorist",
            "title_similarity": "0.31351918",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0qy07y",
            "score": 1,
            "text": "There's a lot going on here and stopping them is on par with arguing with someone who gets to use fallacy arguments and lies in a discussion against you.\n\nThis is kick starting the quality voter argument, claiming that Democrats are uninformed on issues because they vote Democrat.\n\nWe're a Republic, not a democracy, that means we vote for leadership to represent the people who's job is being informed on issues. This is like saying everyone should be a master mechanic and car builder before owning a car.\n\nThe best way to handle this is looking at historical data. It's what got me out of being a hardlined right winger and every time I've tried to connect with the Right they ban me. \n\nThe problem is conservative minds seem to be highly susceptible to being tricked by liars and I don't really know why. When looking at people who achieve their PhD before the age of 25, They all seem to act very liberal by today's American viewpoints. There is secular and scientific. Earning a PhD at such a rate demonstrates an understanding of the world around them, including rewriting your own information replacing it with more accurate data. \n\nConservatives seem to be against rewriting their knowledge and highly religious. Relying on faith and opinion, feelings and emotion, when discussing matters. They've even successfully redefined a number of words to basically mean good or bad, such as capitalism versus socialism. \n\nWhen I mean by liberal or conservative mind, I basically mean loosely by the definitions of adapting to change. \n\nThe second layer of the issue is that conservatives see politics like a sporting event. You've seen this in history where groups of people treat their government like a sport rather than publicly employed people with a job of serving the public.",
            "title_similarity": "0.6938432",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0qy1qi",
            "score": 4,
            "text": "Trump committed election fraud in the 2020 election in North Carolina, Florida, Texas, and Ohio.  He needs to be prosecuted for treason.",
            "title_similarity": "0.720567",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0qy43g",
            "score": 2,
            "text": "Well, at least they're admitting they're doing it to swing elections",
            "title_similarity": "0.56331",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0qy5pz",
            "score": 3,
            "text": "I just don't understand the people claiming Trump won. Is it so hard to believe the guy unlikable? I've spoken to a few right leaning people. Some voted for him simply because he's Republican but don't like him, some hated him and didn't vote, others voted for him and like him. The ones that actually like him are generally a bit crazy and unlikeable themselves.",
            "title_similarity": "0.71287996",
            "sentiment_compound": -0.6308
        },
        {
            "id": "h0qy66q",
            "score": 1,
            "text": "I'm pretty sure he meant because of the fraudulent votes that could have happened, not that legal voters should have been blocked. Or at least that's the public reasoning.",
            "title_similarity": "0.69391507",
            "sentiment_compound": -0.0439
        },
        {
            "id": "h0qy68y",
            "score": 3,
            "text": "Crying fraud is how they’ll steal elections in the future. You can already see them taking away voting rights. Fascism will come to America wrapped in an American flag.",
            "title_similarity": "0.67456",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h0qybq2",
            "score": 4,
            "text": "So, they admit to cheating?",
            "title_similarity": "0.2864198",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0qyd2p",
            "score": 2,
            "text": "I'm still trying to figure out if they meant it in a positive or negative context.",
            "title_similarity": "0.24923198",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0qydgd",
            "score": 3,
            "text": "If we allowed everyone to vote then most of the people would have voted for the democrat. Good job dumbass. See guys, if we allow everyone to vote then it’s cheating. /s",
            "title_similarity": "0.6876912",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0qyiqu",
            "score": 4,
            "text": "So the bloke is essentially saying that if it weren't for the illegal attempts at voter suppression in Texas the state would have possibly been Democratic.\n\nDemographics change and Republicans whom were disgusted with Trump would have flipped the state. So essentially what happened in Georgia would have happened in Texas.\n\nI remember reading articles that key cities in Texas are more diverse and these groups are getting politically active so I can easily believe this is true.",
            "title_similarity": "0.80627584",
            "sentiment_compound": 0.7709
        },
        {
            "id": "h0qyjxg",
            "score": 3,
            "text": "Yeah.....cheating works like that.",
            "title_similarity": "0.17778516",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0qyld8",
            "score": 3,
            "text": "This is the type of person Manchin thinks he's going to build bridges with.",
            "title_similarity": "0.2509689",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qyqc6",
            "score": 3,
            "text": "Isn't voter disenfranchisement illegal in the USA?  Canadian voter asking for explanation.  Thank you.",
            "title_similarity": "0.59370655",
            "sentiment_compound": 0.6623
        },
        {
            "id": "h0qyugc",
            "score": 5,
            "text": "Isn't it the saddest thing? You have to create barriers so that humans don't vote you OUT.\n\nThe feeling of self worth is so low, the fear of losing so high, that it doesn't matter anymore what people want. \n\nDespair took control and it doesn't matter what your neighbour finds what's best for him, or your friends, your family, your countrymen, anyone. No. All is worth zero so you can stay seated in that power chair for some more years, destroying what's left of everyone's faith in Humanity.",
            "title_similarity": "0.6033923",
            "sentiment_compound": 0.6413
        },
        {
            "id": "h0qywme",
            "score": 1,
            "text": "I like how they quoted the one word \"lost\"",
            "title_similarity": "0.18004808",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0qz2uv",
            "score": 2,
            "text": "“Harris County did not attempt to mail actual ballots to registered voters—just applications to request them if the individual voter wanted one.”",
            "title_similarity": "0.59037805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qz62f",
            "score": 3,
            "text": "ok but trump already lost",
            "title_similarity": "0.60232913",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h0qza7m",
            "score": 2,
            "text": "So it’s admitting that it messed with the election by making it hard or impossible for some of it’s residents to vote.",
            "title_similarity": "0.617535",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0qzavl",
            "score": 1,
            "text": "What a terrible headline.",
            "title_similarity": "0.20835175",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0qzfip",
            "score": 2,
            "text": "I wish mail in ballots weren't so necessary here because they make it hard to vote for some, hell they don't even attempt to inform voters here,  my county's election pages are a mess and not easy to even find.",
            "title_similarity": "0.65419865",
            "sentiment_compound": -0.8023
        },
        {
            "id": "h0qzh13",
            "score": 1,
            "text": "The disenfranchisement is the point",
            "title_similarity": "0.25912675",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qzljc",
            "score": 3,
            "text": "Texas AG has as much credibility as Putin on US politics. The guy is a corrupt criminal that needs to be locked up. Why is anyone listening to him?",
            "title_similarity": "0.68472123",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0qzpfn",
            "score": 1,
            "text": "Cap",
            "title_similarity": "-0.109409176",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qzryr",
            "score": 9,
            "text": "How the fuck is this not an admission of committing a felony?",
            "title_similarity": "0.4360019",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h0qzsww",
            "score": 7,
            "text": "You mean if he hadn't CHEATED.",
            "title_similarity": "0.3467332",
            "sentiment_compound": 0.5014
        },
        {
            "id": "h0r0dgh",
            "score": 1,
            "text": "Ah yes. The bait and switch. Using our fear against us. \n\nY’all it’s a back-track ploy and classic gaslighting. Years after the fact, to scare the uneducated into believing they made a mistake by utilizing Mail-in ballots.\n\nPlease tell me y’all are not that dull.\n\nEdit: the most poor of us, that have to rely on back alley scamming? Use exactly this tactic. Dude is straight up trying to pull one over on y’all. Atlantic City black-Jack table style.",
            "title_similarity": "0.6220175",
            "sentiment_compound": -0.6168
        },
        {
            "id": "h0r0f5x",
            "score": 2,
            "text": "Dystopian movies just don't do it for me anymore. Not since life started being one.",
            "title_similarity": "0.45442742",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r0jft",
            "score": 1,
            "text": "“and Donald Trump would have lost the election.” What?",
            "title_similarity": "0.8332325",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0r0ksd",
            "score": 8,
            "text": "We're aware. Texas isn't a red state, that's just the voter suppression.",
            "title_similarity": "0.6840749",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r0m4x",
            "score": 1,
            "text": "Isn't this guy in prison yet?",
            "title_similarity": "0.19807008",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0r0oxj",
            "score": 1,
            "text": "And yet the conservatives can’t get enough of his flop sweat.",
            "title_similarity": "0.5115526",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0r0xyk",
            "score": 2,
            "text": "I work with an engineer that lives in Houston and rotates to Chicago; before and during the election she was at the plant in Chicago and requested the Texas absentee ballot 6 times. Every single time was either denied or ignored . What a shame",
            "title_similarity": "0.51632905",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h0r1050",
            "score": 1,
            "text": "so could this motivate people to vote again in texas?",
            "title_similarity": "0.5787153",
            "sentiment_compound": 0.5154
        },
        {
            "id": "h0r10p0",
            "score": 1,
            "text": "There's Republicans again saying the quiet part loudly.",
            "title_similarity": "0.32309458",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r10wu",
            "score": 2,
            "text": "Well I guess if you can’t gerrymander your way to a victory in a presidential election, there’s always another way.  Now I’m off to find how the Texas Supreme Court justified this- I mean applications to Harris County? So you don’t want registered voters in Houston to even have the option?  Would it be alright in Parker County?  Oh wait, I guess someone who might request this is more likely to vote blue.  Thanks for making it clear that voter enfranchisement only matters for some.  I don’t remember that part in the Constitution.  I get it not everyone can register to vote but denying registered voters an application?? Most days I love my home state and this reminds me why it’s still a work in progress.",
            "title_similarity": "0.8099917",
            "sentiment_compound": 0.9519
        },
        {
            "id": "h0r137y",
            "score": 3,
            "text": "Yet another republican states out loud that they would lose if they did not cheat.",
            "title_similarity": "0.6696447",
            "sentiment_compound": -0.0567
        },
        {
            "id": "h0r143x",
            "score": 1,
            "text": "Almost like mail in ballots changed the election",
            "title_similarity": "0.59561855",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h0r145t",
            "score": 1,
            "text": "Another bulls hit spewing Republican.",
            "title_similarity": "0.47800782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r14oc",
            "score": 2,
            "text": "They’re saying the quiet part out loud again....",
            "title_similarity": "0.117977954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r16lc",
            "score": 4,
            "text": "GQP : \"We have to resort to dictatorship or risk losing power democratically\"",
            "title_similarity": "0.5543746",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0r1a67",
            "score": 4,
            "text": "Nothing like admitting that if you let people vote Republicans lose.",
            "title_similarity": "0.686205",
            "sentiment_compound": -0.5873
        },
        {
            "id": "h0r1hia",
            "score": 3,
            "text": "As someone who was a mail in ballot in Texas it was so difficult to do. I barely got my vote in.",
            "title_similarity": "0.6205787",
            "sentiment_compound": -0.5009
        },
        {
            "id": "h0r1rif",
            "score": 3,
            "text": "Let's also talk about Florida, and the poll tax they used to do an end-run around the will of the voters and strip voting rights of hundreds of thousands of felons.\n\nThere was election rigging in 2020 alright- it just wasn't by Democrats, and it wasn't successful (on a national scale at least). In a truly fair race, Biden's win would have been significantly larger.\n\nEdit: Dems probably would have got a few more house seats, maybe some more senate seats, as well.\n\nI'm starting to think that the polls being off in 2016 and 2020 was less a case of the polls  actually being off, and more a case of them not sufficiently accounting for the effects of Republican voter suppression.",
            "title_similarity": "0.80002135",
            "sentiment_compound": 0.8413
        },
        {
            "id": "h0r1sdx",
            "score": 3,
            "text": "Correct. Without suppression, the minority cannot win.",
            "title_similarity": "0.39872834",
            "sentiment_compound": -0.4717
        },
        {
            "id": "h0r1t0g",
            "score": 5,
            "text": ">”We would've been one of those battleground states that they were counting votes in Harris County for three days and Donald Trump would've lost the election,\" the Republican official said.\n\n\nDonald Trump did lose the election.\n\nBut is Paxton right, that Biden would have won if mail-in ballots went to every registered voter? This is setting aside the fact that he is (likely deliberately) confusing his lawsuit over applications for mail-in ballots and the ballots themselves.\n\nIn [Harris County](https://www.harrisvotes.com/HISTORY/20201103/Official%20Cumulative.pdf), Biden won 918,193 votes to Trump’s  700,630. Considering only absentee votes, Biden won 114,103 absentee votes to Trump’s 61,681 absentee votes.\n\nThere are 2,431,457 voters in Harris county of which 1,656,686 voted (68.14 percent voter turnout, above the national average of [66.3 percent](https://www.washingtonpost.com/graphics/2020/elections/voter-turnout/)), and 774,771 did not vote. \n\nTrump won by Texas by 631,221 votes. If all 774,771 additional Harris County voters voted for Biden, then Biden would have won Texas by 143,550 votes.\n\nIf the 774,771 additional absentee votes in Harris County voted absentee and split along the same percentages that they did for the absentee votes actually cast, 64.45 percent to Biden and 34.84 percent to Trump, then Biden would have received an additional 514,835 votes and Trump an additional 269,930 votes. \n\nIn this more realistic scenario (because no candidate would receive 100 percent of more than 700,000 absentee votes) Biden would have won a total of 1,433,028 and Trump would have won a total of 970,560 votes in Harris County. Biden would have a net gain of 462,468 votes which is not enough to close the actual 631,221 vote gap between candidates.\n\n**TL;DR** Paxton is full of shit.",
            "title_similarity": "0.85545254",
            "sentiment_compound": 0.4952
        },
        {
            "id": "h0r1ueg",
            "score": 3,
            "text": "This voter suppression bullshit is the real election fraud",
            "title_similarity": "0.6128385",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h0r1umr",
            "score": 2,
            "text": "This is the same guy who sued the US Govt. over the election results, right?",
            "title_similarity": "0.60706353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r21li",
            "score": 1,
            "text": "Yeah right",
            "title_similarity": "-0.16581461",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0r22jz",
            "score": 1,
            "text": "Of course. Surprised?",
            "title_similarity": "0.06841188",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0r23g4",
            "score": 2,
            "text": "Texas needs some freedom soon.",
            "title_similarity": "0.36642185",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0r260j",
            "score": 3,
            "text": "So basically they woulda lost the state if they represented all the people.",
            "title_similarity": "0.6764399",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0r261p",
            "score": 3,
            "text": "Saying the quiet part really really loudly.",
            "title_similarity": "0.13334027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r276c",
            "score": 2,
            "text": "“If we didn’t cheat, we would have lost!”",
            "title_similarity": "0.5665639",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h0r2bwa",
            "score": 2,
            "text": "They said the quiet part out loud again.",
            "title_similarity": "0.10726167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r2ck2",
            "score": 3,
            "text": "I remember when politicians tried to hide how evil they were. They would stage photo ops with little old ladies and kiss babies. Now days they don't give a fuck and still get elected. I am sure someone on this app will enlighten me on what has changed in the dynamic between politicians and their constituents.",
            "title_similarity": "0.60851234",
            "sentiment_compound": 0.775
        },
        {
            "id": "h0r2ggy",
            "score": 3,
            "text": "Man, just imagine if everyone voted. The GOP would get like 30% of the vote.",
            "title_similarity": "0.42496842",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0r2hk6",
            "score": 1,
            "text": "Openly admitting the only way to win is cheat..Bravo, ass wagon.",
            "title_similarity": "0.42667642",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0r2i9h",
            "score": 3,
            "text": "Why do people choose to live in states with these oppressive laws and mandates. I live in a state where voting by mail is the norm. It’s quite amazing that voting by mail is vilified in such a way by red states.  And it’s not just the voting laws, but also the anti-abortion bills, the unemployment payment policies, the list goes on. A number of conservative govt states have oppressive policies against the poor, and they seemingly just live/deal with it.  What makes living in TX, FL, GA better than CO, WA, OR?  Is it the cheaper housing, or maybe the warmer weather? Is that worth the rights you give up to have a say in voting for your state/federal govt?",
            "title_similarity": "0.6752819",
            "sentiment_compound": -0.4485
        },
        {
            "id": "h0r2qid",
            "score": 3,
            "text": "Very democratic of you to not allow people to vote. In the words of the dude “Fucking fascist.”",
            "title_similarity": "0.59016037",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h0r2rki",
            "score": 1,
            "text": "I can't out into words how much I fucking HATE the Republican party.",
            "title_similarity": "0.62101924",
            "sentiment_compound": -0.4635
        },
        {
            "id": "h0r2yeb",
            "score": 3,
            "text": "Pure corruption",
            "title_similarity": "0.21516483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r2ylv",
            "score": 6,
            "text": "If only abortions were legal back when this asshole was conceived. There would be a lot less assholes in the world.",
            "title_similarity": "0.6584271",
            "sentiment_compound": -0.4601
        },
        {
            "id": "h0r384h",
            "score": 3,
            "text": "This is why you need to vote out republicans. They can't win without rigging the system!!!",
            "title_similarity": "0.74404365",
            "sentiment_compound": -0.6057
        },
        {
            "id": "h0r39mu",
            "score": 5,
            "text": "Woah, Trump was right, the election was rigged!",
            "title_similarity": "0.66036433",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h0r3a5g",
            "score": 6,
            "text": "That sounds like a clear admission that if all lawful voters actually had easy opportunity to vote, Texas would have turned blue already.",
            "title_similarity": "0.62639844",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h0r3br0",
            "score": 1,
            "text": "Not even hiding it anymore",
            "title_similarity": "-0.01884003",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h0r3d4r",
            "score": 1,
            "text": "Eye can believe it",
            "title_similarity": "-0.034834534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r3i8f",
            "score": 3,
            "text": "So openly admitting voter suppression?",
            "title_similarity": "0.49595553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r3jwk",
            "score": 1,
            "text": "Yay! Lets admit your corrupt!",
            "title_similarity": "0.27077514",
            "sentiment_compound": 0.6988
        },
        {
            "id": "h0r3tv8",
            "score": 1,
            "text": "For those who don’t wanna read it: it’s not a “said the quiet part loud, gotcha!” quote but rather a “something something illegal mail in ballots” quote.",
            "title_similarity": "0.6011584",
            "sentiment_compound": -0.7345
        },
        {
            "id": "h0r3wxs",
            "score": 6,
            "text": "I heard that Trump only won Florida because 30% of the mail-in ballots got thrown out. He was so bad that he still lost after cheating.",
            "title_similarity": "0.71024644",
            "sentiment_compound": -0.7712
        },
        {
            "id": "h0r40ip",
            "score": 6,
            "text": "No kidding.\n\nHe wouldn’t have gotten almost anything out of his life if he didn’t resort to swindling, grifting, and cheating.\n\nHe didn’t take the time to develop actual skills, he was just coached by a sociopath into becoming an even bigger sociopath.",
            "title_similarity": "0.5760227",
            "sentiment_compound": -0.7843
        },
        {
            "id": "h0r43eh",
            "score": 3,
            "text": "Trump has been saying the same thing... damn shame we cant get rid of the issue because of two senators.\n\nIf senate passes the for the people act and the john lewis voting rights act, it would be like having a Stacey Abrams in every state.",
            "title_similarity": "0.77243036",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0r45gy",
            "score": 2,
            "text": "So if more people would have gotten to vote, he would have lost even more biggly.",
            "title_similarity": "0.70146227",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0r464i",
            "score": 5,
            "text": "“Mr President, you’ve been quoted several times claiming that the Democrats stole the election. Do you have any evidence to support this claim.” \n\n“Well it’s all very simple really. We know they stole the election because we tried to steal it an they managed to steal it first. Just like the bad guys did in Oceans 12. Have you seen those movies? They’re terrible. Just a bunch of thieves stealing money from hard working honest business men, like myself.”",
            "title_similarity": "0.6883667",
            "sentiment_compound": -0.886
        },
        {
            "id": "h0r4igs",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0r4r62",
            "score": 2,
            "text": "Tarn tootin’ he would’ve lost Texas. He shite.",
            "title_similarity": "0.66469836",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0r4vrv",
            "score": 13,
            "text": "Wait, so there WAS fraud, just not from the side they said there was.",
            "title_similarity": "0.48249593",
            "sentiment_compound": -0.6204
        },
        {
            "id": "h0r56nj",
            "score": 10,
            "text": "GQP corruption is never ending.",
            "title_similarity": "0.169265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r58bn",
            "score": 7,
            "text": "So does he get the million dollars he was offering up for evidence of election fraud?",
            "title_similarity": "0.6095102",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0r5atq",
            "score": 9,
            "text": "Sounds like we found the real election fraud",
            "title_similarity": "0.5502325",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0r5unn",
            "score": 5,
            "text": "There is your election fraud people 🤦🏻‍♀️",
            "title_similarity": "0.49117717",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0r5vf8",
            "score": 3,
            "text": "A lot of people from liberal states moved to TX in last year. They would presumably be more liberal leaning as well. I imagine that TX will be undergoing a political metamorphosis the more populous it becomes.",
            "title_similarity": "0.5803375",
            "sentiment_compound": 0.8208
        },
        {
            "id": "h0r5yvf",
            "score": 3,
            "text": "Yup. So not fraud.",
            "title_similarity": "0.010680661",
            "sentiment_compound": 0.5188
        },
        {
            "id": "h0r6aur",
            "score": 5,
            "text": "So like they just admitted their bullshit. Jesus Christ I wish shit like this had consequences.",
            "title_similarity": "0.4969609",
            "sentiment_compound": -0.0018
        },
        {
            "id": "h0r6kbz",
            "score": 3,
            "text": "Ken fucking Paxton is a true politician.\nThe only thing lower than a politician is a child molester and not by much, especially here in Texas.",
            "title_similarity": "0.5487042",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0r6m9t",
            "score": 2,
            "text": "So he said the quiet part out loud",
            "title_similarity": "0.1137165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r6nk5",
            "score": 3,
            "text": "Just a little context on how bent Texas politics is.\n\nKen Paxton is an accused an indicted tax fraud who promoted Trumps BIG LIE in hopes of getting a preemptive pardon.\n\nHis opponent in the next election is George P Bush, who's Father, Mother Uncle and Aunt Trump has dumped on. But George P is still solid MAGA. [link](https://www.forbes.com/sites/andrewsolender/2021/06/04/dad-gets-it-jeb-bushs-son-says-father-cool-with-him-courting-trumps-support-despite-savage-2016-attacks/?sh=1de5b92848f0) and claims his folks are cool with that.\n\nGood Luck Texas Voters!",
            "title_similarity": "0.78751653",
            "sentiment_compound": 0.9117
        },
        {
            "id": "h0r6ry4",
            "score": 3,
            "text": "This will be used by Republicans as a reason to pass voting restrictions. Like they’ve stopped caring at this point.",
            "title_similarity": "0.7242204",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0r6s9s",
            "score": 1,
            "text": "Excuse me.",
            "title_similarity": "-0.026972597",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0r7dp1",
            "score": 3,
            "text": "How is this legal",
            "title_similarity": "0.14585489",
            "sentiment_compound": 0.1593
        },
        {
            "id": "h0r7pl9",
            "score": 2,
            "text": "What. The. Fuck.",
            "title_similarity": "0.08575769",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0r7pvs",
            "score": 1,
            "text": "Why was it illegal to mail out forms to sign up for a mail in ballot? If the county wanted to do that, why block it? Also, couldn’t anyone send out those forms? Like couldn’t you just pick up a box of those forms from the elections office and just send them out? \n\nI feel like I’m missing something here.",
            "title_similarity": "0.72039396",
            "sentiment_compound": -0.6868
        },
        {
            "id": "h0r7rra",
            "score": 4,
            "text": "So they're literally admitting that these kinds of actions affect the outcomes, rather than the integrity, of elections.",
            "title_similarity": "0.6094026",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0r7srk",
            "score": 6,
            "text": "Republicans can't win if they don't cheat.",
            "title_similarity": "0.61223483",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h0r7xe0",
            "score": 4,
            "text": "Oh, so basically voter fraud. Good Old Projection strikes again.",
            "title_similarity": "0.5880269",
            "sentiment_compound": -0.5667
        },
        {
            "id": "h0r8332",
            "score": 10,
            "text": "Republican strategy from 2016-2020:  Saying the quiet part out loud.\n\nRepublican strategy post 2020:  \"What quiet part?\"",
            "title_similarity": "0.4873471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0r89wj",
            "score": 6,
            "text": "What’s really weird is that Trump is the one that rigged the election, obvious here by this article. And yet he’s the one claiming that it was rigged against him. Something wrong with this picture. He successfully blocked Democratic voters in Texas. But he’s the one saying that the other side cheated. How odd.",
            "title_similarity": "0.81948733",
            "sentiment_compound": -0.8978
        },
        {
            "id": "h0r8by5",
            "score": 6,
            "text": "So he's just admitting that they rigged their election then? Ok.",
            "title_similarity": "0.6103866",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0r8jf7",
            "score": 6,
            "text": "People like Ken Paxton are the reason I want to burn my party to the ground. \n\nI won't change parties. I will take every opportunity, as a registered Republican, to fuck this party over as much as I can.\n Of course that just means voting for the least douchey assholes during the primary, and then voting 95% lib down ticket during the general. I love it when I get asked for money and I tell them all the money I could afford to donate, I donated to Bernie.\n\nFuck Texas Republicans in particular.\n\nDan Crenshaw is my Congressman too. Ugh.",
            "title_similarity": "0.70609987",
            "sentiment_compound": -0.0601
        },
        {
            "id": "h0r8ma3",
            "score": 3,
            "text": "This is great news, for Democrats.",
            "title_similarity": "0.2903315",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0r8slh",
            "score": 3,
            "text": "How many times now have Republicans come out and straight up aknowledged that when people vote they lose? And that limiting voting, by one means or another, is to their advantage?\n\nThese articles aren't a surprise at this point, the only surprise is that there are still so many people that defend or excuse Republican voter suppression tactics.",
            "title_similarity": "0.7460573",
            "sentiment_compound": 0.2837
        },
        {
            "id": "h0r90u4",
            "score": 5,
            "text": "Anyone tired of minority rule?",
            "title_similarity": "0.32551768",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0r9mvr",
            "score": 2,
            "text": "Sorry, but he and the other Republicans lie so much I can't believe a word.",
            "title_similarity": "0.5089557",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h0r9z7a",
            "score": 3,
            "text": "Someone in Texas needs to file major lawsuits.  This is taxation without representation.  Seems like a pretty big deal in American history, that.",
            "title_similarity": "0.7405029",
            "sentiment_compound": 0.0508
        },
        {
            "id": "h0ra3cf",
            "score": 3,
            "text": "Providing tangible justice doesn’t exist in Texas.",
            "title_similarity": "0.48012164",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0racl0",
            "score": 3,
            "text": "Good old Ken Paxton. He should be in prison, instead he’s on TV bragging about disenfranchising millions of people in one of the largest cities in the country. What a piece of shit.",
            "title_similarity": "0.568055",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0raq8r",
            "score": 1,
            "text": "This isn't democracy, it's some kind of manipulated rule by devious legal minds and committees.",
            "title_similarity": "0.52786386",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h0ratn5",
            "score": 4,
            "text": "Shows to why Texas is a pro Donald Trump state the state government in Austin agree with Donald Trump ideology of blocking postal ballot in order to let him win",
            "title_similarity": "0.7930217",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0rb5py",
            "score": 1,
            "text": "um. they'res A LOT too unpack here",
            "title_similarity": "0.20344688",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rbh0s",
            "score": 1,
            "text": "Improper English. Cannot be trusted",
            "title_similarity": "0.27695906",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h0rbj1c",
            "score": 6,
            "text": "Principled republicans sure do love to cheat cheat cheat",
            "title_similarity": "0.3923575",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0rc0o2",
            "score": 6,
            "text": "It’s almost like republicans wanna cheat to win instead of bringing about policies that are resonating with the population.",
            "title_similarity": "0.67578715",
            "sentiment_compound": 0.4601
        },
        {
            "id": "h0rc5wy",
            "score": 1,
            "text": "Democracy😓",
            "title_similarity": "-0.0742396",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0rd23j",
            "score": 4,
            "text": "Are you fucking kidding me? Why are democrats even trying to do anything bipartisan when republicans are tossing out the rule book?",
            "title_similarity": "0.7244551",
            "sentiment_compound": 0.2624
        },
        {
            "id": "h0rd2iy",
            "score": 2,
            "text": "People like this do deserve the death penalty. This goes against democracy.",
            "title_similarity": "0.5314321",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0rd7yh",
            "score": 4,
            "text": "Hell yeah, the only way for trump to win is to cheat, lie  and con his way .  \nTrump can never do anything proper.",
            "title_similarity": "0.63141745",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0rdaoy",
            "score": 3,
            "text": "\"We only won because we didn't make voting easier.\"",
            "title_similarity": "0.61173743",
            "sentiment_compound": 0.3331
        },
        {
            "id": "h0rdddz",
            "score": 5,
            "text": "This is just more proof that the only way republicans can will is if they oppress and cheat",
            "title_similarity": "0.59478915",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0rdfyn",
            "score": 6,
            "text": "Stolen election you say??",
            "title_similarity": "0.49953973",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h0rdjop",
            "score": 5,
            "text": "Voter suppression worked!\n\nHe said the quiet part out loud.",
            "title_similarity": "0.40415847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rdkxi",
            "score": 2,
            "text": "Voter suppression 101.",
            "title_similarity": "0.39141104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rdmmg",
            "score": 6,
            "text": "Texas is a fucking disgrace.",
            "title_similarity": "0.47838014",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h0rdxsb",
            "score": 3,
            "text": "Texas politicians can laugh all they want about the “Californians are abandoning the state for Texas” line all they want - but they know it’s the end for them if they don’t ramp up the cheating right now. It’s going to end with a blue Texas eventually.",
            "title_similarity": "0.71576244",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0re0jj",
            "score": 5,
            "text": "This guy should be in Jail for other things, how he's able to be AG is beyond me.",
            "title_similarity": "0.45677018",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rea03",
            "score": 1,
            "text": "So, basically, Trump would have won re-election if there weren’t mail-ins?",
            "title_similarity": "0.86122453",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0reb3f",
            "score": 2,
            "text": "Fuck that lazy eye bob Newhart wannabe",
            "title_similarity": "0.36328954",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0recb7",
            "score": 2,
            "text": "That's because of all the fraudulent votes that would have occurred.../s",
            "title_similarity": "0.5684658",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0reea9",
            "score": 3,
            "text": "Also fuck Texas backward ass state run by morons",
            "title_similarity": "0.5584151",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h0reke1",
            "score": 2,
            "text": "Out of curiosity, does anyone know how many votes didn't occur because they couldn't mail them in?  \n\nDon't crucify me. I'm genuinely curious.",
            "title_similarity": "0.6564729",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ren98",
            "score": 3,
            "text": "God damn this explains why I never got my ballot when I was out of state, these motherfuckers",
            "title_similarity": "0.60646534",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0rer9k",
            "score": 5,
            "text": "We cheated, and that's how we won",
            "title_similarity": "0.33651763",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0rf4rz",
            "score": 2,
            "text": "Can someone explain to me why this isn't mail tampering? Which is illegal according to my google query.",
            "title_similarity": "0.61004543",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0rf57s",
            "score": 3,
            "text": "Come on Texas, we can do it!\n\nRoses are red, Texas is too\n\nBut if we all vote, The state will turn blue",
            "title_similarity": "0.54793495",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rf9jl",
            "score": 2,
            "text": "So why are mail-in ballots sent to registered voters deemed illegal?",
            "title_similarity": "0.6736814",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0rfedu",
            "score": 1,
            "text": "Heading? It’s great.",
            "title_similarity": "-0.06738609",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0rfiil",
            "score": 5,
            "text": "Aka: \"Our voter fraud was successful\"",
            "title_similarity": "0.51162875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rfpyu",
            "score": 5,
            "text": "Not surprising. If you're not a white Christian male, Texas politicians don't want you voting.",
            "title_similarity": "0.71657914",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h0rfw7r",
            "score": 6,
            "text": "Texas has always been a laboratory for bad government, but now it seems headed towards a future Apartheid of gated McMansion lifestyles, enforced by stand-your-ground deadly force and banana republic elections.",
            "title_similarity": "0.6363288",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h0rh7ao",
            "score": 2,
            "text": "Please, please, please. I just can’t take this evil, corrupt POS anymore.",
            "title_similarity": "0.4178898",
            "sentiment_compound": -0.09
        },
        {
            "id": "h0rh8yz",
            "score": 1,
            "text": "Dump will say anything that can be spun into him winning, when in reality he clearly lost.  Words he's never had to deal with and accept.",
            "title_similarity": "0.5550907",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0rhjlb",
            "score": 5,
            "text": "So if everyone had voted Trump would have lost even in Texas. I read this as mail in voting or no mail in voting Turning Texas Blue is within reach according to Republicans. Fucking reach for it people.",
            "title_similarity": "0.8352703",
            "sentiment_compound": -0.4601
        },
        {
            "id": "h0rho4n",
            "score": 1,
            "text": "Grand Old Partyofvotesuppression",
            "title_similarity": "0.24598803",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0rhpb7",
            "score": 2,
            "text": "Texas GOP, “We’re #1, We’re #1, We’re #1 ... at voter suppression!”",
            "title_similarity": "0.65246284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rhun1",
            "score": 8,
            "text": "I recently moved to Texas. I registered to vote by physical form to a post office an entire month before the election, and stood in line in the heat for an hour. As someone who is used to easy registration and mail-in voting this was a shock to me.\n\nThey didn't let me vote. They said that I wasn't registered. I got a letter confirming that I was registered to vote in either December or January. The meddling in the post office this summer and Texas placing numerous unnecessary obstacles in front of voting absolutely took away my patriotic right to vote, and I'm damned upset about it.",
            "title_similarity": "0.6676238",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0rhv1o",
            "score": 10,
            "text": "I remember I requested my mail-in ballot and by the time I received it it was already too late for the mail-in to be counted. It took over a month from the time I requested it for it to arrive. What’s more, instead of receiving a mail-in ballot like I thought I was, it was just the form I needed to send in to request a mail-in ballot. In other words, I had to request a “mail-in ballot request form” so that I could then request a mail-in ballot.\n\nThe worst part was that the form I received could have been easily downloaded and printed online, but of course there was no messaging informing me that “you can just print this yourself instead of waiting a month for it to arrive.”\n\nThey tried to make me jump through extra hoops so that I’d be dissuaded from casting a valid mail-in ballot. I was so pissed off that I drove from Dallas to Austin so that I could vote in-person.",
            "title_similarity": "0.6329695",
            "sentiment_compound": -0.9091
        },
        {
            "id": "h0rijcc",
            "score": 3,
            "text": "*Texas AG confirms election interference. \n\nThey've been trying so hard to find evidence of voting problems, and turns out they just hadn't walked by a mirror.....",
            "title_similarity": "0.7513038",
            "sentiment_compound": -0.5524
        },
        {
            "id": "h0riuu5",
            "score": 1,
            "text": "This is treason. The Texas AG is a goddamn traitor. Impeding lawful democracy from within is treasonous behavior.",
            "title_similarity": "0.6118028",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h0rj18q",
            "score": 3,
            "text": "What are people saying about this on r/conservative?",
            "title_similarity": "0.38746223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rjbtj",
            "score": 1,
            "text": "Why the fuck is Texas becoming the most repressed political state. It’s goddamn embarrassing for our country. And also, we’re fucked.",
            "title_similarity": "0.6811099",
            "sentiment_compound": -0.945
        },
        {
            "id": "h0rjqfn",
            "score": 2,
            "text": "Quiet part loud, but then [Republicans have a history of that](https://m.youtube.com/watch?v=8GBAsFwPglw).",
            "title_similarity": "0.43344986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rju1f",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15566194"
        },
        {
            "id": "h0rjubo",
            "score": 1,
            "text": "I mean why perjure yourself when no one will care enough about what you're admitting to that it'll spur action. \n\nWe're at the point where a crime that serious is less likely to be prosecuted than lying about it.",
            "title_similarity": "0.6121037",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h0rjx8e",
            "score": 3,
            "text": "Not a surprise that more people voting is bad for Republicans",
            "title_similarity": "0.5816942",
            "sentiment_compound": -0.6501
        },
        {
            "id": "h0rk7b3",
            "score": 3,
            "text": "So... They’re just admitting it now?",
            "title_similarity": "0.12397485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rkf6o",
            "score": 5,
            "text": "Just a reminder that Texas always ranks as one of the top 5 voter suppressed states.",
            "title_similarity": "0.52379155",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0rknoj",
            "score": 3,
            "text": "Ken Paxton, you absolute fuck hole.",
            "title_similarity": "0.2434277",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0rkuz9",
            "score": 4,
            "text": "So they cheated and still lost? And now they’re mad about it",
            "title_similarity": "0.41570276",
            "sentiment_compound": -0.8434
        },
        {
            "id": "h0rky4p",
            "score": 8,
            "text": "There's your voter fraud that Trump whined about.",
            "title_similarity": "0.7010489",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0rl81w",
            "score": 1,
            "text": "Very legal, very cool!",
            "title_similarity": "0.061986014",
            "sentiment_compound": 0.6049
        },
        {
            "id": "h0rlkiz",
            "score": 2,
            "text": "The crazy thing is how blatantly obvious this has been and nothing has been done to curb it.",
            "title_similarity": "0.30133277",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0rm6lw",
            "score": 3,
            "text": "So he admits it! Arrest him then, right?",
            "title_similarity": "0.28764534",
            "sentiment_compound": 0.0952
        },
        {
            "id": "h0rmk09",
            "score": 3,
            "text": "The fact that at least one state actually had who won it influenced by the blocking of mail-in ballots shows that what Trump and the GOP were trying to do can actually work and that they came closer to stealing the election than many realize.",
            "title_similarity": "0.79929423",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0rn3dx",
            "score": 8,
            "text": "Correction: Texas AG admits to committing voter suppression, what should be a federal crime.",
            "title_similarity": "0.69282794",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0rn8px",
            "score": 3,
            "text": "CONFESSION of an election FRAUDSTER?",
            "title_similarity": "0.49387962",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h0rngs8",
            "score": 4,
            "text": "What the hell? That ass confessed that votes were THROWN OUT! I hate what the GQP has done to texas.",
            "title_similarity": "0.70305175",
            "sentiment_compound": -0.92
        },
        {
            "id": "h0rnty0",
            "score": 5,
            "text": "To the surprise of nobody, Trump's bullshit and thievery goes unpunished even still.",
            "title_similarity": "0.5053392",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0rnxdn",
            "score": 3,
            "text": "If I ever sell a joint, I hope I get to pick the cops  the prosecutor, the judge and the jury.",
            "title_similarity": "0.4255765",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0rodxt",
            "score": 3,
            "text": "Good news: Ken Paxton has a challenger in the next election!\n\nOh wait, it’s George P Bush.",
            "title_similarity": "0.5952431",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h0rohyl",
            "score": 3,
            "text": "Hey! Hey guys! Look at this, I think I found voter fraud!",
            "title_similarity": "0.60875946",
            "sentiment_compound": -0.6884
        },
        {
            "id": "h0rpm4m",
            "score": 2,
            "text": "*surprised pikachu*",
            "title_similarity": "0.26010668",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0rpv2z",
            "score": 2,
            "text": "You said the quiet part loud again",
            "title_similarity": "0.10497655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rpxbf",
            "score": 3,
            "text": "I think we are at the point where we are rearranging the deck chairs on the Titanic.   It is sickening that the only true voter fraud was and is being perpetuated by those that scream in Karen-like rage over it.",
            "title_similarity": "0.5823804",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h0rqk1d",
            "score": 2,
            "text": "Proof enough that we need national voting laws or even a constitutional amendment to keep people like Trump and his minions from stealing elections.",
            "title_similarity": "0.7558862",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0rqosb",
            "score": 2,
            "text": "I miss Ann Richards.",
            "title_similarity": "0.19281125",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0rqxnb",
            "score": 2,
            "text": "Texas is definitely Democratic, it's just the crazy white people go out and vote and everyone else doesn't vote. (Source: I live in Harris county)",
            "title_similarity": "0.7019519",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0rr9n5",
            "score": 2,
            "text": "Most Texans are probably ok with this. Which is the real fucking problem.",
            "title_similarity": "0.40945363",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h0rrk2i",
            "score": 1,
            "text": "This is the end of rule of law, and the natural outcome of the “winner take all” culture we created",
            "title_similarity": "0.48511708",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0rrtvz",
            "score": 2,
            "text": "They did lost even with the voting suppression and gerrymandering.",
            "title_similarity": "0.5636221",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0rrx83",
            "score": 2,
            "text": "Me thinks the Justice Department should take action.",
            "title_similarity": "0.23760366",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0rrzcm",
            "score": 2,
            "text": "I live in Texas and this guy is the most corrupt tool",
            "title_similarity": "0.49814433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rs02i",
            "score": 5,
            "text": "I don't get it, why are they confessing?\n\nThey're not confessing...\n\nThey're bragging.",
            "title_similarity": "0.4002806",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rs673",
            "score": 5,
            "text": "At this point .. if you’re a republican in 2021 then you’re a racist .. period .. back in the day when the Republican Party was all about being conservative you could possibly make an argument about why you lean republican ( although there were still dog whistles) nowadays, things are so blatant, there’s no refuting the fact that republicans are a bunch of whites who are scared to lose their majority rule over a country they usurped to begin with .. there has  never been any wide spread fraud in modern voting history .. perhaps back in the nascent of the country where it was literally all whites voting haha how ironic? But anyways , there’s no point in presenting  facts to idiots .. you’re more of a fool for trying to have a sensible argument with someone that doesn’t agree on universal facts .. the right-minded individuals in America have to continue to fight for justice and begin to cancel out the racists .. “cancel culture “ them right out of here",
            "title_similarity": "0.7449778",
            "sentiment_compound": -0.953
        },
        {
            "id": "h0rsbko",
            "score": 1,
            "text": "Sent it to him. He isn't mentally well.",
            "title_similarity": "0.28376895",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h0rsbkz",
            "score": 4,
            "text": "Seems like Texas has already flipped blue.  I guess it's only republican at the state level because of gerrymandering.",
            "title_similarity": "0.7516245",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0rstux",
            "score": 6,
            "text": "Everyone knows the gop isn’t that popular and will always lose a truly fair election that allows everyone legally allowed to vote, to actually vote. \n\n They spend more time gerrymandering than actually being non polarizing",
            "title_similarity": "0.67126656",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0rsv9m",
            "score": 6,
            "text": "Even Trump admitted that Republicans haven't won an election honestly in decades.",
            "title_similarity": "0.6653496",
            "sentiment_compound": 0.1032
        },
        {
            "id": "h0rsyhm",
            "score": 2,
            "text": "Thank god for right wing media, I know it’s weird. These sick stain jerks snitch on themselves.",
            "title_similarity": "0.4645431",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0rt6ms",
            "score": 3,
            "text": "Probably would have lost EVERY state if it had mail in voting.",
            "title_similarity": "0.7660028",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0rto2l",
            "score": 3,
            "text": "I argued a fair bit yesterday because I'm apparently not free and don't have any rights in the UK. \n\nAt least I can vote. \"The land of the free\", my arse.",
            "title_similarity": "0.65661585",
            "sentiment_compound": 0.1022
        },
        {
            "id": "h0rto6r",
            "score": 7,
            "text": "\"Trump would have lost if we hadn't undermined democracy and prevented millions from voting\".\n\nIt's been the GOP playbook since the 60's. They're just being candid about their authoritarian impulses now.",
            "title_similarity": "0.8303374",
            "sentiment_compound": -0.0232
        },
        {
            "id": "h0rtq5r",
            "score": 3,
            "text": "The US people should have a collective lawsuit against this. That's the REAL voter fraud. It wasn't even fair voting.",
            "title_similarity": "0.6827885",
            "sentiment_compound": -0.7692
        },
        {
            "id": "h0rtvjx",
            "score": 2,
            "text": "Isn’t he admitting to committing a felony or treason or conspiracy to commit voter fraud?  Shouldn’t he lose his job and do jail time?",
            "title_similarity": "0.69169664",
            "sentiment_compound": -0.9344
        },
        {
            "id": "h0rtxjk",
            "score": 2,
            "text": "I don’t understand why every citizen in America doesn’t get equal chance and opportunity to vote! I don’t care who they vote for as long as it’s possible for them to participate fairly.",
            "title_similarity": "0.6470512",
            "sentiment_compound": 0.807
        },
        {
            "id": "h0ru20u",
            "score": 2,
            "text": "America: We need to spread democracy around the world!\n\nAmerica’s democracy:",
            "title_similarity": "0.44822824",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rud1g",
            "score": 4,
            "text": " If people voted, republicans wouldn't have a chance.",
            "title_similarity": "0.64948344",
            "sentiment_compound": -0.1877
        },
        {
            "id": "h0rv880",
            "score": 4,
            "text": "He just openly admitted to cheating for trump",
            "title_similarity": "0.61400443",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0rvvj1",
            "score": 7,
            "text": "It’s clear there was wide spread voter fraud in the 2020 elections it was just the Republicans who did it and nothing was investigated. How many do you think got the call find the votes please and just did that.",
            "title_similarity": "0.7492228",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0rw5g1",
            "score": 4,
            "text": ">DEMS ARE STEALING THE ELECTION\n\n**-Trump and the entire Right Wing Media as they try to steal the election**\n\ncan we put these people in prison already?",
            "title_similarity": "0.6402247",
            "sentiment_compound": -0.8986
        },
        {
            "id": "h0rwaaj",
            "score": 6,
            "text": "Basically the US under trump was a banana republic. Democracy doesn't mean shit",
            "title_similarity": "0.4992152",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0rwhyk",
            "score": 3,
            "text": "In other words they cheated the voters and suppressed their Right To vote - Texas, you gonna let this slide??? Dems or republicans this shit ain’t right  smh",
            "title_similarity": "0.8102199",
            "sentiment_compound": -0.8857
        },
        {
            "id": "h0rx7mk",
            "score": 2,
            "text": "LOL this isn’t even the icing on the voter suppression cake. They invalidated all early votes and shut down multiple voting stations in the largest counties in all of Texas. Houston’s Harris county ended up having a record number of voter turn out came election day. Trump may have won Texas but H-town will forever hold it down.",
            "title_similarity": "0.757423",
            "sentiment_compound": 0.5812
        },
        {
            "id": "h0rxa8r",
            "score": 2,
            "text": "But they have to do it or they will lose, it makes them smart to cheat. Duh. /s",
            "title_similarity": "0.47998545",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0rxrii",
            "score": 2,
            "text": "Its good to see them saying the quiet part out loud, but its something we already knew. The GOP already lost Georgia and Arizona so theyre going to do anything and everything they can to hold on to Texas and Florida, even if it means suppressing votes.",
            "title_similarity": "0.7507053",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0ry8g2",
            "score": 2,
            "text": "Yep, so many people crowing about a fucking stolen election and the real evidence is RIGHT THERE!!!!",
            "title_similarity": "0.55692005",
            "sentiment_compound": -0.5363
        },
        {
            "id": "h0ryzd7",
            "score": 3,
            "text": "lol we are watching the dying moments of a variation of a political party and its fantastic. Theyve gone so far they are venturing on totalitarian autocracy. A complete perversion of the American ideals (and selective enforcement of their Christian morals) from absolutely horrible people and i cant be hapier to see it come crashing down around them.",
            "title_similarity": "0.65181845",
            "sentiment_compound": 0.1796
        },
        {
            "id": "h0rz58z",
            "score": 3,
            "text": "Need I say more?  This is voter suppression, open and shut.  If they are so concerned about \"voter veracity\"; why don't they set up a system, where the voter can be verified, and notified, ahead of time?  Likewise, not voting for awhile should not cost you your Right to Vote; simply create an \"inactive\" list, place the voter on that list, and they can vote a provisional ballot, and have the State check the \"inactive\" list, to verify, or have the voter go to a convenient location (in Ohio, since no resident is more than 20 miles from the County Seat, and the County Registrar's office, that should be easy enough).  If the voter is unable to drive, free transportation should be provided, and assisted transportation, if the voter is handicapped.  Any necessary documentation, such as naturalization papers, or a birth certificate, should be provided free of charge; and provisions made for at-home, or midwife births.  To do otherwise, is voter suppression, and a violation of the 24th Amendment    (poll tax probibition) to The Constitution.  While I would not take election supervision away from the States, entirely;  past cases demand that some guidelines be set for Federal Elections, with the penalty that; in a Presidential Election, that State's Electoral Votes be voided;   and in the case of Congressional Seats, those seats remain unfilled, until new elections, properly supervised, are held.",
            "title_similarity": "0.77927",
            "sentiment_compound": 0.4208
        },
        {
            "id": "h0rzhl5",
            "score": 3,
            "text": "What kind of democracy are you guys running? Seriously?",
            "title_similarity": "0.46755135",
            "sentiment_compound": -0.264
        },
        {
            "id": "h0rzvff",
            "score": 3,
            "text": "nah im pretty sure texas is just a shitty state like florida. both of them voted for fascism.",
            "title_similarity": "0.64018095",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0s0s5t",
            "score": 4,
            "text": "This is great motivation to keep voting! Never let them get their way and stop you from voting",
            "title_similarity": "0.41902533",
            "sentiment_compound": 0.68
        },
        {
            "id": "h0s1nx0",
            "score": 5,
            "text": "More people voting is almost always bad news for republicans.",
            "title_similarity": "0.5782971",
            "sentiment_compound": -0.4976
        },
        {
            "id": "h0s1ywh",
            "score": 5,
            "text": "The only way the QOP can win.",
            "title_similarity": "0.2798276",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0s25hb",
            "score": 3,
            "text": "Not sure if republicans are brazen or just mentally handicapped.",
            "title_similarity": "0.40452465",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0s30b9",
            "score": 2,
            "text": "The US election process is so unbelievable ancient and unprofessionally. .",
            "title_similarity": "0.43745524",
            "sentiment_compound": 0.3327
        },
        {
            "id": "h0s30tu",
            "score": 1,
            "text": "He was talking to a criminal while making this statement.",
            "title_similarity": "0.28301448",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0s36th",
            "score": 7,
            "text": "In Australia we have compulsory voting. Yeah, it's annoying, but we all have to do it and understand so it's a pretty minor inconvenience. Also because of that, everything is geared to making it as easy and convenient as possible. \n\nOn the flip side, because everyone has to vote, it's completely impossible to try to make some people less likely to vote and influence an election that way. \n\nAlso it should be noted it's not required to vote correctly, just turn up. You can make an invalid vote. Those get recorded too so if you wish, you can consider it a protest vote.\n\nAll up, most people will vote 7 times in 12 years (3 state, 4 federal). 10 minutes, maybe half an hour if you get a busy time, is usually all it takes from your day.",
            "title_similarity": "0.6319616",
            "sentiment_compound": 0.8172
        },
        {
            "id": "h0s36z3",
            "score": 4,
            "text": "So they just argued taxation without representation is fine in the 21st century? Would that make the GOP no better than the English monarchy the founding fathers fought against?",
            "title_similarity": "0.7202109",
            "sentiment_compound": -0.8137
        },
        {
            "id": "h0s43k0",
            "score": 1,
            "text": "Why isn’t Paxton in jail?",
            "title_similarity": "0.33097464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0s4kh0",
            "score": 5,
            "text": "The GOP just blatantly admits that they would lose all votes if everyone could Vite. It’s ridiculous",
            "title_similarity": "0.66949594",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0s6aia",
            "score": 2,
            "text": "Texas is growing more liberal and the GOP knows that when they lose it they’ll never be in power again",
            "title_similarity": "0.68645585",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0s7bk7",
            "score": 2,
            "text": "Sadly some people of color Hispanics, blacks, Asians that are republicans like Allen West are in favor of  a system that is systematic discriminatory against them denying their rights  to be fully pledged citizens of United States of America. That is the greatest travesty of all time.",
            "title_similarity": "0.6913276",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0s8fcl",
            "score": 2,
            "text": "So, this doesn't qualify as a \"confession\"?",
            "title_similarity": "0.25271782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0s9bhp",
            "score": 3,
            "text": ">> Harris County, home to the city of Houston, wanted to mail out applications for mail-in ballots to its approximately 2.4 million registered voters due to the COVID-19 pandemic. However, the conservative Texas Supreme Court blocked the county from doing so after it faced litigation from Paxton's office.\n\n>>\"If we'd lost Harris County—Trump won by 620,000 votes in Texas. Harris County mail-in ballots that they wanted to send out were 2.5 million, those were all illegal and we were able to stop every one of them,\" Paxton told former Trump adviser Steve Bannon during the latter's War Room podcast on Friday.\n\n\n>>\"Had we not done that, we would have been in the very same situation—we would've been on Election Day, I was watching on election night and I knew, when I saw what was happening in these other states, that that would've been Texas. We would've been in the same boat. We would've been one of those battleground states that they were counting votes in Harris County for three days and Donald Trump would've lost the election,\" the Republican official said.",
            "title_similarity": "0.80754316",
            "sentiment_compound": -0.891
        },
        {
            "id": "h0s9os9",
            "score": 9,
            "text": "I don’t care which side you’re for but if you’re afraid of a fair fight you’re a no good coward!  Voting should NEVER be suppressed!  What BS!",
            "title_similarity": "0.6037841",
            "sentiment_compound": 0.3893
        },
        {
            "id": "h0s9xsh",
            "score": 3,
            "text": "For the last time, WHY ISN’T HE IN JAIL YET? \n\nIt’s been SIX years!",
            "title_similarity": "0.43784767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sab1h",
            "score": 5,
            "text": "And there’s the real reason the GOP and it’s supporters are so against mail in voting.",
            "title_similarity": "0.6748426",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0salxr",
            "score": 1,
            "text": "Did he just admit to committing Election Fraud?!!",
            "title_similarity": "0.5899528",
            "sentiment_compound": -0.508
        },
        {
            "id": "h0satls",
            "score": 1,
            "text": "The entire political system needs flushed, and that was after reading TWO comments.",
            "title_similarity": "0.42577174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sb9s8",
            "score": 2,
            "text": "A [criminal](https://en.m.wikipedia.org/wiki/Ken_Paxton) admitting to criminal activities? Impossible!",
            "title_similarity": "0.49731314",
            "sentiment_compound": -0.5707
        },
        {
            "id": "h0sbkyl",
            "score": 1,
            "text": "Why the scare quotes around \"lost?\"",
            "title_similarity": "0.4240108",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0sbutc",
            "score": 1,
            "text": "How are republicans so fucking blind? I swear to god this doesn't happen in any other developed countries. Even in my corrupt Portugal, that motherfucker would be in jail by now, along with Trump",
            "title_similarity": "0.7172798",
            "sentiment_compound": -0.8039
        },
        {
            "id": "h0sc0cp",
            "score": 2,
            "text": "Ah yes, exactly the \"oldest and greatest democracy on Earth\" that you expect!",
            "title_similarity": "0.28585237",
            "sentiment_compound": 0.8016
        },
        {
            "id": "h0scppd",
            "score": 4,
            "text": "Proof of why current right wing Texas politicians are passing new voter suppression laws.",
            "title_similarity": "0.7237301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0scquq",
            "score": 1,
            "text": "Not a Trump fan but isn’t the flip side of this that Trump would have won if there wasn’t a pandemic that forced the mail in ballot restrictions to be relaxed etc.  \n\nReal question.  Nothing changes except for the election is held exactly as it was 4 years ago.  Does Trump win or lose?  I do t know the answer.",
            "title_similarity": "0.83061475",
            "sentiment_compound": 0.8186
        },
        {
            "id": "h0sd8tx",
            "score": 5,
            "text": "A fair share of Republicans loose when people vote. Just a known fact, hence why republicans try to diminish people's participation in voting",
            "title_similarity": "0.65358555",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0sdbfs",
            "score": 3,
            "text": "From where I am looking, I would guess that Americas next election will be the last one. Quite likely a GOP one-party nation",
            "title_similarity": "0.5694883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sf1bd",
            "score": 6,
            "text": "In other words, if we allowed all eligible voters to choose who they want to represent them, the majority would not vote for the Republicans so we have to stop them from voting. tRump, Paxton, Abbot and Patrick want to put the political power in this country in the hands of one party and take representation from everyone else. Kill democracy is their goal.",
            "title_similarity": "0.7509407",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0sfhq0",
            "score": 1,
            "text": "I get it that Garland was screwed out of a SCOTUS seat so he has some goodwill with Democrats, but for fucks sake can he start investigating these people and do his fucking job?",
            "title_similarity": "0.62976664",
            "sentiment_compound": -0.7391
        },
        {
            "id": "h0sfjn5",
            "score": 1,
            "text": "The numbers actually show the opposite….",
            "title_similarity": "0.28071427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sgw1p",
            "score": 3,
            "text": "I'm literally gonna move to Texas to vote Democrat and spite corrupt assholes like this",
            "title_similarity": "0.6973697",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0sh96h",
            "score": 2,
            "text": "Ya don’t say, that’s why Texas is putting up multiple barriers for people to vote in upcoming elections",
            "title_similarity": "0.7267153",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0shrrs",
            "score": 3,
            "text": "Isn’t Ken Paxton, the POS, supposed to be in jail already? Or was this a quote from jail?",
            "title_similarity": "0.40970886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sidls",
            "score": 3,
            "text": "Not surprised.  Congress needs to pass a National voting rights act now.",
            "title_similarity": "0.4986291",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h0sim8q",
            "score": 4,
            "text": "So, basically, he suppressed the vote to get the outcome he wanted. The minority attempting to rule over the minority never, ever ends well.",
            "title_similarity": "0.6253611",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h0simns",
            "score": 2,
            "text": "Texas AG looks like a melty nazi candle.",
            "title_similarity": "0.41890293",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0sinl8",
            "score": 3,
            "text": "scumbag politicians that interfered with election should be tried as traitors to their country and violating the oath they took . sad they put party over democracy . asshole trump republicans  give real republicans a  bad name",
            "title_similarity": "0.72816676",
            "sentiment_compound": -0.9118
        },
        {
            "id": "h0sjce8",
            "score": 2,
            "text": "BETO would have won Texas as well if Republican party didn't do their Voter purges crap.",
            "title_similarity": "0.85547525",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0sjwa9",
            "score": 4,
            "text": "So, the Texas AG is admitting that he thinks Texas is already a Blue state. That if eligible voters had voted, Trump would have lost Texas. So he blocked mail-in ballots to make Trump win.",
            "title_similarity": "0.8738662",
            "sentiment_compound": 0.0314
        },
        {
            "id": "h0sk8dv",
            "score": 1,
            "text": "What baffles me is Texas sued other states for sending out applications as well. Thankfully the judge put Texas back in its place and reminded these “constitutional conservatives” that the constitution allows for states to conduct elections as they see fit, essentially telling them to piss off.",
            "title_similarity": "0.7617177",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0skfkx",
            "score": 2,
            "text": "In America we consider the right to vote to be sacred. We honestly should be doing all in our power to increase, not decrease, the number of people who vote. That is how a representative democracy works.",
            "title_similarity": "0.5154589",
            "sentiment_compound": 0.6222
        },
        {
            "id": "h0skmbw",
            "score": 2,
            "text": "So outside perspective of American politics, it seems like the republicans can basically get away with anything because the democrats aren’t willing to push against them? Like isn’t the opposing party the accountability for crap like this? Seems like republicans don’t even care to the point they don’t even bother to lie about extremely illegal activities and dems don’t seem to push on anything until they’re literally committing treason and then some. What gives?",
            "title_similarity": "0.724215",
            "sentiment_compound": 0.6055
        },
        {
            "id": "h0sl7rb",
            "score": 3,
            "text": "I don’t care if he could have won, I’m just glad Biden had been elected.I don’t know if he is good but he’s sure better than Trump",
            "title_similarity": "0.5932269",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h0sln10",
            "score": 2,
            "text": "Yeah, we KNOW. That’s why you’re leaving .",
            "title_similarity": "0.19200489",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0slweb",
            "score": 3,
            "text": "The AG of the people of Texas, proud of screwing them over. Democracy is in a free fall.",
            "title_similarity": "0.5370605",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0smdxy",
            "score": 1,
            "text": "Nothing but lies I hear.",
            "title_similarity": "0.12926218",
            "sentiment_compound": 0.4585
        },
        {
            "id": "h0snl7w",
            "score": 1,
            "text": "No shit Sherlock",
            "title_similarity": "0.0800256",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0snru6",
            "score": 2,
            "text": "Bet they'll swing it as \"saving\" the election in TX because of the illegal/fraudulent ballot applications they heroically stopped, and use it as proof they need similar legislation in other states.",
            "title_similarity": "0.77411294",
            "sentiment_compound": 0.694
        },
        {
            "id": "h0sns0c",
            "score": 3,
            "text": "I know you all dont want to hear this, but the republicans have won. Manchin has thrown his hat in with them. Our Dem leaders are feckless cowards with no spine. In 24 all branches will be controlled by R's. There are no longer consequences for lawlessness unless you are poor. We are simply now a third world country masked as a 1st. In the next few years the mask will fall off. If I could leave I would, but being poor in this nation is a death sentence, and a slow one.",
            "title_similarity": "0.73395777",
            "sentiment_compound": -0.9344
        },
        {
            "id": "h0snz0r",
            "score": 5,
            "text": "It's all out in the open now isn't it... Openly bragging about assaulting people's right to vote and democracy itself. Un-American scum.",
            "title_similarity": "0.56855595",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0sofmp",
            "score": 3,
            "text": "More electoral fraud from the losers crying about voter fraud. Projection as always.",
            "title_similarity": "0.5972551",
            "sentiment_compound": -0.9369
        },
        {
            "id": "h0sot1l",
            "score": 1,
            "text": "Meaning we're going to lose the next election if we don't put the fix in now. Done and done.",
            "title_similarity": "0.690756",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0sp9a0",
            "score": 1,
            "text": "“We don’t hate people of color.   We just like white people better.”",
            "title_similarity": "0.2981791",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0sq54o",
            "score": 2,
            "text": "It seems like we need to move national elections for national offices including the senate and house to the national government … it is clear state governments cannot be trusted to run unbiased elections",
            "title_similarity": "0.66983676",
            "sentiment_compound": 0.3498
        },
        {
            "id": "h0sqe4c",
            "score": 2,
            "text": "This guy should have been in jail a decade ago.",
            "title_similarity": "0.5659598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0sqere",
            "score": 3,
            "text": "Well, people are right about the election being rigged. It's just that the riggers lost.",
            "title_similarity": "0.6339147",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0sqroy",
            "score": 1,
            "text": "I hate this guys face. I hope ——- ——- ——-. It’s Sunday so I won’t say it.",
            "title_similarity": "0.5210438",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0sqynv",
            "score": 4,
            "text": "And he says it like it's a good thing. They know they're not being democratic. They know the people don't want this. They don't care. Power has corrupted them.",
            "title_similarity": "0.53082025",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h0srsz9",
            "score": 2,
            "text": "So he admits to state sanctioned election tampering and nothing happens?",
            "title_similarity": "0.56093633",
            "sentiment_compound": 0.3566
        },
        {
            "id": "h0ssbsv",
            "score": 2,
            "text": "I doubt that, but keep admitting stuff",
            "title_similarity": "0.20330763",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h0sskim",
            "score": 2,
            "text": "You have to understand my complete and utter jaded body existing in a world where you can admit to committing a crime and just continue working your job where that crime should get you fired.\n\nPlz excuse me as I just walk over here with my head down and feeling hopeless.\n\nIf these people are NEVER held accountable, why the fuck do you think I would want to waste my energy caring?",
            "title_similarity": "0.50777197",
            "sentiment_compound": -0.9324
        },
        {
            "id": "h0ssnal",
            "score": 2,
            "text": "So, he's admitting voter suppression",
            "title_similarity": "0.52426475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0st8fv",
            "score": 1,
            "text": "They have a tendency to tell on themselves. But it’ll catch up with them very soon.",
            "title_similarity": "0.22674909",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0stl5t",
            "score": 1,
            "text": "Duh.",
            "title_similarity": "-0.08453197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0su326",
            "score": 2,
            "text": "Texas AG: hundreds of thousands of voters were disenfranchised in the past election",
            "title_similarity": "0.56214416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0su3wh",
            "score": 1,
            "text": "That’s the fucking point.",
            "title_similarity": "-0.023371655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0suqqo",
            "score": 3,
            "text": "So the AG just admitted voter fraud. Only way repubs win is by cheating.",
            "title_similarity": "0.662385",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0svb4h",
            "score": 3,
            "text": "Sooo, This makes the extremely important point that we all HAVE to vote no matter what if we want to keep any semblance of a democracy. These scumbag \"conservative\" wanks will steal and cheat whenever, however and to whomever as long as they benefit exclusively. They need to be stopped at every turn every time. They won't stop, they never stop, so we can't either.",
            "title_similarity": "0.5468286",
            "sentiment_compound": -0.6375
        },
        {
            "id": "h0svdw1",
            "score": 2,
            "text": "He's a known criminal that has never been on trial because of \"jurisdictional\" issues holding up everything indefinately until the statue of linitations runs out.",
            "title_similarity": "0.55007654",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0svj2h",
            "score": 3,
            "text": "and they are PROUD of that??? Really?",
            "title_similarity": "0.048810035",
            "sentiment_compound": 0.6997
        },
        {
            "id": "h0sw6kh",
            "score": 5,
            "text": "It sounds like Republicans admitting to election fraud",
            "title_similarity": "0.617368",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0swpnt",
            "score": 2,
            "text": "Translation:  “if everyone had been able to vote more easily, trump would have lost!”",
            "title_similarity": "0.7994799",
            "sentiment_compound": 0.4561
        },
        {
            "id": "h0swqx9",
            "score": 1,
            "text": "This is clearly partisan corruption.",
            "title_similarity": "0.29913116",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0syj63",
            "score": 1,
            "text": "‘Lost” this title is deceiving.",
            "title_similarity": "0.32305235",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0t169g",
            "score": 1,
            "text": "oh this isn't a Pavlovian knee-jerk post at all!",
            "title_similarity": "0.2955367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0t1gjy",
            "score": 6,
            "text": "Because it bears repeating, I will keep repeating it until I am blue in the face.\n\nVoting matters.\n\nThe reason the impeachment hearings in the House, and the \"trial\" in the Senate were able to happen at all is because Democrats won in 2018.\n\nVoting matters, and that is why Republicans actively try and keep people from voting, through voter intimidation, suppression, and gerrymandering, among other things.\n\nThe 2018 midterms saw the highest voter turnout for a midterm election in over 50 years. In some districts turnout was as high as 60%, and some districts had higher turnout than during the last presidential election. [1]\n\nDemocrats gained 40 seats in the House of Representatives. [2]\n\nDemocrats also picked up seven governorships in 2018, and two more in 2019, in Kentucky and Louisiana. [3][4][5]\n\nDemocrats picked up more than 300 seats in state legislatures, and over half of the Attorney General's seats in states across the country. In the states where Democrats did not get outright control of the state legislature, they were able to, in most cases, break Republican super-majorities. And in 2019, Democrats took full control of the Virginia state house for the first time since 1994.[6][7]\n\nAgain, voting matters.\n\nIf voting didn't matter, then Republicans in Arizona wouldn't have filed a lawsuit to prevent mail-in ballot counting in a very tight Senate race. [8]\n\nIf voting didn't matter, then Republicans in Florida wouldn't have filed a lawsuit to prevent a recount in a very close governor and Senate race. [9]\n\nIn Georgia, voters actually had to file a lawsuit in order to get Brian Kemp to resign as Secretary of State, so he would not be overseeing voting counts and recounts in that state. Which is something he should have done to begin with anyway in order to avoid conflicts of interest. [10]\n\nIf voting didn't matter, Georgia and Wisconsin wouldn't be attempting to purge 309,000 and 234,000 voters, respectively, from the rolls in their states. [11]\n\nIf voting didn't matter then the governor of Texas would not have ordered the removal of mail-in ballot drop boxes all over the state, which would have left one drop box per county. [12]\n\nIf voting didn't matter, Republicans in Texas (again) would not have attempted to get a judge to toss out 127,000 legally cast ballots. [13]\n\nIf voting didn't matter Trump would not have screwed around with the post office in an attempt to hinder mail-in votes. [14]  \n\nIf voting didn't matter then Ken Paxton would not have tried so hard to keep Texans from voting in 2020, which he now freely admits helped Trump win in Texas. Paxton's interference probably helped John Cornyn keep his Senate seat as well. [15]   \n\nThe previous list doesn't even take into account the new voter suppression laws that have been passed in Georgia, Florida, Utah, and Wyoming among others, or the laws that have been drafted but have yet to go through their respective state houses.\n\nBecause it bears repeating.\n\nVoting matters. If voting didn't matter the Republican party would not spend so much time and money attempting to keep people from voting.\n\nGo. Vote.\n\nSources:\n[1]https://www.npr.org/2018/11/08/665197690/a-boatload-of-ballots-midterm-voter-turnout-hit-50-year-high  \n[2]https://www.nytimes.com/interactive/2018/11/06/us/elections/results-house-elections.html  \n[3]https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2018/11/09/so-much-changed-in-statehouses-this-week-heres-what-it-all-means  \n[4]https://www.nbcnews.com/politics/2020-election/elections-kentucky-mississippi-test-trump-s-political-power-n1075581  \n[5]https://www.nbcnews.com/politics/elections/louisiana-gov-john-bel-edwards-wins-re-election-blow-trump-n1084236  \n[6]https://www.washingtonpost.com/politics/democrats-gain-hundreds-of-legislative-seats-and-secure-majority-of-state-attorneys-general/2018/11/07/cef1ebd6-e2aa-11e8-ab2c-b31dcd53ca6b_story.html  \n[7]https://apnews.com/article/87ba998f09fd43359011e64fe0e68ad2  \n[8]https://www.nbcnews.com/politics/elections/arizona-gop-sues-limit-mail-ballots-senate-race-n933866  \n[9]https://thehill.com/homenews/campaign/415852-scott-sues-broward-supervisor-of-elections-as-florida-senate-race-spirals  \n[10]https://www.cnbc.com/2018/11/06/voters-file-lawsuit-to-stop-georgia-gov-candidate-kemp-from-overseeing-election.html  \n[11]https://www.washingtonpost.com/nation/2019/12/17/georgia-purged-voters-its-rolls-its-second-state-make-cuts-less-than-week/  \n[12]https://www.independent.co.uk/news/world/americas/us-election/texas-mail-in-ballot-drop-off-vote-2020-election-b744020.html  \n[13]https://slate.com/news-and-politics/2020/10/texas-drive-through-voting-throw-out-ballots.html  \n[14]https://apnews.com/article/ece1f6e9cea1b2aa0a8c6af7ca003f26  \n[15]https://www.newsweek.com/texas-ag-says-trump-wouldve-lost-state-if-it-hadnt-blocked-mail-ballots-applications-being-1597909",
            "title_similarity": "0.6788479",
            "sentiment_compound": 0.9083
        },
        {
            "id": "h0t1neh",
            "score": 1,
            "text": "He was that bad💀they literally made voting lines long asf, far from POC community and etc",
            "title_similarity": "0.44887507",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0t3klm",
            "score": 1,
            "text": "That's just not true",
            "title_similarity": "0.11207188",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h0t516t",
            "score": 2,
            "text": "So they cheated.",
            "title_similarity": "0.21742037",
            "sentiment_compound": -0.5542
        },
        {
            "id": "h0t606l",
            "score": 1,
            "text": "LOL & yet the GQP is still trying to sell this self-professed voter suppression as legislation to protect “election integrity”? The hypocrisy is mind blowing. They should probably stay away from concepts they very clearly don’t understand or respect & just go with saying the quiet part out loud. Nobody buyers s the act anymore- not that many of us did to start with",
            "title_similarity": "0.7279241",
            "sentiment_compound": 0.9047
        },
        {
            "id": "h0t64m4",
            "score": 1,
            "text": "How about we just don’t trust anything a public official says. \n\nThey have a history of being bought.",
            "title_similarity": "0.54546523",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0t6rxq",
            "score": 1,
            "text": "Republicans dislike large voter turnout.\n\n\"I don't want everybody to vote. Elections are not won by a majority of the people. They never have been from the beginning of our country and they are not now. As a matter of fact, our leverage in the elections quite candidly goes up as the voting populace goes down.\"\n\nQuoting Paul Weyrich",
            "title_similarity": "0.7477031",
            "sentiment_compound": -0.6927
        },
        {
            "id": "h0t7qwc",
            "score": 3,
            "text": "So stupid that Texas was able to block the votes of Americans.... should be illegal",
            "title_similarity": "0.7670475",
            "sentiment_compound": -0.8805
        },
        {
            "id": "h0t9zg0",
            "score": 1,
            "text": "So again the only way GOP can win is to disenfranchise LEGAL voters who need other was to vote. It they are going to stop mail in voting stop all Mail In Voting including absentee ballots? But off course don't do that because it will disenfranchise another group of voters.\n\nWhat was done was legal. This is why there were Federal laws about voter suppression the grandfathered out a few years ago. They were civil rights laws. And the thought was after 50 years you won't need these. Well we still do.",
            "title_similarity": "0.796208",
            "sentiment_compound": -0.0527
        },
        {
            "id": "h0tahuz",
            "score": 1,
            "text": "Keep dreaming in you special universe.",
            "title_similarity": "0.07901313",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0taty2",
            "score": 1,
            "text": "I cannot stand the fucking gop",
            "title_similarity": "0.31948254",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0tcw2b",
            "score": 1,
            "text": "Sq",
            "title_similarity": "-0.055805378",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0tdh3u",
            "score": 1,
            "text": "IOWS, Republicans can't win elections without killing the right to vote and democracy.",
            "title_similarity": "0.75056225",
            "sentiment_compound": 0.1139
        },
        {
            "id": "h0te9ju",
            "score": 2,
            "text": "They keep saying the quiet part out loud.",
            "title_similarity": "0.05132506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ter75",
            "score": 1,
            "text": "I guess that shows the abymal magnitude with which he lost the popular vote as well as the electoral college vote.  #morejerrymanderingonyourdime",
            "title_similarity": "0.6696552",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0tfo3v",
            "score": 1,
            "text": "And yet the Republican president Joe Manchin...oops, i mean democrat senator???  He still plays politics and just made a statement that he will vote down both the voting rights bill and any changes to the filibuster.  I remember his interview saying he wanted to make it harder to use like before...but when all other democrats agree he's like \"You thought I was serious\"???  More like \"Are you kidding me?  Not with what the GOP and big corporations are paying me!\"",
            "title_similarity": "0.74997145",
            "sentiment_compound": 0.9126
        },
        {
            "id": "h0tj8r2",
            "score": 3,
            "text": "Just from personal experience living in Texas. I requested a mail in ballot applications and it took so long for the applications to come that there wasn't time for it to get received and approved prior to election day. I ended up just masking up and voting in person but if i hadn't physically been able to I wouldn't have been able to vote so wouldn't surprise me if there were a lot of people who had the same problem",
            "title_similarity": "0.7255331",
            "sentiment_compound": -0.6472
        },
        {
            "id": "h0tja0o",
            "score": 1,
            "text": "I’ll take $500 for things we already knew",
            "title_similarity": "0.33409053",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0tjasx",
            "score": 1,
            "text": "Lol sounds like someone can’t get over a loss",
            "title_similarity": "0.30751488",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0tjjan",
            "score": 2,
            "text": "Imagine saying the quiet part so loudly, yet suffering zero consequences.\n\nVoting is a right, it is a right that forms part and parcel of the social contract.\n\nDenying someone that right is not something to be done lightly and forcing people to vote in person during a pandemic?\n\nShould be considered far more criminal than even the actions taken to deny postal vote rights.",
            "title_similarity": "0.64671236",
            "sentiment_compound": -0.8969
        },
        {
            "id": "h0tmmp0",
            "score": 2,
            "text": "That’s the only way Dipshidiot can win cheat",
            "title_similarity": "0.44537812",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0tsnda",
            "score": 3,
            "text": "Texas: Suppress voters,\nTrump supporters: Democrats cheated.\nPretty ironic if you ask me.",
            "title_similarity": "0.78109956",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0tyr06",
            "score": 3,
            "text": "did he ... did he just ADMIT to voter fraud?!?!?!?",
            "title_similarity": "0.6095988",
            "sentiment_compound": -0.6253
        },
        {
            "id": "h0tz3vz",
            "score": 3,
            "text": "Always amazed when they say the quiet part out loud. \n\nAlways amazed when nothing happens. \n\nMaybe amazed isn’t the right word anymore.",
            "title_similarity": "0.35691792",
            "sentiment_compound": 0.582
        },
        {
            "id": "h0u09jh",
            "score": 2,
            "text": "I mean this guys is so corrupt it’s comical he’s still in power. \n\nJust Google him. It’s insane.",
            "title_similarity": "0.4897833",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0u3ffa",
            "score": 1,
            "text": "Republicans = complete crooks",
            "title_similarity": "0.38835892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u3poq",
            "score": 1,
            "text": "This guy is an indicted criminal. How the fuck is he still in office?",
            "title_similarity": "0.42228216",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h0u7rd4",
            "score": 1,
            "text": "Fucking radical right !",
            "title_similarity": "0.21180284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u9nig",
            "score": 1,
            "text": "Who stole my pen?",
            "title_similarity": "0.3186054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ub85l",
            "score": 1,
            "text": "Nobody believes that",
            "title_similarity": "0.21161048",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uercr",
            "score": 1,
            "text": "They can't get away with this.tell me it is going to stop",
            "title_similarity": "0.37837416",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0uiarn",
            "score": 1,
            "text": "I’m calling BS.",
            "title_similarity": "0.13405277",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uixvo",
            "score": 2,
            "text": "What irony!  Rep. blocked votes in Tex., while insisting that ALL votes be counted elsewhere!",
            "title_similarity": "0.69967765",
            "sentiment_compound": -0.4374
        },
        {
            "id": "h0uk9kz",
            "score": 3,
            "text": "No shit. Thanks for admitting about how evil and conniving Texas GOP is.",
            "title_similarity": "0.5096297",
            "sentiment_compound": -0.597
        },
        {
            "id": "h0ukl3f",
            "score": 3,
            "text": "I understand that the paragon of virtue, honesty and integrity, Roger Stone,  coined the term Stop The  Steal in time for the 2016 election. It has been repeated over and over, ever since then by Donald Trump , Fox (of course), the late and unlamented Rush Limbaugh and many others. It has been parroted so many times now that it is part of standard dialogue, and countless people believe it. But people should be concerned at the actions of the Republican party..closing down poliing places, seeking to gain complete control of the election process, quietly and behind the scenes, legislating electoral districts out of existance, that farce with de Joy and USPS. And drivelling on about removing dead people off the electoral roll. How many, I speculate? Tens? hundreds? thousands?\nI occasionally wonder on the motives of the Republicans and their well-financed aiders and abetters, the right wing media..do they wish the DNC off the face of the earth along with all other inconvenient people? And then America would be a truly great Utopia full of wealthy, enterprising, caring sharing people, ? We can all have our delusions..",
            "title_similarity": "0.69726944",
            "sentiment_compound": 0.9849
        },
        {
            "id": "h0umhxk",
            "score": 3,
            "text": "Trump is a loser he was born a loser that just happened to be born into money. I would never want him to handle business for me that's for sure. Why do you think he didn't want to show his taxes.",
            "title_similarity": "0.7402542",
            "sentiment_compound": -0.7135
        },
        {
            "id": "h0uojoh",
            "score": 1,
            "text": "Exactly. The Republicans are about preventing democracy. They need to be stopped with all necessary force.",
            "title_similarity": "0.58095217",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0ute9m",
            "score": 1,
            "text": "Let me guess: there will be no fraud investigation or audit done here.  #hypocrisy",
            "title_similarity": "0.48270205",
            "sentiment_compound": 0.4717
        },
        {
            "id": "h0uxhw7",
            "score": 2,
            "text": "> \"We would've been one of those battleground states that they were counting votes in Harris County for three days and Donald Trump would've lost the election.\"\n\nExcept trump did lose...",
            "title_similarity": "0.8148011",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h0uxjdx",
            "score": 1,
            "text": "Haha...",
            "title_similarity": "-0.09365201",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0v0yjn",
            "score": 2,
            "text": "Voting should be the right of every single citizen. If a person wakes up on voting day and decides...'you know what...I want to vote today'....he/she should be able to walk into a polling place...produce I.D and vote. It should never be illegal to send out mail-in ballots...regardless of if they were requested or not. If the recipient doesn't want one, they can easily discard it.",
            "title_similarity": "0.5805406",
            "sentiment_compound": 0.5271
        },
        {
            "id": "h0v2d3r",
            "score": 2,
            "text": "I’ve got a question for someone with more familiarity with Texan law. I would imagine that he’s arguing those applications were fraudulent, right? That is the whole reasoning behind these laws, so either he’s saying that they blocked a bunch of people from voting legally (which would be honest, but really dumb) or that they prevented a fraud that would have flipped the state. Thing is, my understanding is that even applying under false pretenses counts as voter fraud. As such, shouldn’t he be seeking charges against these thousands of people he’s claiming committed fraud? Wouldn’t anything less be an admission that this was just an attempt to suppress the vote?",
            "title_similarity": "0.79269505",
            "sentiment_compound": -0.9752
        },
        {
            "id": "h0v8cny",
            "score": 3,
            "text": "They don’t care about not saying the quiet part lid anymore, do they?",
            "title_similarity": "0.38973403",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vabcj",
            "score": 3,
            "text": "So Biden would've had a massive landslide",
            "title_similarity": "0.49627262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vutpw",
            "score": 3,
            "text": "The Republican Party is anti democracy we all need to understand and attempt to treat it as such.",
            "title_similarity": "0.6098721",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0xea5o",
            "score": 3,
            "text": "They're saying the loud part out loud again.\n\nIt's been so long since it's been called the quiet part. It's just always out loud now. Utterly shameless.",
            "title_similarity": "0.33410037",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h0xnbz6",
            "score": 1,
            "text": "Throw this back at the next relative who tells you that these voter suppression bills are intended to “prevent fraud.”",
            "title_similarity": "0.72651446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xw0vk",
            "score": 1,
            "text": "I guess when your slow moving coup turns into a sprint toward autocracy, you just feel empowered to say the quiet parts out loud. smfh",
            "title_similarity": "0.47409084",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11illm",
            "score": 3,
            "text": "A person can open an app on their phone, using airport wifi, and transfer millions of dollars. Invest. Subscribe. Purchase. Legally sign. Video chat with grandma in Scotland.\n\nYet we have idiots who believe a mail in ballot should be illegal.\n\nThose mail in ballots that were very critically analyzed, audited and scanned with UV lights for bamboo... With no major finds.\n\nDumb.",
            "title_similarity": "0.6711303",
            "sentiment_compound": -0.8393
        },
        {
            "id": "h1ecq86",
            "score": 1,
            "text": "If it can't be verified who's voting, if your registered, if they are xerox copies etc...they can't be counted. Same rules and process for everyone.  One vote per registered voter, period. Wtf is the issue.",
            "title_similarity": "0.6612965",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1hxnyk",
            "score": 3,
            "text": "If only \"I committed to voter suppression to ensure my personal victory over my nations democracy\". Was a person instead of an entire political party.",
            "title_similarity": "0.7006643",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1li7mu",
            "score": 2,
            "text": "Texas u worry me",
            "title_similarity": "0.40579775",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5h3i15",
            "score": 1,
            "text": "Present the proof. Show it. Let’s see it. You got nothing.",
            "title_similarity": "0.21891813",
            "sentiment_compound": 0.0
        }
    ]
}