{
    "Walmart, McDonald's, and Amazon are among companies celebrating Pride after donating hundreds of thousands of dollars to politicians who voted against the Equality Act\n": [
        {
            "id": "h0tixeo",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.41073632",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h0ugfel",
            "score": 0,
            "text": "Why we have to celebrate someone’s sexuality is beyond me \nIt’s not an accomplishment or something you should be condemned or praised for.",
            "title_similarity": "0.204857",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0u9jyk",
            "score": -17,
            "text": "Nothing gets my dick harder than seeing the left eat its own. Love it.",
            "title_similarity": "0.3571422",
            "sentiment_compound": 0.7847
        },
        {
            "id": "h0tv4rg",
            "score": 27,
            "text": "They all donated *more* to candidates who voted *for* the Equality Act. But nothing performs better on r/politics than \"company you don't like gave money to politician who voted in a way you don't like,\" regardless of context or nuance.",
            "title_similarity": "0.6908771",
            "sentiment_compound": -0.8146
        },
        {
            "id": "h0tueod",
            "score": -20,
            "text": "nobody cares",
            "title_similarity": "-0.1525383",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0uqmvm",
            "score": 3,
            "text": "So the equality act would have allowed parents to change the sex of their minor children and force religious institutions to hire people that did not agree with their religious beliefs.  \n\nFYI: A person can't even get fixed until they are 30 or over 21 with at least 2 kids of opposite sex.  A person can be charged with statutory rape if they have sex with a person under 16, even if it is a 16 year old girl and 15 year old boy, the female could be charged for a sex crime, which I have seen.  As a supervisor in an international manufacturing plant, I can tell you 20 year old's are just over grown teenagers.  Like I had to break up a pink belly contest last week, for real.  I won't mention what I did in my 20's.  \n\nWith these facts in mind, why would you let a minor or the parents change his/her sex, which is unrepairable?  Any one could have hormonal imbalances, psychological issues, ex-spouse issues, etc...\n\nConclusion, These companies feel kids need to be kids and go through these issues by themselves without any outside influences, which the so called equality act would have forced upon them.",
            "title_similarity": "0.5744339",
            "sentiment_compound": -0.8974
        },
        {
            "id": "h0tn38j",
            "score": 0,
            "text": "Yeah, they're \"celebrating pride\". It's slightly different.",
            "title_similarity": "0.1047384",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0uasm7",
            "score": -13,
            "text": "It seems like someone could support Pride month without voting for gender identification as a protected category.  One can support rights to be who one is, without changing the law.",
            "title_similarity": "0.32610226",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h0ucp05",
            "score": 1,
            "text": "They support both sides because it’s necessary for them to push forward their primary object of making money.\n\nIt’s similar to me saying I support churches for feeding the hungry but I’m against proselytizing.  People and especially large organizations can have good and bad traits.\n\nWhat I would do is ask for them to increase their donations by the amount they gave those politicians toward organizations that would fight against those politicians goals.",
            "title_similarity": "0.6077975",
            "sentiment_compound": 0.09
        },
        {
            "id": "h0ui6b1",
            "score": 0,
            "text": "“Equality” Act",
            "title_similarity": "-0.037080772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0tlb59",
            "score": 20,
            "text": "Fuck pinkwashing! Fuck rainbow capitalism!\n\nSupport etsy shops or local artisans to get your rainbow merch fill. \n\nEdit: Also never take their free branded products during pride events. They entice you with these items as a visual marketing ploy.",
            "title_similarity": "0.5059077",
            "sentiment_compound": -0.734
        },
        {
            "id": "h0ujf0m",
            "score": 0,
            "text": "Why are people upset? These corporations are doing the exact same thing the 'people' do every year during Pride month. It's all pandering, top to bottom.",
            "title_similarity": "0.6731335",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0ulfsm",
            "score": 0,
            "text": "Yo is that 6ix9ine",
            "title_similarity": "0.018274762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uy0bo",
            "score": 0,
            "text": "Nobody cares now where are the kittens a d puppies!",
            "title_similarity": "0.17936936",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h0v5d85",
            "score": 0,
            "text": "You’d figure that an article so interested in who supports and doesn’t support the Equality Act would take a second to explain what it is.",
            "title_similarity": "0.35754305",
            "sentiment_compound": 0.8267
        },
        {
            "id": "h0v5gic",
            "score": 0,
            "text": "this is a month of un ending asinine virtue signalling",
            "title_similarity": "0.27417144",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0uvwyn",
            "score": 4,
            "text": "Biological men shouldn’t play in women’s sports",
            "title_similarity": "0.22746499",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0tjjc6",
            "score": 9,
            "text": "What corporations don't care about us? What a scandal! /s",
            "title_similarity": "0.35233864",
            "sentiment_compound": -0.7022
        },
        {
            "id": "h0trmvf",
            "score": -11,
            "text": "*flashy rainbow dancer*  \nWe will show you our pride,  \nAs we stand by your side.  \nOur company agrees,  \nYour freedom means a thing.  \nSo don't forget to buy,  \nAs we champion your side.  \nIsn't it great that we elate,  \nYour pride that we celebrate.  \nOnce a year, without fear,  \nWe'll show you our revere,  \nTowards all your lives.    \n  \n*switches to grey back room with phat cigar smoke*    \nISN'T IT GREAT!  \nALL THE MONEY WE MAKE!  \nFOR A MASKFUL LIE!  \nWE BRIBE POLITICITIANS!  \nMAKE HORRENDOUS ADDITIONS!  \nALL FOR THE DUE!  \nTHAT YOUR MONEY COMES TO!  \nFATTEN OUR WALLETS!  \nTHERE'S NO WAY TO STOP US!  \nWE'LL TAKE AND TAKE!  \nSO WE CAN ALL MAKE!  \nMORE MONEY FOR OUR SIDE!  \nBEND THE RULES SO WE ABIDE!  \n  \n*cuts back to colorful rainbow dance*    \nSo don't forget, we regret,  \nNot starting this sooner.  \nBecause you and your views,  \nAre summed up with colors!  \nWe support effort forth,  \nTo chant it all louder!  \nSo you can all buy, buy, buy,  \nDoesn't matter about your lives, lives, lives.",
            "title_similarity": "0.6266998",
            "sentiment_compound": 0.7233
        },
        {
            "id": "h0tyjmi",
            "score": 2,
            "text": "\"Companies donate to politicians' campaigns hoping to influence lawmakers on legislation that might impact business, from immigration to minimum wages.\"\n\nLiterally the definition of corruption.",
            "title_similarity": "0.66088057",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0umdbv",
            "score": -2,
            "text": "Hey guess what, people can have differing opinions on different subjects.\n\nSomeone who pro pride doesn’t have to believe in something else.\n\nGuess what, people can and SHOULD have individual beliefs.\n\nLet’s take a look at how successful liberal policy is. Look at California. One of the highest unemployment and homelessness states. Look at Texas. Highest employment and better life.\n\nWhy? Less handouts. As much as you think government programs are good, so much of it is not used well. Ask any government contractor, governments are the least efficient at literally everything.\n\nGet out of here far right and far left individuals.\n\nA to B and B to C does not mean A must equal C",
            "title_similarity": "0.59814775",
            "sentiment_compound": 0.7144
        },
        {
            "id": "h0u71v9",
            "score": 5,
            "text": "Playing both sides , Just like politicians",
            "title_similarity": "0.30641818",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0ts404",
            "score": 1,
            "text": "Is it wrong to think that those donations are done more so as taxable write offs linked to positive community image vs the values of those leading the global company, xyz?",
            "title_similarity": "0.49971807",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0u8rxl",
            "score": 1,
            "text": "I love you for pointing this out. When are we getting married?",
            "title_similarity": "0.3286447",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0ucuot",
            "score": 1,
            "text": "Well that’s gay .",
            "title_similarity": "0.028692883",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0ukwhw",
            "score": -1,
            "text": "Could we please all get together and boycott these places? I have been for years. It’s frustrating to see how Amazon is like a part of American culture now. It satisfies that american need for instant gratification. I rarely go shopping anymore for things that I don’t absolutely need, and I’m surviving.",
            "title_similarity": "0.63563895",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0uupaf",
            "score": 1,
            "text": "Don’t worry. Trump I, First Emperor of Murica, will appoint two friends to fill in for Clarence and Alito in 2024.",
            "title_similarity": "0.4879154",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0vqwy6",
            "score": -1,
            "text": "It’s all virtue signalling. To be fair, and this is probably gonna catch me some downvotes: Pride MONTH makes no sense. Celebrating your sexuality in and of itself makes no sense. \n\nIf someone suggested we’d take a month to celebrate being straight, they’d be strung up..",
            "title_similarity": "0.46277487",
            "sentiment_compound": 0.691
        },
        {
            "id": "h0vycz0",
            "score": -1,
            "text": "r/gatekeeping who can celebrate pride",
            "title_similarity": "0.14414498",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0u5ny3",
            "score": 3,
            "text": "Uh… duh? People need to stop expecting corporations to do anything other than what makes them richer. Pride has become a marketing gimmick anyway.",
            "title_similarity": "0.4919966",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0ton23",
            "score": 41,
            "text": "I don’t go to mcdonalds because they like the gays, i go there because i want a McDouble and a dollar sprite",
            "title_similarity": "0.56339765",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0trom6",
            "score": 42,
            "text": "No companies actually care about pride, it’s all just to make money and keep out of hot water. Hell, no companies actually care about anything until it makes them money, just the way the game is played",
            "title_similarity": "0.3879481",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0uhkae",
            "score": 5,
            "text": "It's possible to support politicians that have some interests that are different than your own, and be free also to broadcast support for opinions which politicians that you support, do not. I can only speak for myself, that there has never been a politician that I've agreed 100% on all issues with.",
            "title_similarity": "0.505285",
            "sentiment_compound": 0.926
        },
        {
            "id": "h0u4bfs",
            "score": 1,
            "text": "That’s why I always view literally any political message a company tries to send as virtue signaling.",
            "title_similarity": "0.44304043",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0u50nq",
            "score": 3,
            "text": "It would probably be more useful if Amazon just paid a few dollars in taxes.",
            "title_similarity": "0.4918796",
            "sentiment_compound": 0.6318
        },
        {
            "id": "h0u57wm",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.13217586"
        },
        {
            "id": "h0ugd9a",
            "score": -9,
            "text": "Does anyone celebrate not being gay? How about celebrating being a productive human that can create other humans in a loving family?",
            "title_similarity": "0.41490835",
            "sentiment_compound": 0.9295
        },
        {
            "id": "h0uagmg",
            "score": 0,
            "text": "Not surprised but good to know where to avoid if I can.",
            "title_similarity": "0.04684464",
            "sentiment_compound": -0.7385
        },
        {
            "id": "h0ualdp",
            "score": 0,
            "text": "They smile in your face, all the time want to take your place, their backstabber’s",
            "title_similarity": "0.27128404",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0ubc1h",
            "score": 0,
            "text": "If you take your social queues from a corporation then you're an absolute clown. I bat for both teams myself, but I still will demolish some chic fil a because I don't base my views off of what corporations do.",
            "title_similarity": "0.49553287",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h0ubh8r",
            "score": 0,
            "text": "\"In other news....water is found to be wet.\"",
            "title_similarity": "0.016854241",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ubo1y",
            "score": 0,
            "text": "Their Fault then is in \"CELEBRATING\" PRIDE !\n\nWhat Exactly are These People Proud of, and Who The Hell Do They THINK Gives a Damn WHAT They Are ?!😠\n\nThey haven't a Clue as to what keeping ones Personal Life TO THEMSELVES Means.\nCompletely Self Centered, and Ego Driven.",
            "title_similarity": "0.41048062",
            "sentiment_compound": -0.497
        },
        {
            "id": "h0ucyby",
            "score": 0,
            "text": "What dose the money even go  to 😂",
            "title_similarity": "0.21876231",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ucye4",
            "score": 0,
            "text": "This trend will die soon.",
            "title_similarity": "0.042288538",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0udjsp",
            "score": 0,
            "text": "Stop spreading disinformation.\n\nMega corporations like Walmart, McDonald's and Amazon support Republicans, not Democrats!\n\nBecause it's still 2007 and my brain is incapable of tracking the establishment shift.",
            "title_similarity": "0.6700437",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h0ufvj1",
            "score": 0,
            "text": "Companies should not be in politics.  They exist to serve their owners and other stakeholders.",
            "title_similarity": "0.28652862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uiq0w",
            "score": 0,
            "text": "Well they are smart to keep everybody happy.",
            "title_similarity": "0.11504424",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0uj80f",
            "score": 0,
            "text": "So stunning. So brave.",
            "title_similarity": "0.011097225",
            "sentiment_compound": 0.8219
        },
        {
            "id": "h0ujcme",
            "score": 0,
            "text": "Ha.. you think a corporation, a body of people that work together to earn profits for investors, actually cares about anything? Anyone?  The woke brands don’t care.  They care if YOU actually believe they care enough to give them your money.   Wake up..",
            "title_similarity": "0.5527662",
            "sentiment_compound": 0.9419
        },
        {
            "id": "h0ujge9",
            "score": 0,
            "text": "Neoliberalism",
            "title_similarity": "0.016636394",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ujyma",
            "score": 0,
            "text": "Amazon isn't worth it. You should cancel your prime membership",
            "title_similarity": "0.3016463",
            "sentiment_compound": -0.242
        },
        {
            "id": "h0um2mi",
            "score": 0,
            "text": "Guys, lets boycott Walmart, Mcdonalds and Amazon.\n\nIf you are for equality that is... if you're into stuff like slavery, keep using them.\n\nCause if it was 200 year ago, we all know these 3 companies would spend millions to prevent Slavery from being abolished.",
            "title_similarity": "0.71246696",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h0umoc9",
            "score": 0,
            "text": "If #Equality4all is the true advent of this PR stunt then why stagnant wages for the past five decades?",
            "title_similarity": "0.5831721",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0v5lf2",
            "score": 0,
            "text": "They got all your first world problem money !! hahahHhha suckers….",
            "title_similarity": "0.45301116",
            "sentiment_compound": -0.508
        },
        {
            "id": "h0v732t",
            "score": 0,
            "text": "Imagine boiling a politician or person down to one bill that you haven’t even read",
            "title_similarity": "0.4651677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vrvon",
            "score": 0,
            "text": "No corporations, and no cops, simple.",
            "title_similarity": "0.06283626",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2bokbg",
            "score": 0,
            "text": "Virtue signalling! System is broken.",
            "title_similarity": "0.09234586",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h0tl3b4",
            "score": 10,
            "text": "It's because these politicians support other policies that these Corporations want. \n\nThis is probably why Corporate campaigns during these awareness months are just nonsense at the end of the day. \n\nWhile Corporations are adding to the overall awareness of gay rights by providing rainbow colored cogs, they honestly couldn't care less. They just want your money. And this isn't a bad thing, it's what Corporations do, they're profit driven. It's \"who they are\".\n\nAppreciate the corporate pride campaigns for the global awareness they're bringing to the issues, but that's about as far as one ought to see it as. If you're expecting purity, you're foolish.",
            "title_similarity": "0.69642574",
            "sentiment_compound": 0.4817
        },
        {
            "id": "h0tk5g0",
            "score": 51,
            "text": "Pay your employees more money, assholes.",
            "title_similarity": "0.3713915",
            "sentiment_compound": -0.6682
        },
        {
            "id": "h0ub21b",
            "score": -11,
            "text": "Couldn’t care less",
            "title_similarity": "-0.12882717",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0tobmy",
            "score": 1,
            "text": "This is the best tl;dr I could make, [original](https://www.businessinsider.com/amazon-walmart-mcdonalds-companies-show-pride-donated-anti-lgbtq-politicians-2021-6) reduced by 89%. (I'm a bot)\n*****\n> As brands take to Twitter to celebrate Pride, many of the same companies donated hundreds of thousands of dollars to politicians who voted against expanded LGBTQ protections.\n\n> SEC filings show that some of the best-known companies in the US, including McDonald&#039;s, Walmart, and Amazon, have donated significant sums to politicians who voted against the bill.\n\n> As a result, these industry giants have donated hundreds of thousands of dollars to politicians who are pushing for legislation that protects LGBTQ rights, and hundreds of thousands of dollars to politicians actively working to defeat the same bills.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/ntsvr8/walmart_mcdonalds_and_amazon_are_among_companies/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~581399 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **company**^#1 **donate**^#2 **politicians**^#3 **donations**^#4 **vote**^#5",
            "title_similarity": "0.8936847",
            "sentiment_compound": 0.9531
        },
        {
            "id": "h0txv63",
            "score": 1,
            "text": "Its all about money people. Support Pride = more customers and good look. Support Republicans = tax cuts. Money is all they want and care for",
            "title_similarity": "0.62026685",
            "sentiment_compound": 0.9055
        },
        {
            "id": "h0ty2ys",
            "score": 1,
            "text": "And…we’re surprised, why?",
            "title_similarity": "-0.059634686",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0tyi3x",
            "score": 1,
            "text": "The only thing 21st century businesses did for society was devleop new targeted branding methods.",
            "title_similarity": "0.3901381",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u9myz",
            "score": -1,
            "text": "The game is rigged.",
            "title_similarity": "-0.037090145",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0uaox6",
            "score": -1,
            "text": "The worst part is companies like this, especially target, take the designs and artwork made by the community for pride and steal them for their pride merchandise with giving nothing back to the community. \n\nI mean literally 0% of the money spent on these items goes back to help the LGBTQI community, but the designs you’re purchasing from target and other places fully steal from artists in the community.",
            "title_similarity": "0.5907481",
            "sentiment_compound": -0.5704
        },
        {
            "id": "h0uc2yj",
            "score": -1,
            "text": "It’s amazing how these companies opposed equalities for the people who they relay on to operate their businesses.",
            "title_similarity": "0.53029436",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0uchv3",
            "score": 1,
            "text": "Pandering. I never fell for it.",
            "title_similarity": "0.046787966",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0udjyf",
            "score": 1,
            "text": "Biden has no problem funding Palestine where homosexuality is essentially illegal and LGBTQ people flee every year to Israel, and where honor killings are rife.  It’s not like half the people on Reddit aren’t just as hypocritical as  those corporations.  Those corps, the right wing and the left wing and teenaged redditors are all just the same hypocritical mofos, just with different power levels \n\n\nhttp://news.bbc.co.uk/2/hi/middle_east/3211772.stm",
            "title_similarity": "0.62388444",
            "sentiment_compound": -0.8946
        },
        {
            "id": "h0uhzju",
            "score": -1,
            "text": "Signal those virtues.",
            "title_similarity": "-0.079432026",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0uij5q",
            "score": -1,
            "text": "Sometimes I shit when I cum",
            "title_similarity": "0.111248754",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0uiqax",
            "score": -1,
            "text": "Listen to lotto banz -  need more by lotto banz on #SoundCloud\nhttps://soundcloud.app.goo.gl/VvfSG\n\nCheck me out",
            "title_similarity": "0.37576917",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uiu25",
            "score": 1,
            "text": "Corporations are all on-board with women's rights, feminism, metoo because a) they know that over 80% of consumption is in the hands of women, and b) the focus on women allows the corporations to shit on everything else environment, climate, voting laws, democracy all because of women and their focus on perceived victimhood.",
            "title_similarity": "0.654634",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0ujzlm",
            "score": 1,
            "text": "“Hillary Clinton is celebrating pride after decades of being against gay marriage.”",
            "title_similarity": "0.7045356",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0uk9mz",
            "score": 1,
            "text": "Walmart, McDonalds, and Amazon... Three things that are not necessary. America has become the land of the good little consumer. Do your part, buy your useless garbage. None of these companies would be as influencial as they are if people didn't keep sending them money in exchange for a promise of convenience. We did this to ourselves.",
            "title_similarity": "0.64498127",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0ukodc",
            "score": -1,
            "text": "Why does it seem like people in comments would rather go back to the \"good old days\" when no one gave a shit about pride month? Are rainbow logos really triggering you guys that much?\n\nSo what if they're pandering.",
            "title_similarity": "0.5139448",
            "sentiment_compound": 0.3313
        },
        {
            "id": "h0ulda2",
            "score": -1,
            "text": "r/ahegao",
            "title_similarity": "-0.061211254",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0umjbg",
            "score": 1,
            "text": "Sadly,  people will post all over the internet about how awful these companies are for doing things, but will not stop buying from them everyday.",
            "title_similarity": "0.5890715",
            "sentiment_compound": -0.1451
        },
        {
            "id": "h0unhfd",
            "score": 1,
            "text": "Fuck anyone and everyone who still shops at Wal-Mart, Amazon, Nestle, McDonalds, etc. I'm am so totally fucking done with being understanding and patient with these ignorant, selfish, greedy scumbags. None of these companies, or many others, have gotten a single red cent out of me in decades. This isn't about being a conscientious shopper anymore, this is about basic right and wrong, the fundamentals of basic decency.",
            "title_similarity": "0.5985789",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h0uqtdg",
            "score": 1,
            "text": "So…. Just because I vote one way doesn’t mean I can’t have friends of different beliefs or political views. \n\nThis isn’t high school any more Marsha…people and companies are complex and everything isn’t black and white.",
            "title_similarity": "0.43169945",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0usbcw",
            "score": -1,
            "text": "Is it so wrong for them to both support gay people speaking up and being proud, and donating to politicians who help their business interests? It’s not like the equality act was the only legislation lol",
            "title_similarity": "0.6296191",
            "sentiment_compound": 0.735
        },
        {
            "id": "h0uw6r7",
            "score": 1,
            "text": "This is so petty",
            "title_similarity": "-0.13691095",
            "sentiment_compound": -0.3327
        },
        {
            "id": "h0uwydc",
            "score": 1,
            "text": "No ethical consumption under capitalism. Period.",
            "title_similarity": "0.1706304",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h0uziti",
            "score": -1,
            "text": "So?",
            "title_similarity": "-0.22132742",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vaeuw",
            "score": -1,
            "text": "The Equality Act needs to be amended to protect females as a sex based class.",
            "title_similarity": "0.2168557",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0vaist",
            "score": -1,
            "text": "We should not be supporting and encouraging people to be mentally ill",
            "title_similarity": "0.14951092",
            "sentiment_compound": -0.2037
        },
        {
            "id": "h0vj933",
            "score": -1,
            "text": "Who cares? Nobody in America cares about these clowns besides unemployed leftist cucks.",
            "title_similarity": "0.36738855",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0voqmp",
            "score": 1,
            "text": "Business is business, it has nothing to do with one's sexual orientation or kinks",
            "title_similarity": "0.16839562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vpns1",
            "score": -1,
            "text": "Stop shopping !! And shut America down people we have the power👊🏽",
            "title_similarity": "0.35097983",
            "sentiment_compound": -0.4184
        },
        {
            "id": "h0vvd6b",
            "score": 1,
            "text": "Either stop buying their shit or burn them to the ground. Just stop with these worthless articles.",
            "title_similarity": "0.23076475",
            "sentiment_compound": -0.872
        },
        {
            "id": "h0wfa8l",
            "score": -1,
            "text": "Why do we make these things black and white when they’re clearly not? Voting against a specific piece of legislation doesn’t mean you can define a person’s beliefs by it. One may support LGBQT but not support other aspects of the legislation and therefore vote no. One might vote no on something, but vote yes on another issue that’s important to the company. It is extremely rare to find a politician you will agree with 100% on every policy. If you do, you’re probably being brainwashed with group think propaganda that each party puts out to gain support for their agendas, while leaving out information that’ll help you make an informed decision. I’m tired of all the assumptions, judgments, stereotypes, prejudice, etc within the political divides. I’m tired of the labels where people are labeled racist, homophobic, etc with very little information to make that call. I agree with comments here that we need to get the money/lobbying out of politics. Corporations should not get more representation than citizens.",
            "title_similarity": "0.47910535",
            "sentiment_compound": 0.5208
        },
        {
            "id": "h0u2tgp",
            "score": 379,
            "text": "If you want to support businesses during pride month, find queer-owned or supportive small businesses! \n\nFor example, [TomboyX](https://tomboyx.com/) is a company founded and owned by a lesbian couple! They make underwear, swimwear and activewear for women of all shapes and sizes.\n\nEdit: don’t spend your money on awards! Spend it on queer-owned businesses to spite rainbow capitalism!",
            "title_similarity": "0.59328866",
            "sentiment_compound": 0.811
        },
        {
            "id": "h0tn17b",
            "score": 2,
            "text": "I'm shocked, SHOCKED!   \nWell, not that shocked...",
            "title_similarity": "-0.053473312",
            "sentiment_compound": -0.3742
        },
        {
            "id": "h0u70oz",
            "score": 2,
            "text": "It’s called virtue signaling (or just plain signaling) to get all the benefits and do none of the actual work. Heck; they even work backwards while signaling to society that they are progressive and simultaneously funding the suppression of their own consumer base. These companies only care about the money they can get you to spend while also fucking you in the ass, they’re worse than politicians somehow cause at least with politicians they tell you how they will ass blast you",
            "title_similarity": "0.51552564",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0uajuh",
            "score": 2,
            "text": "It’s almost like they don’t actually support pride but want the lgbtq community to buy their stuff.",
            "title_similarity": "0.42036223",
            "sentiment_compound": 0.5579
        },
        {
            "id": "h0uf1jb",
            "score": -2,
            "text": "they're giving attention to the attention seekers, i dont see the issue",
            "title_similarity": "0.059288178",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0uf5ud",
            "score": 2,
            "text": "Not surprised at all. Americans are hypocrites.",
            "title_similarity": "0.23226708",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h0uhcj5",
            "score": -2,
            "text": "Mvmbł of,- you htpt",
            "title_similarity": "-0.003938455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhyzr",
            "score": -2,
            "text": "The left is the mainstream corporate party",
            "title_similarity": "0.4087829",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0uimzz",
            "score": -2,
            "text": "Politicians like Biden and Harris",
            "title_similarity": "0.36276954",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0ukopf",
            "score": 2,
            "text": "Damn 6ix9ine becoming the face of these big time companies.",
            "title_similarity": "0.44561258",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0umccs",
            "score": -2,
            "text": "Ah ha ha, what the fuck are you going to do about it? Boycott them? We both know you won't.",
            "title_similarity": "0.11453891",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h0un75d",
            "score": 2,
            "text": "Let’s come together and face the fact that major corporations literally just want your money, and see holding up the LGBTQ community as a silver platter of cash. It’s abhorrent that they do it and equally as abhorrent that people constantly buy into the façade.",
            "title_similarity": "0.6661271",
            "sentiment_compound": -0.836
        },
        {
            "id": "h0uwhnk",
            "score": 2,
            "text": "Everyone is blaming the corporations.  \n\nWho’s giving them all the money?",
            "title_similarity": "0.5256654",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0uwkn2",
            "score": 2,
            "text": "So by “celebrating pride,” these companies mean they’re making targeted advertisements in order to increase their stockholders’ share value…as all a company’s behaviors are meant to do.",
            "title_similarity": "0.5278667",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0v8lws",
            "score": 2,
            "text": "Maybe if you all stopped making \"MUH LGBTQXYZ\" part of your identity, big companies would stop using it to exploit you.\n\nJust a thought. Give me the downvotes. I can handle it.",
            "title_similarity": "0.4675634",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0vaea5",
            "score": 2,
            "text": "Maybe they supported those politicians for reasons other than their position on this one issue? It’s not always all about ‘the gays’",
            "title_similarity": "0.4214572",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0vba63",
            "score": 2,
            "text": "Off topic but about the photo. \n\nPlease stop with the stupid tongue out for a photo. It’s as stupid or more than duck face.",
            "title_similarity": "0.19022666",
            "sentiment_compound": -0.8765
        },
        {
            "id": "h0tl00u",
            "score": 150,
            "text": "Fake-Progressive/Woke Corporate optics.....\n\nDon't be fooled , remember....\n\n[How Walmart Persuades Its Workers Not to Unionize](https://www.theatlantic.com/business/archive/2015/06/how-walmart-convinces-its-employees-not-to-unionize/395051/) America’s largest private employer cares a lot about preventing its workers from organizing, a leaked training video reveals.\n\n[McDonald's spies on union activists](https://www.theguardian.com/commentisfree/2021/mar/02/mcdonalds-unions-workers-rights)– that's how scared they are of workers' rights\n\n[How Amazon Crushes Unions](https://www.nytimes.com/2021/03/16/technology/amazon-unions-virginia.html)  In a secret settlement in Virginia, Amazon swore off threatening and intimidating workers. As the company confronts increased labor unrest, its tactics are under scrutiny.",
            "title_similarity": "0.6850402",
            "sentiment_compound": -0.7728
        },
        {
            "id": "h0tn6d1",
            "score": -10,
            "text": "Will Biden just do something about student loans im starting to think it was a lie just to get our vote!",
            "title_similarity": "0.46683776",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u3954",
            "score": -11,
            "text": "Until crossdressing unitarian transgender martians have been recognized with a day of their own I refuse to participate in this discriminatory celebration",
            "title_similarity": "0.3778245",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0tsw86",
            "score": 4,
            "text": "We live in a plutocracy.",
            "title_similarity": "0.21040693",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u3gxa",
            "score": 3,
            "text": "I understand they do this for money. Pretending to be your friend is marketing.\n\n&#x200B;\n\nHowever, I can't get why they would work to have the act voted against; what financial benefit does not allowing people to get married and be treated equally have?",
            "title_similarity": "0.54528254",
            "sentiment_compound": 0.765
        },
        {
            "id": "h0ujf4d",
            "score": -3,
            "text": "And the people in this subreddit voted for the epitome of straight old white man who has been a subversive politician for nearly half a century.",
            "title_similarity": "0.6889918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uuj7m",
            "score": -4,
            "text": "These companies are great in every way",
            "title_similarity": "0.2098371",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0tww9c",
            "score": -12,
            "text": "Fuck pride. Frankly I would love these companies to not celebrate pride.",
            "title_similarity": "0.34058017",
            "sentiment_compound": -0.2344
        },
        {
            "id": "h0tqm7a",
            "score": 5,
            "text": "How does one find out if their employer donates money to political organizations?",
            "title_similarity": "0.53490335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ua4t7",
            "score": -4,
            "text": "Oh the horrors.  Maybe the like  less lawsuits, low taxes, and a lesser regulatory environment?  As someone once said, my 80% friend isn’t my 20% enemy.",
            "title_similarity": "0.5125816",
            "sentiment_compound": -0.5616
        },
        {
            "id": "h0uhuw9",
            "score": -4,
            "text": "if you buy stuff from Walmart, McDonalds, or Amazon, you are literally worse than Trump.",
            "title_similarity": "0.53991055",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0ukbs8",
            "score": 5,
            "text": "reminds me of Justin Trudeau walking in pride parades while selling armored cars to nations that imprison and slaughter LGBT people",
            "title_similarity": "0.6195403",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0uv7z2",
            "score": 4,
            "text": "This is the only problem I have with pride, and also with feminism.  There is a corporate machine behind these things \n\nWearing a “the future is female” shirt is *not* activism",
            "title_similarity": "0.44633734",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0u0rsj",
            "score": -15,
            "text": "Maybe someone’s idea of equality isn’t allowing female athletes to be disadvantaged by trans women who’ve had the benefit of exposure to increased testosterone?",
            "title_similarity": "0.39167935",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0tov0c",
            "score": 35,
            "text": "[deleted]",
            "title_similarity": "-0.08433622"
        },
        {
            "id": "h0tsdnt",
            "score": 6,
            "text": "Say what you will about 6ix9ine, but he’s always been an avid supporter of pride month.\n\nEdit: /s for those who have to go and make me put it...",
            "title_similarity": "0.5111967",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h0ucl3p",
            "score": -5,
            "text": "So what? I thought pride was about celebrating gay people, not pushing legislation? I'm perfectly happy to celebrate gay people being liberated from oppression - that doesn't mean I believe in *your* particular political agenda.\n\nExplain to me how this isn't BusinessInsider being used as a conduit to shift public opinion while using gay people as political collateral. Seriously, I'm open to discussion.",
            "title_similarity": "0.45917335",
            "sentiment_compound": 0.9542
        },
        {
            "id": "h0tzorr",
            "score": 6,
            "text": "People looking for sincerity from corporations will **always** be disappointed. Pride month is just like the July 4th or Christmas, they know it is important to people so they use it as a lever to sell things, but the event itself has no real important to the corporation.",
            "title_similarity": "0.53433335",
            "sentiment_compound": -0.4382
        },
        {
            "id": "h0u7pb2",
            "score": -6,
            "text": "Boo fckn whoooo",
            "title_similarity": "0.03127072",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uctbl",
            "score": -6,
            "text": "It's marketing. These trends will die out when the trophy for everyone generation realizes this.",
            "title_similarity": "0.41735297",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0ugev1",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.13217586"
        },
        {
            "id": "h0tjgpb",
            "score": 20,
            "text": "Thats because lobbying has no morals and their participation is nothing more than a PR stunt",
            "title_similarity": "0.24181166",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0u5bhd",
            "score": 22,
            "text": "Special shout out to the Supreme Court for allowing corporations to funnel an infinite amount of funds into our government to get what they want.",
            "title_similarity": "0.6301501",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0ucr2j",
            "score": 7,
            "text": "Fuck Walmart, McDonald's and Amazon.",
            "title_similarity": "0.44329283",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0ugcm7",
            "score": -7,
            "text": "This is why I voted for Trump.  #TakeAmericaBack",
            "title_similarity": "0.42784238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ub1xl",
            "score": 10,
            "text": "Well they aren’t single issue “voters.” They supported those politicians for other pro-business reasons and unfortunately in America it comes hand in hand with those who voted against the Equality Act. \n\nStill, I’d rather them celebrate Pride among their employees and customers instead of nothing at all.",
            "title_similarity": "0.6108893",
            "sentiment_compound": 0.926
        },
        {
            "id": "h0tj3dd",
            "score": 228,
            "text": "Oh no, a transparent cashgrab, who would do such a thing?",
            "title_similarity": "0.13313466",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0to8gz",
            "score": 1035,
            "text": "Big corporations are not celebrating pride, they are exploiting it in the form of exceedingly transparent public relations pandering.",
            "title_similarity": "0.44698995",
            "sentiment_compound": -0.7866
        },
        {
            "id": "h0u7e41",
            "score": 22,
            "text": "People who look to large corporations for any type of morality are pretty gullible.",
            "title_similarity": "0.5072819",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0tjcxj",
            "score": 3935,
            "text": "It's almost like the capitalist class will do anything to expand their consumer base but are at heart craven in their support of conservatives because they also love those tax breaks more than they love people crazy I can't believe it woah.",
            "title_similarity": "0.61900777",
            "sentiment_compound": 0.9735
        },
        {
            "id": "h0tmyid",
            "score": 78,
            "text": "I care far more about this than social media profile pictures.",
            "title_similarity": "0.25798583",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0tsaog",
            "score": 40,
            "text": "I don't know why people still celebrate these companies.  They are the most see through garbage companies that would support throwing puppies in a river if a focus group came back 51% favorable.",
            "title_similarity": "0.6538757",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h0ttgmj",
            "score": 290,
            "text": "Can't really lose if you play both sides.",
            "title_similarity": "0.069059804",
            "sentiment_compound": 0.596
        },
        {
            "id": "h0ttchn",
            "score": 4851,
            "text": "Perhaps we should focus on getting corporate money out of politics, and also stop thinking we can somehow \"ethically consume\" our way to whatever political aims ourselves.\n\nAs it stands, companies are going to fall behind whatever politician lets them make the most money via sweeter tax loopholes and less regulation or whatever, that's all they're ever about. All the rest is distraction.",
            "title_similarity": "0.5516063",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0tpdd8",
            "score": 4,
            "text": "But but. We wear rainbows and runs ads saying we do nice shit for lgbtq ppl ?!?!",
            "title_similarity": "0.44235146",
            "sentiment_compound": -0.4843
        },
        {
            "id": "h0tuyj1",
            "score": 7,
            "text": "The money donations were never because they supported any specific cause, they were so they could eliminate their tax liability by saying they donated money to as many causes as they are permitted to",
            "title_similarity": "0.4680597",
            "sentiment_compound": -0.4141
        },
        {
            "id": "h0twccd",
            "score": 1,
            "text": "This is why you can't trust corporations period.",
            "title_similarity": "0.3327121",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h0tx91p",
            "score": 5,
            "text": "Most corporate donors play both sides to cover their bets.",
            "title_similarity": "0.5588129",
            "sentiment_compound": 0.3947
        },
        {
            "id": "h0txh2s",
            "score": 3,
            "text": "company’s don’t give a shit about people’s sexual orientation, using someone’s Sexual preferences to sell something is just weird. Unless your selling condoms or something to do with sex.",
            "title_similarity": "0.33849427",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0tybah",
            "score": 1,
            "text": "Damn DINO",
            "title_similarity": "0.11331019",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0tzqug",
            "score": 2,
            "text": "Supporting gay rights costs them nothing and in fact gives them lots of new ad opportunities and new consumers.  So of course they love it. It's cheap and easy political points.  So they hyper focus on it because it costs them next to nothing while ignoring all the other myriad of issues that would hurt  their bottom line.",
            "title_similarity": "0.4478978",
            "sentiment_compound": 0.8875
        },
        {
            "id": "h0u07gm",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.08433622"
        },
        {
            "id": "h0u1wcs",
            "score": 41,
            "text": "I’m playing both sides so I always come out on top - Mac",
            "title_similarity": "0.35808036",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0u2g0m",
            "score": 3,
            "text": "It’s called lip service.",
            "title_similarity": "0.046220243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u2peo",
            "score": 5,
            "text": "I really don’t think big companies should even be allowed to donate to politicians. Maybe they are pay offs for them to look the other way while they dump their waste in places they shouldn’t or while they  run sweat shops or cook their books.",
            "title_similarity": "0.5685248",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0u2qhi",
            "score": 5,
            "text": "Send us your gay dollars this month!",
            "title_similarity": "0.5529667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u2wqy",
            "score": 1,
            "text": "Bruhhh I give up on this world now",
            "title_similarity": "0.02118037",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u2zsr",
            "score": 1,
            "text": "And the straights wonder why the gays \"#SILENCEBRAND\" them...",
            "title_similarity": "0.38991064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u3mfe",
            "score": 3,
            "text": "Are you saying that they are doing it for money. Wow I’m shocked. 🙄",
            "title_similarity": "0.29200113",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0u3r3h",
            "score": 3,
            "text": "Not celebrating, capitalizing on Pride!",
            "title_similarity": "0.089349315",
            "sentiment_compound": -0.224
        },
        {
            "id": "h0u40v0",
            "score": 3,
            "text": "You mean corporations are saying and doing whatever it takes to grow their bottom line? I’m stunned! /s",
            "title_similarity": "0.52675986",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h0u42on",
            "score": 1,
            "text": "Corporate welfare just correlates with anti-LGBTQ politicians well, and these corporations actually care about one, and it’s cheap to pay lip service to the other.",
            "title_similarity": "0.5696007",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0u4kyx",
            "score": 1,
            "text": "I thought this was an article about tekashi69 lmao",
            "title_similarity": "0.13440385",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0u5hr2",
            "score": 1,
            "text": "Corporations are as hypocritical as politicians who would have thought.",
            "title_similarity": "0.45908457",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0u5qbs",
            "score": 1,
            "text": "At this point, is anyone surprised? They do this all the time whenever something comes up, they say that they support you and are behind you 100% but as soon as the month is over, they just go back to the what they’ve always done: making money and not giving a rusty rat’s ass about employees.",
            "title_similarity": "0.6348716",
            "sentiment_compound": -0.7188
        },
        {
            "id": "h0u7laj",
            "score": 1,
            "text": "How many of their opponents also received donations? If I had to guess, companies play both sides of the fence.",
            "title_similarity": "0.52572834",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0u7xq4",
            "score": 1,
            "text": "It took it this long...",
            "title_similarity": "0.058124688",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u84m7",
            "score": 2,
            "text": "Please pardon my regex, but:\n\n**s/celebrating/marketing with/**\n\n*and fuck all things corporate*",
            "title_similarity": "0.55207586",
            "sentiment_compound": -0.5346
        },
        {
            "id": "h0u89jf",
            "score": 1,
            "text": "Let's ignore their donations, Walmart manufactures almost all of its various store brand product in the People's Republic of China, which besides all of its blatant human rights violations, is also not really pro-LGBTQ equality.",
            "title_similarity": "0.5779041",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h0u89rj",
            "score": 1,
            "text": "They make money off the pride people then regulate how they live. Amazing",
            "title_similarity": "0.43652198",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0u8euy",
            "score": 2,
            "text": "So typical of companies, trying to appeal to everyone to sell things.",
            "title_similarity": "0.40379977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u8qvy",
            "score": 1,
            "text": "Yes, corporations always expropriate social causes to sell product.\n\nCorporations target their advertising young people, because they want lifelong consumers in exchange for their advertising dollars.\n\nAnd social causes and trends are always started by the young (who think the prior generations did it wrong).\n\nHippy culture -- expropriated to sell product.  BLM--expropriated to sell product.  Gay culture--expropriated to sell product.  Hip Hop -- expropriated to sell product.  Peace Movement -- expropriated to sell product.  Former hippies -- mocked to sell product.  White people -- mocked to sell product.\n\nAnybody who is surprised that corporations are not authentic when they pander to the young is simply not aware of how advertisers market to the young.",
            "title_similarity": "0.61107206",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0u8zxf",
            "score": 1,
            "text": "Fake as Fuck",
            "title_similarity": "-0.08948019",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0u90zj",
            "score": 2,
            "text": "We should boycott these companies and show them they will need more then a tax break.\nThey will there bottom line.\nThey should be protecting the LGBT if they want as customers.",
            "title_similarity": "0.4988653",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0u92fu",
            "score": 1,
            "text": "I c bajs among us forsen1",
            "title_similarity": "0.05929608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0u9597",
            "score": 1,
            "text": "Are trying to tell me all the rainbow stuff is only driven by a desire to sell more stuff?",
            "title_similarity": "0.33098948",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0u9a7o",
            "score": 2,
            "text": "“I’m playing both sides. That way I always come out on top.”",
            "title_similarity": "0.1546525",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0u9bvq",
            "score": 1,
            "text": "yay another win for humanity go team /s",
            "title_similarity": "0.3510485",
            "sentiment_compound": 0.802
        },
        {
            "id": "h0u9fzw",
            "score": 2,
            "text": "That pride flag sure looks good on Facebook and ig though. Minimal effort, maximum wokeness. Shameless.",
            "title_similarity": "0.35704282",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0u9hk9",
            "score": 1,
            "text": "Maybe their tax breaks meant more to them than pride?",
            "title_similarity": "0.39018673",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0u9snk",
            "score": 1,
            "text": "Thought it was 6ix9ine appreciation month",
            "title_similarity": "0.20961589",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0u9v2h",
            "score": 1,
            "text": "Train people to eat s*** and pay through the nose for it. Destroy the planet while doing it. Collect vast amounts of money. Reinvest with those who will allow you to carry on with your planet destroying project.",
            "title_similarity": "0.48472935",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0ua306",
            "score": 1,
            "text": "Look at a large corporations with heavy influence in America markets, they pander to their audience. They could give to shits about how you feel. With donations to organizations “supporting” whatever the social justice war is this month, is a drop in the bucked to what they make off a successful smoke and mirror act.",
            "title_similarity": "0.7672651",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0ua4mi",
            "score": 1,
            "text": "You have the 14th Amendment, why do you need another law?",
            "title_similarity": "0.22782344",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ua4rc",
            "score": 1,
            "text": "anything to make a fucking buck. is this enough yet?",
            "title_similarity": "0.1576584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ua96v",
            "score": 1,
            "text": "You mean marketing Pride. They only care about the money.",
            "title_similarity": "0.34491962",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0uad1l",
            "score": 1,
            "text": "And this surprises who?",
            "title_similarity": "-0.102650896",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0uadz4",
            "score": 1,
            "text": "What!?!?!\n\nIt’s almost like they pander to whoever they think can give them more power or money",
            "title_similarity": "0.33702147",
            "sentiment_compound": 0.5335
        },
        {
            "id": "h0uakdp",
            "score": 1,
            "text": "In other news corporations keep trying to make money off of everyone.",
            "title_similarity": "0.5188302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uatj2",
            "score": 1,
            "text": "That’s called playing both sides",
            "title_similarity": "-0.033922944",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0uatzt",
            "score": 1,
            "text": "Celebrating pride is just like the October pink ribbon stuff. No business really cares. They just want your money.",
            "title_similarity": "0.41471362",
            "sentiment_compound": 0.8748
        },
        {
            "id": "h0uau4o",
            "score": 1,
            "text": "…because those same politicians did those companies a favor by passing favorable bills that benefit those same companies. \n\nMost of them don’t care what social platform those politicians are on. Those companies will do whatever looks good when it comes to social optics in order to keep the money flowing.",
            "title_similarity": "0.6403771",
            "sentiment_compound": 0.9313
        },
        {
            "id": "h0uaw26",
            "score": 1,
            "text": "Lmao. How dumb are you if you think corporations have any other motivation beyond money....?",
            "title_similarity": "0.4646276",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0uazjy",
            "score": 2,
            "text": "“Who’s watching the hash, boys?",
            "title_similarity": "0.19994393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ub6nu",
            "score": 1,
            "text": "Support LGBTQ+ businesses. Especially during pride AND the fact that many small businesses are still struggling. Donate to organizations yourself. Fucking just follow anything LGBTQ+ accounts to show support. Any big company who’s throwing all these shitty pride shirts and material needs doesn’t need your fucking money. As a lesbian, it’s great to see flags and support but please if you can show your support in not only flags, tweets and donations, support LGBT+ businesses. *jumps off soap box*",
            "title_similarity": "0.636971",
            "sentiment_compound": 0.9381
        },
        {
            "id": "h0ub7mw",
            "score": 1,
            "text": "Corporations love to play both sides and pretend they stand for something appealing to each.  It’s just posturing.  They don’t give a shit about anything but their bottom line",
            "title_similarity": "0.46502113",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0ub92b",
            "score": 1,
            "text": "Insert Mac playing both sides gif",
            "title_similarity": "0.27226794",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0ub9nk",
            "score": 3,
            "text": "Think about it like this.  Corporate people are the kind of people that will do ANYTHING for a buck. Case in point McDonald's shinks the size of its burgers and then charges more for them. Walmart puts in self check stands so they can make there costumer do a job for them they would have to pay someone to do. While Amazon just shits on ther people and is able to just get away with it. So it's really no shocker that corporate America is just a bit 2 faced 🤔",
            "title_similarity": "0.74395126",
            "sentiment_compound": -0.0312
        },
        {
            "id": "h0ub9qm",
            "score": 1,
            "text": "Sounds like political bribes with a mask",
            "title_similarity": "0.29789317",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0ubal6",
            "score": 1,
            "text": "Wow who would have thought McDonald’s would care so much after giving half the us population heart disease",
            "title_similarity": "0.67802197",
            "sentiment_compound": 0.9308
        },
        {
            "id": "h0ubcwx",
            "score": 1,
            "text": "To be fair most corporations of that size donate money to politicians across the spectrum. \n\nElon Musk defended the practice once as \"The cost of doing business\" because if you need a favor from a politician, it's a lot cheaper to just pay them both.",
            "title_similarity": "0.70665944",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0ubg0m",
            "score": 1,
            "text": " Every June companies slap rainbows on things and be like \" we want your gay money\". If an election year. Then you see candidates covered in rainbows for ,\"I want your gay vote\". Cities paint rainbows on crossings and then everyone gets mad when the inevitable skid marks appear. \n\nHow about we just treat everyone normal?",
            "title_similarity": "0.63662034",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0ubiz3",
            "score": 1,
            "text": "Check out opensecrets.org - that site has a break down of just about every political donation, if not every.",
            "title_similarity": "0.6088542",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ublod",
            "score": 1,
            "text": "This is my main complaint about these company pride month things.\n\nI think its good to normalise lgtbq. And I'd rather have a company pretend to be pro gay instead of anti gay. These things have a lot of influence on normalising and that's good.\n\nBut if you praise one thing. Atleast don't be purposefully oppressive....",
            "title_similarity": "0.4912454",
            "sentiment_compound": 0.8731
        },
        {
            "id": "h0ubn4v",
            "score": 1,
            "text": "You mean to tell me major corporations present one face to society while doing things that go against their own customers human rights. Surprise",
            "title_similarity": "0.55713266",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0ubolp",
            "score": 1,
            "text": "It's called playing both sides",
            "title_similarity": "-0.03913534",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0ubpb5",
            "score": 1,
            "text": "Oh the hypocrisy",
            "title_similarity": "0.025284128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ubsxn",
            "score": 1,
            "text": "The equality act has way too much hidden no no. It needs to be stripped and rebuilt with a fine tooth comb. One issue being the decriminalization and protection of pedophilia which is seen by the Senate as one of 259 some odd sexualities.",
            "title_similarity": "0.49338377",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0ubv18",
            "score": 2,
            "text": "This reminds me of when conservative congress members voted against biden's stimulus package and then told all their constituents that they supported it and deserved credit for it.",
            "title_similarity": "0.6899755",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0ubvgx",
            "score": 1,
            "text": "It’s very unlikely that anyone will find a politician to support who they 100% agree with every stance. \n\nAs such, if you give support to a politician or party, you will probably be donating *against* some cause you believe in. It’s about picking the issues that are most important.",
            "title_similarity": "0.49523407",
            "sentiment_compound": 0.8932
        },
        {
            "id": "h0ubvtu",
            "score": 2,
            "text": "If you think those companies actually give a flying fuck about pride...... a finger in the wind",
            "title_similarity": "0.3409998",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0ubvya",
            "score": 2,
            "text": "Who cares so tired of hearing about it",
            "title_similarity": "0.07911909",
            "sentiment_compound": -0.188
        },
        {
            "id": "h0ubwtq",
            "score": 1,
            "text": "Shocked!! AM schocked!!",
            "title_similarity": "-0.0039188676",
            "sentiment_compound": -0.5374
        },
        {
            "id": "h0ubx0q",
            "score": 1,
            "text": "Corporations be like: https://www.instagram.com/tv/CPoI7SkJcKt/?utm_medium=copy_link",
            "title_similarity": "0.482664",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0uc6mh",
            "score": 1,
            "text": "Corporations in a nutshell. It's all marketing.",
            "title_similarity": "0.3918201",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uc6uw",
            "score": 1,
            "text": "It’s almost like they don’t actually care",
            "title_similarity": "-0.07283658",
            "sentiment_compound": 0.6605
        },
        {
            "id": "h0uc9cq",
            "score": 1,
            "text": "BFD. Corporations give to everyone. I am sure these companies also gave plenty to politicians that voted FOR the Act.",
            "title_similarity": "0.68367064",
            "sentiment_compound": -0.4824
        },
        {
            "id": "h0uc9j4",
            "score": 1,
            "text": "Why would anyone be shocked?",
            "title_similarity": "-0.020245653",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0uc9x2",
            "score": 1,
            "text": "“Give us your money, ignore how despicable we are are.”",
            "title_similarity": "0.22076952",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0ucaaa",
            "score": 4,
            "text": "Corporations are not your allies. Corporations are not your friends.",
            "title_similarity": "0.27860326",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h0ucaap",
            "score": 1,
            "text": "Maybe they are pro lgbtq and anti social planning?",
            "title_similarity": "0.25551814",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0ucehq",
            "score": 1,
            "text": "They also donated money to politicians that voted to legalize Marijuana, increasing stimulus checks, lowering taxes on lower and middle class brackets, and increasing government spenditures. I garantee if u smoke some weed and have more money u won't care about feeling equal.",
            "title_similarity": "0.64238024",
            "sentiment_compound": -0.735
        },
        {
            "id": "h0ucj9x",
            "score": 1,
            "text": "Capitalism allows us as the consumer to support companies that share our values and abandon those that don't. If we vote with our wallets we can show these companies what we want them to do.",
            "title_similarity": "0.52004623",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0ucknk",
            "score": 2,
            "text": "“Give us your gay money”\n\nIs what i see whenever companies show their “support”",
            "title_similarity": "0.533417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uckpx",
            "score": 1,
            "text": "It would be a surprise if they didn’t",
            "title_similarity": "-0.045216084",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0uckx4",
            "score": 1,
            "text": "You mean corporations are greedy opportunistic fucks who just want a bigger slice of the pie?\n\nNo, that can't be it. They're obviously controlled by the (deep state, liberals, antifa, blm, jews, etc), which just happens to be the people I don't like.",
            "title_similarity": "0.52581483",
            "sentiment_compound": -0.7438
        },
        {
            "id": "h0uclvj",
            "score": 1,
            "text": "corporations value tax cuts, union busting,  and deregulation more than minority rights. Shocking.",
            "title_similarity": "0.57617986",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0ucn33",
            "score": 1,
            "text": "“It’s only Business” to pretend to care in order to expand the bottom line.",
            "title_similarity": "0.23789857",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0ucrhw",
            "score": 2,
            "text": "AT&T too.\n\nThey’re all a bunch of big phonies.",
            "title_similarity": "0.41971093",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ucu6e",
            "score": 2,
            "text": "They do red white and blue stuff for Memorial Day and Fourth of July. \n\nMaybe instead of worrying about the pandering, we should be happy that kids today are growing up seeing Pride related products in retail stores. \n\nI feel like people don’t remember how hard it was to be openly gay even 20 years ago. Like Will and Grace was considered groundbreaking for being based on gay characters that had personalities behind being “the gay character”.",
            "title_similarity": "0.5952463",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h0ud1qz",
            "score": 1,
            "text": "Corporations are people too. Terrible, terrible, greedy, hypocritical people…",
            "title_similarity": "0.43310952",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h0ud2cv",
            "score": 1,
            "text": "Are we surprised? It's not about what you *do*, it's about how you *present*.",
            "title_similarity": "0.0594577",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0ud49f",
            "score": 1,
            "text": "I’m done with these places.Stop giving them your business",
            "title_similarity": "0.13296826",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0ud49n",
            "score": 1,
            "text": "The moral of the story, it doesn’t matter what it is, in America someone will figure how to make money from it.",
            "title_similarity": "0.37991017",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0ud632",
            "score": 1,
            "text": "“I like to play both sides so I always come out on top”",
            "title_similarity": "0.193959",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0udgh2",
            "score": 1,
            "text": "Who knew that corporations only celebrate pride because it relates to all the people who belong to the LGBT which gets them more business because if they don't celebrate pride they just get shit on",
            "title_similarity": "0.6263021",
            "sentiment_compound": -0.3682
        },
        {
            "id": "h0udij2",
            "score": 1,
            "text": "Fitting isn’t it? More hypocrites!",
            "title_similarity": "0.12473653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0udn4c",
            "score": 1,
            "text": "Of course they want that paper.",
            "title_similarity": "0.053737268",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0udndm",
            "score": 1,
            "text": "[“I’m playing *both* sides, so I always come out on top.”](https://i.imgur.com/c66bWny_d.webp?maxwidth=640&shape=thumb&fidelity=medium)",
            "title_similarity": "0.31676215",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0udr54",
            "score": 1,
            "text": "If the human equality act is putting women in top positions solely based on their gender, then I totally get that.",
            "title_similarity": "0.35233095",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0udun1",
            "score": 1,
            "text": "I bet their logos are rainbows this month tho",
            "title_similarity": "0.37560368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0udw1c",
            "score": 1,
            "text": "Nothing new, spineless capitalists",
            "title_similarity": "0.16291584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0udygp",
            "score": 1,
            "text": "Yay!!!  They spend 2 cents on good press celebrating the lbgt yata yata yata, but then turn around and proceed to pay hundreds of thousands of employees world wide pennies on the dollar keeping them in poverty.  What a joke.",
            "title_similarity": "0.75601757",
            "sentiment_compound": 0.2325
        },
        {
            "id": "h0udzee",
            "score": 1,
            "text": "people who don't celebrate pride months are enemies of the state and need to be given public executions",
            "title_similarity": "0.43099976",
            "sentiment_compound": -0.8039
        },
        {
            "id": "h0ue0qy",
            "score": 1,
            "text": "Hypocrisy level 9000",
            "title_similarity": "0.2001482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ue530",
            "score": 1,
            "text": "Whether you’re a Republican or a Democrat, homophobic or homosexual - with a company that produces banks for you; you do not know what dignity is anymore.\n\nFun fact, these companies **does not** show support for Pride in the Middle East. Sure, Islamic countries and whatnot - but if they’re **(supposedly)** that deep into the community and philosophy, then they should advertise that instead of being so afraid. What they’re doing, is called adjusting to the market. \nSince Pride isn’t a thing there, why would they? Companies don’t love you for who you are, they love you for how fat your wallet is. They were never about the community. The second Pride drops here, you won’t see one company accepting who they are and what they represent.\n\nJust know one thing: **the rich make sure they look good on the outside, but never in the inside.** All they’re doing is making their logos rainbow and sell the same products with multiple colors.",
            "title_similarity": "0.529037",
            "sentiment_compound": 0.9892
        },
        {
            "id": "h0ue5ym",
            "score": 1,
            "text": "Why a surprise!! Corporations pay lip service?!",
            "title_similarity": "0.46709466",
            "sentiment_compound": 0.3769
        },
        {
            "id": "h0ue6ww",
            "score": 1,
            "text": "Newsflash, all corporations want your money.\n\nThat's it.\n\nYou are not their friend. They don't like you. They aren't \"fighting\" for you. They fight only for more profits each quarter.\n\nIf we had a less apathetic approach to politics in America we wouldn't have to be fighting back against some strange conservative 1950's mentality movement.\n\nIf you really want to \"vote\" with your wallet and make a small change shop local and look up queer-owned or supportive small businesses in your area. I've met some amazing people the last few months at farmers markets and what not which has helped in my quest to stop spending money with large corporations that influence out politics WAY more than they should be able to, which in a perfect world is not at all. If we all make small changes together it can lead to a big positive change for all of us!",
            "title_similarity": "0.7234609",
            "sentiment_compound": 0.7931
        },
        {
            "id": "h0ue842",
            "score": 1,
            "text": "I hate gay pride month. Speaking as a gay man who has literally had to hide in a drainage ditch from homophobes in Oklahoma (all because they knew I was gay and they saw me walking home from a carnival, they decided to try to run me over and hunt me down like an animal).\n\nI’ve always thought it was a cash grab and it’s always way too much “in your face.”\n\nIt brings out the weirdest minorities of the minorities and pics/vids of those weirdos get spreads around the internet, thus flaming the homophobic hate that I’ve had to deal with and thousands of other normal gay people.",
            "title_similarity": "0.5875336",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0ue8qv",
            "score": 1,
            "text": "Is anyone really surprised!",
            "title_similarity": "-0.05308406",
            "sentiment_compound": 0.358
        },
        {
            "id": "h0ueakn",
            "score": 1,
            "text": "Fake love but people are dumb",
            "title_similarity": "0.11029478",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0ueawm",
            "score": 1,
            "text": "The only thing businesses and politicians celebrate is money. Soon you'll preorder a mkrib to get via Amazoom delivery as soon as it hits the menu, but because it's not the GameStore exclusive you'll have to watch a buzzword ridden ad to complete the order and get the cheap sauce. Bought to you by lobbyists like them.",
            "title_similarity": "0.6405893",
            "sentiment_compound": 0.6181
        },
        {
            "id": "h0ueb3c",
            "score": 1,
            "text": "Are they “celebrating” pride or so they know that I’d they don’t bow down and whack a rainbow on their logo the LGBT communities will be outraged??",
            "title_similarity": "0.4920894",
            "sentiment_compound": -0.3527
        },
        {
            "id": "h0uec82",
            "score": 1,
            "text": "It’s all about image for those companies",
            "title_similarity": "0.29803687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uecid",
            "score": 1,
            "text": "Turning your logo rainbow is the laziest form of PR slackivism.",
            "title_similarity": "0.32797617",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0uecnb",
            "score": 1,
            "text": "Thats called working both sides of the street.",
            "title_similarity": "0.021721268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uee0f",
            "score": 1,
            "text": "HamOsaxuOls\nABOMINATION",
            "title_similarity": "-0.008758886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uehmb",
            "score": 1,
            "text": "Is it possible a company such as Amazon can make several good decisions along with several bad? \n\nI guess I just don’t think the whole “all good or all bad” mentality is healthy. No company is ever going to be perfect 100 percent of the time. \n\nAnd this is coming from a liberal that supports the Equality Act. I just think we need to be realistic with the fact that we are all humans and should probably stop expecting perfection because we will only keep disappointing ourselves.\n\nEdit: typed a sentence twice",
            "title_similarity": "0.5871219",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h0ueklc",
            "score": 1,
            "text": "Thats because the \"equality\" act is named that way for propaganda headlines like this.  What it does is makes it so that trans people cannot be held out of birth-sex sports leagues. \n\nYou may think that is \"equal\" but what it does is stomp all over women's rights.  There have already been multiple examples across the country of trans girls dominating girls sports.",
            "title_similarity": "0.48675996",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h0ueos2",
            "score": 1,
            "text": "it's called playing the game. Big business is INDIFFERENT to anything but stock price.  It's all PR and always has been.",
            "title_similarity": "0.45604694",
            "sentiment_compound": -0.0942
        },
        {
            "id": "h0uepxy",
            "score": 1,
            "text": "Oh wow corporations being disingenuous? Wow who would've thought.",
            "title_similarity": "0.3754639",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h0ueqpo",
            "score": 1,
            "text": "Fucking Hippocrates",
            "title_similarity": "0.09136301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uetot",
            "score": 1,
            "text": "Irrelevant.",
            "title_similarity": "-0.19378735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uetqx",
            "score": 1,
            "text": "Walmart is trash, McDonald’s just isn’t that great anymore but Amazon is pretty freaking amazing.  The two day shipping was genius now same day delivery on certain items.   I hate to say it but I’ll help you boycott Walmart or McDonalds but I can’t help you with Amazon.  Pretty selfish person here sorry but not sorry.",
            "title_similarity": "0.62415504",
            "sentiment_compound": 0.9222
        },
        {
            "id": "h0ueu43",
            "score": 1,
            "text": "A gay guy I know said something that really got me thinking. He said: “why should gay people get an entire month devoted to them? They shouldn’t. A gay day would be good enough. I mean, we’re just gay. It’s just a thing. It’s not something big or important enough to deserve an entire month of celebrating. Why do war heroes/veterans only get one Memorial Day while gay people get an entire month? It should really be the other way around.” \n\nAnd I do agree with him. Being gay is not as big a thing as risking or giving your life for freedom and country. We’re blowing this way out of proportion. Let’s give veterans a memorial month instead of a Memorial Day, and let’s turn gay pride month into gay pride day.",
            "title_similarity": "0.5385989",
            "sentiment_compound": 0.9528
        },
        {
            "id": "h0uev4z",
            "score": 1,
            "text": "I don’t shop at these places. Amazon is a bit tougher to avoid but if you have the extra time it’s easy. That’s how we can make a change. \n\nYou can complain about it on Reddit and make jokes or you can actually do something. We may not have much power, but where we spend our money is a way we can make a change. \n\nSeriously next time you buy a product make sure you are okay with who is getting that money. It’s not that hard. \n\nBut y’all just keep making jokes and talking about how much it sucks and then go back to giving these companies your money.",
            "title_similarity": "0.50693893",
            "sentiment_compound": 0.8498
        },
        {
            "id": "h0uew3p",
            "score": 1,
            "text": "Never in my entire 58 years has any LBGLTQ people made my life miserable. Jeez it’s straight up hate.",
            "title_similarity": "0.41349733",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h0uexql",
            "score": 2,
            "text": "The Equality Act is not fully inclusive as it removes the female sex class from legislation against discrimination. Legislation that's actually good finds a way to advocate for all, not just one set of minorities at a time against the rest. Hope this helps <3",
            "title_similarity": "0.39785957",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h0ueyoa",
            "score": 1,
            "text": "Damn you mean... they just using lgbt for marketting? Damn thats crazy bro i never saw that coming.",
            "title_similarity": "0.36129516",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h0uf0mu",
            "score": 1,
            "text": "Putting the dollars were the dick goes, I suppose",
            "title_similarity": "0.30108297",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0uf28x",
            "score": 1,
            "text": "Buy something we sell. Now.",
            "title_similarity": "0.10521211",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uf30r",
            "score": 1,
            "text": "Of course they are. Pride = profit to these companies. They don’t really care.",
            "title_similarity": "0.44478863",
            "sentiment_compound": 0.8313
        },
        {
            "id": "h0uf42w",
            "score": 1,
            "text": "Hah, so now you can't have Chik fil a, McDonald's, shop at Amazon OR WalMart!",
            "title_similarity": "0.3851506",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h0uf5gq",
            "score": 1,
            "text": "Wow it’s like corporations don’t care about equality or something",
            "title_similarity": "0.32732713",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h0uf5ns",
            "score": 1,
            "text": "Look at the middle eastern Twitter accounts of the companies. No rainbow in sight",
            "title_similarity": "0.3729006",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0uf6jg",
            "score": 1,
            "text": "I for one am shocked that organizations designed to siphon money from me contradict themselves for profit.",
            "title_similarity": "0.39952263",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0uf6zf",
            "score": 1,
            "text": "Wait wUT NOW",
            "title_similarity": "-0.15333448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uf7vg",
            "score": 1,
            "text": "Pandering. They signalize because it sells. No other reason. None of them care about the Pride (or any other) cause. It's all about the bottom line.",
            "title_similarity": "0.30507326",
            "sentiment_compound": -0.3459
        },
        {
            "id": "h0uf91r",
            "score": 2,
            "text": "Playing both sides so they always come out on top",
            "title_similarity": "0.15821618",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0uf9oh",
            "score": 1,
            "text": "Do people really eat at Mac Donalds cuz they pretend to support pride? I support pride and even if mcd did not i would still buy  big Mac when I wanted one. Could not careless about a faceless company",
            "title_similarity": "0.62537915",
            "sentiment_compound": 0.8723
        },
        {
            "id": "h0ufaag",
            "score": 1,
            "text": "You will all still shop at those stores. Lmao",
            "title_similarity": "0.28563374",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h0ufafh",
            "score": 1,
            "text": "What do people expect? To be an accepted group in society and NOT be pandered to by greedy corporations?",
            "title_similarity": "0.36481714",
            "sentiment_compound": -0.1431
        },
        {
            "id": "h0ufd3h",
            "score": 1,
            "text": "I mean, i’ve never known anyone to not recognize the blatant pandering and capitalistic motive behind these companies trying to look in support of pride month or whatever. I don’t think most people take it as genuine support to begin with lmao",
            "title_similarity": "0.47716045",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h0ufd3r",
            "score": 1,
            "text": "Of course. It is easy for them to change their profiles to include the pride flag and people will think they actually care about them. These organizations need to quit with the B.S.",
            "title_similarity": "0.41951483",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0ufdv2",
            "score": 1,
            "text": "By limiting the amount of votes against him",
            "title_similarity": "0.19166383",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ufenh",
            "score": 1,
            "text": "Whoopty Doo. Literally every company that plasters a rainbow on their logo here doesn’t do it to their brand advertising in the Middle East. It is a perfect metaphor for the hypocritical “movement”.",
            "title_similarity": "0.4652754",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0ufisj",
            "score": 1,
            "text": "Yeah I feel like it’s less about hypocrisy and more about funding anti-corporate tax politicians who also hate gay people...which is more in line with sociopathy than hypocrisy.",
            "title_similarity": "0.55709386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ufjna",
            "score": 1,
            "text": "If anyone commenting actually cared, they’d stop giving these companies money (spoiler alert, they won’t).",
            "title_similarity": "0.35373056",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0ufmy5",
            "score": 1,
            "text": "If the median income household can't afford to donate hundreds of thousands of dollars, why is anyone else allowed to?  If donations are a form of speech, then being allowed to donate more than what others can afford is giving them \"more speech\".  That's unconstitutional.",
            "title_similarity": "0.57921445",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0ufo1n",
            "score": 1,
            "text": "You don’t need to be governed.",
            "title_similarity": "-0.100211754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ufp4w",
            "score": 2,
            "text": "I’m sick of people caring what faceless companies have to say",
            "title_similarity": "0.34545207",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0ufr19",
            "score": 3,
            "text": "They'll give you the symbolism and nothing else",
            "title_similarity": "-0.03635796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ufs3x",
            "score": 1,
            "text": "And that’s how corrupted America is",
            "title_similarity": "0.16988462",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uftqx",
            "score": 1,
            "text": "the bigger problem lies in the first part of the sentence before you even get to the second...",
            "title_similarity": "0.08966079",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0ufwbc",
            "score": 1,
            "text": "Who is honestly surprised? The Disney pride tweet was on r/all not too long ago. The almighty dollar wins, but you can’t play both sides. You are either for something or against something. To flip flop just to get more money is just disgraceful. Robert Grosseteste great line comes to mind “Together we stand, divided we fall” Also used in ‘Hey You’ by Pink Floyd.",
            "title_similarity": "0.59166014",
            "sentiment_compound": 0.9032
        },
        {
            "id": "h0ufyz4",
            "score": 1,
            "text": "Rainbow capitalism",
            "title_similarity": "0.16609895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ufz4n",
            "score": 1,
            "text": "And they will still make bank out of it.",
            "title_similarity": "0.16683191",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ufzg3",
            "score": 1,
            "text": "I always think companies doing it are so people find them more \"woke\" and more likely to give them business, it feels fake from large companies.",
            "title_similarity": "0.5206798",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0ufzv7",
            "score": 1,
            "text": "I didn't know people cosplay as 6ix9ine",
            "title_similarity": "0.17169799",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ug3cj",
            "score": 1,
            "text": "Someone tag on the Mac from It's Always Sunny in Philadelphia meme of him saying \"I'm playing both sides so I come out on top either way\"",
            "title_similarity": "0.5034593",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0ug73c",
            "score": 1,
            "text": "Everyone should find there orientation. There is non-binary they, them us. Intense emotional bonds do not need names.\nKamal",
            "title_similarity": "0.09387925",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0ug8fa",
            "score": 1,
            "text": "Of course they are- They fake it so people continue buying from them",
            "title_similarity": "0.30659243",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0ug91f",
            "score": 2,
            "text": "Lol at trying to pretend corporations give a flying fuck about people's sexual orientation.",
            "title_similarity": "0.4085117",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0ug9ku",
            "score": 2,
            "text": "While the facts behind this are frustrating, of Walmart etc celebrating pride pisses the conservatives off, I'm still all for it.",
            "title_similarity": "0.51835406",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0uga6a",
            "score": 1,
            "text": "Whatttt corporations backing the opposition to the “values” they tell you they stand by ???? Shame.",
            "title_similarity": "0.51328135",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h0ugb00",
            "score": 1,
            "text": "Pride only matters to companies like these if they can profit off it.",
            "title_similarity": "0.39358282",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0ugb9z",
            "score": 2,
            "text": "I'm already absolutely disgusted by Walmart, the company that writes my paycheck. This is just yet another reason for me to loathe Doug McMillon and the rest of those corpo-rats.",
            "title_similarity": "0.50613695",
            "sentiment_compound": -0.7841
        },
        {
            "id": "h0ugf34",
            "score": 1,
            "text": "If it messes with their profit, they'll pander, lie, cheat, steal, and probably murder to keep the money coming in.\n\nMorality is no in the interest of most business.",
            "title_similarity": "0.3702811",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0uggc7",
            "score": 1,
            "text": "Donations collected under the pretence it was going to charity. It’s a goddamn scam when they ask you to donate to a charity at checkout. It’s all a massive tax wrightoff for the company on your behalf. Like the waltons need your damn money.",
            "title_similarity": "0.6859795",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0uggi6",
            "score": 1,
            "text": "Fuck ‘em.",
            "title_similarity": "-0.075199455",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0ugh5z",
            "score": 1,
            "text": "They’re not celebrating, they’re advertising.\n\nIt’s just not clear to people initially.",
            "title_similarity": "0.17971435",
            "sentiment_compound": -0.6348
        },
        {
            "id": "h0ughn1",
            "score": 1,
            "text": "They’re playing both sides, so they always come out on top.",
            "title_similarity": "0.22363329",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0ughx4",
            "score": 1,
            "text": "Nothing new",
            "title_similarity": "-0.18743053",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ugj3n",
            "score": 1,
            "text": "\"Donating\" lol.\n\nAnd the fools lapped it up. *Way to go politicians!!!* Get that money!!!",
            "title_similarity": "0.53739333",
            "sentiment_compound": -0.3753
        },
        {
            "id": "h0ugj3y",
            "score": 2,
            "text": "Cause these companies want money that don't care about y'all if the make money this month cause they put a rainbow on there logo then that's all they care abour",
            "title_similarity": "0.5958375",
            "sentiment_compound": 0.2197
        },
        {
            "id": "h0ugjlk",
            "score": 1,
            "text": "They get all your money on pride month so they can destroy you for the other 11 months a year. Time to end their lie.",
            "title_similarity": "0.5625198",
            "sentiment_compound": -0.3321
        },
        {
            "id": "h0ugjrl",
            "score": 1,
            "text": "It’s called advertising for a reason. It’s all bullshit corporate propaganda.",
            "title_similarity": "0.39536288",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0ugk6c",
            "score": 1,
            "text": "Their favorite color in the rainbow is green.",
            "title_similarity": "0.23715755",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0ugkux",
            "score": 1,
            "text": "Gotta make that money",
            "title_similarity": "0.079832874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uglzu",
            "score": 1,
            "text": "Folks ...you still need to vote. In fact voting is never over. I vote with my dollar almost every day. It's easy.",
            "title_similarity": "0.4219992",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ugncu",
            "score": 1,
            "text": "It’s called having the cake and eating it....",
            "title_similarity": "0.23396462",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ugnh1",
            "score": 1,
            "text": "Let’s be real for a moment...this shit isn’t surprising anyone.",
            "title_similarity": "0.017737502",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0ugnz4",
            "score": 1,
            "text": "Corporations celebrate Pride for optics; they fund Republicans for policy.",
            "title_similarity": "0.6204704",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0ugp1r",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "-0.08433621"
        },
        {
            "id": "h0ugpqa",
            "score": 1,
            "text": "How many would prefer if they ignored the month then? What if they didn’t change their social media accounts to be rainbow colored? \n\nOf course they didn’t donate to those politicians because of their votes on the Equality Act but rather because of their tax positions and how anti-regulation they were, but they obviously don’t really care about it. So then should all corporations that really don’t care about pride month or the Equality Act (or at least care more about tax breaks) stop acknowledging it at all?",
            "title_similarity": "0.5787138",
            "sentiment_compound": 0.9427
        },
        {
            "id": "h0ugqnj",
            "score": 1,
            "text": "Yet equal right supporters continue to buy from them",
            "title_similarity": "0.26108348",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ugqv0",
            "score": 1,
            "text": "Oh, I am so shocked. \n\nCompanies known to treat their own employees like shit use their wealth to undermine minorities. \n\nI am shooketh to  my core, I tell you!",
            "title_similarity": "0.57726836",
            "sentiment_compound": -0.1737
        },
        {
            "id": "h0ugtwc",
            "score": 1,
            "text": "Play both siders are gonna play both sides.",
            "title_similarity": "0.1144705",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0uguqd",
            "score": 3,
            "text": "In other news, water is wet.",
            "title_similarity": "0.021811264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ugv11",
            "score": 1,
            "text": "these are the advertisements that organizations should make. Take it to them.",
            "title_similarity": "0.13985237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ugv79",
            "score": 1,
            "text": "Is it not obvious that all corporations pander to get you to spend money on their services and products?",
            "title_similarity": "0.53324616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ugvf9",
            "score": 1,
            "text": "Lmao wasn’t there a study that companies that don’t do this have better diversity?",
            "title_similarity": "0.40491185",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0ugvtx",
            "score": 3,
            "text": "It's like greenwashing but Pridewashing",
            "title_similarity": "0.25327492",
            "sentiment_compound": 0.1406
        },
        {
            "id": "h0ugwg2",
            "score": 1,
            "text": "So don’t shop there end of discussion.",
            "title_similarity": "-0.005101463",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uh1fj",
            "score": 2,
            "text": "They donated to those politicians because they support more favorable laws for their bottom lines. They advertise Pride because they get good PR for publicly sending a positive message.\n\nThose donations don’t prove that they don’t actually care about LGBT+ rights. They prove that they care about favorable (for them) taxes and regulations *more*. Which... is not exactly a shocker. I’m not sure why people are acting like it’s a shocking plot twist that companies are not looking to throw money away just to support LGBT+ rights. If they were, they would have supported LGBT+ rights back when they were deeply unpopular.\n\nThey’re not secretly anti-LGBT+. They just like money more than they support LGBT+ rights. Which is perfectly worth criticizing, but the narrative that they’re lying isn’t how you criticize it.",
            "title_similarity": "0.5485429",
            "sentiment_compound": 0.8562
        },
        {
            "id": "h0uh33n",
            "score": 1,
            "text": "It's not like you're going to stop shopping there. What are you going to do?",
            "title_similarity": "0.13693723",
            "sentiment_compound": -0.5122
        },
        {
            "id": "h0uh4as",
            "score": 1,
            "text": "As a queer woman, I have no problem with corporations supporting the community through the sale of Pride edition goods.  But if the company is not 100% throwing that money back into LGBTQIA+ communities, then that company is simply profiting off of a group of marginalized individuals, and I cannot stan. \n\nAnd I encourage others, even those who are a card carrying member, to boycott buying from companies who do not give back to the community.",
            "title_similarity": "0.640405",
            "sentiment_compound": 0.8473
        },
        {
            "id": "h0uh57j",
            "score": 1,
            "text": "Any sane person would vote against it. What is in it that isn’t already law other than the phrase equality act?",
            "title_similarity": "0.26561588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uh5cb",
            "score": 1,
            "text": "Proud to say that my partner and I do NOT spend any of our $$ at Walmart, McDonald's and Amazon!",
            "title_similarity": "0.54982126",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h0uh5un",
            "score": 1,
            "text": "If you think they care about you you’re an idiot",
            "title_similarity": "0.08356649",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0uh5vf",
            "score": 1,
            "text": "It’s called marketing? It’s how they make money? The only reason any company is “celebrating” pride is for money, to make money.",
            "title_similarity": "0.48765835",
            "sentiment_compound": 0.4137
        },
        {
            "id": "h0uh9nf",
            "score": 1,
            "text": "Oh no the hypocrisy of big business. This is a complete and utter shocker.😏",
            "title_similarity": "0.29694897",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h0uhb20",
            "score": 1,
            "text": "But they also donated hundreds of thousands to \"the other side\" so actually they're neutral and all right.\n\n/s obviously.",
            "title_similarity": "0.6026448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhcyx",
            "score": 1,
            "text": "Shocker. Performative activism for profit 🤣",
            "title_similarity": "0.35668868",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0uhduv",
            "score": 1,
            "text": "Corporate virtue signaling? Color me shocked",
            "title_similarity": "0.39247003",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0uhe93",
            "score": 1,
            "text": "But what are the alternatives?",
            "title_similarity": "-0.19958459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhenf",
            "score": 1,
            "text": "Where is Doctor Wenowdis when we need her?!",
            "title_similarity": "0.13409325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhi51",
            "score": 1,
            "text": "Corporations don’t care. They just pay for whatever is immediately beneficial.",
            "title_similarity": "0.30304357",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0uhk83",
            "score": 1,
            "text": "The true welfare queens, corporate lobbyists, lying through their teeth to benefit them and only them. Directly from the people who pay their employees barely over minimum wage and shit benefits so their CEOs and upper management can bag tens of millions a year. How completely on brand",
            "title_similarity": "0.7187296",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhnu6",
            "score": 1,
            "text": "Now, media owned by different corporations can hold each one accountable to their words... right?",
            "title_similarity": "0.33454895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhoq8",
            "score": 1,
            "text": "Elites having their cake and eating it too. A classic.",
            "title_similarity": "0.39973754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhouv",
            "score": 1,
            "text": "And not offering paternity leave.",
            "title_similarity": "-0.04523002",
            "sentiment_compound": 0.0382
        },
        {
            "id": "h0uhpap",
            "score": 1,
            "text": "And what are they waiting for?",
            "title_similarity": "-0.13626337",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhqjt",
            "score": 1,
            "text": "Typical.",
            "title_similarity": "-0.16247374",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhsj6",
            "score": 1,
            "text": "I have already stopped all expenses toward them! There are other resources, partake!",
            "title_similarity": "0.20508912",
            "sentiment_compound": -0.3578
        },
        {
            "id": "h0uhtxy",
            "score": 1,
            "text": "Just a reminder that no matter how much you do for the cause it will never be enough.",
            "title_similarity": "0.15289792",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h0uhv97",
            "score": 1,
            "text": "Wait, it’s not just Chick Fil-A???!?!",
            "title_similarity": "0.013545654",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhvfa",
            "score": 1,
            "text": "Wait a second... you mean to tell me big companies will do one thing publicly and then something totally different privately? Whoa, that blows my mind",
            "title_similarity": "0.4121948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhxuk",
            "score": 1,
            "text": "Can you imagine going to McDonald full of gay dudes. It’ll be most flamboyant sassy place to be. And lots of ass slapping without saying good game.",
            "title_similarity": "0.5204954",
            "sentiment_compound": -0.7101
        },
        {
            "id": "h0uhyho",
            "score": 1,
            "text": "Pay a livable wage first",
            "title_similarity": "0.14020024",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0uhyqf",
            "score": 1,
            "text": "Get the torches and pitchforks",
            "title_similarity": "0.046456136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhzd9",
            "score": 1,
            "text": "Humans don't care about substance, they care about appearances. Which is why everybody hated Chick-fill-a when they were openly anti-LGBT instead of also the other companies that support the same politicians as Chick-fill-a, but also paint their logos with rainbow colors.",
            "title_similarity": "0.4666812",
            "sentiment_compound": -0.119
        },
        {
            "id": "h0uhzv4",
            "score": 1,
            "text": "It's how they \"have it BOTH ways\"!",
            "title_similarity": "-0.024549395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uhzw0",
            "score": 3,
            "text": "Voting does not have to be about one topic.  The same with donating.",
            "title_similarity": "0.1248796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ui34y",
            "score": 1,
            "text": "How can anyone be surprised by this corporations and politicians are nothing more sleazy used car salesmen",
            "title_similarity": "0.6289464",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0ui38m",
            "score": 2,
            "text": "good for them",
            "title_similarity": "-0.058119647",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0ui3bb",
            "score": 1,
            "text": "So now corporate donations are cool again? Man, you guys are transparent.",
            "title_similarity": "0.4096046",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ui3tu",
            "score": 1,
            "text": "«You see, I play both sides that way I always end up on top.»",
            "title_similarity": "0.22011887",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0ui5nr",
            "score": 1,
            "text": "Hypocrisy at its most capitalistic",
            "title_similarity": "0.22486739",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ui5ya",
            "score": 1,
            "text": "The hypocrisy shown here is equal to the money spent.",
            "title_similarity": "0.2925598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uicqh",
            "score": 1,
            "text": "[This tweet](https://twitter.com/_AlexHirsch/status/1400119136198397953) from Alex Hirsch sums this up well.",
            "title_similarity": "0.3218629",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0uifiw",
            "score": 1,
            "text": "Trash gonna trash.",
            "title_similarity": "0.063180424",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uigmc",
            "score": 1,
            "text": "Well I mean if I donate money to a politician, does that mean I agree with absolutely everything they are for?",
            "title_similarity": "0.5898249",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0uiixv",
            "score": 1,
            "text": "Lol of course \nLook good infront of camera \nBut at the end of the day it’s profits \nFuck people end their causes",
            "title_similarity": "0.5378182",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h0uije1",
            "score": 1,
            "text": "If anyone believes a corporation is on their side, that’s on them. \n\nDoesn’t matter what fun PR they post this month. Theyre going to make whatever choice is best for them monetarily. Donate one way, PR another. Corporations don’t care. As long as consumers are dumb enough to believe they’re in their side, they win.",
            "title_similarity": "0.5645001",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h0uikda",
            "score": 2,
            "text": "I've just accepted that straight people are going to do whatever benefits them the most at the time and if it happens to align with me having human rights, cool.",
            "title_similarity": "0.23405969",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0uilqi",
            "score": 1,
            "text": "I'm sure everyone here will no longer support these companies over this right? /s",
            "title_similarity": "0.37283567",
            "sentiment_compound": -0.2865
        },
        {
            "id": "h0uinbo",
            "score": 1,
            "text": "The United Corporations of America is what weve become. Things like this are why i do not trust any big corporation because it is likely that they have been consumed by the dark side of capitalism smh",
            "title_similarity": "0.509967",
            "sentiment_compound": 0.0767
        },
        {
            "id": "h0uinux",
            "score": 2,
            "text": "Wow it’s almost like hear me out here\n\nTHEY DO IT FOR CLOUT\n\nI don’t get people who think these companies are all fully invested in pride since they only celebrate it in the west and where they will get good press for it",
            "title_similarity": "0.5134956",
            "sentiment_compound": 0.9357
        },
        {
            "id": "h0uip9p",
            "score": 2,
            "text": "People have been saying this kind of thing for years, but were shouted down as \"homophobic\". \n\nOh well.",
            "title_similarity": "0.54679716",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h0uiujh",
            "score": 1,
            "text": "Classic rainbow capitalism 🙄",
            "title_similarity": "0.27961624",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uivat",
            "score": 2,
            "text": "Who TF cares?",
            "title_similarity": "-0.13282724",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0uiyhc",
            "score": 1,
            "text": "That's corporate America.",
            "title_similarity": "0.34502736",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uiz9o",
            "score": 2,
            "text": "It's just like how at Xmas they do Xmas shit. In June they do pride shit. It's just a nice seasonal bonus they can use to exploit and profit.",
            "title_similarity": "0.52245444",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0uj0jf",
            "score": 1,
            "text": "It wasnt personal they just needed to influence people of power. They do it to everyone.",
            "title_similarity": "0.2566565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uj2vj",
            "score": 1,
            "text": "No one cares about pride except for the prideful who are sinful",
            "title_similarity": "0.18864939",
            "sentiment_compound": -0.7077
        },
        {
            "id": "h0uj394",
            "score": 1,
            "text": "This is not only issue they support; it not all or nothing. I guess they pick the candidates to support based on which one can get the most issues passed.",
            "title_similarity": "0.30829698",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0uj3uh",
            "score": 2,
            "text": "Those companies are based asf🔥👏🏿. Keep donating",
            "title_similarity": "0.3131729",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0uj3yn",
            "score": 1,
            "text": "I honestly think we need to have an amendment that states there needs to be a separation between state and corporations.",
            "title_similarity": "0.33404878",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0uj4k8",
            "score": 1,
            "text": "Their “support” for the LGBTQ+ community is literally all about money.",
            "title_similarity": "0.4882717",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uj58m",
            "score": 1,
            "text": "Corporations and politicians will do and say whatever they have to sell more products/get more votes and avoid being cancelled ... Yet we still trust them for some reason.",
            "title_similarity": "0.5474807",
            "sentiment_compound": -0.0422
        },
        {
            "id": "h0uj7ae",
            "score": 1,
            "text": "It’s 100% PR. These big companies don’t give a rats ass about lgbt rights. We are all just $$$ signs to companies and votes to the evil politicians.",
            "title_similarity": "0.7055819",
            "sentiment_compound": -0.836
        },
        {
            "id": "h0uj7rc",
            "score": 1,
            "text": "They only want money. They don’t care.",
            "title_similarity": "0.09948173",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0uj8tp",
            "score": 1,
            "text": "A.K.A The Three Horseman of the Apocalypse",
            "title_similarity": "0.24970287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uj8vh",
            "score": 1,
            "text": "Obviously?",
            "title_similarity": "-0.20214465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uja8e",
            "score": 1,
            "text": "worth noting it is totally possible that corporations and individuals support politicians for a few of the things they stand for but not all. it is difficult to find a candidate that supports 100% of the same things you do",
            "title_similarity": "0.6043931",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ujahb",
            "score": 1,
            "text": "Weird, it’s almost like corporations don’t give a shit, and are just using pride month as a way to generate more money.",
            "title_similarity": "0.591639",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h0uje62",
            "score": 1,
            "text": "Hypocrisy in Democracy 🤷🏻‍♂️",
            "title_similarity": "0.2302305",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ujex7",
            "score": 1,
            "text": "“We donated $5,000 to LGBT foundations. Now buy our pride merch!”",
            "title_similarity": "0.629404",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h0ujfk0",
            "score": 1,
            "text": "Hundreds of thousands which equals billions over decades.",
            "title_similarity": "0.3806399",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ujhwy",
            "score": 1,
            "text": "Dangerously Based",
            "title_similarity": "-0.13928258",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0ujj5w",
            "score": 1,
            "text": "Let the market place speak. Boycott the business.",
            "title_similarity": "0.22718064",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0ujjgm",
            "score": 1,
            "text": "Well yeah, it's good marketing to support pride but when the rubber meets the road they want their sweet sweet tax breaks",
            "title_similarity": "0.4683127",
            "sentiment_compound": 0.9337
        },
        {
            "id": "h0ujnn3",
            "score": 1,
            "text": "All I can think of is the mr krabs interview “and what do you have to say about all this beautiful pride?” “I like money :)”",
            "title_similarity": "0.49095",
            "sentiment_compound": 0.7978
        },
        {
            "id": "h0ujnre",
            "score": 2,
            "text": "I dont really care",
            "title_similarity": "-0.15754353",
            "sentiment_compound": -0.43
        },
        {
            "id": "h0ujo0h",
            "score": 1,
            "text": "Well, I mean, you can stop buying shit as much as possible and buy small and local whenever possible.  And then you say why as loudly as possible.\n\nMillennials and Gen Z are the big target demographic for corporations now, so maybe you guys can make a difference? \n\nI’m nearing retirement and I really wish I hadn’t bought crap thinking it would make me happy when I was younger.  It’s an addiction. It really is.   I bought stuff and it made me happy for a bit and then it got set aside.  Not hoarder level stuff but only because I didn’t keep it all. \n\nAnyway, I’m trying to do better now and by small and local when I need stuff, but it’s going to take younger people being smarter than I was to effect change (shouldn’t be too hard, lol).",
            "title_similarity": "0.649632",
            "sentiment_compound": 0.926
        },
        {
            "id": "h0ujp7v",
            "score": 1,
            "text": "Never understood how the US can call itself democracies when the amount of corporate lobbying is ridiculous. Any other country “lobbying” would be considered bribery/corruption.",
            "title_similarity": "0.5379778",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0ujpru",
            "score": 2,
            "text": "I feel like this has probably been mentioned because it’s quite obvious (almost as obvious as someone trying to farm karma with the generic “Pride celebration = bad!” mantra), but I’d be willing to bet my life that these companies didn’t donate to said politicians BECAUSE they voted against the Equality Act… I’m gonna take a guess and say that these companies donated money to the politicians because the politicians were able to help the companies become richer.",
            "title_similarity": "0.6713481",
            "sentiment_compound": 0.8805
        },
        {
            "id": "h0ujqs9",
            "score": 1,
            "text": "So don’t solicit those companies.",
            "title_similarity": "0.07851119",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ujvl6",
            "score": 1,
            "text": "Bring up the US/ Saudi Arabia/China rainbow logo chart",
            "title_similarity": "0.23619378",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ujx2f",
            "score": 1,
            "text": "None of these companies really care, they only care about virtue signaling to gain popularity points.",
            "title_similarity": "0.33128068",
            "sentiment_compound": 0.9432
        },
        {
            "id": "h0uk38b",
            "score": 1,
            "text": "wait so the corporations dont care about your every little pet cause and are just pandering to you for money? and you bought it? well color me shocked. who could have guessed this.",
            "title_similarity": "0.5109748",
            "sentiment_compound": -0.4919
        },
        {
            "id": "h0uk391",
            "score": 2,
            "text": "Let’s all start going to chick fil a at least once a week",
            "title_similarity": "0.32964826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uk3bb",
            "score": 4,
            "text": "Pride sells",
            "title_similarity": "0.08815572",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0ukbsu",
            "score": 1,
            "text": "3 of the worst",
            "title_similarity": "0.017195042",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0uke4y",
            "score": 2,
            "text": "I despise people/corporations who are on both sides of the fence. Reminds me a lot of Evangelicals... Jesus loves you, as long as you abide by the man-made churchy rules.",
            "title_similarity": "0.49671853",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ukmen",
            "score": 2,
            "text": "I’m truly shocked, who could have predicted this",
            "title_similarity": "0.06821898",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0ukmg5",
            "score": 2,
            "text": "Neoliberalism.",
            "title_similarity": "0.017990205",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uknbi",
            "score": 1,
            "text": "Be wary of any corporate entity that advertises their support of a group or cause. They don’t care. They just want your money.",
            "title_similarity": "0.3803137",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0ukqu9",
            "score": 2,
            "text": "No fucking duh. They don’t give a fuck. Not like anyone is actually going to do anything about it. That would take money out of all the politicians pockets from national to local.",
            "title_similarity": "0.446827",
            "sentiment_compound": -0.7789
        },
        {
            "id": "h0ukr5r",
            "score": 13,
            "text": "TFW Pride became more corporate than corporate Christmas parties are.",
            "title_similarity": "0.56408083",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0ukt09",
            "score": 1,
            "text": "Just think about it a little more as to why. This is our 🌎",
            "title_similarity": "0.07384087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uktwx",
            "score": 3,
            "text": "Did they vote for another issue that those companies wanted?",
            "title_similarity": "0.3598786",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ukubi",
            "score": 2,
            "text": "wait, do you think \"good\" big companies exists? how old are you?",
            "title_similarity": "0.4215796",
            "sentiment_compound": 0.504
        },
        {
            "id": "h0ukvgi",
            "score": 1,
            "text": "Sore losers",
            "title_similarity": "-0.014499633",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h0ul2a2",
            "score": 1,
            "text": "Playing both sides so they always win …",
            "title_similarity": "0.22092858",
            "sentiment_compound": 0.7063
        },
        {
            "id": "h0ul2z3",
            "score": 2,
            "text": "Ethics only enters business decisions insofar as it advances their business interests.\n\nNot saying there aren’t altruistic corps out there, but they are few and surprise ! Without regulatory oversight business is going to advance their business any way they can get away with it.",
            "title_similarity": "0.4687831",
            "sentiment_compound": 0.5334
        },
        {
            "id": "h0ul5xn",
            "score": 1,
            "text": "Two faced bastards.",
            "title_similarity": "0.06161706",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0ul8e5",
            "score": 2,
            "text": "Ahhh the mac strategy; play both sides",
            "title_similarity": "0.23795351",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0uldix",
            "score": 3,
            "text": "Corporations playing both sides? WHY AM I NOT SURPRISED?",
            "title_similarity": "0.36736977",
            "sentiment_compound": -0.1946
        },
        {
            "id": "h0uldsi",
            "score": 1,
            "text": "This is such a non-story. Businesses donate to politicians who will be most likely to provide tax breaks or other pro-business legislation. In most cases (Chick-fil-A being an exception) they aren't donating to these politicians because of their anti lgbtqiazm agendas. It's correlation not causation.",
            "title_similarity": "0.58790576",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0uln4v",
            "score": 2,
            "text": "It's [Corporate Virtue Signalling Month](https://i.redd.it/81vjoa0c6o271.jpg).",
            "title_similarity": "0.4213112",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0ulp43",
            "score": 1,
            "text": "This is just fuck! And there the same company’s that are selling all thing rainbow to make more $$$. Go back to the original pride symbol",
            "title_similarity": "0.6980281",
            "sentiment_compound": 0.126
        },
        {
            "id": "h0ulz17",
            "score": 1,
            "text": "###Hmmm.\n\nIt’s almost like they are soulless evil corporations.",
            "title_similarity": "0.35475627",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h0um1ch",
            "score": 1,
            "text": "Does this surprise you? Most companies have no ideology other than money.",
            "title_similarity": "0.42160362",
            "sentiment_compound": -0.0935
        },
        {
            "id": "h0um475",
            "score": 1,
            "text": "PR stunt",
            "title_similarity": "0.06212658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0um505",
            "score": 1,
            "text": "These companies always say something like “it’s better to be involved in the conversation.”\n\nBullshit.",
            "title_similarity": "0.33669662",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0um8vl",
            "score": 1,
            "text": "How come these corporations are only celebrating “pride” in Western Countries and not in the Middle East, Eastern Europe, or in parts of Asia? You know, where LGBTQ people are persecuted, thrown in jail, and sometimes executed? Not so woke are we? \n\nWalmart, McDonalds, Amazon?! Come on why are you celebrating this? They are terrible companies that just feed you woke bullshit so you will like them and buy their shit, otherwise, if they genuinely cared about pride they would be doing this everywhere, not just in Western Culture.",
            "title_similarity": "0.63924205",
            "sentiment_compound": 0.6721
        },
        {
            "id": "h0uma5r",
            "score": 2,
            "text": "It's almost like PR and accounting are two different departments",
            "title_similarity": "0.23669854",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h0umbzy",
            "score": 1,
            "text": "And this surprises you?",
            "title_similarity": "-0.093402416",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0umc3g",
            "score": 1,
            "text": "Greed has no shame.",
            "title_similarity": "0.072428346",
            "sentiment_compound": -0.0377
        },
        {
            "id": "h0umdu7",
            "score": 2,
            "text": "Cost of bribing politicians for getting their laws: hundreds of thousands.\n\nCost of not getting sweetheart laws enacted: probably millions.\n\nCost of changing your twitter account picture to your logo but with rainbows and doing nothing else to support those ideals: probably like $15 of intern time.",
            "title_similarity": "0.7593353",
            "sentiment_compound": 0.088
        },
        {
            "id": "h0umee3",
            "score": 2,
            "text": "It's all about managing \"optics\". They play both sides so that way they can say whatever fits the needed situation and time....And since most don't verify what they are being told (we know this is true) they can maintain a positive image to a given majority. \n\nVery few yet see this to be true, but after Trump I feel (hoping and being a bit optimistic) more are now beginning to see this sort of tactic. This article is evidence of that. So there is hope.",
            "title_similarity": "0.43845883",
            "sentiment_compound": 0.9371
        },
        {
            "id": "h0umef5",
            "score": 1,
            "text": "That's funny, they all contributed to Republicans and Democrats. Fancy that. Now the problem with this is what? Oh, not the Republican and Democrats? You don't say.",
            "title_similarity": "0.4541629",
            "sentiment_compound": 0.1431
        },
        {
            "id": "h0umggf",
            "score": 1,
            "text": "Omg, no way!",
            "title_similarity": "-0.18543181",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h0umhrr",
            "score": 2,
            "text": "They aren’t “celebrating” pride. They’re profiting on it.",
            "title_similarity": "0.23392797",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0umqe6",
            "score": 1,
            "text": "Ya companies are never for the people. They just want your money. Literally does not get more complicated than that. Only buy from the companies you want to support and hopefully they are small and local - to build better communities and raise our integrity and standards of living.",
            "title_similarity": "0.46483347",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h0ums6q",
            "score": 1,
            "text": "And how many donated to folks who supported an insurrection and overturning our democracy in favor of a theocratic authoritarian state?",
            "title_similarity": "0.5842314",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0umwer",
            "score": 2,
            "text": "Corporations should just be banned from making donations period.",
            "title_similarity": "0.27537507",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0umx8c",
            "score": 2,
            "text": "That’s an example of passive progressiveness.",
            "title_similarity": "-0.0063254274",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0un3so",
            "score": 1,
            "text": "People in the board of directors have personal money to those that voted against the act. A corporation giving money directly is illegal. Though PAC’s back by corporations are allowed. Thought I should clarify as many get this turned around.",
            "title_similarity": "0.59331155",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0un7fl",
            "score": 1,
            "text": "What about Chick-fil-A they are pride now too love their chicken",
            "title_similarity": "0.38469672",
            "sentiment_compound": 0.765
        },
        {
            "id": "h0un8bv",
            "score": 1,
            "text": "Sales",
            "title_similarity": "0.104901046",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0unbem",
            "score": 2,
            "text": "So are you going to stop buying from amazon?\n\nwe really need some anti-competitive passes on these companies again.  they're all bigger than MS and Ma Bell were when they got hit with lawsuits decades ago.  The problem is it needs to be a world wide effort to tone these people down because they are not in one country anymore.  I think the UN needs to kick out russia and china and grow some larger economic teeth.",
            "title_similarity": "0.6595199",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0unbnq",
            "score": 1,
            "text": "Its a bullshit headline they donate 50/50 to both dems and repubs.",
            "title_similarity": "0.5446793",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0ungk8",
            "score": 1,
            "text": "Politics is not one dimensional. You can support a politician and not support their entire platform.",
            "title_similarity": "0.25725162",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h0unhly",
            "score": 2,
            "text": "If anyone actually getting swayed by these fake campaigns anyway?",
            "title_similarity": "0.2309086",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0unjc4",
            "score": 2,
            "text": "These companies don’t care. They do what’s good for business. Owning politians on both sides is good. Pandering to the Pride movement is good too. \n\nStop acting like any of these places have a concious beyond making shareholders happy.",
            "title_similarity": "0.5292876",
            "sentiment_compound": 0.9538
        },
        {
            "id": "h0unlyd",
            "score": 2,
            "text": "companies during pride: \"Hello fellow gays! How do you do?\"",
            "title_similarity": "0.49061003",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h0unnjn",
            "score": 2,
            "text": "They only support during June",
            "title_similarity": "0.13486807",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0unt5s",
            "score": 1,
            "text": "Wait are you just now realizing they pretend to care about your idpol for money? Corporations couldn’t care less about “gay pride” but they are more than happy to pretend to care if they think it will make you buy their crap.",
            "title_similarity": "0.57421935",
            "sentiment_compound": 0.8679
        },
        {
            "id": "h0unv9q",
            "score": 1,
            "text": "You gotta cover all your bases, god forbid you forgot to pay someone off and you get on the front page news.",
            "title_similarity": "0.45321524",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0unvl1",
            "score": 1,
            "text": "Only supporting this month because they have to play all sides constantly and consistently. It’s all about money.",
            "title_similarity": "0.47854853",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0unwuf",
            "score": 1,
            "text": "The Equality Act is nothing more than an oxymoron anyways",
            "title_similarity": "0.22404903",
            "sentiment_compound": -0.1935
        },
        {
            "id": "h0unyeg",
            "score": 1,
            "text": "I pay the same amount of taxes as straight people.  Equality for ALL or I want a discount.",
            "title_similarity": "0.43581563",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0unyy6",
            "score": 1,
            "text": "Thanks for letting us know. I am sure we will now see an immediate response from all our socially conscious readers and boycott anything from Amazon, McDonalds and Walmart. Sure.",
            "title_similarity": "0.5861862",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0uo087",
            "score": 2,
            "text": "Corporations: I play both sides so I always comeout on top.",
            "title_similarity": "0.39480793",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0uo30f",
            "score": 1,
            "text": "That’s because these companies aren’t in it for the cause or anything cause. They are in it to make them look good",
            "title_similarity": "0.30902508",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0uo5ou",
            "score": 1,
            "text": "Corporations aren't your friends. They exist to make money at all costs, regardless of social or environmental damage. That should be the #1 lesson to learn in this country.",
            "title_similarity": "0.52392673",
            "sentiment_compound": -0.696
        },
        {
            "id": "h0uo6ig",
            "score": 1,
            "text": "Yeah I hate McDonald’s and Walmart now",
            "title_similarity": "0.36978668",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0uojr5",
            "score": 1,
            "text": "I hope they stop celebrating pride and donations to politicians as corporations.",
            "title_similarity": "0.6029207",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0uonjp",
            "score": 1,
            "text": "Although this is for a good thing, companies should NOT be influencing politicians with donations, voters should with votes",
            "title_similarity": "0.36537746",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0uoqqf",
            "score": 1,
            "text": "Hypocrisy will always be rampant in American politics",
            "title_similarity": "0.34834263",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uoqz9",
            "score": 2,
            "text": "*mega corporations donates to politicians in a move to maximize profit*\n\n*mega corporation celebrates a (now) safe, mainstream cultural movement in a move to maximize profit*\n\nThe end.",
            "title_similarity": "0.66239065",
            "sentiment_compound": 0.9081
        },
        {
            "id": "h0uoubj",
            "score": 1,
            "text": "It’s all for PR. They don’t do a damn thing without weighing the impact on the bottom line.\n\nThey did a cost analysis of this move, and they absolutely found the benefits outweigh the risks. No question.",
            "title_similarity": "0.42493463",
            "sentiment_compound": -0.483
        },
        {
            "id": "h0uouus",
            "score": 1,
            "text": "Co-op and sell.\n\nThat be the name of the game",
            "title_similarity": "0.1570545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uovhp",
            "score": 1,
            "text": "I mean if that’s where you want to start with their misdeeds",
            "title_similarity": "-0.007099189",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0uowd1",
            "score": 1,
            "text": "How is this shocking? The politicians who are capatalist pigs are the same ones that are conservative homophobic trash?  Corporations are going to go with the moneymakers regardless of the other political positions.  Are people so naive to think otherwise?",
            "title_similarity": "0.5783715",
            "sentiment_compound": -0.7511
        },
        {
            "id": "h0up04q",
            "score": 1,
            "text": "Corporations almost always give equal money to both sides.",
            "title_similarity": "0.46304068",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0up17r",
            "score": 1,
            "text": "Keep in mind the people in those companies that are paying that money might not be the same as the ones celebrating pride, so it might not be as deceitful as it looks",
            "title_similarity": "0.4661991",
            "sentiment_compound": 0.8179
        },
        {
            "id": "h0up3kz",
            "score": 1,
            "text": "Corporations saying something nice to a minority group, yet putting money into social engineering their values. Get rid of Citizens United and corporations will not have such an easy time running your lives.",
            "title_similarity": "0.581853",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h0up4j3",
            "score": 1,
            "text": "Yea, their customers don’t make laws. However, politicians have stock in those companies so the politicians don’t care if the consumer image is against their political beliefs because $$$$&$$$$$",
            "title_similarity": "0.5770128",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0up5dh",
            "score": 2,
            "text": "WalMart sells goods produced by a regime who is committing the worst genocide since the Nazis during WWII. But you think consumers will care because \"rainbow\" ha! Price drives the American consumer, not morals.",
            "title_similarity": "0.63579094",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h0up5gx",
            "score": 1,
            "text": "The irony...",
            "title_similarity": "-0.10196282",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0up95f",
            "score": 1,
            "text": "I'm shocked and appalled. How could they??",
            "title_similarity": "0.079183705",
            "sentiment_compound": -0.6868
        },
        {
            "id": "h0upb1y",
            "score": 1,
            "text": "Err, you are right.",
            "title_similarity": "-0.12988043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0upbmg",
            "score": 1,
            "text": "Just one question why do you think cooperation care about your or anyone rights ? The reason They exist is to made profits not to care about your rights. Hate it or love it you have to take it Bc I’m just speaking the truth",
            "title_similarity": "0.36085147",
            "sentiment_compound": 0.7409
        },
        {
            "id": "h0upgm2",
            "score": 3,
            "text": "I love all the feigned outrage in here about this... Likes its some big discovery that corporations don't double dip.",
            "title_similarity": "0.4861336",
            "sentiment_compound": 0.631
        },
        {
            "id": "h0upjgn",
            "score": 1,
            "text": "But yeah, people boycott CFA instead",
            "title_similarity": "0.23421752",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h0upjzp",
            "score": 1,
            "text": "Oh no",
            "title_similarity": "-0.22971365",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0upnxs",
            "score": 1,
            "text": "\\>among",
            "title_similarity": "-0.12067133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0upp6d",
            "score": 1,
            "text": "While you’re outraged at this be outraged at Palestine supporters bc Arabic countries treat LGBT like a cancer...",
            "title_similarity": "0.43617648",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0upqam",
            "score": 1,
            "text": "Why are there no pride flags for sale at Walmart?",
            "title_similarity": "0.32851386",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h0uprbr",
            "score": 1,
            "text": "Why do people think businesses actually care about any of that? If rainbow flags make them more money, and donating to anti gay politicians make them money, they will do both! No corp cares about ANY social issue of any kind, period. Why does this surprise people?",
            "title_similarity": "0.5773675",
            "sentiment_compound": 0.5643
        },
        {
            "id": "h0upwg5",
            "score": 1,
            "text": "Hundreds of thousands of dollars???  I'm breaking the law if I donate $2,801 so why isn't it the same for EVERYONE???",
            "title_similarity": "0.6867683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0upxr0",
            "score": 1,
            "text": "I wish people would stop acting like the mandatory corporate bribes in America is a company supporting policy. It isn't. It is companies trying to avoid getting singled out for political witchhunts.\n\nBack when they started Microsoft tried to stay apolitical. They didn't endorse any party or candidates, pay into PACs, etc. Then they got run through the ringer of antitrust lawsuits.\n\nNow they pay their bribes and no one bothers them, just like no one bothers Amazon for completely dominating their market, or Uber/Lyft for running what was effectively illegal taxi companies, Apple for hiding trillions offshore to avoid taxes, etc. McDonald's isn't pro gun or pro LGBT or pro life or pro choice. They are pro government not ruining their business model.",
            "title_similarity": "0.6031482",
            "sentiment_compound": -0.5351
        },
        {
            "id": "h0upzsl",
            "score": 1,
            "text": "Anything corporations do is always about the business. Never about the people. Business and money come first.",
            "title_similarity": "0.4405086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uq1l2",
            "score": 1,
            "text": "It's sad to see people exploited for income.....",
            "title_similarity": "0.31385526",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h0uq1o5",
            "score": 1,
            "text": "I don’t see why all the hub-bub!\nCorporations are treating the LGBTQ community with equality. They shit on us just like everyone else.  The only difference is we have a multiple rainbows with different pallets while the corporations have only and is all about the green.",
            "title_similarity": "0.5635315",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h0uq1ru",
            "score": 1,
            "text": "Not saying it's wise how they spend the political dollars, but a few hundred K to these companies is fart in the wind money. Literally nothing. Doesn't look good exactly but not really enough money that any higher ups in the company even knew it was happening.",
            "title_similarity": "0.57202184",
            "sentiment_compound": 0.1983
        },
        {
            "id": "h0uq51h",
            "score": 1,
            "text": "[nothing new](https://youtu.be/yNY8849DogY)",
            "title_similarity": "0.06871949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uq8po",
            "score": 1,
            "text": "Wait you guys are only figuring out that corporations don’t care about you or your rights ***NOW???***\n\nI thought it was common knowledge that every pride icon on the social media of a multi-billion dollar corporation was a total sham.",
            "title_similarity": "0.6122562",
            "sentiment_compound": 0.7303
        },
        {
            "id": "h0uq8u7",
            "score": 1,
            "text": "Well ain't that a coincidence",
            "title_similarity": "-0.07421051",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0uqgy5",
            "score": 1,
            "text": "Are you really surprised?",
            "title_similarity": "-0.10013719",
            "sentiment_compound": 0.2944
        },
        {
            "id": "h0uqia9",
            "score": 1,
            "text": "No fucking way",
            "title_similarity": "-0.18310492",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0uqlic",
            "score": 1,
            "text": "What a surprise",
            "title_similarity": "-0.11635937",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0uqtbn",
            "score": 1,
            "text": "Local company not on Amazon, shipped via USPS",
            "title_similarity": "0.19184953",
            "sentiment_compound": -0.1326
        },
        {
            "id": "h0uqzy8",
            "score": 1,
            "text": "And this is why rainbow capitalism isn’t a leftist thing, nor is it a sign of progress",
            "title_similarity": "0.22819099",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0ur3pm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.13217586"
        },
        {
            "id": "h0ur43l",
            "score": 1,
            "text": "Some companies will donate to campaigns on both sides. Corporations pay to play",
            "title_similarity": "0.5756032",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0urkyb",
            "score": 1,
            "text": "It would be much much better if they invested that money in the market instead of giving it freely to a marginalized minority.",
            "title_similarity": "0.34099892",
            "sentiment_compound": 0.802
        },
        {
            "id": "h0urmkc",
            "score": 1,
            "text": "Everything is business for this Corporation.",
            "title_similarity": "0.3075461",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0urmpq",
            "score": 1,
            "text": "They can talk all they want, but it never changes what they do.",
            "title_similarity": "0.14511621",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h0urmqz",
            "score": 2,
            "text": "This is the dumb thing: Companies pay millions of dollars to both sides to cover their asses, all the while being insincere and turning around and charging more for their products and services to cover their costs.  Dumb. Thing.  Also, this action does nothing except raise prices and further our divisions. Stop. Stop it. Stop the dumb things.",
            "title_similarity": "0.64674747",
            "sentiment_compound": -0.9565
        },
        {
            "id": "h0urtoj",
            "score": 1,
            "text": "Tell the customer what they want to hear while bribing, excuse me donating to politician that will pass legislation that favors them. Which in this case are the politician who are against those customers and their supporters.",
            "title_similarity": "0.5580505",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0us0lv",
            "score": 1,
            "text": "**LEGAL REMINDER - Corporations are *prohibited* from donating to politicians.** Corporate PACs can donate up to $5,000 to a politican in any given election cycle, but corporate treasury funds can't fund such donations. The corporation can only fund operating costs of the PAC itself.",
            "title_similarity": "0.62055993",
            "sentiment_compound": 0.4246
        },
        {
            "id": "h0us3z0",
            "score": 1,
            "text": "It’s almost like they are playing both sides of the fence, huh? Stop shopping at these places if you actually give a fuck!",
            "title_similarity": "0.26199883",
            "sentiment_compound": -0.4561
        },
        {
            "id": "h0us4qg",
            "score": 1,
            "text": "At least their support, even if it is just a front to get more customers, is making the LGBTQ community normalized. It wasn’t that long ago when companies wouldn’t have dared to acknowledge pride month…",
            "title_similarity": "0.48840016",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0us615",
            "score": 1,
            "text": "Anyone with half a fucking brain knows these companies are just trying to cash in on it. They’ll do anything and everything to increase revenue, which includes woke advertising and paying off politicians. All in a days work",
            "title_similarity": "0.63244134",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0us7u8",
            "score": 1,
            "text": "Yes their a company. Just like how all these companies won't change their logos for pride month in middles Eastern countries and how the US government won't do the same when it comes to the policy of putting a trans flag in embassies.\n\nThey pander to their audience. Don't like what they do take your business elsewhere you as the consumer and have the same power of basically voting these businesses out. Just don't use their services that's your vote.",
            "title_similarity": "0.59185636",
            "sentiment_compound": 0.6694
        },
        {
            "id": "h0us9qb",
            "score": 1,
            "text": "Who cares? If this is your source of pride, you should raise your standards.",
            "title_similarity": "0.14104529",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0usivu",
            "score": 1,
            "text": "Customers.  All they see is customers.",
            "title_similarity": "0.20250173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0usjs6",
            "score": 2,
            "text": "These companies are just pandering.  It’s disappointing to me that these companies only  “celebrate” pride month to sell their product.",
            "title_similarity": "0.60255206",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0usmsw",
            "score": 1,
            "text": "I've not deleted a comment or post in my five years on Reddit. I stand behind everything I've said.\n\nMy guess is you've been shadow banned for one of the many stupid things you've said.",
            "title_similarity": "0.58280045",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h0usnny",
            "score": 1,
            "text": "They probably paid them for favours in other areas",
            "title_similarity": "0.11691405",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0usnws",
            "score": 1,
            "text": "Does anybody really believe that corporations care about racism or lgbtq rights or any of the other social issues? If they cared about racism for instance they would have been attempting to change things before it became cool to do so.  They’re going with the trends in America to pad their bottom lines and that’s it",
            "title_similarity": "0.49526864",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0uspfs",
            "score": 1,
            "text": "Nice",
            "title_similarity": "-0.10239308",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0usxqn",
            "score": 1,
            "text": "We gonna forget George W Bush campaigned against same sex marriage in 04 and won re-election?",
            "title_similarity": "0.6322049",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0uszxg",
            "score": 1,
            "text": "i love walmart, mcdonalds, and amazon even more than chikfila",
            "title_similarity": "0.56767696",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0ut0oh",
            "score": 1,
            "text": "So you’re saying that people have supported politicians who they don’t agree with 100% of the time?  Isn’t that normal?",
            "title_similarity": "0.6501993",
            "sentiment_compound": 0.6322
        },
        {
            "id": "h0ut38l",
            "score": 2,
            "text": "Here’s a comprehensive list of people who are shocked by this:",
            "title_similarity": "0.2159056",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0ut3p1",
            "score": 1,
            "text": "I can’t stop laughing.",
            "title_similarity": "0.08018574",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0utfuk",
            "score": 2,
            "text": "There are reasons that have nothing to do with Pride not to spend money any of these places, even. LOL",
            "title_similarity": "0.16385101",
            "sentiment_compound": 0.7125
        },
        {
            "id": "h0utizm",
            "score": 2,
            "text": "Corporations donate to both sides.  I don't think that is relevant to their genuine political position.  But I would imagine it is whatever will make them the most money.",
            "title_similarity": "0.5739828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0utk9z",
            "score": 2,
            "text": "Better yet, how much money did all these companies flying the rainbow flag donate to the Republicans currently passing anti trans legislation?",
            "title_similarity": "0.70660126",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0utqlk",
            "score": 1,
            "text": "Nice. (Opinion) Coercion via money. Such shame in knowing that both sides are effected equally when money gets involved.\n\nWe’ve been through money and politicians before; now we are endorsing it.",
            "title_similarity": "0.4935812",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0uts8i",
            "score": 1,
            "text": "These companies don't care that they're utter amoral hypocrites.\n\n#STOP SHOPPING THERE.\n\nThat is the ONLY thing that will fix any of this.",
            "title_similarity": "0.33928007",
            "sentiment_compound": -0.8279
        },
        {
            "id": "h0utsj4",
            "score": 1,
            "text": "It’s like it’s all just pandering to sell to “woke” idiots",
            "title_similarity": "0.27483097",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0utsrs",
            "score": 2,
            "text": "this isnt the problem of these companies, for them its just marketing. Its the problem of dumbasses who act suprised when this shit happens.",
            "title_similarity": "0.36308146",
            "sentiment_compound": -0.69
        },
        {
            "id": "h0utt0v",
            "score": 1,
            "text": "New meaning to the phrase Both Sides",
            "title_similarity": "-0.052071147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0utuld",
            "score": 2,
            "text": "And sadly, if next week they legalized hanging members of the LBGTQ community, Amazon and Walmart would battle to sell the rope while McDonalds stocks the concession stands. Fair weather capitalists.",
            "title_similarity": "0.72515774",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0utvpj",
            "score": 1,
            "text": "Those companies gotta get their money back some how?",
            "title_similarity": "0.3398552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0utwja",
            "score": 2,
            "text": "You wanna support pride? Gimme a McDonald's commercial with a rainbow haired Ronald McDonald waving around a pride flag all around town next to crying fat rednecks scarfing down Big Macs.",
            "title_similarity": "0.68554914",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0uty1z",
            "score": 1,
            "text": "I wonder how many of the >1.3k comments actually read the bill or if they just read “equality” and thought yes it had a good word in it therefore it must be good",
            "title_similarity": "0.47763458",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0uty86",
            "score": 1,
            "text": "I'm beginning to think these billion dollar corporations don't actually care about social issues at all!",
            "title_similarity": "0.5049026",
            "sentiment_compound": -0.4442
        },
        {
            "id": "h0utz1g",
            "score": 1,
            "text": "Cucko",
            "title_similarity": "-0.067203395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0utzgi",
            "score": 1,
            "text": "Oh. Jesus.",
            "title_similarity": "-0.124623224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uu2hh",
            "score": 1,
            "text": "I see posts like this all the time but when you mention that this is normal under capitalism, everyone looses their minds.",
            "title_similarity": "0.45923388",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h0uu3q6",
            "score": 1,
            "text": "It’s all about the money",
            "title_similarity": "0.18934959",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uu3yb",
            "score": 1,
            "text": "It’s almost like the first democracy in the world is still in alpha. Lol",
            "title_similarity": "0.3004321",
            "sentiment_compound": 0.6133
        },
        {
            "id": "h0uu5dx",
            "score": 1,
            "text": "They put on a mask to appease the masses, all the while doing their self interested business behind closed doors. Every business does this. No suprise sadly.",
            "title_similarity": "0.38875383",
            "sentiment_compound": 0.5621
        },
        {
            "id": "h0uu5gh",
            "score": 1,
            "text": "Well, yeah.",
            "title_similarity": "-0.20935957",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0uu6he",
            "score": 1,
            "text": "I’m pretty sure playing both sides is the American way.",
            "title_similarity": "0.18454736",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0uu7je",
            "score": 1,
            "text": "Serious question.  How does one donate money to a politician? Don’t they make enough money? What does said politician do with the donated money?",
            "title_similarity": "0.56457937",
            "sentiment_compound": -0.212
        },
        {
            "id": "h0uu818",
            "score": 1,
            "text": "\"I am shocked! Shocked! Well not that shocked.\"",
            "title_similarity": "-0.058518115",
            "sentiment_compound": -0.2783
        },
        {
            "id": "h0uub8m",
            "score": 1,
            "text": "Welcome to corporate greed. These companies spend lots on advertising. But you now realize what the truth in advertising really. \n\nBuy from us, we will pretend we support you. HAHA on you,  I have my own interest in my plan.",
            "title_similarity": "0.55657744",
            "sentiment_compound": 0.9446
        },
        {
            "id": "h0uudlo",
            "score": 1,
            "text": "Color me shocked.",
            "title_similarity": "-0.059271835",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0uuk0z",
            "score": 1,
            "text": "I generally take headlines like these with a grain of salt because bill titles can be misleading and full of pork/poison pill line items that congresspeople have to vote against",
            "title_similarity": "0.5323899",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0uun38",
            "score": 1,
            "text": "It's always about the posturing, never about the actual cause.\n\nPeople need to learn that you CANNOT trust corporations.",
            "title_similarity": "0.30875295",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h0uut3f",
            "score": 1,
            "text": "It’s easy to placate to the fools of the world by spending 15 minutes to issue a tweet so the masses will be distracted by it.\n\nCompanies and politicians and foreign enemies fully realizing the human race has devolved into a bunch of moths happily flying into bug zappers.",
            "title_similarity": "0.63730955",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0uuw8u",
            "score": 1,
            "text": "Corporations are soulless and will ultimately do 1 thing and 1 thing only. Wherever they can make a profit they will pursue the avenue. \n\nDo you think they give 2 shits about LGBTQ rights? Absolutely not. But they will pay lip service to the LGBTQ to earn business from members and supporters of the group. And out of the same mouth they will donate untold amounts of cash to groups like the GOP who LOATHE the existence of LGBTQ people because the GOP give them ridiculous tax breaks and allow them to cheat the system further. \n\nTake money out if the equation and you will see them completely disappear from the political spectrum.",
            "title_similarity": "0.65336215",
            "sentiment_compound": -0.8266
        },
        {
            "id": "h0uv7sd",
            "score": 1,
            "text": "Dont let them trick you",
            "title_similarity": "-0.11239371",
            "sentiment_compound": 0.0382
        },
        {
            "id": "h0uvqpb",
            "score": 2,
            "text": "Oh wait, so you’re saying they only care about ____ issue when it’s 100% legal and advantageous to them?! No????\n\nLook at companies with gay flag logos Middle East country pages… no gay flags to be seen.",
            "title_similarity": "0.52962756",
            "sentiment_compound": 0.7393
        },
        {
            "id": "h0uvrso",
            "score": 1,
            "text": "So everyone realizes Pride is just a brand loyalty marketing campaign now, right?",
            "title_similarity": "0.419767",
            "sentiment_compound": 0.7322
        },
        {
            "id": "h0uvxtu",
            "score": 2,
            "text": "corporations and celebrities are not beacons of morality; they are followers and not leaders. they did not get where they are and they do not stay where they are by upsetting people.",
            "title_similarity": "0.34257466",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0uw2hh",
            "score": 2,
            "text": "y’all are surprised? lmao",
            "title_similarity": "0.034897804",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0uw7s0",
            "score": 1,
            "text": "To hell with them all. Can't stand any of these outlets anyway, and generally try to avoid them.",
            "title_similarity": "0.13344425",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h0uwa6c",
            "score": 1,
            "text": "pan·der\n/ˈpandər/\n Learn to pronounce\nverb\ngerund or present participle: pandering\ngratify or indulge (an immoral or distasteful desire, need, or habit or a person with such a desire, etc",
            "title_similarity": "0.203015",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0uwll8",
            "score": 1,
            "text": "No",
            "title_similarity": "-0.22258738",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0uwnkn",
            "score": 3,
            "text": "It’s almost like they pander to everyone.",
            "title_similarity": "0.19828016",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h0uww4q",
            "score": 2,
            "text": "It’s all just a big dog and pony show",
            "title_similarity": "0.2872489",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ux2rx",
            "score": 2,
            "text": "Companies do this because they like the short term jump on the band wagon.",
            "title_similarity": "0.3560234",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0uxbwk",
            "score": 3,
            "text": "Begin to realize these companies don’t care about pride month. They just post some message, toss them some red meat and continue on doing things like this",
            "title_similarity": "0.5124402",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h0uxcto",
            "score": 1,
            "text": "I’ll reiterate: The people against this legislation), and I’ll reiterate: The people against this legislation), and I’ll reiterate: The people against this legislation are fucking disgusting pieces of filth.",
            "title_similarity": "0.27274087",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h0uxezh",
            "score": 2,
            "text": "For too long companies have been treating LGBTQ+ pride as a tool to try to score cheap PR points.\n\nAnybody else remember that time EA declared their customers homophobes for not liking the rush job that was ME3 and put out that \"Stand with Yoda against homophobia\" petition that was full of fake comments? \"galopping stupidity\" is still seared into my brain.",
            "title_similarity": "0.6278409",
            "sentiment_compound": -0.7057
        },
        {
            "id": "h0uxi9c",
            "score": 3,
            "text": "You can simultaneously support a cause, as well as politicians that may not support the same things. It’s okay.",
            "title_similarity": "0.29434335",
            "sentiment_compound": 0.5334
        },
        {
            "id": "h0uxzrl",
            "score": 2,
            "text": "You gotta play both sides to win the game.",
            "title_similarity": "0.20983714",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0uy1u1",
            "score": 1,
            "text": "They do it for the money. They support the community in their pocket. And that’s all",
            "title_similarity": "0.34018362",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0uy2rc",
            "score": 1,
            "text": "Probably because they don’t actually care and only do what’s good for business.",
            "title_similarity": "0.23994502",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0uya8x",
            "score": 1,
            "text": "Corporations own the us",
            "title_similarity": "0.38219425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uyf96",
            "score": 1,
            "text": "Anybody surprised that the companies selling the shittiest stuff would do this to sell more shitty stuff?\n\nNext well find out that nestle bought land in the town next to the town that made them stop syphoning theirs water supply.",
            "title_similarity": "0.53646195",
            "sentiment_compound": -0.8173
        },
        {
            "id": "h0uyfs8",
            "score": 2,
            "text": "I’ll donate to the Stop Sticking Your Tongue Out For Every Picture act.",
            "title_similarity": "0.43189317",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0uyg92",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.19453818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uykir",
            "score": 1,
            "text": "So basically what you’re saying is “ corporations do what’s in their best interest to make more money and politicians accept money from corporations to do what’s in the corporations best interests.”",
            "title_similarity": "0.56948745",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h0uykja",
            "score": 1,
            "text": "Stop pretending corporations aren't playing both sides. I'm sure they've donated hundreds of thousands to politicians who voted for the act too.",
            "title_similarity": "0.8334979",
            "sentiment_compound": -0.0237
        },
        {
            "id": "h0uylrs",
            "score": 1,
            "text": "Anything for profits",
            "title_similarity": "0.15892878",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0uynhg",
            "score": 1,
            "text": "why are tongue selfies a thing?",
            "title_similarity": "0.15808171",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uz8pb",
            "score": 1,
            "text": "A capitalistic ethos becomes incoherent if policy isn't for sale on some level or through some technicalities, so there goes that.",
            "title_similarity": "0.23838697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uzbq3",
            "score": 1,
            "text": "Wow that’s ridiculous. It’s tome to buy small and local y’all.",
            "title_similarity": "0.2452502",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0v01hd",
            "score": 1,
            "text": "The hypocrisy is reel",
            "title_similarity": "0.07985476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v05bc",
            "score": 1,
            "text": "If this surprises you in the slightest, surprise you’re a complete idiot",
            "title_similarity": "0.07134903",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0v0g1o",
            "score": 1,
            "text": "We'll just call this the last surprising thing I've read today.",
            "title_similarity": "0.22982953",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0v0gfd",
            "score": 1,
            "text": "Corporate money has been in politics for over 150 years.  Politicians need money. They like money. They love money. And there is no way they are going to say, nah, none for me thanks.",
            "title_similarity": "0.7459848",
            "sentiment_compound": 0.4007
        },
        {
            "id": "h0v0pof",
            "score": 1,
            "text": "Virtue signaling",
            "title_similarity": "-0.06310461",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0v0tfr",
            "score": 1,
            "text": "Wait so virtue signaling doesn’t actually mean they support an issue? *shocked pikachu face",
            "title_similarity": "0.26151145",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h0v0toq",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "-0.18657234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v0unm",
            "score": 1,
            "text": "Local company not on Amazon, shipped via USPS",
            "title_similarity": "0.19184953",
            "sentiment_compound": -0.1326
        },
        {
            "id": "h0v13ok",
            "score": 1,
            "text": "SCP-4493 rears its head again",
            "title_similarity": "0.010796083",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v1ebx",
            "score": 1,
            "text": "To me as somebody that isn’t a member of the lgbtq+ community, it looks like they’re trying to capitalize on all of their struggles, stories, accomplishments, etc to pander and make a buck.",
            "title_similarity": "0.4900054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v1icu",
            "score": 1,
            "text": "They say they’re an ally but are plunging a knife in the backs of the downtrodden. Corporations are jackals with rabies and the politicians are vultures that feed off the jackals kill. We will all realize one day that our hard earned and unfairly taxed wages aren’t being utilized to their full potential. The commoners will have the power some day but that day is not soon.",
            "title_similarity": "0.568267",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h0v1lgt",
            "score": 2,
            "text": "Oh no! It's almost as if.... all they care about is LOOKING like they support Pride Month so they can keep getting your money! \n\nOh wait... that's exactly what it is, and has always been. Just like BLM and so on and so forth.",
            "title_similarity": "0.47930768",
            "sentiment_compound": 0.9167
        },
        {
            "id": "h0v1qhg",
            "score": 1,
            "text": "So, scumbag politicians don’t support diverse so massive companies give them millions? That can only go well.",
            "title_similarity": "0.65573406",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0v24xo",
            "score": 1,
            "text": "This is why I sigh when people say things are getting better just because companies are slapping a rainbow flag on their logo. These corporate companies don't give a fuck about people they just want your money and the politician on its side regardless of what they stand for.",
            "title_similarity": "0.60572875",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h0v2dpc",
            "score": 1,
            "text": "Playing PR to both sides?  Not business.  They aren't dumb. They see the progression of society and what the future holds.  But they also know the regressive right wing and their \"tradition\".",
            "title_similarity": "0.35348395",
            "sentiment_compound": 0.3074
        },
        {
            "id": "h0v2etq",
            "score": 1,
            "text": "This isn’t even irony. This is business as usual. \n\n😕",
            "title_similarity": "0.10310902",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0v306g",
            "score": 2,
            "text": "Unpopular opinion, but who cares if big corporations are exploiting Pride for profits. To me what matters is the fact that it’s bringing LGBT out of the sidelines and into the norms of society. The more this happens, the faster the younger generations will be to fully embrace LGBT as a normal/equal part of society while the older generations chastising it die out. This kind of corporate “celebration” of Pride was unheard of just 10-15 years ago, so i welcome it, whatever the true intentions may be.",
            "title_similarity": "0.6163519",
            "sentiment_compound": 0.9179
        },
        {
            "id": "h0v35t5",
            "score": 2,
            "text": "What if these companies cared? Just a bit. What if the guy they pay now for low taxes is replaced by someone who go cares for us lil folk; the employees, the essential bastards? We can replace the worst of them. Don’t let them steal your shit cuz you are nice. Raise hell",
            "title_similarity": "0.59611607",
            "sentiment_compound": -0.9409
        },
        {
            "id": "h0v3705",
            "score": 2,
            "text": "So technically anyone who goes there that is in the LGBTQ community is against whatever......",
            "title_similarity": "0.22617516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v3bdk",
            "score": 1,
            "text": "This sort of thing is exactly what a lot of people have to watch out for as well.  \nI know corporations actually aiming at minorities who have otherwise been ignored feels good, but this is exactly how movements lose their teeth.  \nThis is how Mothers Day went from being many things, including a peace movement, to just being a day Mom gets a few half-hearted thank yous and perhaps breakfast in bed.   \nThis is how we're going to see human rights eroded as people happily paint their bedrooms, their clothes, and their cars with flags and pins to show the world how they feel while supporting corporations that quite frankly see them as filth to pry money from. \n\nAnd it's not just on a 'we're using that money you used to buy a flag to convince your politicians that you don't deserve human rights.'\n\nThey're going to be doing whatever they can to smooth Pride and any other major LBGTQ event out to being the most normal and most profitable event it can be.",
            "title_similarity": "0.6236708",
            "sentiment_compound": 0.9775
        },
        {
            "id": "h0v3dxu",
            "score": 2,
            "text": "Companies don't give a damn about Pride or BLM or really anything. They just see an opportunity to sell you shit.",
            "title_similarity": "0.31649536",
            "sentiment_compound": 0.4325
        },
        {
            "id": "h0v3lhs",
            "score": 1,
            "text": "It's just business for them to expect anything more is just disappointment",
            "title_similarity": "0.22380245",
            "sentiment_compound": -0.552
        },
        {
            "id": "h0v3vdw",
            "score": 1,
            "text": "Would be nice if they used that money to raise wages",
            "title_similarity": "0.32732892",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0v3wrn",
            "score": 1,
            "text": "Gross. 🤢🤮",
            "title_similarity": "-0.094329745",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0v4155",
            "score": 1,
            "text": "Bo Burnham was bang on",
            "title_similarity": "0.028690595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v42ia",
            "score": 1,
            "text": "Just to be clear, these companies donate to senators and representatives on all sides. They donate to EVERYTHING. Their loyalty is not to a cause or any political agenda. They are businesses and they are after money and power. Period. \n\nIt’s always useful to have a congressman in your back pocket.",
            "title_similarity": "0.6420944",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h0v48ia",
            "score": 2,
            "text": "Pride for show, donate for dough.",
            "title_similarity": "0.26214868",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0v4akd",
            "score": 1,
            "text": "Oh how can this be?   Oh.  It’s all about the money folks.",
            "title_similarity": "0.27534837",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v4aur",
            "score": 1,
            "text": "Opportunism.  Plain and simple.",
            "title_similarity": "-0.073516384",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0v4caa",
            "score": 1,
            "text": "They play all sides, donate to everyone.",
            "title_similarity": "0.3179062",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0v5i5h",
            "score": 1,
            "text": "Buy our stuff even if we don’t care about you",
            "title_similarity": "0.17620629",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0v668u",
            "score": 1,
            "text": "What do they do in the Middle East.",
            "title_similarity": "0.017189618",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v6py4",
            "score": 2,
            "text": "Companies pretending to care to earn more money? What else is new",
            "title_similarity": "0.32908273",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0v6yg4",
            "score": 1,
            "text": "So these folks need to figure out home\nbase before doing anything because we don’t know where they stand as a company.",
            "title_similarity": "0.24333684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v6zmv",
            "score": 2,
            "text": "Advertising degrees are just classes on how to be two-faced in the corporate sectors. Solve: how can we be lecherous greedy assholes but still look like we care about others?",
            "title_similarity": "0.5980948",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0v7omg",
            "score": 1,
            "text": "Kind of misleading considering the overwhelming majority of dollars donated by those companies go to democrats",
            "title_similarity": "0.6635279",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0v7tm6",
            "score": 1,
            "text": "I can still say I’ve never had chik-fil-a. Sadly I can’t say the same about these big 3. Not a lot of chik-fil-a’s in my area and I never really craved fast food chicken.",
            "title_similarity": "0.40717918",
            "sentiment_compound": 0.3252
        },
        {
            "id": "h0v80bx",
            "score": 1,
            "text": "Only one side thinks it’s actually easier to get a job as Republican in the house than to pass Walmart’s personality test. 🤦‍♂️",
            "title_similarity": "0.51350796",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0v83h2",
            "score": 1,
            "text": "Easy to be phony when ya got money!!",
            "title_similarity": "0.20525782",
            "sentiment_compound": 0.5399
        },
        {
            "id": "h0v8bej",
            "score": 1,
            "text": "Ah yes. The empty virtue signaling of massive cooperations",
            "title_similarity": "0.17406943",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0v8cwu",
            "score": 1,
            "text": "Surprising absolutely nobody",
            "title_similarity": "-0.074751295",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0v8dbt",
            "score": 1,
            "text": "I am so much more mindful of what companies I choose to support.",
            "title_similarity": "0.23067531",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0v8hhi",
            "score": 1,
            "text": "We’re only in it for the money",
            "title_similarity": "0.17899325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v8ypi",
            "score": 1,
            "text": "yeah and a lot of corps have quietly started to give back to republicans who voted against the election.\n\n\nand i bet they gave to people who voted for the equality act.\n\n\nThey like to butter their bread on both sides, they are corps.\n\nWe can shame them to change but as long as their is money in politics and politicians control things that effect business, this is going to happen. Its just game theory, because if they dont other corps will. and it will be the other corp influencing the law.",
            "title_similarity": "0.6789626",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0v90ls",
            "score": 1,
            "text": "Companies don’t care about anything political unless it impacts their profits - money is the end all be all",
            "title_similarity": "0.39598563",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h0v91zk",
            "score": 1,
            "text": "Take it easy.....corporations are people too",
            "title_similarity": "0.32400286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v964q",
            "score": 1,
            "text": "Among us",
            "title_similarity": "-0.15276124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v96bi",
            "score": 2,
            "text": "They take pride in getting absolutely massive tax breaks.",
            "title_similarity": "0.48240083",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0v9drc",
            "score": 1,
            "text": "Large companies don’t care about gay/straight/alien. It’s about money to them. They donate to the politician who will save them the most money. Those just happen to be anti lgbtq.",
            "title_similarity": "0.6456882",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0v9jeb",
            "score": 1,
            "text": "Welcome to pandering month",
            "title_similarity": "0.26091284",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0v9nnu",
            "score": 1,
            "text": "Large companies are duplicitous. We’ve known this.",
            "title_similarity": "0.35957366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0v9w57",
            "score": 1,
            "text": "This is why I can’t stand pride month.  For companies, it’s just another set of decorations in the storage room.",
            "title_similarity": "0.47025973",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0v9x9q",
            "score": 1,
            "text": "And they also donated hundreds of thousands of dollars to politicians who voted for the Equality act. Assuming all the Dems voted for it (since the article didn't call any out), then they donated more money for it than against.\n\nBut that doesn't make for a clickbaity headline.",
            "title_similarity": "0.7693919",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0va0a2",
            "score": 1,
            "text": "Absolutely doesn't make me buy any more of their shit. This just isn't a motivator for me.",
            "title_similarity": "0.088166974",
            "sentiment_compound": -0.5945
        },
        {
            "id": "h0va4c4",
            "score": 1,
            "text": "Sounds about corporate",
            "title_similarity": "0.31902227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0va5is",
            "score": 1,
            "text": "Why are we acting like this is news? Companies only started “supporting” when they realized it was trendy to do so. Advertisements are just as immoral as always, they are just looking for a way to go “look we’re like you! We like the right people, do the right things, and say what you want us to say! Please buy our product! Please buy our product! Pleeeeaaassees!!” They don’t actually care about the people they’re selling to, they just care if the people they’re selling to buy what they’re selling.",
            "title_similarity": "0.5331346",
            "sentiment_compound": 0.9429
        },
        {
            "id": "h0vak19",
            "score": 1,
            "text": "Its called “Pay to Play”",
            "title_similarity": "0.0890357",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vami7",
            "score": 1,
            "text": "Because what we say doesn’t matter. It’s what we do.\n\nCompanies have not, nor will they ever practice what they preach, and are simply looking for your dollars.\n\nIf people were able too, I’d say pride month should be a period where we don’t buy brands, shop (outside of necessities) and just enjoy life.\n\nHell, the same for Christmas, Thanksgiving, and any other major holiday (I don’t know many outside of The US). Stop supporting corporatism with money, and celebrate liberty and free expression by being who we are as people.",
            "title_similarity": "0.4768075",
            "sentiment_compound": 0.9348
        },
        {
            "id": "h0vb8qc",
            "score": 1,
            "text": "Hypocrites",
            "title_similarity": "0.028782757",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vbaag",
            "score": 1,
            "text": "What are you going to do about it though? Their sales will never dip to a point that they have to choose a side. They’ve just realized that progressives are cheap. And conservatives only care about money.",
            "title_similarity": "0.4603058",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vbl9k",
            "score": 1,
            "text": "Time to only eat at burger king",
            "title_similarity": "0.3573258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vc1rb",
            "score": 2,
            "text": "If you think this is terrible, buy their stock and vote against such proposals in the shareholder meetings.",
            "title_similarity": "0.5515925",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0vccrz",
            "score": 1,
            "text": "Most companies use pride month for marketing. Some may actually believe in equality and some want the gold mine pride month, or both.",
            "title_similarity": "0.5675503",
            "sentiment_compound": 0.6557
        },
        {
            "id": "h0vdaze",
            "score": 1,
            "text": "Like saying you cant chip in for beer...then showin up and drinkin the most.",
            "title_similarity": "0.3709069",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0vddzc",
            "score": 1,
            "text": "Burger King official tweet response: when we say have it your way, we don’t mean have it both ways",
            "title_similarity": "0.4661089",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vdqst",
            "score": 1,
            "text": "8D chess?",
            "title_similarity": "0.12921691",
            "sentiment_compound": 0.6841
        },
        {
            "id": "h0vdtd3",
            "score": 1,
            "text": "I highly doubt McDonald’s is promoting pride month in any of their chains in the Middle East region.",
            "title_similarity": "0.45018077",
            "sentiment_compound": 0.2748
        },
        {
            "id": "h0vdtf9",
            "score": 1,
            "text": "It’s funny how these companies do NOT celebrate Pride month in Middle eastern countries. \n\nTwo faced. Only care about dollars",
            "title_similarity": "0.54995745",
            "sentiment_compound": 0.2654
        },
        {
            "id": "h0vdvk6",
            "score": 1,
            "text": "Money talks. We have to stop buying from these companies",
            "title_similarity": "0.37134674",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0ve0aw",
            "score": 1,
            "text": " Seems strang does it not?",
            "title_similarity": "-0.1309524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ve12u",
            "score": 1,
            "text": "Doesn't matter but good to air their dirty laundry either way",
            "title_similarity": "0.1877968",
            "sentiment_compound": -0.7903
        },
        {
            "id": "h0ve2kp",
            "score": 1,
            "text": "In other news, water found to be wet...",
            "title_similarity": "0.04855154",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ve2r5",
            "score": 1,
            "text": "So does that mean you're all waking up to the scam? It's all a grift.",
            "title_similarity": "0.24400932",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0vepnz",
            "score": 1,
            "text": "News flash they don't actually give a fuck and are just pandering assholes",
            "title_similarity": "0.22318324",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h0verq8",
            "score": 2,
            "text": "I'll be no longer buying my glitter there",
            "title_similarity": "0.15708773",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0vf9sv",
            "score": 1,
            "text": "These brands playing both sides so they always come out on top",
            "title_similarity": "0.21287139",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0vfk8z",
            "score": 1,
            "text": "Hint: the common factor is both of these actions are expected to increase profits.",
            "title_similarity": "0.28703946",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0vft93",
            "score": 1,
            "text": "Biden voted against the gay marriage act in 1996, and went on TV against gay marriage, again, in 2006.  His words now are hollow, at best.",
            "title_similarity": "0.57551867",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0vfuhe",
            "score": 1,
            "text": "Puke on all of them.",
            "title_similarity": "0.11659573",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0vgwxr",
            "score": 1,
            "text": "\"For where your treasure is, there will your heart be also.\"\n\n* *The Christian Bible* (KJV), New Testament, Matthew 6:21\n\nThese companies can yowl all they want about how friendly they are to LGBT+, but at the end of the day - money talks, bullshit walks. \n\nAlso, thought it was appropriate to quote what these folks seem to hold more dear than, ya know, *actual people.*",
            "title_similarity": "0.60686475",
            "sentiment_compound": 0.4748
        },
        {
            "id": "h0vh0lb",
            "score": 1,
            "text": "They do it every year",
            "title_similarity": "0.2595735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vhzww",
            "score": 1,
            "text": "All those companies and their fake Pride. They could not care less in the middle East, China etc..",
            "title_similarity": "0.50118464",
            "sentiment_compound": -0.5152
        },
        {
            "id": "h0vi2p5",
            "score": 1,
            "text": "No shit it's a month to get idiots to buy rainbow stuff",
            "title_similarity": "0.49352217",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0vitdw",
            "score": 1,
            "text": "To be fair it’s not like politics is just one issue. Everyone cares about a wide range of topics and policy stances.",
            "title_similarity": "0.26589155",
            "sentiment_compound": 0.4922
        },
        {
            "id": "h0vj0cg",
            "score": 1,
            "text": "Don’t even start to suggest that Walmart, McDonalds and Amazon could give two fucking shits about social justice issues...\nMy poor heart",
            "title_similarity": "0.5178523",
            "sentiment_compound": 0.4228
        },
        {
            "id": "h0vjf0l",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.19453818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vju07",
            "score": 1,
            "text": "\"I'm playing both sides so that I always come out on top\"",
            "title_similarity": "0.20411403",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0vk751",
            "score": 1,
            "text": "It's almost as if these companies are just trying to get your money gay or not",
            "title_similarity": "0.44256955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vks8l",
            "score": 1,
            "text": "You have to pay to play.",
            "title_similarity": "0.10510039",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0vkz3b",
            "score": 1,
            "text": "When it comes to the latest political or social stance like MeToo, Black Lives Matter or Pride, brands have to either stick to what they say or just stay quiet.\n\nEither case we should always follow the money",
            "title_similarity": "0.3011762",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0vkzfv",
            "score": 1,
            "text": "Have to get that money back somehow. Its all just money to them.",
            "title_similarity": "0.2132395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vl7x9",
            "score": 1,
            "text": "Because they don’t care.",
            "title_similarity": "-0.1285092",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vlgex",
            "score": 1,
            "text": "Because you can't fix stupid. There really needs to be a regulation against corporate money getting mixed in politics.",
            "title_similarity": "0.44261456",
            "sentiment_compound": 0.4168
        },
        {
            "id": "h0vli3a",
            "score": 1,
            "text": "is anyone actually surprised? the only color they care about is green.",
            "title_similarity": "0.0828468",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0vlmrh",
            "score": 1,
            "text": "Hypocrisy’s the name of the game.",
            "title_similarity": "0.15048508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vlp7b",
            "score": 1,
            "text": "Corporations just use pride month as a means of commoditization and advertising.  Their support is a convenience for them.\n\nSo naturally, when that convenience is no longer there, such as certain Republicans being against LGBTQ+ having equal rights (or just treated as humans), but DO support giving these corporation more money in tax breaks, you can guess what “principle” they’ll drop first.\n\nEdit: [Here is one of many many articles that go over this very issue.](https://www.vox.com/2018/6/25/17476850/pride-month-lgbtq-corporate-explained) To be clear, LGBTQ+ folks _should_ be happy that corporations ally with them, even if it’s superficial - it’s a lot better than the alternative.  However, you all deserve so much better and should demand such, like maybe donating _all_ of the money they make off of commercializing the LGBTQ+ into proper charities, instead of to politicians who want to see you and your children dead.",
            "title_similarity": "0.6705197",
            "sentiment_compound": 0.976
        },
        {
            "id": "h0vm2fi",
            "score": 1,
            "text": "Whose as surprised as I am? Raise your hand. \n*looks around for hands*\n\nMe either.",
            "title_similarity": "0.1559475",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0vmkct",
            "score": 1,
            "text": "it is just a hedge.",
            "title_similarity": "-0.1761158",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vnbot",
            "score": 1,
            "text": "This is a weird article. The common chant for years has been, “people can change. Past actions don’t dictate who they are now.” That is the excuse given for why Biden opposed and voted against any equality laws for decades in office. But now he gets grace and corporations don’t?",
            "title_similarity": "0.65413946",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0vnflg",
            "score": 1,
            "text": "Trust me when i say your wasting your time going after these guys. Most companies couldn't care less about what's going on as long  as it makes them money. Peak libright their and based though",
            "title_similarity": "0.5193312",
            "sentiment_compound": -0.3164
        },
        {
            "id": "h0vnj1l",
            "score": 1,
            "text": "Shakes hands with the gays in the morning and have a drink at night with the homophobes.",
            "title_similarity": "0.45240694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vnofk",
            "score": 1,
            "text": "Well, yeah. Mega-corporations don't care about people. Your just a number to them. They would vouch to have all rights taken away if it makes them more money.",
            "title_similarity": "0.46411833",
            "sentiment_compound": 0.2434
        },
        {
            "id": "h0vnupd",
            "score": 1,
            "text": "I want to say that these companies executives certainly want people to live their best lives; however, in business, money comes first. Priority money or social justice? It may be tempting to say social justice, but without currency you can’t really make a cohesive and functional society to have social justice. Fair enough?",
            "title_similarity": "0.5182325",
            "sentiment_compound": 0.9424
        },
        {
            "id": "h0vnydb",
            "score": 1,
            "text": "But...but...FOX NEWS TOLD ME THAT THESE COMPANIES WERE LEFT LEANING COMPANIES? I am so shocked. SHOCKED I tell you!",
            "title_similarity": "0.4291057",
            "sentiment_compound": -0.7646
        },
        {
            "id": "h0vod7z",
            "score": 1,
            "text": "It's almost as if you just discovered they only care about your money. \n\nThere's nothing more you can learn, now. God speed.",
            "title_similarity": "0.3480364",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0vpggs",
            "score": 1,
            "text": "This is entirely at odds with the values of the Carphone Warehouse",
            "title_similarity": "0.28406823",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0vpzmv",
            "score": 1,
            "text": "Utter hypocrisy.",
            "title_similarity": "0.0039947685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vq4as",
            "score": 1,
            "text": "Blood suckers the lot of em",
            "title_similarity": "0.24475056",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0vqbes",
            "score": 1,
            "text": "Take away the government advantages these companies have over smaller business and let them crumble. Bring back liberty baby.",
            "title_similarity": "0.4870358",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0vqp33",
            "score": 1,
            "text": "Occupy",
            "title_similarity": "-0.13534704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vqp3o",
            "score": 1,
            "text": "Biden was against same sex marriages and everyone gave him a free pass. Everyone says he changed his mind and his way of thinking. So I'm going to say They all changed their mind just like Biden and if you argue that than you agree that Biden couldn't have changed his mind, you can't have it both ways.",
            "title_similarity": "0.5064068",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0vqvro",
            "score": 1,
            "text": "They're *what* companies?",
            "title_similarity": "0.2261095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vri4f",
            "score": 2,
            "text": "It’s almost as if businesses just use pride gestures to market their products. Who knew the only thing corporate ever cared about and will ever care about is money.",
            "title_similarity": "0.59251225",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h0vsnvm",
            "score": 1,
            "text": "In their defense, the support for the politicians was likely because they knew those politicians also supported lower corporate tax which increases their profit. Much like the superficial Pride Month displays, they care about money and couldn’t give a shit about LGBT+ (one way or the other).",
            "title_similarity": "0.6589725",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h0vtdcb",
            "score": 1,
            "text": "Just wait till Cannabis is legalized and see how all of these assholes will suddenly be \"Cool\" with weed and see the explosions of weed-related items, media, and generic pot-leaf bullshit when they were never there to help get it legalized from the beginning. These pricks will make full circle and suppor the shit out of weed once the proletariat gets their LONG overdue rights and freedoms to consume and cultivate cannabis",
            "title_similarity": "0.46328473",
            "sentiment_compound": -0.5037
        },
        {
            "id": "h0vu2hk",
            "score": 1,
            "text": "Love how the companies that push smiles as their brand are always the worst.",
            "title_similarity": "0.42533436",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vu9jo",
            "score": 2,
            "text": "Corporations lacking the conviction of their moral grandstanding? Pandering to the public in return for money?....🤔\n\nIt's a worn out example but it's accurate:\nNike and apple run sweat shops in china, they don't care why some NFL player is kneeling or anybody's sexual preference.",
            "title_similarity": "0.6251239",
            "sentiment_compound": -0.6599
        },
        {
            "id": "h0vurdz",
            "score": 2,
            "text": "Name and shame every one of them",
            "title_similarity": "0.15800595",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0vux23",
            "score": 2,
            "text": "Corps should stay out of politics",
            "title_similarity": "0.043008603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vv9oc",
            "score": 1,
            "text": "They don’t care, stop pretending to be shocked it’s not news.",
            "title_similarity": "0.061685845",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0vvtyv",
            "score": 1,
            "text": "Yeah but to be fair those companies donated money for greed not hate. They don't care who you have sex with so long as your money spends.",
            "title_similarity": "0.5128686",
            "sentiment_compound": 0.1419
        },
        {
            "id": "h0vw1ah",
            "score": 1,
            "text": "Standard",
            "title_similarity": "-0.18553874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vwbdm",
            "score": 2,
            "text": "Is anyone surprised? I thought nearly everyone understood that these massive companies putting on the pride colors are only doing it to keep customers.",
            "title_similarity": "0.5745706",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0vz4tw",
            "score": 1,
            "text": "It really doesn’t make sense to avoid playing both sides of the fence when all you can do is benefit. No ones dumping McDonald’s Amazon and Walmart anytime soon",
            "title_similarity": "0.3843506",
            "sentiment_compound": 0.47
        },
        {
            "id": "h0vz988",
            "score": 1,
            "text": "Cant lose if you play both sides",
            "title_similarity": "0.023098256",
            "sentiment_compound": 0.5659
        },
        {
            "id": "h0vzrjv",
            "score": 1,
            "text": "Being against egalitarianism doesn't mean you're against gays or different people. It means you accept the fact that different choices will yield different outcomes and people should be free to make those choices and own the consequences (whereas positive or negative). Firing someone because of their gender identity or sexual preference given certain context might be an irrational or a rational decision. People should be free to make those choices.\n\nThis is not different than the right to freedom of speech. Even if you denounce racist speech, you can still support the right of people to say racist things. In other words, government should not decide what is valid speech and what isn't. Similarly, government should not decide what are valid reasons to hire and what aren't.",
            "title_similarity": "0.32242143",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0vzykq",
            "score": 1,
            "text": "Equality of outcome is mathematically and logically impossible. Even equality of opportunity to succeed is nearly impossible mathematically. The wise question is to self reflect \"What can I realistically do?\"\n\nAll have the same African human ancestor.",
            "title_similarity": "0.32293603",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h0w2b2r",
            "score": 1,
            "text": "All for da cashhh",
            "title_similarity": "0.094488695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0w5e68",
            "score": 1,
            "text": "Wild Americans think their corporations actually give a shit about social issues, if the trend right now was to slit your babies throats for good luck I guarantee you all these companies will start seeking a whole kit for you to do it and advertise it",
            "title_similarity": "0.59707355",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0w7vga",
            "score": 1,
            "text": "Well..as long as you choose to put money in their pocket despite knowing this i suppose we dont care or choose to be accomplishes.",
            "title_similarity": "0.18607488",
            "sentiment_compound": 0.0186
        },
        {
            "id": "h0wbi0w",
            "score": 1,
            "text": "I dont see anything wrong here?",
            "title_similarity": "-0.14277145",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h0wbq9f",
            "score": 1,
            "text": "Honestly the people who care enough to hold these companies accountable already rarely use them. A lot of people are going to have to make a decision whether their comfort is worth the cost of others discomfort.",
            "title_similarity": "0.45076454",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0wcyta",
            "score": 1,
            "text": "During the first wave of BLM, there was no corporate support or \"black out\" logos or any of that.\n\nWhen BLM came back around, and public opinion swayed more in favor of it, suddenly all these businesses were on board too.\n\nIt has nothing to do with ethics, its just selling a popular product.",
            "title_similarity": "0.52838755",
            "sentiment_compound": 0.3227
        },
        {
            "id": "h0wke7v",
            "score": 1,
            "text": "They're doing it for show, for theatrics. Their only motive is profit.\n\nFuck these big corporation jokers.",
            "title_similarity": "0.47150427",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0wm1yr",
            "score": 1,
            "text": "Watch what they DO, not what they say.",
            "title_similarity": "-0.09920651",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wmrys",
            "score": 1,
            "text": "Can I just say that as an individual that I hate pandering by brands. I’m a man but I HATE the Dr. Squatch soap not because it’s bar soap, I grew up using bar soap, no I hate it because it’s a demeaning and pandering brand that uses low brow commercials and marketing tactics. I’m not well off by any means but I dislike when companies do this pandering, and honestly companies should get out of politics and this pathetic attempt to make a profit off of people for the months dedicated to groups. I have nothing against gays and that sort, my best mates who I play video games are gay and they’re honestly the best gaming friends I’ve ever made (constantly throw me shit for being straight but that’s the fun part). But yeah pandering on all levels is getting annoying and should really stop.",
            "title_similarity": "0.49212083",
            "sentiment_compound": 0.9182
        },
        {
            "id": "h0wmyjz",
            "score": 1,
            "text": "Don’t worry socialism or communism will fix the problem soon enough.",
            "title_similarity": "0.18679711",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0wqnb7",
            "score": 1,
            "text": "All those businesses are fucking hyppocrites and only give their money away for tax breaks, who really thinks that Walmart cares about anyone or anything…",
            "title_similarity": "0.59703517",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0wqovd",
            "score": 1,
            "text": "Why can’t they contribute to both? It’s equality right?",
            "title_similarity": "0.1325633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0x31f6",
            "score": 1,
            "text": "Sounds about right",
            "title_similarity": "-0.1436027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0x3xv8",
            "score": 1,
            "text": "It is...once again...a political stunt for your money",
            "title_similarity": "0.4080919",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0x4zu6",
            "score": 1,
            "text": "Seems like capitalist class will do anything to expand their customer base but are hard supporters of conservatives because they benefit more from those tax breaks. Anyway, there are more ways to expand markets other than playing both sides.",
            "title_similarity": "0.6175394",
            "sentiment_compound": 0.9348
        },
        {
            "id": "h0x5i4n",
            "score": 1,
            "text": "Is it safe for a large company to partake in politics?",
            "title_similarity": "0.43333054",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0x63vf",
            "score": 1,
            "text": "Grow up people! That's how business works! Try to get as many customers by doing whatever it takes. No one said that big businesses were ethical or honest. Seems like this story is just stating the obvious, unless people are that blind and uneducated that they think that McDonalds or Disney has their best interest at heart. lol Even charities and religions don't do that, so why are we surprised at this?",
            "title_similarity": "0.6393901",
            "sentiment_compound": 0.9753
        },
        {
            "id": "h0xcj2g",
            "score": 2,
            "text": "If by \"celebrating\" you mean marketing rainbows and gimmicky LGBTQ things for profit then yes, they and many others are celebrating Pride. These companies could literally do this any time or all year and yet they wait until Pride month so they can cash in. None of it is genuine, it's all a business strategy and not support or inclusion. And to top it off you see who they support politically and it speaks against the narrative they are selling. Sadly this had been happening for a while and will most likely continue to happen as we as Americans choose convenience and personal gratification over what's truly right. Not that I'm much better as I use Amazon often and treat myself to the occasional Quarter Pounder rather than cut off these toxic companies.",
            "title_similarity": "0.70695627",
            "sentiment_compound": 0.9775
        },
        {
            "id": "h0xfxe0",
            "score": 1,
            "text": "Wow, I guess it's June already.",
            "title_similarity": "0.15646076",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0xjoxh",
            "score": 2,
            "text": "American corporations playing both sides of the game to protect profits. News at 11:00...",
            "title_similarity": "0.55265766",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0xk3ud",
            "score": 2,
            "text": "Yeah, they didn’t donate all this money to politicians because they hate gay people.... but they also don’t celebrate pride because they like gay people either.",
            "title_similarity": "0.4957749",
            "sentiment_compound": 0.8922
        },
        {
            "id": "h0z0d61",
            "score": 2,
            "text": "But But But. If they stop donating, they get accused of being radical because they support those agendas.\n\nUnless of course you're #moscowmitch then you still collect donations and you accuse companies of supporting things like voting rights, then you call for cancel culture.",
            "title_similarity": "0.5466126",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h0zc1sw",
            "score": 2,
            "text": "I’m pretty sure they donate to all politicians, big money in politics is the problem here.",
            "title_similarity": "0.66119164",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h124wdl",
            "score": 2,
            "text": "Maybe it's because we already have an equality act? Educated Americans refer to it as the Civil Rights Act! F'ing dumbasses.",
            "title_similarity": "0.436916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1djgi8",
            "score": 3,
            "text": "Did you seriously think any of these big corporations gave a flying shit about the LGBT+ community?  Welcome to corporate America.",
            "title_similarity": "0.6752869",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1ipxsz",
            "score": 2,
            "text": "Bullshit capitalists.",
            "title_similarity": "0.16186608",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1pcvrg",
            "score": 1,
            "text": "This is why children's you don't believe in a corporation.",
            "title_similarity": "0.24804902",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1vkosk",
            "score": 1,
            "text": "Maybe we should remember that half of what they do is for show, and all that they do it for profit. They don't really care, they just invest where they'll get a return.",
            "title_similarity": "0.4708596",
            "sentiment_compound": 0.0142
        },
        {
            "id": "h24zscz",
            "score": 2,
            "text": "Big companies always donate to both political sides if you look at it. So no matter who wins they get to keep power and influence and basically \"buy out\" politicians. Sure they may donate to one more than the other but the reasons is still the same",
            "title_similarity": "0.6404745",
            "sentiment_compound": 0.4601
        },
        {
            "id": "h2shg5x",
            "score": 1,
            "text": "They just see it as a way to get good PR. I doubt any big business truly cares outside of making more money.",
            "title_similarity": "0.40490192",
            "sentiment_compound": 0.743
        },
        {
            "id": "h2vp70d",
            "score": 1,
            "text": "The action of show your LGBT pride is just valid if is honest. A lot of companies just doing that to show “support”. Most of the CEO of this multimillionaire companies are sexist and homophobic.",
            "title_similarity": "0.6190567",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2yc5ev",
            "score": 1,
            "text": "Amazon Worker here! 'Celebrate' is a stretch, to be quite honest. We have a single banner up in our main room, and that's about it. All the real attention from my management is going towards Prime Week. Nothing else.",
            "title_similarity": "0.55385983",
            "sentiment_compound": 0.8513
        },
        {
            "id": "h312hzo",
            "score": 1,
            "text": "Its called \"pandering\". Its been around as long as politicians have. Now Corporations are doing it. \"Yay! Celebrate Pride by coming here and buying our crap!\"",
            "title_similarity": "0.71702003",
            "sentiment_compound": 0.8168
        },
        {
            "id": "h32dpgs",
            "score": 1,
            "text": "And these same corporations act like Pride matters but globally where advocates are needed they are cowards.",
            "title_similarity": "0.48415947",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h34n06u",
            "score": 1,
            "text": "we need Change [Pride Parade](https://www.amazon.com/dp/B097TJ86DW?customId=B07537H64L&th=1)",
            "title_similarity": "0.36339596",
            "sentiment_compound": 0.34
        },
        {
            "id": "h3phwe6",
            "score": 1,
            "text": "I'm late to this - but message is the same. Corporations care about NOTHING but money. They will always do whatever will make them more. If they do the \"right\" thing it is solely because it just happens to coincide with what will make them more. Period. This is how it has been since the beginning of time and will never change.",
            "title_similarity": "0.44962645",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h3r6xd3",
            "score": 1,
            "text": "Companies don’t care about pride, equality, or the people.",
            "title_similarity": "0.26129472",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h3s0qdw",
            "score": 1,
            "text": "Businesses play along for one reason.  Money?  Well, yes...\n\nBut more specifically, they understand the Twitter mob will make their lives a living hell if they dont.",
            "title_similarity": "0.5731699",
            "sentiment_compound": -0.6486
        }
    ]
}