{
    "“Tax the Rich” Gains Momentum After Explosive Report on Billionaire Tax Dodging\n": [
        {
            "id": "h1377nv",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.34936196",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h13u9l1",
            "score": 2,
            "text": "WHY is ANYONE shocked at this point that the filthy rich are tax cheats?",
            "title_similarity": "0.69766337",
            "sentiment_compound": -0.128
        },
        {
            "id": "h13zo9p",
            "score": -7,
            "text": "It astounds me how many Americans don’t even understand their own tax code. \n\nThe top .001% pay way higher than what the article reports as a tax rate. \n\nIt’s absurd how many Americans get angry over things they don’t understand.",
            "title_similarity": "0.6186826",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h13qfw5",
            "score": -24,
            "text": "I read the article and it's very disingenuous. They compare taxes paid to wealth gained which is not how people are taxed. \n\nEvery billionaire will pay a shit ton of taxes upon death and make up for the one off years of low income taxes.",
            "title_similarity": "0.7058257",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h13vxdj",
            "score": 0,
            "text": "Within the next week or two we will hear about some kind of bullshit bombshell or something worse that's going to snuff this out of the news. Rinse and repeat.",
            "title_similarity": "0.49886522",
            "sentiment_compound": -0.8016
        },
        {
            "id": "h139jbz",
            "score": 8,
            "text": "Just will make it all the funnier when nothing substantial happens on the issue.",
            "title_similarity": "0.2775967",
            "sentiment_compound": 0.2751
        },
        {
            "id": "h13y3j1",
            "score": 3,
            "text": "Goddamn rich are a bunch of welfare queens.",
            "title_similarity": "0.7118165",
            "sentiment_compound": 0.128
        },
        {
            "id": "h13n65y",
            "score": 41,
            "text": "A:  It's not \"sophisticated tax dodging methods\"\n\nB:  It's literally just not selling everything every year.  Do you sell your house every year to realize the gains and pay the taxes?  Do you buy a new car every year, so you can pay new sales taxes?  Does your local restaurant sell itself every year, and then buy itself back to realize the taxes?",
            "title_similarity": "0.50476813",
            "sentiment_compound": -0.4275
        },
        {
            "id": "h13vrtf",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.026005827"
        },
        {
            "id": "h13y9yw",
            "score": -2,
            "text": "Billionaires should not exist, period. Billionares like Elon Musk are tax cheats and parasites on society.",
            "title_similarity": "0.57486176",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h14b5yu",
            "score": 1,
            "text": "Now that Bernie is a millionaire, we demonize the billionaires, right?",
            "title_similarity": "0.82036793",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13yi22",
            "score": 5,
            "text": "What blows my mind is people are just now figuring this out.\n\nThis has been fundamental for quite a while. \n\nThat’s the real shocker here- that people still aren’t getting that the disparity now between someone like Bezos and *insert any John Q. Public in the bottom 99%* is on par with pharaoh ruling over his slaves.\n\nEdit:\n\nI try to explain this to right wing folks who preach against welfare- that if you really wanted to crack down on welfare and entitlements- you’d be most efficient to eliminate all the billionaires first.\n\nSingle mom Margaret’s food stamps aren’t why your quality of life is what it is- Fox sold you that crap- it’s because Bezos pays nothing in taxes while he literally prepares to fund his own space walk and build the biggest mega-yacht in history at the same time (a yacht literally so big it requires a smaller yacht to service it, mind you. With a yearly maintenance and serving costs at 60 million a year. Not joking about any of this, to be clear.)",
            "title_similarity": "0.5308591",
            "sentiment_compound": 0.515
        },
        {
            "id": "h13n45b",
            "score": -9,
            "text": "I think they should pay more, but I don't believe the US government would spend extra money any smarter than the way they use the current pool.  Nothing for the average American, more handouts for the rich.  It would be like 'O sorry we taxed you, here is a contract to give 120% of it right back to you, please send me a check next election cycle'.",
            "title_similarity": "0.65905523",
            "sentiment_compound": 0.9377
        },
        {
            "id": "h13s52y",
            "score": 12,
            "text": "The entire American economy is a scam to redistribute wealth from average people to the super rich.  It's fucking rigged.",
            "title_similarity": "0.73093444",
            "sentiment_compound": 0.6378
        },
        {
            "id": "h13ohvd",
            "score": 60,
            "text": "Yet another thread where 99% of participants have 1% understanding of how taxes work, and why...",
            "title_similarity": "0.49314907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1482od",
            "score": 1,
            "text": "The people claiming that billionaires don't pay taxes are completely false. If you knew anything about accounting, business and tax laws you would understand why it seems that they don't pay income tax. They are paying other taxes.",
            "title_similarity": "0.59484744",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h13z7lf",
            "score": 11,
            "text": "Nothing in that article even describes *tax avoidance*, much less \"tax dodging\", nor anything shady. They didn't pay income tax on the appreciation of their assets... because it's not income. That's how it works. They haven't dodged anything either; they would still have to pay capital gains taxes if they ever actually want to spend the money the assets represent.\n\nBut I mean, go ahead and create a tax on unrealized gains. Bezos and Musk can afford it (if they don't just move their assets somewhere else before the law takes effect); it will be your average person trying to save via investments that will get absolutely fucked.\n\nWhat is with left-wingers and having zero understanding of how economics/finance/taxation works?",
            "title_similarity": "0.45806462",
            "sentiment_compound": 0.6806
        },
        {
            "id": "h13miaq",
            "score": 1,
            "text": "The reason they paid so little is not because of the tax rate, it’s because of their tax deductions against income. The administration seems to have drawn a line at $400,000 income, so let’s use that same line for deductions. As income goes up, the max percentage of deductions goes down. For instance, if income is greater than $400,000, the max amount of deductions is limited to 50% of income and goes down 1% for every $500k of income.\n\nEdit: spelling",
            "title_similarity": "0.5236844",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h140nyu",
            "score": -3,
            "text": "Taxation is theft.",
            "title_similarity": "0.5182519",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13y62f",
            "score": -2,
            "text": "Super exciting, i cant wait for this to go the same way the panama papers did.  Nothing will happen and the person who reported it will be murdered.   Wow i just made myself super depressed.",
            "title_similarity": "0.47763592",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h13tknz",
            "score": 5,
            "text": "A SCOTUS ruling many years ago set up this situation. The court ruled that \"income\" was actually money. So if you got paid a wage that was taxable. If the value of your company went up by $33M and you borrowed $10M against that value that wasn't income. So you can live large and not pay any taxes because you have no income. Congress would have to pass a bill defining income as any increase in value. Never will that happen",
            "title_similarity": "0.58597744",
            "sentiment_compound": 0.7647
        },
        {
            "id": "h1383kz",
            "score": -2,
            "text": "Claw back tax pay",
            "title_similarity": "0.61604375",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h144a21",
            "score": 1,
            "text": "It's not \"tax dodging\" to legally pay what you owe according to the current tax code.  Tax dodging is a crime. Following the rules of the tax code and coming out with a number is not.\n\nI think the current rhetoric is not helpful towards actually reforming the tax system.",
            "title_similarity": "0.43095654",
            "sentiment_compound": -0.6844
        },
        {
            "id": "h13ancr",
            "score": 9,
            "text": "This story isn’t even mainstream news yet, what momentum?",
            "title_similarity": "0.20136201",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14bghj",
            "score": 2,
            "text": "Why are we getting mad at the rich for doing exactly what we would do if we were them?",
            "title_similarity": "0.65069497",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h14cd39",
            "score": 1,
            "text": "Nah let's tax the shit out of the middle class",
            "title_similarity": "0.61273205",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h13y9fe",
            "score": 12,
            "text": "The only “tax” that will work is a death tax. It incentivizes wealthy people to spend their money before they die. To prevent them from simply giving it to their family, there would need to be limits in place of course.",
            "title_similarity": "0.54534996",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h13m8to",
            "score": 0,
            "text": "Tax rich, why it is not happening, congress is rich they don’t want to hurt their own pocket.",
            "title_similarity": "0.66242135",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h156zca",
            "score": 0,
            "text": "The rich and wealthy have no obligation to fund nonsense proposed by deranged politicians who produce and contribute nothing to the wealth.",
            "title_similarity": "0.5199339",
            "sentiment_compound": -0.1098
        },
        {
            "id": "h15i769",
            "score": 0,
            "text": "Everyone should dodge taxes, until our government stops using them to buy missiles.",
            "title_similarity": "0.40285677",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h13upu4",
            "score": -2,
            "text": "Tax the hell outta of em. Audit the hell outta 'em. Gather interest on those taxes! Then close the fuckin' loop holes and pass legislation so that you are required to pay a minimum. Vastly unacceptable!",
            "title_similarity": "0.61922467",
            "sentiment_compound": -0.9039
        },
        {
            "id": "h142jhq",
            "score": -2,
            "text": "Ironically coming from leftist millionaires. The rich already pay far more in income taxes than everyone else relative to their income. Maybe trim down the 100,000 page tax code so it's easier to navigate AND there's less loopholes? No? Just more demagoguery? Got it.",
            "title_similarity": "0.7581351",
            "sentiment_compound": 0.7794
        },
        {
            "id": "h143xn6",
            "score": -1,
            "text": "Should we disregard the fact that the same group of wealthy individuals are responsible for more philanthropy than just about every country in existence combined?",
            "title_similarity": "0.6946286",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h13zyo0",
            "score": 22,
            "text": "this shoddy piece conflates appreciating assets with income then suggests that we should be taxing unrealized gains. wealth =/= taxable income\n\nplus the piece is based on illegally obtained tax information of private citizens. \n\nTHIS IS NOT THE OWN THAT YOU THINK IT IS.",
            "title_similarity": "0.68692327",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h1492k2",
            "score": 10,
            "text": "This is so stupid. Those are unrealized gains. It's just paper. This is how I know the narrative is being run by dumb people intent on crashing everything into the ground. There are legitimate gripes to be had about tax dodging, but taxing unrealized gains ain't it.",
            "title_similarity": "0.5487176",
            "sentiment_compound": -0.0601
        },
        {
            "id": "h13yh69",
            "score": -8,
            "text": "Eat. The. Rich.",
            "title_similarity": "0.4450155",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h13q2lq",
            "score": 4,
            "text": "I dunno. Most Republicans I know are fine with the richest of the rich not being taxed. I hear things like “They earned every penny.” and “If they raise their taxes salaries will go down and prices will go up.” They’ve been saying the same BS for decades waiting in vain for it to trickle down. Unfortunately when it does it’s warm and yellow.",
            "title_similarity": "0.6306057",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h144n2m",
            "score": 3,
            "text": "Finally! A national conversation we can *all* have!\n\nI am so excited to see such a unifying thing after so much time spent in the orange haze.",
            "title_similarity": "0.48574007",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h146grk",
            "score": -3,
            "text": "But the 1% already pay more than 40% of all taxes in America. I don't know how much more you want to tax them before they literally just leave and go overseas.\n\nTax rates have gone up and down over our history but revenue remains consistent. You can increase taxes all you want, but they will simply spend a proportional amount of money to shift their money around the tax code.\n\nThe government would actually collect more revenue with a flat low tax rate on the rich in the 20-25% area.\n\nAt what point is it simply just steal from the rich and give to the poor? That's literally just theft.\n\nI honestly think most democrats would rather keep poverty levels the same for the next 50 years  as long as they could tax the rich their \"fair share\", rather than eliminate poverty entirely in the united states at the expense of the 1% doubling their net worth.",
            "title_similarity": "0.6559178",
            "sentiment_compound": 0.9356
        },
        {
            "id": "h14b57r",
            "score": -3,
            "text": "Taxation is theft",
            "title_similarity": "0.52592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13cr7g",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.026005827"
        },
        {
            "id": "h13eo7n",
            "score": -1,
            "text": "Well, the country was founded by rich, white, \"employee\"-owning, businessmen who didn't want to pay taxes either. It's the true american way.",
            "title_similarity": "0.6431465",
            "sentiment_compound": 0.8212
        },
        {
            "id": "h13fhq0",
            "score": -1,
            "text": "It seems like the rich will just keep dodging. Edit: Autocorrect",
            "title_similarity": "0.5810155",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h13y33x",
            "score": 1,
            "text": "just going to leave this here..\n\nhttps://www.cbo.gov/system/files/2020-10/56575-Household-Income.pdf\n\nhttps://imgur.com/a/BRPw37z\n\nmiddle class only accounts for less than 10% of the federal revenue from households...",
            "title_similarity": "0.34556225",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h14d53p",
            "score": 1,
            "text": "And somehow this anger at billionaires will translate into a tax hike on people making 6 figures.",
            "title_similarity": "0.6989144",
            "sentiment_compound": -0.657
        },
        {
            "id": "h14xput",
            "score": -1,
            "text": "People need to stop throwing a tantrum about income tax - it’s way too high. Instead, we need some type of radical capital gains reform. That’s how you stop the rich from getting richer.\n\nMy grandmother is a great case study for this. She sits atop an 8-figure sum of money, made ~$475k in 2020 on dividends alone, and watches her assets experience an ever-expanding degree of exponential growth. To my knowledge, she is only taxed on what she withdraws when she makes her shockingly modest liquidations from her brokerage account to pay for day-to-day expenses. She makes more than a surgeon, and she theoretically pays less in taxes than a McDonald’s fry cook. Most of the growth on her principal will never be taxed.\n\nCEO’s earn in the same way. If you want to drop the cash grab, cut the tax loophole. Except many congresspeople are wealthy enough to where this becomes them, too.",
            "title_similarity": "0.7082573",
            "sentiment_compound": 0.8739
        },
        {
            "id": "h13a3xh",
            "score": 4,
            "text": "\"Explosive\".  Meaning nothing we didn't already know.",
            "title_similarity": "0.35149363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13pb69",
            "score": 85,
            "text": "That report didn't seem to show any tax dodging...I'm confused it just conflated unrealized gains with earned income and not that any tax was dodged....",
            "title_similarity": "0.47722653",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h137nz1",
            "score": 68,
            "text": "Did we really need a report for this? Is anyone surprised?",
            "title_similarity": "0.26677015",
            "sentiment_compound": 0.3094
        },
        {
            "id": "h145pwz",
            "score": -4,
            "text": "Odd how it changed from “millionaires” 10 years ago, to “billionaires” currently, yeah?\n\nHow many houses does Bernie Sanders own?  How much money does Elizabeth Warren make?  If I remember, she lied about her heritage, right?",
            "title_similarity": "0.6063148",
            "sentiment_compound": -0.5661
        },
        {
            "id": "h148jyk",
            "score": -5,
            "text": "Good for them!! Taxation is legal theft! Great accountants!!",
            "title_similarity": "0.737577",
            "sentiment_compound": 0.8647
        },
        {
            "id": "h13vcmm",
            "score": 9,
            "text": "Once again /r/politics proving they don't understand that assets aren't taxed. You can find some of the least informed people on this sub who all think they're experts in the subject.",
            "title_similarity": "0.44562027",
            "sentiment_compound": -0.1326
        },
        {
            "id": "h13xycd",
            "score": -5,
            "text": "Tax them in arrears too. They will still have billions. They can still make billions more. But with a much mor capable workforce and infrastructure to capitalize on. \n\nThis billionaire death cult mentality to rape and pillage everything until it is dead and dust is ridiculous. They could make even MORE money by making sure its people are paid and capable which includes all healths and education.",
            "title_similarity": "0.6963805",
            "sentiment_compound": -0.9366
        },
        {
            "id": "h147b6g",
            "score": 5,
            "text": "Tax the rich? They pay basically all the taxes lol. Don’t be jelly of other people’s success.",
            "title_similarity": "0.7718075",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h13es5v",
            "score": 2,
            "text": "Hello my fellow peasants. May we all catch a crumb today.",
            "title_similarity": "0.2648578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h141qgj",
            "score": 4,
            "text": "There is nothing explosive about the report. It's called unrealized gains idiots.",
            "title_similarity": "0.27539",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1453ct",
            "score": 2,
            "text": "I agree. Stop subsidizing the rich and the corporations. They pay piss poor wages and no benefits and then we the taxpayer have to foot the bill while they rack in billions in profits.",
            "title_similarity": "0.63907063",
            "sentiment_compound": -0.1491
        },
        {
            "id": "h146d7c",
            "score": -2,
            "text": "These billionaires are all democrats...odd",
            "title_similarity": "0.36004335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13wpq2",
            "score": -8,
            "text": "It ain’t gonna work, they just going to move to another country and everyone will be left with a surprise pikachu face.",
            "title_similarity": "0.32611138",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h13amhe",
            "score": 28,
            "text": "And nothing will come of it…\n\nIt’s bullshit, because Congress is in the small club and we ain’t in it\n\nIt’s the only true bipartisan thing our government cares about",
            "title_similarity": "0.29773235",
            "sentiment_compound": 0.25
        },
        {
            "id": "h13arld",
            "score": 18,
            "text": "There is a big difference between tax evasion and tax avoidance.  With people and companies worth more than many countries it's high time they pay what they should.  Unfortunately with so many loopholes and tax laws designed to protect these robber barons I don't see it happening.  I hope we see a change in who is sent to congress.",
            "title_similarity": "0.73220235",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h13hbwi",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.026005827"
        },
        {
            "id": "h147rkv",
            "score": 3,
            "text": "Can someone explain why a working-class person would be opposed to taxing the rich? I’ve seen some people actually NOT want that to happen. Genuinely asking.",
            "title_similarity": "0.41862974",
            "sentiment_compound": 0.5232
        },
        {
            "id": "h13i5x2",
            "score": 0,
            "text": "So if the rich lose wealth, do they also get a \"wealth loss refund\"?",
            "title_similarity": "0.670701",
            "sentiment_compound": 0.7402
        },
        {
            "id": "h13xeuj",
            "score": 0,
            "text": "It's not \"tax dodging\" if it's legal. Who do you think WROTE those laws?",
            "title_similarity": "0.31152126",
            "sentiment_compound": 0.2013
        },
        {
            "id": "h13z5pj",
            "score": 0,
            "text": "I think we can count Joe Manchin and Kristen Sinema as a no. Because they hate people? Or some other absurd reason.",
            "title_similarity": "0.29075253",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h13zaql",
            "score": 0,
            "text": "Literally eat them. They should negotiate us down from there.",
            "title_similarity": "0.27064696",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1421dq",
            "score": 0,
            "text": "Don’t forget to tax the churches!",
            "title_similarity": "0.55025005",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h1446kz",
            "score": 0,
            "text": "Implement a 50 percent tax on corporations, use it to fund universal basic income for every American Citizen, as well as Medicare for All and fix crumbing infrastructure.",
            "title_similarity": "0.52494764",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h145ykx",
            "score": 4,
            "text": "Shocker billionaires hold stocks 🤣",
            "title_similarity": "0.6603577",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h149j57",
            "score": 0,
            "text": "They increase everyone’s taxes under the guise of “Rich pay more” but we all know the rich only pay $22.50 in taxes because of legal loopholes so the commoners just wind up more taxes",
            "title_similarity": "0.69198126",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h149obd",
            "score": 0,
            "text": "Well, what do y’all expect? Our own (ex)president didn’t even pay his taxes so...",
            "title_similarity": "0.40634495",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h149qez",
            "score": 0,
            "text": "I can't believe the wealthy dodge taxes.  Who could have seen it coming?\n\nI'm starting to think the rich make more money than they used to.",
            "title_similarity": "0.7680685",
            "sentiment_compound": 0.3591
        },
        {
            "id": "h149vie",
            "score": 0,
            "text": "Imagine how much richer they would be if we all paid 3.4% in tax and had that much more to spend on buying things … for instance on Amazon Prime",
            "title_similarity": "0.67428887",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h14d67j",
            "score": 0,
            "text": "I read this in Elizabeth Warren’s voice.",
            "title_similarity": "0.09677204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14d9xl",
            "score": 0,
            "text": "If you are going to collect over due or unpaid how about you put it to good use in a range of projects. I don't want to debate which are good ones and which are shit but it seems all too often money that is collected is spread to thin on failing projects.",
            "title_similarity": "0.5182146",
            "sentiment_compound": -0.6074
        },
        {
            "id": "h14dwnt",
            "score": 0,
            "text": "Bot test...",
            "title_similarity": "0.1920256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14ikcs",
            "score": 0,
            "text": "Does anyone know when this little tax the rich scheme started?",
            "title_similarity": "0.7396962",
            "sentiment_compound": 0.5165
        },
        {
            "id": "h14lpg1",
            "score": 0,
            "text": "And then nothing will change",
            "title_similarity": "0.018285353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14mqw4",
            "score": 0,
            "text": "Axe the Rich",
            "title_similarity": "0.6278832",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h14nayt",
            "score": 0,
            "text": "Good ol' Biden.  https://youtu.be/DCZZAyRKYDg",
            "title_similarity": "0.29308867",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h14nf1l",
            "score": 0,
            "text": "Oh, the 34,288th explosive report, or the 34,289th explosive report?",
            "title_similarity": "0.3624103",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14ngdq",
            "score": 0,
            "text": "Did anyone else get really excited for a second thinking that they were about to see a Ferrari Enzo do donuts?",
            "title_similarity": "0.46284008",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h14oy5p",
            "score": 0,
            "text": "Maximum income would be a start… good god we are truly living in the dark ages.",
            "title_similarity": "0.5038961",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h14poc7",
            "score": 0,
            "text": "Our GOP overlords said No already, so quit whining and put your armbands back on \n\nedit: /s",
            "title_similarity": "0.19730511",
            "sentiment_compound": -0.5233
        },
        {
            "id": "h150c0x",
            "score": 0,
            "text": "Good.",
            "title_similarity": "0.0865248",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h151a2s",
            "score": 0,
            "text": "As long as we tax earned income and passive income differently, this will continue.  People love to talk about the 37 or 39.6% tax rate, but the only people that pay that are employees.  The people who are actually rich are the ones that control how they get paid.",
            "title_similarity": "0.6015032",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h154v8l",
            "score": 0,
            "text": "I don't understand what the big fuss is about. These billionheirs provide lots of jobs for us plebs, we should be grateful",
            "title_similarity": "0.54845846",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h155tqb",
            "score": 0,
            "text": "I have great solution. “Tax no one”",
            "title_similarity": "0.30487898",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1573b4",
            "score": 0,
            "text": "if they avoided those taxes they'll just avoid the new taxes even more.. besides the government just wastes  the tax payers money anyway.. why give them more? defund the government..",
            "title_similarity": "0.5209695",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h15czwo",
            "score": 0,
            "text": "Flat tax?",
            "title_similarity": "0.3653543",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15d93d",
            "score": 0,
            "text": "Look at this visualization of wealth shown to scale. It will boggle your mind.\nhttps://mkorostoff.github.io/1-pixel-wealth/",
            "title_similarity": "0.53884435",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h15dvhr",
            "score": 0,
            "text": "Upvote for karma?",
            "title_similarity": "0.25769514",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15fbbb",
            "score": 0,
            "text": "This is the message that the DNC needs to promote.  I’m not saying cultural issues and environmental issues aren’t…..I’m saying if you want to win back blue collar workers and middle class voters…this needs to be issue #1.  Billionaires control every level of government, they control the politicians and they do not pay their fair share.  Period",
            "title_similarity": "0.6275072",
            "sentiment_compound": 0.8039
        },
        {
            "id": "h15fih3",
            "score": 0,
            "text": "Why is hoarding money not considered a mental illness?  Even the clinical term for the illness is based on an old Anglo word for pile of gold/gems.  I know most boomers (despite hippie ideals) regard socialism as a dirty word but seems to me that sociopathic tendencies are revered and rewarded in American culture.",
            "title_similarity": "0.6006777",
            "sentiment_compound": 0.7007
        },
        {
            "id": "h15gt4l",
            "score": 0,
            "text": "But if we tax the rich they will move away and continue to not pay taxes elsewhere...",
            "title_similarity": "0.4942066",
            "sentiment_compound": 0.7464
        },
        {
            "id": "h15hu0w",
            "score": 0,
            "text": "Tax dodging has become a cry for leftys when the reality of most of what it means is: tax credit. We all get tax credits and the majority of all buisnesses claim tax credit on losses, write offs, salaries, amount paid for enployer benefits (like healthcare), and the sane stuff we all do but on a massive scale. \nIf there are loopholes then it would be more productive to point then out than make sweeping accusations. \nRemember, you dont know anyone that works for a poor person.",
            "title_similarity": "0.6348597",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h15ivk9",
            "score": 0,
            "text": "[Fairtax.org](https://Fairtax.org). Problem solved.",
            "title_similarity": "0.27747968",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h15ou3d",
            "score": 0,
            "text": "Wonder if the 47% routinely paying no income tax at all be included to start paying their fair share as well?",
            "title_similarity": "0.46837312",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h165ncf",
            "score": 0,
            "text": "In a scandal (mostly ignored by our sort-of news organizations) we have a development that gives the appearance of the second coming of Lous Lerner. \n\nNow we are confronted with the news that “somehow” confidential tax reports were “leaked” just as the Biden Tax Plan goes through its own maneuvering. \n\nSurprised?  \n\nShocked by the timing of the breach?\n\nWhomever in the IRS divulged this info needs to go to jail for a very long time. \n\nAs to the IRS Code. It’s ridiculous in its intent so change it, reduce complexity and let’s see if these problems sort themselves out.",
            "title_similarity": "0.64863515",
            "sentiment_compound": -0.8992
        },
        {
            "id": "h16ghgx",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.026005827"
        },
        {
            "id": "h16gqwq",
            "score": 0,
            "text": "Tax unrealized gains? They are rich in stock, if they sell theyll get taxed...what the article is implying if taken to its logical conclusion is that the gov should tax unrealized gains, like say the equity in your home even if you don’t sell (unrealized gains). Dumb imo and hyperbolic to rally the masses behind a political agenda. \n\nThere are tax havens and such that should be quashed. But this notion of taxing unrealized gains doesn’t make sense imo",
            "title_similarity": "0.76629466",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h16h8u7",
            "score": 0,
            "text": "Would rather have less taxes for people making below 100k than more taxes on rich…if I had to chose between the two",
            "title_similarity": "0.5093273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h16pjub",
            "score": 0,
            "text": "Makes no sense to me. Why go after people who are smart enough to get rich? Is it because you have this deep seeded resentment against yourself because you never amount to anything?  Too lazy to try, and believe everything should be handed to you because you too much of a child in mind because your parents never raised you right? \n\nIt makes more sense for those who want to attack the rich so badly just move to a country where they have no rich people to tax because they’ve all fled the country?\n\nNow that’s would be worth putting tax dollars towards. 😆",
            "title_similarity": "0.54757345",
            "sentiment_compound": -0.6092
        },
        {
            "id": "h13ufbn",
            "score": 77,
            "text": "Does NOBODY remember the Panama Papers? How many fucking times can these people be exposed before the fucking idiotic populace stops blaming the poor for societal woes",
            "title_similarity": "0.5293651",
            "sentiment_compound": -0.9355
        },
        {
            "id": "h147cr3",
            "score": 6,
            "text": "This is the dumbest fucking article ever…. Some made up “true tax rate” throws everyone on Reddit into a tizzy.",
            "title_similarity": "0.60379654",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h13ynty",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.0002482459"
        },
        {
            "id": "h14ac2p",
            "score": 6,
            "text": "Question: In the case of someone like Bezos where his amazon stock went up XXX amount in one year, his value goes up that amount as well. But if he never sold any of those stocks (which I assume in some years he hasn’t which is why he didn’t pay any tax), is he really supposed to pay it since that money isn’t actually realized?\n\nSimilar to the case of someone poor like me who let’s say bought $1000 of GME stock when it was $4 and now it’s at $300 plus, until I sell my stocks I’m still a poor fuck, right? \n\nAt I missing something here?",
            "title_similarity": "0.5342648",
            "sentiment_compound": -0.9244
        },
        {
            "id": "h13cjrx",
            "score": 1,
            "text": "Change the laws you created!",
            "title_similarity": "0.41341057",
            "sentiment_compound": 0.3164
        },
        {
            "id": "h13g91y",
            "score": 1,
            "text": "Fucking laughable if you believe it.",
            "title_similarity": "0.23729545",
            "sentiment_compound": 0.1263
        },
        {
            "id": "h13qei0",
            "score": 1,
            "text": "Taxing the rich is not about the poor, it’s about government wanting a share of that pie\n\nGovernment wealth transfer coefficient is low, it’s a necessity tho, but the next generation really needs to get into politics to make it work better, otherwise this is just a power transfer",
            "title_similarity": "0.54832387",
            "sentiment_compound": 0.8433
        },
        {
            "id": "h13sopg",
            "score": 1,
            "text": "Let's waste some time proposing bills that will never pass",
            "title_similarity": "0.25889826",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h13vbcn",
            "score": 1,
            "text": "“Tax the rich and spread the wealth so that schools can have new books, roads can be paved and national parks can be taken care of”\n\nShould be how they phrase it",
            "title_similarity": "0.70436215",
            "sentiment_compound": 0.875
        },
        {
            "id": "h13wecb",
            "score": -1,
            "text": "Forget taxing the rich. Buy & HODL $GME",
            "title_similarity": "0.59293616",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h13wuw2",
            "score": 1,
            "text": "Treat investment income like regular income when it is the majority of all income.",
            "title_similarity": "0.48403168",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h13xcee",
            "score": 1,
            "text": "Change \"Tax\" to \"eat\" and then maybe we'll see some change.",
            "title_similarity": "0.3720454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13xu39",
            "score": 1,
            "text": "Title makes me laugh. Like that’s ever going to happen!",
            "title_similarity": "0.4229974",
            "sentiment_compound": 0.75
        },
        {
            "id": "h13y3ye",
            "score": 1,
            "text": "I read they are avoiding income tax by getting paid in stocks. Is it possible to get my employer to also pay part of my paycheck in stocks? I make decent money and probably only need like a third of my income for bills and expenses. I can significantly decrease my taxable income like this",
            "title_similarity": "0.5323599",
            "sentiment_compound": 0.296
        },
        {
            "id": "h13y653",
            "score": 1,
            "text": "It's not going to change anything. The story will be replaced in a few days time with some other crazy bullshit in our world that won't get solved",
            "title_similarity": "0.31569785",
            "sentiment_compound": -0.7914
        },
        {
            "id": "h13y737",
            "score": 1,
            "text": "If only the rich paid their fair share.",
            "title_similarity": "0.62905157",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h13y8hq",
            "score": 1,
            "text": "It won’t ever happen",
            "title_similarity": "-0.070774406",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13yom0",
            "score": 1,
            "text": "i wish i had the ability to understand why this is such a big deal...",
            "title_similarity": "0.40972918",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h13ysl2",
            "score": 1,
            "text": "Quick, we need a terrorist bombing or some kind of natural disaster to take the heat off.",
            "title_similarity": "0.52729756",
            "sentiment_compound": -0.8221
        },
        {
            "id": "h13z7ou",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0002482459"
        },
        {
            "id": "h140dov",
            "score": 1,
            "text": "If you took every penny from every billionaire in this country you'd have enough money to run the government for about 9 months. The problem is not rich people have too much money the problem is the government spends too much and it does it very inefficiently.",
            "title_similarity": "0.63508284",
            "sentiment_compound": -0.8087
        },
        {
            "id": "h140hpt",
            "score": 1,
            "text": "Change the tax laws for corporations too. A lot of them aren't paying shit because everything the do is a tax deductible business expense.",
            "title_similarity": "0.6332976",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h141v21",
            "score": -1,
            "text": "Why do people think shares in a company you own is equivalent to income. Your wealth may increase from your shares growing in value but you aren’t taxed until you sell it. People are looking at bezos and elon like the total value of their shares are there income for each year and that they should be taxed for that amount. It also doesn’t help that there are tons of articles online making people believe this is them dodging taxes when it’s not income. We do need to figure stuff out with the taxes but we also need to cut out the corrupt politicians taking all of the tax money in the first place.",
            "title_similarity": "0.73559165",
            "sentiment_compound": 0.9422
        },
        {
            "id": "h141xpa",
            "score": 1,
            "text": "She’s not going to go forward with it. It’s a pitch to get people excited for the 2022 midterms. She charges almost $400 for her textbook, so all her talk of student debt is bullshit; she contributes to it.",
            "title_similarity": "0.5352362",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h1424di",
            "score": -1,
            "text": "If you file you taxes and you take tax deductions,\nYou are no different. They just have more 0’s so it seems like a lot",
            "title_similarity": "0.55708176",
            "sentiment_compound": 0.144
        },
        {
            "id": "h142box",
            "score": -1,
            "text": "Dammit guys, it’s not “tax” the rich, it’s ATTACK the rich. Did you learn nothing from the French Revolution.",
            "title_similarity": "0.54789704",
            "sentiment_compound": -0.4866
        },
        {
            "id": "h142wox",
            "score": -1,
            "text": "The cited report is **very** misleading.  Just because a person's *wealth* increased by $2billion one year doesn't mean they earned $2billion worth of taxable income and owe taxes on that.  For people like Elon Musk, Jeff Bezos their wealth comes from ownership in stocks of the companies they run.\n\nTo put this into perspective, the housing market in my area is booming right now, my home's value probably went up by $40,000 this year alone.  My wealth (net worth) increased by $40,000 as a result.  Should I pay income tax on that appreciation?  Of course not.",
            "title_similarity": "0.67178476",
            "sentiment_compound": 0.9546
        },
        {
            "id": "h1437k3",
            "score": -1,
            "text": "I mean we can try all we want, inevitably the most mobile part of our population will just leave then and we will end up like Britain.\n\nThe best way to get the rich to pay is a flat tax. It “feels fair” to them, it takes in the most money in practice, it’s cheap to implement and run, and it’s still low enough a cost for the rich that they aren’t overly incentivized to leave or use expensive offshoring.",
            "title_similarity": "0.5897416",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h144fcz",
            "score": 1,
            "text": "In canada if you make a 100k you are\nTaxed the same as someone that is making 10 million a year doesn’t seem fair. 100k isn’t what it used to be and at that amount you are almost paying 50\nPercent in tax.",
            "title_similarity": "0.5305077",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h144vri",
            "score": 1,
            "text": "Look at Apple and Ireland.",
            "title_similarity": "0.20890605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1451g2",
            "score": -1,
            "text": "Biden and that pussy Merrick Garland w/ the DOJ are now moving to find the source of the leak instead of, you know, cutting out this cancerous rot.",
            "title_similarity": "0.40158576",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h1453w4",
            "score": 1,
            "text": "Manchin and Sinema will prevent anything from coming of this.",
            "title_similarity": "0.08069746",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h145dgc",
            "score": 1,
            "text": "Elizabeth warren is rich. \n\nBernie sanders is rich.\n\nJoe Biden is Rich.",
            "title_similarity": "0.7297878",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h145hv7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0002482459"
        },
        {
            "id": "h146141",
            "score": 1,
            "text": "Unpopular opinion: nothing is going to happen. The senate is in a stalemate thanks to 30% of the population controlling 50% of the senate. The GOP doesn’t get paid by taxing the rich, they get paid by doing the opposite. They don’t care about reporting. They’ll obfuscate and distract. They don’t act on 90% approval issues, so why would they act on something that will also take money out of their coffers and pockets?",
            "title_similarity": "0.48894697",
            "sentiment_compound": 0.891
        },
        {
            "id": "h149nsc",
            "score": -1,
            "text": "I genuinely feel like the ultra rich in America are going to destroy it with their greed and lack of morals",
            "title_similarity": "0.58607256",
            "sentiment_compound": -0.34
        },
        {
            "id": "h149ouv",
            "score": 1,
            "text": "How about CAP the rich? You can't convince me that executives making 100s of time more than workers is good for long term, economic sustainability.",
            "title_similarity": "0.65069205",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h14aem6",
            "score": -1,
            "text": "That's gonna be kinda hard seeing Biden has already capitulated his campaign promises to overturn the Trump tax cuts. But what else could we expect from the person that directly worked with McConnell to make the Baby Bush tax cuts permanent?",
            "title_similarity": "0.56753767",
            "sentiment_compound": -0.3926
        },
        {
            "id": "h14amwn",
            "score": -1,
            "text": "20% income tax on all.  Upper, middle, and low income.  No more worries about “fair share” when all pay the same percentage.",
            "title_similarity": "0.4776801",
            "sentiment_compound": -0.2675
        },
        {
            "id": "h14aoco",
            "score": 1,
            "text": "That report was ridiculously misleading.",
            "title_similarity": "0.29965883",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h14au9b",
            "score": -1,
            "text": "democrats have been taxing everyone for decades but we still have more homeless than ever.\n\nfeel free to tax as much as you want at this point, its all on you since you have the house and senate.",
            "title_similarity": "0.5458304",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h14b4qt",
            "score": -1,
            "text": "She won't tax the rich though, Biden is already trying to keep Trump's tax cuts. And even if she does it won't be nearly as much as they ought to be taxed",
            "title_similarity": "0.4545567",
            "sentiment_compound": -0.6278
        },
        {
            "id": "h14bte1",
            "score": 1,
            "text": "The millionaires in Washington all dodge taxes. Guess that’s why they have to point the finger at non-politicians.",
            "title_similarity": "0.4993888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14bxbm",
            "score": -1,
            "text": "[I’ll just leave this here ](https://pdfhost.io/view/lRQ4HqpG0_House_of_Cards_Atobitt.pdf)",
            "title_similarity": "0.11126239",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h14edy8",
            "score": -1,
            "text": "If the billionaires make money, the political theater makes money, they just want more taxes to fuel more poor decisions with Pakistan gender studies and line their pockets. Fuck both of them but at least the billionaires worked for their money and employ millions of quality American workers whereas being elected is who can tell the most convincing lies and government workers suck but ya gotta have them.",
            "title_similarity": "0.70110995",
            "sentiment_compound": -0.806
        },
        {
            "id": "h14hvqb",
            "score": -1,
            "text": "Warren is crazy",
            "title_similarity": "0.27286017",
            "sentiment_compound": -0.34
        },
        {
            "id": "h14iime",
            "score": 1,
            "text": "The key to understanding why this isn't going to have the effect people think is to remember that billionaires aren't American or European or whatever, they are mobile as fuck and countries are in competition for their tax money",
            "title_similarity": "0.6035813",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h14imkd",
            "score": 1,
            "text": "Bernie is all about this... Why is Warren the thumbnail?\nOh yeah... She has more money.",
            "title_similarity": "0.56231016",
            "sentiment_compound": 0.296
        },
        {
            "id": "h14izco",
            "score": -1,
            "text": "People say this.. but neglect [this](https://www.heritage.org/taxes/commentary/1-chart-how-much-the-rich-pay-taxes) stat because it doesn’t fit the narrative",
            "title_similarity": "0.5258912",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h14jw5r",
            "score": -1,
            "text": "If you read the ProPublica article they compare the Federal Tax paid by the 25 richest billionaires as a percentage of their wealth, or increase in their wealth (i.e. the value of stock in their company that could fluctuate wildly from year to year) as opposed to the taxes paid by wage earners as a percentage of their income.  The increase in a person’s wealth is not income and is not a taxable event until it is sold.  Nobody in America pays federal taxes because their house, or rental property, or 401k, or other investments increased in value in a given year.  From the article:\r  \n•\tJeff Bezos earned $4.22B in income and paid $973M in Federal tax.  That’s an effective rate of 23%, not the 0.98% they are claiming.\r  \n•\tWaren Buffett earned $125M in income and paid $23.7M in Federal tax.  That’s an effective rate of 19%, not the 0.10% they are claiming.\r  \n•\tElon Musk earned $1.52B in income and paid $455M in Federal tax.  That’s an effective rate of 30%, not the 3.27% they are claiming.",
            "title_similarity": "0.67486215",
            "sentiment_compound": 0.9846
        },
        {
            "id": "h14l6sv",
            "score": 1,
            "text": "Are really really still pretending taxes aren’t just for the poor rofl 🤣",
            "title_similarity": "0.42496544",
            "sentiment_compound": 0.6948
        },
        {
            "id": "h14nfi3",
            "score": -1,
            "text": "Nothing will happen.",
            "title_similarity": "-0.09951253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14o10y",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.026005827"
        },
        {
            "id": "h14os1y",
            "score": -1,
            "text": "[Inconvenient facts ](https://taxfoundation.org/summary-of-the-latest-federal-income-tax-data-2020-update/) continue to emerge, thankfully not seeing the light of day or muddying the rush to judgement, to wit: **The top 1 percent paid a greater share of individual income taxes (38.5 percent) than the bottom 90 percent combined (29.9 percent)**.",
            "title_similarity": "0.66200954",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h14povr",
            "score": 1,
            "text": "Kinda seems like the rich allllways figure out how to skirt these initiatives. I mean when you own everything including politicians is it ever going to be realistic that the rich get taxed?",
            "title_similarity": "0.82517064",
            "sentiment_compound": 0.8563
        },
        {
            "id": "h14ppxj",
            "score": 1,
            "text": "Republicans and Democrats have joined together to ensure the rich can't be taxed.",
            "title_similarity": "0.54521596",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h14py4k",
            "score": 1,
            "text": "Wow rich people dodge taxes? I didn’t know! This must be a recent discovery of humanity!",
            "title_similarity": "0.7461446",
            "sentiment_compound": 0.8395
        },
        {
            "id": "h14qrck",
            "score": 1,
            "text": "The plebs seem to be getting a little more class conscious as of late, I wonder what the upper class will cook up to get us distracted and occupied this time?",
            "title_similarity": "0.44133005",
            "sentiment_compound": -0.34
        },
        {
            "id": "h14rjpe",
            "score": 1,
            "text": "Until our politicians are held accountable and stop taking handouts (payouts) to legislate loopholes to allow the ultra rich to game the system... This is never going to happen. No matter who in congress is saying it. Mind you, people... a congressman's PRIMARY job is to lie to the constituency so they can stay in power. Doing the job they were elected to do, is second... and will ALWAYS remain as such.\n\nIf \"eating the rich\" were such a \"great idea\" and truly SUPPORTED by congress... this subreddit would not exist.",
            "title_similarity": "0.54839575",
            "sentiment_compound": 0.9506
        },
        {
            "id": "h14tpe8",
            "score": 1,
            "text": "Me: 'Why do billionaires need to dodge taxes any more?'\n\nMy brain: 'How do you think they got so rich?'",
            "title_similarity": "0.76784503",
            "sentiment_compound": 0.7163
        },
        {
            "id": "h14u1qa",
            "score": 1,
            "text": "Fucking soak the rich.\n\nSuch obscene hoarding of wealth should never occur.",
            "title_similarity": "0.46155494",
            "sentiment_compound": 0.5046
        },
        {
            "id": "h14vrjm",
            "score": 1,
            "text": "Well, half of this conversation needs to be about subsidizing billionaires with trickledown economics. BASIC ECON 101 or even high school Econ can explain how trickledown makes absolutely NO SENSE. \n\nHere is an example:\n\nSay I’m a multi-millionaire that owns a business, any kind of business will do. Let’s go with RV / car salesman for shits and giggles. If you give me those millions of dollars in tax cuts and subsidies, I’ll have a lot more money. However, if the demand for my product doesn’t increase alongside this injection of free wealth, I’m not incentivized to hire more people. Why on earth would I hire more people and raise my overhead costs for nothing? Especially when there are 0 repercussions for taking that money, and I’m pushed to get it? If there isn’t an increase in demand equal to or greater than the money being given, there are 0 reasons why I should hire more people.\n\nThis isn’t difficult. All real economists understand that trickledown doesn’t work. It isn’t the rich people that circulate the money, it’s the working class.\n\nMV=PY\n\n“M = money supply, V = velocity of money, P = price level, Y = real GDP\nAssumptions:\n- V is constant\n- Money has no effect on real variables (so ∆M has no effect on Y)\n- Y is entirely determined by the fixed stock of labor, capital and technology\n\n- Note that each side of the equation equals the Nominal GDP (including the inflation)\n\n   Total Output = Total Income = Total Expenditure GDP = Y = C + I + G + NX\n\n- GDP = Gross Domestic Product = Market Value of all final goods and services produced during a given time period within a country.\n- Y = Aggregate Income = Labor Income (wages, salaries and fringe benefits), capital income (profits, interest and rents), depreciation, and indirect business taxes\n- C = Consumption = spending by households on goods and services (excluding purchases of new housing)\n- I = Investment = spending on capital equipment, inventories, and structures (including new housing; excluding stocks and bonds)\n- G = Government Purchases = spending on goods and services by local, state and federal governments\n- NX = Export - Import = net exports = spending on domestically produced goods by foreigners (exports) minus spending on foreign goods by domestic residents (imports).”",
            "title_similarity": "0.7462711",
            "sentiment_compound": 0.8867
        },
        {
            "id": "h14vxd6",
            "score": 1,
            "text": "Nothing will change. They'll enact a law that sounds great on paper and parade it around and talk it up, but when you read and understand the details, it won't be that much of a fundamental change at all.\n\nLike this hype that they're going to give parents some money every month to help with children. Look, they somewhat increased the existing child tax credit, and then said we'll give you HALF of it early per month. They simply shifted crap around. Sure, for the most poor people, money sooner and consistently could help, but then they see less from their tax refund next spring, it's not much \"more,\" it's just moved around and hyped up like hell.\n\nThey also suggested they were going to finally help Federal employees and give them honest cost of living increases to get them back in line with where they should be. If you aren't aware, Feds did not even get a cost of living increase for many years, and in all the others for decade they got next to nothing. Please note, these are NOT RAISES! These are simply raises to combat inflation. Anyways, the President's budget ratcheted the original proposal down, and now they're bragging that for once it's at least on par with what the almighty military are getting every year.\n\nNothing is being done about student loans.\n\nWe can keep going. Financially, nobody cares about us. The Democrats don't care about you. The Republicans clearly don't care about you. Nothing will change, nothing will significantly help. This country is a fraud. Anyone who still says this is the best, richest, greatest, whatever country should be slapped.",
            "title_similarity": "0.5247903",
            "sentiment_compound": 0.9813
        },
        {
            "id": "h14yqdj",
            "score": 1,
            "text": "That \"Explosive Report\" is more like \"Explosive Diarrhea\".    \nMusk, Bezos, and Buffet *are not* Tesla, Amazon, and Berkshire Hathaway. On top of that, any personal tax return data they have would be suspect because it would pretty much have to be illegally obtained. Even Congress can't look at a private individual return except under strict circumstances due to the laws surrounding them, and the only lawfully available data without consent is for corporate taxes.",
            "title_similarity": "0.51077974",
            "sentiment_compound": 0.5282
        },
        {
            "id": "h14zrzv",
            "score": 1,
            "text": "Most of Bezo's/musks wealth is capital gains.  Pretty sure Bezos gives himself a token 100k salary.  When I read \"bezos paid no income tax in year x\" I am thinking...  So... he sold stock at a capital loss of over 100k in those years (very very easy to do as a billionaire)?  And the person who does taxes for him did their job to deduct that out of the token income first?  Hardly an outrage to people who have done taxes on investments before.",
            "title_similarity": "0.62983096",
            "sentiment_compound": 0.8259
        },
        {
            "id": "h1504ru",
            "score": -1,
            "text": "Maybe they should just give all that they have worked a lifetime for to someone that feels it’s unfair that they didn’t try to be successful and thinks they should get success for just showing up",
            "title_similarity": "0.38657096",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h152i6q",
            "score": 1,
            "text": "The top 1 percent of American earners pay almost 40 percent of all federal income taxes.",
            "title_similarity": "0.48641622",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h152snb",
            "score": -1,
            "text": "Guess it’s not surprising they don’t know the difference between income and wealth",
            "title_similarity": "0.39593947",
            "sentiment_compound": 0.3369
        },
        {
            "id": "h15419f",
            "score": -1,
            "text": "Do people not understand how stocks work lol ? How the fuck are these people elected, they didn’t pay any taxes because there’s nothing to tax, like what are we going to start taxing people when the value of there homes rise too ???, do people not even have a basic understanding of capital markets ??",
            "title_similarity": "0.4886932",
            "sentiment_compound": -0.4157
        },
        {
            "id": "h154l07",
            "score": -1,
            "text": "“After idiots react to explosive headline because they don’t understand how taxes work other than basic income tax”",
            "title_similarity": "0.63763595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h156tgp",
            "score": 1,
            "text": "People don't pay income taxes on something that isn't income? Surprised Pikachu face.",
            "title_similarity": "0.469594",
            "sentiment_compound": -0.0951
        },
        {
            "id": "h1572e8",
            "score": 1,
            "text": "Tax \"Dodging\" is a very incorrect statement.  They are simply, legally, taking full advantage of the tax code that has been in place since the beginning of our country in 1776.",
            "title_similarity": "0.5477116",
            "sentiment_compound": 0.25
        },
        {
            "id": "h15e5l3",
            "score": 1,
            "text": "cry baby snowflakes “tax the rich because we waste our time on Reddit all day”. Fucking losers man.",
            "title_similarity": "0.55365723",
            "sentiment_compound": -0.7178
        },
        {
            "id": "h15iicr",
            "score": 1,
            "text": "It's almost annoying how surprising this is to people.",
            "title_similarity": "0.26370376",
            "sentiment_compound": -0.1458
        },
        {
            "id": "h16e4et",
            "score": 1,
            "text": "This whole thread is full of people with no clue as to how money works. That's why they have none",
            "title_similarity": "0.24234815",
            "sentiment_compound": -0.296
        },
        {
            "id": "h14m544",
            "score": 24,
            "text": "You Americans need a serious dose of socialism. In Australia we did between 1972-1975. The social policy and economic reforms Enacted during this period transformed our society.",
            "title_similarity": "0.55991",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h13mg9f",
            "score": -8,
            "text": "If only they took some of that energy and used it to help people get jobs, learn to better themselves.   Instead, it's all punitive.\n\nThey don't want to help us, they just want to hurt people who've done better than us.  That's not leadership.",
            "title_similarity": "0.3239638",
            "sentiment_compound": 0.1828
        },
        {
            "id": "h149wq9",
            "score": 9,
            "text": "Taxing unrealized gains roflmao.",
            "title_similarity": "0.3331442",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h13qudh",
            "score": 2,
            "text": "I'll believe it when legislation passes for it....",
            "title_similarity": "0.32833025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13y407",
            "score": -2,
            "text": "Republicans = shit",
            "title_similarity": "0.3521063",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h13yf8r",
            "score": 2,
            "text": "DID THEY NOT PAY TAXES IN THOSE YEARS BECAUSE THEY SOLD STOCK IN PREVIOUS YEARS AND DIDN'T HAVE ANY SIGNIFICANT INCOME?\n\nThey aren't even ALLOWED to sell stock except with lots of warning and planning.  So it's very conceivable that they didn't have any significant income in those years.\n\nJesus people.  There may be problems with our tax code, and I'll be the first to say that higher earners should be paying more tax. **But FFS can we have a reasonable fucking discussion about it?**  Just once I'd like to read one of these articles and have it detail WHY they didn't pay.\n\nEdit: omfg. Reading between the lines they appear to be calculating the \"true\" tax rate (not \"effective\" because that has an actual definition that wouldn't support their narrative), and go on to say buffet's paying just 0.1% on his massive *gains*.\n\nThey're using unrealized stock gains as a basis. That's not how our system works, and it's fucking dishonest.",
            "title_similarity": "0.56930304",
            "sentiment_compound": -0.8796
        },
        {
            "id": "h13ylyq",
            "score": -2,
            "text": "Again, our Government is completely corrupt.\n\nGiving them more money isn’t going to fix anything.",
            "title_similarity": "0.42648488",
            "sentiment_compound": 0.3976
        },
        {
            "id": "h13zdo5",
            "score": -2,
            "text": "Look into Clov XL and Lotz stock they are about to shoot up big time gonna be the next Amc. Do your research plz.",
            "title_similarity": "0.5572969",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h141wl9",
            "score": -2,
            "text": "Haven't y'all realized you can't tax the rich? They are smarter than you, faster than you, they can hide all their wealth in an instant, they know all the right people, they grease all the right palms. Why in gods name do you think an old out of date government has the ability to tax rich people? taxes only work on us poor and middle class people, the ones with enough wealth that the government cares but not enough wealth that we can just pay people to skirt around all the rules. That's where we're at...So \"tax the rich\"? Who cares, it ain't gonna work.",
            "title_similarity": "0.7385498",
            "sentiment_compound": 0.9039
        },
        {
            "id": "h1431od",
            "score": 2,
            "text": "Always good to learn about history;\n\nOne of the massive issues plaguing the late Roman Empire was decreasing tax revenues. The ultra-wealthy were hoarding land and productive assets, and cutting deals with the later Emperors to reduce their tax obligations. All the tax burden fell to the poor and middle class. Eventually, the Roman Empire wasn't able to convince people to stay in the empire: people defected en-mass to the Barbarian tribes, who bizarrely offered more equity and opportunity than staying Roman Citizens could. They lost the ability to field more than a few thousand troops at a time, because they couldn't find soldiers, or the money with which to pay them.\n\nEventually, when Roma was besieged for the first time in centuries, during the fall of the Western Empire, they paid a ransom to the beseigers. They had to loot the temples and hollow out the city. They never recovered, and the next siege couldn't be bought off, leading to the sacking of Rome, and the final dissolution of the Empire.\n\nHistorical sources note that the ransom amount paid from the public purse was less than the amount a single member of the wealthy elite in the city could have paid. Even then, the wealthy lobbied for more tax breaks for themselves, leaving all the burden to the dwindling numbers of poor and (almost gone) middle class, sealing the nation's fate.\n\nMake no mistake guys. The rich will let you starve, and your nation burn, if you hand everything over to them. They won't lift a finger to help you when the hard times come.",
            "title_similarity": "0.5633776",
            "sentiment_compound": 0.3736
        },
        {
            "id": "h143et2",
            "score": -2,
            "text": "tax the rich so they can fund more wars right?",
            "title_similarity": "0.8065213",
            "sentiment_compound": -0.0754
        },
        {
            "id": "h143lp0",
            "score": -2,
            "text": "Let's stop subsidizing the poor, lower the taxes - problem solved.",
            "title_similarity": "0.44816718",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h143mkv",
            "score": -2,
            "text": "What isn't being recognized it's still a tax grab tax increase made more easily digestible to the non wealthy because it's happening supposedly to someone else. Don't be fooled! They'll be coming for your money soon too! That's the nature of greedy govt who expect to never pay back what they borrow no matter their lip service.",
            "title_similarity": "0.75744045",
            "sentiment_compound": 0.8011
        },
        {
            "id": "h1448dg",
            "score": -2,
            "text": "Why not just lower everyone’s taxes to 3% instead of raising theirs? I’d like to pay less more than I want other people to pay more.",
            "title_similarity": "0.46071744",
            "sentiment_compound": 0.4857
        },
        {
            "id": "h145m8y",
            "score": 2,
            "text": "It's ok, people will forget by next week and they'll continue to wonder why things are the way they are. Just like the panama papers before this.",
            "title_similarity": "0.3935438",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h148emj",
            "score": -2,
            "text": "It doesn't matter what you do with wealth at the top, the poor would stay poor and even more likely, they'd become dependent on government. The word inequality is just a way to distract you from economic mobility, which they will never let you have. \n\nThere's an interesting tension going on the democrat party right now. It use to be common understanding between the rich and democrat party that higher taxes really meant higher barriers to entry. In other words, those who have already established themselves as billionaires can survive any type of high tax while those just entering a higher bracket are less likely to become richer. Therefore the already rich stayed rich under high taxes but the number of new rich people declined. The social corporatists within the democrat party were ok with this because they were being supported by those very individuals but now it seems that true marxists have entered the Democrat party. \n\nMarxism will always require statism and therefore a reduction in freedom. The Marxist Hypotesis fantazied that communism could be non-statist because the equal distribution of resources was a natural phenomenon and therefore class revolutions would naturally occur. History has been written and we now see that  there haven't been mass class revolutions and we haven't found a process in nature which distributes resources equally in a sustainable way. Therefore communism will never be Marxist, it will always require a strong central power to redistribute resources. \n\nWe haven't had a dramatic increase in competition/freedom since the 1880s when America had the largest GDP growth and the largest creation of volunteer organizations. A larger percentage of Americans owned their own business back then. Access to capital was much more accessible. That's what the poor really need. The poor need more freedom, not more government control and a tighter economic leash.",
            "title_similarity": "0.60430115",
            "sentiment_compound": 0.9927
        },
        {
            "id": "h14ofrj",
            "score": -2,
            "text": "Mysteriously, the notion of a flat tax remains incognito during the rush to capitalize on the recent news report. Bystanders ready to move onto a new topic tomorrow.",
            "title_similarity": "0.51791394",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h14quxj",
            "score": -2,
            "text": "If the government is so desperate for money, they should follow my father's advice: get a job. And no, being a politician is not a real job.",
            "title_similarity": "0.48088872",
            "sentiment_compound": -0.4572
        },
        {
            "id": "h14x9ee",
            "score": 2,
            "text": "Slightly off topic but I think a big reason why we have such a big income inequality is because the majority lower income people aren't knowledgeable on finance. People fall prey to so much consumerism in the United States. Everyone's just so okay with the idea to take on debt to buy liabilities like new phones and cars. Meanwhile I bet rich private schools are teaching kids on the value of investing in assets, and the dangers of taking on liabilities.\n\nMight not be the end all be all of income inequality but I think we should start from the ground up. Teach kids in public schools the power of financial literacy. https://www.reddit.com/r/financialindependence/",
            "title_similarity": "0.59401643",
            "sentiment_compound": 0.757
        },
        {
            "id": "h14y8ut",
            "score": 2,
            "text": "I amazed that we are still having this conversation.  They were not “dodging”.  They used established tax laws.  Literally everyone reading this that has cast a vote for a US congressperson supported this…\n\nIf you want fair taxation, eliminate the IRS and institute a 10% national sales tax.  Spend more = pay more.  The guy who buys the $350,000 Bentley pays $35k in natl sales tax, while I spend $18k on a Kia and pay $1800 in tax.  Doesn’t get more fair than that.",
            "title_similarity": "0.632913",
            "sentiment_compound": 0.5291
        },
        {
            "id": "h14zhau",
            "score": 2,
            "text": "Yeah how hard do you reckon these insidious pieces of human filth will fight for their status in the world?\n\nSome of these billionaires have enough wealth to fund private armies 😂 they have more money to lobey any dimwit politician who gets voted in, to line their own pockets.\n\nWe're fucked, slavery /serfdom isn't dead. It's just taken a new form, and the same levels of violence we perceive as \"barbaric\" in history must be applied to change said status quo.",
            "title_similarity": "0.76353276",
            "sentiment_compound": -0.762
        },
        {
            "id": "h150d0y",
            "score": 2,
            "text": "Salary cap. Capitalism is great but it don’t work. Salary cap, and all extra should be divided up with employees supporting company",
            "title_similarity": "0.5975541",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h1532ed",
            "score": 2,
            "text": "I hate that the left is so bad at messaging. The rich are “taxed”, but they pay nowhere near their fair share. \n\nTax dodgers. Tax avoiders. Tax frauds. Free loaders. Welfare Queens. Any of these are better and more accurate.",
            "title_similarity": "0.66037536",
            "sentiment_compound": -0.3157
        },
        {
            "id": "h1578r6",
            "score": -2,
            "text": "Lets make sure we consider anyone who makes over 100k/yr ”rich” and that they will be subject to a tax rate of at least 50%. THE RICH DO NOT DESERVE THEIR MONEY!",
            "title_similarity": "0.6339606",
            "sentiment_compound": 0.7861
        },
        {
            "id": "h13a64e",
            "score": 195,
            "text": "Why are people suprised that the 'Income Tax' does not tax wealth? Wealth and income are two different things and you can have one without the other. The whole tax system in the country would need to be rewritten which based on past history would be nearly impossible. AND NO, IM NOT SAYING THAT IT SHOULDN'T BE ATTEMPED OR DONE.\n\nAlso, remember that only 5 countries tax wealth.\n\nhttps://taxfoundation.org/wealth-taxes-in-europe-2020/",
            "title_similarity": "0.5163726",
            "sentiment_compound": -0.2631
        },
        {
            "id": "h137uqq",
            "score": 598,
            "text": "How exactly does taxing the rich have support below 95%?\n\nOh, that's right, there are tons of people who are stupid and/or love being peasants.",
            "title_similarity": "0.5727983",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h13wsbp",
            "score": 3,
            "text": "I can’t wait to see this go absolutely nowhere",
            "title_similarity": "0.18734628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h144i08",
            "score": -2,
            "text": "This is just dumb people trying to mislead tax illiterate people to think that unrealized capital gains is some sort of loophole. What's the alternative they propose? Forcing middle class people to put second mortgage on their house every year their house appreciates in value to pay some sort of tax? Forcing people to liquidate a portion of their IRAs or any other property or asset every year to pay some sort of yearly tax on it? Yeah basically that is what they're proposing, what idiots.",
            "title_similarity": "0.633806",
            "sentiment_compound": 0.8042
        },
        {
            "id": "h14eezs",
            "score": -2,
            "text": "Democrats are so intellectually corrupt. They have one idea and it’s taxes.",
            "title_similarity": "0.55357075",
            "sentiment_compound": 0.4795
        },
        {
            "id": "h14ja35",
            "score": -3,
            "text": "Why should we tax the rich? \nAnd who determines what rich is? \nWhat is all rich people pull a Bob Marley and say I’m not rich. \nWouldn’t it be more logical to lower taxes so people would work harder putting more money into the pockets of the people that work.",
            "title_similarity": "0.6899555",
            "sentiment_compound": 0.7765
        },
        {
            "id": "h14n9z4",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0002482459"
        },
        {
            "id": "h14peid",
            "score": -3,
            "text": "They make it sound like some cool hipster trend that are the kids are doing rather than a centuries-old failed idea.\n\nMarxist concepts are literally boomer ideology. What else do you think they were doing in the 60s? LSD and Communism, mostly.\n\nFast forward 60 years and that's how you get Millenials bitching about house prices.",
            "title_similarity": "0.62214935",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h14ptf0",
            "score": -3,
            "text": "\"Tax the rich\" aka we fucked up normal peoples tax money and we need even more",
            "title_similarity": "0.77602565",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h14pz5a",
            "score": -3,
            "text": "There is nothing more American than avoiding taxes. No one should be paying more than 10% in taxes.",
            "title_similarity": "0.48693874",
            "sentiment_compound": -0.5945
        },
        {
            "id": "h14vsgr",
            "score": 3,
            "text": "This coming from the Senator who filled her pockets with Sackler money. That’s rich!",
            "title_similarity": "0.76830125",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h153pi3",
            "score": -3,
            "text": "The truth about the lefts strategy of heavy tax on the wealthy is ridiculous and heres why. Our economy is designed as a \" trickle down pyramid\" with the very wealthy on top, the more money the very wealthy have, the more they have to invest in the economy and create jobs which creates jobs for the rest of us.. so the government taking their money away and using it for god knows what is counter productive to our economy..",
            "title_similarity": "0.78178215",
            "sentiment_compound": 0.9224
        },
        {
            "id": "h15rk13",
            "score": 3,
            "text": "Gonna take some more down votes but I need this to be heard. Wealth taxation won't fix wealth inequality in any meaningful way. All you will be doing is playing whack-a-mole with billionaires. Knock one down another will rise. Taxation won't stop or slow the appreciation of the asset. The reason why stocks are so outrageously overpriced is because our monetary policy since the 1970 has been to inflate the booms and cushion the busts.\n\nThe problem is the cushions we use on the bust cycles (bailouts, quantitative easing, expanded money supply, tax cuts to capital gains) do almost nothing for ordinary people but greatly derisks investors prompting them to inflate another boom cycle right after the dust settles. The next boom is even bigger for them while the next bust is often lower than previous booms.\n\nThis cycle is great if you are rich. It doesn't do much for ordinary people though. What's worse is the busts are very painful for ordinary people and the booms are more like \"finally I'm not suffering for once\". Sure we feel great when we see our 401k has tripled in a few years but you don't realize that even though it's growing quickly you still need to be contributing to it at a meaningful rate to retire at 65. Most people can't due to already living paycheck to paycheck struggling to manage debt.\n\nIf wealth taxation won't fix it what will? We need to bring risk back. No more bailouts. No more quantitative easing. If you want to expand the money supply don't do it to bailout Wall Street do it to bailout ordinary people. To put it bluntly let Wall Street fail and purge out overly risky investors. Stocks should not always go up. Being paid in stock options should be a joke not a luxury. Buying and holding forever shouldn't be sure thing. It was never meant to be. When a billionaire takes out a loan using their stocks as collateral the bank should be laughing their ass off.\n\nTaxation that can help already exists. It's the capital gains tax. It needs to be increased significantly and a minimum rate be set in stone. Like going as far as adding the minimum rate to the damn Constitution. Lastly limit the size of an estate/inheritance. The excess assets should be sold publicly with the proceeds used to help fund healthcare, social security, or infrastructure.\n\n**tl;dr: Wealth tax won't work because asset valuations are the problem. The solution is to not bailout Wall Street when it fails. Bailout ordinary people during a bust. Increase the capital gains tax significantly and limit the size of estates/inheritances.**",
            "title_similarity": "0.74151146",
            "sentiment_compound": 0.9899
        },
        {
            "id": "h13uuca",
            "score": -14,
            "text": "…And force even more jobs to leave the United States. DEMOCRATS ARE GENIUSES.",
            "title_similarity": "0.5932353",
            "sentiment_compound": 0.3262
        },
        {
            "id": "h14lcpm",
            "score": -4,
            "text": "Our govt. writes the tax laws but the wealthy provide the jobs. So let’s slap the hand that feeds us says the lawmakers while they pocket $$ under the table from the wealthy. Smoke and mirrors",
            "title_similarity": "0.758345",
            "sentiment_compound": 0.9204
        },
        {
            "id": "h14ue8i",
            "score": 5,
            "text": "We live in a time where people will complain about Jeff bezos wealth and then turn around and buy something on amazon. Don’t want them to have the money? Quit giving it to them.",
            "title_similarity": "0.5728331",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h14per9",
            "score": -5,
            "text": "mate not all but these days a good portion of the rich earned their money And now you want to give them extreme taxing? fuck off mate this why all the rich people move out of america",
            "title_similarity": "0.7766472",
            "sentiment_compound": 0.873
        },
        {
            "id": "h13by4h",
            "score": 556,
            "text": "And then promptly goes nowhere and nothing ever comes of it as it fades into obscurity. You think this report is going to make a difference when literally nothing changed after the Panama Papers except the reporter was murdered for going public with what they found",
            "title_similarity": "0.4100276",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h13wt82",
            "score": -8,
            "text": "You know what’s the worst part about rich people? They have stuff that I don’t have. And I want that stuff! It’s not fair!",
            "title_similarity": "0.5967964",
            "sentiment_compound": -0.411
        },
        {
            "id": "h13vm23",
            "score": -12,
            "text": "everyone is so jealous that they dodge taxes.   Good for them.  Taxation is theft and this Communist wants to take more.  Democrats are never happy unless they can steal money from someone.",
            "title_similarity": "0.5723833",
            "sentiment_compound": -0.8
        },
        {
            "id": "h137cec",
            "score": 2176,
            "text": "Imagine the world we could be living in if these crooks had been paying their fair share the entire time. They would still be living like Kings, and the rest of us might have healthcare? Maybe free college?",
            "title_similarity": "0.54323655",
            "sentiment_compound": 0.8645
        },
        {
            "id": "h141ond",
            "score": 239,
            "text": "Sure, can we stop comparing people who make $400k per year with billionaires? It’s not even the same solar system from a wealth perspective.",
            "title_similarity": "0.59860086",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h137bwb",
            "score": 946,
            "text": "\"“Our tax system is rigged for billionaires who don’t make their fortunes through income, like working families do,” Warren said. “The evidence is abundantly clear: it is time for a wealth tax in America to make the ultra-rich finally pay their fair share.” Warren has introduced and championed a proposal to tax the wealth of the richest Americans, starting with people whose wealth exceeds $50 million.\"",
            "title_similarity": "0.80430984",
            "sentiment_compound": 0.9565
        },
        {
            "id": "h13m56f",
            "score": 27,
            "text": "It’s  annoying that today’s news cycle presents this as some new discovery.\n\nI really doubt people in Washington are shocked or surprised about this. They know this has been going on, we all do.",
            "title_similarity": "0.47492892",
            "sentiment_compound": -0.7089
        },
        {
            "id": "h13cck0",
            "score": 3102,
            "text": "If you want to get a feeling for how rich those people are: scroll right. \n\nhttps://mkorostoff.github.io/1-pixel-wealth/",
            "title_similarity": "0.68787324",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h137s7g",
            "score": 7848,
            "text": "How about we also STOP subsidizing the rich?",
            "title_similarity": "0.55366796",
            "sentiment_compound": 0.1697
        },
        {
            "id": "h13eyqq",
            "score": 1,
            "text": "Not to worry Jeff and Elon! Hillbilly Joe won’t stop the Republicans from blocking any new taxes the nasty old Democrats will try to stick you with!",
            "title_similarity": "0.52185476",
            "sentiment_compound": -0.7634
        },
        {
            "id": "h13f6ye",
            "score": 1,
            "text": "Tax the rich? I thought we were eating them? *eyes darting* BRB",
            "title_similarity": "0.6931479",
            "sentiment_compound": 0.6072
        },
        {
            "id": "h13fi2a",
            "score": 1,
            "text": "And yet, nothing will change!",
            "title_similarity": "0.029549576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13grmu",
            "score": 1,
            "text": "Who’s just now hearing about this shit?",
            "title_similarity": "0.261477",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h13gy5i",
            "score": 1,
            "text": "The rich that they want to tax are all working at _______!",
            "title_similarity": "0.79456246",
            "sentiment_compound": 0.636
        },
        {
            "id": "h13icbi",
            "score": 1,
            "text": "then eat them",
            "title_similarity": "0.12685713",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13id7o",
            "score": 1,
            "text": "LOL. Can't wait for the Explosive report about how we need oxygen to breathe.",
            "title_similarity": "0.38856012",
            "sentiment_compound": 0.5473
        },
        {
            "id": "h13ig0z",
            "score": 1,
            "text": "Obviously the penalties for tax dodging are not sufficient. Maybe they should be set exponentially based on how much tax was dodged?",
            "title_similarity": "0.65606296",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h13l7ve",
            "score": 1,
            "text": "Dodging? Is there evidence Musk and others are not filing legal returns? Lets get some of those new IRS agents auditing.",
            "title_similarity": "0.55949754",
            "sentiment_compound": -0.2801
        },
        {
            "id": "h13lxpf",
            "score": 1,
            "text": "Seriously how is this bipartisan? Could we find some very narrow bill to agree on to get some of it back?",
            "title_similarity": "0.339307",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h13mdtc",
            "score": 1,
            "text": "Put Warren & Porter on top of this I assure you we’ll get results",
            "title_similarity": "0.32874915",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h13nf3e",
            "score": 1,
            "text": "Looking at the article, I see lots of Democrats supporting the idea of taxing the rich, but where are all the independence and even moderate Republicans?  \n\nYeah, I see these polls that talk about the majority of Americans support raising taxes on the rich, but then time and time again they keep electing the very people who won't do it no matter how much their constituents suffer. \n\nAgain, it's put up or shut up. If people in red states who vote for Republicans want to complain that the rich get it too easy, then they're going to have to bite the bullet and vote against the Republicans.  \n\nEven now, as long as Mitch has enough power to hold things up and DINOs like Manchin sit in their seats, nothing is going to change. \n\nAny rational, reasonable mind knows the system has been rigged. They know the rich get it easy, they're true income is taxed much lower than our regular income, and thus it builds the wealth gap. We also know trickle down economics doesn't work, and has never worked. \n\nYet, too many in this country still believe that if they put those in power that would raise taxes on the rich, suddenly their own taxes will go up. Or one day they might magically become a billionaire and suddenly don't want to payloads in taxes. Or they really fear that the rich will just take everything and leave the country. \n\nSo they'd rather fight for the table scraps then demand something better. Meanwhile, wages stay stagnant, benefits vanish, more full-time jobs become contract jobs, public help of any kind slowly vanishes, and yet loads of money can go to the rich and subsidies and other things that politicians claim will spur the economy. \n\nNothing's going to change until people actually start voting on their own interests and stop thinking somehow magically the free market will fix everything.",
            "title_similarity": "0.6537683",
            "sentiment_compound": 0.9955
        },
        {
            "id": "h13nsl4",
            "score": 1,
            "text": "Just so I am asking. Which politician who wasn’t previously on board changed their stance and is now on board?",
            "title_similarity": "0.4651398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13oi2h",
            "score": 1,
            "text": "In her mind perhaps. The situation is different over in the Budget Committee. Bernie is the Chair and the Democrats have the majority. Easy right ? Bernie wrote the Tax Reform legislation (aka Tax the Rich) and introduced it to the Committee.\n\nHere’s the problem. The Budget Committee refuses to schedule it. It’s just sitting there. They have discussed, voted on, and passed every other bill any of their members wrote. All except tax reform.\n\nTax Reform is stuck. It’s not the GOPs fault. It’s not Manchin or Sinema. The Democrat Chaired, Democrat majority, Budget Committee got it and is keeping it stuck.",
            "title_similarity": "0.4711446",
            "sentiment_compound": 0.4692
        },
        {
            "id": "h13pc9m",
            "score": 1,
            "text": "And since the R's big talking point about illegal immigrants is that tHey Don'T pAy taXEs, I'm sure they'll get right on board this too. \n\n<crickets>",
            "title_similarity": "0.47606844",
            "sentiment_compound": -0.2509
        },
        {
            "id": "h13qdg9",
            "score": 1,
            "text": "To sell this they need to \"target\" a liberal who is doing what all the other billionaires are doing and make it look bad. Then Republicans will want the LIB to pay their taxes and maybe change laws. Let's say Jeff Bezos uses the money he should have paid in taxes and gives it to planned parenthood.",
            "title_similarity": "0.6521504",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h13qou1",
            "score": 1,
            "text": "\nIt's not gaining any momentum.",
            "title_similarity": "-0.059117418",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h13qzln",
            "score": 1,
            "text": "Something trending on the internet isn’t the same as gaining momentum. Wake me up when state legislatures stop passing voter suppression and when any democratic legislation makes it through the Senate. With Manchin’s latest statements this is doubly unlikely.",
            "title_similarity": "0.42856294",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h13r06x",
            "score": 1,
            "text": "Say it with me now. “Mandatory Minimum Tax Rate”",
            "title_similarity": "0.37938607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13reo2",
            "score": 1,
            "text": "At this point y'all Americans should just boycott taxes en-masse.",
            "title_similarity": "0.33772027",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h13s7nf",
            "score": 1,
            "text": "y'know, we coulda saved everyone a lot of effort, time, and embarrassment if they'd just listened to us 13 years ago. Or sooner.",
            "title_similarity": "0.43992427",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h13sc2z",
            "score": 1,
            "text": "No one should be allowed to be a billionaire. Or even half of one. It’s Monetary Terrorism",
            "title_similarity": "0.47803468",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h13sh2l",
            "score": 1,
            "text": "Should have been done years ago",
            "title_similarity": "0.2540449",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13syhy",
            "score": 1,
            "text": "Can't wait for this to go nowhere.",
            "title_similarity": "0.11675271",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13t5a1",
            "score": 1,
            "text": "Seriously...capital gains tax dodges are insane.\n\nFund your own think tank with millions and take it off your income before you determine your tax bracket? Check. \n\nPay yourself a low salary and live off your stock options? Neat! Your capital gains taxes are determined by your other base income (like a salary), hence why Bezos is paid $80k, and Jobs paid himself a dollar. \n\nLive on the loans you can take out against your stock options, you don't tax loans, and as long as your stock is doing better than the interest rate...\n\nIt's nuts. The amount of money the rich dodge on taxes every year, would fund free tuition for every 4-year, in-state university student in the US. \n\n....Twice. \n\nhttps://www.youtube.com/watch?v=rFyhypz5GiE\n\nIt's even frustrating trying to get information for a video like this. There's so much obfuscation and statistical doctoring (like only basing things on income, when wealth inequality is the really insane thing).",
            "title_similarity": "0.67636377",
            "sentiment_compound": 0.9645
        },
        {
            "id": "h13th1c",
            "score": 1,
            "text": "Slowest momentum... it's not like this is new to us.",
            "title_similarity": "0.11931149",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h13tou8",
            "score": 1,
            "text": "I wonder if \"tax the rich\" includes all the democrat politicians who never lost a dime during the pandemic",
            "title_similarity": "0.5843228",
            "sentiment_compound": 0.6769
        },
        {
            "id": "h13tyad",
            "score": 1,
            "text": "Not a chance we will pass a damn thing with Mr. bipartisan joe manchin blocking any meaningful legislation though.",
            "title_similarity": "0.26427662",
            "sentiment_compound": -0.5775
        },
        {
            "id": "h13tyo3",
            "score": 1,
            "text": "But didn't we already know this shit was happening?",
            "title_similarity": "0.30857503",
            "sentiment_compound": -0.783
        },
        {
            "id": "h13u534",
            "score": 1,
            "text": "Yes PLEASE.",
            "title_similarity": "0.039398637",
            "sentiment_compound": 0.694
        },
        {
            "id": "h13u8uu",
            "score": 1,
            "text": "Let’s see Warren Buffet many years ago, did a news story about how his secretary pays more % wise in taxes than he does.\n\nAnd look at this.  Still the same story.  These rich guys have been bragging about this forever.  And it has not changed.  And never will.  The rich run this country.",
            "title_similarity": "0.73562086",
            "sentiment_compound": 0.6192
        },
        {
            "id": "h13ujwd",
            "score": 7,
            "text": "In a better world this headline would be, “‘Tax the Rich’ Gains Momentum in the 90s After Nation Realizes We Did That Already in the 1950s.”",
            "title_similarity": "0.6879271",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h13um0j",
            "score": 1,
            "text": "They can’t even pass a bill to save democracy because of one piece of shit who is either getting paid to not vote or blackmailed to not vote for it. So please explain how you will pass something to “tax the rich?”",
            "title_similarity": "0.59432244",
            "sentiment_compound": 0.38
        },
        {
            "id": "h13umst",
            "score": 1,
            "text": "I am lol, BUY GAMESTOP STOCK!",
            "title_similarity": "0.495251",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h13uqzv",
            "score": 1,
            "text": "It would be nice if they actually fucking did it",
            "title_similarity": "0.26504725",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h13v1ps",
            "score": 1,
            "text": "“Gains momentum” means **nothing**.  The Democrats are going to keep sitting on their hands. They are taking **zero** advantage of having the two chamber majority while the Republicans would do so much worse with the same, who are meanwhile still being given a full leash to dismantle voters rights, women’s rights to their own bodies, and the complete dismissal of a sponsored insurrection.",
            "title_similarity": "0.4016794",
            "sentiment_compound": -0.3353
        },
        {
            "id": "h13v54r",
            "score": 1,
            "text": "Billionaires will continue to shelter wealth. Meanwhile, the rest of us will get a tax increase. Congress will spend it before they collect the first extra dollar. Rinse and repeat.",
            "title_similarity": "0.77974445",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h13v569",
            "score": 1,
            "text": "Christ people, this shit is already a known fact. You should have been figuring this shit out YEARS ago.",
            "title_similarity": "0.39712864",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h13v66m",
            "score": 1,
            "text": "*”Poor morons” caught off guard by extremely obvious realization*\n\nFTFY",
            "title_similarity": "0.43720824",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13v7lr",
            "score": 1,
            "text": "Explosive report on the most well documented and widely understood part of the economy is explosive!",
            "title_similarity": "0.7590764",
            "sentiment_compound": 0.3989
        },
        {
            "id": "h13vci0",
            "score": 1,
            "text": "Lots of fake accounts on here strangely “backing the rich”………..\n\nBruh, you’re getting paid to write those comments protecting them. Are you **that desperate** for a job?",
            "title_similarity": "0.713572",
            "sentiment_compound": -0.765
        },
        {
            "id": "h13vgdz",
            "score": 1,
            "text": "And nothing will be done because the Republicans don’t give a damn.",
            "title_similarity": "0.15446314",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h13vh5f",
            "score": 1,
            "text": "The best way to stop tax dodgers would be to abolish income tax, and pass The Fair Tax.",
            "title_similarity": "0.4521311",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h13vj39",
            "score": 1,
            "text": "How about instead of just taxing the rich, we look at the systematic issues that caused them to accumulate that massive amount of wealth in the first place.",
            "title_similarity": "0.8073625",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h13vjav",
            "score": 1,
            "text": "Is it more \"explosive\" than the Panama papers? And why should we care now if nothing was done then?",
            "title_similarity": "0.48029393",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h13vjyr",
            "score": 1,
            "text": "It should be expensive to remain rich.",
            "title_similarity": "0.5733783",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h13vlkg",
            "score": 1,
            "text": "Republicans: Tsx the rich? Like that's going to happen now that we're making sure only our side will have a say in future elections.  Ahhh, remember when all those people protested and recalled Walker over his union busting - only to have the vote stacked against them and he was reelected?  Oh, or how about that time we attacked congress and sent a message to those within our party of their fate if they step out of line again? Hahahhahha.... good times.",
            "title_similarity": "0.6039138",
            "sentiment_compound": 0.8762
        },
        {
            "id": "h13vomx",
            "score": 1,
            "text": "We all know and we are all fucking sick of it. We all agree on this.",
            "title_similarity": "0.28345156",
            "sentiment_compound": -0.2716
        },
        {
            "id": "h13voya",
            "score": 1,
            "text": "Motherfuckers out here acting like the little people didn't know about billionaires dodging taxes",
            "title_similarity": "0.6198884",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h13vr8m",
            "score": 1,
            "text": "And still, propublica articles are not on the front page lol.",
            "title_similarity": "0.11181371",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h13vvf9",
            "score": 1,
            "text": "If I was a billionaire I’d pay double tax. I’m just that swell of a guy",
            "title_similarity": "0.76575637",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h13w0rg",
            "score": 1,
            "text": "This will get buried and the 1% will sweep it under the rug once again.",
            "title_similarity": "0.4038531",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13w79l",
            "score": 1,
            "text": "They have Warren Buffett paying 0.1% tax on billions of dollars. Unbelievable.",
            "title_similarity": "0.64753646",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h13wh0s",
            "score": 1,
            "text": "I’ve said this for awhile now.\n\nI’m all for taxing the rich more, but I’m more interested in just forcing the rich to pay their fair share like the rest of us.\n\nDollar for dollar the workers of this country pay more than the rich do and the rich enjoy the majority of the subsidies, as business owners and inherited advantage, that our taxes afford.",
            "title_similarity": "0.7532751",
            "sentiment_compound": 0.9879
        },
        {
            "id": "h13wjuo",
            "score": 1,
            "text": "What happened now? Anyone paying attention knows Billionaires have all kinda of tax havens and bullshit carved into law so they pay less taxes as a percentage than you and I do. Warren Buffett admitted it decades ago. Class warfare exists and my class (the rich) are winning. He also said it was stupid that his secretary pays a higher percentage of her salary in taxes than he does. His annual earnings are much higher than his secretary and he makes sure she is well paid",
            "title_similarity": "0.7105546",
            "sentiment_compound": 0.1832
        },
        {
            "id": "h13wk1a",
            "score": 1,
            "text": "We have 51 votes and ran on a new tax plan. Why is this a debate.",
            "title_similarity": "0.5429471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13wkk8",
            "score": 1,
            "text": "I want to quickly cover two points that many ignore or simply do not understand.\n\n1. Most of the uber wealthy have their wealth in unrealized gains (IE, stock that they haven't sold yet). Wealth is not subject to income tax, and that is part of the reason why so many of the uber wealthy pay lower taxes than we would otherwise assume.\n2. When the uber wealthy do realize these capital gains, they are usually **NOT TAXED AS INCOME.** They are instead taxed as capital gains. I'll expand on this below.\n\nFor assets held for less than a year, once realized, they are subject to income tax (current highest bracket in the US is 37%). For assets held longer than a year, there are three brackets - 0%, 15%, and 20%. Now, here's the kicker. Those brackets are not based on the amount redeemed, but instead, your actual taxable income. Were you a CEO who \"generously\" took a $1 annual salary? Congrats, you had $1 in taxable income. You pay 0% on your capital gains, so long as you held the assets for at least a year before cashing them in.\n\nTo fix this problem, all capital gains needs to be taxed as income. Tax the rich.",
            "title_similarity": "0.6502328",
            "sentiment_compound": 0.9731
        },
        {
            "id": "h13wl9p",
            "score": 1,
            "text": "That report was so dumb. Look - I'm all for the rich paying more taxes, but the report conflates 'wealth gains' with income. If you'd all like to be taxed for your 401K's fluctuation vs. the money you bring in from your paycheck - then sure, I got nothing to say then.",
            "title_similarity": "0.71698284",
            "sentiment_compound": 0.8996
        },
        {
            "id": "h13wmwl",
            "score": 1,
            "text": "\"Billionaires successfully dodge taxes.\" \n\n\"Well tax them more! That should do the trick.\"",
            "title_similarity": "0.7412698",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h13womz",
            "score": 1,
            "text": "👏🏻 prayin these journalists dont suddenly feel sucidal 🙌🏻",
            "title_similarity": "0.28273636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13wsz6",
            "score": 1,
            "text": "People have been saying tax the rich for literal centuries... but this time guys... this time for sure! It's happening for sure, guys! Look, it even has 10k upvotes on Reddit! It's happening!",
            "title_similarity": "0.7646951",
            "sentiment_compound": 0.7946
        },
        {
            "id": "h13wzxw",
            "score": 1,
            "text": "The 1% right? Revenue cant just audit them unconditionally every single year? They’re 1 in 1000 in most cases.",
            "title_similarity": "0.44929224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13x2n2",
            "score": 1,
            "text": "The fact that many in congress are getting behind this makes me feel like they are already setting up a horrible way to get around it. Then will set up a way to capitalize on it.",
            "title_similarity": "0.45480886",
            "sentiment_compound": -0.25
        },
        {
            "id": "h13x97y",
            "score": 1,
            "text": "\"And then nothing happened.\"",
            "title_similarity": "-0.08057076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13x9cz",
            "score": 1,
            "text": "Look, the people that vote with their feelings need catchy slogans and edgy shit.  If the Dems are going to get their attention, they need to work on their messaging.\n\nI swear, if you just had every Dem start repeating a very simple phrase in the media outlets, it'll gain traction.  \n\n\"Trickle-down is bullshit...\"\n\nSure, tone it back a bit later(use B.S. instead) but never ever stop.",
            "title_similarity": "0.49685746",
            "sentiment_compound": 0.0982
        },
        {
            "id": "h13xa5x",
            "score": 1,
            "text": "Remove money from politics, period!",
            "title_similarity": "0.36860317",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13xahl",
            "score": 1,
            "text": "It would be interesting to see who leaked those details.",
            "title_similarity": "0.38905373",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h13xbf7",
            "score": 1,
            "text": "They should pay double now",
            "title_similarity": "0.504619",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h13xdjp",
            "score": 1,
            "text": "Tax the rich, then retrieve amounts not paid from previous years.",
            "title_similarity": "0.77348983",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h13xe5w",
            "score": 1,
            "text": "\"But the wealth is supposed to trickle down\" /sarcasm",
            "title_similarity": "0.40310735",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h13xih3",
            "score": 1,
            "text": "Nothing will change",
            "title_similarity": "0.027281268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13xird",
            "score": 1,
            "text": "Good.",
            "title_similarity": "0.0865248",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h13xnus",
            "score": 1,
            "text": "Paradise papers",
            "title_similarity": "0.2263301",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h13xp9n",
            "score": 1,
            "text": "how about zero taxes for the middle class?",
            "title_similarity": "0.31339234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13xpif",
            "score": 1,
            "text": "It's \"report comes out about rich people dodging taxes\" day.\n\nAgain.",
            "title_similarity": "0.84588164",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h13xsoc",
            "score": 1,
            "text": "Is this going to actually work. A lot of financial services firm serve their clients by helping them with tax savings strategies. They'll find the loopholes",
            "title_similarity": "0.6515852",
            "sentiment_compound": 0.296
        },
        {
            "id": "h13y33z",
            "score": 1,
            "text": "You know more people would support the tax the rich movement if you were solely going after billionaires and people with hundreds of millions",
            "title_similarity": "0.84227103",
            "sentiment_compound": 0.7624
        },
        {
            "id": "h13y4xa",
            "score": 1,
            "text": "Out of the palace and into the ditch",
            "title_similarity": "0.18046825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13y6u3",
            "score": 1,
            "text": "If you just killed like, 3  politicians publicly a lot of problems",
            "title_similarity": "0.5016471",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h13yc65",
            "score": 1,
            "text": "Billionaires should be treated like cockroaches in any decent society.",
            "title_similarity": "0.49180943",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h13yg1m",
            "score": 1,
            "text": "But...but...taxing the rich to ensure that the general population has their basic needs met is SOCIALISM!\nMuch better to ensure everyone is FREE to pursue their own individual dreams!",
            "title_similarity": "0.5652081",
            "sentiment_compound": 0.9585
        },
        {
            "id": "h13yjzz",
            "score": 1,
            "text": "Well, it's their government. It is this group which the government truly represents (always has been). The only way to make the case is in terms of their own self-interest. What's the carrot? What's the stick? Because if they can keep on kicking the can and bailing out and passing laws that benefit them, they will.",
            "title_similarity": "0.41778442",
            "sentiment_compound": 0.8105
        },
        {
            "id": "h13ylii",
            "score": 1,
            "text": "Instead of focusing entirely on making the already ludicrous tax code even more extensive, we focus on something else. Like closing loopholes and going after accounts set up in offshore tax havens. Like giving the IRS the capabilities to collect the taxes and go after people not paying them. There’s no point in adding more taxes if the wealthy are simply going to use loopholes to pay fractions or have them stored off in some offshore account.\n\nAfter that then we can focus on raising taxes on the wealthy if necessary.",
            "title_similarity": "0.66497713",
            "sentiment_compound": 0.743
        },
        {
            "id": "h13ynzy",
            "score": 1,
            "text": "Tax the avg annual value of stock portfolios in brackets. \n\n500mil-1% \n\n1B-2% \n\n5B-3% \n\n10B-4%\n\n25B-5%\n\n50B-6%\n\n100B-8%\n\nJeff Bezos and Elon Musk would both pay minimum of $8 billion annually (at their current worth). Anyone with at least a billion in holdings would pay a minimum $20mil. Their lives wouldn't change a bit. \n\nHow could you argue against this? /s",
            "title_similarity": "0.54254496",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h13ytza",
            "score": 1,
            "text": "My dad always said. “ I never would have made my first million if Uncle Sam knew about it”",
            "title_similarity": "0.37600535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13yud4",
            "score": 1,
            "text": "I like the idea of tax the billionaires but I fear that to appease the masses, the politicians may pass tax laws that actually only hurt small to medium, independent, often family-owned business. The news will say they closed a bunch of loopholes \"the wealthy\" use to pay less tax but the billionaires always come out untouched. I hope I am wrong.",
            "title_similarity": "0.5977901",
            "sentiment_compound": -0.631
        },
        {
            "id": "h13yvj9",
            "score": 1,
            "text": "Nice headline. I doubt this gets done. I’d like it to be done, but I have no faith in the Dems being able to get this done. We need to get to a majority in the Senate or nothing is going to happen.",
            "title_similarity": "0.34392923",
            "sentiment_compound": -0.2728
        },
        {
            "id": "h13yvtb",
            "score": 2,
            "text": "I recall candidate Trump saying he had intimate knowledge of how the rich a kid taxes and he was going to make them pay their fair share......than cut taxes for them 🤷‍♂️",
            "title_similarity": "0.7106409",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h13yvuu",
            "score": 1,
            "text": "Part of the issue with this whole idea is most Billionaires have assets worth a lot of money(not tons of cash) but you don't pay taxes on assets like stocks until you sell them....",
            "title_similarity": "0.68726397",
            "sentiment_compound": 0.7701
        },
        {
            "id": "h13ywkf",
            "score": 1,
            "text": "Hey, this big company can provide 2 more jobs - we should give it tax breaks totalling 1 million usd 😂",
            "title_similarity": "0.6049807",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h13yx2m",
            "score": 1,
            "text": "Here we go. Reddit pushing anti-billionaire ideas yet again",
            "title_similarity": "0.6577434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13yzxg",
            "score": 2,
            "text": "Left wing rag at Truthout.org no it does not.  \n\nhttps://mediabiasfactcheck.com/truth-out/",
            "title_similarity": "0.19435516",
            "sentiment_compound": -0.296
        },
        {
            "id": "h13z0sa",
            "score": 1,
            "text": "Yeah, up the tax rate for those rich enough to avoid their current tax rate! That’ll make a difference!",
            "title_similarity": "0.7132953",
            "sentiment_compound": 0.6351
        },
        {
            "id": "h13z19w",
            "score": 1,
            "text": "But but but they create jobs... Heard that shit today. Get the fuck outta here.",
            "title_similarity": "0.43374062",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h13z1gv",
            "score": 1,
            "text": "The rich have used their money in a centuries old PR scam to convince the rest of us they are morally superior.  Maybe, just maybe Americans will wake up to the truth that the deck is stacked.",
            "title_similarity": "0.74518",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h13z1q0",
            "score": 1,
            "text": "This just in: rich people will do anything to stay rich. \"I was so surprised by this explosive report!\" Said no one ever.",
            "title_similarity": "0.6069033",
            "sentiment_compound": 0.8309
        },
        {
            "id": "h13z3a8",
            "score": 1,
            "text": "Lower all capital gains taxes (long and short).\nLower property taxes.\n\n37% + state tax on short term gains is absolutely theft.",
            "title_similarity": "0.50467455",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h13z47v",
            "score": 1,
            "text": "So they want to tax people making 400k more.  Not those making tens on millions a year",
            "title_similarity": "0.6007563",
            "sentiment_compound": 0.1477
        },
        {
            "id": "h13z75d",
            "score": 1,
            "text": "Remember when Trump said the US would never be a socialist country during a SOTU speech and Liz joined in the standing ovation?",
            "title_similarity": "0.41222465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13z7y4",
            "score": 1,
            "text": "“We already pay the most taxes” \n\n*chooses to dodge more instead of benefiting society* 😂",
            "title_similarity": "0.66304255",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h13z9bf",
            "score": 1,
            "text": "“Tax the Rich” is already extremely popular and has a shit ton of momentum. The real problem is passing the laws.",
            "title_similarity": "0.8324114",
            "sentiment_compound": -0.4951
        },
        {
            "id": "h13za9k",
            "score": 1,
            "text": "Serious- when I try to bring this up, my friends will say, they will just move their money elsewhere in the world and I never have a counterpoint. Is there a reason why Jeff Bezos wouldn’t just leave the US?",
            "title_similarity": "0.41770005",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h13zaoz",
            "score": 1,
            "text": "We could start by making the act of lobbying illegal....",
            "title_similarity": "0.35567892",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h13zb84",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0002482459"
        },
        {
            "id": "h13zbbp",
            "score": 1,
            "text": "Well I bought AMC, that’ll tax em’",
            "title_similarity": "0.5643443",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h13zbr8",
            "score": 1,
            "text": "Yeah woohoo",
            "title_similarity": "0.0717358",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h13zhgf",
            "score": 1,
            "text": "Also honestly instead of saying “hey we would love if you benefitted all of society by donating your wealth” - why don’t we just make them do that? As if anyone over 500 million usd needs anymore money",
            "title_similarity": "0.57680285",
            "sentiment_compound": 0.872
        },
        {
            "id": "h13zhmm",
            "score": 1,
            "text": "It’s incredible that they can get away with such a low rate legally and avoid millions or billions in taxes, and the IRS will come knocking on doors for a thousands of dollars.",
            "title_similarity": "0.63821197",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h13zhzy",
            "score": 1,
            "text": "Has any body ask HOW they were able to do it?  Warren Buffet has given Billions to charities maybe that is why.  Not defending but let’s get all the details.  While on the subject just how many members of Congress pay a 14% tax rate?  People in glass house shouldn’t throw stones!",
            "title_similarity": "0.593446",
            "sentiment_compound": 0.2851
        },
        {
            "id": "h13zicx",
            "score": 1,
            "text": "You need endless funding to stay a lawmaker in congress. Most of their day isn't spent legislating, it's spent calling the wealthy asking for money. This is why congress works for the wealthy and why they're getting richer. The laws are made to benefit those with money and screw everyone else. It's why they don't pay taxes. The american govt consists of politicians and the wealthy scratching each other's backs. It's all a big club that you ARE NOT, NOR EVER, WILL BE IN. \n\nHow do they get away with it? Simple. They keep Dems and Reps pointing the finger at each other, sad to say that both sides are being shafted.",
            "title_similarity": "0.6605494",
            "sentiment_compound": 0.8589
        },
        {
            "id": "h13zjcw",
            "score": 1,
            "text": "How about, just for the ultra rich and wealthy, we just deduct taxes from their business transactions on an ongoing basis?  \n\nLike… oh - you’re there to sign the contracts on a massive conglomerate merger between AT&T and Discovery ?  Sweet - when this deal is signed into a legal document the IRS will also be in the room to take the appropriate taxes at that moment during that transaction. Feel free to file whatever tax returns you’d like to be reimbursed - but hopefully the IRS will have a much easier time holding onto it if they already have it, than if they have to wait for someone to figure it out.",
            "title_similarity": "0.7366949",
            "sentiment_compound": 0.9414
        },
        {
            "id": "h13zokf",
            "score": 1,
            "text": "Knock down the walls 'till they're left with just the street.",
            "title_similarity": "0.19072628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h13zpxq",
            "score": 1,
            "text": "Yeah! We’re mad! Let’s make #taxtherich trend in Twitter! That’ll show ‘em!",
            "title_similarity": "0.5427333",
            "sentiment_compound": -0.4885
        },
        {
            "id": "h13zq7f",
            "score": 1,
            "text": "How about simultaneously reducing the tax burden on the working class? Increase the standard deduction to $30,000!",
            "title_similarity": "0.600858",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h13zr8z",
            "score": 1,
            "text": "No it isn't lol.",
            "title_similarity": "-0.08261779",
            "sentiment_compound": -0.5472
        },
        {
            "id": "h13zsii",
            "score": 1,
            "text": "Wait hang on… all the boomers on Facebook told me that the ultra rich pay more taxes than anyone else in the country!?!? How could this be true!? /s",
            "title_similarity": "0.74783206",
            "sentiment_compound": 0.8134
        },
        {
            "id": "h13zv8e",
            "score": 1,
            "text": "We did it guys, we finally taxed the rich.\n\nTune in next month when we say it again.",
            "title_similarity": "0.68615663",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h13zvqz",
            "score": 1,
            "text": "Get back-taxes as well while you're at it.",
            "title_similarity": "0.46298042",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h13zx18",
            "score": 1,
            "text": "It is unfortunate but this is the system they built and we have to live with. \n\nThere is a callous “you need us” attitude about the biggest businesses that we may or may not need. One is banking. We need credit to create business and buy homes but most of us don’t need arbitrage, high frequency trading, derivative products, or predatory lending. Most of us don’t need decades of debt the instant we graduate college. We don’t need do need driven into bankruptcy by medical bills. But we are told Wall Street is good for us and that we can’t fight it.\n\nAnother is defense. In the US We need to have a military and advanced weapons. It is part of the deal we agreed to when we helped Europe recover from the devastation of WW2. But we don’t need military bases in 70 countries. We don’t need rail guns, stealth bombers, high energy weapons, unusable tanks, unreliable guns, wonky aircraft (VTOL), a 700 billion dollar F-35 program. We do not need to defeat the Soviets in 1979, but we spend more now than we did then on systems that seem designed to do exactly that. \n\nWhile we are looking at Marjorie Taylor Greene’s shenanigans and tweeting and posting about it members of Congress are quietly re-upping these massive financial layouts to the military industrial complex and carping about how they need the jobs in their district. \n\nBanking and weapons are the real reason we have unchecked billionaires running the show. The political parties look like they have a purpose, but that is a show. They are all here to get rich off that big dollar teat. Why does nothing get done? Nobody os going to kill the twin golden geese of banks and defense contractors. \n\nElizabeth Warren is doing a great job — and is betting painfully little support because the rest of the legislature knows who is buttering their bread.",
            "title_similarity": "0.5170997",
            "sentiment_compound": 0.7492
        },
        {
            "id": "h13zy02",
            "score": 1,
            "text": "The cases mentioned in the first propublic report aren't really dodging or even tax avoidance (the term PP uses)--at least no more dodging than me deducting loan interest or heath expenses. The law says they can deduct investment losses. That, combined with the fact that investment income isn't taxed like labor income, is why they are paying relatively little in taxes.\n\nThe reason it's like this is to spur investment. For example, a wealthy individual may be willing to invest in a risky startup or new vaccine because losses are deductible. I'm not saying is the way it works even a majority of the time, just that this is the rationale. I'm also not saying this is right or just or moral. I'm just saying that Soros et al. did nothing wrong. The tax code is the issue.",
            "title_similarity": "0.559948",
            "sentiment_compound": 0.3682
        },
        {
            "id": "h13zy52",
            "score": 1,
            "text": "Oh yes. It freaking time for a revolution.",
            "title_similarity": "0.3301654",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h13zyv8",
            "score": 1,
            "text": "We've had quite a bit of explosive reports about billionaire tax dodging in the past few years, but it always seems to fizzle out once it hits decision-makers. Billionaires are part of the donor class. We're going to need to see a lot more politicians willing to bite the hand that feeds them if we are to see if meaningful change.",
            "title_similarity": "0.7297767",
            "sentiment_compound": 0.7935
        },
        {
            "id": "h1400az",
            "score": 1,
            "text": "We talking about the panama papers or a new one that we will forget about next week?",
            "title_similarity": "0.40170705",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1402mi",
            "score": 1,
            "text": "Tax the rich so that they have to actually spend some more of their money on the economy in order to get the write-offs.  \nTax the rich because 10% of a billionaire's income would pay for more than many hard-working Americans who are scraping to get by.   \n  \nBy \"the rich\" I do not mean the business owner who may be worth a few Mill, but employs a good amount of folks.  \n  \nI'm all for making money, but at a certain point, you have enough to do whatever you want for as long as you live. Legacies are not purely based on capital.",
            "title_similarity": "0.7715703",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h1403v1",
            "score": 1,
            "text": "MEH. Pepperidge farm remembers the Panama papers with fuck all accountability and no cunt arrested.",
            "title_similarity": "0.30256286",
            "sentiment_compound": -0.0903
        },
        {
            "id": "h1404tu",
            "score": 1,
            "text": "I'm sure it'll work this time.",
            "title_similarity": "0.15304728",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1405b2",
            "score": 1,
            "text": "tired of blowing smoke up my progressive butt. enough. warren and bernie are great but they are alone in the legislature.",
            "title_similarity": "0.40055892",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h1405ce",
            "score": 1,
            "text": "I hate to be political but BOUT TIME this gained momentum",
            "title_similarity": "0.46828797",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h1406yw",
            "score": 1,
            "text": "The rich shouldnt be given options to get out of paying taxes. That should be reserved for the poor who are struggling to make ends meet",
            "title_similarity": "0.5097084",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h140amh",
            "score": 1,
            "text": "All the top comments blasting our system are excellent! Y'all wanna know how to MAKE all your amazing ideas work? How to finally get our elected representatives to actually work for us?\n\nProtest taxes. Stop paying them and present your elected officials petitions stating the will of the people. Bankrupt the fools running the machine and force them to fix it.\n\nDefund a system that forces you to provide majority of expenses to maintain(horribly) a travel infrastructure with a main purpose of making sure you get to a hellhole of a job that keeps majority of the profits you earn for the white-collars that couldn't do what you do to earn for their own company in most cases!\n\nIf a third of our population did this, bet we would all be amazed how easy all along the system could be ran properly.. how, apparently, there really WAS a better way of running the gReAteSt CoUnTrY in the world.",
            "title_similarity": "0.6642645",
            "sentiment_compound": 0.9578
        },
        {
            "id": "h140c5a",
            "score": 1,
            "text": "They don’t pay into social security either. A 15% savings.",
            "title_similarity": "0.30102584",
            "sentiment_compound": 0.25
        },
        {
            "id": "h140d13",
            "score": 1,
            "text": "The fact all these long time politicians were unaware before this report is troubling.",
            "title_similarity": "0.4122672",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h140fq4",
            "score": 1,
            "text": "Don’t be fooled, all the politicians always knew that the rich don’t pay their fair share. And now they are acting like they are surprised lol…",
            "title_similarity": "0.65156806",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h140fy6",
            "score": 1,
            "text": "And Jeff all mad.....asking what about his privacy huh? How does it feel?",
            "title_similarity": "0.31254598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h140hi4",
            "score": 1,
            "text": "Whaaaa?",
            "title_similarity": "0.06106574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h140ijh",
            "score": 2,
            "text": "Jesus Christ. We’re just figuring this out *now*?",
            "title_similarity": "0.18298784",
            "sentiment_compound": 0.0
        },
        {
            "id": "h140k2z",
            "score": 1,
            "text": "“Tax the Politicians”",
            "title_similarity": "0.68298703",
            "sentiment_compound": 0.0
        },
        {
            "id": "h140kh4",
            "score": 1,
            "text": "If every single person is not absolutely PISSED, you have mental health issues.",
            "title_similarity": "0.314318",
            "sentiment_compound": 0.6282
        },
        {
            "id": "h140mo9",
            "score": 3,
            "text": "At this time, we really should be growing contemptuous instead of worshipful of the uber rich. Not only are they excessively wealthy, but their cancerous influence over the economy will only worsen things if they remain unchecked. That's what billionaires are to the metaphorical life of the economy. Cancer.",
            "title_similarity": "0.69205034",
            "sentiment_compound": -0.8632
        },
        {
            "id": "h140r5k",
            "score": 1,
            "text": "The rich support tinkle down economics. And we are supposed to be thankful for getting pissed on.",
            "title_similarity": "0.6204778",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h140siq",
            "score": 1,
            "text": "Can’t the 1% easy eliminate the world debt? Why not start there? Forgive everyone’s mortgages and consumer debt. Like Mr. Robot.",
            "title_similarity": "0.54213595",
            "sentiment_compound": -0.196
        },
        {
            "id": "h140wn4",
            "score": 1,
            "text": "We should tax everyone more, except for me.\n\nSincerely,\n\nEveryone",
            "title_similarity": "0.523972",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h140x32",
            "score": 1,
            "text": "But but but don’t rich people donate to politicians? Funny ha ha how that works.",
            "title_similarity": "0.69422543",
            "sentiment_compound": 0.9428
        },
        {
            "id": "h140xn7",
            "score": 1,
            "text": "Trickle down economics never worked. It's about time we have trickle up taxes.",
            "title_similarity": "0.39848998",
            "sentiment_compound": 0.0
        },
        {
            "id": "h140y7o",
            "score": 1,
            "text": "wish it would happen but I doubt it ever will.",
            "title_similarity": "0.075182796",
            "sentiment_compound": -0.34
        },
        {
            "id": "h14117w",
            "score": 1,
            "text": "Member the Panama papers? I member.",
            "title_similarity": "0.30397022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1412b2",
            "score": 3,
            "text": "Good! It's about damn time these freeloaders started paying their fair share like everyone else has to.",
            "title_similarity": "0.53151107",
            "sentiment_compound": 0.75
        },
        {
            "id": "h1417zq",
            "score": 1,
            "text": "Can’t wait for nothing to come of it.",
            "title_similarity": "0.056132834",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14183u",
            "score": 1,
            "text": "Still waiting for that money to trickle down",
            "title_similarity": "0.24645703",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14199u",
            "score": 1,
            "text": "Oh, cool. I'll put this on the list of things Democrats will never achieve but will run on in the next election like they actually plan on doing something about it. Right next to Medicare for all.",
            "title_similarity": "0.34225583",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1419po",
            "score": 1,
            "text": "Still hard for people to understand that how do you tax income that is stock based. You can’t tax something you haven’t sold yet. That wealth means  nothing until you sell it. And guess what, you then pay taxes.",
            "title_similarity": "0.5861804",
            "sentiment_compound": 0.34
        },
        {
            "id": "h141bzp",
            "score": 1,
            "text": "There’s a reason the rich stay rich and the poor stay poor. :(",
            "title_similarity": "0.6038773",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h141c5u",
            "score": 1,
            "text": "It's going to be blank the rich, and tax is the best blank they can hope for.",
            "title_similarity": "0.5605362",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h141d7f",
            "score": 1,
            "text": "I bet Bezos is wondering if he can move up that timeline on becoming a super villain living in space!",
            "title_similarity": "0.35830298",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h141e0g",
            "score": 1,
            "text": "Panama. Papers.",
            "title_similarity": "0.26760483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h141ekw",
            "score": 1,
            "text": "\"If the overgrown wealth of an individual be deemed dangerous to the State, the best corrective is the law of equal inheritance to all in equal degree\"\n\nThomas Jefferson.",
            "title_similarity": "0.58664346",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h141fjj",
            "score": 1,
            "text": "Finding out billionaires don’t pay taxes is “explosive”? \n\nOh no! I’ve been carrying around explosive news for years!",
            "title_similarity": "0.6875342",
            "sentiment_compound": -0.2462
        },
        {
            "id": "h141h3z",
            "score": 1,
            "text": "Why do people believe this shit - the rich ain't getting taxed!",
            "title_similarity": "0.5521375",
            "sentiment_compound": -0.2363
        },
        {
            "id": "h141inr",
            "score": 1,
            "text": "Paid w more covid relief than they paid in taxes. Sad.",
            "title_similarity": "0.5996802",
            "sentiment_compound": 0.0717
        },
        {
            "id": "h141kgy",
            "score": 1,
            "text": "It’s adorable that people are still surprised by this.",
            "title_similarity": "0.3028803",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h141rb6",
            "score": 3,
            "text": "Explosive report? As in a report that says something we didn’t know and have never heard about? \n\nBillionaires are TAX DODGING?????  No!!  I never knew that!\n\nI mean, Warren Buffet has been saying it for years, but now....  there’s an EXPLOSIVE REPORT!!!\n\nTHIS TIME it will be different. Now that we finally all know.",
            "title_similarity": "0.64700687",
            "sentiment_compound": -0.5711
        },
        {
            "id": "h141t7b",
            "score": 2,
            "text": "what they don’t show in the tax records is all the foreign kids making 2$ a day to make them billionaires in the first place.",
            "title_similarity": "0.5612223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h141ter",
            "score": 1,
            "text": "I, for one, look forward to everyone being vocally angry for a few days until we all collectively toss this into the dustbin of history in the same way we did with the Panama papers…",
            "title_similarity": "0.51572245",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h14201r",
            "score": 1,
            "text": "Breaking News: It won't happen.\n\nNobody is shocked.",
            "title_similarity": "0.15152912",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h14206j",
            "score": 2,
            "text": "This will be swept under the rug like the Panama papers. Anyone remember that?",
            "title_similarity": "0.4404366",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h14209y",
            "score": 1,
            "text": "You mean the Panama Papers?  What?",
            "title_similarity": "0.34567004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1422l1",
            "score": 1,
            "text": "I'm a fan of people paying taxes but complaining that a stock portfolio went up and if someone has not paid any taxes before they cash it out is ridiculous.",
            "title_similarity": "0.7628826",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h1427c8",
            "score": 1,
            "text": "you need a report to figure that out?",
            "title_similarity": "0.1585941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14289p",
            "score": 1,
            "text": "We can’t even get our representatives to agree that everyone should be allowed to vote with minimal barriers or that elections should be decided by accurately counted vote totals. We can’t even get most of one entire party to acknowledge that Trump lost, ffs. Not a damn thing is actually going to happen in response to this.",
            "title_similarity": "0.31992203",
            "sentiment_compound": 0.092
        },
        {
            "id": "h142hrx",
            "score": 1,
            "text": "Is it really explosive news that the people who can afford teams of lawyers, bankers and accountants manage to exploit loopholes",
            "title_similarity": "0.7862854",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h142pvp",
            "score": 1,
            "text": "*laughs in Panama papers*",
            "title_similarity": "0.42143255",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h142qja",
            "score": 1,
            "text": "Momentum were happy about momentum, when logically it should be the most pressing things on the agenda of every politician",
            "title_similarity": "0.52856696",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h142tvq",
            "score": 1,
            "text": "Blame the fucking accountants, they're the ones who know how to do this lol. If someone came to you and said I can get you ALL of your money back what would you say? The rich need to be taxed heavily, but loopholes need to be closed",
            "title_similarity": "0.703346",
            "sentiment_compound": 0.4069
        },
        {
            "id": "h142v6m",
            "score": 1,
            "text": "That will never happen in america. Corrupt to the bone",
            "title_similarity": "0.2566741",
            "sentiment_compound": 0.0
        },
        {
            "id": "h142vrr",
            "score": 1,
            "text": "… this means nothing without bribing Manchin first…",
            "title_similarity": "0.27275762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1432ew",
            "score": 3,
            "text": "How about we skip the taxation and get right to dinner 🍴 🐷💰",
            "title_similarity": "0.24679524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1432nm",
            "score": 1,
            "text": "You know how many times I've heard this said?",
            "title_similarity": "0.315229",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14362p",
            "score": 1,
            "text": "I thought we knew this already?",
            "title_similarity": "0.20383546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1436zf",
            "score": 1,
            "text": "A comprehensive and transparent audit of government spending is desperately needed in addition to tax reform.",
            "title_similarity": "0.5575113",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h143el8",
            "score": 1,
            "text": "Donald trump is coming",
            "title_similarity": "0.4045996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h143er7",
            "score": 1,
            "text": "Gains momentum in the sense that the people who were already for it are still for it ?  Has this changed any minds ?",
            "title_similarity": "0.38707256",
            "sentiment_compound": 0.4137
        },
        {
            "id": "h143evb",
            "score": 1,
            "text": "Y'all forget the Panama Papers already? Nothing will come of this. Your elected leaders and the wealthy tax dodgers have a mutual interest in not fixing this. No reform will be attempted to correct this, any existing law to prevent this will not be enforced. If you aren't fresh into your teens, you've seen this before, and you know how it ends.",
            "title_similarity": "0.41299406",
            "sentiment_compound": 0.0613
        },
        {
            "id": "h143h63",
            "score": 1,
            "text": "Nothing will be done about it. \n\nJust like the last time. \n\nAnd the last time. \n\nIt's so dreary at this point.",
            "title_similarity": "0.13060845",
            "sentiment_compound": -0.1571
        },
        {
            "id": "h143iwk",
            "score": 1,
            "text": "I disagree with the direction of this argument. They are saying that people should pay income tax on money that isn’t income. The only way I think this makes sense is if they treat your investment gains similar to property tax which is nationally around 1% a year for your overall value of you home (investment). If you take every home owner in America and calculate their taxes based on the increase in their home value it will lower the “true tax rate” they pay too and would make everyone gasp and say we need to start taxing those people wealthy enough to own a home more. \nAnyways, I think this article is just a math trick to make you mad. It’s not a fair look at their actual income tax. It looks like they are pay income tax just like you and I.",
            "title_similarity": "0.60745955",
            "sentiment_compound": 0.5366
        },
        {
            "id": "h143lp5",
            "score": 1,
            "text": "I just will never understand how taxing the rich isn’t the most popular thing any government can possibly do.",
            "title_similarity": "0.50130516",
            "sentiment_compound": 0.7713
        },
        {
            "id": "h143ofj",
            "score": 1,
            "text": "Who is this surprising???  Oh yeah, a couple Republicans...🤪",
            "title_similarity": "0.4171276",
            "sentiment_compound": 0.6267
        },
        {
            "id": "h143pbt",
            "score": 2,
            "text": "and also actually making the irs do their job.   instead of investigating low hanging fruit because it's easier",
            "title_similarity": "0.48472977",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h143uoe",
            "score": 1,
            "text": "It turned into “I became the rich”: https://youtu.be/ZV1b89QIoEs\n\nIrony",
            "title_similarity": "0.579972",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h143w4b",
            "score": 1,
            "text": "What guarantee do we have that the taxed money will go towards infrastructure (Schools, public transport, healthcare)? I’m all for taxing the rich, but if this is just a stunt to legally fund politicians and the military, I’m not holding my breath.",
            "title_similarity": "0.69470114",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h143w8h",
            "score": 1,
            "text": "How about eliminate tax loopholes and quit making the tax code so damn difficult.",
            "title_similarity": "0.5290458",
            "sentiment_compound": -0.7407
        },
        {
            "id": "h1442bp",
            "score": 1,
            "text": "I think we ought to think about property tax also\n... you own more than 5 acres... new tax rate...\n\nIn CALI there are so many huge properties that pay squat for tax...\n\nHigh taxes will make property flow",
            "title_similarity": "0.6740628",
            "sentiment_compound": 0.2911
        },
        {
            "id": "h1442d0",
            "score": 1,
            "text": "Not happening. Biden could not even put a 28% Corp tax. Had to back out to 21% Trump era tax. Politicians are sold to big corps.",
            "title_similarity": "0.47112203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1442j1",
            "score": 1,
            "text": "No shit, when you realize that over a quarter of your income goes to taxes and that billionaires don't pay anything, you might get the idea that society is rigged.\n\nAnd it is rigged. Paying taxes is for the plebs, Saint Reagan made sure of that.",
            "title_similarity": "0.6782714",
            "sentiment_compound": 0.1331
        },
        {
            "id": "h1444id",
            "score": 1,
            "text": "The same momentum it gained after the Panama papers?",
            "title_similarity": "0.49966675",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1446pv",
            "score": 1,
            "text": "lol \"gains momentum\" is always the headline.  Reality check:  I bet the vast majority of lower middle class and under want to tax the rich and have for a very long time.",
            "title_similarity": "0.81812805",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h14476u",
            "score": 1,
            "text": "If rich people and corporations were paying their fair share of taxes like we all do, they wouldn’t be so rich today. And we wouldn’t have all this problems today, 😂 last crisis we had, we bailed out corporations of the rich with government borrowing from federal reserve on tax payers behalf, someone has to pay all that back. They are to big to fail and too rich to pay, they only know how to take, they don’t know how to give. I don’t think everyone that’s rich is avoiding to pay their fair share, but most are. That’s why in the end, we are all going to pay for it.",
            "title_similarity": "0.76153445",
            "sentiment_compound": 0.8149
        },
        {
            "id": "h144b76",
            "score": 1,
            "text": "Hm. Panama Reports didn't make anything happen. My faith this will is near zero.",
            "title_similarity": "0.0583417",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h144c4f",
            "score": 1,
            "text": "Don’t worry. I’m holding GME.",
            "title_similarity": "0.21961728",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h144dr0",
            "score": 1,
            "text": "Woo! Can't wait for nothing to happen about it!",
            "title_similarity": "0.1209855",
            "sentiment_compound": 0.5696
        },
        {
            "id": "h144iwb",
            "score": 3,
            "text": "So many drone-like people are scared of the word \"socialism\", and simultaneously support a system that acts like socialism for corporations and the ultra wealthy. They can't stand the thought of a homeless person \"free riding\" government-provided housing or healthcare, but fail to get mad at massive corporate subsidies and tax cuts. The ultra wealthy have already won by convincing the masses to believe in trickle down. What a joke.",
            "title_similarity": "0.6529065",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h144jc3",
            "score": 2,
            "text": "And guess what... DOJ is going after sources of the report instead of going after the tax dodgers. Outrageous!",
            "title_similarity": "0.61963475",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h144mp7",
            "score": 1,
            "text": "Even Chris Wallace on fox gave him shit.",
            "title_similarity": "0.27439785",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h144unr",
            "score": 1,
            "text": "like trump said in the 2016 debates....career politicians made these rules.  if you don't like it change the rules.  the elite just have the money to hire experts to allow them to take full advantage.  these rich politicians might not be billionaires but you know most of them find loopholes and don't pay their fair share.  i'm in favor of eliminating all credits and deductions entirely.  what you earn is what you should pay, period. \n\nalso, we didn't need an \"explosive report\".  anyone with a functioning brain knew this was the case.  socialism for the rich is a real thing.",
            "title_similarity": "0.6816015",
            "sentiment_compound": 0.9464
        },
        {
            "id": "h144vk8",
            "score": 1,
            "text": "It'll be very interesting if this ever happens in this country.  Spoiler alert though, it won't, and if it does then all the money here will just go completely offshore, so.",
            "title_similarity": "0.49545968",
            "sentiment_compound": 0.6361
        },
        {
            "id": "h14514v",
            "score": 1,
            "text": "Wait what? Is this something people don't know about? By god, I've thought we've all been arguing on the assumption that we already knew none of these ghouls have been actually paying taxes. I mean this was a talking point in 2016. What in the sam hell.",
            "title_similarity": "0.44915923",
            "sentiment_compound": -0.782
        },
        {
            "id": "h1452e3",
            "score": 1,
            "text": "Why the fuck is it even a debate",
            "title_similarity": "0.10375087",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h145c66",
            "score": 1,
            "text": "I doubt the momentum would go any further.",
            "title_similarity": "0.075019225",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h145dlp",
            "score": 1,
            "text": "Billionaires on paper, but total nobodies in all other respects",
            "title_similarity": "0.51788986",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h145puf",
            "score": 1,
            "text": "Overturn Citizens United, restore and reinforce the Fairness Doctrine, and start heavily persecuting financial crimes by the obscenely wealthy. The fact Bezos is getting a 10 billion dollar GRANT because he didn’t get the space contract is absurd. An unconditional, zero obligation tax money grant to the wealthiest man in history. This is the definition of obscene.",
            "title_similarity": "0.7857717",
            "sentiment_compound": 0.8455
        },
        {
            "id": "h145sz3",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.17610532",
            "sentiment_compound": 0.68
        },
        {
            "id": "h146089",
            "score": 2,
            "text": "I read this morning that Elon musk didn't pay any taxes. And I thought to myself \"well yeah, thats to be expected when the tax code was shaped by billionaires to do just that\"\n\nSo idk about explosive...",
            "title_similarity": "0.506606",
            "sentiment_compound": 0.4078
        },
        {
            "id": "h1460hd",
            "score": 1,
            "text": "Problem is... Do you think they’re going to tax the rest of us any less? Or just find LOTS of new ways to spend all their new money.\n\nThe road to evil is paved with good intentions.",
            "title_similarity": "0.65974444",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h1460ve",
            "score": 2,
            "text": "I’m curious who pays the majority of taxes the government receives?  I looked it up and it was shocking.",
            "title_similarity": "0.6526971",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h146a4k",
            "score": 1,
            "text": "How is this even a discussion?\n\nEither they pay taxes or we take their toys away.\n\nJust like everyone else.",
            "title_similarity": "0.50468457",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h146e59",
            "score": 1,
            "text": "No one above 50 should be allowed in politics period",
            "title_similarity": "0.2527579",
            "sentiment_compound": -0.296
        },
        {
            "id": "h146gas",
            "score": 1,
            "text": "Buy GME for the largest wealth transfer in history. Entire generation’s wealth have been printed and stolen by naked shorts created out of thin air. This is the way to change things. The evidence is there. All you have to do is look, buy, and hold.",
            "title_similarity": "0.6942038",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h146gfp",
            "score": 2,
            "text": "Idiocracy became a prophecy. Where mega companies run the world. And the world is left with people that have no say in anything.",
            "title_similarity": "0.5613766",
            "sentiment_compound": -0.296
        },
        {
            "id": "h146nh6",
            "score": 1,
            "text": "Can we stop referring to billionaires as \"the rich\"? Using that term only mobilizes the upper-middle class against the cause. Nobody should be able to justify defending the mega rich. Tax the mega rich!",
            "title_similarity": "0.7446641",
            "sentiment_compound": 0.8718
        },
        {
            "id": "h146p8s",
            "score": 1,
            "text": "3.4% of $401 billion is $13.634 billion\n\n14.0% of $280,000 is $39,200.\n\n14.0% of $401 billion is $56.14 billion\n\nYou can do a lot more with the additional $39.56 billion and the top 25 still keep $344.86 billion \n\n$13.634 billion is 424,336 median household contributions...from 25 people, so there is that...",
            "title_similarity": "0.47776547",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h146r2n",
            "score": 1,
            "text": "Holy shit this sub is pure clickbait. Do you really think it's gonna happen under the Biden's administration?",
            "title_similarity": "0.48834392",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h146xvz",
            "score": 1,
            "text": "Biden won't do it.",
            "title_similarity": "-0.04052633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h146yt4",
            "score": 1,
            "text": "Too bad it doesn't matter since the rich has all the influence/power...",
            "title_similarity": "0.63251925",
            "sentiment_compound": 0.0067
        },
        {
            "id": "h1470b5",
            "score": 1,
            "text": "Liquidate them!  Buy GME tomorrow!",
            "title_similarity": "0.35060373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1474nn",
            "score": 1,
            "text": "Please don’t actually. I don’t want my lifelong pursuit of the 💰💰to be for nothing",
            "title_similarity": "0.1535952",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h14774z",
            "score": 1,
            "text": "It'll gain the momentum of a balloon at a kids birthday party traveling across the room and bumping into somebody's head slightly annoying them.",
            "title_similarity": "0.46515995",
            "sentiment_compound": 0.5709
        },
        {
            "id": "h147781",
            "score": 1,
            "text": "Have I ever told you the definition of insanity?",
            "title_similarity": "0.24521968",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h147avq",
            "score": 2,
            "text": "Just off the top of my head approximate dates and figures\n\n* The mid-2000s there are a few billionaires whose fortunes range from **$1 to 6 or 7 billion*\n* 2005 - 2009 cities deploy **police riot squads** to suppress G8 protests\n* 2009-2011 Occupy Wall St.\n* 2015 candidate Bernie Sanders nearly wins the Democratic nomination on a platform of addressing wealth inequality\n* 2017 - 2021 total clusterfuck of a fascist presidency, wildfires ravage Australia and the US west coast, widespread protests and riots in response to police brutality, a global pandemic, massive unemployment and local businesses collapse, and a mob storms the Capital in an attempted coup\n* 2021 - There are more billionaires than ever, some of which have **SEVERAL HUNDRED BILLION $$$**\n\n     what  \n            thee\n                  actual  \n        fuck",
            "title_similarity": "0.66964585",
            "sentiment_compound": -0.9595
        },
        {
            "id": "h147bsy",
            "score": 2,
            "text": "You know that the only way confidential info like this could be released was if there was a leak in the IRS. That’s pretty dangerous",
            "title_similarity": "0.5206661",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h147c1r",
            "score": 1,
            "text": "Become a non-affiliated voter, folks!",
            "title_similarity": "0.21059392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h147cao",
            "score": 1,
            "text": "What did they publish the Panama Papers again?",
            "title_similarity": "0.36402178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h147g6g",
            "score": 1,
            "text": "Just close the loopholes there's no need for new tax laws",
            "title_similarity": "0.27602318",
            "sentiment_compound": -0.296
        },
        {
            "id": "h147gto",
            "score": 2,
            "text": "Remember the Panama Papers, that was fun.",
            "title_similarity": "0.4467628",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h147kf1",
            "score": 1,
            "text": "Ain’t nothing gonna change. They got GQP brainwashed. Now they can sik them on any “enemy” they choose.",
            "title_similarity": "0.45017493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h147p9a",
            "score": 1,
            "text": "We can say things like \"Tax the Rich\", but nothing will change until the tax code becomes simplier, effectively making the many loopholes obsolete.",
            "title_similarity": "0.56924725",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h147pbt",
            "score": 1,
            "text": "Just like the Panama Papers? Oh boy! They’ll finally have to pay their fair share!  /s",
            "title_similarity": "0.61772156",
            "sentiment_compound": 0.7339
        },
        {
            "id": "h147r52",
            "score": 1,
            "text": "This is a great unifying opportunity that America needs, if there is to be one at all. People need to realize that the politics war is really a front for a very real class war and put aside their differences to see positive change for those that the tax won’t effect...literally everyone not in the 0.1% club.",
            "title_similarity": "0.51888776",
            "sentiment_compound": 0.3477
        },
        {
            "id": "h147tfy",
            "score": 1,
            "text": "I think people don’t realize how 3rd world the USA is in certain regions. People are living like it’s 1970 and the wealthy like that because they exploit them for votes and cheap labor. That’s why politicians keep their jobs. They can’t control the peoples vote because those people are easily bought through advertising or empty promises.",
            "title_similarity": "0.593716",
            "sentiment_compound": 0.886
        },
        {
            "id": "h147v36",
            "score": 1,
            "text": "Oh, this is suddenly a revelation?",
            "title_similarity": "0.26092908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h148880",
            "score": 1,
            "text": "How much money does one have to have to be considered rich?",
            "title_similarity": "0.67881817",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h148dck",
            "score": 1,
            "text": "You guys don't understand.  It's the illegal immigrants fault.",
            "title_similarity": "0.37595934",
            "sentiment_compound": -0.743
        },
        {
            "id": "h148olj",
            "score": 1,
            "text": "Nice. These assholes are finally getting exposed for what they really do.",
            "title_similarity": "0.48714185",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h148rl4",
            "score": 2,
            "text": "Can someone tell me where do these taxes even go? The Gov sucks with spending money",
            "title_similarity": "0.5345672",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h148txg",
            "score": 1,
            "text": "Dont need to tax the rich after buying their stuff. However they should not have any write offs or secondary purpose loss like owning other stuff that sucks just to have write offs. They should as well as this country should, have a flat tax no write offs except children care.",
            "title_similarity": "0.410156",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h148vdn",
            "score": 1,
            "text": "It isn't taxing the rich, it's fixing the blatant holes in the tax code so they pay the appropriate amount, while they are at it and fix the double deduction of claiming on state and federal so they write off more as a total than they lost.",
            "title_similarity": "0.6238039",
            "sentiment_compound": -0.7324
        },
        {
            "id": "h148vq6",
            "score": 1,
            "text": "Whoa no way the rich get away with crimes??",
            "title_similarity": "0.566463",
            "sentiment_compound": 0.4137
        },
        {
            "id": "h1498nh",
            "score": 1,
            "text": "Going to be fun watching people descend into despair as they realize that control comes from actual power and not checking boxes on a ballot. It's starting to look a lot like Elysium out there.",
            "title_similarity": "0.43641126",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h149bwc",
            "score": 1,
            "text": "We are coming for you",
            "title_similarity": "0.16943681",
            "sentiment_compound": 0.0
        },
        {
            "id": "h149qgj",
            "score": 2,
            "text": "What's the point of taxing them if the government spending is reckless?",
            "title_similarity": "0.5720242",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h149vpj",
            "score": 1,
            "text": "Another good idea that will never happen as long as the likes of Manchin and Sinema continue their crusade to uphold the filibuster at the expense of all other aspects of American government and society.",
            "title_similarity": "0.3674563",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h149yz7",
            "score": 1,
            "text": "Yeah... because the Panama Papers had such an impact....",
            "title_similarity": "0.5378443",
            "sentiment_compound": 0.296
        },
        {
            "id": "h14a03b",
            "score": 1,
            "text": "no it fucking didn't",
            "title_similarity": "-0.08540778",
            "sentiment_compound": -0.296
        },
        {
            "id": "h14a4yl",
            "score": 1,
            "text": "Enact the VAT!",
            "title_similarity": "0.3381855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14a9w6",
            "score": 1,
            "text": "I mean the Panama Papers came out 5 yrs ago and were promptly forgotten. Same will happen again",
            "title_similarity": "0.30045834",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h14aauw",
            "score": 2,
            "text": "We should tax the rich. Problem is, it's extremely easy for a companies to just pick up and leave. Which is essentially what is happening to France and their wealth/corporate tax.",
            "title_similarity": "0.70990264",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h14ac4a",
            "score": 1,
            "text": "Remember the Panama papers?",
            "title_similarity": "0.31136993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14aif5",
            "score": 1,
            "text": "Come on, Jeffrey, you can do it\nPave the way, put your back into it\n\nTell us why, show us how\nLook at where you came from, look at you now\n\nZuckerberg and Gates and Buffet\nAmateurs, can fucking suck it\n\nFuck their wives, drink their blood\nCome on, Jeff, get 'em!",
            "title_similarity": "0.44302702",
            "sentiment_compound": -0.8047
        },
        {
            "id": "h14al2x",
            "score": 1,
            "text": "Fuck taxing, let’s eat em.",
            "title_similarity": "0.28609896",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h14alx1",
            "score": 1,
            "text": "While I agree with the sentiment of this article, I hate the generalizations it uses.  I think there are three major areas of opportunity that should be addressed a) fix corporate tax laws (and even business tax laws) b) fix all the stupid god damn loopholes in the system that wealthy people use to hide their money and profits (e.g. dubious offshore accounts which are unchecked) and c) give the irs the support they need in the form of competent staff, tools, and teeth.  I don’t think we should continue to fetishize billionaires as targets and instead we should point toward the specific problems (dubious tax credits etc) and list the companies who violate this.",
            "title_similarity": "0.6766788",
            "sentiment_compound": -0.4284
        },
        {
            "id": "h14aqg7",
            "score": 1,
            "text": "\"explosive report.\" We've known that these companies dodge taxes, this is nothing new. Renewed media cycle outrage won't do anything. Vote for politicians who actually want what's best for everybody, not just because they're on your team's ticket.",
            "title_similarity": "0.53947556",
            "sentiment_compound": 0.296
        },
        {
            "id": "h14ax35",
            "score": 1,
            "text": "Light the rich on fire!  They probably taste like shit so fuck eating them....",
            "title_similarity": "0.3686061",
            "sentiment_compound": -0.6105
        },
        {
            "id": "h14b0b0",
            "score": 1,
            "text": "No wonder they’re trying to escape to the moon",
            "title_similarity": "0.1961252",
            "sentiment_compound": -0.128
        },
        {
            "id": "h14b1rf",
            "score": 1,
            "text": "*cough* GME *cough*",
            "title_similarity": "0.20957801",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14b493",
            "score": 1,
            "text": "Lol, yeah like anything even resembling taxing the rich, making corporations pay their taxes or stopping subsidies for rich people and corporations will ever get anywhere in this or any other senate. \n\nCall me cynical but I think we have heard this song before.",
            "title_similarity": "0.72318816",
            "sentiment_compound": 0.6757
        },
        {
            "id": "h14bcbp",
            "score": 1,
            "text": "Even Chris Wallace on fox gave him shit.",
            "title_similarity": "0.27439785",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h14bh3t",
            "score": 1,
            "text": "“Tax the rich” should gain momentum like a snowball down a ski jump ramp.",
            "title_similarity": "0.63311523",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h14bqlt",
            "score": 1,
            "text": "By now we should eat them.",
            "title_similarity": "0.18208338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14c4hm",
            "score": 1,
            "text": "It pisses me off. We return a lot of their money with our taxed incomes, and they can't be bothered to properly chip in for the infrastructure that they didn't pay for, but abuse every day.",
            "title_similarity": "0.60963786",
            "sentiment_compound": -0.7827
        },
        {
            "id": "h14cnnk",
            "score": 2,
            "text": "They don't want to tax themselves, so they will not get taxed. Enjoy the bread and circus.",
            "title_similarity": "0.2084602",
            "sentiment_compound": -0.431
        },
        {
            "id": "h14crrx",
            "score": 2,
            "text": "Whatever happened to the Proletarian Revolution?",
            "title_similarity": "0.30041125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14d3um",
            "score": 1,
            "text": "...explosive? As in this came as a surprise?",
            "title_similarity": "0.36848974",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h14dgvn",
            "score": 1,
            "text": "\"TAX THE RICH\"  should be our priority",
            "title_similarity": "0.71151435",
            "sentiment_compound": 0.6523
        },
        {
            "id": "h14dkc2",
            "score": 1,
            "text": "You are never going to fix it this way. Just put a huge service tax on all items and demand other countries do the same and THEN give a large UBI.",
            "title_similarity": "0.6187576",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h14e808",
            "score": 2,
            "text": "Oh you mean the panama papers everyone forgot about.",
            "title_similarity": "0.33108163",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14ed5p",
            "score": 1,
            "text": "New billionaires  before their success: \n\n... it is just fair that ultra wealthy help and pay more taxesss ! \n\nNew billionaires... I’m not paying taxes, those democrats  are crazy !",
            "title_similarity": "0.72802216",
            "sentiment_compound": 0.8395
        },
        {
            "id": "h14ee93",
            "score": 1,
            "text": "I’m just going to leave this here. \n\nhttps://savingjournalism.substack.com/p/propublicas-bombshell-bullshit-tax",
            "title_similarity": "0.39204064",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h14eewq",
            "score": 1,
            "text": "Is anyone going to mention the fact that the rich usually have more access to financial intelligence either by way of financial eduction they already possess or the ability to hire the foremost financial experts in each sub-field to get the answers they do not have? And this allows individuals of affluent means to find many legal ways of not paying taxes, which are highly immoral for in principal but still legal for in court nonetheless? Notwithstanding such money was made legally in the first place as those with the personality type to evade and avoid taxes are also the type to cross into that “white collar grey area” such as naked short selling and whatnot (that seems to be the it thing in the news recently too! Except if you read the laws yourself and you know legalese, you will easily realize naked shorting is completely legal in certain cases- but I digress off topic now) I just think too many people blame the rich for what is happening here when this is the fault of government- a result of government’s inept attempt to structure our tax codes in a way that make sense whatsoever IMHO... lmk if you agree/disagree and why?",
            "title_similarity": "0.7040232",
            "sentiment_compound": 0.8852
        },
        {
            "id": "h14egih",
            "score": 1,
            "text": "\"Explosive Report on Billionaire Tax Dodging\"\n\nI'm shocked! Shocked! Well not that shocked.",
            "title_similarity": "0.82390577",
            "sentiment_compound": -0.3658
        },
        {
            "id": "h14en97",
            "score": 1,
            "text": "Should the wealthiest Americans pay more in taxes?\n\nThis is a similar question, asked a slightly different way in a different poll. And the answer in this survey was also a resounding YES. In a Politico/Morning Consult poll from February 2019, 76% of registered voters agreed that the wealthiest Americans should pay more in taxes.\n\nShould the highest tax rate go up to 70%?\n\nIn a Hill-Harris X survey conducted in January 2019, 59% of the registered voters polled agreed with the idea that America’s highest tax rate should increase to 70%.",
            "title_similarity": "0.62949353",
            "sentiment_compound": 0.9312
        },
        {
            "id": "h14er0i",
            "score": 1,
            "text": "I want to hear them squeal like piggies.",
            "title_similarity": "0.30290133",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h14ewak",
            "score": 1,
            "text": "Where are Donald Trump's tax returns? I see the billionaires got outed. But if they can be outed then so can former government employee Donald Trump.",
            "title_similarity": "0.6493307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14eyzf",
            "score": 1,
            "text": "These billionaires pay less than a 5% tax rate the same way that a 50-something year old earning $75,000 with a million invested in the NASDAQ would pay less than a 5% tax rate.\n\nIf you calculate tax rates incorrectly you get wacky claims that don't make sense.",
            "title_similarity": "0.5336221",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h14ez0y",
            "score": 1,
            "text": "So they can dodge more taxes?  The day Congress changes tax codes to actually tax fairly, I’ll eat my shorts.",
            "title_similarity": "0.5289851",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14f6zl",
            "score": 1,
            "text": "You don't even need a new law. Just fund the IRS properly.",
            "title_similarity": "0.4221999",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14f91j",
            "score": 1,
            "text": "I’m glad this is taking a hold on the public. Hopefully there is widespread change. The rich need to be taxed so the poor can actually work and earn a proper living, not simply work to survive starvation. ffs.",
            "title_similarity": "0.6677208",
            "sentiment_compound": 0.2782
        },
        {
            "id": "h14fkrx",
            "score": 1,
            "text": "The best tax is a sales tax.\n\nRich people cannot dodge sales tax.\n\nEat out at a restaurant. Pay sales tax. \n\nStay at a hotel. Pay sales tax.\n\nBuy fuel for your airplane. Pay sales tax.\n\nBuy furniture for your new house. Pay sales tax.\n\n- - -\n\nYou collect a federal sales tax, of say, 50%. On everything. No exceptions. Take that mountain of cash, and divide it by 340,000,000 (population of humans in America). Give that same amount to each human in America.\n\nThe effect? You partially redistributed wealth, in an effective manner, with minimal complications.\n\n- - -\nAssume:\nCash registers received $1,000 billion this month.\n\n50% of that is $500 billion this month.\n\nDivided $500 billion by 340 million people.\n\nThat’s $1,470 per person this month.\n\nIf you and your wife have one kid. Then you have three (3) humans.\n\nSo, you get $1,470 x 3 = $4,410 this month.\n\nJeff Bezos gets $1,470 this month.\n\nAll funded by the 50% Federal Sales Tax.",
            "title_similarity": "0.60115266",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h14fpqk",
            "score": 1,
            "text": "Push this lane",
            "title_similarity": "0.18251608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14fxoq",
            "score": 1,
            "text": "This is such a weird title. Like we didn’t already know the rich evade taxes.",
            "title_similarity": "0.6274129",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h14g1te",
            "score": 1,
            "text": "Tax the millionaires (Warren)",
            "title_similarity": "0.78088343",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14gayd",
            "score": 1,
            "text": "After i realized he was on tucker, but he seems like a solid theory to me. Im sad were not getting more Rox though. I am shocked at how bad it was. Had to watch this? vs total viewers.",
            "title_similarity": "0.36852798",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h14gf3z",
            "score": 1,
            "text": "Explosive? Seriously?! Billionaires dodge tax. More news at 11.",
            "title_similarity": "0.6986985",
            "sentiment_compound": -0.3296
        },
        {
            "id": "h14ghs2",
            "score": 2,
            "text": "But can we actually just DO it this time?  Instead of talking about it??",
            "title_similarity": "0.15290761",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14gjg0",
            "score": 1,
            "text": "Billionaires dodge tax? I'm so shocked right now, how could we have possibly predicted that.",
            "title_similarity": "0.5932529",
            "sentiment_compound": -0.4572
        },
        {
            "id": "h14grth",
            "score": 1,
            "text": "Uh oh",
            "title_similarity": "0.0036971178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14h0gx",
            "score": 1,
            "text": "Our tax code right now is just a “how to” for cheaters...",
            "title_similarity": "0.5465785",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h14h35b",
            "score": 1,
            "text": "Genuine question:. If the problem is that they were dodging taxes and paying nothing wouldn't raising taxes on the rich be meaningless?",
            "title_similarity": "0.63883704",
            "sentiment_compound": -0.34
        },
        {
            "id": "h14h51a",
            "score": 1,
            "text": "Good.",
            "title_similarity": "0.0865248",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h14hvw0",
            "score": 1,
            "text": "\"Legally dodge taxes\". That's all you need to know.\n\nWho writes the tax code? People that are elected into the House of Representatives. They are the ones responsible for all the loopholes that companies and individuals use to reduce their tax liabillty.\n\nDon't like it, then vote someone in that won't listen to lobby groups or re-election campaign fund raisers. But as long as they are dependent upon outside money to get re-elected, they can be influenced to add loopholes to tax codes.",
            "title_similarity": "0.5707096",
            "sentiment_compound": 0.0665
        },
        {
            "id": "h14hxnz",
            "score": 1,
            "text": "\n\nIncome disparity is a bad thing: it correlates with a multitude of adverse effects, one of which is lower economic growth. This was the result of a big study done by OECD:\n\n\n\n**Focus on Inequality and Growth - OECD**\nhttps://www.oecd.org/social/Focus-Inequality-and-Growth-2014.pdf\n\n\n\nThat is of course if you only care about money and not wellbeing. US is the wealthiest country, but is lagging behind a lot of poorer countries in wellbeing. What is common for the is higher tax percentages.\n\n\n\n**Adverse effects of high income disparity:**\nhttps://en.m.wikipedia.org/wiki/Effects_of_economic_inequality\n\n\n\n**Health:**\nObesity, mental illness, homicides, teenage births, incarceration, child conflict, drug use.\nLife expectancy by country, educational performance, trust among strangers, women's status, social mobility, even numbers of patents issued.\n\n\n\n**Society**\nSocial cohesion: in more equal societies, people are much more likely to trust each other, measures of social capital (the benefits of goodwill, fellowship, mutual sympathy and social connectedness among groups who make up a social units) suggest greater community involvement, and homicide rates are consistently lower.\n\n\n\n**Economic effectiveness*\nA house that provides less utility to a millionaire as a summer home than it would to a homeless family of five, is an example of reduced \"distributive efficiency\" within society, that decreases marginal utility of wealth and thus the sum total of personal utility. An additional dollar spent by a poor person will go to things providing a great deal of utility to that person, such as basic necessities like food, water, and healthcare.\n\n\n\n**\"The benefit of having rich people\"**\nA 2013 report from the group [Ofxam] stated that the $240 billion added to the fortunes of the world's richest billionaires in 2012 was enough to end extreme poverty four times over. Oxfam Executive Director Jeremy Hobbs said that \"We can no longer pretend that the creation of wealth for a few will inevitably benefit the many – too often the reverse is true.\"\n\n\n**Systemic stability of the economy**\nCentral Banking economist Raghuram Rajan argues that \"systematic economic inequalities, within the United States and around the world, have created deep financial 'fault lines' that have made [financial] crises more likely to happen than in the past\" – the Financial crisis of 2007–08 being the most recent example.\n\n\n**Monopolization**\nGreater income inequality can lead to monopolization of the labor force, resulting in fewer employers requiring fewer workers.[66] Remaining employers can consolidate and take advantage of the relative lack of competition, leading to less consumer choice, market abuses, and relatively higher real prices.\n\n\n**Ecology**\nIn developed countries, inequality tends to accelerate resource consumption by all classes.[122]\n\nResearch also shows that biodiversity loss is higher in countries or in US states with higher income inequality.",
            "title_similarity": "0.6665748",
            "sentiment_compound": 0.9756
        },
        {
            "id": "h14i0ey",
            "score": 1,
            "text": "Great article. \n\nBut politicians are funded by them, so all that will happen is a raise on the top tax bracket and more social security tax.\n\nGuess who doesn't pay (much) in those ?",
            "title_similarity": "0.7610478",
            "sentiment_compound": 0.8277
        },
        {
            "id": "h14i7ul",
            "score": 2,
            "text": "Politics is a lot about marketing so maybe stop saying “Tax the Rich” it sounds like an imposition. \n\nMaybe go with “Get tot rich to pay their taxes”. \n\nGuess that doesn’t fit so well on a bumper sticker.",
            "title_similarity": "0.7342663",
            "sentiment_compound": 0.8158
        },
        {
            "id": "h14i8v3",
            "score": 1,
            "text": "Bite their effin heads off",
            "title_similarity": "0.15338667",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h14i8xc",
            "score": 1,
            "text": "This will be as big a deal as the Panama Papers. BOOM",
            "title_similarity": "0.67866194",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14ijst",
            "score": 1,
            "text": "Hmm.... I thought eating was the only thing they we\nare good for though?",
            "title_similarity": "0.12460634",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h14iwde",
            "score": 1,
            "text": "Bets on what deviancy gets normalized next so we forget all about this?",
            "title_similarity": "0.2814541",
            "sentiment_compound": -0.2911
        },
        {
            "id": "h14iwrp",
            "score": 2,
            "text": "\"Tax 'em or we eat 'em\" should be the new motto. Let the rich worry about the poors coming for them with a literal BBQ grill, and they'll start begging the government to tax them.",
            "title_similarity": "0.54767823",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h14j681",
            "score": 1,
            "text": "(Looks at Senate, squints and sees Manchin)\n\nNot gonna happen.",
            "title_similarity": "0.25388283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14j6cl",
            "score": 2,
            "text": "Tax em up",
            "title_similarity": "0.5470307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14jdd9",
            "score": 1,
            "text": "Just tax the yachts. Can't dodge sales tax.",
            "title_similarity": "0.48874325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14k08q",
            "score": 2,
            "text": "Absolute power corrupts.....",
            "title_similarity": "0.36745468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14k2ak",
            "score": 2,
            "text": "\"gains momentum\"\n\nWho the hell doesn't know that billionaires pay less than low-middle class citizens?",
            "title_similarity": "0.6233964",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h14k6gu",
            "score": 2,
            "text": "Does this require the support of any Republicans and/or Manchin to happen?\n\nCause if so, it ain't happening.  Just like anything else this nation needs to actually evolve or progress.",
            "title_similarity": "0.3734132",
            "sentiment_compound": 0.5252
        },
        {
            "id": "h14k7vd",
            "score": 2,
            "text": "The core issue with the justice system right now is that punishments and fines don’t take the wealth of the person and the amount of money made from breaking the law into account.  \nMeaning that even if you get caught it is still very profitable to break the law.  \nIf you were to exchange fixed fines with percentages of either income or wealth you’d simultaneously help the poor and massively reduce white collar crimes because suddenly there’d be losses if caught. \n\nNo need to tax them more. Just ensure they don’t wiggle their way out of paying their current taxes. I mean increasing them is just an incentive for more people to dodge paying.\n\nTLDR; don’t tax the rich. Make breaking the law unprofitable.",
            "title_similarity": "0.5486159",
            "sentiment_compound": 0.9309
        },
        {
            "id": "h14khr3",
            "score": 2,
            "text": "If you're not a millionaire, you're either lazy, or you chose the wrong parents. /s",
            "title_similarity": "0.4302883",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h14kjun",
            "score": 1,
            "text": "Tax the billionaires, FUCK YEAH",
            "title_similarity": "0.798068",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h14m2ov",
            "score": 1,
            "text": ">one of the corporate interests he's currently defending.",
            "title_similarity": "0.48744893",
            "sentiment_compound": 0.25
        },
        {
            "id": "h14mobl",
            "score": 1,
            "text": "They'll tax the churches before this action passes, meaning never.",
            "title_similarity": "0.43101096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14mrfo",
            "score": 3,
            "text": "Funny thing, if you pay low waged people more or even increase benifits those people will spend more, that will drive the economy and increase tax revenue. If you give billionaires tax breaks the money will leave the country through a tax loop hole and never be seen again.",
            "title_similarity": "0.80668163",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h14mtzf",
            "score": 2,
            "text": ">explosive\n\nFor fuck sake. This isn’t new information and hasn’t been since the great depression.",
            "title_similarity": "0.3781566",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h14n63k",
            "score": 1,
            "text": "Unfortunately, a lot of the poorest voters in America who are hurt by the avarice of the rich vote for the GOP who almost always vote to give tax breaks to the rich.  I wish we Americans weren't so fucking stupid.",
            "title_similarity": "0.6762832",
            "sentiment_compound": 0.5857
        },
        {
            "id": "h14nd1y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0002482459"
        },
        {
            "id": "h14nwci",
            "score": 2,
            "text": "Foundations are just a tax dodge. Seriously. Instead of paying their fair share they just deposit into foundations to avoid taxes and pay for causes but at 6%. You know they can do both pay the taxes and give to good causes. Do you know why these fancy charity balls in nyc every year spends millions in just decor food entertainment lighting but very little on the cause itself? Like oh we raised 5 million (but it cost us4.5 million to throw this party).",
            "title_similarity": "0.4975813",
            "sentiment_compound": 0.9595
        },
        {
            "id": "h14nykf",
            "score": 1,
            "text": "Come on world, we can do this. We just gotta stick together. Don't let them divide us.",
            "title_similarity": "0.08443889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14oztx",
            "score": 1,
            "text": "I can’t believe you guys are lucky enough to pay 14% on $70,000 income.\nIn the U.K we would be paying an average of 24.7% and any earnings above that is taxed at 41%",
            "title_similarity": "0.5477606",
            "sentiment_compound": 0.34
        },
        {
            "id": "h14p6eb",
            "score": 1,
            "text": "Explosive report? We've known about the fucking \"Cayman islands\" since Movie Villains have had bank accounts since the 90s.",
            "title_similarity": "0.54546154",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h14pg1q",
            "score": 1,
            "text": "Very surprised that Louisiana passed this. Good on them.",
            "title_similarity": "0.31405386",
            "sentiment_compound": 0.6776
        },
        {
            "id": "h14prla",
            "score": 1,
            "text": "Following the tax code made by politicians isn’t tax dodging. These fucks are pointing the finger at the wrong people. Politicians are the problem. Trying to curry favor from businesses and people through tax law (buying votes and campaign donations) has created a convoluted mess.",
            "title_similarity": "0.60798216",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h14qhou",
            "score": 1,
            "text": "This shit is also why we have the most complicated tax code and a multi billion dollar industry to support it. It should be as easy as the government sending you a bill or a check but because all these loopholes are written in everyone now has to do a return and 99% of the shit was written and paid for by the rich.",
            "title_similarity": "0.75648713",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h14rufa",
            "score": 1,
            "text": "Oh dear, Murdoch's going to be working overtime to head this off ... Taxing the rich will cost jobs ! Ruin the economy !! Flood the country with immigrants !!! - Headlines on his rags and Tucker Carlson probably",
            "title_similarity": "0.70095724",
            "sentiment_compound": 0.5526
        },
        {
            "id": "h14sljd",
            "score": 1,
            "text": "Elizabeth is such a treasure",
            "title_similarity": "0.29228473",
            "sentiment_compound": 0.296
        },
        {
            "id": "h14smgn",
            "score": 1,
            "text": "If my dumbass is forced to pay it how come they aren’t? What kind of fugazzi bullshit is that",
            "title_similarity": "0.45376834",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h14socs",
            "score": 1,
            "text": "Gains momentum? Where? Twitter? It’s a shame that means cock all. The senate will never move against the wealthy in any tangible way.",
            "title_similarity": "0.41911978",
            "sentiment_compound": 0.1877
        },
        {
            "id": "h14spyg",
            "score": 1,
            "text": "never gonna happen",
            "title_similarity": "-0.06757037",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14svxb",
            "score": 1,
            "text": "I'll believe it when I see it",
            "title_similarity": "0.23741004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14t8ye",
            "score": 2,
            "text": "This seems really promising, can’t wait for literally nothing to happen.",
            "title_similarity": "0.2049493",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h14tbeb",
            "score": 1,
            "text": "So only \"billionaires\" are \"rich\"? https://www.pgpf.org/sites/default/files/Share-of-taxes-paid-by-income.gif",
            "title_similarity": "0.7090298",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h14teha",
            "score": 1,
            "text": "But what's to stop them from moving the money out of the country?",
            "title_similarity": "0.41075626",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h14tsm0",
            "score": 1,
            "text": "Ohh yeah, like that’s ever gonna happen",
            "title_similarity": "0.14905366",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h14u6fe",
            "score": 1,
            "text": "Remember when the Panama papers came out and absolutely nothing changed?",
            "title_similarity": "0.27470392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14ukix",
            "score": 1,
            "text": "actually, do you really think your life as a citizen would change for the better if rich were taxed more and properly?",
            "title_similarity": "0.6625404",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h14uq79",
            "score": 1,
            "text": "Spoiler alert: nothing is going to happen. With a few exceptions, our government does not care about its citizens. It views us as a worker bees to make the rich richer, simple as that.",
            "title_similarity": "0.44477665",
            "sentiment_compound": 0.763
        },
        {
            "id": "h14vhwx",
            "score": 1,
            "text": "Drop the wage tax and go to a consumption tax.  The rich can't dodge that.\n\nBut, nah, tax returns is vote buying power that congress can't give up.",
            "title_similarity": "0.7277428",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h14vikr",
            "score": 1,
            "text": "It helps that their YouTube channel is fire as well",
            "title_similarity": "0.3331408",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h14vm42",
            "score": 1,
            "text": "I don’t like the thought of the wealthy hoarding their money, but when the alternative being touted is “give more money to the federal government, so THEY can help people”, I can’t help but wonder how that’s an improvement in any way, shape, or form.",
            "title_similarity": "0.6052999",
            "sentiment_compound": 0.9286
        },
        {
            "id": "h14vmo9",
            "score": 1,
            "text": "Hit them with a decent tax or eliminate loopholes and the gov would have billions. But, they'd lose those \"contributions\" which we should all recognize as bribes.",
            "title_similarity": "0.69876724",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h14vna3",
            "score": 1,
            "text": "Uh oh Nazis, they SEE you! 😜",
            "title_similarity": "0.40972972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14vq9f",
            "score": 2,
            "text": "How about - Pay your share.",
            "title_similarity": "0.33589113",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h14vuz0",
            "score": 6,
            "text": "I had a \"Social / Poli Sci prof in college and he said something that was blatantly simple and true...he said to the class one day... \" when politicians start chanting and proclaiming We're going to Tax the Rich... Then us the middle class are going to take it square in the shorts without so much as a reach around.\"  I  feel like truer words have never been spoken.",
            "title_similarity": "0.61627114",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h14w7lo",
            "score": 1,
            "text": "All based on the lie that shares = money or earnings or worth. If Elon tried to sell his Tesla shares they would’ve worth $1. Don’t believe the lie that humans bezos are the richest in the world. That’s what the richest want you to think.",
            "title_similarity": "0.68466663",
            "sentiment_compound": 0.9231
        },
        {
            "id": "h14w98n",
            "score": 1,
            "text": "There is nothing explosive to report about how much billionaire pay, we all know its not even remotely close to enough.",
            "title_similarity": "0.41016912",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h14wfpw",
            "score": 2,
            "text": "I thought I was supposed to be eating the rich?",
            "title_similarity": "0.5930183",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h14wij7",
            "score": 1,
            "text": "Yes, tax the rich, they've been getting their behinds kissed for too long.",
            "title_similarity": "0.7061747",
            "sentiment_compound": 0.836
        },
        {
            "id": "h14wobu",
            "score": 2,
            "text": "Uhhhh what about the Panama Papers? Weren't those a pretty damning exposure of the wealthy dodging taxes by putting their money into off shore accounts?",
            "title_similarity": "0.77713513",
            "sentiment_compound": -0.5086
        },
        {
            "id": "h14x5f3",
            "score": 1,
            "text": "tmux, god I love your work Rich Evans",
            "title_similarity": "0.45103288",
            "sentiment_compound": 0.872
        },
        {
            "id": "h14x5tw",
            "score": 1,
            "text": "Do something about it or the people will.",
            "title_similarity": "0.22945133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14x6yb",
            "score": 1,
            "text": "Did anybody else notice how the huge amounts of debt the rich take (to finance their spending) will also be forgiven in case of a crisis situation? \n\nIf there is a crisis and banks try to bulk offload the shares they have as collateral, they will sell for very cheap. And the bailout the govt then gives the banks comes from more of the general people's tax money!\n\nBasically the rich have us paying for their failure too, if any! It's a foolproof plan! \n\nSo apart from wealth tax, there should also be laws preventing shares to be allowed as collateral. Since they will also give less when tries to cover bank losses if any.",
            "title_similarity": "0.7019949",
            "sentiment_compound": 0.6416
        },
        {
            "id": "h14xb70",
            "score": 1,
            "text": "I think people are getting tired of the Jeff’s’ and the Warrens’ paying less tax than their own secretaries!  I say bring back the the 93% tax rate to those over $100million like before 1986 Reagan tax bill!",
            "title_similarity": "0.5647214",
            "sentiment_compound": -0.2462
        },
        {
            "id": "h14xd23",
            "score": 1,
            "text": "can we still eat them??",
            "title_similarity": "0.1151295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14xee8",
            "score": 1,
            "text": "Except the report wasn't explosive, it was what we all knew was occurring for decades.",
            "title_similarity": "0.32731825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14xezg",
            "score": 2,
            "text": "How about closing the loopholes",
            "title_similarity": "0.096770555",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14xlva",
            "score": 1,
            "text": "Manchin was either kompromised (possible, a lot of Republican Senators are under the thumb of Putin) or bought by the Koch's and their corporate pals.\n\nI don't think much can get done in Washington given we have bribed criminals and scared Russian puppets holding a slim majority in the anti-Democratic Senate backed by a Republican packed anti-Democratic Supreme Court.\n\nOf course the Democrats could be smart and start indicting criminals and investigating what really motivates them to hate America so hard... Maybe start with Jan 6th, then expand into that whole \"rusher\" thing...",
            "title_similarity": "0.6399096",
            "sentiment_compound": -0.7902
        },
        {
            "id": "h14xoby",
            "score": 1,
            "text": "My tax plan is to tax these assholes into fucking oblivion.",
            "title_similarity": "0.52014136",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h14xqsh",
            "score": 2,
            "text": "You cant tax unrealized ups and downs of stock prices.  That'd be like owning an old car which becomes a classic and you pay on that increased cost even though you didn't sell it.  It's just worth more, like any collectible, but really gives you no dollar value until you decide to sell it.  -That- is when it's taxed.\n\nGet rid of tax loopholes, shrink the tax code for clarity and simplicity, and make folks pay their taxes.  \n\nAlso, remove the pure gambling based speculation puts in the stock market; that is built for the wealthy and those companies with money to burn.  Stock markets should be about investing money into companies you want to do well, or think will do well, the latter being the smarter choice.  The market goes up when people buy.  The market should go down when people own and sell, and not with imaginary sells of stock they don't own.",
            "title_similarity": "0.68075716",
            "sentiment_compound": 0.928
        },
        {
            "id": "h14xrhz",
            "score": 1,
            "text": "Let's no forget back taxes. Oh, and the literal subsidies. Probably outta fit in tiered fines too. Not to mention some form of carbon taxing on the ultra-rich lifestyle.",
            "title_similarity": "0.69551814",
            "sentiment_compound": 0.4881
        },
        {
            "id": "h14xtfy",
            "score": 1,
            "text": "We have always known they are cheating. Is this not the reasonable response? I pay my share, why are they exempt ? (Legitimate reply’s only please)",
            "title_similarity": "0.5261419",
            "sentiment_compound": -0.1179
        },
        {
            "id": "h14xu7z",
            "score": 1,
            "text": "Even Chris Wallace on fox gave him shit.",
            "title_similarity": "0.27439785",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h14xyfc",
            "score": 1,
            "text": "Sad, only 4% of Americans are millionaires and aside from that number 51% of congress are millionaires and that doesn't include DJT cause he's not in office anymore(sad day when he left).",
            "title_similarity": "0.44339603",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h14xzpk",
            "score": 1,
            "text": "Outrage over the rich dodging taxes grows, Dems put forward legislation…..GOP kills it and nothing changes again.",
            "title_similarity": "0.7440802",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h14y5hf",
            "score": 1,
            "text": "People should refuse to pay taxes en masse. That's the rightful protest in this situation! \n\nNo taxes until the politicians do their part. It will snowball into too many adverse effects for them to ignore it.\nOtherwise this effort of people like Warren will fizzle out too!",
            "title_similarity": "0.4051946",
            "sentiment_compound": -0.8353
        },
        {
            "id": "h14ycr3",
            "score": 1,
            "text": "Am I supposed to be shocked by this? This isn’t new news. It’s old. In fact it’s old as fuck. \nNothing will change though. They control the narrative.",
            "title_similarity": "0.3441192",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h14yd79",
            "score": 2,
            "text": "There is something very wrong when a dozen white men can change policy, leave the planet, buy governments, and sway markets. \n\nThis is a kleptocracy.",
            "title_similarity": "0.6393932",
            "sentiment_compound": -0.5563
        },
        {
            "id": "h14yiau",
            "score": 1,
            "text": "Just buy GME, same result but we don't have to rely on politicians.",
            "title_similarity": "0.32761133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14yp0p",
            "score": 2,
            "text": "Is this new news at all? Since middle school i thought we were all aware of this",
            "title_similarity": "0.34830132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14ytox",
            "score": 2,
            "text": "They’ll just pay off the Democrats.",
            "title_similarity": "0.36360514",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h14yzqd",
            "score": 2,
            "text": "You have to FIX the dodging. Taxing more is usless if you can dodge it anyway ffs.",
            "title_similarity": "0.37322804",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h14z8et",
            "score": 1,
            "text": "Let me know when this happens. Look for the blue guy in the corner.",
            "title_similarity": "0.05582324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h14zera",
            "score": 1,
            "text": "All those *biosurvival tickets*!!\n\n>\tBio-survival anxiety will only permanently disappear when world-wide wealth has reached a level, and a distribution, where, without totalitarianism, everyone has enough tickets.\n\n—Robert Anton Wilson, Prometheus Rising\n\n💸💰🤑💴💷💶💵💰🤑💸💎",
            "title_similarity": "0.5563241",
            "sentiment_compound": 0.679
        },
        {
            "id": "h14zg4p",
            "score": 2,
            "text": "Make em pay back taxes too like the rest of us would have to!",
            "title_similarity": "0.60953325",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h14zs09",
            "score": 1,
            "text": "Nothing will happen",
            "title_similarity": "-0.09446126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1503fy",
            "score": 1,
            "text": "Yes",
            "title_similarity": "0.05711866",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h150c43",
            "score": 1,
            "text": "Even Chris Wallace on fox gave him shit.",
            "title_similarity": "0.27439785",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h150k0x",
            "score": 1,
            "text": "Well if Elizabeth Warren pulls off a wealth tax as the reports points to as being necessary, that'd drastically change the nature of individual taxes. Constitutionally possible, but could run into issues in the courts.",
            "title_similarity": "0.5976036",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h15159k",
            "score": 1,
            "text": "I agree that everyone should pay their fair share. I would assume they skirt federal income tax by using their businesses for personal expenses. We need to not only look at personal federal income tax but we should look at how companies file their taxes and what deductions they can write off. \n\nMy wife and I make over 6 figures combined and EVERY year during tax season we get screwed. I think it’s time for the hammer come down on everyone else above us. If I can afford my fair share, so can these rich fucks.",
            "title_similarity": "0.6421102",
            "sentiment_compound": 0.6592
        },
        {
            "id": "h1517vn",
            "score": 1,
            "text": "tax the rich pretty much sums up the socialist movement...",
            "title_similarity": "0.7581627",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h151hqe",
            "score": 2,
            "text": "“Tax the rich “ is a bad slogan.  It should be “ make the rich pay their taxes”",
            "title_similarity": "0.6576709",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h151ml2",
            "score": 2,
            "text": "How about no longer having tax incentives for charity.",
            "title_similarity": "0.3341388",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h151num",
            "score": 1,
            "text": "Headline: The super wealthy play by a different set of rules. \n\nIn other news: The sun rises in the east and sets in the west.",
            "title_similarity": "0.7172506",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h151xbg",
            "score": 1,
            "text": "David Mitchell on The Last Leg:\n\nIt's about: \"Where on this moral scale do they place themselves, what can they square with their greed and conscience\"... \"It's essentially a tax on conscience.\"\n\n\nhttps://www.youtube.com/watch?v=m2q-Csk-ktc&t=55s",
            "title_similarity": "0.43197614",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1523ol",
            "score": 1,
            "text": "Ya could do with some more funding for things like education and police training they should train for a year minimum imo and perhaps health care funding for lower cost to individuals or infrastructure projects but whatever.",
            "title_similarity": "0.28865892",
            "sentiment_compound": 0.3071
        },
        {
            "id": "h1523z3",
            "score": 1,
            "text": "It has seats had momentum except with the idiots in charge of making laws.",
            "title_similarity": "0.46364325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1525he",
            "score": 1,
            "text": "That ain't gonna happen. There's a different 3 word phrase regard the scumbags that I prefer",
            "title_similarity": "0.12672326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h152a11",
            "score": 1,
            "text": "Is this because of that report on the IRS?",
            "title_similarity": "0.5561435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h152l80",
            "score": 1,
            "text": "Explosive report pfffft. Explosive like my diarrhea maybe",
            "title_similarity": "0.43792522",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h152ljt",
            "score": 1,
            "text": "Why are we shocked by this. We should be shocked why no one in our government has acted over the years.",
            "title_similarity": "0.33727866",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h152okf",
            "score": 1,
            "text": "Hasn't everyone figured out that neither party cares about the working class? It's all a show. At the end of the day it's all lawyers making money to get richer. The time of people willingly paying more in taxes is gone... they're rich for a reason and they know the law and tax code.",
            "title_similarity": "0.7030431",
            "sentiment_compound": 0.5043
        },
        {
            "id": "h152vri",
            "score": 1,
            "text": "Fucking GOOD!!!",
            "title_similarity": "0.18239525",
            "sentiment_compound": 0.7005
        },
        {
            "id": "h15352i",
            "score": 1,
            "text": "The only solution at this point is for the left to start aggressively campaigning *for* billionaires to pay no tax",
            "title_similarity": "0.47752985",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h153c69",
            "score": 2,
            "text": "And also, lets add a maximum wage. 1 million a month. Anything over that is taxed 100%. If you cannot live on 12 million a year, then you don't deserve to have ANY money. And don't tell me its not the point or leaves no incentive to become rich. That's BS! Who here would quit their job for a million a month? I guarantee you its everyone. People like Bezos and Zuckerberg can be replaced at the snap of a finger by people willing to make MUCH less than they are.",
            "title_similarity": "0.59031415",
            "sentiment_compound": 0.7416
        },
        {
            "id": "h153mtt",
            "score": 1,
            "text": "I’m all for taxing the rich but this is some fuckery. Stock go up and down, this is looking at paper gains not recognized gains. If you don’t understand the difference that is why this looks so bad for the rich. The government wants to tax  unrecognized gains, there is currently only one way to avoid tax, donations of stock or cash. The government wants the money to go to them and not charity.",
            "title_similarity": "0.6542878",
            "sentiment_compound": -0.2935
        },
        {
            "id": "h153ndv",
            "score": 2,
            "text": "The modern day versions of the first and second estate.",
            "title_similarity": "0.16239277",
            "sentiment_compound": 0.0
        },
        {
            "id": "h153q08",
            "score": 1,
            "text": "Eating them would be better",
            "title_similarity": "0.19162026",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1541vk",
            "score": 1,
            "text": "Consider the following questions: did the rich person create wealth or did they speculate skillfully the stock market? If you get money without producing wealth you can only get it by making someone else lose. Did they use more government services for their business for which it is not unreasonable to pay more of a share? Did they get overpaid for what they sold by using psychology to get customers to think \"You get what you pay for?\" Finally, is the extreme pay inequality really justified without limits? \n\nFor this reason we should not get hot under the collar if the rich pay more taxes.",
            "title_similarity": "0.7304411",
            "sentiment_compound": 0.908
        },
        {
            "id": "h154d6n",
            "score": 3,
            "text": "At what point do people realize that the top 5% control an enormous amount of wealth and rig the system in their favor???? Like, it’s not democrat or republican. What’s in your bank account dumbass???\n\nThe ultimate scam was getting poor, uneducated people to align w wealthy peoples objectives.",
            "title_similarity": "0.6645813",
            "sentiment_compound": 0.2555
        },
        {
            "id": "h154foi",
            "score": 2,
            "text": "Nothing happened after the Panama Papers. So…..",
            "title_similarity": "0.17323303",
            "sentiment_compound": 0.0
        },
        {
            "id": "h154mx5",
            "score": 1,
            "text": "Americans are too busy fighting over right vs left, when it’s always been the 1 vs 99",
            "title_similarity": "0.405159",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h154n84",
            "score": 1,
            "text": "Anyone who has read rich dad poor dad knows exactly what's going on.",
            "title_similarity": "0.6185385",
            "sentiment_compound": 0.128
        },
        {
            "id": "h154u1e",
            "score": 1,
            "text": "The senate can’t even pass an infrastructure bill, despite bipartisan interest. The media can write articles about tax reform “gaining momentum” all they want. Literally nothing is going to happen.\n\nThe stimulus bill was the Biden administration’s big piece of legislation.  Obama had the ACA.  Trump had the tax bill.  Do people really think a razor thin majority in the house and senate is going to pass a bunch of social welfare spending and tax increases?",
            "title_similarity": "0.5569937",
            "sentiment_compound": -0.2914
        },
        {
            "id": "h154yll",
            "score": 2,
            "text": "Read Rich Dad, Poor Dad.  It explains the issue of wealth inequality pretty well.",
            "title_similarity": "0.7363956",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h1553t8",
            "score": 1,
            "text": "Ooo nice catchy headline , nothing will happen or change",
            "title_similarity": "0.2419506",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h155btc",
            "score": 2,
            "text": "Nothing happened after the Panama papers, nothing going to happen with this.",
            "title_similarity": "0.12830105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h155pbi",
            "score": 3,
            "text": "In 2 weeks no one will even speak about this. Trump will shit on his desk or something and  we'll be on the next story. nothing will be made about this, nor ever will be.",
            "title_similarity": "0.22992574",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h155tya",
            "score": 1,
            "text": "We should tax the rich, stop subsidizing the rich AND also that “explosive report” was pretty much clickbait.",
            "title_similarity": "0.7283199",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h155ukt",
            "score": 2,
            "text": "Still waiting for that sweet taste of the trickle down!",
            "title_similarity": "0.15180734",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h155yp8",
            "score": 2,
            "text": "Tax the rich tends to gain a lot of support when you consider the alternative.",
            "title_similarity": "0.73228705",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h1562ci",
            "score": 1,
            "text": "Yeah I like Forbes news",
            "title_similarity": "0.46662828",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h15654h",
            "score": 2,
            "text": "The people stopped being the holders of power long ago. We live in an oligarchy disguised as democracy. Our elected officials only speak money.",
            "title_similarity": "0.43436992",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h156anr",
            "score": 1,
            "text": "Can someone explain why this is wrong? Tax evasion is clearly illegal, but tax laws also provide for minimising tax payment if certain conditions are fulfilled by the taxpayer.\n\nIf the rich use these provisions to reduce their tax payment, why is there an uproar over that? As long as they aren't doing anything illegal, it is their right to do with their money as they see fit.",
            "title_similarity": "0.5576457",
            "sentiment_compound": 0.9535
        },
        {
            "id": "h156dmb",
            "score": 1,
            "text": "$10 says they argue and talk about this, but nothing of stature actually takes place. We will still subsidize them and they will still have loopholes afterwards…",
            "title_similarity": "0.4301694",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h156xvc",
            "score": 1,
            "text": "Bout fucking time. The middle income groups across the world are sick to death of getting shat on whilst these fuckers get to pay 0 when they’re billionaires.....",
            "title_similarity": "0.60519016",
            "sentiment_compound": -0.91
        },
        {
            "id": "h1574sf",
            "score": 1,
            "text": "Make America Great Again by taxing the rich like we did 70-100 years ago.",
            "title_similarity": "0.7855914",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h1577ga",
            "score": 1,
            "text": "I am all about increasing taxes, changing the tax code and closing loopholes but all the debate in here seems to be missing the mark.  The billionaires are not doing anything illegal (at least in this article). They are just avoiding income. In fact a lot of people do it, just not at their scale.  They are borrowing against their stock/holdings and since it is a loan they don't have to report income.  If their wealth grows at 7% and they borrow at 2% they can now use this cash to live, not sell (at pay cap gains) and avoid income.  This is in fact the same thing anyone can do with a HELOC or cash out REFI on their house.  You borrow against your house at a lower rate (today) and theoretically your house appreciates more than the mortgage rate. That loan is not income and you don't have to pay taxes on it.  In fact you can get insurance policies that do the same thing, you borrow against it.  You can't tax them on their wealth, as it fluctuates and they haven't realized any of their gains.  If we are to fix the tax code, it needs to be somehow related to their spending or consumption of goods.  You can't ban loans, you can't scrutinize loans only for the rich.",
            "title_similarity": "0.5484184",
            "sentiment_compound": 0.9759
        },
        {
            "id": "h157crn",
            "score": 2,
            "text": "Too bad the Republican Party will get in the way of any significant tax reform that doesn’t benefit billionaires or corporations",
            "title_similarity": "0.6124959",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h157d1c",
            "score": 1,
            "text": "Won’t ever happen, it’s just another way to gather and distract.",
            "title_similarity": "0.07975351",
            "sentiment_compound": -0.296
        },
        {
            "id": "h157jne",
            "score": 1,
            "text": "Well as long as the mega rich can donate to law makers this will never change, and I assume will only get worse w how things currently look.",
            "title_similarity": "0.54537904",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h157o61",
            "score": 1,
            "text": "I’m just waiting for the ad campaigns coming out to show the rich as victims. Then we get a flurry of new politicians.",
            "title_similarity": "0.77481383",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h157v66",
            "score": 1,
            "text": "Appreciate the sentiment, but because Warren and sanders support higher races does not mean it's \"gaining momentum\"!! Call me when a single republican, or even big bis democrats do the same",
            "title_similarity": "0.50731266",
            "sentiment_compound": 0.4563
        },
        {
            "id": "h1586km",
            "score": 1,
            "text": "This is explosive?  Buffet has been saying this for years.",
            "title_similarity": "0.43373623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15892h",
            "score": 1,
            "text": "If it's a tax the rich bill you are trying to pass remember you are trying to pass it through the rich and their gatekeepers. I suggest creating a debt to equity bank. Where people have resources to add tax to unjustified tax.",
            "title_similarity": "0.79239017",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h158w98",
            "score": 1,
            "text": "They are always trying to tax Bezos, Musk, and the rest yet somehow the tax increases always fall on me.",
            "title_similarity": "0.6672864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h158ytg",
            "score": 1,
            "text": "Momentum that will be killed in the senate for the sake of \"cooling off\" and \"robust debate\" that leads to zero legislation being passed. Thanks, government.",
            "title_similarity": "0.41908222",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h15943y",
            "score": 1,
            "text": "We clearly tried the very little tax approach, and here's where we are. So for the next 30 years let's tax the rich a lot, and then see where we are then. Then we can look back at both times and decide which one would like best.",
            "title_similarity": "0.52642703",
            "sentiment_compound": 0.9186
        },
        {
            "id": "h15956i",
            "score": 1,
            "text": "Gains momentum by whom? Most adults are too busy to even care about what's going on in politics due to work/family life. \n\nHeck everyone should be dodging taxes. The government prints its own money. (Federal) Taxes are unnecessary except to enforce the use of the regional currency.",
            "title_similarity": "0.48788273",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1596gb",
            "score": 1,
            "text": "\"Grains momentum\" \n\nLMAO, what that mean? \n\nMeans nothing Joe Biden and The Democrats who can do something will NOT!",
            "title_similarity": "0.23526083",
            "sentiment_compound": 0.7118
        },
        {
            "id": "h159b2u",
            "score": 1,
            "text": "Don't understand why it so hard. Government should come up with a range on tax percent and we vote on it every 4 years and everyone pays that number",
            "title_similarity": "0.48497224",
            "sentiment_compound": -0.1447
        },
        {
            "id": "h15a2io",
            "score": 1,
            "text": "This is exactly what democrat politicians said the first time. Tax the super rich to pay everything. Don't worry, we are only going to tax the rich.  Before that there was no income tax or IRS. What a great scam. Take people's money then give some back and wow look the democrat party cares about us. Those that don't learn from history are doomed to repeat it. Wait till you see what happens the second time around",
            "title_similarity": "0.6674468",
            "sentiment_compound": 0.9486
        },
        {
            "id": "h15a9d5",
            "score": 1,
            "text": "How is this even being up for discussion? Like...what kind of evidence do we need for even the dullest individual to realise that the current tax system is extremely damaging for society?",
            "title_similarity": "0.5835961",
            "sentiment_compound": -0.7686
        },
        {
            "id": "h15af4j",
            "score": 1,
            "text": "you’re a boot licker if you come to the defense of a billionaire and you’re not a billionaire yourself. you don’t even have 10 mil",
            "title_similarity": "0.48739102",
            "sentiment_compound": 0.128
        },
        {
            "id": "h15agnm",
            "score": 1,
            "text": "dont tell neekolul",
            "title_similarity": "-0.02648016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15ahwg",
            "score": 1,
            "text": "I just don’t understand how 400 people can hold so much wealth (which they never use and do not even need) and not be compelled to give most of it back when the world is so fucked. Do they have no human decency? How can people be so cartoonishly greedy? The dragon metaphor really seems very apt here. Lizard people, cold-blooded lizard people. Even with my below-average salary, I still am proud to pay my fair share in taxes and I donate as much as I can beyond that. And honestly, as a single person, I live very comfortably.",
            "title_similarity": "0.55499035",
            "sentiment_compound": 0.6797
        },
        {
            "id": "h15apf8",
            "score": 1,
            "text": "One would think that the wealthy would be driven by gratitude to help others reach their own potential, especially in the US- the country that made their success possible & do so without strings attached.",
            "title_similarity": "0.53448415",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h15arnc",
            "score": 1,
            "text": "I recently watched a news broadcast from the 1950s.\n\nThey had EXACTLY the same problems and also thought it was a good idea to do something about it.\n\n70 years later and approximately as many years of realizing the same again and again.\n\n.. But NOW - THIS TIME - ITs different !!!   ... ?\n\nOf course it is... But please, allow me to be just a little sceptical... It is not like the quality of leadership has actually increased in a meaningful way for the average citizen.",
            "title_similarity": "0.43496054",
            "sentiment_compound": 0.7815
        },
        {
            "id": "h15aw2c",
            "score": 1,
            "text": "EXPLOSIVE REPORT!!  On something everyone already knew?  This is fake news, nothing will happen.  Move along morons democrats are rich too.",
            "title_similarity": "0.62037563",
            "sentiment_compound": -0.3365
        },
        {
            "id": "h15b3rn",
            "score": 1,
            "text": "Tax the rich will become kill the rich before too long. If the poor keep getting poorer people are going to get French Revolution level desperate.",
            "title_similarity": "0.61740065",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h15b5tz",
            "score": 1,
            "text": "I mean they are taxing the rich, but it won't do any good if we increase the tax rate. We just need to close the loopholes that they are using that's all. If we increase it, they'll just keep using the same loopholes to get tax cuts.",
            "title_similarity": "0.588197",
            "sentiment_compound": -0.0023
        },
        {
            "id": "h15bmk2",
            "score": 1,
            "text": "This attitude is why we even have an income tax in the first place. There are not enough rich people to tax to make a tangible difference on collections. This attitude always ends up hurting regular people.",
            "title_similarity": "0.5894662",
            "sentiment_compound": -0.6832
        },
        {
            "id": "h15bn46",
            "score": 1,
            "text": "Same old story nothing will change.",
            "title_similarity": "0.06640075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15c1q5",
            "score": 2,
            "text": "Oh please, that was a shitty report done by people who have no fucking idea what they are talking about when it comes to taxes. If you want to make an argument that they should pay a higher tax rate, that's one thing, but that article was grasping at anything and pulling some bullshit out of their ass to please people who also don't know about taxes.",
            "title_similarity": "0.5332412",
            "sentiment_compound": -0.9011
        },
        {
            "id": "h15c9t6",
            "score": 1,
            "text": "Tax the rich is just a slogan politicians use. The rich don’t pay taxes like we do and politicians know that because that’s how the tax laws are written as many politics s are rich themselves",
            "title_similarity": "0.74460804",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h15crkj",
            "score": 1,
            "text": "They should pay at least their share, but I think more would be ok too. If you have the ability to make the world an actual better place, why the hell wouldn't you?",
            "title_similarity": "0.43851748",
            "sentiment_compound": 0.458
        },
        {
            "id": "h15cz0u",
            "score": 1,
            "text": "I work my ass off as an RN during a pandemic yet I still have to sit content with the government taking 600 of my paycheck to fund my hospital that looks like shit and the construction around it that has been going on for years now but never actually seems to progress.",
            "title_similarity": "0.35825828",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h15d59h",
            "score": 5,
            "text": "ITT, people don’t understand the different of income and net worth.",
            "title_similarity": "0.31819364",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h15dkdq",
            "score": 1,
            "text": "Billionaires aren't usually rich because of their salaries, which is what the system taxes. They usually have assets, like stock in companies that they started. Their salaries are usually modest.",
            "title_similarity": "0.5844479",
            "sentiment_compound": 0.0711
        },
        {
            "id": "h15dzcr",
            "score": 1,
            "text": "Remember when we found stuff like this in Panama papers? And nothing came of it?",
            "title_similarity": "0.27322417",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h15en34",
            "score": 2,
            "text": "“True Tax” is the most asinine thing. Musk and Bezos paid 30% and 23% in actual tax per the article.",
            "title_similarity": "0.559778",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15ey8i",
            "score": 1,
            "text": "I want my free money too!",
            "title_similarity": "0.35451055",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h15fhi2",
            "score": 1,
            "text": "Taxing the rich isn't such a bad thing, but it always (repeat always) ends with taxing everyone that is above minimum wage. Either by formal taxation or inflation.",
            "title_similarity": "0.67885196",
            "sentiment_compound": 0.4981
        },
        {
            "id": "h15fzs8",
            "score": 1,
            "text": "\"Gains momentum?\" \n\njust do it already! Give us a break, 'we're gonna do this! we're gonna do that\" they sound like hopeful screenwriters on cocaine at this point...",
            "title_similarity": "0.46256417",
            "sentiment_compound": 0.8309
        },
        {
            "id": "h15g0yo",
            "score": 1,
            "text": "It’s never NOT had momentum. It’s the same old song and dance. This shits getting real old",
            "title_similarity": "0.26490775",
            "sentiment_compound": -0.561
        },
        {
            "id": "h15g3o6",
            "score": 1,
            "text": "The documents were so boring and unspectacular, that they felt the need to make up a tax? The true tax? It's hilarious that the leaker will probably go to prison for this",
            "title_similarity": "0.48676038",
            "sentiment_compound": -0.2849
        },
        {
            "id": "h15g685",
            "score": 1,
            "text": "Anti tax politicians use the dream of being rich as a means to stop people from voting for taxing the rich...while they themselves are funded by the rich to make policy to benefit the rich. You wanna lower taxes for everyone? STOP ALL WAR! Stop spending 80% of every tax dollar on fighter jets that don’t fly, newer, faster missiles, “Space force?” And subsidizing profits for defense contractors and we will have enough money for everything we need. Why not lead the world in peace and clean energy? Unlock patented technologies that oil corps have bought up and are siting on? And for gods sake revise the tax code so that corps and billionaires are forced to reinvest into their companies and workers rather than 450 foot luxury yachts and flights into space. Let’s be real:NOBODY ON THIS PLANET NEEDS $170,000,000,000 dollars to themselves while people starve or die in poverty from injury or disease. And contrary to all political bullshit...taxing the rich does not effect anyone making less than $500,000/year. SO STOP VOTING FOR ASSHOLES THAT PUSH LOWER TAX POLICY!!!!",
            "title_similarity": "0.7173594",
            "sentiment_compound": -0.9429
        },
        {
            "id": "h15gciw",
            "score": 1,
            "text": "This article provides zero concrete evidence for any \"momentum\" being gained.\n\nIt quotes a bunch of democratic lawmakers supporting it when the entire party has supported it for years.",
            "title_similarity": "0.3076223",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h15ghqv",
            "score": 1,
            "text": "Taxing the rich is pointless if you think it will have any effect on your tax bracket, amount or really any positive gain / or influence in your life.  This is like raising the price of a good you cant afford in hopes it lowers the price of similar good from the same company. No one is going to tighten their margins/profits- especially the US Government.",
            "title_similarity": "0.5471948",
            "sentiment_compound": 0.9372
        },
        {
            "id": "h15gpap",
            "score": 1,
            "text": "When did it become to cool to pay taxes?",
            "title_similarity": "0.5624123",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h15gqoe",
            "score": 1,
            "text": "I wonder how much federal tax Elizabeth Warren has paid? Or for that matter how much the other top politicians are paid both Republican and Democrat?",
            "title_similarity": "0.62441325",
            "sentiment_compound": 0.3094
        },
        {
            "id": "h15h2cy",
            "score": 2,
            "text": "Just start with stop subsidizing for the rich and make it close to impossible for them to dodge taxes.",
            "title_similarity": "0.57830966",
            "sentiment_compound": 0.34
        },
        {
            "id": "h15ipef",
            "score": 2,
            "text": "There is a difference between \"wealth\" and \"income\" . we tax income , we don't tax wealth. Wealth is conglomeration of assets values as they sit, not as they have been realized.",
            "title_similarity": "0.5153223",
            "sentiment_compound": 0.3278
        },
        {
            "id": "h15j06m",
            "score": 1,
            "text": "Remember the panama papers?",
            "title_similarity": "0.31136993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15j4nn",
            "score": 1,
            "text": "New order seems like a crazy movie coming out.",
            "title_similarity": "0.38284177",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h15k8t0",
            "score": 2,
            "text": "It's not tax dodging for someone to not pay tax on unrealized gains.",
            "title_similarity": "0.35706764",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h15kymd",
            "score": 1,
            "text": "How has this barely gained momentum? It's been talked about since Biden's campaign! all politicians are FULL OF BS. BIDEN INCLUDED. Let's forgive student debt and tax the rich! Look at us now. American government is a joke, we need a revolution",
            "title_similarity": "0.71018785",
            "sentiment_compound": 0.8069
        },
        {
            "id": "h15ltd0",
            "score": 3,
            "text": "Woh whoa whoa, you mean billionaires have found a way to dodge taxes?!?! But i thought capitalism was king and socialism was just pure EVIL!! Maybe discuise it as 'global economic insurance', thats one way of forcing people to pay into a pot that helps others.",
            "title_similarity": "0.69442797",
            "sentiment_compound": -0.8371
        },
        {
            "id": "h15lyfk",
            "score": 2,
            "text": "The issue isn't taking the rich, it's making *avoiding* taxes harder or illegal. Tax evasion is illegal, tax avoidance is not. We can't blame companies, who's main objective is to make a profit, to jot explore all potential avenues for avoiding paying out more money in taxes. I'm not defending them, but the way our tax system is structured favors those who have the money to pay accountants the big bucks, in turn lessening tax liabilities close to, if not $0. \n\nIf what these companies did was illegal, and it was public knowledge, they'd be investigated and prosecuted. But all this speculation just underlines the problem which is a system that incentivizes tax avoidance to those that can afford it.",
            "title_similarity": "0.6527972",
            "sentiment_compound": -0.9749
        },
        {
            "id": "h15m43z",
            "score": 1,
            "text": "How do you accomplish this then? Their individual mega wealth is in value of the stock they hold as private persons in the companies they own. Taxing that would essentially force them to liquidate shares / assets every year? If I was a minor shareholder in company X, I'd be kind of pissed if the government forced them to use my investment to pay taxes. That would devalue the stock.",
            "title_similarity": "0.69037163",
            "sentiment_compound": 0.4151
        },
        {
            "id": "h15o70n",
            "score": 1,
            "text": "When you have that amount of money you are playing 4d chess. Another few million means absolutely nothing to you monetarily. What it does mean is that your share of the power grows while at the same time shrinking the power of those you need to maintain your power in the first place. It's not about money people it's about power.",
            "title_similarity": "0.49874216",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h15otya",
            "score": 1,
            "text": "Nothing is going to change.",
            "title_similarity": "0.017607598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15p7ee",
            "score": 1,
            "text": "Did people really not realize this?  And if so, are those same people those who could be convinced of this in a matter of 24 hours due to 1 published article?",
            "title_similarity": "0.32687208",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h15pl28",
            "score": 1,
            "text": "Tax the FUCK out of the rich!! everybody pays something. The poor need their money. The rich use it to abuse the poor",
            "title_similarity": "0.69190985",
            "sentiment_compound": -0.8409
        },
        {
            "id": "h15pzqx",
            "score": 1,
            "text": "Guys, please read this\n\n [The Secret IRS Files: Trove of Never-Before-Seen Records Reveal How the Wealthiest Avoid Income Tax](https://www.propublica.org/article/the-secret-irs-files-trove-of-never-before-seen-records-reveal-how-the-wealthiest-avoid-income-tax)\n\nCall your representatives. Call your state legislators. Make a storm about this, whether you are in a red state, blue state, green state, whatever. This has got to change because we are all suffering as a result of this amassing of wealth. \n\nBe politically active. Join an interest group. Donate time, it’s worth as much or more than money in a lot of cases. And support the journalism that investigates this ridiculousness. Imagine the poor bastards who read through these documents so we didn’t have to.",
            "title_similarity": "0.65112275",
            "sentiment_compound": 0.6625
        },
        {
            "id": "h15q0we",
            "score": 1,
            "text": "It's unhelpful to always talk about billionaires. They make their money from corporations who have one goal - to make money. If these corporations didn't take every opportunity to pay less tax or lobby government to favour them, they'd be doing their shareholders a disservice. (As wrong as that is from a moral standpoint)\n\nThe real issue, is governments across the world have no real interest in taxing them properly as they fund the political gravy train and give cushy jobs to the political elite and their families. \n\nThis issue is as simple as closing every tax loophole that makes tax avoidance possible. Unfortunately, this wouldn't be in the interests of the political elite that run the world.",
            "title_similarity": "0.64801073",
            "sentiment_compound": -0.8713
        },
        {
            "id": "h15qt8l",
            "score": 1,
            "text": "So when you win that lottery your going to pay!",
            "title_similarity": "0.5473939",
            "sentiment_compound": 0.6067
        },
        {
            "id": "h15qvkg",
            "score": 1,
            "text": "Wont anyone think of the poor billionaires? They just want all the money and you won't let them have it because you want food and shelter and water. Shame on you",
            "title_similarity": "0.4260679",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h15qxei",
            "score": 2,
            "text": "This is why the IRS tries so hard to keep such information hidden from public view.  The uber wealthy pay their \"taxes\" in the form of massive campaign contributions to politicians that are willing to protect and enhance their protections inside a ponderous and unintelligible tax code.  This is why the \"flat tax\" never went anywhere.  It would have cost the livelihoods of millions of tax attorneys and tax accountants who exist solely to protect these fortunes.",
            "title_similarity": "0.64877737",
            "sentiment_compound": 0.7467
        },
        {
            "id": "h15r9bk",
            "score": 1,
            "text": "How dare you speak ill of our hallowed job creators, praise be the money that flows freely from the top to the bottom like a river.",
            "title_similarity": "0.6257278",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h15sjtj",
            "score": 1,
            "text": "Just stop taxing me too",
            "title_similarity": "0.0769867",
            "sentiment_compound": -0.296
        },
        {
            "id": "h15skry",
            "score": 1,
            "text": "The timing couldn't be more perfect.",
            "title_similarity": "0.21261239",
            "sentiment_compound": -0.4964
        },
        {
            "id": "h15ucxt",
            "score": 1,
            "text": "Tax the rich. \nIt’s the only one thing they are any good for.",
            "title_similarity": "0.5813309",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h15wmq1",
            "score": 1,
            "text": "2 words: Robin Hood",
            "title_similarity": "0.08865703",
            "sentiment_compound": 0.0
        },
        {
            "id": "h15xr8o",
            "score": 1,
            "text": "Any policy that \"taxes\" the rich is nothing but lip service.  Thats all it is.  Billionaires can afford teams of tax lawyers to legally dodge all taxes.  There will ALWAYS be loop holes when you have teams of accountants and tax lawyers and financial advisors working for you 24/7.  \n\nHere's a thought.  Abolish the IRS",
            "title_similarity": "0.67034256",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h15z25d",
            "score": 1,
            "text": "If we don’t rewrite the laws and cut out the loopholes we can increase the income tax to 70% and it won’t mean shit. Fix the loopholes and the rates. Rates alone won’t do shit.",
            "title_similarity": "0.542109",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h1600u5",
            "score": 1,
            "text": "The 'exolosive' report that reported what was widely known?",
            "title_similarity": "0.4388839",
            "sentiment_compound": 0.0
        },
        {
            "id": "h160sd8",
            "score": 1,
            "text": "The problem is not about tax rate, it's about tax effectiveness",
            "title_similarity": "0.43086445",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h163oix",
            "score": 1,
            "text": "Billionaires of the world: No amount of donations to charity will ever make up for short-shrifting your workers so much that they NEED charity.\n\nStop giving to your feel-good, cherry-picked causes. Start giving to EVERYBODY.",
            "title_similarity": "0.57391214",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h164zyu",
            "score": 1,
            "text": "What's amazing is that idiot republican voters continue to vote for the GOP time and again after seeing example after example of how the rich screw them, laugh at them, rob them, lie to them.",
            "title_similarity": "0.7151435",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h165jnd",
            "score": 1,
            "text": "The tax the rich crowd is the biggest group of morons in the country because they will never hold the government responsible for what they do with the tax dollars anyways. They feed the gov's addiction to our money. Cheering on the idea of giving the gov more money is stupid.\n\nCovid should have been a wake up call.  The worst man made disaster of our life and the best the gov could do was take on massive amounts of debt and send money overseas. The gov squandered enough money in the last year and a half... enough money that they could have sent every \"American in need\" a 15k check and said \"stay home 5 months\". The gov has fancy  databases that catch you if you forget to claim $2 in gains on your credit union savings account...yet they can't figure out who is poor and needs money. I was deemed \"necessary\" and didn't lose a day of work...and the gov still sent me a check. They are worthless. \n\nWhy the hell do you want to increase taxes and give the government more money? It won't go to Americans, our public roads,  etc.\n\nBezos doesn't need to pay an extra 100 billion in taxes so israel can have a strong border and bombs, Africa can have more farmland, and India can have gender study programs. \n\nThe covid response is proof that the gov is the problem and lacks the ability to solve anything. Everyone wants to blame Democrats or Republicans when the gov is the problem.",
            "title_similarity": "0.68020093",
            "sentiment_compound": -0.6818
        },
        {
            "id": "h1662ap",
            "score": 1,
            "text": "I honestly cannot understand why taxing the rich became controversial.\n\nIt's been proven that supply side economics is bullshit, and it's bullshit that everyone reading this has paid more in taxes in the last two years than Jeff Bezos.",
            "title_similarity": "0.6581833",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h166sfq",
            "score": 2,
            "text": "Can anyone explain what techniques they are using to dodge taxes? The pro republica article just says it’s because they aren’t taxed on stocks and properties until they sell, which is fine. What else?\n\n“America’s billionaires avail themselves of tax-avoidance strategies beyond the reach of ordinary people. Their wealth derives from the skyrocketing value of their assets, like stock and property. Those gains are not defined by U.S. laws as taxable income unless and until the billionaires sell.”\n\nThat’s because it’s not income. Would you want to pay tax on the appreciation of your home? It’s just a theoretical number until you sell. Then you get taxed on how much money you actually make from it. That makes sense!\n\nIs this really the bombshell?? Do these guys want to tax people based on how much a magazine estimates there assets are worth?",
            "title_similarity": "0.7167201",
            "sentiment_compound": 0.9626
        },
        {
            "id": "h16771c",
            "score": 2,
            "text": "How about we find every politician who’s ever voted to allow these loop holes and make it known who they were/are and hold them accountable.",
            "title_similarity": "0.43499282",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h168h5t",
            "score": 1,
            "text": "The tweet that was highlighted about the rich not paying taxes so we can't have health care is not correct.\n\nWe can't have health care because the system was captured by health insurance corporations who put profits above all.",
            "title_similarity": "0.62105936",
            "sentiment_compound": 0.3058
        },
        {
            "id": "h168of0",
            "score": 1,
            "text": "Please VOTE!!",
            "title_similarity": "0.20417695",
            "sentiment_compound": 0.4374
        },
        {
            "id": "h169uxm",
            "score": 1,
            "text": "So your telling the average person doesn’t know that billionaires pay accountants and lawyers millions to get out of the taxes that are owed",
            "title_similarity": "0.7381343",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h16aqky",
            "score": 1,
            "text": "A wealth tax would be too easy to avoid using creative accounting and tax lawyers.  Just treat all realized capital gains like ordinary income, update the tax brackets accordingly, and you'll achieve the intended outcome using mechanisms that are already within the framework and purview of the IRS.",
            "title_similarity": "0.6174758",
            "sentiment_compound": 0.9246
        },
        {
            "id": "h16byqd",
            "score": 1,
            "text": "Taxes should be like the Earth, flat and inescapable",
            "title_similarity": "0.26663256",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h16ccrl",
            "score": 1,
            "text": "How much of it is \"tax dodging\"?\n\nPeople complain all the time of Bezos having hundreds of billions, but that's because he owns a ton of Amazon, Blue Origin, Washington Post, etc. \n\nHe doesn't have 100 billion in the bank, it's all in assets.",
            "title_similarity": "0.6306367",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h16davq",
            "score": 1,
            "text": "How about we go after the deductions they have.  If all we did was limit deductions from income to $400K.  After that start charging them according to a sliding scale up to 75%.    \n\n\nAnd also go after their accumulated ill-gotten gains (err wealth).  And tax tax that as income.",
            "title_similarity": "0.5571182",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h16dddc",
            "score": 1,
            "text": "Gains momentum lmao.",
            "title_similarity": "0.29790342",
            "sentiment_compound": 0.743
        },
        {
            "id": "h16drsc",
            "score": 2,
            "text": "“In 2011, Bezos reported so little income that he qualified for — and claimed — a $4,000 child tax credit.” YNT…\nWhats in your wallet?",
            "title_similarity": "0.38528156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h16gzsj",
            "score": 1,
            "text": "So it's wrong that those people don't pay income taxes, but....they don't pay income taxes? I'm not sure exactly how that logic works.\n\nYes, many people don't pay because of deductions and credits. What exactly does Bezos do? If it is some illegal shenanigans, there is an entire department of government to enforce the fact. If it is simply him using the deductions and credits that are legally available, that's what everyone does. Do you know a single person who willingly avoids deductions and credits that they are eligible for? Those people might exist, but I'd be hard-pressed to believe it is any significant amount.",
            "title_similarity": "0.50579053",
            "sentiment_compound": 0.4877
        },
        {
            "id": "h16nser",
            "score": 2,
            "text": "And remember all you small business republicans; you are not part of the tax the rich plan. So, stop supporting this debacle. You and the rest of the country will suffer for decades if taxes are not applied fairly. Don’t worry too much unless you make in the billions with a b.",
            "title_similarity": "0.5908612",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h16t0ty",
            "score": 2,
            "text": "Everyone is so caught up on the tax side of it and not the income side. Tax everyone the same percentage and incentivize corporations to share a higher percentage of their profits with their employees instead of paying them all out to executives. If everyone else has higher income then the tax base will increase automatically.",
            "title_similarity": "0.69557536",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h16td31",
            "score": 1,
            "text": "Has anybody ever asked Warren, or Sanders, what tax (if any) rate they pay on their millions?",
            "title_similarity": "0.55798334",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h16yebr",
            "score": 1,
            "text": "I don't dispute that the ultra rich should and could pay more income tax. Somehow the story I saw in the press confused wealth with income tax. The US tax system is based on income not wealth. If and when something is sold a gain or loss is realized and recognized resulting in income tax (assumimng there is a gain). Certainly death taxes/estate taxes do tax wealth. Some of our elected officials grab any headline that supports their views without fully understanding or considering the details.",
            "title_similarity": "0.7456986",
            "sentiment_compound": 0.9087
        },
        {
            "id": "h1710eq",
            "score": 1,
            "text": "Maybe we should also consider what happens when a corporation pays out a multi-million dollar bonus to executives.  Only the first $142,800 is even taxed.  That's millions in untaxed wages that executives receive.  Cool huh?\n\nNow what if they took that company profit and divvied it up among the employees so 200 people get a $10,000 bonus.  That'd be nice, and it would all get taxed too.",
            "title_similarity": "0.68071246",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h171uqc",
            "score": 1,
            "text": "I would love to see normal taxes levied on the wealthy but they would have to revamp the tax code so the wealthy wouldn’t find tax loopholes",
            "title_similarity": "0.53550476",
            "sentiment_compound": 0.7916
        },
        {
            "id": "h176j8m",
            "score": 1,
            "text": "https://files.taxfoundation.org/20210202175334/Half-of-taxpayers-pay-97-percent-of-federal-income-taxes-progressive-federal-income-tax-data-2021.png\n\nEnough said.",
            "title_similarity": "0.55779064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h17759k",
            "score": 1,
            "text": "With Biden spending 12 Trillion, tax the rich at 80%",
            "title_similarity": "0.6519625",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h177rgq",
            "score": 1,
            "text": "Politicians are too stupid.  The rich will never pay taxes.  The increased costs (taxes) will be rolled into the prices of the products or services.  Politicians will remain stupid, forever.",
            "title_similarity": "0.53918695",
            "sentiment_compound": -0.2033
        },
        {
            "id": "h17e5i9",
            "score": 1,
            "text": "Did people really not know the super rich don't pay taxes? Is this really news?",
            "title_similarity": "0.6720033",
            "sentiment_compound": 0.2755
        },
        {
            "id": "h17ib21",
            "score": 1,
            "text": "And meanwhile they create and maintain millions of jobs collectively.  Some have created their own spaceflight agencies, employing thousands.  Some have vowed to give it all to charities; Bill and Melinda Gates are/were, and Buffett.  Many give so much to charity that they cannot take it all as a tax exemption.  Tax avoidance is not illegal, it is the American way!  And still, they pay the highest percentage of tax, collectively.  Overall, the top 50 percent of earners paid 97 percent of all income tax collected.",
            "title_similarity": "0.6068517",
            "sentiment_compound": 0.8828
        },
        {
            "id": "h17moab",
            "score": 1,
            "text": "Yes they should pay their share. But, this never stops at the \"rich\" and ends up raising the taxes for everyone in the end.",
            "title_similarity": "0.73144406",
            "sentiment_compound": 0.8323
        },
        {
            "id": "h17o6py",
            "score": 1,
            "text": "What about the poverty and violence inflicted on a vast swath of the population every single day? That you can ignore huh",
            "title_similarity": "0.39739433",
            "sentiment_compound": -0.872
        },
        {
            "id": "h17opgm",
            "score": 1,
            "text": "Except this means nothing to senators....not a surprise really 😔",
            "title_similarity": "0.19997038",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h17p3kv",
            "score": 1,
            "text": "LOL! The pig dog Democrats always complain about the rich avoiding paying taxes yet don't have a problem licking their boots to get campaign contributions from them.",
            "title_similarity": "0.4207213",
            "sentiment_compound": 0.6987
        },
        {
            "id": "h17pob5",
            "score": 1,
            "text": "I have a friend, a dear friend, who is also a business owner, high end residential construction and renovation. He is building a \"house\" now for well over 5 million dollars. We had a difference of opinion about the unemployment that some are saying prevents people from looking for work. He said he can't \"afford\" to pay a minimum wage of 15 dollars. That would not allow him to break even. And he was talking about 1 minimum wage employee. I lost a lot of respect for my friend after that. He cried about the cost of materials, and somehow, that too, was blamed on paying one employee 15 dollars an hour as a laborer/cleanup person.\n\nThat's the kind of thinking that business people have. \"The less I pay, the more I make\", and to them, that's fair. But see, that's the reason for a lot of unemployed people not wanting to accept someone devaluing their worth based on improving their personal standard of living by diminishing the quality of life of another. Feeling \"entitled\" to do so because they are \"in business\". Honestly, my \"dear friend\" is not so \"dear\" anymore. He is, of course entitled to his opinion, but so am I.",
            "title_similarity": "0.47830665",
            "sentiment_compound": 0.9584
        },
        {
            "id": "h17prhg",
            "score": 1,
            "text": "Would that be the same momentum as \n\nGun reform , \nPolice reform , \nEqual pay reform , \nVoting right reform , \nWage increase reform \n\nThat all have sweeping bipartisanship from the people but die in the Senate  where all bills go to die . \n\nIs this The BANANA REPUBLIC of America ?",
            "title_similarity": "0.542708",
            "sentiment_compound": -0.9178
        },
        {
            "id": "h17sfp2",
            "score": 1,
            "text": "Yeah but what about millionaires? That's rich.",
            "title_similarity": "0.76597685",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h17wba8",
            "score": 2,
            "text": "There’s probably a lot of ultra-wealthy people who give a lot of money to charity. Even if that’s a tax break for them, that’s still a good thing that they’re helping others.",
            "title_similarity": "0.68884313",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h17wh7l",
            "score": 1,
            "text": "The IRS weapon surfaces again….odd how these tax returns (supposedly private) managed to be leaked while proposing tax increases…..",
            "title_similarity": "0.7766495",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h17xbax",
            "score": 1,
            "text": "I want to know how we  the people change laws so tired of this try to get ahead and it never ends",
            "title_similarity": "0.4544613",
            "sentiment_compound": -0.5332
        },
        {
            "id": "h182kzp",
            "score": 1,
            "text": "Let’s first close the loop homes that allow the skirting of payment of their “fair share”. Just raising taxes won’t work if the loopholes are still in place.",
            "title_similarity": "0.45626056",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1881ks",
            "score": 1,
            "text": "“gains momentum” lmao okay.",
            "title_similarity": "0.32441247",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h18jv8a",
            "score": 2,
            "text": "Why do so many people assume that ProPublica is a completely scientific, non-biased source of objective facts?  It's not anymore objective than Fox News.",
            "title_similarity": "0.418581",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1943bb",
            "score": 1,
            "text": "Tax the church while we're at it. Balance the budget overnight.",
            "title_similarity": "0.5855272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h19van2",
            "score": 2,
            "text": "So everyone commenting on this article in favor of taxing wealth should get taxed every year on their car, their education, their house, their savings, their iPhone, their computer, their 401K, etc. These are assets and therefore wealth. \nMaybe whats fair is everyone pay 17% of what they earned and 4% of what their worth regardless of income or wealth. \nBtw, Propublica also is a mouth piece for the progressives as Fox is for the right. \n\nMa",
            "title_similarity": "0.63354886",
            "sentiment_compound": 0.9413
        },
        {
            "id": "h1dc1wg",
            "score": 2,
            "text": "Hit them hard in the pocketbook so they will leave this country and take their money with them.  They can move them selves and their company headquarters to the Caribbean or some other place that will take them in.  That will show them.  :)",
            "title_similarity": "0.526383",
            "sentiment_compound": 0.2815
        },
        {
            "id": "h1dk3de",
            "score": 2,
            "text": "Begin with the non profits because that is how the rich avoid taxes. Gates and his like been \"giving\" their money away for decades but still on top as richest people on the planet. I dont mind him being rich I mind how they avoid taxes in non profits pretending they just want to help others.",
            "title_similarity": "0.6362363",
            "sentiment_compound": 0.9734
        },
        {
            "id": "h1gkjh1",
            "score": 2,
            "text": "I really wish Warren was POTUS.",
            "title_similarity": "0.22402751",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h1hsl0d",
            "score": 1,
            "text": "😶‍🌫️ hmm",
            "title_similarity": "0.007992651",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1lhqej",
            "score": 1,
            "text": "They are not tax dodging.  They don't take an income\n   It's a income tax.",
            "title_similarity": "0.22796488",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h1p3v19",
            "score": 1,
            "text": "This woman is an idiot ..",
            "title_similarity": "0.1367262",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1wzkrd",
            "score": 1,
            "text": "And when the poor gets poorer because of this decision, who will we tax then?",
            "title_similarity": "0.50089025",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h27ljtq",
            "score": 1,
            "text": "yes, yes, good",
            "title_similarity": "0.09618795",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h27uf70",
            "score": 1,
            "text": "The article was misleading because they gave a percentage of total wealth and not income. The reality is that as a percentage of income they pay millions of dollars in taxes.",
            "title_similarity": "0.6580914",
            "sentiment_compound": 0.101
        },
        {
            "id": "h2vpff9",
            "score": 1,
            "text": "My thumb cramped after the first billion. Really puts things into perspective.",
            "title_similarity": "0.39789087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h34gch0",
            "score": 2,
            "text": "Real question. What does \"dodging taxes\" mean? If they broke the law, that's one thing, but if they're taking advantage of a currently available tax loophole, then you need to direct your rage at the tax code, not the billionaires. Tax code is around 70,000 pages long right now, it needs to be like 10. Flat tax and maybe some business exceptions and thats it",
            "title_similarity": "0.6623642",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h47euup",
            "score": 1,
            "text": "And yet everyday people tax dodge and cheat the system everyday gtfoh broke ass people mad because they are broke.",
            "title_similarity": "0.5651232",
            "sentiment_compound": -0.936
        },
        {
            "id": "h487u4g",
            "score": 1,
            "text": "Taxing the rich isn't going to help if you don't fix the loopholes allowing them to avoid those taxes.\n\nThe politicians arent going to do this because they are literally part of the problem.",
            "title_similarity": "0.4484002",
            "sentiment_compound": -0.3732
        },
        {
            "id": "h4c7hkc",
            "score": 1,
            "text": " 9",
            "title_similarity": "0.05969527",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4c7isx",
            "score": 1,
            "text": "Mmm",
            "title_similarity": "0.024004282",
            "sentiment_compound": 0.0
        },
        {
            "id": "h4ite2c",
            "score": 1,
            "text": "1. The top 1 percent of income earners in America (mostly large companies) already pay nearly all America's net taxes.\n2. When you heavily tax companies they move out of America to avoid ridiculous high taxation rates causing millions of job losses.\n3. The same geniuses who call for higher taxes of the top 1 percent will be first to be outraged by increased prices of products to compensate for the higher tax rates.",
            "title_similarity": "0.7558191",
            "sentiment_compound": -0.765
        }
    ]
}