{
    "Leaked Audio of Sen. Joe Manchin Call With Billionaire Donors Provides Rare Glimpse of Dealmaking on Filibuster and January 6 Commission\n": [
        {
            "id": "h1zlxdk",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.44342417",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h204r1l",
            "score": 3,
            "text": "Why is anyone surprised, this 2-party system is rigged and they (repukelians/dummycrats)  want to keep it that way.  It's the only way the **American Oligarchs** can remain in control and keep us all at each others throat with race, religion, etc.  Its a long con that they have been winning for the past 40 years.\n\nAll of these senators need to be primary, lets see them win.  Same old fucks in office that will never want to relinquish money/power.",
            "title_similarity": "0.52601266",
            "sentiment_compound": 0.5541
        },
        {
            "id": "h1zu46h",
            "score": 43,
            "text": ">The filibuster is a critical priority for the donors on the call, as it bottles up progressive legislation that would hit their bottom lines.\n\nevery single time I point out that the DNC establishment is beholden to corporate donors who do not want to see any progressive legislation passed i get massively downvoted and bombarded with idiots replying with \"DaE bOtH sIdEs??\"\n\nit should be patently obvious to anyone that yes, BOTH FUCKING SIDES ARE ONLY CONCERNED ABOUT HOLDING ONTO POWER AND BUILDING WEALTH.\n\nthe democratic establishment doesnt fucking care about poor people, they dont fucking care about BIPOC or systemic racism, they only care about power and keeping their base enraged enough to keep pouring money into fundraisers.",
            "title_similarity": "0.53478354",
            "sentiment_compound": -0.8361
        },
        {
            "id": "h1zore0",
            "score": 1,
            "text": "So yep.  Manchin is a piece of shit Republican like we all knew",
            "title_similarity": "0.42492765",
            "sentiment_compound": 0.101
        },
        {
            "id": "h20ehrw",
            "score": -7,
            "text": ">Manchin told the assembled donors that he needed help flipping a handful of Republicans from no to yes on the January 6 commission in order to strip the “far left” of their best argument against the filibuster. The filibuster is a critical priority for the donors on the call, as it bottles up progressive legislation that would hit their bottom lines.\n\nProgressive lawmakers need to take a long, hard look at themselves in the mirror. When someone from your own party is weary of working with you, more than people from the other party, maybe the problem is you, and not everybody else.\n\n>Regarding Blunt, Manchin appears to be suggesting — without, perhaps, quite explicitly saying so — that the wealthy executives on the call could dangle future financial opportunities in front of the outgoing senator while lobbying him to change his vote. Senate ethics rules forbid future job negotiations if they create a conflict of interest or present even the appearance of a conflict of interest. Manchin, notably, doesn’t suggest that the donors discuss a job, but rather says that people who Blunt may later be working with would be likely to have significant influence, reflective of the way future job prospects can shape the legislative process even when unspoken.\n\nJust a side note that this is the exact reason we can’t have term limits for Supreme Court Justices. Imagine having situations like this with Justices set to make a huge ruling.",
            "title_similarity": "0.64058363",
            "sentiment_compound": 0.9573
        },
        {
            "id": "h1zu8xs",
            "score": 1,
            "text": "The Intercept actually published something substantive that supports progressives without  coincidentally trying to nuke the entire democratic party? \n\nWow!",
            "title_similarity": "0.51610065",
            "sentiment_compound": 0.8516
        },
        {
            "id": "h1zu110",
            "score": 6,
            "text": "Manchin is a front man for other Dems not as moderate as him but still taking money from the same people.",
            "title_similarity": "0.46785676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zpx15",
            "score": -5,
            "text": "This isn't a democrat. This is a republican. Twitter needs to step up their game and hashtag label him as such.",
            "title_similarity": "0.48275402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20inkq",
            "score": 0,
            "text": "Lol. \"The left was correct again, how can we become even more corrupt to prove them wrong?!\"",
            "title_similarity": "0.3570166",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h20bv0c",
            "score": 2,
            "text": "While it’s great that we learn this, it also potentially just doomed the vote since blunt can’t change his vote without looking bought.  For all the terrible human being manchin might be it looks like he was trying to get a Jan 6 commission working and this piece may have torpedoed that working.\n\nThis absolutely could have waited until after the vote so that if that long shot worked at least we got the commission out.  I can’t help feeling that manchin hate generating clicks (as justified as it may be) just killed potentially having people be held responsible.  And the annoying thing will be a lot of people will continue to blame with a broad brush, ignoring that that mob rule thought and it’s corresponding impact on media articles is contributing to breaking any in progress workarounds that might actually get us what we want.",
            "title_similarity": "0.45261455",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1zo9nk",
            "score": 3,
            "text": "Well at least Manchin knows how exactly politics works in Usa and who has the real power.",
            "title_similarity": "0.5399353",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1zvabx",
            "score": 0,
            "text": "We should be rioting for this",
            "title_similarity": "0.17187235",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20o24p",
            "score": 0,
            "text": "For fucks sake America, get money out of your god damn politics.",
            "title_similarity": "0.4094112",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h20ps0v",
            "score": 0,
            "text": "Yea yea, full on regulatory capture. Reddit is finally waking up to the fact that voting, and civic engagement are merely smoke and mirrors obsfucating the fact that corporations run this country",
            "title_similarity": "0.6661037",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2129l8",
            "score": 0,
            "text": "I honestly think this asshole is a full on Republican trying to tank the Democrats from the inside.",
            "title_similarity": "0.43944257",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h219l8u",
            "score": -5,
            "text": "Keep the filibuster. The point is to learn how to compromise. Killing the filibuster will come back to haunt the Dems if they do it.",
            "title_similarity": "0.3456536",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h20p4g1",
            "score": -3,
            "text": "The Intercept is complete garbage from a journalism perspective, look at how horribly written and spun this story is. I wish this recording was leaked to the New York Times or an information source that has some journalistic integrity which they openly condemn and denounce. This article is written like a Fox News story from the left when the substance of the story itself is a bombshell. We need to reject and speak out against information sources like this. Why go out of your way to spin a bombshell when you are the ones leaking it?",
            "title_similarity": "0.4100207",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h20bxsk",
            "score": -16,
            "text": "If you think this isn't happening on both sides of the aisle you're part of the problem",
            "title_similarity": "0.21112292",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h218x9j",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h20per1",
            "score": 0,
            "text": "Too bad nothing will come from this",
            "title_similarity": "0.05220522",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20o2ix",
            "score": 1,
            "text": "Joe manchin is the fall guy. The majority of the Democratic party is in the 1%s pocket.\n\nHere are some short videos on how we vote, and how we can change how we vote so we can vote for other parties while still having our vote count against the Republicans.\n\n[First Past the Post voting - our current electoral system](https://m.youtube.com/watch?v=s7tWHJfhiyo)\n\nOther electoral systems we could use:\n\n[Single transferable vote](https://www.youtube.com/watch?v=l8XOZJkozfI)\n\n[Alternative vote](https://www.youtube.com/watch?v=3Y3jE3B8HsE)\n\n[Star voting](https://en.wikipedia.org/wiki/STAR_voting)\n\n[Mixed member proportional representation](https://www.youtube.com/watch?v=QT0I-sdoSXU)\n\n\n\n[Range voting](https://www.youtube.com/watch?v=e3GFG0sXIig)",
            "title_similarity": "0.5763106",
            "sentiment_compound": 0.7476
        },
        {
            "id": "h1znz53",
            "score": 6,
            "text": "The comments on this article are negative, which I understand. But that should be taken as a reflection on the people and processes the article focuses on, not on the article itself. The article itself is really interesting! Read it!",
            "title_similarity": "0.248925",
            "sentiment_compound": 0.4979
        },
        {
            "id": "h20m8su",
            "score": -5,
            "text": "Americans are just stupid. Bad education paired with nationalism… never ever anything good came out of that. Americans will keep bending over and get fucked by the likes of „conservative“ „democrats“. Manchin? He is a plant. Get rid of him. A Republican is better than a traitor.",
            "title_similarity": "0.36776674",
            "sentiment_compound": -0.8404
        },
        {
            "id": "h2011z1",
            "score": -17,
            "text": "Can we just change his status to Republican?  The dems are so stupid and so bad at winning they literally got tricked by a guy saying he's a dem that votes traitor.\n\nA ten year old could see through this BS.",
            "title_similarity": "0.47805125",
            "sentiment_compound": -0.7266
        },
        {
            "id": "h20ppdc",
            "score": -4,
            "text": "Okay, libs. Now what if I told you most of the Democratic Party (and Republican Party) does this stuff? Including \"We need to go after Medicare and Social Security\" Joe Biden?",
            "title_similarity": "0.63990736",
            "sentiment_compound": 0.8426
        },
        {
            "id": "h20w86g",
            "score": -1,
            "text": "So, what are the Democrats going to do about this?\n\nNothing?\n\nRight.",
            "title_similarity": "0.27491367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20du8k",
            "score": 0,
            "text": "Mancin is flipping to R before his next re-election.  He'll be licking the taint of Trump by then in order to keep his seat.",
            "title_similarity": "0.570987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h212veq",
            "score": -1,
            "text": "Manchin is a fucking degenerate pig. He has got to go.",
            "title_similarity": "0.18167996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20oi6h",
            "score": 0,
            "text": "Why would anyone think this is rare?  This is what congress does.\n\n“What do I need to do to stay in office.”",
            "title_similarity": "0.56031895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21rwx8",
            "score": 0,
            "text": "bunch of crooks both Demo & Rep . nobody do something good for citizens.",
            "title_similarity": "0.29290512",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h20or6m",
            "score": -9,
            "text": "r/politics is such a joke. You can scroll all the way down the front page and not see a single post about the people who are actually currently in power. Probably for the better you guys can't actually handle a debate or look realistically at the issues. Just a sad little liberal circle jerk.",
            "title_similarity": "0.5046871",
            "sentiment_compound": -0.0352
        },
        {
            "id": "h1zxf1p",
            "score": -5,
            "text": "Manchin and sinema are making it REALLY hard to vote blue no matter who when they’re the ones who are refusing to hold gop accountable and stop bills that we the people voted for.",
            "title_similarity": "0.31734508",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h20ybhk",
            "score": -2,
            "text": "Hate to break it to you, but ALL Politicians are scumbags.\nJoe's been doing it for 50 years and is now the King Scumbag of the USA.",
            "title_similarity": "0.494468",
            "sentiment_compound": -0.8462
        },
        {
            "id": "h20v1h4",
            "score": 5,
            "text": "Unpopular Opinion;\nThe only reason everyone is crying about the filibuster is because they have a razor thin “majority” in the Senate and they want to try and ram as much of their agenda through before the midterm elections, where there is a risk they could lose that majority. \n\nBasically people want to do away with the filibuster specifically so they can get around all the bipartisanship they always complain they’d like to see more of. \n\nAnd you all need to be honest with yourselves at least;\nIf the shoe was on the other foot, if the Republicans had majority control of Congress, and they were the ones trying to do away with the filibuster, you all would be crying bloody murder right about now.\n\nEdit: Spelling",
            "title_similarity": "0.4849658",
            "sentiment_compound": -0.9287
        },
        {
            "id": "h1zxvuu",
            "score": 9,
            "text": "Manchin and sinema are making it REALLY hard to vote blue no matter who when they’re the ones who are refusing to hold gop accountable and stop bills that we the people voted for.",
            "title_similarity": "0.31734508",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h1zmezm",
            "score": 89,
            "text": "> Manchin told the assembled donors that he needed help flipping a handful of Republicans from no to yes on the January 6 commission in order to strip the “far left” of their best argument against the filibuster.\n\nMore evidence that the \"far left\" is the real enemy of those democrats and their sponsors...and then it will be \"vote blue no matter who\" at election time...",
            "title_similarity": "0.6399721",
            "sentiment_compound": -0.3883
        },
        {
            "id": "h1zxavy",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h200emq",
            "score": 3,
            "text": "Manchin is a traitor",
            "title_similarity": "0.24286905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21095f",
            "score": -2,
            "text": "no shit, another nothing article for the ech0 chamber to foam at the mouth about. 5 billion upvotes and 100 \"reddit awards\" lol",
            "title_similarity": "0.4821652",
            "sentiment_compound": 0.8282
        },
        {
            "id": "h20j0vc",
            "score": -1,
            "text": "This is not a very good news source",
            "title_similarity": "0.07992667",
            "sentiment_compound": -0.3865
        },
        {
            "id": "h20qvpr",
            "score": -1,
            "text": "I'm so fkin tired of this guy, honestly. Just switch parties already, pls.",
            "title_similarity": "0.36916637",
            "sentiment_compound": 0.4256
        },
        {
            "id": "h1zqw5r",
            "score": 11,
            "text": "Can we get a link to the actual call? \n\nI don’t care what they report I’d rather hear it from Manchin  himself…",
            "title_similarity": "0.36941108",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1zt2iu",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h2059a0",
            "score": -3,
            "text": "Well I never *pearl clutching intensifies*",
            "title_similarity": "0.22131169",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h210gug",
            "score": -3,
            "text": "his career had better be over when he's up for reelection",
            "title_similarity": "0.38984054",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h208sxs",
            "score": -5,
            "text": "let me know a clean congress/senator who didn't receive filthy money from billionaires. Even bernie is behind the filth. we need to change the whole fking government if we want a clean government. every single fking one of them is filthy and they are not looking at OUR INTEREST BUT THE BILLIONAIRES.",
            "title_similarity": "0.5429089",
            "sentiment_compound": 0.6389
        },
        {
            "id": "h20o47x",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h1zp628",
            "score": 36,
            "text": "Really waiting for all the folks coming in accusing The Intercept of just being russian shills despite this being yet another example of extremely good reporting from them.",
            "title_similarity": "0.4910866",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h1zp66x",
            "score": 3,
            "text": "> funnels high-net-worth donor money to conservative Democrats and moderate Republicans.\n\nThat sounds like one of the following:\n\n\"...funnels... money to moderates\"\n\nor maybe,\n\n\"...funnels... money to conservative Democrats and liberal Republicans\"\n\n...but saying \"conservative Democrats and moderate Republicans\" in the same breath sounds pretty loaded to me.",
            "title_similarity": "0.6136232",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h201nnd",
            "score": -2,
            "text": "What's truly sad is the Republican Party has become so ultra conservative and crooked. Im a registered Republican actually and would vote for another one if one came along that had some common sense. Mitch M for example bashes any one or and states that have welfare programs that help the less fortunate. Yet doesn't talk about for ever dollar paid in taxes. Almost 3 dollars comes back to his state from the Feds. That extra support comes from the blue states mostly. Most of the Bible Belt states are this way. They claim to hate abortion yet have the highest numbers per capita than blue states. They hate welfare yet have the highest number of people receiving them.",
            "title_similarity": "0.47582376",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h20339b",
            "score": -3,
            "text": "Rare, don't they all do it? They all spend just as much time legislating as fundraising. Mostly more the latter.",
            "title_similarity": "0.41716653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h206v0g",
            "score": 4,
            "text": "This is BS, this is who the government protects, the rich! Wake up America! Do not fall into the trap that there is two parties. The people of this great country should be focusing on voting these type of sensors out.",
            "title_similarity": "0.58389056",
            "sentiment_compound": 0.9146
        },
        {
            "id": "h2091lk",
            "score": 2,
            "text": "I know this can feel defeating, and I know it seems like these guys stand in the way of reform that unarguably would improve the lives of  countless millions of Americans, but look on the bright side:  sorry, I thought something would come to mind as I began writing this but I got nothin.",
            "title_similarity": "0.5119772",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h20okgc",
            "score": -4,
            "text": "Sounds familiar...oh yeah, \"I only need you to find 11,780 votes\",  1 more than Biden got in Georgia.  Time to throw every damn one of Congress out and start over after America is clearly shown the truth about each 1, their lies, voting records, ties to big money donors and more!",
            "title_similarity": "0.62093604",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h20qe5q",
            "score": -4,
            "text": "Manchin is NOT a Democrat. He's a poorly disguised Republican. Think of a wolf in poorly made sheep's clothing. Manchin has to tuck his wolf's tail before he walks onto the senate floor. \"Greetings, fellow Democrats. I swear I am one of you, an actual Democrat.\"",
            "title_similarity": "0.44106627",
            "sentiment_compound": 0.128
        },
        {
            "id": "h21216m",
            "score": -4,
            "text": "I told you he was a Republican plant. \n\nI said it weeks ago.",
            "title_similarity": "0.5962553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h214czk",
            "score": 3,
            "text": "We need term limits, as well as limits on campaign donations. Each level of government needs a cap on both. Campaigns should be limited to 9 months.",
            "title_similarity": "0.4833861",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h20qmjd",
            "score": 7,
            "text": "Read the article :)\n\n>“Right now, 60 is where I planted my flag, but as long as they know that I’m going to protect this filibuster, we’re looking at good solutions,” he said. “**I think, basically, it should be [that] 41 people have to force the issue versus the 60 that we need in the affirmative**. So find 41 in the negative. … I think one little change that could be made right now is basically **anyone who wants to filibuster ought to be required to go to the floor and basically state your objection and why you’re filibustering and also state what you think needs to change that’d fix it, so you would support it. To me, that’s pretty constructive**.”\n\n>As an example, Manchin said that he was prepared to specify his objections to S. 1, the For the People Act. In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility. He also opposed a provision in the bill that restricted a state’s ability to purge voter rolls, which he said would make the rolls less reliable. And he expressed reservations related to some of the campaign finance reform provisions, arguing they needed to apply equally to labor and business.\n\n>“I’m telling you why I’m against something. So I’m going to send to [No Labels leaders] Margaret [White] and to Nancy [Jacobson], everybody on the voting thing, what I support, and the voting changes that need to be made and what I oppose in S. 1. **So at least I’m saying I’m against it for this reason, and here’s the things I think can make a piece of legislation better. I think we all should do that. We should be responsible for that**,” he said.\n\nThis is what he’s telling his far right donors.  Can anyone even fathom a Republican doing this, let alone in a state Trump + Libertarian won 70% to 30% Biden + Green?\n\nWe all know who Manchin is.  And he’s 1000 times better than a Republican as the 50th vote.  \n\nGo win other states instead of complaining that the Senator from Ruby Red WV isn’t “far left”.  This is what you’re going to get from Manchin.\n\n…\n\nEdit:  Also…\n\n> “I’m not going to sign off on reconciliation, giving up on bipartisanship **until you give it a try,**”\n\nHe’s telling them he’ll do reconciliation for infrastructure if Republicans won’t compromise.  So that’s nice.",
            "title_similarity": "0.4526928",
            "sentiment_compound": 0.991
        },
        {
            "id": "h20aoak",
            "score": 9,
            "text": "About to crucified here, but I am a moderate dem, not a progressive, so fire away.\n\nThis is how politics has always been done and in reading the article I have a more favorable view of Joe than I did before I read it.  It is a slippery slope with the filibuster and all for his proposal as an incremental step and wish they would just get this done, so the Senate can start passing legislation however narrowly.  We need to address climate change and voting rights yesterday, so there is no time to lose....",
            "title_similarity": "0.5225418",
            "sentiment_compound": -0.4177
        },
        {
            "id": "h207u5k",
            "score": 5,
            "text": "And nothing will be done. Congress is full of criminals that make the mafia look like fucking amateurs. \n\nHolding this country hostage while insider trading. \n\nI applaud congress for being the greatest criminal masterminds in modern history. Why rob the bank when you can rob the treasury.",
            "title_similarity": "0.50945824",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h20atpc",
            "score": 5,
            "text": "Another article, another five hundred commenters who didn't read it.\n\nI see what he's trying to do, but it's hopelessly idealist. In an effort to save the filibuster, he wants to try and get ten Republicans on the side of some of the Senate Democrats' biggest legislation. Of course he's doing so by convincing their donors.\n\nIn an ideal, pre-Gingrich world, it would be a solid plan. But even the moderate Republicans vote lockstep with the rest of the party these days.",
            "title_similarity": "0.6196171",
            "sentiment_compound": 0.9546
        },
        {
            "id": "h20c02o",
            "score": -4,
            "text": "Turning on your own now.",
            "title_similarity": "0.09290138",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20chss",
            "score": 4,
            "text": "They’ll drag Ilhan Omar the coals for saying the US should hold itself to the same standards as other countries but Manchin just gets a few strongly worded oped columns written about him while enabling republicans to institute permanent minority rule in this country. Just unreal.",
            "title_similarity": "0.54719484",
            "sentiment_compound": 0.296
        },
        {
            "id": "h20jzsn",
            "score": 0,
            "text": "corporations = people\n\npeople = constituents\n\npoliticians doing their job and looking out for their most important constituents... corporations!",
            "title_similarity": "0.61215794",
            "sentiment_compound": 0.3367
        },
        {
            "id": "h20ohvy",
            "score": 0,
            "text": "is anyone remotely surprised",
            "title_similarity": "0.10341236",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h20oz4s",
            "score": 0,
            "text": "I'd say lets vote them out... but day by day its looking less and less like that is a realistic way to deal with this.",
            "title_similarity": "0.3354403",
            "sentiment_compound": 0.3432
        },
        {
            "id": "h20p11b",
            "score": 0,
            "text": "Is it time for a general strike yet? PLEASE!",
            "title_similarity": "0.30517915",
            "sentiment_compound": 0.4263
        },
        {
            "id": "h20p8x4",
            "score": 0,
            "text": "They should censure him for blatant corruption.",
            "title_similarity": "0.31892353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20qjuv",
            "score": 0,
            "text": ">“This was not a fundraising call and any suggestion to the contrary is a false and obvious attempt to undermine Senator Manchin because he is one of the rare leaders in Washington who refuses to just toe the party line. It’s often a lonely place to be. No Labels is proud to stand with him.”\n\nHe just votes for what donors tell him instead of voting party line.",
            "title_similarity": "0.45311537",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h20vg13",
            "score": 0,
            "text": "Don't be so hellbent on getting rid of a tool that both parties have used historically. Once it's gone, it ain't coming back.",
            "title_similarity": "0.32228148",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h20vxaw",
            "score": 0,
            "text": "That fucker belongs in jail.",
            "title_similarity": "0.2764296",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h20wa6s",
            "score": 0,
            "text": "You’ll see that with any politician",
            "title_similarity": "0.43722063",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2129fi",
            "score": 0,
            "text": "h",
            "title_similarity": "0.020923162",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21lgnv",
            "score": 0,
            "text": "Can someone ELI 5 this for me, without bias only please.",
            "title_similarity": "0.34181204",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h21tmah",
            "score": 0,
            "text": "Jim Crow Joe only cares about lining his pockets . He doesn’t give a fuck about the DEMOCRATS or what they represent. Paid and Bought",
            "title_similarity": "0.33042854",
            "sentiment_compound": -0.128
        },
        {
            "id": "h21uqka",
            "score": 0,
            "text": "kyrsten's enema and butt munchin are DINO's",
            "title_similarity": "0.3256594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h220v3s",
            "score": 0,
            "text": "Where is the original audio? Is the video available?",
            "title_similarity": "0.27183726",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h228anc",
            "score": 0,
            "text": "Getting rid of the Filibuster should be a litmus test of ANY Democrat running for office. If they say they don't want to get rid of it. They should never get funding and be primaried immediately",
            "title_similarity": "0.33990753",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h235ubf",
            "score": 0,
            "text": "Calling all Manchin apologists that have infested every other thread on this sub: what do you have to say now? How can you twist this into being something we just need to put up with because “it’s really not his fault, he’s just representing his constituents!”",
            "title_similarity": "0.4718945",
            "sentiment_compound": 0.4241
        },
        {
            "id": "h23skpv",
            "score": 0,
            "text": "Then spell it out please!  Giving just headlines has no credibility to me",
            "title_similarity": "0.23102257",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h1zyd25",
            "score": 12,
            "text": "Capitalist Republic. \n\nIt's all carrot-and-stick games for whoever can dangle the shiniest rock, the biggest pile of cash. \n\nManchin's state is represented by billionaires, not the constituents. \n\nCarve out the corruption at the bloody root.",
            "title_similarity": "0.56426835",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h20kb6n",
            "score": 5,
            "text": "Those darn 1%, always getting government to work against the majority of Americans.  Darn them.  What a surprise that big money runs things in this country.  The Golden Rule is still true today.  He who has the gold, rules.",
            "title_similarity": "0.6076062",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1zmqob",
            "score": 19,
            "text": "Manchin is no better than McConnell when it comes to putting his own interests ahead of the needs of the country",
            "title_similarity": "0.33884788",
            "sentiment_compound": -0.1043
        },
        {
            "id": "h20flns",
            "score": 6,
            "text": "This is going to be an unpopular opinion here, but assuming that Manchin genuinely did not expect this audio to be leaked, it actually improves my opinion of him.\n\nI know it seems like Manchin is serving corporate interests, but based on this article, it seems like Manchin sincerely believes in the filibuster and is just using corporate interests to gather support. \n\nDuring the call, Manchin was giving orders to the corporate donors rather than taking them. If he was totally in their pocket, there's no reason why he would even mention that he was open to filibuster reform.\n\nHe strikes me as a shrewd politician who acknowledges the role that money plays in politics and has no problems using it to push his political agenda.\n\nI'm not saying I agree with Manchin's principles, but for now at least it seems he actually has some which is more than I can say for most Republicans.",
            "title_similarity": "0.5651462",
            "sentiment_compound": 0.9624
        },
        {
            "id": "h20rdim",
            "score": 6,
            "text": "I don't think a lot of people actually read the article. People seem to be assuming that a bunch of rich people told Manchin to hate the filibuster and he was like \"Okay sure,\" but in reality not much that he seems to say on the call is inconsistent with what he's publicly said. He's said publicly that he wants to preserve bipartisanship and therefore doesn't want to end the filibuster/etc; the article focuses on comments of his that seem geared at trying to create a bipartisan coalition so that he can justify not ending the filibuster, which isn't inconsistent with his prior position. He also appears to continue to support possible modifications to the filibuster that he's previously suggested, which also isn't contradictory to him saying he refuses to end it entirely and wasn't what the donors wanted to hear, either.\n\nWe can all still say we wish he was more progressive or hate his stance, etc etc, but I wish people wouldn't just freak out based on the title alone.",
            "title_similarity": "0.535817",
            "sentiment_compound": 0.9097
        },
        {
            "id": "h1zxqpu",
            "score": 14,
            "text": "> Manchin told the assembled donors that he needed help flipping a handful of Republicans from no to yes on the January 6 commission in order to strip the “far left” of their best argument against the filibuster.\n\nA friendly reminder that the United States does not have a party that has a far left majority. But okay.",
            "title_similarity": "0.70607483",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h206yqp",
            "score": 1,
            "text": "Ok, so we had it wrong?  Backwards?  Because from this call, it seems like the filibuster needs to be preserved so that Republicans can milk donors in exchange for their votes on a Democratic bill.  Can't do that if you can't hold a bill hostage.",
            "title_similarity": "0.5428884",
            "sentiment_compound": -0.2406
        },
        {
            "id": "h20cizv",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.030071491"
        },
        {
            "id": "h20cy81",
            "score": 1,
            "text": "You know after reading this article, I can agree to some of the changes that Manchin and other Republicans would like to see in the voting and infrastructure bills. The only thing I can’t agree on is the automatic voter registration. That absolutely needs to happen.",
            "title_similarity": "0.5082152",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h20fvun",
            "score": 1,
            "text": "The rich people are our enemy, y’all.",
            "title_similarity": "0.3949061",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h20homh",
            "score": 1,
            "text": "Manchin ain’t shit he gonna sell out for he money, blacks need to leave the Democratic Party in droves \nthe hell with standing on one foot & barking like a dog to vote it ain’t worth it\nIf we leave the party it’s over for the Dems let the Republicans run the country into the ground.",
            "title_similarity": "0.39098015",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h20nd31",
            "score": 1,
            "text": "United States of Corruption\n\nThis guy is a prime example of everything that's broken I'm our government.  He's not bi-partisan.  He's a crook, selling out his country to the highest bidder.\n\nVote his ass out and blackball his family from politics.  Corruption tends to run in the family.",
            "title_similarity": "0.5794281",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h20np7z",
            "score": 1,
            "text": "A real P O S. Sell out of the people, through n through.",
            "title_similarity": "0.49478734",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20nqux",
            "score": 1,
            "text": "A perfect example of how broken our political system is.",
            "title_similarity": "0.2939664",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h20opmy",
            "score": 1,
            "text": "This is gross",
            "title_similarity": "-0.04105755",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h20oqsk",
            "score": 1,
            "text": "Every time I hear this fucking guy Manchin's name I know it's going to be about something that stops Democrats from getting something actually good done. Fuck him.",
            "title_similarity": "0.41968536",
            "sentiment_compound": -0.296
        },
        {
            "id": "h20pqwq",
            "score": 1,
            "text": "I honestly hate this country.",
            "title_similarity": "0.039307628",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h20q3bk",
            "score": 1,
            "text": "And to think this has probably been going on for decades. This is so fucked up. Who knows how many lives have been ruined by corporate lobbying.",
            "title_similarity": "0.5871654",
            "sentiment_compound": -0.8755
        },
        {
            "id": "h20qufx",
            "score": 1,
            "text": "Expose all the crooked politicians, please.\n\nAllegedly No Labels supports conservative democrats and \"moderate Republicans\" but moderate Republicans don't really exist.\n\nThat's just another way of saying that they support conservatives under the guise of being moderate.",
            "title_similarity": "0.4858254",
            "sentiment_compound": 0.4108
        },
        {
            "id": "h20scno",
            "score": 1,
            "text": "Who could have possibly seen this coming. Manchin is fulfilling his exact role, and the democratic party tacitly allows and encourages it to allow them to save face while blocking legislation they dont want. This has been the democratic parties playbook for my entire life and im no spring chicken.",
            "title_similarity": "0.44656444",
            "sentiment_compound": 0.8115
        },
        {
            "id": "h20tulk",
            "score": 1,
            "text": "Why can’t these articles link to the actual source — the audio file? I want to hear the evidence myself, not merely read someone else’s interpretation.",
            "title_similarity": "0.3148838",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h20tuyr",
            "score": 1,
            "text": "Can anyone honestly look at what is going on here and pretend that this is a government by and for the people?",
            "title_similarity": "0.47459632",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h20tw83",
            "score": 1,
            "text": "The only way we will achieve bipartisanship is a legitimate 3rd party...short of that this wheel's gonna keep on turning",
            "title_similarity": "0.38586986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20vygw",
            "score": 1,
            "text": "At the very least this is a Democratic senator holding a borderline illegal fundraising meeting in his office where a dark money superpac is having a more open and candid conversation with him than he will ever have with his voters/journalists/critics. A superpac that seems purely interested in pushing the neo-liberal moneyed interested policies like austerity and tax cuts for the rich.\n\nIf this was my senator I'd be asking for her resignation. I voted for a Democratic senator. Not a \"No Labels\" superpac goon.",
            "title_similarity": "0.6317003",
            "sentiment_compound": 0.5849
        },
        {
            "id": "h20x2nh",
            "score": 1,
            "text": "A new party is needed.  Plain and simple",
            "title_similarity": "0.31347644",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h20x9ax",
            "score": -1,
            "text": "Joe Manchin: oh fuck, I got caught\n\nAlso Joe Manchin: <waits for the news cycle to shift to another story> I got caught?",
            "title_similarity": "0.5440186",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20xusm",
            "score": 1,
            "text": "Can't wait until nothing comes of this! Anyone else feel pure bliss when they see articles of the decaying infrastructure of the United States? Practically feels like an orgasm.",
            "title_similarity": "0.46479058",
            "sentiment_compound": 0.7644
        },
        {
            "id": "h20y9rv",
            "score": 1,
            "text": "Lol nothings going to happen or change.",
            "title_similarity": "0.0515792",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h20yvwb",
            "score": 1,
            "text": "Turns out Joe really still believes in bipartisanship in the era of Mitch McConnell and Q Anon. That’s a little inspiring and really, really horrifying. They’re not changing their stripes, Joe. They’ve gone too far down the rabbit hole to turn back now.",
            "title_similarity": "0.45445848",
            "sentiment_compound": -0.4146
        },
        {
            "id": "h20zceg",
            "score": 1,
            "text": "He’s asking for a bribe. These men need to be hung for treason.",
            "title_similarity": "0.42033562",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h21128z",
            "score": 1,
            "text": "Leaked.  Looks like his aides, like everyone else in the world who knows the difference between right and wrong, aren't too fond of him right now.    \n\n\nKeep piling it on until he comes to his senses.",
            "title_similarity": "0.41729146",
            "sentiment_compound": -0.4226
        },
        {
            "id": "h211m2r",
            "score": 1,
            "text": "It should be illegal to donate to a politician. Any amount.",
            "title_similarity": "0.22388497",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h211wij",
            "score": 1,
            "text": "It’s amazing getting to hear him acknowledge that the “far left” is completely right about him.",
            "title_similarity": "0.27241468",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2121q9",
            "score": 1,
            "text": "This mofo",
            "title_similarity": "0.08381455",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h213drh",
            "score": 1,
            "text": "What’s sad is that this happens nearly every day with assholes like McConnell, Cruz, and every other corrupt politician. I know because I used to work for Dana Rohrbacher’s best billionaire buddy. They’re all enamored of billionaires as well as Russian oligarchs.",
            "title_similarity": "0.6004542",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h215cjy",
            "score": 1,
            "text": "Politics is and has been dirty. For too long. When it benefits “our side”, whichever it is, then it’s playing the game. When it isn’t to “our side” advantage, it’s outrageous.",
            "title_similarity": "0.44547278",
            "sentiment_compound": -0.128
        },
        {
            "id": "h21dc8i",
            "score": 1,
            "text": "Aka watergate 2.0 but we dont care because the age of information and the patriot act have massively dulled our societal expectations of privacy.",
            "title_similarity": "0.31466234",
            "sentiment_compound": -0.7712
        },
        {
            "id": "h21kq68",
            "score": -1,
            "text": "Commission on blm riots over the past year in exchange.",
            "title_similarity": "0.57417864",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h21yyja",
            "score": 1,
            "text": "Yup. Both parties are cancer to this country and we need money the hell out of politics.\n\nKick them all to the curb IMO.",
            "title_similarity": "0.40129846",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h222wrt",
            "score": 1,
            "text": "Why does anyone care about this? There's NOTHING anyone can do about it. Ever. If there was, it would've happened long ago.",
            "title_similarity": "0.20214562",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h224cbr",
            "score": 1,
            "text": "Why doesn't Joe Biden just enforce the whip and MAKE Manchin vote how the head of the party wants, threatening to kick Manchin out of the party and the job?",
            "title_similarity": "0.48379487",
            "sentiment_compound": 0.25
        },
        {
            "id": "h227mzk",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h229fug",
            "score": 1,
            "text": "\"Deal making\"  \n\n*you take this side of the street Tony and our gang will take the other side, you understand and if you are able you provide my friends with a stipend of sorts, a token of your appreciate for what I am attempting to facilitate on your behalf for, all the better*",
            "title_similarity": "0.5079428",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h22j1mf",
            "score": -1,
            "text": "Man, I can’t imagine living Joe Manchin’s life at this point. It seems especially a democratic practice (but of course it exists on the Republican side too) to absolutely destroy the character of someone they don’t agree with.\n\nMan has the destruction-machine cranked up on Joe in the last month.",
            "title_similarity": "0.4885662",
            "sentiment_compound": -0.4478
        },
        {
            "id": "h20450q",
            "score": 7,
            "text": "How is this not admitting to bribery.",
            "title_similarity": "0.2748771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zqmps",
            "score": 2,
            "text": "This guy is a mole",
            "title_similarity": "0.21154854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zx9jt",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h201hjr",
            "score": 2,
            "text": "Manchin really is a top-shelf piece of shit.",
            "title_similarity": "0.29765874",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h201ug1",
            "score": 2,
            "text": "This back room deal making is why most American don’t trust our government.  All these elected officials have zero interest in anything beside the private sector.",
            "title_similarity": "0.44089594",
            "sentiment_compound": 0.7624
        },
        {
            "id": "h202kom",
            "score": 2,
            "text": "Fuck joe Manchin, just so blatantly corrupt. Bribe senators so I can get three votes to prove bipartisanship works, but then won’t work on anything else",
            "title_similarity": "0.5397061",
            "sentiment_compound": -0.418
        },
        {
            "id": "h203iku",
            "score": 2,
            "text": "Not one officer should protect these disgusting fools.",
            "title_similarity": "0.054283544",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h203zqn",
            "score": 2,
            "text": "Anybody that thinks that this fuckhead is going to lift a finger to help the Democrats in any material maker is a goddamned idiot.",
            "title_similarity": "0.28891322",
            "sentiment_compound": -0.851
        },
        {
            "id": "h204a7p",
            "score": 2,
            "text": "I gave up politics well before i could vote. Im not rich enough.",
            "title_similarity": "0.3322404",
            "sentiment_compound": -0.2081
        },
        {
            "id": "h2083wa",
            "score": -2,
            "text": ">As an example, Manchin said that he was prepared to specify his objections to S. 1, the [For the People Act](https://theintercept.com/2021/02/14/democracy-voting-campaign-finance-hr1/). In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility. He also opposed a provision in the bill that restricted a state’s ability to purge voter rolls, which he said would make the rolls less reliable. And he expressed reservations related to some of the campaign finance reform provisions, arguing they needed to apply equally to labor and business.\n\n\nOk pare down the bill to get the other things done.  And then if we flip the senate next election, push the rest through.\n\nGet whatever we can get with Manchin.  Since he is willing to do some things.",
            "title_similarity": "0.46449292",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h20blnc",
            "score": 2,
            "text": "You know what? Yes this entire article is a giant \"Fuck you\" to Manchin. The brazen corruption that exists is palpable. But I am going to take a piece of this and say that there is hope to get legislation passed.  \n  \n>Manchin acknowledged that publicly he had drawn a line at 60, but said that he was open to other ideas. “Right now, 60 is where I planted my flag, but as long as they know that I’m going to protect this filibuster, we’re looking at good solutions,” he said. “I think, basically, it should be [that] 41 people have to force the issue versus the 60 that we need in the affirmative. So find 41 in the negative. … I think one little change that could be made right now is basically anyone who wants to filibuster ought to be required to go to the floor and basically state your objection and why you’re filibustering and also state what you think needs to change that’d fix it, so you would support it. To me, that’s pretty constructive.”  \n  \nIf Senate Dems actually vote to force 40 republicans to sit on the floor for the entire filibuster AND speak, they can open the door to force legislation through. In the article it sounds like Joe is actually working on getting ANY form of HR1/S1 to pass. If done, it will be groundbreaking on getting the Dem agenda passed. But as always, I will believe that filibuster reform is gonna happen when I see the vote.",
            "title_similarity": "0.5248082",
            "sentiment_compound": 0.9527
        },
        {
            "id": "h20ilzo",
            "score": -2,
            "text": "Scum like this is why the 2A exists.",
            "title_similarity": "0.28801417",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h20j77s",
            "score": -2,
            "text": "Good.\n\nGet this moderate Democrat out of West Virginia, a heavily Republican state.\n\nLol.\n\nWhy are you attacking this man? Don't you know that he will just be replaced by a Republican? A far right one, none the less. Do Democrats even know how lucky they are to have Manchin, a Democrat out of a heavy red state?\n\nKeep eating your own.",
            "title_similarity": "0.4853921",
            "sentiment_compound": 0.7219
        },
        {
            "id": "h20n41q",
            "score": 2,
            "text": "All I heard was\n\nHey you all are making me look bad. We need at least a few Republicans to vote yes on the commission so I can continue to try and fool the American people and my constituents into thinking I give a fuck. Otherwise, I look like sort of an asshole. I am an asshole, but I don't want it to look like I'm an asshole. I'm not asking for that much, I just want it to seem like I am listening to Democrats while taking big money to obstruct legislation.",
            "title_similarity": "0.5200131",
            "sentiment_compound": 0.5813
        },
        {
            "id": "h20nf5m",
            "score": 2,
            "text": "Burn it all down.",
            "title_similarity": "0.06022052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20nsba",
            "score": 2,
            "text": "I'm just so fucking tired man. What the fuck can we even do at this point? Violent Revolution?",
            "title_similarity": "0.28844473",
            "sentiment_compound": -0.9048
        },
        {
            "id": "h20o1t2",
            "score": -2,
            "text": "Republicans figured out they could have more control by pretending to be centrist Democrats. Theyre working from the inside to capitulate to their real aims. People need to smarten up to this.",
            "title_similarity": "0.43945137",
            "sentiment_compound": 0.552
        },
        {
            "id": "h20of88",
            "score": 2,
            "text": "So we are an oligarchy.",
            "title_similarity": "0.3355249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20ohrt",
            "score": 2,
            "text": "I hate to say it but this is the norm for almost every elected official in the state and federal governments. Donor money before the constituents. If you can’t pay for change then you will receive none",
            "title_similarity": "0.5690089",
            "sentiment_compound": -0.4497
        },
        {
            "id": "h20t7ul",
            "score": -2,
            "text": "I have respect for Joe Manchin. I also have respect for the public mission of No Labels. \n\nThe open corruption of our political system as some sort of necessary evil however makes respect for our country more difficult.",
            "title_similarity": "0.34128582",
            "sentiment_compound": -0.0992
        },
        {
            "id": "h20usq2",
            "score": 2,
            "text": "Everyone in power hates progressives. It always comes down to stopping progressives. Whether it’s a funny little call from Obama to Buttgieg and Klobauchar or a funny little zoom call from billionaires to Manchin, so much of what goes down in politics has the single purpose of stopping progressives.",
            "title_similarity": "0.42535204",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h20yisg",
            "score": 2,
            "text": "I was in Charleston, South Carolina, over New Years in 2019. While staying at the Hotel Belmond, I was surprised to see Al Franken walk by. He was wearing a name tag with the name of an organization called the [Renaissance Conference](https://www.renaissanceweekend.org/), which was holding a conference there.\n\nThe organization has a website, which says:\n\n> In 1981, friends lamented with Phil & Linda Lader that there were rare occasions to learn from their most fascinating work and everyday-life acquaintances in a personal, substantive way. Consequently, 60 families shared the Laders’ “Renaissance Weekend,” their four-day, New Year’s “house party” on Hilton Head Island.\n>\n> For three decades, that gathering’s spirit – an “extended family reunion” – has distinguished each of the 140+ Renaissance Weekends:  a cross-generational, “continuing conversation” among innovative leaders from diverse fields. Most are authorities; many have amazing achievements and contributions ahead. All are committed to making a genuine difference with their lives.\n>\n>Each – long-time “regulars” & extraordinary newcomers alike – has a noteworthy story: often, incredibly inspiring. Hundreds of programs and activities in just a few days. Ideas and relationships celebrated. No political or commercial agenda. \n>\n>And the enduring friendships, often the most unlikely, have continued to foster historic projects, ventures and public service – even several dozen marriages.\n\nOf course, we couldn't get a list of the attendees, but since everyone was walking around with their nametags, I could Google them and figure out who at least some were. Most seemed to be upper-middle-class professionals, things like doctors, lawyers, psychologists, business owners.\n\nThe organization's website has an amazing list of [participants](https://www.renaissanceweekend.org/participants), too many to list, but congressmen, SCOTUS justices, ex-presidents, even Bill Nye and George Takei.\n\nI got the definite sense that this was not some hack conference to fleece money out of upwardly mobile people - that it was, in fact, a meeting of people who had a strong desire to change society to *their* vision, and that this conference was a way for like-minded people to hone that vision. But the event was super low-key, and the organization says that there is no political agenda and the famous attendees do cut across the party spectrum. However the common factor was clearly \"money\", and the organization was obviously to co-mingle these people. People who would *never* co-mingle with you or I.\n\nThis is just a different way to say what George Carlin said best:\n\n> It’s never gonna get any better. Don’t look for it. Be happy with what you got. Because the owners of this country don't want that. I'm talking about the real owners now, the real owners, the big wealthy business interests that control things and make all the important decisions. Forget the politicians. The politicians are put there to give you the idea that you have freedom of choice. You don't. You have no choice. You have owners. They own you. They own everything. They own all the important land. They own and control the corporations. They’ve long since bought and paid for the senate, the congress, the state houses, the city halls, they got the judges in their back pockets and they own all the big media companies so they control just about all of the news and information you get to hear. They got you by the balls. They spend billions of dollars every year lobbying, lobbying, to get what they want.",
            "title_similarity": "0.652117",
            "sentiment_compound": 0.9973
        },
        {
            "id": "h20zk82",
            "score": 2,
            "text": "We have clear evidence of how much the wealthy impact our politics, and yet people still act like we live in a democracy.",
            "title_similarity": "0.59004045",
            "sentiment_compound": 0.765
        },
        {
            "id": "h20zxfb",
            "score": 2,
            "text": "This fucking idiot thinks he is Ceresi Lannister, plots within plots, when he's really Margarey Tyrell, getting used by everyone until they have no more use for him.",
            "title_similarity": "0.37366182",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h212avg",
            "score": 2,
            "text": "\"Leaked\" audio",
            "title_similarity": "0.30010515",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h212ff9",
            "score": 2,
            "text": "What a piece of filth. Time to start really cleaning house, both sides of the spectrum. Everyone doing this shit must go. If it means we start from scratch so be it.",
            "title_similarity": "0.30988228",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h212lm4",
            "score": 2,
            "text": "Its time to accept we live under a oligarchy and work on changing that.",
            "title_similarity": "0.3655584",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h214vue",
            "score": 2,
            "text": "How are these mofos not in jail for corruption?!",
            "title_similarity": "0.3993005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21abgt",
            "score": 2,
            "text": "Both parties serve the same masters",
            "title_similarity": "0.23021902",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h21icat",
            "score": 2,
            "text": "This is everyday politics anyone that thinks otherwise is kidding themselves.",
            "title_similarity": "0.43134424",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h220wbm",
            "score": 2,
            "text": "This is what the Democratic Party actually is, unfortunately. Our choices are this or an absolutely batshit far-right party. And this is by design.\n\nOur constitution is broken. It has no backbone, and we have an oligarchy. Our best shots at gaining some sense of democracy die before they reach the general election. Again, by design.\n\nWe do not have a democracy. We do not have a say in our government at all. The only solution is to gut the entire thing and rebuild from the ashes.",
            "title_similarity": "0.38346094",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h221ej4",
            "score": 2,
            "text": "I think most of us knew this is how our political system worked but it’s still disheartening to be shown proof",
            "title_similarity": "0.43341213",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h22spo5",
            "score": 2,
            "text": "Disgusting.  He’s no Dem but a Repub in disguise",
            "title_similarity": "0.13499258",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h1zuhy5",
            "score": 3,
            "text": "Lock this bastard up. His corruption is obvious",
            "title_similarity": "0.28164792",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h200u85",
            "score": 3,
            "text": "Worst part is this guy sold out for 4k, I will never respect him again.",
            "title_similarity": "0.38734043",
            "sentiment_compound": -0.7687
        },
        {
            "id": "h203wx9",
            "score": 2,
            "text": "What an absolute piece of dog shit Manchin is.",
            "title_similarity": "0.07882066",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2040bu",
            "score": 4,
            "text": "I hope that when I’m on my death bed in 40-50 years I will see the US, if it’s still a country, have a progressive party in power.",
            "title_similarity": "0.5024823",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h204knn",
            "score": 2,
            "text": "An excellent example of why we shouldn't call this anything but bourgeois democracy. The people who have money have access and direct influence, not to mention they often own the very creators and curators of public opinion, news and social media companies. Those who don't, have a measly vote.",
            "title_similarity": "0.5915904",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h206rkl",
            "score": 4,
            "text": "Our country is beyond broken we are fucked",
            "title_similarity": "0.17653072",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h206y4d",
            "score": 4,
            "text": ">The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money to conservative Democrats and moderate Republicans. \n\nWell well well.  Joe \"let's fuck this health bill up for generations of Americans\" Lieberman, still getting in his kicks eh?  How absolutely fitting he's hosting this sickening foot-shooting by Joe \"what the fuck is wrong with me\" Manchin.",
            "title_similarity": "0.64384526",
            "sentiment_compound": -0.891
        },
        {
            "id": "h208ou4",
            "score": 2,
            "text": "To everyone who “bOtH sIdEs”d me when I pointed out that centrist Dems like Manchin are sold out to the rich and powerful and are doing EXACTLY what they want. Fuck all ya’ll. I fucking told you so.",
            "title_similarity": "0.5234023",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2093mf",
            "score": 3,
            "text": "I have a very deep hatred for this man.",
            "title_similarity": "0.09924375",
            "sentiment_compound": -0.6682
        },
        {
            "id": "h20a9q1",
            "score": 3,
            "text": "This should be enough to expel him from the party… Democrats don’t have the votes anyways and all that guy does is to make sure  Democratic efforts are dead in the Senate… remove him from any commissions and cut all the money flowing his way",
            "title_similarity": "0.35963222",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h20aems",
            "score": 3,
            "text": "Spokesperson for Manchin, after Manchin drops hints to sweeten the deal for a retiring moderate Republican:\n\n> “Senator Manchin was discussing the issue of money in politics and the impact campaign donations have on Senators and members of Congress. He was not soliciting donations for himself or anyone else”\n\n\"Officer, I was discussing the issue of paid sex work with this woman and its impact on this street corner. At no time was I soliciting sex for myself or anyone else.\"",
            "title_similarity": "0.60615367",
            "sentiment_compound": -0.296
        },
        {
            "id": "h20aewh",
            "score": 3,
            "text": "What happened to America? Where the People get the shaft and the rich get the gold mine? Are we really going to be governed by a ruthless greedy sect of super wealthy Christofascist thugs? We are heading towards a French style revolution where the greedy thugs who only care about increasing their fucking wealth are dealt with appropriately.",
            "title_similarity": "0.5334651",
            "sentiment_compound": 0.9278
        },
        {
            "id": "h20dubu",
            "score": 3,
            "text": "This should be criminal. Fuck this.",
            "title_similarity": "0.041387506",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h20gciz",
            "score": 2,
            "text": "Fuck this country. \n\nHonestly I wouldn't mind it going away and splitting into two countries like it was supposed to during the civil war. Except this time the south gets W. Virginia and not Virginia.",
            "title_similarity": "0.36152136",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h20gdpa",
            "score": 2,
            "text": ">The meeting was hosted by the group No Labels, a big money operation **co-founded by former Sen. Joe Lieberman** that funnels high-net-worth donor money to conservative Democrats and moderate Republicans.\n\nLIBERMAN JUST WONT GO AWAY, JESUS",
            "title_similarity": "0.6950604",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h20ikxx",
            "score": 4,
            "text": "nice functional democracy you got there 👍",
            "title_similarity": "0.25476983",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h20iwbl",
            "score": 5,
            "text": "I just dont trust the intercepts reporting since the Tara Reade thing. I'll happily join the hate-Manchin circlejerk when this is covered by a more credible outlet.",
            "title_similarity": "0.45755237",
            "sentiment_compound": 0.4763
        },
        {
            "id": "h20t3f7",
            "score": 3,
            "text": "Here I am once again fired up about politics with nothing else to do with it because of the soul crushing realization that the power dynamic of the American government to its people is so out of whack that you can never effectively organize against it and the corporations it stands up that drain the life and resources out of this nation. Even right now I am using a mega corporation’s imitation of another mega corporation’s word processing software to type a rant about this. To get my message to any sizable audience would require several connections to large companies along the way, each one with people waiting to execute their control in favor of a status quo or ideal that favors people already in power over those who could wield it for good. I can rant, rave, hoot, and holler to strangers in the hopes that I gain support, but more than likely I couldn’t maintain the momentum for one reason or another. The true fear is that America is already too far gone. That the rich and powerful not only control politicians, but that they execute their crimes in broad daylight like in Mexico, where politicians are killed so ferociously that you have to actually want your own death to do anything other than what the cartels want. That any criticism valid or otherwise is treated as a personal attack to the human ideal of an “American” citizen that the small but influential population see themselves as. That no warning of a military-industrial complex was ever able to be heeded, because since the Ford and Rockefeller days the population of true American citizens have been told what to do and when to do it to such a degree that in the 21st century infants are born latched to the Tit of Convenience that the nation’s “largest employers” use to feed them anxiety, body issues, and alternative facts and grow into adults struggling against a status quo that keeps them drugged up, consuming, and accepting of their fate. The machine keeps turning and grinding all the cattle that are fed into it. That fear is inescapable, I think.",
            "title_similarity": "0.5609963",
            "sentiment_compound": 0.1996
        },
        {
            "id": "h20u3pf",
            "score": 3,
            "text": "“dealmaking”? Thats corruption!",
            "title_similarity": "0.3463822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20vcfw",
            "score": 3,
            "text": "Protesting doesn't work, things need to be escalated.",
            "title_similarity": "0.087833114",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h20z0ph",
            "score": -4,
            "text": "Has anybody else noticed the amount of leaks that tend to spring up around people that get on the wrong side of the democrats?",
            "title_similarity": "0.38142368",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h20zcdy",
            "score": -3,
            "text": "I love Manchin",
            "title_similarity": "0.16020262",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h214293",
            "score": 3,
            "text": "The filibuster is unconstitutional, it goes against the will of the people. It has historically been used to oppress the civil rights movement. Its time to put an end to the suppression.",
            "title_similarity": "0.26639897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zodq4",
            "score": 4,
            "text": "This has always been going on, wherein rich donors  offer politicians no-show jobs for themselves, their spouses, or their failchildren in return for getting certain legislation passed. It's not going to change by getting \"the right people\" into government. The only way it's going to change is by fundamentally changing who holds the economic reigns of power.",
            "title_similarity": "0.64386165",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1zpz84",
            "score": 3,
            "text": "So, he is open to weaken the filibuster, but at the same time tries to preserve it against the “left”?\n\nDon’t understand this person",
            "title_similarity": "0.3280344",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h204eu9",
            "score": 4,
            "text": "Corrupt old bastard",
            "title_similarity": "0.19001108",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h204maj",
            "score": 3,
            "text": "Joe Manchin is more concerned about representing billionaires that his own constituents that elected him to office.",
            "title_similarity": "0.63626873",
            "sentiment_compound": 0.0
        },
        {
            "id": "h207cvu",
            "score": 4,
            "text": "This entire thing is corrupt as fuck. This country is doomed.",
            "title_similarity": "0.16159782",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h2096nw",
            "score": 4,
            "text": "Ah so Manchin conspired with rich, corrupt corporate overlords to try to find a way to undermine the arguments the “far left” makes against the filibuster. \n\nFuck this fucking piece of shit so much. I have never spit on a grave before, but if Manchin is buried in a publicly-accessible spot when he (hopefully soon) dies, I’m gonna give it a try.",
            "title_similarity": "0.5875218",
            "sentiment_compound": -0.269
        },
        {
            "id": "h20b4py",
            "score": 4,
            "text": "Reminder that Democrats like Manchin are the reason that average Americans feel like Democrats are full of shit as well. We need to weed these people out and restore the integrity of our party. \n\nProgressive policies are not unpopular, corrupt politicians are.",
            "title_similarity": "0.42895848",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h20d11o",
            "score": 4,
            "text": "And literally nothing is going to happen.\n\nWe're living in a dystopia.",
            "title_similarity": "0.15766737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20d77c",
            "score": 4,
            "text": "I don’t know who leaked this audio, but my hat is off to you. Keep the leaks coming. I hope people get angry enough to start eating the rich.",
            "title_similarity": "0.47580805",
            "sentiment_compound": 0.5647
        },
        {
            "id": "h20dhfy",
            "score": 4,
            "text": "So obvious that fucker is getting paid off by those donors.\n\nAs far as I’m concerned, a traitor",
            "title_similarity": "0.5352373",
            "sentiment_compound": -0.6771
        },
        {
            "id": "h20hcub",
            "score": 4,
            "text": "Yet we have people who don’t believe there’s a class struggle between rich and poor.",
            "title_similarity": "0.42962474",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h20j7oq",
            "score": 4,
            "text": "10, 15 or 20 Billionaires are deciding the fate of this country.  Because Joe Machin is a corrupt piece of shit and these Billionaires don't want Democrats to have any power to tax their asses the country is going to be fucked for the next 50 years.  I have been saying all along Joe Machin is a plant at least and a traitor at the worst.  This audio demonstrates that he is owned by big money.  What the people who cast votes for him say doesn't mean shit.",
            "title_similarity": "0.551058",
            "sentiment_compound": -0.8859
        },
        {
            "id": "h20kwzu",
            "score": 4,
            "text": "Fuck you Manchin",
            "title_similarity": "0.0700126",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20lfs3",
            "score": 3,
            "text": "Better start believing in dystopian futures boys and girls...\n\nYou in one",
            "title_similarity": "0.35546297",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h20x7nz",
            "score": 3,
            "text": ">Manchin said that he was prepared to specify his objections to S. 1, the For the People Act. In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility. \n\nSo he opposes a bill based on circumstances that would be alleviated by an infrastructure bill, which he is also hindering. No wonder he's hanging out with Joe Lieberman. With Democrats like these why do we even need Republicans?",
            "title_similarity": "0.4315103",
            "sentiment_compound": 0.296
        },
        {
            "id": "h20ycfz",
            "score": 4,
            "text": "I understand better.  It's really just a spelling error.  It's not \"bipartisanship\" it's \"buypartisanship\".  Now it makes sense.",
            "title_similarity": "0.3370955",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h20yl8e",
            "score": -5,
            "text": "Haha radlibs really going after my main man manchin. Unseat him so we can get a Republican in please.",
            "title_similarity": "0.47036722",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h213z16",
            "score": 3,
            "text": "You know what ? It's good journalism.\n\nI haven't made up my mind about what I think of this call. On the one hand you can see it as Manchin trying to weasel out of filibuster reform, on the other hand you can see it as someone that firmly  believes in the institutions and in bipartisan spirit (right or wrong - and to be clear I'm inclined to think he's really wrong here ) and is trying to find compromise/whip votes to make it work. And regarding the second reading, keep in mind that's how dealmaking works.  Lincoln (see Spielberg movie), FDR  did stuff like that to get their way.\n\nI want to carefully listen the audio which is one hour long and really digest the article. But I'm really  grateful for the journalist who put out this story : Filibuster reform is as serious as it gets   and   there should be no bullshit reason to avoid an actual debate. Not on this. Put everything in broad daylight. Let's see who is who.",
            "title_similarity": "0.54399043",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h23blgf",
            "score": -4,
            "text": "We already know the \"Jan 6th commission\" is not looking for the truth.  What is the truth ? Video shows the Capitol police inviting peaceful protestors into the building.  And now we know 20 of the violent instigators were working with the FBI.\n\nDidn't know that ?  It was a setup to frame Trump supporters. \n\nWhere is Ashli Babbit's killer ?  Educate yourself; you are being fed propaganda.",
            "title_similarity": "0.5643979",
            "sentiment_compound": 0.327
        },
        {
            "id": "h1zmth6",
            "score": 136,
            "text": ">Manchin told the assembled donors that he needed help flipping a handful of Republicans from no to yes on the January 6 commission in order to strip the “far left” of their best argument against the filibuster. The filibuster is a critical priority for the donors on the call, as it bottles up progressive legislation that would hit their bottom lines.\n\nDems and Republicans will team up to do the bare minimum all just to strip power from progressive ideas. Ugh... fuck everything, man. Shit like this makes me beyond cynical.",
            "title_similarity": "0.6234901",
            "sentiment_compound": -0.8849
        },
        {
            "id": "h1zx5dl",
            "score": 70,
            "text": "No taxation without representation. Why again are we the people required to pay taxes when our representatives clearly do not represent us?",
            "title_similarity": "0.50195825",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h20dh67",
            "score": 6,
            "text": "How do we allow such open corruption in this country?\n\nAnywhere else in the world, this would be blatant corruption. But here it’s santized by calling it “lobbying” and it’s just business as usual.\n\nThis is some dystopian shit.",
            "title_similarity": "0.5331656",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h20leqb",
            "score": -5,
            "text": "And yet Hunter Buy-den’s laptop loaded with evidence of our dottering fool president’s corruption and ineptitude remains hidden.",
            "title_similarity": "0.562593",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h207sou",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "0.030071491"
        },
        {
            "id": "h208irt",
            "score": -8,
            "text": "How dare a politician engage in politics.",
            "title_similarity": "0.332281",
            "sentiment_compound": 0.34
        },
        {
            "id": "h20jdo8",
            "score": 6,
            "text": "Bro, fuck him. Let's nuke the filibuster AND do a Jan 6th commission. I'm fucking tired of negotiating and arguing with LITERAL FUCKING TERRORISTS. The people gave us the power, we need to have the fortitude to use it.",
            "title_similarity": "0.4612823",
            "sentiment_compound": -0.9481
        },
        {
            "id": "h20ozhm",
            "score": -7,
            "text": "You lot should be focused on much more important things, like the constant barrage of shit you made fun of the Trump admin for, increased ten fold with the Biden admin.  \n\nHypocrites.",
            "title_similarity": "0.4352004",
            "sentiment_compound": 0.8051
        },
        {
            "id": "h21ydcr",
            "score": -5,
            "text": "Joe manchin is the only sane democrat",
            "title_similarity": "0.22897883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zmq9y",
            "score": 96,
            "text": "Democracy is broken when this turd is calling the shots for the whole country.",
            "title_similarity": "0.36805978",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h201lxb",
            "score": 6,
            "text": "And no one will do a damn thing about this.  I’m so done with this shithole corrupt country",
            "title_similarity": "0.16043006",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2070gd",
            "score": 6,
            "text": "Land of the free*\n\n*additional fees may apply.",
            "title_similarity": "0.28631318",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h20wnoc",
            "score": 8,
            "text": "Everyone calling for MANCHIN to get voted out, you do realize that his replacement will 100% be a Republican. You don’t replace him with a more progressive Democrat. He gets replaced by a MAGA Republican. You lose the senate. Good bye confirming all but one cabinet appointee. Goodbye judicial appointments. Goodbye budget reconciliation.Sure he’s holding back the progressive agenda, but the alternative is much worse.",
            "title_similarity": "0.53662837",
            "sentiment_compound": -0.6187
        },
        {
            "id": "h1zzl6p",
            "score": 99,
            "text": "America is a progressive country led by regressive people.",
            "title_similarity": "0.42252284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zplq4",
            "score": 8,
            "text": "Gah! Joe Lieberman.",
            "title_similarity": "0.24818888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h205kf5",
            "score": 7,
            "text": "Seeing as the rich own the news I wonder how long it will be until this is widely reported, if at all.",
            "title_similarity": "0.54047936",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1zn2ww",
            "score": 234,
            "text": "Man, I’ve been on here calling this guy an obstructionist tool working for the same rich guys that the republicans do for a while now and everyone just tells me I’m some hysterical liberal and how lucky we are to have any democrat in west Virginia.  This dude is the reason we can’t raise the minimum wage",
            "title_similarity": "0.61631966",
            "sentiment_compound": 0.743
        },
        {
            "id": "h1zqwn7",
            "score": -26,
            "text": "For a sub called “politics” people here sure don’t seem to understand politics is about convincing people that supporting your position is in their best interests",
            "title_similarity": "0.35240275",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h207gq7",
            "score": 27,
            "text": "You never get clearer evidence of how corrupt it is than this. People are still going to be like \"yeah but we can't push him or he'll join the Republicans!\"",
            "title_similarity": "0.49542582",
            "sentiment_compound": 0.6643
        },
        {
            "id": "h203bnk",
            "score": 10,
            "text": "So we know who Manchin's real constituents are - and they are NOT the voters of West Virginia.  These billionaires are the ones who pull Manchin's puppet strings.  When they call, he jumps and answers, \"Yes sir\" and \"Yes mam\".",
            "title_similarity": "0.660019",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1zu5zl",
            "score": 11,
            "text": "Yup there’s absolutely positively no problem with money in politics 🙄",
            "title_similarity": "0.3524644",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h1ztbnu",
            "score": 51,
            "text": "I hope this becomes the most known thing about him. I hope everyone listens to the audio. \n\nHe should be stripped of his office because of this “behind closed doors” dealing. He’s completely in the pocket of his financiers, and has no desire to improve this country (which is his job).",
            "title_similarity": "0.4636173",
            "sentiment_compound": 0.7537
        },
        {
            "id": "h1zri8t",
            "score": 32,
            "text": "Lieberman. Figures.\n\n&#x200B;\n\nSo... how IS that bipartisanship working for you, Joe?",
            "title_similarity": "0.5526279",
            "sentiment_compound": 0.0
        },
        {
            "id": "h204q4s",
            "score": 33,
            "text": "Why am I not surprised that Lieberman is involved. Whenever the Democrats have a chance to bake the metaphorical cake of victory and good governance, he literally sticks his dick in it & sides with Republicans. Every. Single. Time.",
            "title_similarity": "0.53180516",
            "sentiment_compound": -0.017
        },
        {
            "id": "h2050t6",
            "score": 11,
            "text": "Fuck Joe Lieberman.",
            "title_similarity": "0.1935223",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1zoaw4",
            "score": 11,
            "text": "using dark money to sink a bill that would end dark money, this is so shocking to me... also, I guess I don't need to give any money to Republicans because they're already in their pocket",
            "title_similarity": "0.39930016",
            "sentiment_compound": -0.541
        },
        {
            "id": "h20grq6",
            "score": 15,
            "text": "I hate this fucking country.",
            "title_similarity": "0.037170514",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h1zotj1",
            "score": 43,
            "text": "this is a very good opportunity for Democrats to let everyone know about the dark money provisions in the for the people act.. this phone call needs to be everywhere because it also implicates the Republicans",
            "title_similarity": "0.49001592",
            "sentiment_compound": 0.7408
        },
        {
            "id": "h20awe6",
            "score": -18,
            "text": "Seeing liberals foam at the mouth and going after Manchin just makes me happy, haha",
            "title_similarity": "0.40947887",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h211a7l",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.030071491"
        },
        {
            "id": "h1zokkm",
            "score": 46,
            "text": "Corporatocracy in action.\n\nIt hurts.",
            "title_similarity": "0.2550745",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1zsyik",
            "score": 19,
            "text": "\"This nation, under Corporations, shall have a new birth of freedom - and that government of the corporations, by the corporations, for the corporations, shall never perish from the earth.\"",
            "title_similarity": "0.39520574",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h201nmu",
            "score": 20,
            "text": "Just brazen corruption, pieces of shit like Manchin want you to believe we live in a representative democracy which is clearly a massive fucking joke. How does Manchin represent his voters when he stands/votes directly against what his constituents support? Calls to his corrupt billionaire slave masters are his real constituents.",
            "title_similarity": "0.5622618",
            "sentiment_compound": 0.7264
        },
        {
            "id": "h1zm3rt",
            "score": 20,
            "text": "yeah, but is he capable of embarrassment? because Republicans brag about it",
            "title_similarity": "0.50026214",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h20kdd6",
            "score": 20,
            "text": "This needs to stop. Lobbying is killing our country.",
            "title_similarity": "0.25487098",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h2070ze",
            "score": 62,
            "text": "Right here's your \"top secret cabal running the United States.\" A bunch of billionaires paying off Manchin to preserve the filibuster so they can keep their grotesque tax cuts.\n\nNothing more, nothing less. Pure graft.",
            "title_similarity": "0.6833489",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1zuz1a",
            "score": 30,
            "text": "Interesting comments about the filibuster in there...so he is open to amending it...or, at least, he's open to threatening to amend it to get donors to force Republicans to play ball.\n\nI guess at the very least he is trying to get some semblance of bipartisanship, vs Siema who screams \"BIPARTISANSHIP!\" and then fucks off to nowhere.",
            "title_similarity": "0.56969655",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h1zngqa",
            "score": 1592,
            "text": "What’s funny about this is over the last few months some people around here have been saying Manchin is a shill. And every time you say  it there’s people who come running to defend him. \n\nLook at that conversation. Joe Manchin is trying to get republicans to help him so they can keep the filibuster to protect his billionaire donors. What’s that if not a shill?",
            "title_similarity": "0.68968254",
            "sentiment_compound": 0.802
        },
        {
            "id": "h201okt",
            "score": 78,
            "text": "Hey where are all those dick farmers who said Manchin has always supported the filibuster and isn't getting paid? I want you to listen to this and then never post on the internet again.",
            "title_similarity": "0.44736868",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h1zsyuf",
            "score": 42,
            "text": "We desperately need a complete overhaul of our campaign finance system.",
            "title_similarity": "0.39437768",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1zvlrx",
            "score": 104,
            "text": "“The call included several billionaire investors and corporate executives, among them Louis Bacon, chief executive of Moore Capital Management; Kenneth D. Tuchman, founder of global outsourcing company TeleTech; and Howard Marks, the head of Oaktree Capital, one of the largest private equity firms in the country. The Zoom participant log included a dial-in from Tudor Investment Corporation, the hedge fund founded by billionaire Paul Tudor Jones. Also present was a roster of heavy-hitting political influencers, including Republican consultant Ron Christie and Lieberman, who serves as a representative of No Labels and now advises corporate interests.\n\nThe meeting was led by Nancy Jacobson, the co-founder of No Labels.\n\nThe wide-ranging conversation went into depth on the fate of the filibuster, infrastructure negotiations, and the failed effort to create a bipartisan commission to explore the January 6 storming of the U.S. Capitol, and offers a frank glimpse into the thinking of the conservative Democrat who holds the party’s fate in his hands.\n\nManchin told the assembled donors that he needed help flipping a handful of Republicans from no to yes on the January 6 commission in order to strip the “far left” of their best argument against the filibuster. The filibuster is a critical priority for the donors on the call, as it bottles up progressive legislation that would hit their bottom lines.”",
            "title_similarity": "0.78116035",
            "sentiment_compound": -0.607
        },
        {
            "id": "h1zn5ii",
            "score": 42,
            "text": "That reads an awful lot like \"business as usual.\"",
            "title_similarity": "0.37652713",
            "sentiment_compound": -0.128
        },
        {
            "id": "h1zop16",
            "score": 1162,
            "text": "As the article points out, bits of Manchin’s conversation border on illegality. If dems want him to flip on the filibuster, they should drop the carrots and start threatening him with sticks, bring this shit to court and sit him down in front of a judge to explain himself. Fuck this guy it’s time to play hardball.",
            "title_similarity": "0.43643135",
            "sentiment_compound": -0.8898
        },
        {
            "id": "h206dww",
            "score": 456,
            "text": "Get money out of politics. You should get your salary, and if you take money from anywhere else, you go to jail. Plain and simple.",
            "title_similarity": "0.4325297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zn8mb",
            "score": 194,
            "text": "Always follow the money.",
            "title_similarity": "0.26370478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zu3pl",
            "score": 54,
            "text": "Overturn Citizens United, implement rank choice voting. Stop billionaires from buying elections.",
            "title_similarity": "0.54940087",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1zndqy",
            "score": 630,
            "text": "[removed]",
            "title_similarity": "0.030071491"
        },
        {
            "id": "h1zomkv",
            "score": 234,
            "text": ">...Manchin said that he was prepared to specify his objections to S. 1, the [For the People Act](https://theintercept.com/2021/02/14/democracy-voting-campaign-finance-hr1/). In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility. He also opposed a provision in the bill that restricted a state’s ability to purge voter rolls, which he said would make the rolls less reliable. And he expressed reservations related to some of the campaign finance reform provisions, arguing they needed to apply equally to labor and business.\n\n>...\n\n>Those specific objections, notably, were absent from a second Charleston Gazette-Mail opinion column written by Manchin last week, stating his opposition to the For the People Act. In the piece, Manchin argued that the bill was done in a “partisan manner” and that he objected to such a sweeping bill that is “solely supported by one party.”\n\n>The column made no mention of Manchin’s specific concerns about preserving the ability to purge voter rolls and same-day registration — the objections that were given to No Labels and its audience of wealthy donors.\n\nFirst of all,\n\n>In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations\n\nPass. A. Motherfucking. Infrastructure. Bill.\n\nSecondly,\n\n>He also opposed a provision in the bill that restricted a state’s ability to purge voter rolls\n\nThis is 100% going to be used to make it harder for non-white and poor people to vote, and there is a 100% chance Manchin knows that and that's just a compromise he's willing to make because, hey, if you start trying to fight all the small town, good ol' boy corruption you're never going to get elected in West Virginia.\n\nLastly,\n\n>The column made no mention of Manchin’s specific concerns about preserving the ability to purge voter rolls and same-day registration — the objections that were given to No Labels and its audience of wealthy donors.\n\nFuck everything about lawmakers who tell us plebs one thing and then tell their wealthy friends something else",
            "title_similarity": "0.46585143",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1zmlxg",
            "score": 151,
            "text": "All politicians meetings and dealing should be made available for public viewing unless it is a national security issue to be honest.",
            "title_similarity": "0.46178693",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h1ztlw9",
            "score": 290,
            "text": "> The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money **to conservative Democrats and moderate Republicans.**\n\nPretty much says it all right there. These are the types of organizations that exist purely to advance the corporate interest...they don't give a fuck which party they help get elected as long as those politicians will do what's necessary to perpetuate the anarcho-capitalist status quo.",
            "title_similarity": "0.6628907",
            "sentiment_compound": 0.8641
        },
        {
            "id": "h1zpi0w",
            "score": 82,
            "text": "\"Come on guys.  We gotta at least give them this meaningless whitewash.  Otherwise it's gonna be way harder to keep people as poor as we're keeping them.\"  US politics in a nutshell.",
            "title_similarity": "0.35238186",
            "sentiment_compound": -0.7488
        },
        {
            "id": "h200xy4",
            "score": 217,
            "text": ">Manchin told the donors he hoped to make another run at it to prove that comity is not lost. \n\n\"We have to have a vote on this again so we can prove bipartisanship still exists\" is just and admission that bipartisanship is dead ***today***.\n\n>He noted that Sen. Pat Toomey, a Pennsylvania Republican who missed the vote, would have voted for it had he been there\n\nBut he wasn't, so he didn't.  If he really wanted to vote yes on this, he would have damn well made sure he managed to get to work and actually do his job.\n\n>It just really emboldens the far left saying, ‘I told you, how’s that bipartisan working for you now, Joe?’”\n\nWell ... how is that bipartisanship working for you Joe?  Seems to me you can't even get Republicans to agree that it's important that they show up at the office.",
            "title_similarity": "0.51814544",
            "sentiment_compound": 0.8831
        },
        {
            "id": "h1znoof",
            "score": 545,
            "text": "Typical: Majority of voters express their concerns, and at best they might receive a form letter that says nothing. Big donors get immediate attention and personal assurance of actions on their behalf.\n\nAgain, \"we have the best government that money can buy\".",
            "title_similarity": "0.588941",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h1zp6t8",
            "score": 1094,
            "text": "\"There’s class warfare, all right, but it’s my class, the rich class, that’s making war, and we’re winning.\" - Warren Buffet",
            "title_similarity": "0.48181003",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h1zuioy",
            "score": 1105,
            "text": "West Virginia and Kentucky are holding the country hostage. Holy fucking shit.",
            "title_similarity": "0.28904387",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h1zmwil",
            "score": 13883,
            "text": "\"*The filibuster is a critical priority for the donors on the call, as it bottles up progressive legislation that would hit their bottom lines.*\"\n\nF**K America, we need new yachts.",
            "title_similarity": "0.5558591",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h1zmxpt",
            "score": 4937,
            "text": "It’s incredible that such brazen corporate pandering in this country is considered legitimate politics.",
            "title_similarity": "0.5119558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zmg1x",
            "score": 5403,
            "text": ">Manchin told the assembled donors that he needed help flipping a handful of Republicans from no to yes on the January 6 commission in order to strip the “far left” of their best argument against the filibuster. The filibuster is a critical priority for the donors on the call, as it bottles up progressive legislation that would hit their bottom lines.\n\n>When it came to Sen. Roy Blunt, a moderate Missouri Republican who voted no on the commission, Manchin offered a creative solution. **“Roy Blunt is a great, just a good friend of mine, a great guy,” Manchin said. “Roy is retiring. If some of you all who might be working with Roy in his next life could tell him, that’d be nice and it’d help our country. That would be very good to get him to change his vote.** And we’re going to have another vote on this thing. That’ll give me one more shot at it.”\n\n>Regarding Blunt, Manchin appears to be suggesting — without, perhaps, quite explicitly saying so — that the wealthy executives on the call could dangle future financial opportunities in front of the outgoing senator while lobbying him to change his vote. **Senate ethics rules forbid future job negotiations if they create a conflict of interest or present even the appearance of a conflict of interest. Manchin, notably, doesn’t suggest that the donors discuss a job, but rather says that people who Blunt may later be working with would be likely to have significant influence, reflective of the way future job prospects can shape the legislative process even when unspoken.**",
            "title_similarity": "0.65671504",
            "sentiment_compound": 0.9619
        },
        {
            "id": "h1zmed8",
            "score": 3365,
            "text": "> Roy is retiring. **If some of you all who might be working with Roy in his next life could tell him**, that'd be nice and it'd help our country\"\n\nHey, future bosses of Roy! Tell him what to do!! \n\n... ... ... Democracy is fine... We have no issues with revolving door politicians...",
            "title_similarity": "0.53689694",
            "sentiment_compound": 0.7163
        },
        {
            "id": "h1zqrdz",
            "score": 6397,
            "text": ">The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money to conservative Democrats and moderate Republicans.\n\nLieberman, that guy is always showing up like a bad penny.",
            "title_similarity": "0.71215487",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h200yjn",
            "score": 10423,
            "text": "> “What I’m asking for, I need to go back, I need to find three more Republican, good Republican senators that will vote for the commission. So at least we can tamp down where people say, ‘Well, Republicans won’t even do the simple lift, common sense of basically voting to do a commission that was truly bipartisan.’ It just really emboldens the far left saying, ‘I told you, how’s that bipartisan working for you now, Joe?’”\n\n\nWell... how’s that bipartisanship working out for you now, Joe?",
            "title_similarity": "0.57180345",
            "sentiment_compound": 0.8195
        },
        {
            "id": "h1zq22z",
            "score": 2,
            "text": "Stick it into the pile of shit that will piss you off, but he'll never see consequences over.",
            "title_similarity": "0.2472958",
            "sentiment_compound": -0.4854
        },
        {
            "id": "h1zs49l",
            "score": 21,
            "text": "If it wasn’t so sickening it’d almost be humorous how blatantly obvious the corruption is here and all over the government; and yet just NOTHIN’ WE CAN DO, I guess.",
            "title_similarity": "0.41832823",
            "sentiment_compound": -0.4669
        },
        {
            "id": "h1zsgfe",
            "score": 1,
            "text": "It’s time to end West Virginia as a state",
            "title_similarity": "0.23678027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zt0tr",
            "score": 19,
            "text": "Billionaire class has been driving an emotional ideological wedge between the citizenry in order to keep their focus and anger directed away from their pillaging of the economy, rights and ultimately the political process.",
            "title_similarity": "0.45453912",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h1zv16y",
            "score": 1,
            "text": "Does he have a Dem primary yet",
            "title_similarity": "0.39026695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zv2rm",
            "score": 2,
            "text": "Billionaires - \"I dont like this bill\"\nManchin - \"Say less\"",
            "title_similarity": "0.43791908",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h1zvefn",
            "score": 2,
            "text": "Interesting twist huh??",
            "title_similarity": "0.16525352",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h1zvmgt",
            "score": 2,
            "text": "Of the people, by the people, for the billionaires... wait a second.",
            "title_similarity": "0.59517777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1zwrc1",
            "score": 28,
            "text": "Joe fuckin' Leiberman. Of course. What a piece of shit.",
            "title_similarity": "0.22573094",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h1zxgp9",
            "score": 18,
            "text": "Fucking hell. This is all so fucking stupid.",
            "title_similarity": "-0.018490383",
            "sentiment_compound": -0.8709
        },
        {
            "id": "h1zxx60",
            "score": 7,
            "text": ">>The call included several billionaire investors and corporate executives, among them Louis Bacon, chief executive of Moore Capital Management; Kenneth D. Tuchman, founder of global outsourcing company TeleTech; and Howard Marks, the head of Oaktree Capital, one of the largest private equity firms in the country. The Zoom participant log included a dial-in from Tudor Investment Corporation, the hedge fund founded by billionaire Paul Tudor Jones. Also present was a roster of heavy-hitting political influencers, including Republican consultant Ron Christie and Lieberman, who serves as a representative of No Labels and now advises corporate interests.\n\n>The meeting was led by Nancy Jacobson, the co-founder of No Labels.",
            "title_similarity": "0.7791553",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1zzkuz",
            "score": 36,
            "text": "We should figure out how to boycott these companies, find out who they fund, or own, and boycott those companies.  They only listen to money, we should be able to figure out how to make them pay for  this, and the Senate need to go on the floor and announce WHY Manchin won't get rid of the filibuster, get it in the record.",
            "title_similarity": "0.50655",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h200235",
            "score": 9,
            "text": "Maybe we can use this to force Senator Blunt’s immediate resignation?",
            "title_similarity": "0.48138458",
            "sentiment_compound": -0.296
        },
        {
            "id": "h20113u",
            "score": 1,
            "text": "…….\n\nNow do Kyrsten Sinema",
            "title_similarity": "0.27341565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2015im",
            "score": 1,
            "text": "There's gambling in Casablanca. I'm shock...oh, I give up.\n\nEdit for funny",
            "title_similarity": "0.4316583",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h201utl",
            "score": 3,
            "text": "I'm genuinely surprised to find that Manchin is trying to pull Republicans to his position. He's seen up close and personally that they'll negotiate forever and then not one of them will vote for the actual bill (but then try to brag about all the good it's doing for their district/state). \n\nThe Republicans have shown no interest in governing, and even less interest in doing what's needed for the vast majority of the people, so just do what parliaments around the world do and pass your agenda without regard to what the minority will vote for.",
            "title_similarity": "0.50808287",
            "sentiment_compound": 0.6849
        },
        {
            "id": "h202xpi",
            "score": 2,
            "text": "Who's angry? I am!",
            "title_similarity": "0.09898472",
            "sentiment_compound": -0.5562
        },
        {
            "id": "h203072",
            "score": 2,
            "text": "Kochsucker",
            "title_similarity": "0.18851894",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20372c",
            "score": 1,
            "text": "The founding fathers have to be rolling at the thought of money being able to buy votes. I doubt that's how they intended the country to be run",
            "title_similarity": "0.5223979",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h203f8j",
            "score": 1,
            "text": "As if the Senator from MNBA has the stones to criticize President Manchin.",
            "title_similarity": "0.5640104",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h204212",
            "score": 2,
            "text": "It is well past time for him and many others to have their entire families investigated by law enforcement.  This is how you attack the Trump criminal organization, it should be no different for this POS.",
            "title_similarity": "0.51606935",
            "sentiment_compound": -0.765
        },
        {
            "id": "h205hyu",
            "score": 2,
            "text": "Republicans constantly attack Democrats and blindly defend their own, even with Jewish Space Lasers. Democrats constantly attack Republicans and themselves. It’s no surprise nothing ever gets done. The one party interested in doing anything attacks itself in private for another quick buck.",
            "title_similarity": "0.32070547",
            "sentiment_compound": -0.672
        },
        {
            "id": "h205iv2",
            "score": 3,
            "text": "I knew it. The billionaires bought Joe Manchin",
            "title_similarity": "0.54841006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h205j3x",
            "score": 3,
            "text": "Joe Manchin is a segregationist.",
            "title_similarity": "0.2686545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h205rs0",
            "score": 3,
            "text": "\\>The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money to conservative Democrats and moderate Republicans. Among the gathering’s newsworthy revelations: Manchin described an openness to filibuster reform at odds with his most recent position that will buoy some Democrats’ hopes for enacting their agenda.\n\nLieberman was always such a self dealing douchewad.\n\nGod, we need to get $$$ out of politics.",
            "title_similarity": "0.70832765",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h206utw",
            "score": 2,
            "text": "What's the excuse *this* time, Manchin Bros?",
            "title_similarity": "0.4081332",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h206v64",
            "score": 1,
            "text": "The leaked tapes, constant front page media coverage of his actions and back room dealings, constant negative attention for Manchin like he's never seen before.  I get the strong impression the establishment is sending a message to Manchin that his seat isn't as secure as he thinks it is.",
            "title_similarity": "0.45358253",
            "sentiment_compound": -0.0864
        },
        {
            "id": "h206vfq",
            "score": 6,
            "text": "Or GW. Who ever the first one is lol. I was raised to be conservative because it was drilled into my head. Then I joined the military and matured enough to think for myself. Especially during my travels to Sweden Arsus Denmark and karlsocorona (spelling) Smeden. I noticed there were no ghettos or poor sides of town. Everyone had a college degree, min wage was actually a living wage. No one was sick because they all had insurance. No people were homeless or dying because they couldn't afford medication or care from a Dr. The cities were very clean and hardly no crimes. That's when I realized regan-nomics didn't work. The wealthy paid their fair share of taxes. Corrupt bankers were held to high standards of the law. That's when I realized I had been fooled. Then with Trump. The hatred from his supporters and those freak shows involved with Q and what they believe along with the lies or conspiracy theories was just too much.",
            "title_similarity": "0.4030292",
            "sentiment_compound": -0.8711
        },
        {
            "id": "h206vqu",
            "score": 3,
            "text": "Fuck this guy",
            "title_similarity": "0.059456047",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h207l72",
            "score": 2,
            "text": "I'm absolutely shocked that Manchin is just one of many politicians on Capitol Hill who cares more about his billionaire donors than voters",
            "title_similarity": "0.6288202",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h207mev",
            "score": 3,
            "text": ">“Think about joining the House: You’re there for 730 days, unless you pick the leap year, and maybe you get 731,” said Bursky. “And for the vast majority, those days, you’re spending four hours on the telephone, dialing for dollars. And so what this does — aside from sending the very strong message that there are folks who will have your back if you take tough votes that by partisan nature that may not be popular within your party — it also in real life frees them to do more work, because it’s spending less time raising those funds.”\n\nThis is a good reminder that the psychos that can do this without wanting to kill themselves is one reason why US government is shit, and also the incentive structure that the public perceives a politician labors under might be completely wrong.",
            "title_similarity": "0.5991396",
            "sentiment_compound": 0.7786
        },
        {
            "id": "h207pfr",
            "score": 1,
            "text": ">Well, Republicans won’t even do the simple lift, common sense of basically voting to do a commission that was truly bipartisan.’ It just really emboldens the far left saying, ‘I told you, how’s that bipartisan working for you now, Joe?’”\n\nHoly shit, he actually cares.  It is is pissing him off.\n\nLet us get ads in his state pointing out how useless it is to get bipartisanship and point at every hypocritical instance where it went nowhere.",
            "title_similarity": "0.5122571",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h207sjd",
            "score": 3,
            "text": "You knew it had to be bribery; Manchin is not smart enough to have principled objections. I hope more evidence comes out.",
            "title_similarity": "0.4246413",
            "sentiment_compound": 0.1635
        },
        {
            "id": "h207t13",
            "score": 3,
            "text": "Our government is a joke",
            "title_similarity": "0.3215537",
            "sentiment_compound": 0.296
        },
        {
            "id": "h207t2n",
            "score": 3,
            "text": "What the fuck does this motherfucker even NEED billionaire donors for at this point? He's old and from what I've heard he's not even planning to run again?!",
            "title_similarity": "0.51021165",
            "sentiment_compound": -0.8674
        },
        {
            "id": "h207w1i",
            "score": 2,
            "text": "Okay so what are we going to do about this?",
            "title_similarity": "0.108041994",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h207yyr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h208bem",
            "score": 3,
            "text": ">It just really emboldens the far left saying, ‘I told you, how’s that bipartisan working for you now, Joe?’”\n\nBecause it's true. Manchin's a conservative, and in that he believes in nothing beyond proving these people wrong at all costs well past the point where he can tell you why he's opposed to them.\n\nHow inoculated is Manchin from what's going on in his country that he thinks the Republican's reputation can be saved with a token gesture of \"bipartisanship?\" Even if he got their votes, all that would prove to the public is that those three or four guys broke rank from the party, not that the party itself accomplished anything. More realistically, they'd believe he and they are full of shit even *without* this leak to prove it.",
            "title_similarity": "0.5280362",
            "sentiment_compound": 0.4934
        },
        {
            "id": "h208inj",
            "score": 3,
            "text": "You know, I'm starting to think this Joe Luncheon guy is kinda suspect.",
            "title_similarity": "0.38973892",
            "sentiment_compound": -0.228
        },
        {
            "id": "h208ixw",
            "score": 2,
            "text": "This should be impeachable and criminal. Good God.",
            "title_similarity": "0.097823955",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h208u3g",
            "score": 3,
            "text": "I knew this shit happens, but it still turns my stomach. Literally.",
            "title_similarity": "0.2759293",
            "sentiment_compound": -0.3869
        },
        {
            "id": "h208vtb",
            "score": 1,
            "text": "At this point I don’t give a shit. This man is the only thing preventing a 1 party state, federalized elections andfixed Supreme Court",
            "title_similarity": "0.3962648",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h208weo",
            "score": 3,
            "text": "Joe Manchin is a complete turd…",
            "title_similarity": "0.1739449",
            "sentiment_compound": 0.0
        },
        {
            "id": "h208xyy",
            "score": 1,
            "text": "Caught in 4k",
            "title_similarity": "0.37500274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2090fb",
            "score": 1,
            "text": "How is this not soliciting a bribe?",
            "title_similarity": "0.23121849",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h2091fx",
            "score": 3,
            "text": "The constitution is clear, to pass a bill it’s a 50% or greater vote. Note 60% is not the same as 50%. The constitution does allow the senate to do business anyway they want…\n\nBut when the conventions actually conflict with the constitution? This should not be allowed.",
            "title_similarity": "0.49834082",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h2097hg",
            "score": 5,
            "text": "For fuck's sake, we need to get money out of politics.",
            "title_similarity": "0.33835414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h209fu0",
            "score": 1,
            "text": "Citizen United FTW",
            "title_similarity": "0.28584528",
            "sentiment_compound": 0.7603
        },
        {
            "id": "h209hx1",
            "score": 3,
            "text": "This is why we can’t have democracy, people like him.",
            "title_similarity": "0.29192504",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h209hzk",
            "score": 4,
            "text": "They should do…oh nevermind. Like they actually care.",
            "title_similarity": "0.09025683",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h209ijp",
            "score": 1,
            "text": "Nothing will fundamentally change as long as politicians listen to their donors first and constituents last.",
            "title_similarity": "0.423726",
            "sentiment_compound": 0.0
        },
        {
            "id": "h209j0z",
            "score": 1,
            "text": "Of course God Damned Lieberman is involved with these degenerates, literally scheming to prevent progress from happening.",
            "title_similarity": "0.3158642",
            "sentiment_compound": 0.34
        },
        {
            "id": "h209jae",
            "score": 2,
            "text": "Can we start firing some of these dinkweeds?",
            "title_similarity": "0.31067404",
            "sentiment_compound": -0.34
        },
        {
            "id": "h209kun",
            "score": 3,
            "text": "Fuuuck you joe manchin you stale turd",
            "title_similarity": "0.18610328",
            "sentiment_compound": 0.0
        },
        {
            "id": "h209lje",
            "score": 1,
            "text": "So the people voted him in and the rich get to make the decisions for him?\n\nThis stuff has got to stop...",
            "title_similarity": "0.56084645",
            "sentiment_compound": 0.34
        },
        {
            "id": "h209mtn",
            "score": 13,
            "text": "It's wild to me that even a Democratic senator calls the progressive cause 'the far left' as if there's any kind of equivalency between progressives and the far right.\n\nI wonder what they will call the actual far left when it finally presents itself after idiots like Manchin keep blocking moderate liberal reforms. Like, keep the people down for long enough and you'll eventually see the fringe of the left do the same things the far right is already doing.",
            "title_similarity": "0.5443254",
            "sentiment_compound": 0.34
        },
        {
            "id": "h209q00",
            "score": 4,
            "text": "What we gonna do about it?!",
            "title_similarity": "0.13895787",
            "sentiment_compound": 0.0
        },
        {
            "id": "h209qkk",
            "score": 17,
            "text": "This sort of stuff really makes you feel like the little guys will _always_ lose in America.  \nThere should be no billionaires. Period.\nMoney in politics is bribery.\nLove how terrified these guys are of progressives.  \nFuck em all.",
            "title_similarity": "0.50146234",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h209xwu",
            "score": 1,
            "text": "If there was any justice in this world this would be grounds for immediate removal and imprisonment. But of course they wrote the rules that say it's totally cool, totally legal.",
            "title_similarity": "0.32417208",
            "sentiment_compound": 0.8006
        },
        {
            "id": "h20a6gb",
            "score": 1,
            "text": "\"Dealmaking\" is a real euphemistic way of saying \"blatant corruption\"",
            "title_similarity": "0.40467563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20a9bz",
            "score": 3,
            "text": "If I believed there was a cabal of elites that secretly run the government through back channels this is the type of thing I would rally behind. However, they are currently busy trying to prove vaccines make you magnetic",
            "title_similarity": "0.5830294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20a9w2",
            "score": 1,
            "text": "Throw everyone in jail",
            "title_similarity": "0.18104988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20ag08",
            "score": 2,
            "text": "Could a case be brought to the Supreme Court that the filibuster is unconstitutional? Don’t get me wrong I do understand that the constitution does let the senate do business any way you want.\n\nBut the constitution is also clear it takes a 50% or simple majority to pass a bill. If the filibuster just has the net effect of making it 60%, from a pragmatic point of view, it changes what it takes to pass a bill.",
            "title_similarity": "0.5139301",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h20aijx",
            "score": 2,
            "text": "With democrats like this who needs republicans?",
            "title_similarity": "0.33870363",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h20akha",
            "score": 2,
            "text": "Now watch dems focus on how this was leaked.",
            "title_similarity": "0.48287702",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h20aklj",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h20apdk",
            "score": 1,
            "text": "You know Manchin is just going to retire and be replaced with some Republican?",
            "title_similarity": "0.5142185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20ar6t",
            "score": 1,
            "text": "Lesson for the day: Be careful what you ask for.... Joe Manchin wanted to be a deal maker now he's exposed as a classic back room billionaire flunky  grifiting for bucks while the state he represents ranks at the bottom of the heap. The only person Joe Manchin helps on a steady basis appears to be himself.",
            "title_similarity": "0.63668025",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h20aske",
            "score": 3,
            "text": "Need to end the financial incentives to operate contrary to constituents' interests, including, if necessary banning forbidding elected officials to work for any companies who lobbied them while in office.",
            "title_similarity": "0.41138798",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h20awin",
            "score": 30,
            "text": "Wow this is incredibly revealing. So it turns out that people were right. Manchin is bought and paid for and works with people who are bought and paid for. He knows this shit is crucial and he knows that the system is wrong, but he does it anyways. He is a greedy sleazebag and he does not belong with the dems or in congress.",
            "title_similarity": "0.45559996",
            "sentiment_compound": -0.6399
        },
        {
            "id": "h20awjh",
            "score": 1,
            "text": "Wonder who leaked the call",
            "title_similarity": "0.42088273",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h20ax1a",
            "score": 1,
            "text": "Surely he’s going to lose the next election. He’s shunned a portion of Democrats and Republicans have gone further right. His balancing act won’t work will it?",
            "title_similarity": "0.43299812",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h20azop",
            "score": 3,
            "text": "Do we need any other proof that is not actually about bi-partisanship but about yachtsmenship?",
            "title_similarity": "0.3165486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20b8wa",
            "score": 9,
            "text": "So people who make the laws can be \"swayed\" by corporations and lobbyists; however, a person waiting in line to vote for these people (and others) can't receive food or water because that could influence their vote? Got it. Yay democracy!",
            "title_similarity": "0.57931465",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h20bc9h",
            "score": 1,
            "text": "What a crook.",
            "title_similarity": "0.12137421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20bcwq",
            "score": 1,
            "text": "So now America finally has physical (or audio) proof that Manchin is a GOP senator in disguise and betraying his oath for money.",
            "title_similarity": "0.7122593",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h20bdrh",
            "score": 1,
            "text": "If I’m a Republican and I change my vote on the Jan 6th commission, I’ll now be accused of bribery.  Meanwhile, Manchin can no longer pretend to be just looking out for the interests of West Virginians.  He’s playing to the wealthy donors, just like the progressive caucus suggested.  It’s all out in the open.  \n\nIf he flips, and votes with his party, he’s spineless.  If he stays the course, he’s a shill. He’s fucked. \n\nThis is a huge win for Mitch McConnell.",
            "title_similarity": "0.659146",
            "sentiment_compound": 0.7962
        },
        {
            "id": "h20bel9",
            "score": 1,
            "text": "Am I the only one who doesn't think this is particularly surprising or damning? This is just realpolitik and I can guarantee you these calls happen every day with every member of Congress and the Senate.\n\nThis just proves Manchin isn't as stupid or ignorant as people think. He's trying to convince lobbyists to give him some political cover by hurting Republicans in their pocketbooks to try to force their hand and vote for legislation. That way, his fantasy of bipartisanship, which he probably realizes is bullshit, might actually happen often enough for him to be vindicated.\n\nSad thing is, this could actually work. If these R Senators had their lobbying jobs threatened they might actually make some moves. Doubt it, though.",
            "title_similarity": "0.6585632",
            "sentiment_compound": -0.718
        },
        {
            "id": "h20bggp",
            "score": 1,
            "text": "If you even threaten or insinuate in any ki d of way that you would use filibuster or delay something. You should simply lose the right to do so. Because you'd have admitted that your goal would be to delay or hinder the work of thr senate as opposed to asking legitimate questions.",
            "title_similarity": "0.33709556",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h20bmby",
            "score": 2,
            "text": "Some day I would like to hear the news that a politician  is demonstrably corrupt and theres something, ANYTHING we can legally do about it.",
            "title_similarity": "0.559886",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h20bvyy",
            "score": 3,
            "text": "Fuck Joe Manchin & fuck hedge fund billionaires.",
            "title_similarity": "0.58562195",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h20bvzt",
            "score": 1,
            "text": "> Regarding Blunt, Manchin appears to be suggesting — without, perhaps, quite explicitly saying so — that the wealthy executives on the call could dangle future financial opportunities in front of the outgoing senator while lobbying him to change his vote.   \n   \nUhhhh I want the investigation into Jan 6th as much as the next guy, but I don’t think we should be literally bribing senators in order to get it done....",
            "title_similarity": "0.66135013",
            "sentiment_compound": 0.4854
        },
        {
            "id": "h20bw7y",
            "score": 1,
            "text": "JFC, has he always been this much of a piece of shit? Or does someone in the GOP have something tasty on him and they’re making him dance?",
            "title_similarity": "0.34821048",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h20bzhn",
            "score": 2,
            "text": "A large chunk of this conversation deserves a look by the DOJ.",
            "title_similarity": "0.3921079",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20cf72",
            "score": 1,
            "text": "I’ll be glad when all these old rich white politicians are pushing up daisies…..or feeding the pigs",
            "title_similarity": "0.4105664",
            "sentiment_compound": 0.765
        },
        {
            "id": "h20chxh",
            "score": 3,
            "text": "Joe Lieberman? JOE LIEBERMAN?!? Thrilled he found a way to continue to fuck over Americans for his corporate overlords after leaving the senate. Great job.",
            "title_similarity": "0.5968734",
            "sentiment_compound": 0.6522
        },
        {
            "id": "h20co05",
            "score": 1,
            "text": "I hope he is happy with his 70 pieces of silver.",
            "title_similarity": "0.38845578",
            "sentiment_compound": 0.765
        },
        {
            "id": "h20cy8g",
            "score": 2,
            "text": "Does Manchin ever have conference calls with constituents? Any Senator for that matter?",
            "title_similarity": "0.6165266",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h20d7dn",
            "score": 3,
            "text": ">“**What I’m asking for, I need to go back, I need to find three more Republican, good Republican senators that will vote for the commission.** So at least we can tamp down where people say, ‘Well, Republicans won’t even do the simple lift, common sense of basically voting to do a commission that was truly bipartisan.’ It just really emboldens the far left saying, ‘I told you, how’s that bipartisan working for you now, Joe?’”\n\nLike Diogenes without a hint of irony.",
            "title_similarity": "0.57597625",
            "sentiment_compound": 0.8115
        },
        {
            "id": "h20de0z",
            "score": 1,
            "text": "Corrupt Senator Joe Manchin? If he were hypothetically to be removed from office, who would his replacement be handled. Obvi this isn't enough to boot him, but if there are still unreleased recordings that are more explicitly illegal?",
            "title_similarity": "0.5224822",
            "sentiment_compound": -0.7702
        },
        {
            "id": "h20de58",
            "score": 2,
            "text": "Well, there goes my remaining faith in American representative democracy...\n\nThis post needs to go to the front page. Every American needs to read this",
            "title_similarity": "0.47517085",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h20dev0",
            "score": 1,
            "text": "Real talk - can we impeach a senator cause this is just fucking brutal",
            "title_similarity": "0.40336448",
            "sentiment_compound": -0.659
        },
        {
            "id": "h20dho9",
            "score": 13,
            "text": "Pretty sure normal people call this corruption",
            "title_similarity": "0.25817132",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h20dobp",
            "score": 1,
            "text": "\"Nobody actually said nothin' about nothin'...except for all the everything that doesn't need to be said'.  Just sayin'...nobody said nothin'.\"\n\nThis is how the sausage gets made...they're all for sale.",
            "title_similarity": "0.29799733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20dt2v",
            "score": 2,
            "text": "We're fucked",
            "title_similarity": "0.021505572",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h20dw0m",
            "score": 1,
            "text": "What",
            "title_similarity": "0.0071674455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20e68l",
            "score": 2,
            "text": "And this is what’s wrong with our country. Politicians who don’t share American values.",
            "title_similarity": "0.3582327",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h20e6xl",
            "score": 1,
            "text": "Nothing will chamge until these people feel they aren't invincible.",
            "title_similarity": "0.25693202",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h20e79m",
            "score": 1,
            "text": "Gotta say we were too quick with applying the status quo Joe label to Biden not Manchin",
            "title_similarity": "0.34792498",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20e7t6",
            "score": 1,
            "text": "How does this not land you in prison?",
            "title_similarity": "0.31748784",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h20e9oa",
            "score": 1,
            "text": "It’s always been about the Up vs Down",
            "title_similarity": "0.19397414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20eicc",
            "score": 2,
            "text": "Money talks - nothing new here. Politicians being bought goes back as far as written history reaches.\n\nMy take is that I voted for Biden and his agenda, and now this Manchin fellow is holding back progress.\n\nI wouldn't cry if he was hit by a bus, but I think these southern states will always vote for these conservatives. I think one solution is for Democrats and Liberals to move to these states and change their demographics.\n\nOne plus would be that it would drive them nuts.\n\nI moved from Manhattan to a small town in PA, Trump flags *everywhere*, and I'm doing my bit.",
            "title_similarity": "0.60135794",
            "sentiment_compound": 0.417
        },
        {
            "id": "h20eieq",
            "score": 2,
            "text": "For the people that only bothered to read the headline:\n\nThe donors aren't telling Manchin what to do. Manchin is telling the donors what to do.",
            "title_similarity": "0.552687",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h20elq1",
            "score": 1,
            "text": "amerika. so land. so free.",
            "title_similarity": "0.118494295",
            "sentiment_compound": 0.6779
        },
        {
            "id": "h20embe",
            "score": 2,
            "text": "Pols oughta have to wear cams like police officers. GD the naked corruption is just unbelievable.",
            "title_similarity": "0.32489228",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h20emc9",
            "score": 1,
            "text": "There’s no way it’s legal to just be on a call with these billionaires, talking about paying out senators post-retirement in exchange for a vote on the Jan 6 commission that validates the filibuster’s existence so Manchin faces less pressure on economic issues. \n\nOf course these people will be jailed, because they’re breaking laws.\n\nObviously.",
            "title_similarity": "0.6024797",
            "sentiment_compound": -0.5279
        },
        {
            "id": "h20eq05",
            "score": 2,
            "text": "Sold to the highest bidder.",
            "title_similarity": "0.45469874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20et0m",
            "score": 2,
            "text": "And now that we have this information, nothing will happen.",
            "title_similarity": "0.14602697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20ett5",
            "score": 2,
            "text": "Bought and paid for",
            "title_similarity": "0.31386718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20evnx",
            "score": 1,
            "text": "Well he’s always been a piece of shit. Democrats are to blame that they’re stuck with corruptlican criminals, and garbage like manchin",
            "title_similarity": "0.3042551",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h20ewku",
            "score": 2,
            "text": "Obama saved Lieberman’s ass by endorsing him in the primary and he turned around and endorsed McCain.",
            "title_similarity": "0.49366271",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h20f3i7",
            "score": 1,
            "text": "Let’s not forget about Iraq.",
            "title_similarity": "0.30649933",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h20f6z2",
            "score": 1,
            "text": "<When it came to Sen. Roy Blunt, a moderate Missouri Republican who voted no on the commission, Manchin offered a creative solution. “Roy Blunt is a great, just a good friend of mine, a great guy,” Manchin said. “Roy is retiring. If some of you all who might be working with Roy in his next life could tell him, that’d be nice and it’d help our country. That would be very good to get him to change his vote. And we’re going to have another vote on this thing. That’ll give me one more shot at it.”\n>\n>Regarding Blunt, Manchin appears to be suggesting — without, perhaps, quite explicitly saying so — that the wealthy executives on the call could dangle future financial opportunities in front of the outgoing senator while lobbying him to change his vote. Senate ethics rules forbid future job negotiations if they create a conflict of interest or present even the appearance of a conflict of interest. Manchin, notably, doesn’t suggest that the donors discuss a job, but rather says that people who Blunt may later be working with would be likely to have significant influence, reflective of the way future job prospects can shape the legislative process even when unspoken.\n\nWell that's pretty slimy.",
            "title_similarity": "0.5683795",
            "sentiment_compound": 0.9768
        },
        {
            "id": "h20fen2",
            "score": 2,
            "text": "Lost in the pile on is the most explicit reform of filibuster that could be possible with Manchin. Silver lining to a turd sandwich.\n\nOpen to going to 55 votes or forcing the minority to hold the floor to keep the filibuster. Not enough but at least a baby step in the right direction.",
            "title_similarity": "0.46704432",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h20fhbg",
            "score": 1,
            "text": "The Filibuster is good for wealthy Americans. :(",
            "title_similarity": "0.56727636",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h20fm1s",
            "score": 1,
            "text": "Absolutely shocked",
            "title_similarity": "0.030764278",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h20fo5d",
            "score": 2,
            "text": "Joe Manchin - Aspiring Republican",
            "title_similarity": "0.46622753",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20fpq9",
            "score": 2,
            "text": "I am shocked, SHOCKED i tell you, that Joe Lieberman and Joe Manchin are running in the same circles, assisting Republicans.",
            "title_similarity": "0.5713683",
            "sentiment_compound": -0.6523
        },
        {
            "id": "h20fvpk",
            "score": 3,
            "text": "> The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money to conservative Democrats and moderate Republicans.\n\nI guess single-handedly torpedoing the public healthcare option in the original ACA wasn't good enough, he has to torpedo any kind of progress. Fuck Joe Lieberman.",
            "title_similarity": "0.6297185",
            "sentiment_compound": -0.4402
        },
        {
            "id": "h20g1s9",
            "score": 3,
            "text": "This is the only proof every citizen of this country needs to see the government serves the corporations not the people.",
            "title_similarity": "0.39795578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20g2jp",
            "score": 1,
            "text": "Fuck them all.",
            "title_similarity": "0.021968404",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20g34e",
            "score": 1,
            "text": "Wow. Pieces of human shit. Worthless humans.",
            "title_similarity": "0.0137292035",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h20g6lc",
            "score": 1,
            "text": "Can an MVP give a direct link to the audio?",
            "title_similarity": "0.34428507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20g7yz",
            "score": 1,
            "text": "Well thats not... Great",
            "title_similarity": "-0.0127153825",
            "sentiment_compound": -0.2946
        },
        {
            "id": "h20g8o2",
            "score": 1,
            "text": "Joe Manchin is such a piece of garbage",
            "title_similarity": "0.18018727",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20g90h",
            "score": 3,
            "text": "I have been saying for the last year that the establishment democrats don't want progressive voices, they want a move to the center, where lobbyists still control Washington and money flows fro0m the top down, not the bottom up.  That is why everyone backed Biden instead of Sanders, why Lincoln project (centrist republicans) backed Biden instead of trump.  The best outcome for them is stagnation, tax breaks for the wealthy, and a rising centrist party (democrats) that pushes away the progressive left and the imploding alt-right republican party.  My prediction; watch as Ranked Choice voting, which tends to elect safe, moderate centrists, gains traction as an alternative to a stymied SB1.",
            "title_similarity": "0.5948324",
            "sentiment_compound": 0.9551
        },
        {
            "id": "h20g9vu",
            "score": 2,
            "text": "Billionaires were on the call to discuss the effect of money in politics… Exhibit A; this call. Pretty sure zero of his constituents got an invite with a Zoom link.",
            "title_similarity": "0.7197057",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h20gf13",
            "score": 2,
            "text": "The phone call reveals that he actually supports the talking filibuster and the 41 to block idea.",
            "title_similarity": "0.48917836",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h20gjpn",
            "score": 1,
            "text": "Just a friendly reminder that you can reach WV's state senator at the following email:\n\ncommon_sense@manchin.senate.gov",
            "title_similarity": "0.6022054",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h20gjvu",
            "score": 2,
            "text": "Remember folks this is one of the good guys... I'm not even kidding, tahts how fucked we are.",
            "title_similarity": "0.2630934",
            "sentiment_compound": -0.4207
        },
        {
            "id": "h20gorf",
            "score": 1,
            "text": "This is evidence of bribery.",
            "title_similarity": "0.4085941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20gox3",
            "score": 2,
            "text": "I’ll not bother waiting to see if there are any consequences for this…",
            "title_similarity": "0.17261505",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h20gy1v",
            "score": 11,
            "text": "FUCKING DO SOMETHING.  I’m so furious of all this happening and nothing ever happening.",
            "title_similarity": "0.110734716",
            "sentiment_compound": -0.6948
        },
        {
            "id": "h20h1ci",
            "score": 3,
            "text": "Who is surprised???",
            "title_similarity": "0.081169166",
            "sentiment_compound": 0.3485
        },
        {
            "id": "h20h5wq",
            "score": 2,
            "text": "This should be punishable by a lengthy prison term for corruption.",
            "title_similarity": "0.35797602",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h20h94l",
            "score": 3,
            "text": "What happened to “FOR the people”? Our government has become for the corporations, and it’s unacceptable that they are controlling political decisions by influencing politicians with money. That should be illegal. Full stop. I’m so god damn sick of the way this country allows blatant bribery within the halls of Congress! Our founding fathers are rolling in their graves watching this fuckery.",
            "title_similarity": "0.54086614",
            "sentiment_compound": -0.9376
        },
        {
            "id": "h20ha6g",
            "score": 2,
            "text": "Why is there so much money in politics",
            "title_similarity": "0.4938428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20hdwk",
            "score": 3,
            "text": "Legalized corruption",
            "title_similarity": "0.33959293",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20hfik",
            "score": 2,
            "text": "This just proves (once again…) that billionaires should not exist in our modern society. We got rid of feudalism centuries ago and the current iteration is not that different.",
            "title_similarity": "0.47230905",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h20hfqp",
            "score": 1,
            "text": "I’ve already written to him twice. I suggest you all do too",
            "title_similarity": "0.37331256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20hmg8",
            "score": 2,
            "text": "It’s Liebermans all the way down",
            "title_similarity": "0.2146276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20hngi",
            "score": 3,
            "text": "The same people calling the left communists and socialists for wanting the government to work for us, will be ok with this type corruption",
            "title_similarity": "0.48375854",
            "sentiment_compound": 0.296
        },
        {
            "id": "h20ho7e",
            "score": 1,
            "text": "I find it funny that one guy can decide against the will of millions. He needs to be \"retired\" one way or the other. We need an armed revolution to clean house of these corporate shills.",
            "title_similarity": "0.6019542",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h20hovu",
            "score": 2,
            "text": "Go to congress.\nTake money from rich people.\nDo their bidding.\nLeave congress.\nTake money from rich people.\nGive money to congressmen.\nThey do your bidding.\nLoop.",
            "title_similarity": "0.7010498",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h20hshp",
            "score": 2,
            "text": "The whole Senate is a rotten cesspool",
            "title_similarity": "0.2430436",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h20i0tm",
            "score": 2,
            "text": "Disgusting.",
            "title_similarity": "-0.04635708",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h20i6c2",
            "score": 1,
            "text": "what a TRAITOR , that word is starting to lose its meaning since it seems not being one is more uncommon.",
            "title_similarity": "0.1779539",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h20i97d",
            "score": 2,
            "text": "For the life of it why is he still in the Democratic party?  It is not that WV going to do any favors for Democrats in mid-term or Presidential election.",
            "title_similarity": "0.36083043",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h20i9hk",
            "score": 2,
            "text": "Yes today's politicians are bought. No longer represent the people.",
            "title_similarity": "0.4768743",
            "sentiment_compound": 0.128
        },
        {
            "id": "h20ia18",
            "score": 4,
            "text": ">The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman\n\nThis fucking asshole again?  Amazing how he is still working against the American people even after leaving office.  Why can't he just fuck off already?",
            "title_similarity": "0.6323563",
            "sentiment_compound": 0.7247
        },
        {
            "id": "h20ic30",
            "score": 3,
            "text": "This is one man. One man is causing this. Wtf.",
            "title_similarity": "0.29004014",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h20ig26",
            "score": 3,
            "text": "If we were at all serious about standing up to the Manchins of the world, we’d be hiring private investigators to just comb through every little detail of their lives and making leaks like this weekly events.",
            "title_similarity": "0.59290075",
            "sentiment_compound": 0.296
        },
        {
            "id": "h20ighv",
            "score": 3,
            "text": "Joe Manchin is everything wrong about politics",
            "title_similarity": "0.32116476",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h20ijw7",
            "score": 7,
            "text": "> “Roy Blunt is a great, just a good friend of mine, a great guy,” Manchin said. “Roy is retiring. If some of you all who might be working with Roy in his next life could tell him, that’d be nice and it’d help our country. That would be very good to get him to change his vote. And we’re going to have another vote on this thing. That’ll give me one more shot at it.”\n\nTranslation:\n\n> “Roy Blunt is retiring and needs money. He's let me know he can be bought. That will give me cover to vote for these things America desperately needs. Give him some money to vote differently and I'll join!\"",
            "title_similarity": "0.5805609",
            "sentiment_compound": 0.9715
        },
        {
            "id": "h20ikgn",
            "score": 2,
            "text": "I fucking hate this place. Rotten and corrupt to the core.\n\nWhat can honestly be done to turn things around that doesn't take decades to implement?",
            "title_similarity": "0.3041682",
            "sentiment_compound": -0.6478
        },
        {
            "id": "h20ilh6",
            "score": 2,
            "text": "It's a dog and pony show.",
            "title_similarity": "0.34623775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20imih",
            "score": 2,
            "text": "Somebody should do something.",
            "title_similarity": "0.029039666",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20iuhp",
            "score": 3,
            "text": "In today’s episode of *Dying Empire*",
            "title_similarity": "0.4439848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20iuxz",
            "score": 2,
            "text": "Why does someone needed be bribed with a job to do the right thing?  Very sad!",
            "title_similarity": "0.33637166",
            "sentiment_compound": -0.5697
        },
        {
            "id": "h20iyzr",
            "score": 3,
            "text": "When are we going to say enough is enough and march on the white house demanding the immediate resignation of basically every representative and senator?\n\nI'm sure there are more good ones, but AOC is the only one I personally know of that I would allow to keep their job.\n\nEverybody else needs to be removed. By force if necessary. Or else we're all going to find out what happens when a nuclear superpower is looted by the rich then collapses.",
            "title_similarity": "0.5288155",
            "sentiment_compound": 0.7308
        },
        {
            "id": "h20j4lb",
            "score": 1,
            "text": "So a politician is corrupt?!?!  STOP THE FUCKING PRESSES!!!!",
            "title_similarity": "0.39258993",
            "sentiment_compound": -0.6663
        },
        {
            "id": "h20j7bj",
            "score": 1,
            "text": "Always wondered who were paying Manchin to be a douche.  Seems he was a douche that found other douches with money.",
            "title_similarity": "0.4729505",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h20je8x",
            "score": 1,
            "text": "Who was recording his phone call?",
            "title_similarity": "0.3253307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20jg5j",
            "score": 11,
            "text": "Damn that’s a frustrating article to read. It’s the kind of thing you know is happening, but are still shocked to hear. This level of manipulation is startling. Flipping Pub votes on the Jan6 Commission to “yes” in order to tamp down arguments against filibuster reform… Politics really is a cesspool.",
            "title_similarity": "0.47820818",
            "sentiment_compound": -0.8922
        },
        {
            "id": "h20jmjs",
            "score": 5,
            "text": "I'd like to see a news organization release transcripts from a private meeting between Manchin and a dozen random West Virginians. They can't do it because it doesn't happen.",
            "title_similarity": "0.5269614",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h20jnup",
            "score": 1,
            "text": "It takes ten Republicans (at least) to pass legislation without a filibuster. Manchin wanted to find three.\n\nThat tells you everything. He doesn't want any of this to pass, and he's lying when he says he'd do it if only there were Republican support. He wants just enough Republican support to hang it.\n\nAnd he knew the way to get even that wasn't for HIM to encourage his Republican peers. No, the way to get their votes was to ask the lobbyists who would hire his retiring Republican peers to tell them to do it. We're so utterly fucked.",
            "title_similarity": "0.5258293",
            "sentiment_compound": -0.2929
        },
        {
            "id": "h20juh5",
            "score": 1,
            "text": "Democrats have 1 more year before they gave GOP back to Senate.",
            "title_similarity": "0.4884085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20julx",
            "score": 2,
            "text": ">”What I’m asking for, I need to go back, I need to find three more Republican”\n\nWhoah there Joe, did you almost just request a bribe?  Because it sounds like you’re looking for ways to bribe your colleagues.",
            "title_similarity": "0.6162039",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h20jzll",
            "score": 3,
            "text": "At what point do we stop paying taxes as it’s clear these elected officials no longer represent us?",
            "title_similarity": "0.44194442",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h20k1kb",
            "score": 3,
            "text": "The intercept isn't getting enough credit for the scale on which it operates and the issues it deals with. Never seems to be a lightweight.",
            "title_similarity": "0.28268313",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h20k4ta",
            "score": 3,
            "text": "Where's the recording?",
            "title_similarity": "0.18673402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20k8ap",
            "score": 3,
            "text": "This just in: literally no one will ask him about this call, or to defend his words and decisions. I wonder why? I wonder why no one will pressure him to change his stance based on this new information (that we all assumed was the case beforehand)... Hmmm",
            "title_similarity": "0.35625845",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h20k8lz",
            "score": 2,
            "text": "What a piece of shit\n\nWhen's my zoom call, motherfucker?",
            "title_similarity": "0.32927617",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h20kb1t",
            "score": 3,
            "text": "Funnily enough, this basically backs up everything he has said publicly. He doesn't want to kill the filibuster and genuinely believes in bipartisanship not being dead.\n\nWell uh...good luck with that. I'd say we can basically only hang our hopes up on 2022 being a miraculously good election for Dems or its right back into gridlock hell.",
            "title_similarity": "0.4995644",
            "sentiment_compound": 0.8989
        },
        {
            "id": "h20kbuk",
            "score": 2,
            "text": "Fucking Vote Blue America!",
            "title_similarity": "0.21600471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20kv0x",
            "score": 3,
            "text": "Strip this corrupt fucker of any power he has.",
            "title_similarity": "0.21270211",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h20l253",
            "score": 2,
            "text": "Schumer should cite this as a reason why this cannot be brought to the floor again. The vote failed because of the filibuster, bringing it back as a half ass defense of the filibuster would be unbelievably stupid regardless of how important the insurrection commission would be.",
            "title_similarity": "0.34509605",
            "sentiment_compound": -0.8479
        },
        {
            "id": "h20l32p",
            "score": 2,
            "text": "Contact Manchin to let him know how you feel:\n\nhttps://www.manchin.senate.gov/contact-joe/email-joe",
            "title_similarity": "0.5563462",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20l8qi",
            "score": 2,
            "text": "“Rare glimpse” on very obvious goings on between politicians and corporate donors.",
            "title_similarity": "0.7627746",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20l8te",
            "score": 2,
            "text": "AOC was right!",
            "title_similarity": "0.1082416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20ld0p",
            "score": 2,
            "text": "In a normal industry, this shit would kill your career. \n\nSomehow, in politics, he will advance with this. Probably has a nice 7-8 figure salary waiting for him in the private sector effective January 2023.",
            "title_similarity": "0.6626729",
            "sentiment_compound": -0.6187
        },
        {
            "id": "h20lf74",
            "score": 1,
            "text": "For people who are more concerned with passing progressive legislation than hating on Joe Manchin, this is the most important part of the article\n\n> I’m open to looking at it, I’m just not open to getting rid of the filibuster, that’s all,” he said.\n> Manchin acknowledged that publicly he had drawn a line at 60, but said that he was open to other ideas. “Right now, 60 is where I planted my flag, but as long as they know that I’m going to protect this filibuster, we’re looking at good solutions,” he said. “**I think, basically, it should be [that] 41 people have to force the issue versus the 60 that we need in the affirmative. So find 41 in the negative. … I think one little change that could be made right now is basically anyone who wants to filibuster ought to be required to go to the floor** and basically state your objection and why you’re filibustering and also state what you think needs to change that’d fix it, so you would support it. To me, that’s pretty constructive\n\nJoe Manchin is still privately open to  a talking filibuster that requires 41 people trying to block legislation to be present. This is where we need to push him and others in congress.\n\n\nAlso... Fuck Joe Manchin",
            "title_similarity": "0.45028833",
            "sentiment_compound": 0.0624
        },
        {
            "id": "h20lffa",
            "score": 2,
            "text": "BuT MuH PeOpLe In WeSt ViRgInIA... SIKE! its the people in the  big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money to conservative Democrats and moderate Republicans calling the shots.",
            "title_similarity": "0.72474897",
            "sentiment_compound": 0.2244
        },
        {
            "id": "h20lkmc",
            "score": 3,
            "text": "Nothing of consequence will come from this. Just more fist waving.",
            "title_similarity": "0.1175749",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20ltlc",
            "score": 1,
            "text": "Here's what's crazy about this.  I have been involved with shooting sports for over 20 years.  I have been to matches all over the Northeast and Midwest.   It's an open joke in the shooting community that \"If someone invites you to join a militia,  that's probably the informant.\"\n\nSeriously,  everyone knows that these groups are compromised and crawling with informants... and yet people still act shocked when it turns out to be true. \n\nPlay Stupid Games,  Win Stupid Prizes.   Enjoy Prison.",
            "title_similarity": "0.49084458",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h20lyu0",
            "score": 3,
            "text": "What's next? He'll be ashamed of his misdeeds... no.  They'll try and jail the leakers for exposing their shenanigan's.",
            "title_similarity": "0.34729952",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h20lzmv",
            "score": 3,
            "text": "and nothing will be done because bribing is legal in our broken country. What a fucking joke.",
            "title_similarity": "0.2638865",
            "sentiment_compound": -0.0276
        },
        {
            "id": "h20m9jj",
            "score": 2,
            "text": "Soooo he's trying to get the January 6th commission that you wanted and he's sticking to principal of wanting to keep the filibuster?\n\nSo he suggested they could persuade them with some financially backing?\n\nNo body likes to see how the sausage is made but this is probably 99% of politics. Left and right",
            "title_similarity": "0.6033184",
            "sentiment_compound": -0.3769
        },
        {
            "id": "h20m9oy",
            "score": 2,
            "text": "Okay we need way more than go vote commercials for 2022. Get to the cities, fund raise and get the people who need to take the day off, find rides, need childcare taken care of weeks ahead of time. \n\nWe already see the obstructions being laid out and petitions for policy change aren't it. Set up actual infrastructure this time so we can vote, wheelchairs, bathrooms, water, two blocks over if need be. Paperwork takes time for those who can't physically go vote or need designated collectors. It's going to take every single vote so things can't be turned over for small mistakes or small majorities.",
            "title_similarity": "0.52334964",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h20mgin",
            "score": 1,
            "text": "Just finished listening to the intercept podcast on this, pretty fascinating. And infuriating.",
            "title_similarity": "0.44347945",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h20mgse",
            "score": 1,
            "text": "Wow! I can't fucking WAIT for absolutely nothing to happen about this. Just absolutely useless information. Why? Because there are zero repercussions other than our collective recreational outrage.\n\nReport on actual justice, please.",
            "title_similarity": "0.241469",
            "sentiment_compound": 0.5266
        },
        {
            "id": "h20mguv",
            "score": 1,
            "text": "\"Progress Tomorrow\" is such a subtly brilliant name for a fund dedicated to making Democrats more conservative. \"Yes, we support progress! Eventually...\"",
            "title_similarity": "0.47227842",
            "sentiment_compound": 0.9543
        },
        {
            "id": "h20miox",
            "score": 1,
            "text": ">“Roy is retiring. If some of you all **who might be working with Roy in his next life** could tell him, that’d be nice...  That would be very good to get him to change his vote.\n\nsmarmy MOFO, and some dude in this sub just a few days ago was here telling us that b/c he is already a millionaire, he isn't going to be swayed and corrupted by post senate payoffs, b/c \"he doesn't need them\"..",
            "title_similarity": "0.6627421",
            "sentiment_compound": 0.2168
        },
        {
            "id": "h20msyf",
            "score": 2,
            "text": "Oh hey our government is completely corrupt and not functional. \n\nAnyway does Popeyes still have that chicken sandwich?",
            "title_similarity": "0.35648566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20mt1v",
            "score": 1,
            "text": "The sickening part of all this is that it’s so legal, not even ending Citizen’s United would stop this kind of meeting.  What they are talking about is publicly disclosed donations, i.e. the $2800 maximum per candidate etc.  This is the sausage of our “representative” democracy being made, and if you think this is bad, just imagine what goes on with the dark money of the 503(c)s.",
            "title_similarity": "0.64925015",
            "sentiment_compound": -0.6496
        },
        {
            "id": "h20mxl3",
            "score": 3,
            "text": "And there will be absolutely ZERO repercussions. Politicians blatantly fuck us normal people and do the bidding of rich people and its become so normalized that it barely causes a blip anymore. This country is so damn depressing.",
            "title_similarity": "0.45904973",
            "sentiment_compound": -0.7407
        },
        {
            "id": "h20n31e",
            "score": 2,
            "text": "This guy is evil",
            "title_similarity": "0.033913955",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h20n7ov",
            "score": 1,
            "text": "Unlike the wannabe orange overlord, Manchin can cover his own arse. I don’t know whether to be saddened or impressed.\n\nHow about we start paying Congress by the hour spent in their actual job and they can schmooze with donors and constituents on their own time (and dime)?",
            "title_similarity": "0.66178375",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h20nk06",
            "score": 2,
            "text": "Christ, what an a-hole\n\nEdit: filtered my own language",
            "title_similarity": "0.25599623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20nklw",
            "score": 1,
            "text": "Would this be considered the deep state.  First government tax documents and now private senator communications.",
            "title_similarity": "0.68145984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20nlbd",
            "score": 3,
            "text": ">Manchin said that he was prepared to specify his objections to S. 1, the For the People Act. In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility.\n\nthis mofo...\n\n>He also opposed a provision in the bill that restricted a state’s ability to purge voter rolls, which he said would make the rolls less reliable. And he expressed reservations related to some of the campaign finance reform provisions, arguing they needed to apply equally to labor and business.\n\ncorruption.",
            "title_similarity": "0.45073214",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h20nmgf",
            "score": 1,
            "text": "The audio?",
            "title_similarity": "0.17827588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20nz2d",
            "score": 1,
            "text": "I’m sick of these Dark Money satans always going behind our back and fucking with our people in Congress!",
            "title_similarity": "0.39081097",
            "sentiment_compound": -0.5562
        },
        {
            "id": "h20o2ye",
            "score": 1,
            "text": "So, Joe Manchin will resign now right?\n\nRight?",
            "title_similarity": "0.3924417",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h20o48e",
            "score": 1,
            "text": ">While many of the attendees celebrated Manchin’s remarks for his bipartisan fervor, some hailed his policy positions as beneficial to incumbent business interests.\n\n>Lynn Schenk, a former Democratic lawmaker from the San Diego area, spoke up on the call, thanking the West Virginia senator for his remarks in opposition to direct federal funding for electric vehicle charging stations.\n\n>Schenk noted that she had just left the board of Sempra Energy, the utility company based in Southern California. The private sector, Schneck said, is “all ready to do the electric vehicles and all the kinds of things that you were mentioning, so please stay with it, because that is the way for us to go forward,” said Schenk.\n\nrevolving door.. best investment in america is buying a politician.",
            "title_similarity": "0.59257317",
            "sentiment_compound": 0.9652
        },
        {
            "id": "h20o8qt",
            "score": 2,
            "text": "Bought or blackmailed. Turns out he was bought.\n\nWas never about integrity or values.",
            "title_similarity": "0.351079",
            "sentiment_compound": 0.1321
        },
        {
            "id": "h20oatz",
            "score": 3,
            "text": "Does saying \"Fuck Joe Manchin\" count as civil discussion? Hypothetically, of course.",
            "title_similarity": "0.36592692",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20oq38",
            "score": 1,
            "text": "Twitter and Facebook should use their \"Hacked materials\" policy to justify banning people for posting it and blocking people from sharing it in DMs.",
            "title_similarity": "0.31953",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h20p0vd",
            "score": 1,
            "text": "Damn.  I knew it was hard to watch sausage being made, but it's harder to watch it being stolen or shoved up someone's ***.\n\nHow can anyone read this and not realize Manchin has completely sold out the agenda of the Democrats and most of his constituents as well?\n\n\"As an example, Manchin said that he was prepared to specify his objections to S. 1, the For the People Act. In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility.\"  Okay, that's fair.  But that could be fixed in an infrastructure bill, if we could get one passed without it being filibustered....\n\n\n\"He also opposed a provision in the bill that restricted a state’s ability to purge voter rolls, which he said would make the rolls less reliable.\"  There are purges, and there are \"purges\".  One of these strips away more Democrats, which is the problem.\n\n\"And he expressed reservations related to some of the campaign finance reform provisions, arguing they needed to apply equally to labor and business.\"  Obviously Manchin doesn't want this reformed at all as he is used to using this as a tool to influence legislation (read: bribes).",
            "title_similarity": "0.45583454",
            "sentiment_compound": -0.7494
        },
        {
            "id": "h20p1gb",
            "score": 1,
            "text": "All I'm asking for is democracy. Whether Joe needs to go to get that done is fine with me. Democracy please.",
            "title_similarity": "0.28790075",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h20p1wp",
            "score": 2,
            "text": "How much more evidence do we need that these guys are crooks?",
            "title_similarity": "0.4041842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20p2z4",
            "score": 1,
            "text": "Can a senate democrat give Manchin the old Sumner treatment if he's so set on preventing progress?",
            "title_similarity": "0.5007045",
            "sentiment_compound": 0.3477
        },
        {
            "id": "h20p5d0",
            "score": 3,
            "text": "Leaked Audio of Sen. Joe Manchin Call reveals horrific corruption that we all already knew existed.",
            "title_similarity": "0.5233731",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h20p5e0",
            "score": 2,
            "text": "I heard a rumor that Joe Manchin is made entirely of dicks. That's how he's able to fuck everybody.",
            "title_similarity": "0.38475436",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20p6si",
            "score": 1,
            "text": "If you don’t regularly checkout the intercept give them a shot they put out some super interesting reporting on things which often don’t get enough attention",
            "title_similarity": "0.4115329",
            "sentiment_compound": 0.765
        },
        {
            "id": "h20p8mh",
            "score": 2,
            "text": "Ethically questionable senator does ethically questionable shit.\n\nAlso, water is wet.\n\nMore at 11",
            "title_similarity": "0.457384",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h20pae2",
            "score": 1,
            "text": "People really need to check out this interview that Manchin did in 2017. He actually claims that he doesn't know who his donors are.\n\nhttps://youtu.be/4FUcp4gq-zI",
            "title_similarity": "0.5721352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20pome",
            "score": 2,
            "text": "We desperately need a complete overhaul of our campaign finance system.",
            "title_similarity": "0.39437768",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h20pyum",
            "score": 1,
            "text": "Rare to find a girlfriend",
            "title_similarity": "0.20964508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20qev7",
            "score": 3,
            "text": "God damn it, corruption and bribery in plain site. Fuck you to hell and back Joe Manchin.",
            "title_similarity": "0.31630015",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h20qjlt",
            "score": 2,
            "text": "All the donors on the call about the leak: “There’s nothing illegal here. This is totally normal stuff.”\n\n\nUs: “yeah, that’s the problem.”",
            "title_similarity": "0.45563364",
            "sentiment_compound": 0.1341
        },
        {
            "id": "h20qkuw",
            "score": 2,
            "text": "Hi",
            "title_similarity": "0.05637588",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20qr4n",
            "score": 2,
            "text": "How can this not be a dereliction of duty?!?",
            "title_similarity": "0.07733632",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20qrod",
            "score": 1,
            "text": "This guy is a complete crook.",
            "title_similarity": "0.17411456",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20qygp",
            "score": 1,
            "text": "Apparently he isn’t even running again, so why would he need all of these donations to begin with? If I was a politician on my way out I’d be going out guns blazing, not this meek bullshit",
            "title_similarity": "0.4667195",
            "sentiment_compound": 0.4717
        },
        {
            "id": "h20r3c4",
            "score": 2,
            "text": "More blatant corruption out in the open that nothing will be done about, what else is new?",
            "title_similarity": "0.27725124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20rhcp",
            "score": 1,
            "text": "Pull the fucking anchor",
            "title_similarity": "0.15385468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20rujy",
            "score": 3,
            "text": ">“Think about joining the House: You’re there for 730 days, unless you pick the leap year, and maybe you get 731,” said Bursky. “And for the vast majority, those days, you’re spending four hours on the telephone, dialing for dollars. And so what this does — aside from sending the very strong message that there are folks who will have your back if you take tough votes that by partisan nature that may not be popular within your party — it also in real life frees them to do more work, because it’s spending less time raising those funds.”\n\nSo what you're telling me is that getting corporate money out of politics not only makes it so politicians' votes aren't decided and paid for by corporations but that they'll get half of their entire term back to actually **do their jobs**? Sign us up, like, yesterday.",
            "title_similarity": "0.5991396",
            "sentiment_compound": 0.7253
        },
        {
            "id": "h20s03a",
            "score": 1,
            "text": "He is a crooked politician concerned only about himself and our country be damned.",
            "title_similarity": "0.42827368",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h20s50q",
            "score": 1,
            "text": "Joe Manchin. Could we have more on-the-nose villain names, please?\n\nGert DeMoney.\n\nRob Everybody.\n\nRich Estate.\n\nBea Greedy.\n\nPhil T. Lucre.",
            "title_similarity": "0.50191236",
            "sentiment_compound": -0.5965
        },
        {
            "id": "h20s7bl",
            "score": 2,
            "text": "Whomever leaked this is a hero.",
            "title_similarity": "0.33605808",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h20s7ng",
            "score": 3,
            "text": "“I will tell you that I participated in the last cycle, when we handed out checks to a number of our members of the House in the range of $50,000. And in many cases, they went there, the fact that was the single largest check they received, overall in their campaigns.”\n\n... to a number of our members in the House...\n\n\"Our Members\"\n\nWe bought them, they're ours!\n\nThe Rich are saying the quiet parts out loud.",
            "title_similarity": "0.6296299",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h20sjmz",
            "score": 2,
            "text": "There’s no way AI will do a worse job than these meritless sacks of steaming hot corrupt garbage. They would fry like vampires in an environment with real transparency and accountability. Their daily lives are filled with legal crimes against humanity",
            "title_similarity": "0.3585425",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h20spt2",
            "score": 2,
            "text": "Get rid of this motherfucker. Can’t he be removed?",
            "title_similarity": "0.19696465",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h20t1vi",
            "score": 1,
            "text": " Ah, Manchin’s so not so much a moderate, as just plain corrupt.   Not afraid to F everything up for everyone, because that’s his ticket to all the riches. Suspected it before, but now there’s plain video evidence.",
            "title_similarity": "0.52426106",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h20tfzc",
            "score": 1,
            "text": "the absolute arrogance of this man",
            "title_similarity": "0.0961099",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h20thod",
            "score": 4,
            "text": "“The far left” is a conservative talking point. America is so blind to the world’s political spectrum. Even “far left” Democrats are centrists anywhere else.",
            "title_similarity": "0.44144243",
            "sentiment_compound": -0.541
        },
        {
            "id": "h20tj0k",
            "score": 1,
            "text": "Democracy in action!!!",
            "title_similarity": "0.25728044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20tkr1",
            "score": 2,
            "text": "Fucking ass",
            "title_similarity": "0.007916627",
            "sentiment_compound": -0.5849
        },
        {
            "id": "h20tuus",
            "score": 1,
            "text": "The wide-ranging conversation went into depth on the fate of the filibuster, infrastructure negotiations, and the failed effort to create a bipartisan commission to explore the January 6 storming of the U.S. Capitol, and offers a frank glimpse into the thinking of the conservative Democrat who holds the party’s fate in his hands.",
            "title_similarity": "0.67479444",
            "sentiment_compound": -0.296
        },
        {
            "id": "h20tw1e",
            "score": 2,
            "text": "I'm sure this will change...oh so much...",
            "title_similarity": "0.17398852",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h20twif",
            "score": 2,
            "text": "I wish we could make it illegal to bribe politicians.",
            "title_similarity": "0.3655118",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h20uomu",
            "score": 3,
            "text": "Wonder how the us populace will react  oh wait they will just not cover this extensively. Just white collar crimes and status maintaining nothing to see....just light treason",
            "title_similarity": "0.3581214",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h20upza",
            "score": 1,
            "text": "So who was on the other end of the call?",
            "title_similarity": "0.19574273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20uwiq",
            "score": 1,
            "text": "> Manchin said that he was prepared to specify his objections to S. 1, the For the People Act. In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility.\n\nThat is one of the dumbest and lamest reasons he could have possibly come up with.",
            "title_similarity": "0.3798176",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h20uwrn",
            "score": 1,
            "text": "I'd imagine it's much like the deal making shown in the Ozarks",
            "title_similarity": "0.45249665",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h20uyr2",
            "score": 3,
            "text": "Headline should be \"Evidence of political bribery, what the fuck are you gonna do about it?\"",
            "title_similarity": "0.5548047",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h20v3uu",
            "score": 2,
            "text": "I find it infuriating that its just accepted that a group of billionaires get to have inside calls with senators to help make policy. Why wasn’t there a Walmart cashier on the call? Or a college student?\nEven more infuriating is that there isn’t anything we normies can do about it since we are too divided, disorganized, and apathetic to ever unite and force these fuckers out.",
            "title_similarity": "0.5546237",
            "sentiment_compound": -0.8991
        },
        {
            "id": "h20v6kt",
            "score": 2,
            "text": "Come on West Virginia, you can do it. Protest! Rally! Get rid of this sick mother fucker.",
            "title_similarity": "0.30538744",
            "sentiment_compound": -0.8947
        },
        {
            "id": "h20vcjj",
            "score": 3,
            "text": "Fucking traitor.",
            "title_similarity": "0.09605901",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20vds4",
            "score": 2,
            "text": "So what you’re saying is that the guy we already knew was selling out the future of the planet for a few bucks is still selling out the future of our planet for a few bucks?\n\nGot it. Cool. Cool cool cool cool cool.",
            "title_similarity": "0.5533251",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h20vfa5",
            "score": 3,
            "text": "The act isn't rare. The leaking and reporting on it is.",
            "title_similarity": "0.22457442",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20vsja",
            "score": 1,
            "text": "Surprise, surprise….  Invariably the truth always proves our suspicions to be correct.  The most righteous are always the most corrupt",
            "title_similarity": "0.36085138",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h20vy25",
            "score": 1,
            "text": "Yup. Working for the good of the American peop... errr millionaires and billionaires. Fuck this clown",
            "title_similarity": "0.53957283",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h20w7vb",
            "score": 1,
            "text": "This should be grounds for the removal of a government employee.",
            "title_similarity": "0.3653459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20wau3",
            "score": 1,
            "text": "Must be nice not having a soul.",
            "title_similarity": "0.1255435",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h20wggh",
            "score": 5,
            "text": "This just shows why we must get money out of politics. We need transparency to get the money out and keep it out.",
            "title_similarity": "0.42258322",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20wp9t",
            "score": 1,
            "text": "The “Far Left” to Joe Manchin and his buddy “Moscow” Mitch McConnell is anyone who thinks slavery is and was wrong.",
            "title_similarity": "0.4430371",
            "sentiment_compound": -0.836
        },
        {
            "id": "h20x5b4",
            "score": 2,
            "text": "I used to work for TeleTech, aka TeleHell, at their corporate offices in Englewood, CO. If a company could have a personality, that company would be a sociopath. I can't tell you the number of 36 hour days I had with that company.\n\nThe CIO got on an outage call for a new piece of infrastructure that I was standing up, and *screamed* at me to get it working. This was the second instance of MeetingPlace 7 in the *world*. All the documentation was fucked up, and I had to mock up a network in a lab that would \"mirror\" their datacenter in Phoenix. We managed to get it installed, tested, and shipped to Phoenix in two weeks.\n\nWhy the outage call? Every time someone would upload large documents to the server, it would kick all the web participants out. Ended up on an outage bridge for 24 hours over that one. 8 hours in to the call, I asked one of the network guys to check the network in the DC in PHX, he told me to go fuck myself. 10 hours later, one of the network engineers did a simple ping from the switch to my server and it was getting 50% packet loss. It was a bad patch cable.\n\nI also had a boss that just loved to berate me, even when he didn't know a fucking thing about my job. I complained multiple times to my Director, but nothing changed. Now, [TeleTech is a large, circular building](https://i.imgur.com/uBlkzjS.png) with an [open-air walkway](https://i.imgur.com/MmxNiwq.png) that goes around the entire building. One day, I, my manager, and my Director where standing next to the wall on the left side of that second pic. I don't recall what the issue was, but my manager decided that while we were standing there in the open-air walkway to dress me down loudly. I let him say his piece, turned to my Director and said something like \"This is the shit that I've bee telling you about. If this *ever* happens again, I fucking quit.\" then walked outside to have a smoke. My Director showed up a minute or two later, told me I was right, and that it wouldn't happen again.\n\nOh, and they put me in a position that was supposed to be salaried and were paying me hourly. Constantly refused to make me a salaried employee. See, in CO at the time, if you are salaried, the company takes on some responsibility for your employment. If you are terminated for any reason, they have to provide you severance (or at least they did when I worked there). 2 weeks pay per year employed with the company. I kept asking, and finally the last time my manager asked about it, the Director told him that if he asked about it one more time, that he and my manager would have a conversation about *his* employment status. So I emailed HR about it, HR came back and said \"Wait, so you're in a salaried position being paid hourly?\" and I told them that that was correct. HR immediately scheduled a meeting with my manager and my Director. So I'm downstairs working with a vendor while they're in a meeting with HR. They come back, my Director walks right up to me and punches me in the arm. I was salaried the next day.\n\nOh yeah, and they paid their PHILS employees something like $3000USD/year with a rice stipend, which was crazy to me, but they'd pay their US counterparts who were living in PHILS their regular salary so they'd live like kings while on the islands.\n\nI could go on and on about how bad that place is, but the thing that pissed me off the most was that Tuchman started having \"brown bag lunches\" with employees during the 2008 financial crisis, trying to boost morale. At one of these lunches, an employee didn't kiss his ass and actually told him what many of the problems were and he looked at them and said \"Ok, go find another job.\" knowing that the job market was non-existent at the time. Essentially he said \"We're going to treat you like shit because you have no other choice.\n\nThe fact that the building kinda looks like the Death Star is never not amusing to me, btw.",
            "title_similarity": "0.54221135",
            "sentiment_compound": -0.9381
        },
        {
            "id": "h20xb6o",
            "score": 1,
            "text": "When was this call? I don't see any mention of when this was placed.\n\nEdit: thanks to the child commentator for providing guidance, seems like it was June 14, 2021.",
            "title_similarity": "0.5163336",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h20xkp8",
            "score": 1,
            "text": "Realistically, what can voters who are NOT in WV do about Joe Manchin? And more importantly, what can we do to ensure that A) corporate influence stays out of politics and B) fascism doesn’t consume our country?",
            "title_similarity": "0.5186571",
            "sentiment_compound": 0.676
        },
        {
            "id": "h20xqyr",
            "score": 1,
            "text": "This man will be responsible for the death of millions in the future",
            "title_similarity": "0.39970183",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h20xrxe",
            "score": 2,
            "text": "I don't have Twitter, but if I did, and if you do, you should Tweet \"How’s that bipartisan working for you now, Joe?\" to Joe Manchin every day from here to eternity.",
            "title_similarity": "0.50110286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20xubf",
            "score": 2,
            "text": "Don’t worry the gov will go after the leakers",
            "title_similarity": "0.38629013",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h20y4zl",
            "score": 1,
            "text": "Politics is fucking disgusting",
            "title_similarity": "0.12348339",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h20y885",
            "score": 2,
            "text": ">In the voting rights and democracy reform bill, he said, he opposed automatic voter registration because some rural voting locations don’t have internet access to check a voter’s eligibility.\n\nManchin needs to learn the history of fucking cable TV. Cable companies were originally (1960s) granted protection from antitrust laws because they said they needed protection from the OTA television companies, and in return they would install wire to EVERY home in America. By the 1970s, they were backing away from that promise, but still wanted the protection from antitrust. By the 1980s, the edict of wiring every home was nowhere to be seen, but the protection from antitrust somehow stayed. And then in 2018, fuckweasel Ajit Pai likely coordinated with Russia in getting the FCC flooded with impact statements that killed broadband access as a Title 2 utility, which likely would have enforced the wiring requirement to new areas by holding rates hostage. You can rale against government regulation all you want, but sometimes it does the necessary things.",
            "title_similarity": "0.44566703",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h20yf1o",
            "score": 1,
            "text": "The way lobbying for votes works in USA reminded me of lobbying for votes in the un",
            "title_similarity": "0.55474675",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h20yuin",
            "score": 1,
            "text": "Where’s the audio???",
            "title_similarity": "0.22210552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20yvt7",
            "score": 1,
            "text": "West Virginia should be kick out of the union and replace with the District of Fredrick Douglas bka DC",
            "title_similarity": "0.36878276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h20z64f",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.059630617"
        },
        {
            "id": "h20zkkc",
            "score": 1,
            "text": "I hope this guy has to depend on someone helping him with the same attitude to him that he has to his country and constituents.",
            "title_similarity": "0.35542417",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h20zlhe",
            "score": 2,
            "text": "What would really make a difference Manchin is if the democratic senators really started to give him a hard time about this. All of the senators are friends and I'm sure Manchin loves the idea that he is right in the middle and everyone likes him. If they dropped the premise of collegiallety and started to actually personally give him shit over this it could make a difference.\n\nIf progressive groups or left wing media pressure him it is easy for him to rationalize that he is doing the right thing by being in the middle. Manchin regularly entertains senators on his boat on the Potomac. If people he considers friends started to pressure him it could actually mean something, but most senators value their ability to get along with everyone over doing the right thing or getting shit done.",
            "title_similarity": "0.4527461",
            "sentiment_compound": 0.7916
        },
        {
            "id": "h20znr1",
            "score": 1,
            "text": "The best government money can buy.",
            "title_similarity": "0.4105953",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h20zx57",
            "score": 2,
            "text": "How come the filibuster is never an issue when democrats are in office? How come only the republican minority can filibuster?",
            "title_similarity": "0.43954334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2103r6",
            "score": 3,
            "text": "Joe’s gotta go!!!!",
            "title_similarity": "0.18911612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21056g",
            "score": 2,
            "text": "It’s all about the money.  They vote the way they are paid.",
            "title_similarity": "0.4341023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h210d6l",
            "score": 3,
            "text": "By the people for the people\n\nI am of the people and if I remotely did any of this I’d lose\nMy job, get sued and be shunned in my communities. He on the other hand is proceeding as normal and knows there is no recourse anyone will do.\n\nVote people vote!",
            "title_similarity": "0.3997344",
            "sentiment_compound": -0.2481
        },
        {
            "id": "h210i7s",
            "score": 1,
            "text": "Genuine Question: How much power does this one person have?",
            "title_similarity": "0.29088554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h210ko0",
            "score": 2,
            "text": "\"Make the Senate work better\" but for whom Joe?",
            "title_similarity": "0.47610205",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h2112u6",
            "score": 5,
            "text": "Explains where we are at today in this country being left in the dust when I'm forced to vote for the same party that this guy is in.",
            "title_similarity": "0.6497762",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2113kr",
            "score": 1,
            "text": "Keep driving everyone real left",
            "title_similarity": "0.17672904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h211zrn",
            "score": 3,
            "text": "It’s so disgusting how the wealthy control our politicians",
            "title_similarity": "0.46812302",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h213ciy",
            "score": 1,
            "text": "I definitely think it was \"Time With\"",
            "title_similarity": "0.15466127",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h213m26",
            "score": 2,
            "text": "/sarcasm I love my senator, makes me more proud to be a West Virginian /endsarcasm",
            "title_similarity": "0.39592564",
            "sentiment_compound": 0.7713
        },
        {
            "id": "h213m7s",
            "score": 2,
            "text": "If this is true it is probably a mistake on the billionaires part. The US Legislature is close to defunct and that is a bigger problem than loosing some income.",
            "title_similarity": "0.5277978",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h213njo",
            "score": 2,
            "text": "We already know their entire job is to beg rich for money. We have known that for a long time.",
            "title_similarity": "0.4485262",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h213tb4",
            "score": 8,
            "text": "The political system is FUBAR. Corporations run the country and that is a fact.",
            "title_similarity": "0.56742334",
            "sentiment_compound": -0.694
        },
        {
            "id": "h2140z7",
            "score": 2,
            "text": "Are any of these people on the call part of his WV constituency? How many zoom calls is Joe taking with the poor saps he represents?\n\nPeople are worried about Republican voter suppression laws ending our American democracy when that’s not true. Democracy is already fucking dead in America. \n\nRepublican are unlikable people so of course they have to take drastic steps to maintain their position but don’t confuse them positioning to be the remora fish along side the sharks as the death of democracy. Like I said, democracy is already dead regardless of the Republicans, or Democrats, part in it.",
            "title_similarity": "0.4849404",
            "sentiment_compound": -0.9576
        },
        {
            "id": "h214jiv",
            "score": 5,
            "text": "Can we please treat public servants like the NCAA treats college athletes? Just completely remove money from politics. No PACs, no donations. They only get their salary for being in office.",
            "title_similarity": "0.4494847",
            "sentiment_compound": 0.7342
        },
        {
            "id": "h214sz8",
            "score": 2,
            "text": "Ah now we can see whose pocket he is in",
            "title_similarity": "0.35935563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h214ytt",
            "score": 3,
            "text": "From the article:\n\n>Manchin’s openness for filibuster reform on the call is notable given it flew in the face of many attendees’ hopes. Asked about a proposal to lower the threshold to beat back a filibuster to 55 votes, he said that it was something he was considering, but then quickly referred back to his earlier idea of forcing the minority to show up on the Senate floor in large enough numbers to maintain a filibuster.\r  \n>  \n>“That’s that’s one of many good, good suggestions I’ve had,” he said of lowering the cloture total from 60 to 55. Manchin went on to discuss the last time the cloture threshold was lowered, in the 1970s.\n\nUsing the nuclear option to lower the filibuster threshold to 55 votes would be the single, dumbest move Democrats could possibly make. It would be worse than leaving the threshold at 60. Lowering to 55, Democrats get tarred by Republicans with \"nuking the filibuster\" anyway, while not getting any countervailing benefit. Because who are the 5 Republicans who'd potentially vote for a Democratic bill that couldn't get 60+ votes? Maybe you peel off Collins and Murkowski, maybe one other Senator, but 5? If you can peel off 5, you're well on the way to peeling off 10.",
            "title_similarity": "0.6090375",
            "sentiment_compound": -0.2869
        },
        {
            "id": "h215544",
            "score": 1,
            "text": "He’s dirty",
            "title_similarity": "0.04488208",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h215zio",
            "score": 4,
            "text": "Speaker Pelosi said on Sunday that she was asked to wait until Monday to see if they could get 3 more votes on the commission. She didn’t, so Tuesday she announced a select committee.\n\nNow it all makes sense. I’m glad she cut Manchin off after his first request. If he had his way he’d be doing his favorite thing—filibustering it all the way to his “hold on I can be bipartisan” circle jerk with donors.",
            "title_similarity": "0.6159358",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2164nz",
            "score": 3,
            "text": "The problem with Manchin's supposed philosophy regarding bi-partisanship is that the GOP never fails to run roughshod over everyone else whenever they have the chance. The nuclear option for supreme court nominees?\n\nAt this moment in time he is relying on the population's short memory. I don't think we can miss this opportunity to shift the overton window a bit to help right the ship.",
            "title_similarity": "0.5240124",
            "sentiment_compound": 0.8619
        },
        {
            "id": "h216885",
            "score": 2,
            "text": "That man is lower than dog shit.",
            "title_similarity": "0.01780742",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h216gam",
            "score": 1,
            "text": "I really want to know where all these \"recordings\" are coming from. Like, if you're going to do a shady deal, don't do it on a recorded line. That's like bad guy 101. Seems like someone at the NSA has some explaining to do.",
            "title_similarity": "0.5180567",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h216lld",
            "score": 1,
            "text": "Manchin will do what his big donors want but not what his constituents want.",
            "title_similarity": "0.4547779",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h216ro0",
            "score": 2,
            "text": "Keep the pressure on him. It's clear that he's starting to crack.",
            "title_similarity": "0.21699992",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h2178wv",
            "score": 3,
            "text": "How's that bipartisanship working for you now, Joe? You vulgar putz.",
            "title_similarity": "0.5134895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h217ave",
            "score": 1,
            "text": "The irony is his name is sounds like child in german",
            "title_similarity": "0.29253072",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h217c9s",
            "score": 1,
            "text": "Manchin? Man chin? A man's chin. Knock him out.",
            "title_similarity": "0.2916069",
            "sentiment_compound": 0.0
        },
        {
            "id": "h217elz",
            "score": 2,
            "text": "So… “The far left is saying Republicans are corrupt, so I need you to bribe them into allowing an investigation so that we can show the far left that Republicans are not corrupt.”\n\nDoes this dude seriously lack ANY self awareness?\n\nYou can’t have bipartisanship. It’s be great if you could, but the Republican Party has sworn to never help another Democrat ever. So it’s not going to happen. You can’t have bipartisanship when one party is made up of predominately bad faith actors.",
            "title_similarity": "0.47402406",
            "sentiment_compound": 0.5127
        },
        {
            "id": "h217esb",
            "score": 2,
            "text": "Only a confirmation of what we already know about Manchin: he needs to go. These old guard who have been in the billionaires’ pockets, doing their bidding and not the people’s benefit! Manchin needs to go.",
            "title_similarity": "0.53073895",
            "sentiment_compound": -0.416
        },
        {
            "id": "h217jjx",
            "score": 5,
            "text": "If bipartisanship is just forking over enough money for a vote, what's the point?",
            "title_similarity": "0.52977943",
            "sentiment_compound": 0.0
        },
        {
            "id": "h217s1n",
            "score": 3,
            "text": ">Bribery is defined by Black's Law Dictionary as the offering, giving, receiving, or soliciting of any item of value to influence the actions of an official, or other person, in charge of a public or legal duty.\n\nSounds like this to me.",
            "title_similarity": "0.5344923",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h217xu1",
            "score": 3,
            "text": "Spineless dicks who sell out their country for money should go eat big shitballs.",
            "title_similarity": "0.4083674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h218m3h",
            "score": 4,
            "text": "God Bless the leakers. Keep going. Sooner or later the people will come back to their senses and remove this cancer from our country.",
            "title_similarity": "0.38064656",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h218sa0",
            "score": 1,
            "text": "Cowards and traitors and greedy bastards, every damn one of them",
            "title_similarity": "0.20358115",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h218zc3",
            "score": 1,
            "text": "Oh my gosh, I'm getting so fed up with this dude, I'm ready to get in my car and drive to his state just to shake my fist at him.  Grrrr.",
            "title_similarity": "0.3373338",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2192we",
            "score": 3,
            "text": "Disgusting",
            "title_similarity": "-0.061380573",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2193sw",
            "score": 4,
            "text": "So again I ask....  millionaires and billionaires have more influence over this country's agenda than the majority of American Citizens?  \n\nOh and the millionaires and billionaires don't pay income taxes!",
            "title_similarity": "0.58223677",
            "sentiment_compound": 0.1501
        },
        {
            "id": "h2194sn",
            "score": 3,
            "text": "It truly terrifies me that the American far left equals the right/far right here in Norway. Big picture anyways. \n\nI came to think of universal health care, there is NO political party who is against that here. \n\nI truly hope you guys ram some good policy's thru whitin the Biden admin. Once you have I think you'll be all good. \n\nAnything republicans want to roll back will cost them too much after that.",
            "title_similarity": "0.47459948",
            "sentiment_compound": 0.8485
        },
        {
            "id": "h219cdf",
            "score": 3,
            "text": "I'm in favor of no representation without taxation.",
            "title_similarity": "0.36860842",
            "sentiment_compound": 0.128
        },
        {
            "id": "h219olo",
            "score": 2,
            "text": "Can I just get the audio?",
            "title_similarity": "0.19876376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h219sug",
            "score": 2,
            "text": "Maybe his daughter can raise the prices of life saving medicine again to raise more money for this disgustingly corrupt, greedy piece of shit family",
            "title_similarity": "0.44970816",
            "sentiment_compound": -0.8891
        },
        {
            "id": "h21aa0e",
            "score": 1,
            "text": "I just want to say The Intercept is a great source.  It's not about who is right, but what is right.   Fuck Glenn Greenwald.",
            "title_similarity": "0.3644595",
            "sentiment_compound": -0.4678
        },
        {
            "id": "h21aadz",
            "score": 1,
            "text": "Newspaper name checks out.",
            "title_similarity": "0.41215307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21ad6n",
            "score": 2,
            "text": "We need to upvote this to heaven and share it. The more pressure on this corrupt piece of shit the better.",
            "title_similarity": "0.32059115",
            "sentiment_compound": 0.3197
        },
        {
            "id": "h21aihz",
            "score": 2,
            "text": "Typical Joe Manchin.\n\nJoe Manchin: You need to get Roy Blunt on board to support the January 6th commission or there's no way I can justify continuing to support the filibuster.\n\nRoy Blunt: \\*votes against the January 6th commission\\*\n\nJoe Manchin: I will never vote against abolishing the filibuster under any circumstances.\n\n&#x200B;\n\nHe sure showed everyone, didn't he?\n\nIt's going to be so funny to see Kirsten Sinema fall on her face trying to get 10 Republicans on board for the infrastructure bill.\n\nSinema and Manchin are just too fucking stupid to understand that the Republicans will *never* play ball on virtually anything, no matter how uncontroversial.",
            "title_similarity": "0.567771",
            "sentiment_compound": 0.5328
        },
        {
            "id": "h21bb4i",
            "score": 3,
            "text": "Calling it now, Manchin flips to Republican before the next election.",
            "title_similarity": "0.5789373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21bib7",
            "score": 2,
            "text": "Once you have been a politician you should not be allowed to work or receive significant financial gifts. People actually wanting to perform public service would be more than happy to serve and then receive a pension are the ones we want representing us anyway",
            "title_similarity": "0.42228186",
            "sentiment_compound": 0.7251
        },
        {
            "id": "h21bngo",
            "score": 1,
            "text": "If any of you haven't seen yet, check out the docu-series \"the untold history of the united states\" really shines a light on the kind of back room shit corporations do for the sake of profits, supporting fascist movements and even trying to support a coup in the US was very common",
            "title_similarity": "0.6569329",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h21bpb0",
            "score": 1,
            "text": "I don’t understand how this is shocking this is what lobbyists do on the daily. Makes since that congress people do it too… We need real reforms & an entire overhaul of the system.",
            "title_similarity": "0.5513805",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h21bu64",
            "score": 2,
            "text": "Why not just switch parties? He practically plays for team R.",
            "title_similarity": "0.47931316",
            "sentiment_compound": -0.0665
        },
        {
            "id": "h21bv2e",
            "score": 2,
            "text": "Are the Russian bots back?\n\nWhy is the Ivancept at the top of the sub? Next time be sure and upvote RT to the top too.\n\nJesus Christ Reddit.",
            "title_similarity": "0.5340383",
            "sentiment_compound": 0.644
        },
        {
            "id": "h21bwrl",
            "score": 2,
            "text": "This is infuriating.",
            "title_similarity": "0.01757559",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h21bzmz",
            "score": 2,
            "text": "This guy is disgusting- willing to  erode our democracy for a few pieces of silver...god is watching",
            "title_similarity": "0.37060788",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h21c437",
            "score": 5,
            "text": "Expecting politicians to write and pass legislation against corporations and in favor of the middle class is foolishness. 330 million Americans, and were all too comfortable with the status quo",
            "title_similarity": "0.57739073",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h21ce77",
            "score": 4,
            "text": "That’s the whole ball game.  The Filibuster is there to stop progressive reforms which would benefit the middle class.",
            "title_similarity": "0.4557292",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h21ch0e",
            "score": 3,
            "text": "Isn't this the same guy who was purposely stalling the stimulus bill to get what he wanted into the bill? Surely this is an expellable offense?",
            "title_similarity": "0.45784956",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h21cljd",
            "score": 1,
            "text": "Lmao, “leaked audio”",
            "title_similarity": "0.43615663",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h21cmvl",
            "score": 2,
            "text": "Well, so much for the \"aw shucks\" version of Joe Manchin.",
            "title_similarity": "0.33630368",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h21cp1i",
            "score": 1,
            "text": "Carpetbagger POS.",
            "title_similarity": "0.3370465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21d2vr",
            "score": 3,
            "text": "This is how are democracy is bought and sold people unless you got a couple million in the bank you have no influence you in essence are bought and sold by these people",
            "title_similarity": "0.6327065",
            "sentiment_compound": -0.296
        },
        {
            "id": "h21d34n",
            "score": 2,
            "text": "And nothing will happen",
            "title_similarity": "-0.01902325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21d3oy",
            "score": 3,
            "text": "And yet, life marches on. In a functioning society, news that the leaders were this corrupt would leat to a general strike at the bare minimum.",
            "title_similarity": "0.43951744",
            "sentiment_compound": -0.128
        },
        {
            "id": "h21dc8x",
            "score": 1,
            "text": "He is such a POS",
            "title_similarity": "0.120121",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21dlhk",
            "score": 3,
            "text": "This needs to fucking end.",
            "title_similarity": "0.028006269",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21du5d",
            "score": 1,
            "text": "Is there any way in the world he could quit, and WVa Democrats (SCC delegates, or the like) would get the chance to appoint a new Democratic senator? If he died would that happen? Or would we just lose a Senate seat until after someone new was elected to fill that seat?",
            "title_similarity": "0.5166227",
            "sentiment_compound": -0.5171
        },
        {
            "id": "h21e0th",
            "score": 3,
            "text": "Keep supporting gqp terrorist traitors or corporate dem cockpuppets keep believing the system will somehow work out despite the entirety of our history or you could drop the excuses and stage a work strike.",
            "title_similarity": "0.5512693",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h21e2n8",
            "score": 2,
            "text": "State shouldn’t have the power to dispense favors. Only clear cut way of fixing this.",
            "title_similarity": "0.24038678",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h21e6lz",
            "score": 1,
            "text": "Leaks leaks leaks. Obviously everything’s bugged.",
            "title_similarity": "0.26834315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21e96k",
            "score": 5,
            "text": "Any of you folks been on a conference call with a Senator lately? Me, neither. Fuck billionaires.",
            "title_similarity": "0.6546662",
            "sentiment_compound": 0.431
        },
        {
            "id": "h21edxc",
            "score": 2,
            "text": "Ya know... years ago, this would end his career. \n\nNow... he could run for president.\n\n\n\nWelcome to the new America.",
            "title_similarity": "0.5587934",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h21ef2k",
            "score": 1,
            "text": "Joe manchin is a traitor",
            "title_similarity": "0.27856332",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21ehoo",
            "score": 1,
            "text": "Does anyone have just the audio of the phone call?",
            "title_similarity": "0.32513392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21fbgn",
            "score": 1,
            "text": "One word! Scumbag!!!💩💩💩",
            "title_similarity": "0.21165517",
            "sentiment_compound": -0.7482
        },
        {
            "id": "h21fbz6",
            "score": 4,
            "text": "Joe fuckin Lieberman. Figures.\n\nThe GOP has always had a secret squirrel, in their nut drawer..",
            "title_similarity": "0.41089636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21fcyz",
            "score": 3,
            "text": "I am not American but this makes sick. I used to have such great estime for this country. Internet makes me see the eagles on different light.",
            "title_similarity": "0.44368753",
            "sentiment_compound": 0.296
        },
        {
            "id": "h21g8xi",
            "score": 1,
            "text": "Democracy.",
            "title_similarity": "0.1749275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21gowk",
            "score": 3,
            "text": "Disgusting.",
            "title_similarity": "-0.04635708",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h21hg99",
            "score": 3,
            "text": "This corruption is intolerable, and the consequences will be intense for the corrupt, as it should be.\n\nGetting there will be a tough journey tho.",
            "title_similarity": "0.2660726",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h21htgs",
            "score": 2,
            "text": "Does Manchin win his seat without the left voting for him in WV?\n\nIt is probably time for the left in WV to start saying that they are going to pull their support if he doesn't support some of their causes. \n\nFrankly, Manchin taking from the rich, and tanking the Democrats while being the best apologist for Republicans. It seems Manchin's  goal is to legitimize white Christian Nationalism while destroying democracy. \n\nThe only people he would conceivably listen to are West Virginia Democrats. If you live in WV, now is probably the time to pull your support if you are on the left. Make him work for you vote. Not think it is his because he is just not registered as a Republican.\n\nManchin doesn't support you, he supports the GQP.",
            "title_similarity": "0.49118626",
            "sentiment_compound": 0.9078
        },
        {
            "id": "h21hvcm",
            "score": 2,
            "text": "Name the last time audio of a politician in such a high priority situation had audio leaked and television news ignored it entirely.",
            "title_similarity": "0.4727499",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h21hx5l",
            "score": 2,
            "text": "I was interested how he talks about carbon capture, which is silly and disproven to be really successful. He really is pushing to keep coal around. \n\nThe rest of the audio is depressing, these are the worst politicians.",
            "title_similarity": "0.44500703",
            "sentiment_compound": 0.0498
        },
        {
            "id": "h21i0js",
            "score": 4,
            "text": "Does democracy really work? Like what’s really going on?",
            "title_similarity": "0.3219568",
            "sentiment_compound": 0.4833
        },
        {
            "id": "h21i271",
            "score": 2,
            "text": "And he will be charged when? Seriously...like are they just going to kick the can down the road again?",
            "title_similarity": "0.35364276",
            "sentiment_compound": -0.2869
        },
        {
            "id": "h21i4wl",
            "score": 4,
            "text": "We need campaign finance reform like now",
            "title_similarity": "0.45247537",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h21ijcf",
            "score": 3,
            "text": "What are we going to do about this?",
            "title_similarity": "0.11317273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21itdt",
            "score": 6,
            "text": "Forget Manchin.\n\nwho are the people on the call with him? make their life hell.\n\ngo after the people running the PoS. Bribes have 2 sides. fuck the people with money.\n\nManchin is a symptom not the disease.",
            "title_similarity": "0.4520011",
            "sentiment_compound": -0.875
        },
        {
            "id": "h21iymt",
            "score": 2,
            "text": "What angers me is that he is fighting to give these rich ass holes tax breaks but not fighting for voter rights or infrastructure. We should have more power and control over people whose salary we pay.",
            "title_similarity": "0.4723917",
            "sentiment_compound": -0.1986
        },
        {
            "id": "h21j06h",
            "score": 2,
            "text": "Important to note that Manchin isn’t out there protecting his flank: he’s making the case for how best to keep the filibuster and to stop progressive policy making.",
            "title_similarity": "0.27860057",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h21jgzw",
            "score": 4,
            "text": "Why isn't this being reported on I don't see it getting reported on by any of the large media companies lol.",
            "title_similarity": "0.3289953",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h21jo8n",
            "score": 1,
            "text": "\"Alright, starting now, no more taking bribes from the billionaires!\"\n\n\"But Black Dynamite! We takes bribes! From the billionaires!\"",
            "title_similarity": "0.54429126",
            "sentiment_compound": 0.4798
        },
        {
            "id": "h21jq68",
            "score": 3,
            "text": "American politics and economics is a fucking mess.",
            "title_similarity": "0.34986717",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h21js82",
            "score": 2,
            "text": "Term limits for all of them",
            "title_similarity": "0.17877181",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21jvbo",
            "score": 1,
            "text": "Define ‘good’…",
            "title_similarity": "0.16579904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21jwmw",
            "score": 2,
            "text": "A senator on the take...I’m shocked (sarcasm)🤓",
            "title_similarity": "0.5290418",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h21k4bw",
            "score": 2,
            "text": "You are not their constituents.",
            "title_similarity": "0.050025992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21klm1",
            "score": 8,
            "text": "Serious question. What's protecting me from suing this guy and McConnell for treason against the USA? McConnell has said on record he will not support Biden and Babychin won't admit he's a Republican.\n\nThey took an oath to protect the USA when sworn into office. Right now both are going against their oath.",
            "title_similarity": "0.5157487",
            "sentiment_compound": -0.6757
        },
        {
            "id": "h21kqf7",
            "score": 5,
            "text": "Thank you west Virginia, a real gem.",
            "title_similarity": "0.23284802",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h21kxli",
            "score": 4,
            "text": "So if it wasn’t a fundraiser, why do only rich donors have access and a say?",
            "title_similarity": "0.59215146",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h21kznf",
            "score": 3,
            "text": "There it is.  Intercept, indeed.  Thank you.",
            "title_similarity": "0.22152722",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h21m0xf",
            "score": 5,
            "text": "One paragraph mentioned that Congress members cans spend 4 hours out of their day try to raise money? If this is not a reason to get money out of politics I do not know what is. The main reason groups like this have leverage is they can provide large sums of cash and eliminate the need to fundraise as much. Maybe Congress could do more if half the day did not revolve around securing funds for the next election.",
            "title_similarity": "0.61005116",
            "sentiment_compound": 0.1376
        },
        {
            "id": "h21m9eg",
            "score": 2,
            "text": "Read about his daughter and her contributions to affordable public health.",
            "title_similarity": "0.36877552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21maw8",
            "score": 5,
            "text": "Joe Manchin could care less if the United States collapses into another civil war or an authoritarian form of government.  The only thing he cares about is the billionaire donors who give him advice and then pay him in exchange for his vote!",
            "title_similarity": "0.5917255",
            "sentiment_compound": 0.3671
        },
        {
            "id": "h21mlpd",
            "score": 4,
            "text": "The Intercept is wonderful!",
            "title_similarity": "0.19363894",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h21n4rm",
            "score": 2,
            "text": "He and his father have been corrupt shitbags from day one. They have never done a damn thing except for donor cash and couldn’t care less about his WV working poor, who have one of the highest opioid suicide rates in the country because life in WV is such a heavenly existence.\nNot.",
            "title_similarity": "0.45773542",
            "sentiment_compound": 0.2163
        },
        {
            "id": "h21nc76",
            "score": 3,
            "text": "He's probably not even ashamed. \n\nDear Senator Manchin, \n\nDo you even remember the first time you sold out? How much does it cost to get a senator these days? Do they cost extra if they going to fuck the whole country over?",
            "title_similarity": "0.6726985",
            "sentiment_compound": -0.5676
        },
        {
            "id": "h21nfqe",
            "score": 3,
            "text": "So basically a TRAITOR to democracy, open for bribes, and willing to harm countless generations for his own personal profit. \n\nWhen do we start punishing these criminals the way they deserve? Democrats want the same thing as Republicans. Nothing to change. Keep getting billionaire ~~bribes~~ donations and disenfranchising the voter base so we can't participate for actual democracy. \n\nBut hey, Bernie is a socialist devil who wants to eat your babies, Trump is some kind of a golden God and Pelosi is apparently the most amazing thing to happen to the democratic party since... well, ever. Hope everyone enjoys working 3 jobs to make ends meet and you might get to afford one kid if you and your spouse make more than 6 figures each. Keep paying your taxes so the billionaires can keep getting government bailouts from your hard earned money while they contribute zero to the actual economy that benefits you. Oh and while we're at it, Keep slashing education funding and pumping Jesus while actively doing everything you can against what his supposed teachings were, because Jesus was a carpenter that enjoyed helping poor people live full lives. All while building the largest cult our race has ever seen. \n\nGood job America. 🇺🇸",
            "title_similarity": "0.47900206",
            "sentiment_compound": 0.9717
        },
        {
            "id": "h21npua",
            "score": 2,
            "text": "Where’s my pitchfork",
            "title_similarity": "0.15319362",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21nsfz",
            "score": 2,
            "text": "all of us:  this is it...we got him.   Right to jail.\n\nreality:   promotion.",
            "title_similarity": "0.40847766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21o6ce",
            "score": 2,
            "text": "This guy needs to be sent packing…. He’s corrupt!",
            "title_similarity": "0.34820506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21ojfa",
            "score": 3,
            "text": "Screw you. Hope more votes come up to prove how unreasonable Republicans are to show how big a fool Manchin is and a swindler on the filibuster issue.",
            "title_similarity": "0.47883305",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h21okmk",
            "score": 2,
            "text": "Funny. I don’t get to be on zoom conference calls with senators. I wonder what all these billionaires have in common that would let them have this 1:1 time with a senator. 🤔",
            "title_similarity": "0.5856266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h21pftj",
            "score": 2,
            "text": "This is one of the most upvoted posts and it doesn’t make the front page. I guess there’s no manipulation on Reddit",
            "title_similarity": "0.39066565",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h21ppz0",
            "score": 2,
            "text": "Most blatant corruption . I wonder when we will be shackled up with slave collars.",
            "title_similarity": "0.3997133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21qkrg",
            "score": 2,
            "text": "Just went to Joe's contact page and sent this gem:\n\n\"You are a shameful, cowardly, soulless husk of a man that is completely subservient and willing to bend over for your billionaire donors if it means you get a pitiful handout that equates to pennies on the dollar for them. You are actively manipulating public opinion to give the guise of bipartisanship, in order to disguise the fact that your entire existence and apparent drive is a complete and utter sham. In the end, you will end up on the complete wrong side of history because you failed to show up for the people that you claim to represent. I certainly hope you don't believe in God, because you are the antithesis of everything that He teaches and have earned your spot among the worst of the worst in the lowest depths of hell.\"\n\nhttps://www.manchin.senate.gov/contact-joe/email-joe",
            "title_similarity": "0.5382992",
            "sentiment_compound": -0.9826
        },
        {
            "id": "h21qnza",
            "score": 5,
            "text": "And morons say we don't live in an oligarchy when senators are asking literal billionaires to pressure other senators. This corruption just pisses me right off. Fuck all corporate politicians.",
            "title_similarity": "0.5375289",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h21r3ld",
            "score": 3,
            "text": "I just hear, the voters put you in, but only the donors matter.",
            "title_similarity": "0.58357656",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h21rdqi",
            "score": 1,
            "text": "    Of corse the American people are the ones that are getting the shft on all of this. But nobody talks much about it. So it keeps going on and on. The names should be listed and how much they gave.",
            "title_similarity": "0.4964038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21rf10",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.14502722",
            "sentiment_compound": 0.68
        },
        {
            "id": "h21rp2u",
            "score": 2,
            "text": "Why is this still not at the top of reddit",
            "title_similarity": "0.27998576",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h21t9hz",
            "score": 1,
            "text": "Can he not be expelled from the democratic caucus? In Canada we can boot people who suck this bad from our party caucus. It's a big deal, and usually fucks them in the next election. Joe Manchin is so desperate to keep his job he is forgetting who elected him.",
            "title_similarity": "0.50316477",
            "sentiment_compound": -0.865
        },
        {
            "id": "h21tns7",
            "score": 2,
            "text": "remember when this kind of revelation would be on the evening news and lead to an immediate bouncing of the guilty or shamed individual and outrage from concerned citizens... now it's not even mentioned on any news, nothing happens, just par for the course",
            "title_similarity": "0.4028532",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h21tpjh",
            "score": 4,
            "text": "It’s incredible that such brazen corporate pandering in this country is considered legitimate politics.",
            "title_similarity": "0.5119558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21tz1w",
            "score": 7,
            "text": "On the one hand: What the fuck?\n\nOn the other hand: This is exactly what is implied by Citizens United and unlimited, anonymous PAC money in general, so no I should not be surprised.\n\nConclusion: Our system is extremely fucked. Time to vote only for folks who deliberately forego this sort of mega-donor money...",
            "title_similarity": "0.4733756",
            "sentiment_compound": -0.5462
        },
        {
            "id": "h21uvym",
            "score": 3,
            "text": "This is so ideologically fueled - quashing the \"far left\" as Manchin calls it, and ensuring \"private\" interests are viewed as the best possible outcome of all. This just shows you how much ideology surrounds centrist corporate guys like Manchin who are fighting tooth and nail for this shit to never end.",
            "title_similarity": "0.47013018",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h21v1b5",
            "score": 2,
            "text": "i’m considering becoming rich just so i can bribe the politicians of this country into being decent people",
            "title_similarity": "0.54484904",
            "sentiment_compound": 0.3687
        },
        {
            "id": "h21v8g6",
            "score": 1,
            "text": "This man leaves a terrible legacy for his family. Sad.",
            "title_similarity": "0.2901804",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h21w3l1",
            "score": 2,
            "text": "If Manchin somehow gets the John Lewis VRA passed, I'll be shocked. And if it's the only thing he gets done, I'll still be pleasantly surprised.",
            "title_similarity": "0.46141797",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h21wqdn",
            "score": 3,
            "text": "It seems Manchin doesn’t care which side pays him as long as he gets paid.  If I shook hands with him, I’d check to make sure I still had five fingers.",
            "title_similarity": "0.4713856",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h21x4o1",
            "score": 2,
            "text": "Bruh..",
            "title_similarity": "0.10630269",
            "sentiment_compound": 0.0
        },
        {
            "id": "h21x78s",
            "score": 1,
            "text": "Here’s a thought: maybe Manchin could be persuaded to drop the filibuster just for votes on admitting new states. If we could pass statehood for PR and DC before 2022 ...",
            "title_similarity": "0.5473146",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h21ysw9",
            "score": 1,
            "text": "So for the few people who think retiring lawmakers are free to do what they want, here is how it works:\n\n> When it came to Sen. Roy Blunt, a moderate Missouri Republican who voted no on the commission, Manchin offered a creative solution. “Roy Blunt is a great, just a good friend of mine, a great guy,” Manchin said. “Roy is retiring. If some of you all who might be working with Roy in his next life could tell him, that’d be nice and it’d help our country. That would be very good to get him to change his vote. And we’re going to have another vote on this thing. That’ll give me one more shot at it.”",
            "title_similarity": "0.5553085",
            "sentiment_compound": 0.9828
        },
        {
            "id": "h21yu99",
            "score": 2,
            "text": "So uh can we pressure our representatives to just ignore manchin and call the vote already? This is the biden presidency, not the manchin presidency....",
            "title_similarity": "0.44695657",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h21z7oe",
            "score": 1,
            "text": "So, basically, this guys ego rivals drumpf’s.",
            "title_similarity": "0.3883892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h222sis",
            "score": 3,
            "text": "The grubby hands of Joe Liberman are all over this, giving another round of rat fucking to the country.",
            "title_similarity": "0.3313616",
            "sentiment_compound": 0.4118
        },
        {
            "id": "h22368e",
            "score": 6,
            "text": "In most other western societies this would be a massive scandal. In America it’s just another Wednesday.\n\nShithole country.",
            "title_similarity": "0.50295067",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h223nao",
            "score": 2,
            "text": "Corrupt ass mother fucker",
            "title_similarity": "0.18104428",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h225l6m",
            "score": 2,
            "text": "Ummmm, can we start eating these people yet?",
            "title_similarity": "0.24054033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2285wq",
            "score": 2,
            "text": "And they are still allowed to use the filibuster to further the interests of their corporate masters. How?",
            "title_similarity": "0.53234786",
            "sentiment_compound": 0.25
        },
        {
            "id": "h229ea0",
            "score": 2,
            "text": "When are people going to start having consequences for their corruption?",
            "title_similarity": "0.3593718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h229q66",
            "score": 3,
            "text": "He is 2-faced. He makes it clear through Op-Eds he is against reform. And then back-room he tells these scumbag donors that he “might be open to reform” just so they have incentive to bribe 3 Republicans into doing the right thing.\nAlso, the fact this is a fucking Joe Leiberman PAC is infuriating. Fuck that bastard.\nImagine seeing Machin and Leiberman having there noses’s flattened",
            "title_similarity": "0.56382823",
            "sentiment_compound": -0.9008
        },
        {
            "id": "h22a49c",
            "score": 6,
            "text": "Let's not mince words here; a sitting US Senator asked billionaires and wealthy executives to bribe a fellow US Senator.",
            "title_similarity": "0.7223599",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h22l588",
            "score": 6,
            "text": "With his statements from this audio leak - he is literally promoting corruption.\n\nWhy isn't this audio leak more controversial? Manchin is a corrupt politician. Clearly. He should be embarrassed and humiliated for his statements (would like to convince he could be convinced into voting for reasonable causes, like say, democracy - but I'm not holding my breath).",
            "title_similarity": "0.4574603",
            "sentiment_compound": 0.5059
        },
        {
            "id": "h22qjv2",
            "score": 2,
            "text": "Is the raw recording available somewhere or is that podcast the only way to hear snippets of it?",
            "title_similarity": "0.38981888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22tx9s",
            "score": 1,
            "text": "I thought it was a poorly composed painting at first",
            "title_similarity": "0.1544505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h22uujx",
            "score": 6,
            "text": "America doesn’t need a *bi-partisan* infrastructure bill; America needs an infrastructure bill that meets the needs of the country.\n\nAmerica doesn’t need a *bi-partisan* bill to protect voting rights; America needs a bill to protect voting rights.\n\nNo Labels is operating like a personification of the  “All Lives Matter” retort.",
            "title_similarity": "0.34312087",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h22v6wi",
            "score": 5,
            "text": "So this dude uses some of the most obvious coded language i've ever heard in soliciting his billionaire donors to bribe another politician, and this shit is somehow legal? I need an ELI5 man.\n\nHow/why is this even a thing?",
            "title_similarity": "0.68577087",
            "sentiment_compound": -0.7105
        },
        {
            "id": "h238foy",
            "score": 1,
            "text": "So proof senators don’t make the decisions, their donors do. So should we be holding elections based on the donors wants instead? Tell us your plans for the money you give before we vote. Ugh. I hate our country.",
            "title_similarity": "0.54492474",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h239xqc",
            "score": 1,
            "text": "Help me understand how continuing to vote for moderates is a solution to this country’s long-term woes. \n\nWhat does a moderate do besides tread water on important issues like campaign finance reform? If reading shit like this piece doesn’t push you to the progressive wing of the party, than you’re a completely lost cause.",
            "title_similarity": "0.56699926",
            "sentiment_compound": 0.5279
        },
        {
            "id": "h23cxlj",
            "score": 1,
            "text": "Lol I used to work for No Labels and this is par for the course. Everybody hates the org leadership and realizes the mission is BS after one day, so not surprised that a staffer likely leaked this.",
            "title_similarity": "0.42391473",
            "sentiment_compound": -0.6751
        },
        {
            "id": "h23dq39",
            "score": 1,
            "text": "The best government money can buy.",
            "title_similarity": "0.4105953",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h23fxq8",
            "score": 1,
            "text": "Please end legalized bribery. A serious democratic government doesn’t need donations to politicians.",
            "title_similarity": "0.39532763",
            "sentiment_compound": 0.25
        },
        {
            "id": "h23i6gr",
            "score": 1,
            "text": "It's comforting to know that our \"democracy\" is almost completely run by the big corporations and the rich thanks to the Supreme Court. I guess there's really no reason to vote anymore.",
            "title_similarity": "0.61847746",
            "sentiment_compound": 0.8836
        },
        {
            "id": "h23n598",
            "score": 1,
            "text": ">The meeting was hosted by the group No Labels, a big money operation co-founded by former Sen. Joe Lieberman that funnels high-net-worth donor money to conservative Democrats and moderate Republicans.\n\nThe asshole that keeps on giving.",
            "title_similarity": "0.728024",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h240vi0",
            "score": 1,
            "text": "But immigrants, am I right?",
            "title_similarity": "0.29411006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h243f81",
            "score": 2,
            "text": "Yet another confirmation that the billionaire donors run the government .",
            "title_similarity": "0.7023723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2459jf",
            "score": 1,
            "text": "This sickens me",
            "title_similarity": "0.06670706",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h24wg4u",
            "score": 1,
            "text": "So when will the criminal prosecutions be?",
            "title_similarity": "0.36962003",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h25dg85",
            "score": 1,
            "text": "Spread the word on the media isn't covering it. It's sad a call this big and the media hides it. Our whole system is screwed. Spread it everywhere you can.",
            "title_similarity": "0.35569698",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h25dki4",
            "score": 1,
            "text": "Media is covering for him. Like he did something good on that corrupt phone call.",
            "title_similarity": "0.58351505",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h27vx7y",
            "score": 1,
            "text": "Joe Manchin thinks he is Pink Floyd...\nHe isn't.",
            "title_similarity": "0.2051889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h28cbky",
            "score": 1,
            "text": "Manchin is shitty for a lot of what he does, and I would ask him to just abandon his love of the filibuster pronto, and there are legal questions about what he said here...\n\n**BUT**\n\nThis was him doing his job, and for the right cause.  He was trying to get respected, well connected moderates to get republicans to vote for something that's the right thing to do.",
            "title_similarity": "0.49326918",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h3a2j0z",
            "score": 1,
            "text": "He's a scummy POS and so is his daughter. It's a fucking cesspool for real. They don't give a flying fuck about America. Literally fuck this entire family.",
            "title_similarity": "0.3143778",
            "sentiment_compound": -0.7906
        }
    ]
}