{
    "Schumer now backing Sanders plan to add dental, vision and hearing coverage to Medicare\n": [
        {
            "id": "h2iztv1",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.44536883",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h2jeobq",
            "score": -3,
            "text": "“This seems popular. Let’s give it some lip service up until it’s time for the rubber to hit the road. Then we’ll blame the failure on republicans and ask for donations.”",
            "title_similarity": "0.5573589",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2jjog2",
            "score": 2,
            "text": "\\*yawn\\* call me back when it happens",
            "title_similarity": "0.41180056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jaac6",
            "score": -2,
            "text": "This could, and should be an Onion article.",
            "title_similarity": "0.26099318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2joh2i",
            "score": -1,
            "text": "Oh hey, it only took the complete and total foreclosure of any chance for Sanders to be president to get this turd on board with Sanders' ideas.\n\nVery cool, democrats, very good party.",
            "title_similarity": "0.4846814",
            "sentiment_compound": 0.839
        },
        {
            "id": "h2jh10q",
            "score": -4,
            "text": "Thanks for doing the bare minimum, ya centrist dick.",
            "title_similarity": "0.32241005",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2jj2xn",
            "score": 1,
            "text": "He's so afraid AOC will run for his seat and I love it.",
            "title_similarity": "0.3499303",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2jkcx6",
            "score": 0,
            "text": "Won’t happen. He’s a loser",
            "title_similarity": "0.059422035",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2jes2t",
            "score": 10,
            "text": "Bernie has always been right, the rest of us are just catching up! 🙌",
            "title_similarity": "0.37768704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jiv4w",
            "score": -5,
            "text": "The dentist are the worst. Always a short aggressive dude with a teenage wife and a Lamborghini. I see you have a cavity and are in severe pain and make 400$ a week I can fix it for 5500$ but I will help you out by letting you pay 1500 a month at 57% interest or you can go home in pain.",
            "title_similarity": "0.40479627",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2jikia",
            "score": 9,
            "text": "Of course he does, now that it has no chance of passing. Just like he supports 50k of student debt cancelation. If something happens and we have a slip stream legislation body, his tune will go right back to the DNCs mainline positions.",
            "title_similarity": "0.55956197",
            "sentiment_compound": 0.1926
        },
        {
            "id": "h2jtjzz",
            "score": 1,
            "text": "I'm thumbs upping this story, but 'Liberal Leader Agrees to Actually Take Liberal Position For a Change' is a truly pathetic headline to have to celebrate.",
            "title_similarity": "0.52690494",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h2jinn1",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2klwzm",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2j281j",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2j7vso",
            "score": 14,
            "text": "It is insane that it’s not already covered. How fucked broken backwards is this country. \n\nAlso, the obligatory fuck Bezos, Musk, Zuckerberg, and also Ajit Pai.",
            "title_similarity": "0.22825795",
            "sentiment_compound": -0.9287
        },
        {
            "id": "h2jft2u",
            "score": 5,
            "text": "Bernie is getting shit done. \n\nImagine if Congress were filled with people who gave a damn as much as he did.",
            "title_similarity": "0.4157602",
            "sentiment_compound": -0.743
        },
        {
            "id": "h2jfa33",
            "score": -16,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2jc5zr",
            "score": 5,
            "text": "The greatest trick the devil ever pulled, was convincing insurance companies that certain parts of the body shouldn’t be covered by “regular insurance”.",
            "title_similarity": "0.42115426",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h2j24zd",
            "score": 84,
            "text": "Schumer slowly backing more and more progressive ideas probably to solidify his re-election incase AOC decided to run for Senate.",
            "title_similarity": "0.61261344",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2jileh",
            "score": 2,
            "text": "So....they don't have the votes to do anything",
            "title_similarity": "0.029897992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k6wbh",
            "score": -4,
            "text": "Democrats are really good at increasing the cost of insurance.",
            "title_similarity": "0.51238173",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h2jh4f2",
            "score": 0,
            "text": "That's dumb, \"health\"care should just cover \"health\", not other weird random things like \"health of teeth\", \"health of eyes\", \"health of heart\" etc.",
            "title_similarity": "0.4902777",
            "sentiment_compound": 0.6017
        },
        {
            "id": "h2ji9g0",
            "score": 4,
            "text": "The Cheap solution is to stop requiring a 14 year degree for something Europe teaches in 7 years.\n\nBut hey I guess physicians owning mansions is more important than a robust healthcare system.",
            "title_similarity": "0.5383674",
            "sentiment_compound": 0.6994
        },
        {
            "id": "h2jye9w",
            "score": 0,
            "text": "Just support giving everyone the whole thing already you Gonzo looking asshole.",
            "title_similarity": "0.3944952",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2jyst7",
            "score": 0,
            "text": "\"...Well, there goes the Dental plan...\"\n\"...Amy needs braces...\"\n...\"Dental Plan...\"",
            "title_similarity": "0.63589525",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2k0sqc",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2k1hdz",
            "score": 0,
            "text": "He bailed on cannabis reform. All thanks to Joe Biden the anti cannabis prohibitionist",
            "title_similarity": "0.49572113",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2k30dl",
            "score": 0,
            "text": "*sigh*\n\nIt would be much more valuable to the country to spend that money to reduce the Medicare age instead.",
            "title_similarity": "0.5816313",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h2k6vne",
            "score": 0,
            "text": "I need this infinite money glitch the dems got.",
            "title_similarity": "0.2934428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k7bb3",
            "score": 0,
            "text": "Damn that sounds expensive. Oh wait never mind, it’s free!",
            "title_similarity": "0.18728438",
            "sentiment_compound": -0.6902
        },
        {
            "id": "h2k8be9",
            "score": 0,
            "text": "Prepping for votes in the 2022 election!",
            "title_similarity": "0.3922661",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k9rb0",
            "score": 0,
            "text": "uhh huh.  Sure.  And just how does he plan to get it, or anything for that matter, passed with the filibuster in place?  How about we deal with that problem first?",
            "title_similarity": "0.35312977",
            "sentiment_compound": -0.168
        },
        {
            "id": "h2kp7dg",
            "score": 0,
            "text": "Medicare does not equal Infrastructure.",
            "title_similarity": "0.22757442",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kqop7",
            "score": 0,
            "text": "Why don’t we give health care to people that don’t have it first. Boomers strike again.",
            "title_similarity": "0.5052947",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2kvry3",
            "score": 0,
            "text": "Yes yes yes, let's give the Boomers more exclusive benefits",
            "title_similarity": "0.4243956",
            "sentiment_compound": 0.895
        },
        {
            "id": "h2kyc0m",
            "score": 0,
            "text": "Medicare is basically bankrupt now. Giving away money always sounds so wonderful and caring….until you have to pay the bills.",
            "title_similarity": "0.4988171",
            "sentiment_compound": 0.4838
        },
        {
            "id": "h2j8suz",
            "score": 97,
            "text": "How about fully backing Sander’s plan and expand said Medicare for everyone? We can even call it, Medicare for All? I bet it would poll at over 50% of Republicans even and 70-80% amongst Democrats. Might even have the added benefit of preventing medical bankruptcies, which is more than every other type of bankruptcy combined in this country. \n\nJust a thought…",
            "title_similarity": "0.6607622",
            "sentiment_compound": 0.7143
        },
        {
            "id": "h2j3s66",
            "score": 25,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2j2yhi",
            "score": 12,
            "text": "Hopefully the next step is raising the bar on restrictions for lower income families into get on Medicare.",
            "title_similarity": "0.6756717",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2jddv3",
            "score": 6,
            "text": "American health care, where your eyes and teeth aren't included in most plans. We are rubes.",
            "title_similarity": "0.49906036",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2jpldb",
            "score": 6,
            "text": "I lived in China and Korea and health Care wasn't even a talking point. My uninsured hospital trip in China was about $5 if that. My insured trips in Korea was $10 both including the medicine. In Korea I paid $100 a month for the national plan (percentage of your salary + being a foreigner, wife paid $30) in the states we are easily paying $350+ every two weeks plus copay and medicine cost, also whatever costs the insurance company decides not to pay.\n\nBut the fact that I said China makes me a socialist/communist. 🙄🤦",
            "title_similarity": "0.3854031",
            "sentiment_compound": 0.4493
        },
        {
            "id": "h2j8ojf",
            "score": 1,
            "text": "Whatever it takes to get this crap across the finish line, just do it.",
            "title_similarity": "0.39286318",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2jbulp",
            "score": 1,
            "text": "Yes please I support that 100%",
            "title_similarity": "0.3370368",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2jdqtb",
            "score": 1,
            "text": "Great, can’t wait till im on medicare",
            "title_similarity": "0.6165866",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2jdtqh",
            "score": 1,
            "text": "Health insurance is such a joke and scam it hurts .",
            "title_similarity": "0.24300331",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h2jf500",
            "score": -1,
            "text": "Nop! He wanted to transcend dental medication.",
            "title_similarity": "0.6111139",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jlt0k",
            "score": 1,
            "text": "Wel, well, well. Looks like the crazy socialist was right all along. Go figure, huh?  Love you Bernie. :)",
            "title_similarity": "0.42036992",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h2jo5u1",
            "score": 1,
            "text": "how many times is he going to flip flop on this? i swear it's every other year now he has a different opinion on the matter",
            "title_similarity": "0.277731",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2jotq7",
            "score": -1,
            "text": "The money is there, if we would stop giving it away to other countries.",
            "title_similarity": "0.37066227",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2jvr2v",
            "score": -1,
            "text": "Lovely. Give more shit to boomers that didn't pay for it and keep making younger generations pay fo me it...",
            "title_similarity": "0.3982308",
            "sentiment_compound": -0.0508
        },
        {
            "id": "h2jzp5s",
            "score": -1,
            "text": "He got the go ahead from his insurance company donors",
            "title_similarity": "0.53507733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k02mc",
            "score": 1,
            "text": "That taxes should go up on everyone's taxes, let us understand that. All the countries that have these great benefits tax even lower incomes to get them.",
            "title_similarity": "0.43367422",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h2k03f6",
            "score": -1,
            "text": "How about actually doing something to decrease outrageous cost of healthcare in the US before allocating more tax money towards it? Throwing more money at a problem is not going to solve the root cause of the outrageous prices in healthcare. It’s a bloated system with too many middleman taking their big cuts without actually doing much of anything. Even the doctors are a bunch of profiteering assholes.",
            "title_similarity": "0.4168962",
            "sentiment_compound": -0.9422
        },
        {
            "id": "h2k1zcf",
            "score": -1,
            "text": "Never bought into lizard people but Schumer looks like a lizard.",
            "title_similarity": "0.24731155",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h2k65dr",
            "score": 1,
            "text": "Before we worry about the Boomers’ freaking vision and dental, how about getting the rest of us some medical??  Sorry, we can’t give you chemo junior, grandma needed new glasses and dentures.\n\nEdit: spelling",
            "title_similarity": "0.6223829",
            "sentiment_compound": -0.6553
        },
        {
            "id": "h2k6ld2",
            "score": 1,
            "text": "Lol almost makes you wonder who won the election. I'm living this Joe Sanders Presidency.",
            "title_similarity": "0.53309834",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h2k9wod",
            "score": 1,
            "text": "He's only doing this cause he's up for election. If he actually gave a fuck he would've done something, ANYTHING to go way further than this in the last 20 years and for all the time he's he been a minority and majority leader. Schumer doesn't give a fuck just like the rest of the Establishment dems who are just there for the paycheck and will \"sign on\" to bills but when the vote comes don't care enough to wake up.",
            "title_similarity": "0.4242501",
            "sentiment_compound": -0.4619
        },
        {
            "id": "h2kaghs",
            "score": -1,
            "text": "Yet another thing we don’t have the money for and is still so crappy it’s not even worth the debt it brings on.",
            "title_similarity": "0.12538673",
            "sentiment_compound": -0.8308
        },
        {
            "id": "h2kaidk",
            "score": 1,
            "text": "Great. That only puts us at 30 ir so years behind the rest of the civilized and most of the uncivilized world. Congrats all around!\n\nGod, if only Manchin wasn't such a spineless twat looking out for his own ass in all this. We might actually have a working healthcare system.",
            "title_similarity": "0.48075345",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h2kbxq9",
            "score": 1,
            "text": "No... government healthcare for EVERYONE or don't do it.\n\nMedicare is only for people 65 and older and some disabilities. Adding dental/vision/hearing to Medicare doesn't do diddly squat to fix any of the problems that exist in our private healthcare system that has resulted in just flat economic abuse of health care in this country.\n\nMedicare is not health care. It's just another health insurance. We have to stop thinking of \"providing government healthcare\" as providing government funding of insurances. It's just feeding money into insurances that feed that money into the mouths of private healthcare companies who are allowed and encouraged by that money trough to charge as much as they want and to focus only on affluent customers. It's like centipede but the backend is the good end.\n\nGet rid of private healthcare and go to real government healthcare. This nickel and dime bullshit around the edges isn't fixing any of the underlying problem and isn't really improving healthcare for anyone.",
            "title_similarity": "0.55896854",
            "sentiment_compound": -0.8844
        },
        {
            "id": "h2ke9lj",
            "score": -1,
            "text": "Who cares anymore, give it all away, it will destroy everyone’s will to work and have pride. Let’s all sit around and get big and live off others.",
            "title_similarity": "0.27540317",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2kmbvj",
            "score": 1,
            "text": "Great so more boomers get to leach every last drop from our country and planet right before they all die and leave us in a hell hole",
            "title_similarity": "0.27646375",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h2knwuo",
            "score": 1,
            "text": "I need free mental health care to help me deal with this heavy white guilt.",
            "title_similarity": "0.51214504",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h2kptmq",
            "score": -1,
            "text": "Dental? Even for meth addicts?",
            "title_similarity": "0.5196022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ksif5",
            "score": -1,
            "text": "Oh good. More free stuff for Boomers.",
            "title_similarity": "0.32928845",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h2l9af6",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2m1uux",
            "score": -1,
            "text": "Schumer, sanders, pelosi, aoc, Harris……all of them should get Covid and do America a favor.",
            "title_similarity": "0.6272646",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2jg8cp",
            "score": 2,
            "text": "Yes. And now if we could also add the “for all” part, I’d love it, thanks.",
            "title_similarity": "0.5072311",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h2jj1yh",
            "score": 2,
            "text": "M4A = Medicare for All. Just an fyi",
            "title_similarity": "0.56140304",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2jj2l2",
            "score": 2,
            "text": "Yet the establishment Dems are protecting Manchin. Easy to support populist reforms when they have no chance of passing with the filibuster in place. Unless he is willing to go budget reconciliation, this is one big load of crap basically.",
            "title_similarity": "0.5614575",
            "sentiment_compound": 0.3094
        },
        {
            "id": "h2jj7ar",
            "score": -2,
            "text": "Yeah the insurance is cheap until you try to buy something.",
            "title_similarity": "0.36884904",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2jjfxa",
            "score": 2,
            "text": "\"But Bernie's never passed anything!\"\n\nHe doesn't have to. He pushes the agenda. I'm fine with that.",
            "title_similarity": "0.2687474",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h2jkhe6",
            "score": 2,
            "text": "I’ve given up. I literally canvassed door to door for nearly a year around 2011 for m4a. Never again. People were so ridiculous and uninformed and just half of people were “u want insurance, get a job bum” and antagonistic to people canvassing. And this was California! The gaslighting and lies have already taken over then, people will never accept what it really is given how fox addresses it. Yes there were many that were amazing, and I can think of a few people who just handed up cash or brought us sushi or whatever, but the ones that stand out were the mean obstinant, over my dead body will America go socialist and this was BEFORE trump",
            "title_similarity": "0.36262655",
            "sentiment_compound": -0.8521
        },
        {
            "id": "h2jpaqr",
            "score": 2,
            "text": "Schumer now backing anything the moves the Democrats agenda forward. No bipartisanship. Go hard to the left Schumer",
            "title_similarity": "0.49951962",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2k219k",
            "score": -2,
            "text": "Who pays? The govment? They is us!!!!",
            "title_similarity": "0.2929773",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kiuy2",
            "score": 2,
            "text": "Dental and vision insurance is such a scam.",
            "title_similarity": "0.4928258",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2knehk",
            "score": 2,
            "text": "Yeah, let's give boomers more of what they stole from millennials",
            "title_similarity": "0.47280514",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2kruyy",
            "score": 2,
            "text": "Let's recall Schumer then.\n\nWe need universal healthcare and it should include *everything*, especially mental health care.",
            "title_similarity": "0.63531303",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h2j8u48",
            "score": 32,
            "text": "The fact that Dental, Vision, Mental Health and Vision are all separate pieces of health with separate coverage to these scumbag piece of shit insurance companies is insane. It’s fucking HEALTH insurance which should include ALL my health.",
            "title_similarity": "0.44314343",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h2jp7lw",
            "score": 9,
            "text": "Why is this even a debate. Bad teeth can lead to heart disease. Complete Healthcare should be free for all. It will save America more money if it gave everyone healthcare for free. Preventive care. Greatest country can't even afford basic life necessity. \n\nShelter, Food and water, medical care. Free in a truly free society",
            "title_similarity": "0.5631884",
            "sentiment_compound": 0.9843
        },
        {
            "id": "h2jlsvj",
            "score": -11,
            "text": "That means the Democrats fear losing and therefore need to buy more votes from the women and beta males.",
            "title_similarity": "0.4060622",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h2j80uq",
            "score": 2,
            "text": "Holy shit would that be nice.",
            "title_similarity": "0.22915606",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2jb1k8",
            "score": -3,
            "text": "Bernie right again? Color me shocked.",
            "title_similarity": "0.26109192",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2jb4gd",
            "score": 2,
            "text": "I still don’t get why they’re treated separately to begin with. They’re part of my body, so they should be covered. It’s so dumb!",
            "title_similarity": "0.32490656",
            "sentiment_compound": -0.674
        },
        {
            "id": "h2jd11h",
            "score": 3,
            "text": "Dental work is way too expensive. Get it done.",
            "title_similarity": "0.42616397",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jdg37",
            "score": 2,
            "text": "I want everyone to take a step back and think. You buy HEALTH insurance but you have to pay out of pocket for dental, vision, and hearing. All of which are important to live a healthy quality of life",
            "title_similarity": "0.63542885",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h2je7gn",
            "score": 4,
            "text": "Dental care should be part of health insurance period. It’s a medical industry money grabbin scheme that it isn’t. Especially when dental decay is so closely linked to heart disease.",
            "title_similarity": "0.64899576",
            "sentiment_compound": 0.6637
        },
        {
            "id": "h2jempm",
            "score": 3,
            "text": "Dental heal is heart health. Paying for routine dental care is much cheaper than paying for recovery care after a heat attack.",
            "title_similarity": "0.5433829",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h2jwdqj",
            "score": -3,
            "text": "Whatever they can do to justify raising taxes",
            "title_similarity": "0.48341388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k8rgc",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.06798727"
        },
        {
            "id": "h2l2tx7",
            "score": 2,
            "text": "The United States is a fucking embarrassment when it comes to meeting the basic needs of it's citizens.",
            "title_similarity": "0.3088321",
            "sentiment_compound": -0.101
        },
        {
            "id": "h2j8esi",
            "score": 5,
            "text": "The fact that eyes, ears, and mouth are not covered in medical is just absurd.",
            "title_similarity": "0.12084095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jaxsu",
            "score": 4,
            "text": "Still so confused as to why it's separated at all.",
            "title_similarity": "0.06320002",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h2jdcyd",
            "score": 4,
            "text": "Eyes, teeth, and ears aren't luxury add-on's you should only get insurance for if you're wealthy.  This is well past due.",
            "title_similarity": "0.46596548",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2je7vj",
            "score": 5,
            "text": "That Medicare doesn’t currently cover dental and vision is embarrassing. I don’t understand our American system, it’s so miserly. I guess that’s how we got so rich? Or, how some of us got so rich. \n\n I think each senator and rep should be restricted to the worst health plan offered in their state. Things might change for “ordinary Americans” (a totally insulting term) then.",
            "title_similarity": "0.46835935",
            "sentiment_compound": -0.5686
        },
        {
            "id": "h2k16p4",
            "score": -3,
            "text": "Sure, our kids and grandkids can pay for that too.",
            "title_similarity": "0.51530546",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2j9j6f",
            "score": -13,
            "text": "Which is paid for with what money?",
            "title_similarity": "0.13143532",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jg463",
            "score": 14,
            "text": "OK, cool. Now give it to all tax payers.",
            "title_similarity": "0.49291372",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2j97mh",
            "score": 6,
            "text": "Cool, now just add all Americans to Medicare and we're set.",
            "title_similarity": "0.6131853",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2jjhis",
            "score": -5,
            "text": "Good.  I think this vote buying scheme will work.",
            "title_similarity": "0.50779164",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2jjjak",
            "score": 5,
            "text": "And medicaid please. Don't just appease the elderly. This is good, they definitely need it, but they're still missing a large demographic.\n\nWhile we're at it. m4a please?",
            "title_similarity": "0.5436937",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h2jk25d",
            "score": -6,
            "text": "Hospitals currently lose money on medicare patients how exactly are hospitals to survive medicare for all?",
            "title_similarity": "0.48643848",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2jnujl",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.06798727"
        },
        {
            "id": "h2jhukw",
            "score": 5,
            "text": "This is interesting. I have checked the current medicare website and there are NO dentists within 15 miles who participate in medicare (yes, medicare will currently pay for dental care under very limited conditions involving some other medical disease that affects the oral cavity). And I live in a moderately large city.  Unless Medicare requires dentists to participate somehow, this may be a rather empty gesture.",
            "title_similarity": "0.5017042",
            "sentiment_compound": 0.3125
        },
        {
            "id": "h2jpcj8",
            "score": 8,
            "text": "Schumer knows if he doesn't play progressive ball he's going to be primaried by AOC. 100 bucks there is polling that shows her beating him in a challenge. There is 0% reason for him to go this route less that being the reason. He's been in charge of the senate forever and NOW he's found his progressive balls. Funny how that works.",
            "title_similarity": "0.52282774",
            "sentiment_compound": -0.211
        },
        {
            "id": "h2jjimv",
            "score": -9,
            "text": "Lol\n\nNo where in the world does their healthcare policies cover all this shit.\n\nNo where. Not even in your biggest socialist utopias.\n\nBut why not here? 30 trillion in debt. Why not add some more?",
            "title_similarity": "0.46925223",
            "sentiment_compound": -0.7604
        },
        {
            "id": "h2jjvoj",
            "score": 9,
            "text": "My friend, he is much older than me, complains about how expensive his hearing aids were. He is retired and the cost is a considerable burden. I think the seniors could use some help.",
            "title_similarity": "0.40647435",
            "sentiment_compound": 0.0276
        },
        {
            "id": "h2j4zyg",
            "score": -31,
            "text": "Yay more spending! Just what the bloated budget needs. Free shit for all, let the babies pay for it, oops aborted them all.",
            "title_similarity": "0.44208434",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h2j2ye0",
            "score": 11,
            "text": "Past time for this to happen",
            "title_similarity": "0.15053123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2j5b09",
            "score": 12,
            "text": "yeah, i'd like that. i don't need haircuts or hygiene expenses included, but i do like being able to see, hear, and eat.",
            "title_similarity": "0.41106343",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h2je717",
            "score": -12,
            "text": "Oh does Sanders have a plan? Yeah? Maybe he's advocating for something? Did he say something or make a speech?\n\nClassic Sanders. Call me when, after decades, he actually achieves something.",
            "title_similarity": "0.6068008",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h2jgaa2",
            "score": 38,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2je6a5",
            "score": 17,
            "text": "he can back it all he wants if he doesn't think it has a serious chance of passing.",
            "title_similarity": "0.3657675",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2j98ee",
            "score": 19,
            "text": "Why health coverage is not head to toe baffles me medications as well.",
            "title_similarity": "0.46376285",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2j3b6l",
            "score": 1289,
            "text": "Want people to support M4A?  Inform them it includes dental, optical and hearing aids, *which it does*!\n\n&#x200B;\n\nhttps://www.politico.com/story/2019/08/28/medicare-for-all-obamacare-2020-democrats-poll-1476437\r  \n\r  \nPoll: Dems more likely to support candidate who backs Medicare for All over fixing Obamacare\r  \n\r  \nAccording the POLITICO/Morning Consult poll out Wednesday, 65 percent of Democratic primary voters would be more likely to support a candidate who wants to institute a single-payer health care system like Medicare for All; 13 percent said they’d be less likely to back a candidate based on that support.\r  \n\r  \nAs an aside, I've been unable to find a single poll that asks about the benefits of M4A, such as ...\r  \n\r  \nWould you support M4A if you knew it included dental?\r  \n\r  \nWould you support M4A if you knew it included optical?\r  \n\r  \nWould you support M4A if you knew it included the right to go to any doctor or care facility in the nation?\r  \n\r  \nWould you support M4A if you knew it meant you could change jobs without worrying about losing coverage?\r  \n\r  \nWould you support M4A if you knew it meant no co-pays, deductibles or drug charges?\r  \n\r  \nI'm not suggesting a poll should only ask about the benefits. By all means ask about taxes, losing private insurance, abortion, etc. But I don't think I'm out on a limb to suggest that a poll that mentions the benefits of M4A in addition to possible negatives will return even more favorable results. Gotta wonder why no polls do that.",
            "title_similarity": "0.6994672",
            "sentiment_compound": 0.9753
        },
        {
            "id": "h2j38l3",
            "score": 3657,
            "text": "What type of bs healthcare is this that’s already in place? “You can be toothless, deaf, and blind but hey your heart is still pumping so it’s all good.”\n\nAmerica is an embarrassment to the world for us to be so arrogant.",
            "title_similarity": "0.50350416",
            "sentiment_compound": -0.741
        },
        {
            "id": "h2j28ra",
            "score": 24,
            "text": "Lisa needs braces...",
            "title_similarity": "0.41216183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ji2nc",
            "score": 25,
            "text": "Also how about those veterans who for some reason get 100% medical coverage but fuck their teeth, right?",
            "title_similarity": "0.61421853",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h2j7mgz",
            "score": 469,
            "text": "Good this is popular nationwide, put it on the floor for a vote as a stand alone bill, stop debating good ideas, let Americans see the republicans no votes!",
            "title_similarity": "0.44915187",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h2j5fbe",
            "score": 91,
            "text": "[deleted]",
            "title_similarity": "0.09585929"
        },
        {
            "id": "h2j4utx",
            "score": 45,
            "text": "It's long past time for all three to be covered.  Even if you have \"good insurance\" the prices of these three are always two thirds more than whatever the insurance covers.",
            "title_similarity": "0.31311578",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2jnxrd",
            "score": 50,
            "text": "I don't understand why dental, vision and hearing are separate from \"health.\"  They're a part of my body and therefore a part of my overall health.",
            "title_similarity": "0.548586",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2jc2gj",
            "score": 1961,
            "text": "I hope they remove the shitty annual maximums too. Dental is often $2k max per year even for the top-end ones. And, of course, you have coinsurance with the insurance (30-50% minimum) even up to that $2k, so in reality you're likely paying at least $1k out of pocket before hitting the max, after which everything is out of pocket. I don't even know how it's called insurance; it's a complete scam for anyone that needs anything more than a routine cleaning. \n\n*Then* anything that is more along the lines of oral surgery, e.g. wisdom teeth extraction? Lol, good luck! Doesn't fall under medical insurance, and half the time dental doesn't cover it. Even if it does, it's often 50% coinsurance and it's *expensive* so you're out $500+ per wisdom tooth (more if you've had any work during the year since you'd go way over the annual maximum). As a direct example, I had to get one wisdom tooth out when I was still on my dad's plan. He had the best his work offered because I've always had issues with my teeth. Even with insurance, it was over $750 for a single wisdom tooth that was already through the gum.\n\nEdit: Thanks for the silver, I'll see if my dentist can use it in my next filling to save a little money.",
            "title_similarity": "0.4461848",
            "sentiment_compound": 0.9808
        },
        {
            "id": "h2jfszc",
            "score": 1013,
            "text": "It’s crazy to me that the party full of Christian conservatives would be upset with this.",
            "title_similarity": "0.3215804",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2j1awj",
            "score": 326,
            "text": "This is something that impacts the elderly and Medicare coverage would be a huge benefit to them.",
            "title_similarity": "0.58118933",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2j8dbg",
            "score": 1,
            "text": "That would be great, but there's still the 20% you'd owe if you don't have an expensive secondary plan. It's all bandages.",
            "title_similarity": "0.45106485",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h2jakyv",
            "score": 211,
            "text": "People severely underestimate the importance of oral health on overall health.  Neglecting oral health is like speed running to several general health issues, and in some cases, death.  It's no joke.",
            "title_similarity": "0.41933206",
            "sentiment_compound": -0.8266
        },
        {
            "id": "h2jfd1z",
            "score": 1,
            "text": "What about food and water?  Can’t live without that long enough to cash in on dental and vision if you starve to death!",
            "title_similarity": "0.5634833",
            "sentiment_compound": -0.7263
        },
        {
            "id": "h2jfdbi",
            "score": 1,
            "text": "Why wasn't dental covered? Dental problems like tooth infections can spread to other parts of the body, which would be more dangerous and more expensive to treat.",
            "title_similarity": "0.3904713",
            "sentiment_compound": -0.1604
        },
        {
            "id": "h2jfk7p",
            "score": 1,
            "text": "Will this mean that the VA also covers dental?",
            "title_similarity": "0.68043613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jflgu",
            "score": 2,
            "text": "Medicaid covers dental but very few accept it because they don't pay enough.",
            "title_similarity": "0.40809172",
            "sentiment_compound": 0.6441
        },
        {
            "id": "h2jfljk",
            "score": 1,
            "text": "NHS dental coverage is pretty crap. This would actually surpass plenty of European countries.",
            "title_similarity": "0.49176645",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2jfvfs",
            "score": 1,
            "text": "Adding dental, vision and hearing to Meicare has been discussed as long as I can remember.   When did it become Bernie's plan?",
            "title_similarity": "0.6471976",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2jg77v",
            "score": 2,
            "text": "But those are *premium* bones and senses. /S",
            "title_similarity": "0.3487761",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jg7kt",
            "score": 1,
            "text": "They aren't already?  Seems like old people need these things.",
            "title_similarity": "0.30245343",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h2jgpb3",
            "score": 1,
            "text": "Yay old people get m4all and UBI...wait are they living the world we all dreamed of?",
            "title_similarity": "0.5368118",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h2jgxbt",
            "score": 1,
            "text": "Anyone with eyes, teeth, or ears should be able to understand the basic logic of including all parts of your body in health care.\n\nWell, at least anybody that isn't making money off pretending that ears, eyes, and teeth dont count as body parts.",
            "title_similarity": "0.5804428",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2jh4dy",
            "score": 1,
            "text": "Good for Schumer.  However, is he still okay with somebody going bankrupt because they develop a brain tumor?  Is he still fine with tens of thousands of Americans dying each year because they don't have access to basic medical care?  Why does he think somebody is entitled to hearing aids but not insulin?",
            "title_similarity": "0.48091772",
            "sentiment_compound": 0.4386
        },
        {
            "id": "h2jhbl5",
            "score": 1,
            "text": "Canada should already be there.",
            "title_similarity": "0.38937986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jhnnu",
            "score": 8,
            "text": "Now do Medicaid.",
            "title_similarity": "0.50596416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jhqps",
            "score": 2,
            "text": "I spent 4k for my father's dental work 2 years ago.  I then spent nearly another 4k on dental work for my mother. This needs to happen! This is why old folks have no teeth",
            "title_similarity": "0.4723975",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h2jhuq3",
            "score": 7,
            "text": "I cannot fucking believe that it wasn’t already included! \n\n\nOh waittaminute - forgot I’m American for a sec there: nope, not surprised a bit. Private health insurance barely covers Dental!",
            "title_similarity": "0.4717844",
            "sentiment_compound": 0.2679
        },
        {
            "id": "h2jhwph",
            "score": 2,
            "text": "This fucking country man. What pathetic trash this is a debate",
            "title_similarity": "0.09070694",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2ji2kw",
            "score": 2,
            "text": "No! I like having two seperate systems based on wealth.",
            "title_similarity": "0.28664488",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h2jib4t",
            "score": 3,
            "text": "This would be great!",
            "title_similarity": "0.22269979",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h2jiee1",
            "score": 5,
            "text": "TIL: They weren't covered???",
            "title_similarity": "0.03846678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jifxr",
            "score": 2,
            "text": "It is ridiculous that teeth and eyes don't fall under normal health insurance.",
            "title_similarity": "0.3793371",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2jine1",
            "score": 2,
            "text": "It's ridiculous that it wasn't included with Medicare in the first place",
            "title_similarity": "0.32833087",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2jinf2",
            "score": 3,
            "text": "Schumer seems to be one of the only elderly members of our government willing to embrace progressive change.",
            "title_similarity": "0.5035838",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2jixk9",
            "score": 2,
            "text": "I've never understood why I need separate dental and vision insurance.  My teeth and eyes are not special body parts that need a separate policy.  My dick is the special one and they cover that with my regular health insurance!",
            "title_similarity": "0.5728247",
            "sentiment_compound": -0.2846
        },
        {
            "id": "h2jiybz",
            "score": 1,
            "text": "As someone who was raised in a family that relied heavily on Medicare & struggle with basic dental coverage this legit made my day",
            "title_similarity": "0.64434373",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2jizra",
            "score": 2,
            "text": "Wow it's almost like they want to insure that humans are properly cared for",
            "title_similarity": "0.42237276",
            "sentiment_compound": 0.8335
        },
        {
            "id": "h2jj6z2",
            "score": 2,
            "text": "Wow, maybe my grandma can finally get a hearing aid so I can finally talk to her on the phone without shouting the same things over and over. -_-",
            "title_similarity": "0.55491316",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2jjm7u",
            "score": 9,
            "text": "I never understood how dental and vision isn’t covered under medical insurance, as if they’re optional or something",
            "title_similarity": "0.3381583",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2jjpsp",
            "score": 2,
            "text": "lets do it",
            "title_similarity": "0.18551207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jjz5r",
            "score": 2,
            "text": "Here’s hoping Dems bust out a whole bunch of policy right before mid terms",
            "title_similarity": "0.42222184",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2jk21v",
            "score": 1,
            "text": "Republicans calling it communist in 3…2…1",
            "title_similarity": "0.28509957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jk2xi",
            "score": 2,
            "text": "My conservative brother just posted a meme that asked why his teeth and eyeballs need their own insurance. Maybe the winds of change are shifting?",
            "title_similarity": "0.56377614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jk5h8",
            "score": 2,
            "text": "I’ll never understand why dental vision and hearing aren’t part of health insurance from the beginning",
            "title_similarity": "0.45863193",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2jk6b4",
            "score": 1,
            "text": "\"I just remembered... old people vote!\"",
            "title_similarity": "0.3908223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jk6jv",
            "score": 1,
            "text": "I would not want there product.  I am ready for the  free market to take over.",
            "title_similarity": "0.37700236",
            "sentiment_compound": 0.6786
        },
        {
            "id": "h2jk8a2",
            "score": 2,
            "text": "If only the Democrats had majorities in Congress, then they could get on with it.",
            "title_similarity": "0.48591506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jkby9",
            "score": 2,
            "text": "of course he does, because he can reliably count on Manchin, Sinema and a number of other corporate establishment Dems to kill any chance of it passing.",
            "title_similarity": "0.39036",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2jkfvg",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2jkfyj",
            "score": 2,
            "text": "I read somewhere recently that changing to giving 100% of the country free healthcare could cost less than Medicare does now.  Even if that's not completely correct it still seems worth doing.",
            "title_similarity": "0.5873552",
            "sentiment_compound": 0.765
        },
        {
            "id": "h2jkoye",
            "score": 1,
            "text": "If you are opposed to this, what the hell is wrong with you",
            "title_similarity": "0.086821616",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h2jkrtt",
            "score": 3,
            "text": "*Manchin and Sinema laugh hysterically*",
            "title_similarity": "0.18246368",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2jkwlw",
            "score": 2,
            "text": "Do we have to make it harder to expand medicare to everyone?",
            "title_similarity": "0.5390802",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2jkys1",
            "score": 3,
            "text": "Separating them was wrong to begin with.",
            "title_similarity": "0.102522396",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2jl2qk",
            "score": 3,
            "text": "I guess you can keep proposing stuff like this but it's going no where with the filibuster and Manchin in the way. I guess at least you can get a tally of who are the traitors in congress to the needs for lower and middle class voters.",
            "title_similarity": "0.4416054",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h2jl3l1",
            "score": 1,
            "text": "I have to pay almost 800 dollars for a mouth guard for my TMJD. I'm in a lot of pain and suffering but, TMJD is dental and even with a good dental insurance it's not covered. Dental is just as important for physical health, I've thought about sucicid because of my TMJD and the migraines it gives me, but I haven't thought about suicide for really anything else besides my OCD. I'd pay more taxes just to know that if I need a root canal or a TMJ replacement, I don't have to worry and I can get all the care I need.",
            "title_similarity": "0.5237514",
            "sentiment_compound": 0.9365
        },
        {
            "id": "h2jl4i7",
            "score": 2,
            "text": "Joe manchin enters the chat….",
            "title_similarity": "0.28521782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jl8eo",
            "score": 2,
            "text": "I’m on SSI. I love my government health care. I feel British.",
            "title_similarity": "0.6288315",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h2jlbxv",
            "score": 1,
            "text": "BREAKING NEWS: Elderly man backs other elderly man's plan to help the elderly.",
            "title_similarity": "0.46068865",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2jlbzs",
            "score": 1,
            "text": "I’ve been looking at Hearing Aids. Only the Salesmen know the value of hearing aids it’s impossible to compare one to the other. They are very different from each other. I look forward to the government agency which would give me quality that I can depend on and if they didn’t give me what I needed I would have the government with me to complain.",
            "title_similarity": "0.48939377",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2jlde9",
            "score": 1,
            "text": "Whoa. We get to see, hear AND eat now!?!",
            "title_similarity": "0.40077835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jlf3v",
            "score": 2,
            "text": "Too little too late. Also, the Democrats can't make anything happen, so this is just lip service anyway.",
            "title_similarity": "0.3645987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jlgq6",
            "score": 1,
            "text": "But don’t worry about millennials or Gen z.",
            "title_similarity": "0.2366582",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h2jli9u",
            "score": 1,
            "text": "Fuxk I hate Schumer",
            "title_similarity": "0.12598222",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2jlplt",
            "score": 1,
            "text": "That's a good idea. We don't want to mimic European medical systems. You seen the teeth on some of those on the lower end of the social strata in England. Americans aren't faring any better either. With the current medical system in this country. When it comes to dental and vision issues.",
            "title_similarity": "0.608057",
            "sentiment_compound": 0.0186
        },
        {
            "id": "h2jlq0e",
            "score": 1,
            "text": "Pretty sure he just got old like Bernie, lost hearing, is like damn this shit kinda expensive to fix 😂",
            "title_similarity": "0.3079789",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2jlrvs",
            "score": 1,
            "text": "Great, now we just need to tell Democrats to raise the reimbursements back up to where they were before Obamacare knocked it down to .25 on the dollar. (and yes, it's still that low even though politicians claim it's not. Chat with a doctor or two when you get a chance)\n\nThere is a reason why the vast majority of medical facilities and doctors stopped taking medicare/medicaid patients...it was costing them out of pocket to treat patients. \n\nIf you actually call around and check, you may be surprised how few places there are that will take it now. You want to add all that extra? Great, you STILL need to have dentists and optometrists and ENTs accept it. \n\nSee people don't seem to realize this. You can give EVERYONE Medicare with full benefits tomorrow, but unless doctors and medical facilities get reimbursed to a point they aren't paying to treat people, You won't have a place to go.",
            "title_similarity": "0.56842005",
            "sentiment_compound": 0.7659
        },
        {
            "id": "h2jlyws",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.33459026",
            "sentiment_compound": 0.68
        },
        {
            "id": "h2jm7ts",
            "score": 1,
            "text": "Will Medicaid be included?",
            "title_similarity": "0.51457596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jmd2c",
            "score": 1,
            "text": "Does it also include a free Lamborghini?",
            "title_similarity": "0.45367137",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2jmdek",
            "score": 1,
            "text": "A happy and healthier America will be more productive and probably less pissed off? Seems like a win-win to me.",
            "title_similarity": "0.46905053",
            "sentiment_compound": 0.3167
        },
        {
            "id": "h2jmdsi",
            "score": 2,
            "text": "I shudder to think of the repercussions that will occur if we don't make drastic changes to our nation's Healthcare policies. Especially once all of the boomers come to the age where they are largely completely dependent on us for care.",
            "title_similarity": "0.47736895",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2jmej6",
            "score": 1,
            "text": "Ye if only their is money for it",
            "title_similarity": "0.21656996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jmh6n",
            "score": 1,
            "text": "“First they ignore you, then they laugh at you, then they fight you, then you win.",
            "title_similarity": "0.18977086",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2jml3i",
            "score": 1,
            "text": "This will be added to the-bill-that-McConnel-is-going-to-block-anyways-regardless-of-its-content act of 2021",
            "title_similarity": "0.4136567",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jmnwu",
            "score": 1,
            "text": "Doesn't matter until you end the filibuster. Who cares until that happens. Waste of time.",
            "title_similarity": "0.2183501",
            "sentiment_compound": 0.0325
        },
        {
            "id": "h2jmoll",
            "score": 1,
            "text": "Laughs in german.",
            "title_similarity": "0.29282668",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2jmrm7",
            "score": 3,
            "text": "This is long overdue. Covering vision, dental and hearing can help seniors avoid dementia - which is a huge burden for families and increases health care costs.",
            "title_similarity": "0.6860864",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2jmrz7",
            "score": 1,
            "text": "This is no way to bilk the public!",
            "title_similarity": "0.03826637",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h2jn08f",
            "score": 2,
            "text": "Prosthetic coverage - including maintenance and repair - is essential. Don’t treat people’s limbs as durable medical equipment subject to 20% copay. It’s ludicrous.",
            "title_similarity": "0.46012688",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2jn3ls",
            "score": 1,
            "text": "Only Americans would some how leave out dental, vision and hearing from a fucking health care plan.",
            "title_similarity": "0.5332908",
            "sentiment_compound": 0.6461
        },
        {
            "id": "h2jn50y",
            "score": 1,
            "text": "It's hard to believe that teeth, eyes, and ~~ears~~ hearing are considered optional components for general health.",
            "title_similarity": "0.44443256",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2jn65k",
            "score": 1,
            "text": "Call me when they get rid of the filibuster or primary Schumer for thinking the majority leader is supposed to be a concierge for his caucus.",
            "title_similarity": "0.48191983",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jn9iq",
            "score": 1,
            "text": "Blasphemy. But, but where will the Insurance Tic's get their blood?",
            "title_similarity": "0.39948636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jnc4i",
            "score": 1,
            "text": "This would be fantastic.  Life-changing, for me.  Contact lenses are $25/mo that I don’t always have.",
            "title_similarity": "0.41478446",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2jng6m",
            "score": 2,
            "text": "Why, WHY, are these things separate from medical in the first place?!",
            "title_similarity": "0.27789664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jnh1y",
            "score": 2,
            "text": "Look at Schumer trying to feed the Progressives a few crumbs because he’s scared of AOC.",
            "title_similarity": "0.39818907",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2jnmh6",
            "score": 1,
            "text": "Can we just nationalize all health care already? This dipping our toe into the water is such a joke.",
            "title_similarity": "0.41840595",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2jnpbq",
            "score": 2,
            "text": "How about expanding Medicare to the rest of tax payers while you're at it.",
            "title_similarity": "0.66761935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jnqne",
            "score": 1,
            "text": "Dental is so fucking expensive. We still tax feminine hygiene products though so good luck. US government doesn’t give a fuck about us.",
            "title_similarity": "0.514751",
            "sentiment_compound": 0.5453
        },
        {
            "id": "h2jo2yt",
            "score": 3,
            "text": "I’m conservative but this should have already happened. I have to admit I always that it did have it. I think almost everyone likes knowing their older family members have some kind of coverage.",
            "title_similarity": "0.5173476",
            "sentiment_compound": 0.6686
        },
        {
            "id": "h2jo7et",
            "score": 2,
            "text": "Good. Vision is an absolute racket. I know there’s firmoo and zenni, but it honestly chafes knowing I’ve had glasses cost 500 dollars with insurance.",
            "title_similarity": "0.40739745",
            "sentiment_compound": 0.7543
        },
        {
            "id": "h2jodep",
            "score": 2,
            "text": "Every American should get one free teeth cleaning a year. It goes a long way",
            "title_similarity": "0.4921531",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2jorcg",
            "score": 1,
            "text": "Considering since my MVA in 2016 I have been on Medicaid, and in the last year enrolled my father in Medicaid's- I have ZERO faith that even with the inclusion of vision and dental (which my Medicaid offers with extreme limitations as does Medicare currently) this won't be helpful to those enrolled. \n\nFor instance- I am not 35 and have NO molars in my mouth- from fracturing during my accident, and zero oral care in the hospital while wholly broken (both arms, a leg, back, ribs, eye socket blown out, collar done and shoulder broken) and unable to provide self care. \n\nThe damage done through the months to my teeth is not reversible. My dentist has sent me for second opinion even, and they determined it's a genetically super thin amount of enamel on my\nTeeth, and the medications which cause dry mouth as well as the fractured and micro fractures in my teeth made for the perfect storm. \n\nI've been OCD about my dental care for years including before my accident. And it's mentally torture for me to do my oral care and find new cavities... I've had teeth crumble while trying to eat. \n\nI've been on high dose Vit D since my accident as well as regularly have magnesium and potassium infusions. \n\nI have done everything in my power to maintain the little health I have, and it's a constant battle with prior authorizations and denials and appeals. To end up toothless... I've paid cash for a bridge ($3500 with root canal and extraction, buildup and bridge) and 2 crowns ($2400 for the work) and Medicaid won't pay to fill minor cavities. They offer limited services even when there is a traumatic injury cause. \n\nUntil PRIVATE insurance companies are not in the marketplace for Medicaid or Medicare and its supplements- this shit isn't gonna be any better. \n\nHealthcare in the US is laughable. That's my\nOpinion as not only an unfortunate burden to the medical system myself, but also as a nurse. \n\nWhen the insurance companies override physicians it's a problem. Let's not mention the extras- ophthalmology and dentistry. That blown out eye socket proved the eye care is shit as well. \n\nOne accident has completely handicapped my ability to survive as an adult, much less be able to provide form my 2 children.\n\nMore government agencies like SS/disability are inherently flawed. Healthcare is just an extension of the problem.",
            "title_similarity": "0.44750595",
            "sentiment_compound": -0.9363
        },
        {
            "id": "h2jox55",
            "score": 1,
            "text": "The establishment will bend to the will of the  people eventually.",
            "title_similarity": "0.39038274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2joyz8",
            "score": 1,
            "text": "The Boomers get everything, don’t they?",
            "title_similarity": "0.32334286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2joyzg",
            "score": 1,
            "text": "This sounds like a great plan as long as the dental coverage isn't the over the top American model where we spend 10X on dentistry as other countries.  Way too many kids/adults in the US get braces and other essentially elective treatments/checkups.",
            "title_similarity": "0.5995934",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h2jp3d3",
            "score": 1,
            "text": "I really hope so. I'm 29 and my teeth look so bad and I just want to get them fixed but I cant afford to so i just slowly watch them deteriorate.",
            "title_similarity": "0.40465447",
            "sentiment_compound": -0.1278
        },
        {
            "id": "h2jp5i2",
            "score": 1,
            "text": "Whatevs. Filibuster.",
            "title_similarity": "0.14480542",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jp63u",
            "score": 3,
            "text": "What was the point of having a healthcare plan for seniors when it doesn't include 3 of the biggest things that seniors need....",
            "title_similarity": "0.46956933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jpb0s",
            "score": 1,
            "text": "I like in other countries this kind of stuff is seen as the norm. Like if you talked to a Canadian or European they'd be aghast government Healthcare doesn't cover vision or dental",
            "title_similarity": "0.4604274",
            "sentiment_compound": 0.0926
        },
        {
            "id": "h2jpfg9",
            "score": 3,
            "text": "We should all have what Congress has. Period",
            "title_similarity": "0.42099553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jploc",
            "score": 1,
            "text": "Only because his baby boomer entitled voters are screaming at him.",
            "title_similarity": "0.38269818",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2jplsc",
            "score": 1,
            "text": "I’ve still never understood why health insurance doesn’t cover dental or vision…",
            "title_similarity": "0.31757584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jprq9",
            "score": 1,
            "text": "Is this a big deal? Or will it still go unchanged?",
            "title_similarity": "0.18801494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jpth0",
            "score": 3,
            "text": "I’m old and the fact that I have to pay for my own dental, vision, and hearing issues utterly astonishes me. I simply cannot afford it. So my hearing is bad but a hearing aid is out of the question, I need a dental implant but cannot afford that, and I’ve begun having eye problems but have to go with whatever is cheapest (which often doesn’t resolve my problems). At the very point in your life when these needs crop up, Medicare doesn’t cover them. And while I appreciate Sanders and Schumer standing up for us, I know it will never happen. This country doesn’t give a damn about anyone who isn’t rich.",
            "title_similarity": "0.4912386",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h2jptsx",
            "score": 1,
            "text": "But Biden would still veto M4A and the Senate Dems don’t care. Great",
            "title_similarity": "0.34390306",
            "sentiment_compound": 0.899
        },
        {
            "id": "h2jpwzw",
            "score": 2,
            "text": "It's pretty simple. Everyone gets the same plan the GOP Senators have. There's  no fight to approve something they already use.",
            "title_similarity": "0.43614963",
            "sentiment_compound": 0.658
        },
        {
            "id": "h2jq1xy",
            "score": 2,
            "text": "I'm in upstate NY. My sister flies to Mexico, stays a week, gets her dental done, and flies back. It is less expensive than dental here.",
            "title_similarity": "0.48782057",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jq2ig",
            "score": 2,
            "text": "Fine. Now some serious action. No more empty talk. No more empty promises.",
            "title_similarity": "0.2793004",
            "sentiment_compound": 0.3579
        },
        {
            "id": "h2jq8ac",
            "score": 2,
            "text": "I never understood why these are all extras anyway. Like my eyes are luxury organs and sight is just some bougie excessive expense.",
            "title_similarity": "0.27156502",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2jq8ns",
            "score": 3,
            "text": "It’s about fucking time.",
            "title_similarity": "0.17636035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jqc3h",
            "score": 2,
            "text": "Sounds great, but I hope they can find a way to deal with drug prices while they're in there. They certainly won't be able to get it passed unless they budget a chill pill for Joe Manchin.",
            "title_similarity": "0.5069599",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2jqcqf",
            "score": 2,
            "text": "Wait, why the fuck was hearing coverage not covered for SENIORS?",
            "title_similarity": "0.30569965",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2jqf0t",
            "score": 1,
            "text": "Omg.  Next the government will consider the uterus to be part of the body as well.",
            "title_similarity": "0.58440745",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2jqk6x",
            "score": 1,
            "text": "Oh god no. No provider will accept it",
            "title_similarity": "0.049363237",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2jql0y",
            "score": 1,
            "text": "Imo It’s the USA, it’s people should be treated very well with healthcare. We should be #1 even in comparison to euro countries. It’s unbelievable that’s not the case. No wonder everyone wants to be very rich so they can afford good health",
            "title_similarity": "0.5821321",
            "sentiment_compound": 0.8973
        },
        {
            "id": "h2jql7x",
            "score": 3,
            "text": "Long overdue.",
            "title_similarity": "0.18172276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jqlqu",
            "score": 2,
            "text": "It's one of those things where if you weren't already aware of how messed up our system is, you would assume 100% those things were already included.",
            "title_similarity": "0.39411283",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2jqr77",
            "score": 1,
            "text": "I'll believe it when he voted for it. Lip talk is irrelevant to a man vehemently against progressive policy in the past",
            "title_similarity": "0.40414178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jqwje",
            "score": 1,
            "text": "Cool story but let's put congress on Medicare and see how quickly Medicare improves",
            "title_similarity": "0.68135464",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h2jqwk4",
            "score": 1,
            "text": "Sounds like a lot of things Schumer needs",
            "title_similarity": "0.31775543",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2jr1cd",
            "score": 1,
            "text": "How to pay for it?",
            "title_similarity": "0.20714203",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2jr2p6",
            "score": 1,
            "text": "Bout time grandpa..now actually try FIGHTING for it and squeezing Biden to get on board!",
            "title_similarity": "0.38115984",
            "sentiment_compound": -0.5461
        },
        {
            "id": "h2jr3q3",
            "score": 1,
            "text": "good",
            "title_similarity": "0.16234562",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2jr48w",
            "score": 1,
            "text": "TIL Senator Schumer got a perfect SAT score.",
            "title_similarity": "0.485498",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2jr4to",
            "score": 2,
            "text": "LoL they won't push shit through, but they will say \"We tried!\" during the midterms.",
            "title_similarity": "0.46672165",
            "sentiment_compound": 0.486
        },
        {
            "id": "h2jr59z",
            "score": 1,
            "text": "I just had a family friend die from an infected tooth.  Could not afford treatment pulled it herself and died of infection.",
            "title_similarity": "0.34939188",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h2jr61s",
            "score": 1,
            "text": "Of all people, I think Schumer understands the need for Dems to embrace populist ideals. Good on him for a very big turn around since 2016.",
            "title_similarity": "0.5458114",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h2jr71b",
            "score": 1,
            "text": "Would be nice if we there youth that are paying it also got it. Or allow us to opt out and keep our Medicare cost.",
            "title_similarity": "0.57070845",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2jr7di",
            "score": 1,
            "text": "Now that he knows Manchin will not support it, they can pretend to be a progressive as possible and not actually get anything done",
            "title_similarity": "0.36305666",
            "sentiment_compound": -0.3935
        },
        {
            "id": "h2jrfny",
            "score": 1,
            "text": "If you really want to help people who need vision care, hit Luxottica with an antitrust lawsuit.",
            "title_similarity": "0.5261839",
            "sentiment_compound": 0.7818
        },
        {
            "id": "h2jriq4",
            "score": 1,
            "text": "Wow it’s almost like teeth and eyes are no longer a privilege to have lolz",
            "title_similarity": "0.3737748",
            "sentiment_compound": 0.8752
        },
        {
            "id": "h2jriza",
            "score": 1,
            "text": "This is what medicare should had been from the beginning.  I hope they pass it.",
            "title_similarity": "0.626673",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2jrllq",
            "score": 1,
            "text": "Imagine if car insurance was like our broken health insurance. lol",
            "title_similarity": "0.48659107",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2jrnok",
            "score": 1,
            "text": "I will never understand why dental, vision, and hearing are separate from standard medical care.",
            "title_similarity": "0.42397535",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2jrx62",
            "score": 1,
            "text": "Okay could they hurry though..  I haven't seen a dentist in three years and my glasses are 6 years old...\n\nThey don't understand that we need things NOW in Washington",
            "title_similarity": "0.37571862",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2js12d",
            "score": 1,
            "text": "Why are teeth/eyes/ears not covered for maintenance under insurance? Or for diseases or injuries. Like they are attached to bodies...should be covered under regular insurance.",
            "title_similarity": "0.5196455",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2js2rc",
            "score": 2,
            "text": "what?!?!!? keeping your population healthy is a priority for these sick people? whats next these degenerates are going to try and educate the population more as well? sick and tired of these deranged people trying to keep people healthy and educated. the only path forward is to keep the population in economic slavery and suffering. otherwise the US is doomed or the ultra wealthy are. I know for sure which group I want to disappear.",
            "title_similarity": "0.43626112",
            "sentiment_compound": -0.9405
        },
        {
            "id": "h2js4ec",
            "score": 2,
            "text": "They should also include an option to buy into Medicare, as an alternative to buying private health insurance.",
            "title_similarity": "0.646169",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2js4ia",
            "score": 2,
            "text": "Why is mental health being left out?",
            "title_similarity": "0.19268551",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2js4ur",
            "score": 1,
            "text": "Dental insurance has been bs for so long",
            "title_similarity": "0.50548005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2js8vx",
            "score": 1,
            "text": "It amazes me how dental health isn't included in most Healthcare plans. You usually have to opt into it. It makes no sense.",
            "title_similarity": "0.4044172",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2jsffq",
            "score": 1,
            "text": "That’s cause his teeth ears and eyes are probably shit!",
            "title_similarity": "0.27276385",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h2jsmd8",
            "score": 1,
            "text": "Problem in my area is, good luck finding a dentist that accepts Medicare that isn't a fucking quack. Had a molar taken out, but he didn't get all the roots. Broke a drill bit and left it in there. Got infected, so much fucking pain. Had to pay out of pocket at a different dentist to get it all fixed.\n\nIt's expensive being poor.",
            "title_similarity": "0.51272637",
            "sentiment_compound": -0.9537
        },
        {
            "id": "h2jstac",
            "score": 1,
            "text": "Poor vision is a leading cause of falls in the elderly (leading to hip fractures, etc.), and hearing loss can worsen confusion and dementia.  Dental decay increases risk for heart attack.  It never made any sense to me that these important pieces of overall health care were carved out of Medicare coverage.  I hope the House and Senate will see the wisdom and cost effectiveness of including coverage for these things.",
            "title_similarity": "0.58422095",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2jsxxn",
            "score": 1,
            "text": "This is great if you're over 65, But I'm still fucked because I can't afford any health insurance",
            "title_similarity": "0.3786382",
            "sentiment_compound": -0.6757
        },
        {
            "id": "h2jsyov",
            "score": 1,
            "text": "Thanks to a genetic disorder, I need thousands and thousands in dental and jaw work.  Medicare won’t cover it and the Medicare advantage plans wouldn’t have covered my health issues.  This really needs to pass.  My health is definitely impacted by my oral health and only having SSDI as my sole source of income, I have to just sit here and Tylenol away the pain.",
            "title_similarity": "0.5614134",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2jt0ho",
            "score": 1,
            "text": "I’ve always thought regular medical insurance should cover dental needs. I don’t know how they get away with excluding dental.  It would be like, “Oh, BLue Cross Blue Shield will cover your medicals EXCEPT broken arms.  If you break your arm you have to go to an arm doctor and that’s separate and not covered.”  It just doesn’t make sense!",
            "title_similarity": "0.58505166",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h2jt7rg",
            "score": 2,
            "text": "Good. Why dental and vision aren't considered medical has always mystified me.",
            "title_similarity": "0.4000553",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2jtmpb",
            "score": 1,
            "text": "Good luck",
            "title_similarity": "0.21475141",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2jtvtq",
            "score": 1,
            "text": "Remember, kids,  teeth are luxury bones.",
            "title_similarity": "0.3901407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jtvut",
            "score": 1,
            "text": "I’ve had a partial denture for 12 years. I’ve wanted implants since day one but could never afford them. My insurance would cover but the max per year was $1000.  Last year I had enough credit set aside that I was going to just pay what my dentist said it would be which was $5000 per tooth so after insurance I’d be paying $9000 on a credit card. My dentist took preliminary scans of my mouth and was worried that it had been too long since I’ve had dentures for so long that the bone less may be too great for implants now. Because I could never afford them, now I can’t get them.",
            "title_similarity": "0.51103306",
            "sentiment_compound": 0.8765
        },
        {
            "id": "h2jtxnt",
            "score": 1,
            "text": "My daughter has Autism among other medical ailments, she just had brain surgery last year…she is on Medicaid and SSI disability. \nI have been taking her to the same private dental office for over a decade for routine dental care, cleanings every 6 months, X-rays snd the very occasional filling. \nWe were informs last year that we could no longer be accommodated there. The dentist was leaving a new one was taking over and “too many people were taking advantage of the free dental care” 👀😳😲 wtf??? Seriously??? \nHow exactly does one take advantage of the bare minimum, bottom of the barrel, Medicaid plaque cleanings?? Elitist, discriminatory BS, but of course there is no “class protection” for poor.",
            "title_similarity": "0.55981565",
            "sentiment_compound": -0.7359
        },
        {
            "id": "h2jtxop",
            "score": 2,
            "text": "Tax payer funded universal healthcare is what we want.",
            "title_similarity": "0.6765101",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2ju18y",
            "score": 1,
            "text": "So I might get to see a dentist if I live to be 65?",
            "title_similarity": "0.62003833",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ju2og",
            "score": 1,
            "text": "thanks, oh generous overlord",
            "title_similarity": "0.3443469",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h2ju54g",
            "score": 1,
            "text": "Fuck America shit hole",
            "title_similarity": "0.15568462",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h2juagi",
            "score": 1,
            "text": "Lets spend more money we don't have on things that are preventable...",
            "title_similarity": "0.31160966",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2juc20",
            "score": 1,
            "text": "Is this medicare for all or are we giving retirees even more benefits?",
            "title_similarity": "0.64125955",
            "sentiment_compound": 0.6478
        },
        {
            "id": "h2juc22",
            "score": 1,
            "text": "This is good, but, if something isn’t done about healthcare for people BEFORE they’re old enough for Medicare, they’ll already be blind, deaf, and toothless by the time they’re that old - if they live that long.",
            "title_similarity": "0.5316191",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2jud2v",
            "score": 1,
            "text": "This is where most countries fall behind. Having healthy gums/teeth is as important as having a healthy heart (in fact, it's an important part of having a healthy heart). On top of that, having poor dentistry can hold a person back socially—and economically.",
            "title_similarity": "0.49234402",
            "sentiment_compound": 0.9501
        },
        {
            "id": "h2jufsw",
            "score": 8,
            "text": "My dad (72) had to go to Mexico for new dentures that here in the U.S. would of cost $5K for $850 in Mexico.",
            "title_similarity": "0.46300268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jug6x",
            "score": 3,
            "text": "These aren’t parts of Medicare?!??!?!??!??!!",
            "title_similarity": "0.29006436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jujb8",
            "score": 1,
            "text": "Wow that's great expect most people still don't qualify",
            "title_similarity": "0.13074589",
            "sentiment_compound": 0.836
        },
        {
            "id": "h2jukxo",
            "score": 3,
            "text": "We’re going to pay taxes for the rest of our lives... just give us free medicine. Why am I paying $300 for an inhaler with out of pocket insurance?",
            "title_similarity": "0.58628744",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2jutiw",
            "score": 1,
            "text": "Who cares, the shitbag Joe Manchin won't vote for anything. It's all futile",
            "title_similarity": "0.09270252",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2juxpd",
            "score": 3,
            "text": "Jesus fucking Christ. Why this is even a discussion is insane to me. Obviously those things should be covered, good lord.",
            "title_similarity": "0.27720547",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2jv7nh",
            "score": 1,
            "text": "Those are luxury body parts and shouldn’t be covered.",
            "title_similarity": "0.16110697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jvbip",
            "score": 1,
            "text": "Another bill that moderate Dems can support because they know it can’t actually pass.",
            "title_similarity": "0.38508382",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2jvcnk",
            "score": 3,
            "text": "Dental health is so very closely linked to overall health. It's crazy it's not covered.",
            "title_similarity": "0.5633734",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2jve4m",
            "score": 1,
            "text": "Schumer is acting like he's had his shit pushed in by feral progressives.",
            "title_similarity": "0.3520735",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2jvecs",
            "score": 1,
            "text": "This legislation would unanimously pass in a NY minute if there was a provision in the bill to fund semi-automatic weapons for fetuses. Repubs would fall all over themselves to vote for it, Fox \"News\" would be salivating, and Tucker Carlson (heir apparent to Bill O'Reilly) would be exultant.",
            "title_similarity": "0.4971584",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2jvf9t",
            "score": 1,
            "text": "Once again, this is laughable and why politics is so frustrating with the masses. \n\nModerates during primary: \"how are they going to pay for all this medical coverage, it's too expensive\" \n\nModerates now that a candidate is in office who does not support universal medical access: \"There's people dying in the street.\"\n\nI'll say it again, Trump winning the election and Dems controlling both houses would have been a far better outcome long term for universal medial coverage than the totally fake progressive ideas Joe Bidden is pushing on folks. What a joke.",
            "title_similarity": "0.4443487",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h2jvok2",
            "score": 1,
            "text": "In the article, Schumer is quoted saying \"and so we have to galvanize support from the public\". Genuine question - what does this actually mean? (i.e. Isn't the article already a publicity effort to do just this?) \n\nMy (likely poor) interpretation of was that there are key moderate Republican statesmen that need to be written or otherwise appealed to by the public. If correct, which ones are they?",
            "title_similarity": "0.47573924",
            "sentiment_compound": -0.2359
        },
        {
            "id": "h2jvqos",
            "score": 1,
            "text": "It’s great that some government officials are finally recognizing human anatomy. Now to get the insurance oligarchs to do the same.",
            "title_similarity": "0.68718374",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2jvx9d",
            "score": 1,
            "text": "Is that LBJ?",
            "title_similarity": "0.16640657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jvzmt",
            "score": 4,
            "text": "My parents are on Medicare and have to have supplemental insurance because Medicare really isn't great.",
            "title_similarity": "0.45750555",
            "sentiment_compound": -0.5533
        },
        {
            "id": "h2jw92m",
            "score": 1,
            "text": "As an optician who used to work in DC I was super surprised that the DC medicaid actually covered glasses for adults. (I know medicaid isn't medicare.) Surprised, but pleased, because seriously how on earth does someone get a job and get *off* of medicaid if they can't see properly? Like... this should be a no-brainer.",
            "title_similarity": "0.48118085",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h2jw9yk",
            "score": 6,
            "text": "I bet the private big private Medicare (Medicare Advantage) plans are going to lobby like hell to stop this. These are the bread and butter for private medicare plans to remain competitive with one another.",
            "title_similarity": "0.5621337",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2jwb6m",
            "score": 1,
            "text": "Aka let them eat cake",
            "title_similarity": "0.32779297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jwbw1",
            "score": 3,
            "text": "Would be nice, ya know, if Manchin would vote for it and break the filibuster.",
            "title_similarity": "0.4086891",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2jwdo8",
            "score": 2,
            "text": "Could you do something about all the states that refused Medicare expansion in the first place?",
            "title_similarity": "0.46053314",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2jwf7l",
            "score": 1,
            "text": "I starting to wonder if Bernie isn't more influential remaining \"just\" a senator.",
            "title_similarity": "0.42447254",
            "sentiment_compound": -0.3865
        },
        {
            "id": "h2jwgbt",
            "score": 1,
            "text": "They’re just gonna hit us with a maximum of like 1000$ a year so you’re still gonna be paying out of pocket. “Insurance” is a fucking scam",
            "title_similarity": "0.41971517",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h2jwjmo",
            "score": 1,
            "text": "I'm certain Schumer is going to try to appeal more to the progressive left over the next 2 years and then blame Mitch for never pulling the trigger on anything. After re-election in 2022 if he gets control of the senate he'll go back to calling progressives unrealistic.",
            "title_similarity": "0.5106734",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2jwmkg",
            "score": 1,
            "text": "On a relative cost basis dental covers less and costs more than medical coverage.. the medical care coverage can easily outstrip the premium and total benefits are magnitudes better.",
            "title_similarity": "0.5061779",
            "sentiment_compound": 0.8858
        },
        {
            "id": "h2jwp10",
            "score": 1,
            "text": "Aka he needs more votes, so he needs to look like a good guy.....",
            "title_similarity": "0.4262635",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2jwyd8",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.095859244"
        },
        {
            "id": "h2jx3ji",
            "score": 2,
            "text": "The whole\nBody is healthcare.",
            "title_similarity": "0.42459372",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jx4om",
            "score": 2,
            "text": "I feel like he knows Joe \"Chuck Koch's personal puppet\" Manchin is going to block it, and so it's safe for him to back this without any real chance of it getting passed.",
            "title_similarity": "0.480914",
            "sentiment_compound": 0.259
        },
        {
            "id": "h2jxe8p",
            "score": 3,
            "text": "Maybe extend it to all Americans too?",
            "title_similarity": "0.43374458",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2jxei0",
            "score": 1,
            "text": "About dam time!!!",
            "title_similarity": "0.23530224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jxfg4",
            "score": 3,
            "text": "It pisses me off to no end how badly regular old people get ROBBED in this country. For God's sake the USA is an absolute embarrassment. the private insurance framework in this country should be considered a God damned human rights violation.",
            "title_similarity": "0.3043127",
            "sentiment_compound": -0.9231
        },
        {
            "id": "h2jxfsl",
            "score": 2,
            "text": "Now only if Biden and the rest of them supported it",
            "title_similarity": "0.32609737",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2jxr5c",
            "score": 1,
            "text": "I still want him out. Corrupt motherfucker.",
            "title_similarity": "0.28120214",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h2jxrfu",
            "score": 1,
            "text": "Add Rx coverage back.",
            "title_similarity": "0.37878445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jxxmu",
            "score": 2,
            "text": "Schumer doesn’t give a fuck. He’s worried about losing his spot to a progressive.\n\nThis is also proof that progressive pressure works, and doesn’t “split the party”",
            "title_similarity": "0.46245563",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h2jxz9t",
            "score": 1,
            "text": "Coming to you live from the tibia rehabilitation conference",
            "title_similarity": "0.49643043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jy4b7",
            "score": 1,
            "text": "Lip service to curry favor with progs. Nothing will come of this, move along.",
            "title_similarity": "0.3883425",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2jy7xa",
            "score": 1,
            "text": "Those luxury bones can finally be covered?!?",
            "title_similarity": "0.4579956",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jy8lz",
            "score": 2,
            "text": "Ok but they also need to raise the limit for Medicare or at least the poverty line",
            "title_similarity": "0.6018733",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h2jyaz1",
            "score": 2,
            "text": "About time to help the most vulnerable in the country, Sadly this government only cares about the families with a ton of children.They are handing out money left and right to the families with a ton of children even those who never lost their jobs throughout the pandemic but because they have a ton of children they are getting all the BIG benefits, BIG stimulus money, Big tax credits and lots of food stamps.While the most vulnerable in the country struggle with high inflation prices.The homeless, veterans, disabled, and people on social security only got crumbs of the pie.  Their priority is helping the families with a ton of children, so if you don't fall under that category, you are doomed.pass the word out, democrats only care for the families with children, the rest, can just keep struggling with high prices,bills being shut off, medical bills to pay etc",
            "title_similarity": "0.42727306",
            "sentiment_compound": 0.8246
        },
        {
            "id": "h2jycxh",
            "score": 1,
            "text": "Dental plan!",
            "title_similarity": "0.5742077",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jydqn",
            "score": 2,
            "text": "It's totally embarassing that this hasn't been active all along.",
            "title_similarity": "0.13059384",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h2jye5a",
            "score": 2,
            "text": "Seriously. Dental vision and hearing are really fucking important to a persons overall well being.",
            "title_similarity": "0.6375648",
            "sentiment_compound": 0.5819
        },
        {
            "id": "h2jyftr",
            "score": 3,
            "text": "Just a ploy to capture senior votes... I'm betting they want to take money from our Social Security fund now...",
            "title_similarity": "0.4917847",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2jygqs",
            "score": 1,
            "text": "It's funny how everyone loves Bernie for 3-1/2 years, then is totally ok with him being completely screwed over by the elitist foundation in the DNC, and then go right back to loving him for another 3-1/2 years.",
            "title_similarity": "0.43872708",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2jyj44",
            "score": 2,
            "text": "As a Republican, I actually support this whole-heartedly. Everyone should be covered for these services, it’s ridiculous not to! (Though I don’t call it a “right” since I don’t think we have the right to other people’s labor, I still think it’s something that as a society we should agree to provide - maybe parsing words there).  \n  \nA couple points to convince our other Republican friends:  \n  \n- moving these coverages to Medicare actually makes it a lot easier to hire employees! No more employer headache about health coverage  \n- it makes YOU more mobile! Don’t worry about how you’ll be covered for healthcare between jobs again… not just the “lazy fucks”, but this is an issue for career driven people as well!  \n- these programs actually big-time subsidize poor red states at the expense of rich states. West Virginia, South Dakota, etc would benefit disproportionately compared to what they’re paying in, which maybe a random citizen doesn’t care but it’s a big reason for such Senators to vote for it.  \n  \nI will say though, big time against any provision to outlaw overlapping coverage. Maybe I’m paranoid, but I don’t want the government 100% dictating what doctors and nurses are paid (etc) or what treatments/meds are allowed for what. I really don’t care if it’s cheaper, it’s worth it in order to avoid tyranny by bureaucracy.    \n  \nAnyway thank you for reading and I hope we can work together on making a better country <3",
            "title_similarity": "0.6168421",
            "sentiment_compound": 0.9868
        },
        {
            "id": "h2jyrr7",
            "score": 1,
            "text": "Why only medicare? My teeth will all be gone by the time I'm in my 60s.",
            "title_similarity": "0.49977207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jys2l",
            "score": 1,
            "text": "I wonder if he got that idea at the Seventh Avenue Street Fair in Brooklyn yesterday.",
            "title_similarity": "0.2988792",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2jyslc",
            "score": 1,
            "text": "I actually really like this. It reminds me of Mary Kondo's advice to thank the items you own before donating them out throwing them away. I think it helps us take stock of what we have in our lives and what we should be grateful for instead of just mindlessly consuming and throwing things away, and feeling empty inside for lack of connection to anything stable or meaningful.",
            "title_similarity": "0.4766022",
            "sentiment_compound": 0.8955
        },
        {
            "id": "h2jyttw",
            "score": 1,
            "text": "Cool how boomers are the only people who ever get anything at all in our country",
            "title_similarity": "0.13998783",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2jytus",
            "score": 1,
            "text": "All that should be part of health insurance. All those things are part of your body. A person shouldn't need 2 or 3 separate premiums for their single body.",
            "title_similarity": "0.51802343",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jyzx4",
            "score": 2,
            "text": "Dude’s still scared of a primary haha",
            "title_similarity": "0.12952931",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2jz4u8",
            "score": 1,
            "text": "When ears, eyes, and teeth aren't a human right, you know nestlé is selling them.",
            "title_similarity": "0.48855996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2jz74x",
            "score": 1,
            "text": "I have pretty severe dental problems. I'm on medicaid at just over 40. I've had to travel 400 miles to a clinic I will have to pay thousands of dollars even at this clinic. Mind you I can't \"afford\" this. I am going to deplete what is left of my savings and go broke because I want to be able to do two simple things. Chew and smile. I don't think that's a lot to ask for my mental and physical health but the U.S. does not and has never cared. The system is broken and I've lost faith in all of it.",
            "title_similarity": "0.44791263",
            "sentiment_compound": -0.7991
        },
        {
            "id": "h2jza3w",
            "score": 1,
            "text": "The Millennials are/will be the largest voting block.  Medicare improvements appease the Boomer voting block and they are on their way out.  Is this to influence the mid-terms?",
            "title_similarity": "0.6307827",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2jzc36",
            "score": 1,
            "text": "Sick, I can't wait for the insurance companies and the providers of their services to duke it out over pricing and end up hyperinflating them for all consumers.",
            "title_similarity": "0.3845251",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2jzi1n",
            "score": 1,
            "text": "haven't watched a lot of bs lately. Are any proposals being made to offer this to the public to compete against insurance companies? I mean I already pay into medicare, can't they just take another couple hundred and give me insurance? Instead of the Insurance comp charging my employer $1k/month, thus lowering my salary",
            "title_similarity": "0.4798405",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h2jzsn7",
            "score": 1,
            "text": "When countries spend billions on bombs to kill people they can afford this.",
            "title_similarity": "0.40226418",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2jzu0t",
            "score": 1,
            "text": "They can’t even afford the Medicare they have now.  There is another 11 percent gross cut slated for this year.   Medicare is going to be the new Medicaid very soon",
            "title_similarity": "0.49743518",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h2jzuxp",
            "score": 2,
            "text": "Oh, yeah. This is great to see. I want to see the Democratic Party embrace it's progressive wing, not try to silence it. Even if everyone doesn't magically become a progressive, it would be nice to see progressives influence legislation. The addition of hearing coverage hits close to harm, too, because I am hard of hearing.",
            "title_similarity": "0.5909709",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2jzy6b",
            "score": 2,
            "text": "Manchin be like: BuT WAiT iT’s NOt BiPaRtiSan !!!",
            "title_similarity": "0.11403184",
            "sentiment_compound": 0.3871
        },
        {
            "id": "h2jzyfi",
            "score": 2,
            "text": "Good.\n\nBeef it up, then make it available for everyone.\n\nI don't think we should legislatively eliminate private insurance companies. I think we should have a public option that's impossible to compete with. It's not that fucking hard.\n\nI haven't had insurance of any kind except rental and auto since I came off my parents'. NONE of the jobs I've worked have offered it at all.\n\n\"Get a better job, then.\"\n\nTrying. When you're barely scraping by people don't even want to interview you.\n\nAI can't come soon enough. I can't wait to see the shift in attitude when 90% of jobs become completely obsolete.",
            "title_similarity": "0.40502042",
            "sentiment_compound": 0.7904
        },
        {
            "id": "h2k03ij",
            "score": 2,
            "text": "His kids are getting to the point where they need it so he cares now",
            "title_similarity": "0.41301125",
            "sentiment_compound": 0.507
        },
        {
            "id": "h2k06jd",
            "score": 1,
            "text": "because they know its going no where. lip service to the cameras and press",
            "title_similarity": "0.3085205",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2k0871",
            "score": 1,
            "text": "It pisses me off that once again Boomers will get coverage, far more than any other group, and we all know they’ll say FUCK YOU Igor mine when it comes time to do anything meaningful for the rest of us.",
            "title_similarity": "0.38048655",
            "sentiment_compound": -0.6523
        },
        {
            "id": "h2k0g2k",
            "score": 1,
            "text": "The vision portion will be farmed out to some shitty third-party vision plan that won't want to pay for the level of care this population requires.",
            "title_similarity": "0.40736848",
            "sentiment_compound": 0.3968
        },
        {
            "id": "h2k0nef",
            "score": 2,
            "text": "Or we could just do like every other developed country and have free health care for all.",
            "title_similarity": "0.56418526",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h2k12bu",
            "score": 1,
            "text": "Hey how about actually getting one thing done first? What happened to that police reform?",
            "title_similarity": "0.43010688",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k140z",
            "score": 2,
            "text": "I can't believe this still hasn't happened yet.",
            "title_similarity": "0.10841417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k14vb",
            "score": 2,
            "text": "Cool, but can we expand Medicare to everyone? \n\nWhen you get out of the Medicare zone you get “real” insurance where getting very sick or having a bad emergency could cost hundreds of thousands. \n\nSo, remain poor - or risk going into big debt if you get sick. \n\nI’d be all about working harder if the result wasn’t me getting screwed in health insurance. And no, my job doesn’t provide any health insurance as an independent contractor.",
            "title_similarity": "0.51649565",
            "sentiment_compound": -0.9838
        },
        {
            "id": "h2k16jd",
            "score": 1,
            "text": "Why isn't it just *insurance*? Why split everything?",
            "title_similarity": "0.32773143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k17hq",
            "score": 2,
            "text": "It boggles my mind that these things aren’t generally considered healthcare.",
            "title_similarity": "0.18500414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k1c2z",
            "score": 2,
            "text": "FYI: dental coverage is noncosmetic.\n\nNeed a tooth pulled,  no problem… but you have to pay to get an implant.\n\nNeed a root canal, no problem, you have to pay for a crown so you don’t have a giant hole in your tooth.\n\nAlso prepare to be up sold to a “deep cleaning” for exactly $100… it’s super necessary yet not covered as preventative care by insurance.",
            "title_similarity": "0.600108",
            "sentiment_compound": 0.9101
        },
        {
            "id": "h2k1r6r",
            "score": 1,
            "text": "2 down, 58 to go!",
            "title_similarity": "0.24010225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k1rvy",
            "score": 1,
            "text": "Dental and eye care are healthcare!",
            "title_similarity": "0.6745167",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h2k1sa6",
            "score": 1,
            "text": "Well shit maybe I’ll get some help one day",
            "title_similarity": "0.3326525",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2k1ue9",
            "score": 4,
            "text": "Anything to stop my retired grandma from having to wince in pain every time she eats is fine by me. Pawn off a couple police tanks if you need to.",
            "title_similarity": "0.49273944",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2k1xsn",
            "score": 2,
            "text": "Yeah people should probably have access to healthcare and preventative care. A healthier population is good. Would be nice if the American people cared a little more about their own health though.",
            "title_similarity": "0.5962051",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h2k220r",
            "score": 3,
            "text": "“Teeth as luxury bones” was the funniest commentary I ever heard on dental being complimentary coverage",
            "title_similarity": "0.46700478",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h2k24e6",
            "score": 2,
            "text": "While they're at it, can they just combine it all into one thing? It's 2021--why are teeth, ears, and eyes separate plans still?? Not just Medicare. Disrupt the whole industry!",
            "title_similarity": "0.45857477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k2g82",
            "score": 2,
            "text": "Great. Now lets work on adding all Americans and documented residents to it.",
            "title_similarity": "0.46825635",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2k2ou2",
            "score": 3,
            "text": "Medicare for All now",
            "title_similarity": "0.5542898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k2xxc",
            "score": 1,
            "text": "Let's keep this snowball rolling.",
            "title_similarity": "0.2579826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k3e9g",
            "score": 1,
            "text": "This is going to be expensive. Dental and vision aren’t insureable because they’re guaranteed events. So this won’t make things cheaper, but will only make insurance more profitable.",
            "title_similarity": "0.41037005",
            "sentiment_compound": 0.6994
        },
        {
            "id": "h2k3n1g",
            "score": 2,
            "text": "We need the American version of NHS now",
            "title_similarity": "0.50692105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k46pr",
            "score": 1,
            "text": "Long since over needed.",
            "title_similarity": "0.11928673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k4c44",
            "score": 1,
            "text": "75% of seniors who need hearing aids can’t afford them.  It’s ridiculous we expect retirees living off social security to pay for them.",
            "title_similarity": "0.4068023",
            "sentiment_compound": -0.128
        },
        {
            "id": "h2k4cht",
            "score": 1,
            "text": "HMOs that take Medicare money already provide these services and more.",
            "title_similarity": "0.5562382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k4fsy",
            "score": 2,
            "text": "Get rid of fossils.",
            "title_similarity": "0.26961815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k4hyu",
            "score": 1,
            "text": "This definitely needs done but kinda bullshit that they are leaving the privately insured to flail instead of mandating coverage under private plans too.",
            "title_similarity": "0.35491472",
            "sentiment_compound": -0.6008
        },
        {
            "id": "h2k4m5n",
            "score": 1,
            "text": "Damn penguin",
            "title_similarity": "0.12974945",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2k4px2",
            "score": 2,
            "text": "Nice! He's done a lot to forgive student debt after 'supporting' it! I'm sure this will be the same.....",
            "title_similarity": "0.551456",
            "sentiment_compound": 0.8011
        },
        {
            "id": "h2k4tdb",
            "score": 3,
            "text": "Wait, it wasn't?\n\nAmerica's healthcare is so weird.",
            "title_similarity": "0.30182305",
            "sentiment_compound": -0.3052
        },
        {
            "id": "h2k50hk",
            "score": 1,
            "text": "Insurance companies don’t think your eyes or teeth are needed to have good health. SMH",
            "title_similarity": "0.38208514",
            "sentiment_compound": -0.0343
        },
        {
            "id": "h2k5kiq",
            "score": 1,
            "text": "How about Medicare for the unborn through 18?",
            "title_similarity": "0.49136454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k5n8b",
            "score": 2,
            "text": "‘Politicians with premium healthcare consider making human’s bones, eyeballs, and ears part of their bodies’",
            "title_similarity": "0.62366986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k5naq",
            "score": 1,
            "text": "The least they can do. Crumbs..",
            "title_similarity": "0.21637209",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k5qd8",
            "score": 1,
            "text": "It’s remarkable. Biden won the presidency, but Sanders is the proxy president.",
            "title_similarity": "0.49899772",
            "sentiment_compound": 0.5647
        },
        {
            "id": "h2k5tjj",
            "score": 1,
            "text": "It's about damn time!",
            "title_similarity": "0.14996421",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h2k65xz",
            "score": 2,
            "text": "Yeah that fucking reptile sees the writing on the wall. Biden lost the progressives, as anyone with a brain could have predicted all the way back in the primaries. Schumer doesn't give a shit, he's just a careerist trying to preserve his position going forward by appealing to those who see the Democratic party for the Reaganesque conservative monstrosity it's become. \"Big tent\" indeed.",
            "title_similarity": "0.46923196",
            "sentiment_compound": 0.673
        },
        {
            "id": "h2k6n90",
            "score": 2,
            "text": "And next week it will be reported that Manchin and his buddy McConnell blocked any plans to add anything to anything.",
            "title_similarity": "0.31157106",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2k6o0h",
            "score": 2,
            "text": "Schumer still scrambling not to get primaried by AOC.\n\nWe hear you, we see you, we still don't like you. Should've tried being useful a decade ago.",
            "title_similarity": "0.3810876",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h2k7e0m",
            "score": 1,
            "text": "Finally hearing something I have been saying for years, hearing is essential for the elderly who lived  a hearing lifestyle for their mental health and funtuonability. Once you go time without hearing ranges, you permanently loose those ranges. Full hearing is important for the social life & quality-of-life. Add vision and dental because every part of your body should be considered part of HEALTH Insurance!",
            "title_similarity": "0.65960586",
            "sentiment_compound": 0.2003
        },
        {
            "id": "h2k7gip",
            "score": 1,
            "text": "We.  This is fucking pathetic.  Americans deserve HEALTHCARE.  Not bits and pieces.  \n\nHEALTHCARE.  Period.",
            "title_similarity": "0.46740723",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h2k8nwp",
            "score": 1,
            "text": "I don't get it, doesn't it cost way more money when people with no money go to the hospital to have emergency dental work done since they can't afford a dentist?\nI'm assuming they won't pay the hospital bill if they can't afford it",
            "title_similarity": "0.43905768",
            "sentiment_compound": -0.5429
        },
        {
            "id": "h2k8pnb",
            "score": 2,
            "text": "Why our eyeballs and teeth require separate insurance is beyond me. Just pure American greed and the need to make shit as complicated as absolutely possibly.",
            "title_similarity": "0.31556666",
            "sentiment_compound": -0.743
        },
        {
            "id": "h2k8r4v",
            "score": 1,
            "text": "Imagine if you had to have separate Podiatrist or Chiropractic insurance. Our health care system is whacked.",
            "title_similarity": "0.4696846",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2k8xio",
            "score": 1,
            "text": "Poggies",
            "title_similarity": "0.12338564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2k934f",
            "score": 2,
            "text": "This fucking country acts like teeth and eyes aren’t part of the human body.",
            "title_similarity": "0.20301956",
            "sentiment_compound": 0.4144
        },
        {
            "id": "h2k95x4",
            "score": 1,
            "text": "I just don’t understand how health insurance doesn’t include specific parts of your body. If anything, I’m surprised that the counter from the GQP isn’t “actually we should be doing the insurance a la carte for the whole body and charge 300% more in the process”.",
            "title_similarity": "0.44928193",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2k9abs",
            "score": 1,
            "text": "It should be added to medicaid as well.",
            "title_similarity": "0.62072766",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2k9fou",
            "score": 1,
            "text": "Cool. Now make it opt in for everyone.",
            "title_similarity": "0.32941023",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2k9h36",
            "score": 1,
            "text": "Preventive care for OBGYN too.",
            "title_similarity": "0.43641612",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2k9lpo",
            "score": 1,
            "text": "Ok, I'm about to become a Schumer fan if this is so. My teeth are getting worse since my accident and medicare does not cover dental. My only hope as of now is if it gets so bad I have to go to the hospital and they have to do emergency surgery removal. That is a little scary and pushing it.",
            "title_similarity": "0.534827",
            "sentiment_compound": -0.9
        },
        {
            "id": "h2k9xau",
            "score": 1,
            "text": "M4A should be at the very least be on par with the best corporate insurance available.\n\nFor example, with UPS dental insurance i'm getting covered for 4 extractions with bone grafts, 4 implants and 4 caps, all under anesthesia for $1,200.\n\nGranted, I got a quote from another surgeon who was covered 100%! My only problem was they're booked till July.\n\nIn terms of medical insurance, UPS medical covered 100% of my 12 day hospital admission with an insane amount of scans, tests and drugs. \n\nIf M4A isn't at least on par with that, it's an embarrassment.",
            "title_similarity": "0.5839139",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h2kakaf",
            "score": 1,
            "text": "The people should have the same coverage as politicians 😉",
            "title_similarity": "0.50429535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kaq8q",
            "score": 1,
            "text": "He forgot mental health coverage......but it’s a start",
            "title_similarity": "0.33363825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2karo4",
            "score": 1,
            "text": "Covering luxury organs seems a bit ritzy to me",
            "title_similarity": "0.3004209",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kaz7p",
            "score": 1,
            "text": "Let’s get this done!!!  Bout fucking time.",
            "title_similarity": "0.3019098",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kba4g",
            "score": 1,
            "text": "But will he actually fight for it? Or is this more political calculation?",
            "title_similarity": "0.3363943",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h2kbipw",
            "score": 1,
            "text": "None of those things should be considered \"extras\" at all in terms of health insurance.\n\nMy health is not just an on/off state of whether I'm alive or not. My health is my overall well-being of every part of my body. Eyes are not a luxury in a society built on visual cues. Teeth or not a luxury when nutrition is vital to my survival. Ears are not a luxury when various signals, alarms and sirens depend on my being able to hear them.\n\nThe human body is not some system of vital and \"optional\" organs. Only vital and less vital.\n\nHealth insurance should cover my health. For my entire life, it never has.",
            "title_similarity": "0.41215083",
            "sentiment_compound": 0.791
        },
        {
            "id": "h2kbsw4",
            "score": 1,
            "text": "He needs to retire, he’s an effing idiot",
            "title_similarity": "0.1921858",
            "sentiment_compound": -0.5563
        },
        {
            "id": "h2kbvlq",
            "score": 1,
            "text": "This is dumb.  So much arguing and debate about what's basically half measure a.  Just cover everything.  Full stop. \n\nSo much energy and debate when in the end there's better healthcare systems nearly everywhere while we are over here debating about paying for luxury bones.",
            "title_similarity": "0.46926224",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2kbyhe",
            "score": 1,
            "text": "That would help SO many people.",
            "title_similarity": "0.31532615",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2kc5y2",
            "score": 1,
            "text": "About damn time",
            "title_similarity": "0.099047326",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2kcggq",
            "score": 1,
            "text": "I don’t think anything like Medicare D would work. A large monthly premium plus a donut hole is no reasonable. Just add it to original Medicare without an additional premium.",
            "title_similarity": "0.43268657",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2kcrf2",
            "score": 1,
            "text": "Schumers words are all talk theater he knows this plan has no chance of passing",
            "title_similarity": "0.32949618",
            "sentiment_compound": -0.1877
        },
        {
            "id": "h2kcsd4",
            "score": 1,
            "text": "Oh yes. please",
            "title_similarity": "0.1489462",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h2kcztn",
            "score": 1,
            "text": "It’s about time they actually consider an essential service as important as dental care. Does a rich person know what a tooth ache feels like and to not have the money to have it treated. But let’s talk about medicare which doesn’t provide prescription coverage. You have to buy a part D plan or get an advantage plan that has a prescription coverage. But it doesn’t matter how fancy your plan is, every medicare recipient who takes a lot of medications knows about the medicare prescription “donut hole”. I found that out with my father who was put on a medication that did not have a generic. With the ridiculous high cost of prescriptions, it doesn’t take much to reach the amount of the”donut hole” and your out of pocket cost for medications can be as high as some of your high medical deductibles.",
            "title_similarity": "0.6684575",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2kd1yj",
            "score": 2,
            "text": "Can we let people 50+ have Medicare, please?\n\nThe US is becoming such a shithole from Republican corruption, insurance malfeasance and abject right wing terrorism.",
            "title_similarity": "0.4740739",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2kd24t",
            "score": 1,
            "text": "I pay 10% of my annual income on dental bullshit even after insurance. I'm so tired of our \"healthcare\" system. This needs fixed so badly.",
            "title_similarity": "0.48173738",
            "sentiment_compound": -0.9175
        },
        {
            "id": "h2kdid5",
            "score": 2,
            "text": "Wow, Medicare didn't even cover that? Wtf man that's when people need dentists and glasses the most (I know that makes it more expensive, it's the principle of the thing... also why Medicare for all would be better for seniors than it is currently)",
            "title_similarity": "0.5868726",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2kdwzi",
            "score": 2,
            "text": "Literally duh. Why would vision dental and hearing not be included?? Are you serious? That's like half of the human head, my hearing and vision is not optional, it's literally how I navigate the world, and dental health is directed connected to heart health. America is such a scam of a country.",
            "title_similarity": "0.68525195",
            "sentiment_compound": 0.7383
        },
        {
            "id": "h2kdy3k",
            "score": 2,
            "text": "As it turns out, letting people rot in their own bodies because it doesnt (always) technically kill them isn't really healthcare.",
            "title_similarity": "0.2533005",
            "sentiment_compound": 0.5773
        },
        {
            "id": "h2ke28p",
            "score": 1,
            "text": "I’ll take what I can get when it comes to this kind of thing, so I’m not complaining. But I gotta imagine he’s making moves like this to stave off a primary challenge from AOC.",
            "title_similarity": "0.4965518",
            "sentiment_compound": 0.6283
        },
        {
            "id": "h2ke3sl",
            "score": 1,
            "text": "Sweet.  Now go ahead and make Medicare available to the healthy young workers of this country who are footing the tax bill for Medicare today.",
            "title_similarity": "0.6587444",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2ke4ec",
            "score": 1,
            "text": "FFS! It's about time.",
            "title_similarity": "0.23494014",
            "sentiment_compound": -0.7027
        },
        {
            "id": "h2ke5xc",
            "score": 1,
            "text": "I wish my expensive ass insurance had that much coverage.  I haven't been to the dentist in years.",
            "title_similarity": "0.42537695",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2kei76",
            "score": 1,
            "text": "This would be amazing. I've always wondered why dental procedures aren't considered medical.",
            "title_similarity": "0.52754617",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2kf0hl",
            "score": 1,
            "text": "LOL!  \n\n\nExactly how much will need to be spent to buy every single welfare vote?",
            "title_similarity": "0.4705259",
            "sentiment_compound": 0.5893
        },
        {
            "id": "h2kf12l",
            "score": 1,
            "text": "I took myself to Mexico three yrs ago for major dental work. I was amazed at the thriving dental tourism   My teeth look great. A quarter of the US price",
            "title_similarity": "0.5653286",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h2kfct1",
            "score": 1,
            "text": "Great, just great, now we’re gonna have to pay more taxes for older people who are blind and deaf too",
            "title_similarity": "0.5406718",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h2kflry",
            "score": 1,
            "text": "It’s crazy to me that the party of fiscal conservatives would be against this.\n\nYou are already on the hook for their hospital stays. \n\nIf they get hit by a bus because they cannot see or hear it you will pay more for their Aspirin during their hospital stay than a pair of glasses or hearing aid would have cost.",
            "title_similarity": "0.51906455",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2kfoah",
            "score": 1,
            "text": "From climate change to wealth gaps, I feel like the Boomers are sucking the life out of the generations coming up behind them.",
            "title_similarity": "0.38649434",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2kfqch",
            "score": 1,
            "text": "Hope there will be some improvements for this. Most people want our teeth fix. I hate the narrative of people just 'too scared' for surger when honestly, hate to look at how expensive it is. Something that I need in life cost a whole archer of land.",
            "title_similarity": "0.45117927",
            "sentiment_compound": -0.3657
        },
        {
            "id": "h2kfuzp",
            "score": 1,
            "text": "Why are we shootings for Medicare for all. Medicare is a terrible system. Comprehensive Medicaid covers so much more, including transportation to appointments (which, for the life of me I continue to be stunned that Medicare doesn’t have this for seniors), much better behavioral health and substance use disorder coverage, as well as medical and BH case management. \n\nOh, I’m sorry, I forgot that respecting our elders was only lip service for votes.",
            "title_similarity": "0.5811895",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2kg1nb",
            "score": 1,
            "text": "after calculating of course that there is no way this goes anywhere",
            "title_similarity": "0.101262525",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2kg4rv",
            "score": 1,
            "text": "It’s almost like you can’t remove them from the body with major consequences. I’m sure a peanut has more intelligence and integrity than these idiots.",
            "title_similarity": "0.3334787",
            "sentiment_compound": 0.8758
        },
        {
            "id": "h2kgb1j",
            "score": 1,
            "text": "how will we able to afford that",
            "title_similarity": "0.28886724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kgdf3",
            "score": 3,
            "text": "Good. Now add \"everybody\" to \"Medicare.\"\n\nThanks",
            "title_similarity": "0.64678305",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2kgmk2",
            "score": 1,
            "text": "He’s due for his check up ;)",
            "title_similarity": "0.40612268",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2kgphn",
            "score": 1,
            "text": "Ok now if this gets passed I want universal healthcare lol. I make 100k+ a year and have dogshit dental coverage.",
            "title_similarity": "0.631141",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2kh57i",
            "score": 1,
            "text": "Finally now I can quit my job thanks 👍",
            "title_similarity": "0.31561342",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2kh5ho",
            "score": 1,
            "text": "Neat. I too am in favor of this. However, I am not the Senate Majority Leader and have no ability to do anything to make this happen. You do Chuck. You won’t do anything though, will you? Instead you will look condescendingly over your glasses like a stereotypical librarian, shushing people because they get upset when you and your fellow Senators once again fail to pass meaningful legislation.",
            "title_similarity": "0.34195352",
            "sentiment_compound": 0.3481
        },
        {
            "id": "h2kh76m",
            "score": 1,
            "text": "Wait America is gonna get better healthcare coverage than the Netherlands??",
            "title_similarity": "0.5399351",
            "sentiment_compound": 0.504
        },
        {
            "id": "h2kh85b",
            "score": 1,
            "text": "Listen im not a socialist but knowing that essential healthcare like this isnt covered by the only things making healthcare manageable and its even being opposed really makes me start leaning there.",
            "title_similarity": "0.47223023",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h2khe7p",
            "score": 1,
            "text": "Wow. The US is in danger of getting the best medicare in the world!",
            "title_similarity": "0.55488455",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h2khml0",
            "score": 1,
            "text": "Imagine a “healthcare” system that doesn’t include dental, vision or hearing under standard medical coverage.\n\nWe are an embarrassment.",
            "title_similarity": "0.39540932",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2khnrj",
            "score": 1,
            "text": "It’s a lot easier to see, hear and speak no evil when you’re mouth is rotting, you’re hearing is shot and you can’t get good glasses/contacts.",
            "title_similarity": "0.40311253",
            "sentiment_compound": 0.8487
        },
        {
            "id": "h2khtir",
            "score": 1,
            "text": "Dentistry is just as, if not more, important as other areas of the medical profession. Our health is directly related to how good our teeth are.",
            "title_similarity": "0.66730815",
            "sentiment_compound": 0.2712
        },
        {
            "id": "h2ki3ut",
            "score": 1,
            "text": "Such a low bar, but it’s progress. If we’re lucky this country will one day see the modern democrats as the conservatives, and then we’ll be in a better place.",
            "title_similarity": "0.5529391",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h2ki4jx",
            "score": 1,
            "text": "Cool, now if only we could freely offer it to everyone in the country we'd be all set.",
            "title_similarity": "0.45748985",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2ki521",
            "score": 1,
            "text": "As a human who pays to see i support this",
            "title_similarity": "0.3368414",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2ki6i9",
            "score": 1,
            "text": "Dental. You can die from a tooth infection that's left untreated, should have been part of health care from day one.",
            "title_similarity": "0.61384654",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2kiau6",
            "score": 2,
            "text": "I dislike the fact that my teeth are \"DLC bones\" that I gotta pay extra for, in addition to my *other* ones.\n\nI'm glad that SOMEONE is out there, lookin' out for my poor chompers.",
            "title_similarity": "0.44984454",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2kier9",
            "score": 2,
            "text": "Dude....I don't get how after the traumatizing year we've had mental health isn't included.",
            "title_similarity": "0.32156593",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2kimz5",
            "score": 1,
            "text": "Put this in the category of \"I'm surprised this is not already a thing\".",
            "title_similarity": "0.09714708",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2kity5",
            "score": 1,
            "text": "As much as I want M4A, all this does is add more medical coverage for the extremely conservative senior population who will greedily take it all and then gleefully vote for fascists in 2022/2024, all while decrying socialism and the welfare state on Facebook. \n\nYour tax dollars pay for it, most likely because this will be the only part of the \"American Jobs and Families Plan\" that will actually pass (we all know the billionaire taxes and education elements of the plan are gonna get shafted to please conservatives on both sides) but of course, you and your family won't be seeing those benefits today or tomorrow as Medicare funds will certainly be tapped out by the time it's your turn.",
            "title_similarity": "0.54164696",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h2kive8",
            "score": 2,
            "text": "Why the fuck were those not on there already. Good lord.",
            "title_similarity": "0.10544517",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h2kizuh",
            "score": 2,
            "text": "How about adding expansive assisted living benefits? That way seniors don't need to throw themselves into poverty when they nearly inevitably require assisted living care. \n\n\nWouldn't it be great if the people who need to build generational wealth the most could actually pass assets down to their children and not liquidate and spend it all on health costs before the government is willing to do its job?",
            "title_similarity": "0.6128596",
            "sentiment_compound": 0.5371
        },
        {
            "id": "h2kjf27",
            "score": 3,
            "text": "I don't understand why people are so against free Healthcare?",
            "title_similarity": "0.31479374",
            "sentiment_compound": 0.5542
        },
        {
            "id": "h2kjk29",
            "score": 2,
            "text": "Now add everyone to medicare next",
            "title_similarity": "0.57597613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kjxck",
            "score": 1,
            "text": "Such a trustworthy face he truly cares about the American people",
            "title_similarity": "0.40879184",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2klak3",
            "score": 2,
            "text": "As someone who was born hard of hearing and have spent over 10000 dollars on hearing aids and appointments ( not to mention the money my parents paid for them.... I think this is a good idea!",
            "title_similarity": "0.5328331",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h2klcdn",
            "score": 1,
            "text": "Monkey see > monkey do",
            "title_similarity": "0.12300189",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2klh77",
            "score": 1,
            "text": "\"What you know about this plan...",
            "title_similarity": "0.3028041",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2klho6",
            "score": 2,
            "text": "It’s about f-ing time!",
            "title_similarity": "0.19449031",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2klkye",
            "score": 1,
            "text": "Oh, wow. So, I’m sappose to believe this right?",
            "title_similarity": "0.2645004",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2klrt1",
            "score": 1,
            "text": "It's about time!",
            "title_similarity": "0.19112682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2klwlr",
            "score": 1,
            "text": "Good. Can we get dental, vision etc for Obamacare too?\n\nThey technically have dental but they are really terrible plans that are borderline not even worth it.",
            "title_similarity": "0.5087785",
            "sentiment_compound": -0.6296
        },
        {
            "id": "h2km745",
            "score": 2,
            "text": "I'm amazed US doesn't have dental care yet.",
            "title_similarity": "0.29369247",
            "sentiment_compound": 0.1461
        },
        {
            "id": "h2kmsnv",
            "score": 1,
            "text": "About time",
            "title_similarity": "0.13926446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kmspg",
            "score": 1,
            "text": "About time",
            "title_similarity": "0.13926446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kmw0q",
            "score": 1,
            "text": "How about free basic healthcare for all!!  I cant afford to get my brain aneurysm fixed.  I'm a single mom with 2 kids and I work 2 jobs which makes me not qualify for any assistance.  My rent went up $160.00 per month and groceries are so expensive.  Idk what I'm supposed to do.",
            "title_similarity": "0.4451239",
            "sentiment_compound": 0.4949
        },
        {
            "id": "h2kn294",
            "score": 3,
            "text": "I haven't been to the dentist in a while and really need to, I just can't afford it. American health care is such a joke.",
            "title_similarity": "0.32171082",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2kngo5",
            "score": 1,
            "text": "I suppose I'm a complete fool to hope this might be in a stand alone bill. :( \n\n> in the American Jobs and Families Plans\n\nI hate our politicians, so much.   I'm sure there will be enough crap in the Jobs and Families plan that I'll be praying it doesn't pass, even though I support this 1 specific idea.",
            "title_similarity": "0.4243371",
            "sentiment_compound": -0.5325
        },
        {
            "id": "h2knrt3",
            "score": 2,
            "text": "Healthcare should be free to all.",
            "title_similarity": "0.41677827",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2koifd",
            "score": 2,
            "text": "This reminds me of Elizabeth Warren during the campaign. \"I really don't understand why some people go through all the trouble of running for [office] just to say what we really can't do and shouldn't fight for.\"\n\nThe GOP is going to fight tooth and nail to stop ANY policy that helps the American people so why not shoot for the stars? Fully single payer Healthcare is just as likely to pass congress as raising the minimum wage by $0.20, why shouldn't we be fighting for the most instead of being modest all the damn time.",
            "title_similarity": "0.47029704",
            "sentiment_compound": -0.2515
        },
        {
            "id": "h2koles",
            "score": 1,
            "text": "Yes let's help boomers like they helped everyone else, oh wait",
            "title_similarity": "0.46782866",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h2komma",
            "score": 2,
            "text": "just got quoted 20k plus for all the damage to my teeth, implants (breaking at the roots folks, not a brush n floss issue, I'm religious w that.) I'm being drained financially by fucking teeth. jfc.",
            "title_similarity": "0.4477295",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2koo17",
            "score": 1,
            "text": "I wonder if Schumer belongs to Bailies Beach club in Rhode Island it's an all white family oriented club for rich elite democrats",
            "title_similarity": "0.43286306",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2kp1b8",
            "score": 2,
            "text": "I like how eyes, ears, and teeth aren’t considered part of the body.",
            "title_similarity": "0.2811439",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2kp1yk",
            "score": 1,
            "text": "This all sounds very expensive.",
            "title_similarity": "0.10383846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kp6bc",
            "score": 1,
            "text": "I'd be shocked if it happens. Nobody hates the elderly like Americans do.",
            "title_similarity": "0.38093194",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2kph65",
            "score": 1,
            "text": "Oh now they want to back Sanders' plans",
            "title_similarity": "0.5585594",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2kq5s1",
            "score": 2,
            "text": "This sounds great. Add those things in and then give it all to everyone in the country that wants it.",
            "title_similarity": "0.4886037",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h2kqgie",
            "score": 2,
            "text": "The corp I retired from used to offer unlimited dental back in the day (early 80s) and then, in the 90s, began whittling it away along with the rest of the insurance for us retirees until it went down to nothing, just as people need it. A root canal is now $800, a crown $2000, an extraction $300.\n\nDental problems can cause all sorts of other serious problems and now there are investigations into whether [gingivitis](https://www.newscientist.com/article/2191814-we-may-finally-know-what-causes-alzheimers-and-how-to-stop-it/) is at the root of Alzheimer's.",
            "title_similarity": "0.56254256",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2kqgp3",
            "score": 1,
            "text": "We should’ve elected Bernie :(",
            "title_similarity": "0.52426755",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2kqjq8",
            "score": 2,
            "text": "Although well intentioned, it is surreal to me that they are working on this while they can’t get anything done and while the GOP is actively destroying democracy. It’s like the 300 lb fascist in the room that nobody is discussing",
            "title_similarity": "0.26287425",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2kqydz",
            "score": 3,
            "text": "Please, I know it's not going to be any time soon, but I'm in so much tooth pain with 0% coverage. I live off of Advil. I'm being punished for my parents not teaching me oral hygiene and having to pick it up as an adult.",
            "title_similarity": "0.45397955",
            "sentiment_compound": -0.848
        },
        {
            "id": "h2krh02",
            "score": 1,
            "text": "> Schumer said the campaign to expand Medicare will be an “uphill legislative effort,” adding that lawmakers will have to “galvanize support from the public.”\n\nYea because federal policy issues having massive public support ever makes a difference in America these days.",
            "title_similarity": "0.6537505",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h2krnzj",
            "score": 3,
            "text": "ADD DENTAL TO FUCKING MEDICAID TOO. My state JUST passed $1,000 per year in dental, which is better than the $0 it offered before, but $1,000 worth of dental work is barely anything.",
            "title_similarity": "0.46808356",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2ks2g4",
            "score": 1,
            "text": "As a Canadian, I hope this happens because it would give our government one less excuse to keep dragging their feet on doing similar things which they've been promising for *decades*.",
            "title_similarity": "0.53248835",
            "sentiment_compound": 0.6815
        },
        {
            "id": "h2ks97g",
            "score": 1,
            "text": "Lisa needs braces...",
            "title_similarity": "0.41216183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ksiho",
            "score": 2,
            "text": "Schumer is underratedly really progressive. I think people lump all the leadership together and get him mixed with Pelosi in their minds. They’re not really all that close.",
            "title_similarity": "0.37892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kspdm",
            "score": 2,
            "text": "Its amazing how we take for granted good vision and hearing. If your fathers starts growing deaf and doesn't treat, dementia is soon to follow.",
            "title_similarity": "0.5697686",
            "sentiment_compound": 0.8459
        },
        {
            "id": "h2kspof",
            "score": 2,
            "text": "Everyone hates Sanders until they don’t 😑",
            "title_similarity": "0.2839288",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2kt1vp",
            "score": 1,
            "text": "They weren’t already?",
            "title_similarity": "0.05279994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kt6xb",
            "score": 2,
            "text": "I’m sure poor Republicans will fight this tooth an nail. \n\nWe’ll force better health insurance on them, for free, and then after the evil socialist government makes their loves better, they’ll be bitter about it but still enjoying the better quality of life.",
            "title_similarity": "0.577293",
            "sentiment_compound": 0.8765
        },
        {
            "id": "h2ktb71",
            "score": 1,
            "text": "Sounds nice. I’ll believe it when it happens. Even then, wait till John Oliver and his team do a report on it in five years and will find out it’s probably fucking over poor people and people of color.",
            "title_similarity": "0.48835576",
            "sentiment_compound": -0.1477
        },
        {
            "id": "h2ktoxc",
            "score": 1,
            "text": "It’s long overdue. I know it’ll take a long time, and I have been asked “Who’s gonna pay?”",
            "title_similarity": "0.2699577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ktto1",
            "score": 1,
            "text": "Didn’t we just spend $4,000,000,000,000 we had to borrow?",
            "title_similarity": "0.35950923",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ku3w5",
            "score": 1,
            "text": "Kinda stupid that it’s not already",
            "title_similarity": "0.070742935",
            "sentiment_compound": -0.4779
        },
        {
            "id": "h2kuaek",
            "score": 2,
            "text": "Will this include disabled veterans under 100%  who use the VA for care? My teeth are falling out but I'm at 80 so I'm SOL. Have dental insurance but gets eaten up immediately in two visits",
            "title_similarity": "0.5215433",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2kukrh",
            "score": 1,
            "text": "When I first read the title, I wondered why two comedians were talking about politics.\n\nThen I realised they were talking about two politicians.\n\nThen I realised they were still comedians, the lot of them.",
            "title_similarity": "0.373255",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h2kut9r",
            "score": 1,
            "text": "Please please please please please let this happen.\nAs a  stroke survivor and kidney transplant recipient  AND deaf guy with  failing and broken teeth due to kidney disease, stuck on Medicare, I can't afford to get my top row of teeth replaced or afford the 2500 hearing aids I need to get off disability in the first place.",
            "title_similarity": "0.51900566",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2kv6tt",
            "score": 1,
            "text": "This sounds like it's a DOA idea.  But Biden and the Democrats must do something to get back some of the Progressive support Biden lost pandering to the Republicans who will never vote for him.",
            "title_similarity": "0.5291559",
            "sentiment_compound": -0.043
        },
        {
            "id": "h2kvkjz",
            "score": 1,
            "text": "It’s always amazed me that these are separate anyway. Yea this policy includes all you bones except mouth bones.",
            "title_similarity": "0.29860625",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2kvmid",
            "score": 1,
            "text": "Then let’s give Medicare to like everyone.",
            "title_similarity": "0.638034",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2kvmln",
            "score": 1,
            "text": "Yes!",
            "title_similarity": "0.11082788",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h2kvrkw",
            "score": 1,
            "text": "Ridiculous it’s not already. Also hopefully that means all of us will have those covered too.",
            "title_similarity": "0.3803023",
            "sentiment_compound": -0.5801
        },
        {
            "id": "h2kwf3g",
            "score": 1,
            "text": "Which should have been done eons ago.",
            "title_similarity": "0.25772107",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kwhjq",
            "score": 1,
            "text": "The cost can be easily covered by removing the salary cap. Never understood why only the first $142,000 is taxed.",
            "title_similarity": "0.46016014",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2kwjzs",
            "score": 1,
            "text": "I’m sure Schumer will compromise with the republicans and just give us teeth scans at 20% off.",
            "title_similarity": "0.54758453",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2kwpsd",
            "score": 1,
            "text": "I wish we stopped with the slow train route to ubi and free healthcare. Rip off the bandaid please fuck this shit",
            "title_similarity": "0.39754245",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2kwrl2",
            "score": 1,
            "text": "See what a Lil Progressive pressure will do, even 1 of the biggest Neoliberal’s is worried about a progressive primary opponent!",
            "title_similarity": "0.5152723",
            "sentiment_compound": -0.5707
        },
        {
            "id": "h2kx0ur",
            "score": 1,
            "text": "After that maybe we can add everyone.",
            "title_similarity": "0.35316926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2kxn4y",
            "score": 3,
            "text": "Because of the recent history with American politics, my brain read this as \"now blocking\"...\n\nThis is how abused I am from the GOP bullshit.",
            "title_similarity": "0.42352426",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h2ky0ga",
            "score": 2,
            "text": "Holy shit, what the fuck is it with America?\n\nThese things weren't previously considered by some to be medical care? If you knock out all your teeth in a car crash, is that not something ordained fucking medical in nature?",
            "title_similarity": "0.43167537",
            "sentiment_compound": -0.7987
        },
        {
            "id": "h2kylif",
            "score": 1,
            "text": "Nice, that’s a start",
            "title_similarity": "0.24138466",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2kynit",
            "score": 1,
            "text": "Bernie is kinda awesome.",
            "title_similarity": "0.33301848",
            "sentiment_compound": 0.5868
        },
        {
            "id": "h2kz8l3",
            "score": 2,
            "text": "Vision is nowhere the price of dental without insurance in my experience. I can eat the cost of a 100 dollar pair of glasses or a couple hundred dollar exam every once in a while. But three grand to fix one tooth? Now that’s fucked and definitely incentivizes bad decision making. For example three grand to fix is a lot less then 150 to pull but pulling is way worse then fixing the issue. They are promoting bad medical choices through price.",
            "title_similarity": "0.5216414",
            "sentiment_compound": -0.7543
        },
        {
            "id": "h2kzgi5",
            "score": 1,
            "text": "You don't need a weatherman to know which way the wind blows.",
            "title_similarity": "0.18844013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2l09mb",
            "score": 1,
            "text": "What? I didn’t hear what you said through the pain of my aching gums.",
            "title_similarity": "0.28712106",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h2l0c0e",
            "score": 1,
            "text": "I been on Obamacare most my life and shit does if suck balls. \nIDC who comes up with a bill but we need something better. \nI shouldn’t need to wait 6 months to see an exoskeletal dr for chronic pain only to be rerouted and spend 3 years getting nowhere 😔",
            "title_similarity": "0.51705885",
            "sentiment_compound": -0.6349
        },
        {
            "id": "h2l0p5q",
            "score": 1,
            "text": "So what? Schumer is completely ineffective.",
            "title_similarity": "0.07399508",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h2l0zh8",
            "score": 1,
            "text": "Ahh yes Schumer paying lip service to another popular policy because he’s afraid of getting primaried. Too bad there is no hope of this dinosaur actually working to enact the policy.",
            "title_similarity": "0.38648158",
            "sentiment_compound": -0.1043
        },
        {
            "id": "h2l194r",
            "score": 1,
            "text": "What I still really like about the Republican's as opposed to the  \"Third Party\" coming up, is that they've really got Healthcare and they know all about it.  There is no other\n\nlegitimate form of health insurance at this point in the United States, other than Medicaid/Medicare.  So let's allow them to organize and improve the only thing we've really got going on.",
            "title_similarity": "0.5939234",
            "sentiment_compound": 0.8799
        },
        {
            "id": "h2l1fae",
            "score": 1,
            "text": "r/WallStreetSilver inflation is coming!",
            "title_similarity": "0.2854734",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2l3h27",
            "score": 3,
            "text": "As a conservative leaning centrist, I am on board with this. I have never understood why dental is seperate from health when the two are so connected. Having dental problems can lead to so many health problems.",
            "title_similarity": "0.6395583",
            "sentiment_compound": -0.6872
        },
        {
            "id": "h2l434l",
            "score": 1,
            "text": "That would be amazing. I'm disabled with several different ailments and I get Medicare through SSDI and the amount of money I've spent on getting my teeth fixed to be not in excruciating pain all the time just from my teeth (it's connected to my health problems), on top of paying for parts of hearing devices insurance won't cover, it's hell. I also can't afford new glasses and my vision has gotten alot worse and my glasses are broken do I super glue and get whatever cheap things can get to keep it from falling off my face/ears. Especially since one ear is deformed and my glasses won't stay on easily, it's even worse since they got all flimsy. Anyways, this would make my life so much more worth living if I could get everything I need, without going into horrible debt and filing for bankruptcy",
            "title_similarity": "0.5726625",
            "sentiment_compound": 0.8583
        },
        {
            "id": "h2l4oqm",
            "score": 1,
            "text": "You don't get dental coverage with Medicare??",
            "title_similarity": "0.46481413",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2l5d1p",
            "score": 1,
            "text": "Have United and went to the eye doctor to get something checked out. Went in on a Monday saw the techs and got a dilation eye drop along with a vision test waiting for Dr. Comes in and sees me for about 5 min and tells me I should come in two days to see the main Dr.  for a stye on my lid. Had been there for a while. Was charged the 60 bucks out of pocket to see the Dr and left. Came back did the same thing 2 days later waiting in the patient room for over an hour after the techs just did the same stuff from two days earlier. Dr. Came in for 10 min and was shocked I was there two days ago and recommended a warm clothe compress or surgery but did not recommend doing surgery unless I want it. Was charged my 60 bucks out of pocket to see Dr. and also $120 because my insurance won't cover the whole Dr. Visit. Said to myself never wasting my money like that again",
            "title_similarity": "0.4478874",
            "sentiment_compound": 0.5223
        },
        {
            "id": "h2l5otx",
            "score": 1,
            "text": "Why isn’t that already the case? Oh wait, I already know the answer to that.",
            "title_similarity": "0.26281333",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2l5xy9",
            "score": 1,
            "text": "Wait? This wasn’t already covered!? WTF America",
            "title_similarity": "0.1680978",
            "sentiment_compound": -0.7339
        },
        {
            "id": "h2l61ys",
            "score": 2,
            "text": "Great idea, seeing as how they are stealing SOCIAL SECURITY, and using it someplace else",
            "title_similarity": "0.3351697",
            "sentiment_compound": 0.5473
        },
        {
            "id": "h2l7gxt",
            "score": 1,
            "text": "Would rather see them add a Soylent Green option for those of us who don't want to end up warehousing our old and infirmed...",
            "title_similarity": "0.43656078",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h2l84ca",
            "score": 2,
            "text": "In the uk everything is free but you have the choice to go private if you want , we just pay a little more tax for free health eye care dental whatever it’s not perfect but it’s nothing to be scared of go for it America",
            "title_similarity": "0.5775572",
            "sentiment_compound": 0.8822
        },
        {
            "id": "h2l87ux",
            "score": 1,
            "text": "That is a great idea!",
            "title_similarity": "0.22913963",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h2l8gz6",
            "score": 1,
            "text": "Homie is terrified of an AOC primary",
            "title_similarity": "0.20133965",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h2l97cu",
            "score": 1,
            "text": "Because he is worried about a challenger",
            "title_similarity": "0.22073215",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2l98so",
            "score": 1,
            "text": "Well, they fucking should, and get rid of the stupid maximums while we’re at it.",
            "title_similarity": "0.38530463",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2l9s5h",
            "score": 1,
            "text": "I'd rather drop the medicare age from 65 to 50 with zero dental, vision, or hearing.  Once upon a time people from age 50 to 64 could depend on staying with an employer who provided some basic coverage for surgeries and hospital stays.  I think we all see those days are gone.",
            "title_similarity": "0.5255544",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h2lb1as",
            "score": 2,
            "text": "Yea, you think.  Last time I checked I can die from causes relating to vision and dental.  Why this isn't considered health care is beyond reasoning",
            "title_similarity": "0.54724836",
            "sentiment_compound": -0.6734
        },
        {
            "id": "h2lerpt",
            "score": 1,
            "text": "You know... \"medical care\".",
            "title_similarity": "0.44218308",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2let60",
            "score": 1,
            "text": "Senate Majority Leader Charles Schumer on Sunday threw his support behind a push, led by Sen. Bernie Sanders, to add dental, vision and hearing coverage to Medicare.",
            "title_similarity": "0.73285407",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h2lfe79",
            "score": 2,
            "text": "Oh ok, lets give the boomers more free stuff while Millenials pay for it",
            "title_similarity": "0.43776625",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h2lhoxl",
            "score": 1,
            "text": "Yay! Wtf good is having half assed medical care, other than having no medical care at all? Have bad teeth? The bacteria can cause you heart problems? Everything is inter-related.",
            "title_similarity": "0.44115734",
            "sentiment_compound": -0.2406
        },
        {
            "id": "h2liy0e",
            "score": 1,
            "text": "Now do medicare for all.",
            "title_similarity": "0.58237624",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ll0l8",
            "score": 1,
            "text": "Waste of time to even talk about this until Manchin and Sinema are out the way",
            "title_similarity": "0.22866003",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2lodb9",
            "score": 1,
            "text": "The added cost can be financed by removing the current $142,000 cap on taxable wages.",
            "title_similarity": "0.443434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2lsko5",
            "score": 1,
            "text": "Planning on adding it isn’t the same as doing it. Empty promises",
            "title_similarity": "0.22358325",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2ltk96",
            "score": 1,
            "text": "Just a thought... when Sanders is like as far left as it comes, and if they really want to get anything across in a bi-partisan sense, they really need to stop taking all the things Bernie wants and putting them in all your bills.  Not arguing whether or not you all think it's a good thing to have or not, but talking the politics of getting something thru and assuring that the congress doesn't flip back in the next election.  Cause history shows that when one party has all the power and just pushes stuff through, the other side comes back stronger the next election.",
            "title_similarity": "0.5366157",
            "sentiment_compound": 0.9239
        },
        {
            "id": "h2ltry7",
            "score": 1,
            "text": "I bet. With the lack of children being born they are going to need us slaves to stay functioning longer to pick up the slack. Forcing them to maintain their organic robot workers.",
            "title_similarity": "0.3581303",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2lw2qt",
            "score": 1,
            "text": "Remember Schumer is worried about a primary from his left. Don't believe shit he says until its passed.",
            "title_similarity": "0.36822954",
            "sentiment_compound": 0.1838
        },
        {
            "id": "h2lw3d9",
            "score": 1,
            "text": "Great! Our seniors on fixed income definitely need this.",
            "title_similarity": "0.55721176",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h2ly3pt",
            "score": 1,
            "text": "remember last year and in the time during the Democratic Primary race, when the ONLY response from the left about M4A was “bUt hOw ArE yOu GonNA PaY fOr tHaT!??!!?”",
            "title_similarity": "0.42708114",
            "sentiment_compound": -0.4245
        },
        {
            "id": "h2m20rj",
            "score": 1,
            "text": "Thank God.  Finally",
            "title_similarity": "0.27688318",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2m7wzo",
            "score": 1,
            "text": "Dental is huge. A yearly cleaning would eliminate thousands in ER visits for poor people who inevitably get an abscess and need dentures.",
            "title_similarity": "0.5236665",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2m94jk",
            "score": 1,
            "text": "I can't hear worth a shit in my right ear, what did they say?",
            "title_similarity": "0.16669692",
            "sentiment_compound": -0.6447
        },
        {
            "id": "h2n5ub9",
            "score": 1,
            "text": "Wonderful news, but Republicans will never allow it to pass.",
            "title_similarity": "0.27465022",
            "sentiment_compound": 0.0903
        },
        {
            "id": "h2n6dnu",
            "score": 1,
            "text": "Being able to hear and see has a profound impact on aging and mental health.  And oral health is a huge issue in this country.\n\nHow can anyone say, with a straight face, that one’s eyes, ears, and teeth are not part of general healthiness?",
            "title_similarity": "0.5024553",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h2n8l2m",
            "score": 1,
            "text": "Dental alone is such a huge quality of life impact and has huge ramifications to ones health if there are issues, so it's frankly ridiculous it hasn't been added as a part of general health insurance to begin with. Minimally we should start it here, but it seriously needs to be expanded to give access to preventative care earlier when it's both cheaper and has the most long term impacts on someone's health.",
            "title_similarity": "0.5434167",
            "sentiment_compound": 0.4885
        },
        {
            "id": "h2noiil",
            "score": 1,
            "text": "Not trying to hijack anything, but can people who aren't on Medicare have access to affordable dental care? Because right now even the middle class can't afford that shit.",
            "title_similarity": "0.57810384",
            "sentiment_compound": 0.8476
        },
        {
            "id": "h2nrzkr",
            "score": 1,
            "text": "Please, please, please....",
            "title_similarity": "0.18685097",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h2oa83q",
            "score": 1,
            "text": "Yes Medicare for all",
            "title_similarity": "0.58004487",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2okety",
            "score": 1,
            "text": "Such a no brainer. Here in Germany everything is included or with minimal extra fees. Ok the for free option is really basic and some good glasses or teeth cost but at least you have the option for some basic solution. To not have access to proper sight…how much are new glasses in the US?\n\nEdit: misspelled",
            "title_similarity": "0.49163392",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h2qfpw2",
            "score": 1,
            "text": "Nice - let my children and grandchildren cover those expenses. 👍🏼😎",
            "title_similarity": "0.5574576",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2xg9sr",
            "score": 1,
            "text": "There’s a gaping hole in Medicare that leaves out coverage for dental, vision, and hearing. It is critical that all Americans have access to quality health and dental, vision, and hearing care.  \n   \nI’m working with Senator Sanders to push to include dental, vision, and hearing Medicare coverage in the American Jobs and Families Plans.",
            "title_similarity": "0.7768415",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h4zdcd3",
            "score": 1,
            "text": "Being that I work for a health insurance company and started in our Medicare department in the beginning, THIS is huge and needed. Lost of seniors are wanting THESE things as well. It’s a high demand for hearing aids, vision and dental.",
            "title_similarity": "0.70086455",
            "sentiment_compound": 0.3818
        }
    ]
}