{
    "Illinois becomes first state to ban police from lying to minors during interrogations\n": [
        {
            "id": "h5atyhk",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.4846284",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h5biwp3",
            "score": 7,
            "text": "Deleted",
            "title_similarity": "0.16394481",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxr9l",
            "score": -2,
            "text": "As a former “bad kid” my first advice would be just stay out of trouble. Next would be to assume all cops are lying to you. Thanks for coming to my TedTalk.",
            "title_similarity": "0.61938095",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h5b5hba",
            "score": 26,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5bslb2",
            "score": 3,
            "text": "I hate that this implies that police can legally lie to you except if you are both a minor and a resident of Illinois.",
            "title_similarity": "0.7295634",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5bmf41",
            "score": 3,
            "text": "I’m not the smartest person, but I would have just thought from an ethical standpoint police wouldn’t have done that anyway. But I’m naive glad it’s a law - needs to be federal law.",
            "title_similarity": "0.50758904",
            "sentiment_compound": 0.6898
        },
        {
            "id": "h5aynbs",
            "score": 4,
            "text": "something something slippery slope something something muh rights something something goodness gracious the fact this was ever allowed is disgusting abuse of power",
            "title_similarity": "0.34491646",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5ba1o4",
            "score": 5,
            "text": "I’m sorry so they can knowingly \nlie to adults? But if said adults lie back THEY’RE in trouble. Fuck the people that make theses police immune!",
            "title_similarity": "0.58039135",
            "sentiment_compound": -0.7871
        },
        {
            "id": "h5c0fk4",
            "score": -3,
            "text": "Let’s give the ol’ good cop good cop routine",
            "title_similarity": "0.30131006",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h5c46nh",
            "score": -2,
            "text": "I'm sorry, but I'm bitter. This has all the markings of \"This won't work the way you think it's going to work\" to me.",
            "title_similarity": "0.28322524",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h5cb0ln",
            "score": -9,
            "text": "they should be allowed to lie about certain things.  There's many interesting interrogation psychology channels on youtube i suggest you watch before you disagree.",
            "title_similarity": "0.40521127",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5ceqcg",
            "score": -2,
            "text": "Illinois,  the shithole of America.",
            "title_similarity": "0.4227665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cf3px",
            "score": -1,
            "text": "This better not apply to like 17 year old mass shooters",
            "title_similarity": "0.4960493",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h5c71x6",
            "score": -9,
            "text": "If it helps police solve a case, why shouldn’t they be able to? They’re not letting cops do their jobs",
            "title_similarity": "0.6264019",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5coqqt",
            "score": 0,
            "text": "WTF? This has been legal? How the fuck this has been legal? Cops lying in anyway to get conviction? You really are 3rd world country. I Said it, third world country, for those you can't understand numbers.",
            "title_similarity": "0.5886297",
            "sentiment_compound": -0.908
        },
        {
            "id": "h5cst25",
            "score": -4,
            "text": "Minors can be some of the most ruthless killers.",
            "title_similarity": "0.31671464",
            "sentiment_compound": -0.6786
        },
        {
            "id": "h5d0fif",
            "score": -4,
            "text": "I've watched too many episodes of The First 48 to think this is a black and white issue. Sometimes the detectives lying has caused murders to confess.",
            "title_similarity": "0.5244973",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h5bq095",
            "score": 12,
            "text": "Funny... One time I was at a wedding having a quiet conversation with a few friends about our PERSONAL experiences with police lying and/or being deceptive... And some guy comes up and buts in like \"I couldn't help overhearing and I thought you should know cops aren't allowed to lie, I'm a cop I could go to jail for that\". We basically tore him a new one... What a cop thing to do too, like we're at a wedding having our own conversation and we don't even know you, get outta here",
            "title_similarity": "0.57542133",
            "sentiment_compound": 0.6533
        },
        {
            "id": "h5b4uu7",
            "score": -5,
            "text": "This headline is so funny and so terrible at the same time.",
            "title_similarity": "0.1739861",
            "sentiment_compound": 0.0896
        },
        {
            "id": "h5c0iay",
            "score": 0,
            "text": "Illinois making me really proud lately, it’s a new feeling",
            "title_similarity": "0.19674963",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h5c0k60",
            "score": 0,
            "text": "this should have been done",
            "title_similarity": "0.09869684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c1j4m",
            "score": 0,
            "text": "Minors: Where do babies come from?\nCops:",
            "title_similarity": "0.4870819",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cifqa",
            "score": 0,
            "text": "Everytime I look at news from Illinois, I get homesick. Everyone likes to shit on them but man are they doing great. I should have never moved to Texas.",
            "title_similarity": "0.42847914",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5clsxh",
            "score": 0,
            "text": "Why in the fuck does this need to be a thing? No wonder no one trusts the police.",
            "title_similarity": "0.5080257",
            "sentiment_compound": -0.7481
        },
        {
            "id": "h5de5lr",
            "score": 0,
            "text": "Police should hire more female interrogators as their higher empathy gives them more ability to detect a lie.",
            "title_similarity": "0.36584926",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h5dfson",
            "score": -4,
            "text": "Unpopular opinion. Doesn't make sense.\nI remember watching some real cop show and they basically lied to some guy and made it look like they knew more than they did and the guy ended up confessing bc he thought they knew.\n\nIt's a pretty smart strategy, as for interrogation I assume it could be even more useful. And imo, they shouldn't be protecting anyone who already broke the law and committed such a bad crime that they needed to be interrogated.\n\nIf someone commits a murder they should be sent to life in prison or the death penalty (idrc) and that's it. Who cares about them, they're scum of the earth.\nJust my unwelcome rebuplican opinion :)",
            "title_similarity": "0.6598932",
            "sentiment_compound": -0.9301
        },
        {
            "id": "h5dio94",
            "score": 0,
            "text": "This is one of those things that sounds good on paper, but is impossible to enforce.",
            "title_similarity": "0.23981984",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h5e7883",
            "score": 0,
            "text": "This implies it’s done in every other state! WTF?!",
            "title_similarity": "0.23715532",
            "sentiment_compound": -0.7284
        },
        {
            "id": "h5xvunx",
            "score": 0,
            "text": "Lmao man being a cop is like the worst job right now in America lol",
            "title_similarity": "0.5258033",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5b6uqb",
            "score": 23,
            "text": "Police shouldn’t be allowed to lie to anybody. What the fuck is this?",
            "title_similarity": "0.57404995",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5bt8nv",
            "score": -20,
            "text": "Of course Illinois would focus on stupid political BS like this meanwhile 50 people get murdered every day in Chicago",
            "title_similarity": "0.519726",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5bs4yi",
            "score": -12,
            "text": "Crime Capital of America, Didn’t Expect This",
            "title_similarity": "0.49083942",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5d285n",
            "score": -7,
            "text": "Drug dealers are just going to use more minors and basically set up the minors to get caught and get information from the cops and report back now",
            "title_similarity": "0.54976356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bwkv9",
            "score": 1,
            "text": "They should ban guns in Chicago!",
            "title_similarity": "0.6609491",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h5bzqny",
            "score": -1,
            "text": "I vaguely remember a story about a cop who was interrogating someone not very bright.  He prepared by writing \"LIE\" in big letters on a sheet of paper and putting it in the copy machine that was in the interrogation room.  He told the suspect that it was a lie detector.  Whenever he suspected the guy was lying, he would hit the copy button, and show him the copy.  The guy believed it and changed his story.  Excellent method of interrogation!",
            "title_similarity": "0.5268306",
            "sentiment_compound": -0.5501
        },
        {
            "id": "h5c07o9",
            "score": -1,
            "text": "Okay now do majors too",
            "title_similarity": "0.026057303",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5c0eft",
            "score": -1,
            "text": "Like that will stop them…",
            "title_similarity": "0.22660571",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5c0it8",
            "score": -1,
            "text": "I guess this scene from [The Wire](https://www.youtube.com/watch?v=AJ5aIvjNgao) would no longer work.",
            "title_similarity": "0.3939723",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5c0npg",
            "score": 1,
            "text": "Ban these shit heel people from lying at all during investigations.",
            "title_similarity": "0.62293434",
            "sentiment_compound": -0.891
        },
        {
            "id": "h5c0pkz",
            "score": -1,
            "text": "How was this not already a thing throughout the country?!?!?",
            "title_similarity": "0.30148792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c0qe8",
            "score": 1,
            "text": "To protect and serve right??? \n\nWhat a joke",
            "title_similarity": "0.22967416",
            "sentiment_compound": 0.6531
        },
        {
            "id": "h5c0xgi",
            "score": -1,
            "text": "Now if they can just stop minors from lying about smoking “marijuana “ or weed",
            "title_similarity": "0.60767",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5c8e4b",
            "score": 1,
            "text": "The mother ever loving Jesus Mary and Joseph fucking first?  Shut it down…. We’re past our sell by date.",
            "title_similarity": "0.43618327",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5cabm1",
            "score": 1,
            "text": "Anyone ever see the show called The Closer? The main characters gimmick is she lies to suspects to get confessions. \n\nNancy Grace was a producer and made regular guest appearances.",
            "title_similarity": "0.48447832",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5cm6xn",
            "score": 1,
            "text": "If its unethical to do to minors its unethical to do to adults",
            "title_similarity": "0.41002452",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5cmfdl",
            "score": 1,
            "text": "This is half good. Good that they can't lie to minors, bad that they're allowed to lie to the rest of us.",
            "title_similarity": "0.5048108",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5d1wt8",
            "score": -1,
            "text": "They’ll change the age of being a minor now to 5. After that you’re a “young adult”.\n\nI’m a bit torn by this because if you’re a drug dealing scumbag of a minor under 18 then you’re going to be lying your teeth out about that Crystal Meth you’ve got stashed in baggies, or that collection of old ladies purses you’ve buried in the yard after mugging them, but the police aren’t allowed to use the same tactics to trick a confession. On the other hand if it’s been abused in the past and some useless lawyer just convinces you to cop to a misdemeanour because it’ll be minor compared to a full conviction due to the “stash of evidence they say they have against you” then you’re ending up with scared minors who’ll take the adults advice needlessly and it could ruin their life.",
            "title_similarity": "0.6463357",
            "sentiment_compound": -0.9549
        },
        {
            "id": "h5d526w",
            "score": -1,
            "text": "That mofo ain’t no minor js",
            "title_similarity": "0.13104296",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5dlef4",
            "score": 1,
            "text": "Lie or no, only thing you should ever say to police is “I plead the fifth, I want my attorney.” Nothing more, nothing less. Don’t talk to police.",
            "title_similarity": "0.5659628",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5b6r4f",
            "score": 16,
            "text": "Police will be forbidden from using deceptive tactics while interrogating minors .\n\n&#x200B;\n\nWhy is this legal to do to adults?",
            "title_similarity": "0.7330972",
            "sentiment_compound": -0.2903
        },
        {
            "id": "h5bw0m1",
            "score": -27,
            "text": "Bro imagine just NOT being a criminal. Its fucking crazy, I know.",
            "title_similarity": "0.36017108",
            "sentiment_compound": 0.0214
        },
        {
            "id": "h5azxud",
            "score": 8,
            "text": "If cops can’t lie how will they do their job of being professional bullies?? Can’t we please think about the cops?? /s",
            "title_similarity": "0.6069441",
            "sentiment_compound": 0.504
        },
        {
            "id": "h5bkm1u",
            "score": 2,
            "text": "Always remember. No body talks, every body walks.",
            "title_similarity": "0.23775497",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5c070f",
            "score": 2,
            "text": "This should have been illegal this whole time. Wtf?",
            "title_similarity": "0.5249602",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h5c08ea",
            "score": 2,
            "text": "They were allowed to lie?!",
            "title_similarity": "0.34952807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c09uy",
            "score": 2,
            "text": "This seems reasonable, why was this even allowed in the first place??",
            "title_similarity": "0.24823059",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c0o91",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.12012753"
        },
        {
            "id": "h5c0plg",
            "score": 2,
            "text": "It happened to me, I had just gotten home from a baseball game when the sheriff’s car pulls up and tries to question me. My brother was mouthing off to him so he tells me I’m arrested for “questioning” and puts me in the back. While driving to the station he keeps telling me “I’m guilty” and “we have witnesses” and trying to get a confession from me when I don’t even know what the hell he’s talking about. They put me in a cell for a few hours and they finally start questioning me. I find out it’s about my neighbor’s car which I’ve never so much at glanced at in my life saying I vandalized it. Of course I deny it, and He calls me by my idiot brother’s name. This bastard arrested the wrong person. I laugh at his incompetence and tell him he’s fucked up something fierce. They released me a bit later and never had problems with the local law enforcement again. The beauty of it is my brother was innocent too, because it was my OTHER idiot brother who was never implicated.",
            "title_similarity": "0.5604864",
            "sentiment_compound": -0.9752
        },
        {
            "id": "h5c41xa",
            "score": 2,
            "text": "Either way the crime rate isn’t going to get any better. Focus on some progress that can fix Chicago and constant murders.",
            "title_similarity": "0.58483124",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5c5c1p",
            "score": -2,
            "text": "I CANNOT BELIEVE THIS HAS TO BE FORMALIZED UGGHHH\n\nNO LAW ENFORCEMENT OFFICER SHOULD LIE TO AN ACCUSED INDIVIDUAL EVER?? \n\nHelllooo",
            "title_similarity": "0.5845244",
            "sentiment_compound": -0.7372
        },
        {
            "id": "h5ckul3",
            "score": -2,
            "text": "Phew. Unfortunately, Illinois is a shithole in every other way possible, but good effort!",
            "title_similarity": "0.41287482",
            "sentiment_compound": 0.5334
        },
        {
            "id": "h5cmh37",
            "score": 2,
            "text": "This is why you should absolutely never say anything to a cop other than \"I need to speak to my lawyer\" or \"I have nothing to say.\"  in any situation, whether they're on duty or not.",
            "title_similarity": "0.57272387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5coosa",
            "score": 2,
            "text": "Shouldn't police be banned from lying to everyone during interrogations?",
            "title_similarity": "0.6944808",
            "sentiment_compound": -0.2311
        },
        {
            "id": "h5cthri",
            "score": -2,
            "text": "Thank god, now we can protect the murderous or thieving youth",
            "title_similarity": "0.36685538",
            "sentiment_compound": 0.25
        },
        {
            "id": "h5cy1or",
            "score": -2,
            "text": "Child kidnappings and endangerment skyrocketing for reasons unknown.",
            "title_similarity": "0.3167438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5d9coh",
            "score": 2,
            "text": "Since my kids were 6 I've ingrained the old 'never talk to police without a parent or lawyer with you, they will scare you but can't hurt you'",
            "title_similarity": "0.6356447",
            "sentiment_compound": 0.3744
        },
        {
            "id": "h5azok6",
            "score": 10,
            "text": "I'm surprised there are expressions of surprise about this being legal everywhere, after what happened in Tulia. And that wasn't even about children. But it began a long conversation where it was exposed that police take a child and good/bad cop them over the course of double-digit hours, using sleep deprivation and promises they can go home as incentive for them to sign a confession, dictated by them or suggested over the course of said process.\n\nIt happened with the Central Park Five. There are documentaries about other such stories.\n\nBut it still isn't well known?\n\nIs everyone aware of civil forfeiture laws in this country?",
            "title_similarity": "0.5926096",
            "sentiment_compound": 0.4384
        },
        {
            "id": "h5b22ec",
            "score": -12,
            "text": "Kim Foxx is likely to outlaw interrogation anyway.",
            "title_similarity": "0.50983167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5byji0",
            "score": -12,
            "text": "Chicago is a shit hole. Its demise is happening.",
            "title_similarity": "0.37455925",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5b7jz9",
            "score": 1,
            "text": "WHY CAN COPS LIE TO ANYONE?! \"Proud\" of my state, I guess?",
            "title_similarity": "0.5326188",
            "sentiment_compound": 0.5792
        },
        {
            "id": "h5b9fgt",
            "score": 2,
            "text": "Wait....first?",
            "title_similarity": "-0.021822972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5brpte",
            "score": 3,
            "text": "Defund the police, we don't need them.  Social worker can do a better job.",
            "title_similarity": "0.5118326",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5bs9jh",
            "score": 3,
            "text": "Im not sure what I think in general about lies to adults such as ‘ your mate is already talking so if you want to help yourself you better too’. But as a matter of interest I was just listening to a podcast ( You are not so clever) which was a discussion / interview with a psychologist whose whole research was about how easy it is to create false memories - after 3 sessions with people she had convinced a serious percentage of them that they remembered committing a crime when they were young just with suggestion and praise.",
            "title_similarity": "0.54664457",
            "sentiment_compound": 0.8972
        },
        {
            "id": "h5bt5bt",
            "score": 3,
            "text": "Cops shouldn't be allowed to lie to anyone, period.",
            "title_similarity": "0.56187236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cr4a6",
            "score": -3,
            "text": "Trust the police",
            "title_similarity": "0.27253148",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5c1uz2",
            "score": -4,
            "text": "Are teenagers allowed to lie during interrogations?",
            "title_similarity": "0.52208626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5crvx8",
            "score": -5,
            "text": "This comment section is shocking.\n\nMost people in here obviously know nothing about policing or the criminal world and live a very sheltered existence. \n\nGang members in Chicago outnumber police 10 to 1 right now and crime is out of control,  50 or more shootings every weekend, and now you want to make the cops jobs even more impossible? \n\nLunacy",
            "title_similarity": "0.58115673",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h5bipi4",
            "score": 6,
            "text": "Cops shouldn’t lie to anyone. \n\nDidn’t they tell us growing up “two wrongs don’t make a right”",
            "title_similarity": "0.63803214",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5bs24u",
            "score": -7,
            "text": "How will the ban be enforced? Just out of curiosity. Because interrogations are generally very personal affairs, conducted between the interrogator and their subject. When other parties are involved, generally they're on the side of the interrogator, acting as, well, actors - sometimes friendly to the sub, sometimes not. So, how will this be enforced? Will there be an interrogation correctness manager implanted into every interrogatory situation, to ensure the interrogation is carried out on the up and up? You all see how this complicates things. The effectiveness of an interrogation depends heavily on isolating the subject of interrogation from their support elements who might encourage them to say something else besides the truth.",
            "title_similarity": "0.44887328",
            "sentiment_compound": 0.9305
        },
        {
            "id": "h5c3d6i",
            "score": -4,
            "text": "When you take into account that most “gang bangers” in Chicago are under age kids, this is huge",
            "title_similarity": "0.49786535",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5c3xtj",
            "score": -7,
            "text": "So now if the Illinois mob thinks someone is an undercover cop they just need a kid to ask them and the cop has to say yes?",
            "title_similarity": "0.6989099",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5c6rgb",
            "score": -7,
            "text": "NY raised minor age to 18.  It’s a literal get out of jail free card until then (and then it’s mostly get out of jail free as an adult anyway).  I’d much rather we spend our time and effort restructuring our “correctional justice system” than continuing to hand out get out of jail free cards.",
            "title_similarity": "0.59510505",
            "sentiment_compound": 0.9477
        },
        {
            "id": "h5c9hrf",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.12012753"
        },
        {
            "id": "h5d24zx",
            "score": -8,
            "text": "Who cares. \n\nMinor's already have so many “rights” that they can't be punished. In my city a juvenile can point a gun at you and all they do is fingure print them and release them.",
            "title_similarity": "0.58987033",
            "sentiment_compound": 0.4731
        },
        {
            "id": "h5aytj1",
            "score": 8,
            "text": "Can still lie to adults",
            "title_similarity": "0.3679483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c23db",
            "score": -8,
            "text": "Read some comments...if you don’t wanna be questioned just don’t break the law :)",
            "title_similarity": "0.4083568",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5c96i2",
            "score": -9,
            "text": "I don’t see the issue with lying to the accused. Don’t confess if you didn’t do it but the police should be able to use whatever tricks they can.",
            "title_similarity": "0.5758604",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h5ct8u2",
            "score": -5,
            "text": "Who are they protecting? The system or the people? Police should have the right and ability to get justice by any means necessary.",
            "title_similarity": "0.3842962",
            "sentiment_compound": 0.7236
        },
        {
            "id": "h5b3rul",
            "score": 41,
            "text": "I don’t know if this is relevant but I am 21 and had a taste of how shitty and awful Illinois police are. When I was 20 or so I had just gotten back to my house from dropping off my girlfriend, & I noticed a cop was going  door to door questioning people & just as I pulled up he was going to my house but he stopped me and asked me if I was aware that someone had drove by and screamed “HEY!” To a group of kids who just got off a school bus (pretty stupid right?) and then parked down in one of the driveways by my house… I said no I just got back and just left my house 15 minutes ago so there’s no way I could’ve done it plus I didn’t even see the school bus at all…. This guy (cop) says “well I don’t believe you and I think it was you.” I fucking laughed in his face so hard because I was so stoned and said “I can assure you I did not” then my dad came outside and saw I was talking to the police and he got all mad and called me an idiot for talking to the police & talked to him. He came back inside and said “The cop thinks it’s you, this is why you shouldn’t talk to the police!” Then my dad had to call the department to complain about his ass and whatever person in charge said this is unacceptable and will be dealt with…. But yeah fuck cops",
            "title_similarity": "0.6093005",
            "sentiment_compound": -0.9913
        },
        {
            "id": "h5azbmn",
            "score": 65,
            "text": "The entire job of the police is simply \"get 'em in front of a judge.\" They like to SAY they are \"defending the law, upholding the law, protecting and serving,\" but at the end of it all that judge has the final say in what happens. They get to lie, mislead, and misdirect until they are under oath. \n\nWith their exceptionally limited law knowledge (as much as you can pack into what, three or four months of training?) the line between \"the cop that lies\" versus \"the cop that doesn't know and just says shit\" gets extra blurry. And they certainly lean on any defense they have.",
            "title_similarity": "0.5434268",
            "sentiment_compound": -0.8121
        },
        {
            "id": "h5aumjh",
            "score": 73,
            "text": "Wait.... this was legal?",
            "title_similarity": "0.049980443",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5ch3k5",
            "score": -9,
            "text": "Y’all will do any thing to help criminals and any thing to make law enforcement harder.",
            "title_similarity": "0.37889385",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5aud58",
            "score": 203,
            "text": "how about they don't lie to anybody? how's that?",
            "title_similarity": "0.3796975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5b4tie",
            "score": 32,
            "text": "Cops after ban: “Okay just to let you know, the ‘interrogation’ hasn’t started. I have a few things to tell you before it begins.” ;)",
            "title_similarity": "0.53839004",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5b2f8s",
            "score": 13,
            "text": "Brenden Dassey comes to mind",
            "title_similarity": "0.048829913",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5b31ar",
            "score": 459,
            "text": "Chicago PD: \"lol, ok, and we'll close down our secret black sites as well\".\n\n[Reminder: CPD has black sites where they kidnap and torture people like they're the CIA in fucking Iraq.](https://www.theguardian.com/us-news/2015/feb/24/chicago-police-detain-americans-black-site)",
            "title_similarity": "0.614691",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5bl7om",
            "score": 62,
            "text": "Tomorrow's headline:\n\n\"Illinois police continue to lie to minors with impunity, as ban has no effective consequences\"",
            "title_similarity": "0.7250671",
            "sentiment_compound": -0.7314
        },
        {
            "id": "h5auywe",
            "score": 955,
            "text": "US is fairly unique in how it allows police to lie in interrogations versus most developed nations. It's really lame.",
            "title_similarity": "0.58199257",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h5avaa0",
            "score": 27,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5b8hsy",
            "score": 29,
            "text": "cops: But we're the good guys!\n\nalso cops: *Of course* we lie to children!",
            "title_similarity": "0.54497206",
            "sentiment_compound": 0.6634
        },
        {
            "id": "h5bfl7k",
            "score": 30,
            "text": "Great, now ban them from lying to adults too",
            "title_similarity": "0.5585318",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5bk08k",
            "score": 77,
            "text": "let's take a step back and examine the idea that cops *have been lying to kids to make arrests*\n\nthat shouldn't need a fucking law to tell you not to do it! jfc",
            "title_similarity": "0.72988373",
            "sentiment_compound": -0.7644
        },
        {
            "id": "h5aygwa",
            "score": 210,
            "text": "The fact that police can lie to someone about their decision to speak with a lawyer before talking to the police implies guilt is so ridiculous.",
            "title_similarity": "0.6011493",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h5b0ixl",
            "score": 695,
            "text": "Never, ever, ever talk to the cops without a lawyer present.\n\nI watch this video every few months just to remind myself.\n\nhttps://www.youtube.com/watch?v=d-7o9xYp7eE\n\nEdit:\n\n1). Why did you pull me over?\n\n2). I'm not discussing my day.\n\n3). Am I being detained or am I free to go?\n\nIf no:\n\n4). Can I go?\n\nIf yes:\n\n4). I invoke the 5th.\n\nTHEN SHUT THE FUCK UP",
            "title_similarity": "0.5792428",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h5azom9",
            "score": 449,
            "text": "Why just minors?",
            "title_similarity": "0.30441517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5aw03m",
            "score": 3013,
            "text": "I may be stating the obvious here but:\n     \nDo not talk to the police. Say nothing. Ask to speak with your attorney.\n     \nEdit: stating",
            "title_similarity": "0.5777479",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5b4pbi",
            "score": 79,
            "text": "ask for your lawyer and shut the fuck up\n\nask for your lawyer and shut the fuck up",
            "title_similarity": "0.4387672",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5au7bh",
            "score": 8845,
            "text": "Why was this legal in the first place?",
            "title_similarity": "0.24722855",
            "sentiment_compound": 0.1593
        },
        {
            "id": "h5bnedn",
            "score": 355,
            "text": "This reminds me of the conviction of Martin Tankleff. He was a 17 year old accused of killing his parents. While being questioned by detectives, he denied having anything to do with that attack on them. While being questioned by detectives (for 17 hours without  legal counsel) the cops told him that his father woke up and told the cops that Martin was the responsible for that attack. A befuddled, exhausted and confused 17 year old then said, \"I guess I did it then\".\n\n&#x200B;\n\nAnd THAT was considered his confession.  Of course, many years later his conviction was overturned. \n\nAnd also, of course, his father did not wake up and finger his son. But that is the kind of shit that detectives pull to coerce confessions from \\*children\\* with neither a parent nor a lawyer present.",
            "title_similarity": "0.6448355",
            "sentiment_compound": -0.9435
        },
        {
            "id": "h5bmg7l",
            "score": 867,
            "text": "Doesn't matter if you are guilty or innocent, or if the cop is telling the truth or lying. The only answer to every question in a police interrogation is \"I want my attorney.\"\n\nIt is insane that they are allowed to lie and bend your statements towards a false confession in the first place.",
            "title_similarity": "0.6694683",
            "sentiment_compound": -0.609
        },
        {
            "id": "h5auq7a",
            "score": 26,
            "text": "The ones who were doing it before are just going to do it when the cameras aren't watching now.",
            "title_similarity": "0.3151863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5azbgk",
            "score": 21,
            "text": "That needs to be a federal law.",
            "title_similarity": "0.24244554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5azcnz",
            "score": 12,
            "text": "Now do adults",
            "title_similarity": "0.09753215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5azux9",
            "score": 12,
            "text": "This might belong in r/nottheonion as well",
            "title_similarity": "0.09020467",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5b4c4k",
            "score": 3,
            "text": "I’m sorry but how is this not illegal everywhere?",
            "title_similarity": "0.39556015",
            "sentiment_compound": 0.577
        },
        {
            "id": "h5b4n4v",
            "score": 3,
            "text": "The only thing to ever tell the police is, \"I want a lawyer now,\" and then shut up until the lawyer gets there to do all the talking.",
            "title_similarity": "0.57235485",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5b57pz",
            "score": 4,
            "text": "It doesn’t matter , law enforcements honestly will always be in question.",
            "title_similarity": "0.26588786",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h5b65l3",
            "score": 1,
            "text": "Something like this:\n\nhttps://youtu.be/JObQSYj4Qi8",
            "title_similarity": "0.12469156",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5b6wcs",
            "score": 2,
            "text": "This shouldn't happen to anyone at all! Wtf?",
            "title_similarity": "0.41205573",
            "sentiment_compound": -0.6239
        },
        {
            "id": "h5b8ge0",
            "score": 2,
            "text": "Heavens forbid should lying in general let alone to children be something we should automatically expect from our public safety servants",
            "title_similarity": "0.6206627",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5b9h6q",
            "score": 4,
            "text": "They'll  just  call it modified  honesty or some shit.\n\n\"Just remember: it's not a lie if *you* believe it.\"",
            "title_similarity": "0.30177197",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5b9z14",
            "score": 2,
            "text": "Wait why the fuck are they allowed to in the first place. \n\nOh, wait, forgot, cops. Fuck.",
            "title_similarity": "0.538229",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5bb5rs",
            "score": 1,
            "text": "....that's not FEDERALLY illegal?!?!?!",
            "title_similarity": "0.17463996",
            "sentiment_compound": 0.6531
        },
        {
            "id": "h5bbwew",
            "score": 1,
            "text": "I don't want to deal with the ad blocker.  Does anyone know what the punishment is for this?  Who is enforcing it/how it will be enforced?  If it is just the police policing themselves then the law is just for show.",
            "title_similarity": "0.63366675",
            "sentiment_compound": -0.5834
        },
        {
            "id": "h5bcy80",
            "score": 5,
            "text": "All police should be banned from lying to suspects.",
            "title_similarity": "0.6898546",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h5be6n5",
            "score": 2,
            "text": "Wait…this is legal in the other 49??",
            "title_similarity": "0.19116795",
            "sentiment_compound": 0.2168
        },
        {
            "id": "h5beiho",
            "score": 1,
            "text": "how is this even a thing",
            "title_similarity": "0.09144946",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5betnc",
            "score": 2,
            "text": "It wasn't a lie, it was exaggeration.",
            "title_similarity": "0.16213298",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bey88",
            "score": 26,
            "text": "Why just minors? Police shouldn’t lie to anyone.",
            "title_similarity": "0.6328069",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bfdoo",
            "score": 10,
            "text": "Shouldn’t that be the standard, period? Cops shouldn’t be allowed to lie during interrogations, at all.",
            "title_similarity": "0.62338614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bfoo4",
            "score": 2,
            "text": "The fact that it wasn't illegal anywhere before has me uh, CONCERNED.",
            "title_similarity": "0.22820187",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h5bgvrw",
            "score": 11,
            "text": "Scaring teenagers into confessing to things they had no part of it. Hope other states follow Illinois or maybe police can actually follow evidence instead of just guessing at shit.",
            "title_similarity": "0.7283205",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5bibcu",
            "score": 1,
            "text": "Wait, what? The first?!",
            "title_similarity": "0.0357896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bicc8",
            "score": 1,
            "text": "So... like, if Badger was a kid he would have been right?",
            "title_similarity": "0.2815676",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5bikg0",
            "score": 3,
            "text": "Police should absolutely NOT be allowed to lie to anyone during questioning or use deceptive tactics in most situations. Go above board, do it the right way or fuck off.",
            "title_similarity": "0.6097157",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h5bj4gk",
            "score": 23,
            "text": "How about getting them to stop lying on official documents like arrest warrants.",
            "title_similarity": "0.5659362",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h5bjg3t",
            "score": 3,
            "text": "Shouldn't be allowed to talk to them without a lawyer present. I think that rule should also apply to adults.",
            "title_similarity": "0.49226665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bjg9s",
            "score": 1,
            "text": "Now ban lying entirely. Not just for police. Not just to minors. All lies. All the time. Illegal.",
            "title_similarity": "0.6366209",
            "sentiment_compound": -0.9246
        },
        {
            "id": "h5bjk76",
            "score": 5,
            "text": "The first state to ban what?????",
            "title_similarity": "0.45204276",
            "sentiment_compound": -0.6767
        },
        {
            "id": "h5bk6ep",
            "score": 2,
            "text": "I feel like this news should have been 100 years ago, just common sense and decency",
            "title_similarity": "0.2358523",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5bld5l",
            "score": 12,
            "text": "As someone who currently resides in Illinois, I can’t wait for my Facebook feed to be full of people moaning about how this is just going to hurt cops, keep cops from doing their jobs, and let criminals get away with everything and anything.",
            "title_similarity": "0.6534829",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h5blskn",
            "score": 2,
            "text": "As if this wouldn't be easy to cover up on the officers' end..",
            "title_similarity": "0.36597195",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h5blsz6",
            "score": 13,
            "text": "1st state? So in 49 others they can still lie……",
            "title_similarity": "0.26823586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5blv9c",
            "score": 4,
            "text": "Can we also address the stacking of charges that results in plea bargaining even though innocent yet scared as shit and agree to a plea deal?",
            "title_similarity": "0.41170192",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h5bmacf",
            "score": 8,
            "text": "Now do adults.",
            "title_similarity": "0.07405594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bmqwf",
            "score": 1,
            "text": "I’m sure that’ll stop them…",
            "title_similarity": "0.17503972",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h5bmuas",
            "score": 2,
            "text": "TIL: cops are allowed to lie to people...",
            "title_similarity": "0.60801524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bn4uj",
            "score": 2,
            "text": "Well that definitely could’ve saved me some grief in my younger years",
            "title_similarity": "0.26121217",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5bn8h7",
            "score": 1,
            "text": "How about first state to lie to anyone during interrogations…..WTF is with the white vs us rhetoric…..why does anyone need to divide us vs bring us together?",
            "title_similarity": "0.6460416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bnbhn",
            "score": 1,
            "text": "proves how honest pigs are!",
            "title_similarity": "0.16522194",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h5bnbzm",
            "score": 1,
            "text": "Wow moralities are laws now",
            "title_similarity": "0.26469326",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5bnce6",
            "score": 1,
            "text": "Central Park 5 should’ve been enough reasoning for this to be true in all states.",
            "title_similarity": "0.2896643",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5bnh07",
            "score": 2,
            "text": "The fact that police are allowed to lie at all is strange to me.",
            "title_similarity": "0.5403499",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5bnqad",
            "score": 2,
            "text": "Amazing how such common sense rules and laws are so uncommon. It's almost like the system has been rigged from the start to favor those in power at the expense of everyone else. Funny how that works.",
            "title_similarity": "0.42648482",
            "sentiment_compound": 0.8445
        },
        {
            "id": "h5bnr1t",
            "score": 1,
            "text": "When will someone ban police and lawyers from wording questions to elicit the answer they want. THAT is a form of dishonesty as well. To think court officials are taught this? No wonder people don't trust the law.",
            "title_similarity": "0.5804952",
            "sentiment_compound": -0.7508
        },
        {
            "id": "h5bnvb5",
            "score": 4,
            "text": "They shouldn't lie to anybody. Saying shit like they've got evidence they don't have, or someone else is implicating you can induce a false confession out of duress.",
            "title_similarity": "0.5571829",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5bo7r0",
            "score": 1,
            "text": "I feel like this needs to be posted.  Not just a marijuana thing.  This involves every aspect of dealing with police.  SHUT THE FUCK UP! https://youtu.be/sgWHrkDX35o",
            "title_similarity": "0.5225351",
            "sentiment_compound": -0.4633
        },
        {
            "id": "h5bo84m",
            "score": 1,
            "text": "Oh no. The bootlickers are gonna be upset with this one!",
            "title_similarity": "0.3471533",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h5bocnc",
            "score": 1,
            "text": "Should apply to all police interrogation.",
            "title_similarity": "0.4003866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bogij",
            "score": 5,
            "text": "Totally OK to continue lying to adults though, got it.\n\nObligatory \"Do not talk to the police\" video. Best 45 minutes of your life you can spend if you've never seen it:\n\nhttps://youtu.be/d-7o9xYp7eE\n\ntl;dw? \"Anything you say can and will be used against you.\" It's right there in the Miranda warning. Nothing you say will be used to help you, only to hurt you. \n\nDo not talk to the cops.",
            "title_similarity": "0.70352566",
            "sentiment_compound": 0.2325
        },
        {
            "id": "h5bp5sy",
            "score": 2,
            "text": "In case anyone was wondering why people don't like/trust cops",
            "title_similarity": "0.5114792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bp89w",
            "score": 1,
            "text": "Should be a total ban!",
            "title_similarity": "0.30895212",
            "sentiment_compound": -0.6352
        },
        {
            "id": "h5bpds0",
            "score": 1,
            "text": "Why the fuck wasn’t this already banned?",
            "title_similarity": "0.4171967",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h5bpn1i",
            "score": 1,
            "text": "They can lie to adults",
            "title_similarity": "0.3889348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bpnwu",
            "score": 1,
            "text": "Damn we had to make that a law.",
            "title_similarity": "0.30293742",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5bpt9s",
            "score": 1,
            "text": "\"Ban\", who is going to stop them. 😂🤣",
            "title_similarity": "0.35208338",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5bptap",
            "score": 1,
            "text": "You're telling me it's still legal for the rest of the 49 states?",
            "title_similarity": "0.27763036",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5bpwii",
            "score": 1,
            "text": "Call it what it is…  psychological abuse!",
            "title_similarity": "0.22702524",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h5bqc7k",
            "score": 1,
            "text": "Lol, any meaningful police reform these days just consists of the most basic steps towards becoming a decent human being.",
            "title_similarity": "0.4087293",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5bqc8r",
            "score": 3,
            "text": "PSA cops can and will lie to you to get a confession. They just cannot threaten you into a confession (phy harm or threat to hurt your family if you don't confession)\nALWAYS CLEARLY SAY I INVOKE MY RIGHT TO SILENCE AND YOUR RIGHT TO COUNSEL. then you stfu till you have your lawyer present or your free.",
            "title_similarity": "0.6630659",
            "sentiment_compound": -0.8232
        },
        {
            "id": "h5bqgnv",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5bqjh7",
            "score": 3,
            "text": "This is good.  \n\nEducate young people to understand it is legal in most every state for the cops to lie to you to incarcerate you.\n\nHell, educate old people too.  I see the need for good honest policing.  I don't want officers that bend or break the law to enforce it.",
            "title_similarity": "0.65732515",
            "sentiment_compound": 0.5828
        },
        {
            "id": "h5bqjw8",
            "score": 1,
            "text": "This is going to be challenged by the police union.",
            "title_similarity": "0.48582405",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5bqmwy",
            "score": 2,
            "text": "When I was 15, a kid who used to bully me was doing his same shit, so I hit him over the head with a beer bottle I found laying on the ground, eventually requiring reconstructive surgery to his face. This was right after school. I was arrested, and told that if I didn't admit to it, I would be locked away for years, even though it was self defense. I kept telling the cops I didn't want to say anything until my dad was there. They'd say \"he doesn't have to be\". They'd occasionally hand me a packet of paperwork to sign. I never did. A little while later, a fat, jolly female cop came in and told me that if I explained the entire thing and was honest, I'd be let go. I genuinely trusted her. Right then and there, my dad's lawyer showed up and told me to shut my mouth. Apparently this was a common tactic to get kids to admit guilt.",
            "title_similarity": "0.57749534",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h5bqu2y",
            "score": 2,
            "text": "Wait…police are allowed to LIE to MINORS?! What the hell America?!",
            "title_similarity": "0.6928134",
            "sentiment_compound": -0.7611
        },
        {
            "id": "h5br2ml",
            "score": 1,
            "text": "So alot of people should be getting released right.?",
            "title_similarity": "0.19533941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5brerp",
            "score": 1,
            "text": "Reality: police (and ‘news’ media) are allowed to lie as a normal part of their duties.\n\nMost media and politicians: we don’t understand why the citizens don’t trust the institutions of society.",
            "title_similarity": "0.55082715",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5brfkd",
            "score": 1,
            "text": "But it's still cool to lie to everyone else. That is some backwards-ass bullshit.",
            "title_similarity": "0.3907208",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h5brfxb",
            "score": 2,
            "text": "They should be able to lie to any suspect. If a suspect lies it’s a chargeable offense.",
            "title_similarity": "0.5290855",
            "sentiment_compound": -0.802
        },
        {
            "id": "h5brhnj",
            "score": 1,
            "text": "just like chokeholds are banned, right?",
            "title_similarity": "0.4559235",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5briry",
            "score": 1,
            "text": "I think there are situations where lying in interrogations has its place and isn’t unethical. However, I’m not particularly familiar with this, and so I assume for there to be a need to implement a law like this police were crossing the line in terms of what’s reasonable.",
            "title_similarity": "0.49413604",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h5brmcn",
            "score": 1,
            "text": "Why limit to only minors?",
            "title_similarity": "0.4097612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5brmis",
            "score": 1,
            "text": "Cops shouldn't be lying at all, that's half the fucking problem.",
            "title_similarity": "0.49546683",
            "sentiment_compound": -0.0559
        },
        {
            "id": "h5brnhh",
            "score": 1,
            "text": "now do all police lying",
            "title_similarity": "0.52308774",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5brr63",
            "score": 1,
            "text": "I came from Illinois. I doubt this will change heir tactics. All police in Illinois are good ol boys. They hate black people. They hate hippies. They lie a lot. They say they believe in god, but will refuse to give water or food to their prisoners.",
            "title_similarity": "0.6335893",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h5brtml",
            "score": 1,
            "text": "uhhh wtf why was that a thing",
            "title_similarity": "0.054667443",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h5brtrt",
            "score": 1,
            "text": "If qualified immunity can keep them out of jail and employed for shooting people without cause, I’m sure they’ll be scared of *lying*.",
            "title_similarity": "0.62633455",
            "sentiment_compound": -0.8054
        },
        {
            "id": "h5bs08b",
            "score": 1,
            "text": "Which is more likely going forward: \"I can totally lie to you\" or \"it's against the law for us to lie to you, so you can totally trust everything we say\"?",
            "title_similarity": "0.4799732",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h5bs0z3",
            "score": 2,
            "text": "Wait wait wait, that was legal? And still is in all other states? What the fuck, man? Like, I know the system is designed to lock people up, but god damn, they put no limits on the absolute depths they could sink to.",
            "title_similarity": "0.5853119",
            "sentiment_compound": -0.6694
        },
        {
            "id": "h5bs1f6",
            "score": 1,
            "text": "How can you tell they are lying? And how the court would take your word for? Is not like the believed everything you say",
            "title_similarity": "0.48250324",
            "sentiment_compound": -0.7068
        },
        {
            "id": "h5bs3yu",
            "score": 2,
            "text": "Great now do the same for everyone",
            "title_similarity": "-0.033377",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5bs4q3",
            "score": 3,
            "text": "Ahh yes another law for the police to studiously ignore.",
            "title_similarity": "0.54379344",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h5bs79h",
            "score": 1,
            "text": "Just minors??? What next, ban cops from sleeping with prostitutes?\n\nYeah, that's been allowed in places.",
            "title_similarity": "0.70052445",
            "sentiment_compound": -0.5204
        },
        {
            "id": "h5bsjap",
            "score": 1,
            "text": "Wait how was that not already fucking illegal?",
            "title_similarity": "0.35188887",
            "sentiment_compound": 0.4838
        },
        {
            "id": "h5bskt2",
            "score": 1,
            "text": "r/NotTheOnion",
            "title_similarity": "0.11714898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bsqe7",
            "score": 1,
            "text": " About fucking time how about the rest of America?",
            "title_similarity": "0.18446557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bsr2u",
            "score": 1,
            "text": "Chicago PD will totally be on board with this",
            "title_similarity": "0.21357195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bsxbs",
            "score": 1,
            "text": "Wasn’t Illinois the first state to ban cash bail also?",
            "title_similarity": "0.6608641",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5bt1wt",
            "score": 1,
            "text": "I mean, it was illegal for police to murder people as well, but you don't see many of them in prison for it.",
            "title_similarity": "0.632683",
            "sentiment_compound": -0.8422
        },
        {
            "id": "h5bt4ty",
            "score": 2,
            "text": "I mean, let’s be honest, they’ll keep doing it. They’ll just make sure not to get caught.",
            "title_similarity": "0.20943011",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h5bt7m7",
            "score": 5,
            "text": "Important take always from this headline. It is legal to lie to minors in 49 states and adults in 50.",
            "title_similarity": "0.5657164",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5btciq",
            "score": 2,
            "text": "If only there were individuals charged with giving you the information necessary in difficult situations like this… maybe someone somehow related to you, old enough to have life experience of their own, and (hopefully) invested in your own well-being… too bad people like that don’t exist. (/s)\n\nIn all seriousness I have been told since I was a child (6 or 7 years old) that the only things I was allowed to tell a police officer asking me questions was “I want to call my parents” and “lawyer”. They drilled that into my head for years, and I’m thankful that they did. Everyone should demand that they be allowed to exorcise their rights in an interrogation, and if no one taught the children that it is very unfortunate.",
            "title_similarity": "0.5061377",
            "sentiment_compound": 0.0276
        },
        {
            "id": "h5btdap",
            "score": 1,
            "text": "wait a mc-mothafucking second.....",
            "title_similarity": "0.16644785",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bterc",
            "score": 1,
            "text": "I feel like this should be on r/nottheonion if it isn’t already",
            "title_similarity": "0.20738524",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5btizm",
            "score": 1,
            "text": "Holy fucking shit, this is permissible in general?",
            "title_similarity": "0.118695736",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h5btj80",
            "score": 2,
            "text": "Police can lie to you but you can’t lie to the police. This is why you don’t talk to police without a lawyer.",
            "title_similarity": "0.6050483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5btjd0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5btkh6",
            "score": 1,
            "text": "Would've been nice to have this as a 14-year-old hooligan who got in trouble with the police for stupid shit that never did or would hurt anybody",
            "title_similarity": "0.67236686",
            "sentiment_compound": -0.9153
        },
        {
            "id": "h5btkzc",
            "score": 1,
            "text": "This is why it is always important to have a lawyer present.",
            "title_similarity": "0.13081796",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h5btoja",
            "score": 1,
            "text": "Jesus Christ America how is this a thing to begin with?",
            "title_similarity": "0.2666064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5btvlh",
            "score": 1,
            "text": "Yeah like that's going g to make a difference",
            "title_similarity": "-0.05129763",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h5btvxz",
            "score": 3,
            "text": "It’s easy to say don’t talk to the cops without a lawyer present, but it’s scary when you’re a juvenile. I’ve been there, was sentenced to juvenile detention for years. When being interrogated you seem lost, everything is a blur and the cops are 100 percent lying to you about everything…EVERYTHING. Saying they can help you. Saying your friends are rolling on you, that they already know the facts, they just need you to say it. They put just as much pressure, if not more, on juveniles as they do adults and a kid cannot cope in that situation. Feeding children lies compounds the psychological hell the kid is going through, especially when you don’t know if that child is guilty or not. \n\nAlso, never talk to cops. Lawyer up ASAP. Even when innocent.",
            "title_similarity": "0.57851183",
            "sentiment_compound": -0.9764
        },
        {
            "id": "h5btzma",
            "score": 1,
            "text": "Yeah read that title again, the only state. And it only applies to minors. Why cant cops just not be allowed to lie?",
            "title_similarity": "0.70331156",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5bu26v",
            "score": 1,
            "text": "The first!?!",
            "title_similarity": "0.0016365536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5buad5",
            "score": 1,
            "text": "Can we like make it illegal for police to lie everywhere all of the time.",
            "title_similarity": "0.6698353",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5budu3",
            "score": 1,
            "text": "Omg",
            "title_similarity": "-0.08154846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5buhqk",
            "score": 1,
            "text": "I imagine they’ll abide by that about as well they do the various laws about not fuckin’ murdering people.",
            "title_similarity": "0.46190736",
            "sentiment_compound": 0.6749
        },
        {
            "id": "h5bul6q",
            "score": 1,
            "text": "There are still police in Illinois? Lolol",
            "title_similarity": "0.4428705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5buo03",
            "score": 1,
            "text": "Why are police allowed to lie to anyone of any age? Shits insane.",
            "title_similarity": "0.60486984",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5bur06",
            "score": 1,
            "text": "Telling a cop not to lie is almost like telling a dog not to bark, though.",
            "title_similarity": "0.52220744",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h5burbe",
            "score": 1,
            "text": "“Well what are we supposed to do?!? Protect kids?!”\n     -The police probably",
            "title_similarity": "0.5096885",
            "sentiment_compound": 0.5753
        },
        {
            "id": "h5but5b",
            "score": 2,
            "text": "[Never talk to the police.](https://www.youtube.com/watch?v=d-7o9xYp7eE&t=1456s)\n\nDon't ever consent to interrogation in the first place, and say absolutely nothing without a lawyer present.",
            "title_similarity": "0.6009397",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h5buti4",
            "score": 2,
            "text": "It should be illegal to Interrogate minors without counsel.",
            "title_similarity": "0.64848214",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5buugt",
            "score": 1,
            "text": "Excuse me ?!!!! How in the world was this legal before?",
            "title_similarity": "0.30213764",
            "sentiment_compound": 0.5351
        },
        {
            "id": "h5buvv1",
            "score": 1,
            "text": "Deception should not be used in any police action. Full stop.",
            "title_similarity": "0.5575725",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h5bv31f",
            "score": 2,
            "text": "Well holy hell! Lying shouldn’t be used as a way to manipulate anyone, especially a minor. Way to go Illinois! Also, lame that police are lying to minors  to get what they want. Get the proof that is required to build your case.",
            "title_similarity": "0.75974387",
            "sentiment_compound": -0.9244
        },
        {
            "id": "h5bv5im",
            "score": 1,
            "text": "Shocking this needed to be banned",
            "title_similarity": "0.39503065",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h5bva1t",
            "score": 1,
            "text": "Oh that needs to be made a rule, huh?",
            "title_similarity": "0.12481977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bvalo",
            "score": 2,
            "text": "Sure could have used this when I was a kid. Told the truth and still got thrown in jail at 17. Asked for my lawyer and parents first. “You don’t need those. Just tell us what you know and you can go home. We already know you weren’t involved.” I wasn’t but they made up some shit to tie me in.",
            "title_similarity": "0.65708315",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5bvccg",
            "score": 2,
            "text": "If they accidently do lie, I am can say with complete confidence they will investigate themselves and find absolutely no wrongdoing on their part.",
            "title_similarity": "0.3877919",
            "sentiment_compound": 0.204
        },
        {
            "id": "h5bvdem",
            "score": 2,
            "text": "The FIRST???? In other words: this is legal EVERYwhere else???",
            "title_similarity": "0.26916957",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h5bvfom",
            "score": 2,
            "text": "Illinois of all places, 2021 really is wild",
            "title_similarity": "0.3754217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bviac",
            "score": 1,
            "text": "Like that’ll stop them",
            "title_similarity": "0.22968361",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5bvldz",
            "score": 1,
            "text": "everyone likes shitting on pritzker, but the state went from a failure and broke to leading the way with progressive movements",
            "title_similarity": "0.46543932",
            "sentiment_compound": -0.8462
        },
        {
            "id": "h5bvobu",
            "score": 2,
            "text": "What’s next, we’re gonna ban cops from having sex with people in their custody? Damn!",
            "title_similarity": "0.70379436",
            "sentiment_compound": -0.7644
        },
        {
            "id": "h5bvrz2",
            "score": 1,
            "text": "On this episode of “We didn’t think we had to write that one down”",
            "title_similarity": "0.31984416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bvuyr",
            "score": 1,
            "text": "Is this not an article from the onion?",
            "title_similarity": "0.23291272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bvv9j",
            "score": 2,
            "text": "Illinois also legalized recreational marijuana of the governments own volition, and in doing so expunged the records of non-violent criminals who had weights under a certain amount.  The conservatives in the state cry so hard about how the governor is the worst person ever to have governed, but I’ll be damned if he doesn’t keep doing things that legitimately benefit the people.  Sure, there are still 1000 problems, but at least we’re moving in the right direction, and I feel like we actually have a governor who gives a shit about people.",
            "title_similarity": "0.6650693",
            "sentiment_compound": -0.8168
        },
        {
            "id": "h5bvvo3",
            "score": 1,
            "text": "r/Holup so cops aren’t in the wrong (legally) for lying to kids and teenagers everywhere else?",
            "title_similarity": "0.64640135",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h5bvwo7",
            "score": 1,
            "text": "The fact that this was legal in the first place",
            "title_similarity": "0.18141842",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5bvx0l",
            "score": 1,
            "text": "But are you still allowed to use a photocopier machine as a pretend lie detector test like in The Wire?",
            "title_similarity": "0.52092427",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h5bvz8b",
            "score": 1,
            "text": "Juries might care, but Cops, Arbitrators, and Judges won't.",
            "title_similarity": "0.49850106",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5bw1x3",
            "score": 1,
            "text": "But the pigs are allowed to lie to adults?!",
            "title_similarity": "0.55985713",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bw3q8",
            "score": 1,
            "text": "I’m sorry? Why was it allowed in the first place?\nNot only that, shouldn’t it be illegal for police to lie to anyone during interrogation not only minors? \nSurely if a suspect must tell the truth during interrogations, police must be held to the same standards?",
            "title_similarity": "0.66546786",
            "sentiment_compound": -0.8001
        },
        {
            "id": "h5bw5wr",
            "score": 1,
            "text": "Why not just stop lying to everyone period?",
            "title_similarity": "0.41354346",
            "sentiment_compound": 0.5667
        },
        {
            "id": "h5bw696",
            "score": 1,
            "text": "They need to make this everywhere ASAP",
            "title_similarity": "0.06610073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bw6z9",
            "score": 2,
            "text": "how about lying to anyone they are holding in custody?",
            "title_similarity": "0.5173146",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5bwcxu",
            "score": 1,
            "text": "Fuck Illinois. And fuck the police of Illinois",
            "title_similarity": "0.5783156",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5bwih4",
            "score": 2,
            "text": "This should also include the mentally disabled. My dad was a public defender in Kansas dealing in capitol cases, and had a number of clients who were mentally disabled and basically tricked into confessing by police. Cops are pieces of shit, through and through.",
            "title_similarity": "0.56096065",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5bwiuv",
            "score": 1,
            "text": "How about banning them from lying to anyone at all?",
            "title_similarity": "0.57383955",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5bwm1x",
            "score": 1,
            "text": "This is what the \"Defund The Police\" effort was about. No one wants to eradicate cops, they want them held accountable. This is a step in the right direction and it makes me happy. Just about 49 more states to go!",
            "title_similarity": "0.54554844",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h5bws75",
            "score": 1,
            "text": "First?",
            "title_similarity": "-0.02250541",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bwwnj",
            "score": 1,
            "text": "It’s fucked up that those exact words in that exact sequence have to be said.",
            "title_similarity": "0.196087",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h5bwz37",
            "score": 2,
            "text": "I mean this is NOT even legal to lie to Adults in interrogation a lot of states. The practice leads to so many false confessions.",
            "title_similarity": "0.60635257",
            "sentiment_compound": -0.0951
        },
        {
            "id": "h5bx052",
            "score": 2,
            "text": "Police shouldn't be able to lie. It makes them and the public less safe overall. There are things the police cannot lie to you about, such as whether you are detained or under arrest. But if they can lie about whether they have evidence or a witness to a crime or anything like that sure it puts pressure on a suspect to talk. But it also makes it harder for the public to interact and tolerate LEOs. On the balance it does more harm than good. LEOs are supposed to be the guardians of our communities (they're not but that was the idea). People on the right side of the law don't need to deceive others.",
            "title_similarity": "0.5954131",
            "sentiment_compound": -0.6064
        },
        {
            "id": "h5bx0ou",
            "score": 1,
            "text": "Awesome. Good job Illinois.",
            "title_similarity": "0.1654636",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h5bx35u",
            "score": 1,
            "text": "Lying vs deception. You can lie while technically telling the truth.",
            "title_similarity": "0.3941779",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5bx8ga",
            "score": 1,
            "text": "Wait, what? That was fucking legal?",
            "title_similarity": "0.13141835",
            "sentiment_compound": 0.2853
        },
        {
            "id": "h5bx9cx",
            "score": 1,
            "text": "You ever see a news title and just wanna go over to The Onion and see what their twist on it is?",
            "title_similarity": "0.33200765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxc9m",
            "score": 1,
            "text": "Sorry if I'm missing something here but shouldn't this be like...the norm?",
            "title_similarity": "0.22642833",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h5bxe7n",
            "score": 1,
            "text": "How are you going to maintain law and order if you don't build on a base of deceit and lies?",
            "title_similarity": "0.4424517",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5bxfzu",
            "score": 1,
            "text": "Cue creative language about obfuscation not being lying.",
            "title_similarity": "0.21703793",
            "sentiment_compound": 0.6884
        },
        {
            "id": "h5bxgz4",
            "score": 1,
            "text": "Wait why did this have to be “banned”. Like it shouldn’t be a thing to begin with never mind such a thing that it needs to be banned",
            "title_similarity": "0.49547213",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5bxhhn",
            "score": 1,
            "text": "Seems uncontroversial. So I assume republicans didn't vote for it\n\nI assume this gets rid of the movie trope of cops telling a prisoner that their friend is in the next room telling them everything, right?",
            "title_similarity": "0.61995864",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5bxhwc",
            "score": 1,
            "text": "Lol what? How is this even a thing? Christ, America is a fucking cesspit.",
            "title_similarity": "0.33104065",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h5bxizh",
            "score": 2,
            "text": "How about we make it illegal for police to lie period.",
            "title_similarity": "0.6567294",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5bxm1u",
            "score": 1,
            "text": "Why just minors??",
            "title_similarity": "0.3092904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxq2m",
            "score": 1,
            "text": "Wait..... first? Uh oh",
            "title_similarity": "-0.034335997",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxuoa",
            "score": 1,
            "text": "All police should be, always. Right?",
            "title_similarity": "0.2562175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxv7g",
            "score": 1,
            "text": "Lying isn't illegal ? bigauthories",
            "title_similarity": "0.26026016",
            "sentiment_compound": -0.122
        },
        {
            "id": "h5bxvcs",
            "score": 1,
            "text": "Yeah, that'll stop 'em.",
            "title_similarity": "0.16474314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxxun",
            "score": 1,
            "text": "Oh America… never change",
            "title_similarity": "0.23390222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxz2o",
            "score": 1,
            "text": "Wot? This mean they were allowed to lie to everyone before? America are you ok?",
            "title_similarity": "0.55092597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bxzot",
            "score": 1,
            "text": "Why can't you do this for politicians?",
            "title_similarity": "0.43568295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5by2lq",
            "score": 1,
            "text": "I wonder how many Sovereign citizens are here.",
            "title_similarity": "0.18704721",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5by5sx",
            "score": 2,
            "text": "Queue the \"it wasn't a lie, it was a mistruth\" defense.",
            "title_similarity": "0.29984087",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5by7gj",
            "score": 1,
            "text": "Wait. What?",
            "title_similarity": "-0.00976591",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5byc5o",
            "score": 1,
            "text": "Why was this law in the first place? 🤔",
            "title_similarity": "0.31459385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bynzc",
            "score": 1,
            "text": "This should be illegal for all ages",
            "title_similarity": "0.5444387",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5byps0",
            "score": 1,
            "text": "Go even further and make it illegal to interview anyone under the age of 18 without a lawyer.",
            "title_similarity": "0.71131295",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5byqvq",
            "score": 1,
            "text": "They shouldn't be lying to anyone. WTH?",
            "title_similarity": "0.3320655",
            "sentiment_compound": -0.3307
        },
        {
            "id": "h5bysbn",
            "score": 1,
            "text": "I'm surprised this ban was passed. Glad it was, but surprised all the same. Here's hoping they enforce it.",
            "title_similarity": "0.31109115",
            "sentiment_compound": 0.7073
        },
        {
            "id": "h5bywjd",
            "score": 1,
            "text": "According to the headline, it's still legal for them to lie to Caucasians.... That doesn't seem bigoted at all.",
            "title_similarity": "0.49707663",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5bywz8",
            "score": 1,
            "text": "TIL that it was, and apparently still is legal in a lot of states, that police were allowed to lie to minors in interrogations. Wtf?? Do we expect a child to understand the law in it’s entirety? How can we expect a child to know about their 4th and 5th amendment rights when we coerce children in interrogations?",
            "title_similarity": "0.6749441",
            "sentiment_compound": -0.644
        },
        {
            "id": "h5byy40",
            "score": 1,
            "text": "S/o Chicago even tho them lies ain’t phase the real",
            "title_similarity": "0.50313616",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5bz6z2",
            "score": 1,
            "text": "wtf is wrong with us.  jfc.",
            "title_similarity": "0.24145405",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h5bzbsf",
            "score": 1,
            "text": "[Cops](https://thumbs.gfycat.com/HelpfulLargeIberianlynx-max-1mb.gif)",
            "title_similarity": "0.3676827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5bzi24",
            "score": 1,
            "text": "Police aren't trained anywhere near enough to be handling any kind of investigation outside of \"observe and report\", let alone an interrogation. Irritating also that they're allowed to lie at all. Anyone responsible for Law Enforcememt shouldn't be permitted carte blanche to lie on record if doing so is so a crime for everyone else.",
            "title_similarity": "0.63098717",
            "sentiment_compound": -0.7564
        },
        {
            "id": "h5bzi62",
            "score": 1,
            "text": "Haha this reminds me of that thing people used to believe that if you ask someone if they’re a cop they HAVE to tell you they’re a cop. I guess with this new law, and if your a minor, then technically it’s true now!",
            "title_similarity": "0.5387431",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h5bzj05",
            "score": 1,
            "text": "Hey you guys are doing a great job in Illinois, especially the inner city of Chicago. And this is what you are focused on?",
            "title_similarity": "0.30227876",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h5bzro8",
            "score": 1,
            "text": "How are ANY lies during the prosecution process considered \"due process\"?",
            "title_similarity": "0.5320411",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h5bzxbm",
            "score": 1,
            "text": "This is a very positive step.  Police should not be allowed to lie to anyone.",
            "title_similarity": "0.42681998",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h5bzxvz",
            "score": 2,
            "text": "Sick and twisted we need to ban it. Now will anyone do anything about it, if they keep doing it, is the question.",
            "title_similarity": "0.4605819",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h5bzxw4",
            "score": 1,
            "text": "Wait that isn't already banned??",
            "title_similarity": "0.21893933",
            "sentiment_compound": 0.4291
        },
        {
            "id": "h5bzzyh",
            "score": 1,
            "text": "\"I *am* going to shoot you\"",
            "title_similarity": "0.2571299",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5c00f0",
            "score": 1,
            "text": "It's sad that it even needed to be a law in the first place.",
            "title_similarity": "0.39814794",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5c0451",
            "score": 1,
            "text": "It should already be banned.\n\nKind of sad these rules weren't already in place.",
            "title_similarity": "0.47874063",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h5c0hx6",
            "score": 1,
            "text": "my bf told me a story about how he was playing airsoft with his friend (him and his family didn’t speak english fluent- relevant later) when they were kids and someone in their neighborhood accused the two of property damage. they both were taken to the police station and investigated.\nmy bf said the cops spoke to him normally, just asked him questions and let him leave. afterwards, they took his friend into the interrogation room and started yelling and cursing at him about how they already had undeniable evidence and he just needed to confess. he broke down and confessed out of confusion and fear. \nreally sick that this has been legal ANYWHERE tbh",
            "title_similarity": "0.5332181",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h5c0jut",
            "score": 2,
            "text": "How is lying defined?",
            "title_similarity": "0.21385618",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5c0qow",
            "score": 1,
            "text": "This should be in r/nottheonion",
            "title_similarity": "0.10489141",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c0wgf",
            "score": 1,
            "text": "This shit should have been posted on r/nottheonion",
            "title_similarity": "0.32617062",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5c0xhz",
            "score": 1,
            "text": "What’s up with the black guy as the cover photo? You saying only blacks were effected by this?",
            "title_similarity": "0.42652977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c0yiw",
            "score": 1,
            "text": "So minors in Illinois can do the whole 'are you a cop, you gotta tell me if you're a cop, it's the law' bit",
            "title_similarity": "0.71003747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c0yw7",
            "score": 1,
            "text": "Good you shouldn’t lie if you want people to tell the truth it’s on them if there’s lying.",
            "title_similarity": "0.4224319",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5c0zin",
            "score": 1,
            "text": "This is one of those things where I say “bout time” but I don’t think we should be handcuffing the police like we are though In other respects",
            "title_similarity": "0.50273407",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h5c145h",
            "score": 1,
            "text": "Good. More often then not minors have no idea whats going on when a cop is involved",
            "title_similarity": "0.45063835",
            "sentiment_compound": 0.5842
        },
        {
            "id": "h5c175b",
            "score": 1,
            "text": "Great! Now outlaw unlawful arrests!",
            "title_similarity": "0.4676294",
            "sentiment_compound": 0.4184
        },
        {
            "id": "h5c1b0a",
            "score": 1,
            "text": "Shouldn't be allowed to lie to anyone.",
            "title_similarity": "0.43874174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c1b1j",
            "score": 1,
            "text": "How could that be legal in any state?",
            "title_similarity": "0.3486554",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5c1d04",
            "score": 1,
            "text": "2021 and this is the **FIRST** state to implement this…",
            "title_similarity": "0.23749293",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c1i6s",
            "score": 1,
            "text": "Next, stop pushing for trying children as adults. Eighteen year olds aren't fully matured, why are we pretending that sixteen year olds are?",
            "title_similarity": "0.4898225",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5c1mcj",
            "score": 1,
            "text": "This will someone be turned by the boot licking right into a reason the crime in Chicago is getting worse.",
            "title_similarity": "0.52740717",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5c1okv",
            "score": 2,
            "text": "A cop lied to me. That same cop ended up raping a girl and was caught because he jizzed on his own squad car tire. Maybe we need higher standard for our police.",
            "title_similarity": "0.6121995",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h5c1sce",
            "score": 8,
            "text": "Lying to the police is a crime. The police lying to you is a technique. This is a police state.",
            "title_similarity": "0.6168119",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h5c1vnd",
            "score": 1,
            "text": "/r/nottheonion",
            "title_similarity": "0.12775666",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c20uv",
            "score": 1,
            "text": "Police lying? When, how? They never do anything wrong on their days off!",
            "title_similarity": "0.5198091",
            "sentiment_compound": -0.3607
        },
        {
            "id": "h5c2bmi",
            "score": 1,
            "text": "It shouldn't be legal in the first place to lie to someone in an interrogation, regardless if they're an adult or minor. You'd need to lie about what evidence you have against a suspect to coerce a false confession.\n\nPolice deceive suspects to get information out and discredit them. Which is why you *ALWAYS* exercise your fifth amendment right to be silent and shut up. Whether you are innocent or guilty, shut the fuck up and don't talk to police. Don't even answer questions in a traffic stop, aside from those you are legally required to answer. They're not there to help you when you are in their sights.",
            "title_similarity": "0.702469",
            "sentiment_compound": -0.9278
        },
        {
            "id": "h5c2dfp",
            "score": 1,
            "text": "Great. Now do the same for adults.",
            "title_similarity": "0.09636809",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5c2duc",
            "score": 1,
            "text": "Jb killing it!",
            "title_similarity": "0.28926152",
            "sentiment_compound": -0.69
        },
        {
            "id": "h5c2e9y",
            "score": 1,
            "text": "Yeah, but they have to tell me if they’re a cop, right?",
            "title_similarity": "0.44100106",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5c2g4d",
            "score": 1,
            "text": "How about we ban them from lying to anyone during interrogations, after interrogations, in court, ….",
            "title_similarity": "0.6322995",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5c2px9",
            "score": 2,
            "text": "As if something bring illegal will stop cops from doing it...",
            "title_similarity": "0.549538",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5c2rw5",
            "score": 2,
            "text": "When I was 18 I got arrested with friends, they told me all my friends had talked so I might as well talk.  I didn't believe them and luckily it wasn't true.  Dick move though.",
            "title_similarity": "0.54879975",
            "sentiment_compound": 0.8347
        },
        {
            "id": "h5c2ryr",
            "score": 1,
            "text": "First state. \\*Looks at the year...sighs\\*",
            "title_similarity": "0.2465474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c2st1",
            "score": 2,
            "text": "You mean this wasn’t already banned? Wtf 🤦🏻‍♂️",
            "title_similarity": "0.2581023",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h5c2wyi",
            "score": 1,
            "text": "WOW!!! The first one.",
            "title_similarity": "-0.02299922",
            "sentiment_compound": 0.7513
        },
        {
            "id": "h5c34e9",
            "score": 2,
            "text": "This will solve Chicago’s problems.",
            "title_similarity": "0.287",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h5c38fy",
            "score": 1,
            "text": "Can we do the same thing for affidavits?",
            "title_similarity": "0.17648545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c399n",
            "score": 1,
            "text": "Kid: “Is my mum gonna die?”\nCop: “*Yes she is and I can’t tell you otherwise so cry about it*”",
            "title_similarity": "0.44673398",
            "sentiment_compound": -0.6113
        },
        {
            "id": "h5c39di",
            "score": 1,
            "text": "Illinois actually doing something good for once",
            "title_similarity": "0.22585104",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5c3dda",
            "score": 3,
            "text": "Police shouldn’t lie to anyone.",
            "title_similarity": "0.49528635",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c3kj3",
            "score": 1,
            "text": "I have questions 😐",
            "title_similarity": "-0.019880638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c3ru3",
            "score": 2,
            "text": "Thank god they can at least still lie to adults\n\nWouldn’t want the cops to have no one to lie to you know?",
            "title_similarity": "0.6018804",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5c41ma",
            "score": 2,
            "text": "Never talk to the police without a lawyer. It’s seriously fucked up that the police intentionally lie to anyone being interrogated. It’s even sicker that they do that to a minor.",
            "title_similarity": "0.6511041",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h5c43de",
            "score": 1,
            "text": "There it is again, that funny feeling…",
            "title_similarity": "-0.027946873",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5c48q3",
            "score": 1,
            "text": "So the criminals have to tell the truth but the police can lie? What?",
            "title_similarity": "0.53686345",
            "sentiment_compound": -0.2958
        },
        {
            "id": "h5c4bdc",
            "score": 1,
            "text": "Law enforcement not allowed to lie… what a concept.",
            "title_similarity": "0.34476674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c4c7b",
            "score": 1,
            "text": "The FIRST?",
            "title_similarity": "-0.014315598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c4e9v",
            "score": 2,
            "text": "Go Illinois. My state may be broke and had several corrupt governors. But at least weed is legal and this shit will stop.",
            "title_similarity": "0.6617515",
            "sentiment_compound": -0.8338
        },
        {
            "id": "h5c4id8",
            "score": 1,
            "text": "This wasn’t banned?\nGod what’s wrong with our country.",
            "title_similarity": "0.36385053",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5c4mrb",
            "score": 1,
            "text": "Can’t find my old comment but “wheeling” should have said “squealing”. Note to self: never use dictation to write comments without checking them first!!",
            "title_similarity": "0.49319533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c4wsl",
            "score": 1,
            "text": "Wow if this isn’t a day late a dollar short.",
            "title_similarity": "0.12529892",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5c52b0",
            "score": 1,
            "text": "Defund",
            "title_similarity": "0.14475851",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c52xw",
            "score": 3,
            "text": "Cool. My life would have been completely different if they had had this back in the day. Had to spend my college fund on a high priced lawyer to avoid being charged with a felony and doing time because the cops got me to the police station specifically without my parents knowledge and lied their asses off until they got a confession. The charge was eventually expunged from my record, but I’m pretty sure I’ve still lost job opportunities because you can still find the exaggerated news article about it on google over 20 years later. (And no I’m not gonna tell what it was. It wasn’t something where anyone got hurt at all, that’s all I’m gonna say)",
            "title_similarity": "0.61086535",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5c5488",
            "score": 2,
            "text": "I bet they still do it with little or no repercussions.",
            "title_similarity": "0.09637052",
            "sentiment_compound": -0.2315
        },
        {
            "id": "h5c5bdj",
            "score": 1,
            "text": "How about police being in a position where they cannot lie at all?",
            "title_similarity": "0.4592672",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c5dm9",
            "score": 1,
            "text": "Damn AJ Soprano probably wouldn’t have been expelled...",
            "title_similarity": "0.2735697",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h5c5hjn",
            "score": 1,
            "text": "They're supposed to be held to a higher standard. Why should they be able to lie to anyone without consequence?",
            "title_similarity": "0.4003657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c5j0k",
            "score": 1,
            "text": "“Alright, your buddy came clean and ratted you out already, so don’t even think about lying because we already know the truth.” -Cops who know literally nothing.",
            "title_similarity": "0.52474165",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h5c5wb0",
            "score": 2,
            "text": "I'm certain their allocation for doing that in the past is way over budget.",
            "title_similarity": "0.235255",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5c5zy5",
            "score": 1,
            "text": "Color me surprised",
            "title_similarity": "0.046554007",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5c641p",
            "score": 2,
            "text": "Man police are banned from shooting minors, and they still get away with it.\n\nDo you really think that banning them from 'lies' is going to have any applicable impact?",
            "title_similarity": "0.7077069",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5c645o",
            "score": 3,
            "text": "Cops are liars.  They lie about anything and everything.  The fact that it was/is legal tells you all you need to know about cops.  Liars can never be trusted, ever.  Cops are liars.",
            "title_similarity": "0.5637579",
            "sentiment_compound": -0.9053
        },
        {
            "id": "h5c65qm",
            "score": 1,
            "text": "Just to minors huh?",
            "title_similarity": "0.24722731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c6dxo",
            "score": 1,
            "text": "Why is this even a thing",
            "title_similarity": "0.11556249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c6il6",
            "score": 1,
            "text": "That's gonna be hard for them.",
            "title_similarity": "0.09853999",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5c6j3t",
            "score": 2,
            "text": "Police lying to ANYONE should create an absolute shitstorm. They should not only be fired, but jailed.",
            "title_similarity": "0.5602678",
            "sentiment_compound": -0.6108
        },
        {
            "id": "h5c6jib",
            "score": 1,
            "text": "Former Middle School teacher here. Some of my parting words of wisdom to my students (among other things) is that no matter what, even if you aren’t guilty of a darn thing is to yell, scream, and insist that your parent or guardian or attorney be present before you tell them anything other than your name and address.",
            "title_similarity": "0.44413203",
            "sentiment_compound": -0.2901
        },
        {
            "id": "h5c6o1n",
            "score": 1,
            "text": "Does this work both ways?  Are minors banned from lying to the police?",
            "title_similarity": "0.6372746",
            "sentiment_compound": -0.7757
        },
        {
            "id": "h5c6pz2",
            "score": 1,
            "text": "I wonder if they’ll increase the penalty for lying to police now?",
            "title_similarity": "0.5593301",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h5c6r75",
            "score": 1,
            "text": "That’s hilarious to read. Me and my two other friends got interrogated at the Waukegan police station all because we picked up a ten sack of weed from our dealer back before weed was legal. Got followed by an undercover police car and pulled over. It was ridiculous. Didn’t tell our parents where they took us at first. Did everything they could to get any information on the dude we picked up from.  Put us in separate rooms and played with our minds.  I remember they left me in that interrogation room for a while before they came in and even randomly played classical jazz music to mess with my head. It was unsettling.  My other two friends said they could see each other through a glass window. I couldn’t see any of them.",
            "title_similarity": "0.6119723",
            "sentiment_compound": 0.765
        },
        {
            "id": "h5c6rnj",
            "score": 3,
            "text": "What’s going to stop them from lying? If cops can burst into the wrong house and kill an unarmed person, what’s a lie???",
            "title_similarity": "0.67183983",
            "sentiment_compound": -0.9367
        },
        {
            "id": "h5c6tc8",
            "score": 1,
            "text": "New headline, police across the country lie to minors to get convictions",
            "title_similarity": "0.65007436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c6uzq",
            "score": 1,
            "text": "How about we ban them from fucking lying to everyone",
            "title_similarity": "0.58749616",
            "sentiment_compound": -0.807
        },
        {
            "id": "h5c6v4h",
            "score": 1,
            "text": "Another law that should have not to be made. Those police that do that are true pigs.",
            "title_similarity": "0.50220513",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5c6z7x",
            "score": 1,
            "text": "I'm sure they'll follow that law, just like they follow current laws\n\nhttps://www.theguardian.com/us-news/2015/feb/24/chicago-police-detain-americans-black-site",
            "title_similarity": "0.56000066",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5c720v",
            "score": 1,
            "text": "…Police should not be able to lie during interrogations",
            "title_similarity": "0.5504694",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c7b8w",
            "score": 1,
            "text": "remember in the TV show The Wire they would be grilling more than one suspect separately and they would tell him your buddy already sold you out. they can't do that anymore",
            "title_similarity": "0.54559594",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h5c7bod",
            "score": 1,
            "text": "Bout time!",
            "title_similarity": "-0.07563117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c7jk0",
            "score": 1,
            "text": "Lead by example !",
            "title_similarity": "0.060307063",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c7q37",
            "score": 1,
            "text": "Why can they lie to people in the first place? If civilians lie, we get in more trouble, if they lie, they get a pat on the back for getting the information they wanted....",
            "title_similarity": "0.50145906",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h5c7rhc",
            "score": 1,
            "text": "This is sad review of our society that you need to make illegal, that was all ready illegal……and that the rhyming you specifically need to make illegal is lying to children……",
            "title_similarity": "0.5565861",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h5c7utu",
            "score": 1,
            "text": "Probably the 200th time for this comment but…yeah…they’re still gonna lie to minors.",
            "title_similarity": "0.54854167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c7vy6",
            "score": 1,
            "text": "Sad to think we actually need a law for common sense 🙄",
            "title_similarity": "0.3015538",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5c7xjm",
            "score": 1,
            "text": "First…?",
            "title_similarity": "0.03528405",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c826y",
            "score": 1,
            "text": "They will always find a way around it. What a world we live in.",
            "title_similarity": "-0.00026864372",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c86yq",
            "score": 3,
            "text": "\"But why does everyone hate us\" - some dumbass cop probably",
            "title_similarity": "0.47842336",
            "sentiment_compound": -0.899
        },
        {
            "id": "h5c870g",
            "score": 3,
            "text": "Police shouldnt be allowed to lie at all. Never speak with the police no matter how they they to threaten you. \n\n\nacab",
            "title_similarity": "0.60388494",
            "sentiment_compound": -0.3968
        },
        {
            "id": "h5c89dh",
            "score": 3,
            "text": "Yeah? Let’s see how well that goes with the tyrants. They’ll just use the old redneck line “I thought they was 18!” Oh well, he incriminated himself. It’ll be as common as pretending they smell marijuana to force a search of your car or pulling you out of your home and searching your house without a warrant if you open the door and they get a foot or hand on your door gram so you can’t close it without hurting them.",
            "title_similarity": "0.6522863",
            "sentiment_compound": 0.8898
        },
        {
            "id": "h5c89w3",
            "score": 2,
            "text": "Police should not be able to interrogate minors at all without a parent, guardian, and/or lawyer present.",
            "title_similarity": "0.63074136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c8els",
            "score": 3,
            "text": "Either make it illegal for the police to lie, or make it legal to lie to the police.",
            "title_similarity": "0.6368985",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5c8fvz",
            "score": 3,
            "text": "Cool, now make it actually illegal to lie to adults during interrogations too.",
            "title_similarity": "0.6803925",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5c8i7l",
            "score": 2,
            "text": "are a bunch of tape recorders going to start having technical issues?",
            "title_similarity": "0.32260334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c8njh",
            "score": 1,
            "text": "This won’t stop them from shooting the kids though",
            "title_similarity": "0.47185212",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5c8vnn",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5c9df7",
            "score": 2,
            "text": "This will probably be overturned by some court because scotus is perpetually full of assholes who think law enforcement can do whatever they like.",
            "title_similarity": "0.45487383",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5c9ff4",
            "score": 1,
            "text": "How do you even enforce this? They can still lie, kids call them out, then they call the kids liars",
            "title_similarity": "0.50296724",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5c9fx6",
            "score": 1,
            "text": "Not sure why any minor would be speaking to police without a parent anyway.",
            "title_similarity": "0.5942373",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h5c9g1f",
            "score": 1,
            "text": "I'm just fucken stupid - it never occurred to me that the protect and service would lie to kids. ugh.  What is wrong with these cops.",
            "title_similarity": "0.6139219",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h5c9msa",
            "score": 1,
            "text": "Didn’t know this was even an issue",
            "title_similarity": "0.21593079",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5c9mup",
            "score": 1,
            "text": "Wow. The first state.",
            "title_similarity": "0.14485873",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5c9v3a",
            "score": 1,
            "text": "WHAT?! That was ok before? \nNOAH!!!!…",
            "title_similarity": "0.20303477",
            "sentiment_compound": 0.5759
        },
        {
            "id": "h5ca0lw",
            "score": 1,
            "text": "Anyone ever watch the show 'the closer'? That sho",
            "title_similarity": "0.2000024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ca1tt",
            "score": 3,
            "text": "Never never never talk to cops with out a lawyer.  They are not your friend or buddy all they want is a conviction and most will do anything for it.",
            "title_similarity": "0.55615187",
            "sentiment_compound": -0.3244
        },
        {
            "id": "h5ca6ui",
            "score": 1,
            "text": "What about adults?",
            "title_similarity": "0.12710175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ca7lt",
            "score": 1,
            "text": "Has someone posted this to r/nottheonion?",
            "title_similarity": "0.19559005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cahcj",
            "score": 3,
            "text": "They shouldn’t be allowed to lie to anyone",
            "title_similarity": "0.44773594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5caieq",
            "score": 3,
            "text": "They should be banned from lying period",
            "title_similarity": "0.49260223",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h5caslr",
            "score": 2,
            "text": "hahaha, good luck getting any prosecutor to prosecute a cop for breaking a law, cops won't even get in trouble for brady violations, this is nothing but a charade",
            "title_similarity": "0.6573945",
            "sentiment_compound": 0.09
        },
        {
            "id": "h5cb0rn",
            "score": 4,
            "text": "Why not just ban lying in general?",
            "title_similarity": "0.43906546",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h5cb35m",
            "score": 5,
            "text": "They should honestly ban police from lying at all.",
            "title_similarity": "0.5905291",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5cbdkl",
            "score": 1,
            "text": "Will this actually take place? What are the stipulations for the police to get around it? …minors need this to be protected",
            "title_similarity": "0.5457925",
            "sentiment_compound": 0.504
        },
        {
            "id": "h5cbdts",
            "score": 1,
            "text": "Wow",
            "title_similarity": "-0.13203375",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5cbenh",
            "score": 3,
            "text": "They shouldn't be allowed to lie to anyone.",
            "title_similarity": "0.42294407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cbiom",
            "score": 3,
            "text": "Police lying to anyone should be illegal, straight up.",
            "title_similarity": "0.67737305",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h5cbiwu",
            "score": 1,
            "text": "This wasn’t a thing before what the actual fuck. Makes me think about what they’re lying about when they aren’t being told to be honest for once.",
            "title_similarity": "0.463699",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5cbng1",
            "score": 1,
            "text": "Thank fucking god",
            "title_similarity": "-0.032073908",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h5cbv5n",
            "score": 1,
            "text": "If you're shocked by the fact that it was legal in all 50 states up until now, I recommend watching [this](https://youtu.be/d-7o9xYp7eE). Innocent or guilty, it's almost always a bad idea to talk to the police.",
            "title_similarity": "0.6079802",
            "sentiment_compound": -0.4472
        },
        {
            "id": "h5cby09",
            "score": 1,
            "text": "What the absolute fuck.",
            "title_similarity": "0.09512487",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5cc00s",
            "score": 1,
            "text": "Always appropriate to post this: https://youtu.be/d-7o9xYp7eE",
            "title_similarity": "0.108465716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cc1on",
            "score": 2,
            "text": "Looks like my hardcore thin-blue-line friend is about to have an epic meltdown on Facebook lol…",
            "title_similarity": "0.4448226",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h5cc35c",
            "score": 5,
            "text": "And the fact that this is only now becoming a rule is exactly why any lawyer will tell you to not talk to the police without a lawyer present.\n\nhttps://www.youtube.com/watch?v=d-7o9xYp7eE",
            "title_similarity": "0.6129459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cc4pn",
            "score": 3,
            "text": "Crazy, most people have no idea cops are allowed to and encouraged to lie during any encounter. They are usually looking for admission of guild or to get your ID without a crime committed. Propaganda has blinded almost everyone. Cops are not your friend.",
            "title_similarity": "0.6056936",
            "sentiment_compound": -0.6067
        },
        {
            "id": "h5ccbvs",
            "score": 1,
            "text": "Sadly Humans do not have enough time left for a law to stop politicians lying to the public",
            "title_similarity": "0.52022547",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h5cckde",
            "score": 2,
            "text": "The sad part is that this has to be made into a law….",
            "title_similarity": "0.33845967",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5cckxz",
            "score": 2,
            "text": "Now let's see it 49 more times",
            "title_similarity": "0.06298128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ccncg",
            "score": 2,
            "text": "White male here.  I've taught my kids from early on: You NEVER talk to the cops.  Here is your script.  You say this, only this: \" I want my mom, I want my dad, I want a lawyer\".  Not a word more.",
            "title_similarity": "0.54945254",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5ccqdy",
            "score": 3,
            "text": "Can they ban police from lying to everyone during interrogations too now? And not just police; each and every \"expert\" - psychologist, lab tech, lawyer as well.",
            "title_similarity": "0.63884056",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h5ccu80",
            "score": 2,
            "text": "Just the fact that this needs to be a Law… ಠ_ಠ",
            "title_similarity": "0.24233109",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cdhdu",
            "score": 2,
            "text": "If you lie to the police its obstruction of justice, when they lie to you its an integration tactic....",
            "title_similarity": "0.5916753",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5cdhqy",
            "score": 3,
            "text": "They should ban police from lying to everyone.",
            "title_similarity": "0.6492562",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5cdur4",
            "score": 2,
            "text": "I would prefer that all interrogation be videotaped and that in any confession where there is no physical evidence or the sole reliance was deceptive interrogation the jury is instructed to assess the case and weigh the quality of the confession for influence or coercion",
            "title_similarity": "0.6000427",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5cdwrd",
            "score": 3,
            "text": "If it’s legal for cops to lie to me, why isn’t it legal for me to lie to cops?",
            "title_similarity": "0.6399482",
            "sentiment_compound": 0.25
        },
        {
            "id": "h5ceb4w",
            "score": 3,
            "text": "TIL it is legal for police to lie to minors in 49 states",
            "title_similarity": "0.718458",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5cedkd",
            "score": 2,
            "text": "Police dishonesty is an American travesty and not something uniformly practiced by police across the world.",
            "title_similarity": "0.52504665",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h5cee8g",
            "score": 1,
            "text": "r/aboringdystopia",
            "title_similarity": "0.062404595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cen7u",
            "score": 1,
            "text": "As others pointed out the fact they can lie in the first place is whack. One should always just pull a “Shades” and answer every phrase with “lawyer”.",
            "title_similarity": "0.45958713",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cenf6",
            "score": 1,
            "text": "Why just minors?",
            "title_similarity": "0.30441517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ceo1l",
            "score": 2,
            "text": "Why even be a police officer if you can't lie to minors so they end up incarcerated for the rest of their lives?  \n\n/s",
            "title_similarity": "0.6667736",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cept5",
            "score": 1,
            "text": "Holy shit",
            "title_similarity": "-0.020282958",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5cewms",
            "score": 1,
            "text": "Wait that wasn’t already illegal??",
            "title_similarity": "0.23365921",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h5cexnb",
            "score": 2,
            "text": "How about outlawing lying at all during official police business thats not undercover?\n\nIf a cop can lie to me how can i possibly trust any law enforcement? The fact they can would encourage anyone to stay silent even if they could help.\n\nIf law enforcement doesnt have integrity the public will continue to lose respect for them.",
            "title_similarity": "0.6526814",
            "sentiment_compound": 0.6679
        },
        {
            "id": "h5cf0ly",
            "score": 1,
            "text": "Lmao what the fuck man. Cops shouldn’t be able to fucking skeeze you into crimes!! This world is just insane. I would poop on a cops head",
            "title_similarity": "0.5897154",
            "sentiment_compound": -0.4374
        },
        {
            "id": "h5cf1v2",
            "score": 1,
            "text": "So police are allowed to lie?",
            "title_similarity": "0.53366536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cf2un",
            "score": 1,
            "text": "Well it’s about time",
            "title_similarity": "-0.059434146",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5cf3d0",
            "score": 2,
            "text": "Fuck the police.",
            "title_similarity": "0.38512427",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5cf6sl",
            "score": 1,
            "text": "Because they dont have rights!? What kind of a loophole is that shit!",
            "title_similarity": "0.2838781",
            "sentiment_compound": -0.6351
        },
        {
            "id": "h5cfres",
            "score": 1,
            "text": "But you can lie to white people and discriminate against them if your the mayor of Chicago. Clown world.",
            "title_similarity": "0.6120641",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cfsi7",
            "score": 1,
            "text": "how dare they lie on camera and setup people.",
            "title_similarity": "0.4275269",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cfsva",
            "score": 1,
            "text": "Holup- so you can lie to others?",
            "title_similarity": "0.3672487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cfy9p",
            "score": 1,
            "text": "Wait WHAT",
            "title_similarity": "-0.023975728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cg4up",
            "score": 1,
            "text": "Just out of curiosity, who is going to enforce this ban?",
            "title_similarity": "0.40123272",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h5cg4vl",
            "score": 2,
            "text": "Police shouldn't be allowed to lie at all during the performance of their duties! That immediately compromises anything they gain.",
            "title_similarity": "0.5760618",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h5cg776",
            "score": 1,
            "text": "Wait  - are we stating the obvious?!",
            "title_similarity": "0.05393728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cg7r1",
            "score": 1,
            "text": "Thought this was an onion article. Boy oh boy was I wrong",
            "title_similarity": "0.24461277",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5cglqt",
            "score": 1,
            "text": "First state??!?",
            "title_similarity": "0.17010915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cglxh",
            "score": 1,
            "text": "There’s alot of cases of murderers and other criminals who wouldn’t be able to be charged without a confession and if being decisive is the way to get it then I don’t see why there’s anything wrong with it.",
            "title_similarity": "0.49549815",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h5cgnez",
            "score": 1,
            "text": "So they can still lie to adults?",
            "title_similarity": "0.4641878",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cgwgr",
            "score": 1,
            "text": "Well I’ll be!",
            "title_similarity": "-0.08714677",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h5chd3i",
            "score": 1,
            "text": "Wow, what a monumental step forward /s. I know it’s a necessary one, but I’m sad that it took this long to take that step",
            "title_similarity": "0.10983096",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h5chlrb",
            "score": 1,
            "text": "This is legal?",
            "title_similarity": "0.027788866",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5chmtc",
            "score": 1,
            "text": "Why was this not already a law",
            "title_similarity": "0.32681683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cho5p",
            "score": 1,
            "text": "Thats always been illegal",
            "title_similarity": "0.31361544",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5chrlb",
            "score": 1,
            "text": "All cops are bastards",
            "title_similarity": "0.38097072",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5chwot",
            "score": 2,
            "text": "Demilitarize the police\n\nConfiscate their weapons of war\n\nFund mental health first responders & community watchers\n\nHigher standards for LEOs\n\nHigher education\n\nHigher training\n\nHigher accountability\n\nHigher pay\n\nLess cops needed\n\nLess LEO related deaths\n\n‪https://www.Senatordeets.us/issues",
            "title_similarity": "0.51512194",
            "sentiment_compound": -0.802
        },
        {
            "id": "h5chz39",
            "score": 1,
            "text": "Honestly, I thought IL would be the 2nd state to start abolishing free speech.",
            "title_similarity": "0.5451833",
            "sentiment_compound": 0.743
        },
        {
            "id": "h5ci4g1",
            "score": 2,
            "text": "The fact that police lie to anyone at all is fucked.",
            "title_similarity": "0.5651586",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h5ci4jl",
            "score": 2,
            "text": "This is another excellent opportunity to tell people to exercise their 5th amendment right to not be a witness against themselves - don’t talk to the police. And watch this video and the police officer rebuttal!  https://youtu.be/d-7o9xYp7eE",
            "title_similarity": "0.6227103",
            "sentiment_compound": 0.7777
        },
        {
            "id": "h5ci7xa",
            "score": 1,
            "text": "Waite Waite!  They can lie but I can’t!",
            "title_similarity": "0.38753015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cihg7",
            "score": 1,
            "text": "How bout lying in general? lol",
            "title_similarity": "0.20593116",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5cijho",
            "score": 3,
            "text": "They should be banned from lying to anyone, regardless of age. The only incentive for lying to a suspect is to make them incriminate themselves when the police have no evidence with which to charge that suspect.\n\nWhether you are guilty or innocent, talking to a cop without legal representation will not help your position.",
            "title_similarity": "0.7008578",
            "sentiment_compound": -0.9426
        },
        {
            "id": "h5ciqxh",
            "score": 1,
            "text": "And all this time the fuzz was like, \"Why doesn't the public trust us?\"",
            "title_similarity": "0.3439232",
            "sentiment_compound": -0.0521
        },
        {
            "id": "h5ciz2n",
            "score": 3,
            "text": "How is this shit fucking allowed anywhere? This is so stupid it’s unbelievable. Seriously this country is so full of shit.",
            "title_similarity": "0.35747486",
            "sentiment_compound": -0.9204
        },
        {
            "id": "h5cjgy5",
            "score": 1,
            "text": "Police can lie about anything. That's why they pull you over and give some outrageous number, like you were on radar doing 69 in a 45...You respond truthfully saying I was only going about 52.  Then they write out the ticket....observed ~~customer~~, sorry, Mark traveling at what looked to be a high rate of speed. Mark admitted going 52 in a 45 zone, radar was not used.",
            "title_similarity": "0.5597518",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5cjje6",
            "score": 2,
            "text": "That line from the cop is pure gold OMEGALUL",
            "title_similarity": "0.24369907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cjnxz",
            "score": 2,
            "text": "Oh yeah they'll stick to that",
            "title_similarity": "-0.066504",
            "sentiment_compound": 0.296
        },
        {
            "id": "h5cjyi0",
            "score": 2,
            "text": "I was lied to as a minor during an initial interrogation….. \n\nGranted what I did *was* illegal - it was still very fucked up",
            "title_similarity": "0.55314124",
            "sentiment_compound": -0.8718
        },
        {
            "id": "h5ckhlw",
            "score": 1,
            "text": "Oink oink",
            "title_similarity": "-0.017861791",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ckive",
            "score": 1,
            "text": "“My dad asked me to ask you if you’re a police officer cos you have to tell me if you are”",
            "title_similarity": "0.5134234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ckv77",
            "score": 5,
            "text": "Holy shit, this happened to me when I was a teenager. I was 16 driving home from work. Cop pulled me over and asked me to turn off my car. Tells me he needs to call my parents and have them come pick up my car for the gas I just stole (this was when you pump then party obv). Said the place I stole it from had my plates and my car matched. At this point I knew he was lying because the gas station was at an intersection I was never at. When I proceeded to address this but telling him I was never there so it’s not possible they have this information. He made me get out searches me, put me in cuffs, put me in his car and took me to the gas starting where the attendant told him I wasn’t he person who did it. He left me if the cuffs, drove me back to my car and acted like I was in the wrong fro even questioning him for me being incorrect. Uncuffed me like he did nothing wrong and went on his merry way.",
            "title_similarity": "0.60234994",
            "sentiment_compound": 0.8009
        },
        {
            "id": "h5cl0be",
            "score": 1,
            "text": "The fact that this was acceptable prior to this is wild when taking factors like someone having something like borderline intellectual disorder into consideration",
            "title_similarity": "0.36100984",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h5cl0f0",
            "score": 1,
            "text": "Lying in the name of getting the truth is so on-brand for law enforcement.",
            "title_similarity": "0.5016501",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5clata",
            "score": 1,
            "text": "Wait, you mean to tell me that something like that was legal to begin with?\n\nAlso, since everyone else is saying it, always ask for a lawyer and shut up.",
            "title_similarity": "0.481572",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5clikp",
            "score": 2,
            "text": "Technically, that shouldn't even be a thing as although in the United States of America, minors don't actually have rights until you turn 18 you're a second-class citizen entirely reliant on your parent or guardian unless by some miracle you get yourself emancipated (hint hint, not happening), but with the lack of right, there comes a certain (not proportional, but nevertheless there) thing where You can't be interrogated or even officially asked questions by police (as in your answers put on record) unless it extenuating circumstances (you called 911 or were a certified witness at a crime) without BOTH at least one legal guardian AND your lawyer (whichever one your guardian gets). So this SHOULD be a non-issue, but then again, we have a minority of bad police that make it so that the majority of honest police can't do their jobs because the horrible ones muck up everything. MOST police are good, but the few that aren't, they're there, and they just don't stop.",
            "title_similarity": "0.6608269",
            "sentiment_compound": 0.5704
        },
        {
            "id": "h5clmis",
            "score": 1,
            "text": "Oh yeah that will stop them",
            "title_similarity": "0.1914295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cm7k1",
            "score": 1,
            "text": "Shouldn’t this be in r/nottheonion?",
            "title_similarity": "0.1343933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cmmea",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5cmrwu",
            "score": 4,
            "text": "Just a bit of advice. Police are not your friends. No matter if they lie to you or pretend to be your friend. The answer is ALWAYS…. “ i want my attorney, im not saying a word without my attorney present”",
            "title_similarity": "0.58713794",
            "sentiment_compound": 0.121
        },
        {
            "id": "h5cmt21",
            "score": 8,
            "text": "Today on “Why Was This Not Already A Thing”",
            "title_similarity": "0.21126592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cn35g",
            "score": 10,
            "text": "How about \"lying by any public official for any reason while acting in their official capacity is illegal\"?",
            "title_similarity": "0.6217927",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h5cn48n",
            "score": 1,
            "text": "Wait … what?",
            "title_similarity": "0.02397174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cnrk6",
            "score": 1,
            "text": "This is basically what happened to the Central Park 5 when they were interrogated.",
            "title_similarity": "0.5036497",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5cnw3z",
            "score": 2,
            "text": "All the new laws passed by Illinois after George Floyd protests had pro police all up in arms because now they can't lie to people during the course of duty.",
            "title_similarity": "0.61485696",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h5cnzjr",
            "score": 1,
            "text": "Lying by omission also?",
            "title_similarity": "0.28745508",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5co3jl",
            "score": 2,
            "text": "Minors are protected. Everyone else is still fucked.",
            "title_similarity": "0.41517967",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5co64x",
            "score": 1,
            "text": "not upset with that",
            "title_similarity": "0.06572988",
            "sentiment_compound": 0.2924
        },
        {
            "id": "h5coihv",
            "score": 2,
            "text": "Wait, what? only the first? SMH this headline is pretty depressing.",
            "title_similarity": "0.23964697",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h5corm8",
            "score": 2,
            "text": "It’s still going to happen but Ok",
            "title_similarity": "-0.050722077",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5cozya",
            "score": 1,
            "text": "/nottheonion",
            "title_similarity": "0.16325124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cp9mk",
            "score": 2,
            "text": "r/nottheonion",
            "title_similarity": "0.11714898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cpbiu",
            "score": 3,
            "text": "How about a federal law that police cannot question minors without a parent/guardian or lawyer present. \n\nI tell my kid if the police/security ever questions them to only give her name, my name and my phone number.",
            "title_similarity": "0.6794901",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5cpsrp",
            "score": 1,
            "text": "Why just for minors?",
            "title_similarity": "0.33034346",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cq0zm",
            "score": 1,
            "text": "You a cop?\n\n“That depends - how old are you?”\n\nWhat does that matter? \n\n“Just answer the question.”",
            "title_similarity": "0.419474",
            "sentiment_compound": 0.163
        },
        {
            "id": "h5cq2jl",
            "score": 2,
            "text": "Thank you! Also why can they lie to adults?",
            "title_similarity": "0.5095841",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h5cq5mt",
            "score": 2,
            "text": "Rule no. 1 when talking to the police: shut the fuck up. \n\nRule no. 2 — *see* R.1.",
            "title_similarity": "0.5887747",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5cqcmh",
            "score": 1,
            "text": "That’s good but something about this feels like it should be on awful everything",
            "title_similarity": "0.22160497",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h5cqk7o",
            "score": 2,
            "text": "the whole interrogation system needs to be redone. innocent people confess, cops lie about everything. the scary part is the justice system doesnt care who is innocent",
            "title_similarity": "0.5939318",
            "sentiment_compound": 0.3339
        },
        {
            "id": "h5cqmnq",
            "score": 2,
            "text": "I’m sorry what?",
            "title_similarity": "0.005686987",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5cqx2c",
            "score": 1,
            "text": "This was never considered at any point previously?\n\nWow. Just…wow.",
            "title_similarity": "0.2446848",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5cqze0",
            "score": 1,
            "text": "Excuse me what?",
            "title_similarity": "-0.013893448",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5cr4jn",
            "score": 2,
            "text": "Wait wtf they were allowed to lie?",
            "title_similarity": "0.36131787",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h5crfzc",
            "score": 2,
            "text": "The fact that it is 2021 and only now we are getting to this speaks to how much work there is left to do.",
            "title_similarity": "0.14078328",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5crjnu",
            "score": 2,
            "text": "r/NotTheOnion",
            "title_similarity": "0.11714898",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5crwgh",
            "score": 2,
            "text": "Dont talk to the police, deception and verbal tricks can lead the common man to accuse himself of committing mass genocide.",
            "title_similarity": "0.617332",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h5cs281",
            "score": 2,
            "text": "How about not lying to anyone?",
            "title_similarity": "0.34623054",
            "sentiment_compound": 0.4168
        },
        {
            "id": "h5csj2h",
            "score": 1,
            "text": "This is good",
            "title_similarity": "-0.12928936",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5csoo1",
            "score": 2,
            "text": "An innocent woman named Martha Puebla was murdered after cops made up that a woman named Martha Puebla identified a drug dealer during an interrogation (no such woman existed). Then an innocent man was arrested for her murder. He was only found to be innocent because he happened to be at a baseball game with his daughter where they were filming curb your enthusiasm. If they were not filming not only would that cops lie be responsible for an innocent girl’s murder but an innocent man being in jail for it.",
            "title_similarity": "0.612382",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h5csz3t",
            "score": 2,
            "text": "Oh,that will go over well with the police union...",
            "title_similarity": "0.31111866",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5ct5r8",
            "score": 3,
            "text": "No matter how innocent you are, ALWAYS use your right to a lawyer.  Police can do some 'shady' things.  One of the biggest ones is 'tape the interview'.  They have no legal requirement to keep the tape when you are done.  They can just toss the tape and write up the report 'as they recall it'.",
            "title_similarity": "0.5493187",
            "sentiment_compound": 0.2396
        },
        {
            "id": "h5ctj1x",
            "score": 1,
            "text": "This was legal????",
            "title_similarity": "0.065093234",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h5ctw83",
            "score": 1,
            "text": "Fucking what",
            "title_similarity": "0.060680993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cu1hk",
            "score": 2,
            "text": "One anti black law down.",
            "title_similarity": "0.44132054",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5cu2bu",
            "score": 1,
            "text": "If it’s illegal to lie to police, it should be illegal for police to lie to the public.",
            "title_similarity": "0.6461302",
            "sentiment_compound": -0.802
        },
        {
            "id": "h5cu69z",
            "score": 1,
            "text": "Wow thought that was already a law, even though it was never followed in my day!",
            "title_similarity": "0.4388183",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h5cu6t6",
            "score": 2,
            "text": "Won’t work without mandatory recording when dealing with minors.",
            "title_similarity": "0.43709636",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h5cusrq",
            "score": 1,
            "text": "SMFH. Why is this even a thing? So you can lie to a child and then hold them accountable for whatever comes out of the situation? Our policing is as corrupt as our politics.",
            "title_similarity": "0.6072655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cutce",
            "score": 2,
            "text": "From Illiinois here.\n\nThe commentary on the FB groups of local areas is unsettling.\n\nThat is all.",
            "title_similarity": "0.27736878",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cuvlf",
            "score": 1,
            "text": "It will be better if you are honest. Nope... never talk to the police.",
            "title_similarity": "0.530577",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h5cv3l2",
            "score": 1,
            "text": "I can’t believe this is something that had to be banned. How incredibly sad",
            "title_similarity": "0.314952",
            "sentiment_compound": -0.7501
        },
        {
            "id": "h5cv5cx",
            "score": 1,
            "text": "But… wait… what… this was legal???",
            "title_similarity": "0.16657922",
            "sentiment_compound": 0.2593
        },
        {
            "id": "h5cvltf",
            "score": 1,
            "text": "They shouldn’t lie to begin with.\n\n“Yeah your buddy sold you out for a 8 piece 🍗 “",
            "title_similarity": "0.36261824",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cvyoz",
            "score": 2,
            "text": "Wait a minute….minors?",
            "title_similarity": "0.2631334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cwe20",
            "score": 1,
            "text": "I really thought this was an r/TheOnion.",
            "title_similarity": "0.119150475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cx0yj",
            "score": 1,
            "text": "Bruh.",
            "title_similarity": "-0.042609572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cxclg",
            "score": 1,
            "text": "All that’s going to do is now make criminals turn to children because guess what if a cop can’t lie to a child then it’s gonna be really easy for a child to lie to a cop",
            "title_similarity": "0.66039944",
            "sentiment_compound": -0.1298
        },
        {
            "id": "h5cxjfp",
            "score": 2,
            "text": "Oh, I'm glad the rest of us are still legally ok to be lied to by public servants",
            "title_similarity": "0.4466291",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5cxwko",
            "score": 2,
            "text": "Oh I’m sure there was a certain demographic (guess) of minors specifically targeted for entrapment",
            "title_similarity": "0.4134006",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5cy0gs",
            "score": 1,
            "text": "The fact that this needs to be a law in the first place, speaks volumes.",
            "title_similarity": "0.28136158",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cy8zx",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.14690737"
        },
        {
            "id": "h5cycg9",
            "score": 2,
            "text": "Police shouldn’t be lying in the first place in any state",
            "title_similarity": "0.6213029",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5cyek4",
            "score": 2,
            "text": "Should have been everyone",
            "title_similarity": "0.054879196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5cyfv1",
            "score": 1,
            "text": "The fact that every other cop is not ban from this shore says a lot.",
            "title_similarity": "0.31228292",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h5cypa6",
            "score": 3,
            "text": "In Other News: A Utah police officer arrested and charged a woman with a hate crime because she stepped on, and then threw a \"thin blue line\" yard sign - that was in the trunk of her friends car - in the trash.",
            "title_similarity": "0.59994465",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h5cyxut",
            "score": 3,
            "text": "Good luck proving when officers lied during an interrogation. What percentage of body cams (in the few places they’re required) magically malfunction whenever there’s a questionable shooting? The lack of accountability when officers literally have authority over life and death decisions is abjectly horrifying.",
            "title_similarity": "0.580359",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h5cyz5j",
            "score": 1,
            "text": "I’m going to go out on a bitter limb and wager this little ban will change effectively nothing",
            "title_similarity": "0.38433635",
            "sentiment_compound": -0.4951
        },
        {
            "id": "h5cz1ie",
            "score": 1,
            "text": "Lol bout time",
            "title_similarity": "-0.0366946",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5cz2d7",
            "score": 2,
            "text": "What is this? A law that actually holds the LAW accountable? No way! \n\n“It’s the end of the world as we know it”",
            "title_similarity": "0.495719",
            "sentiment_compound": -0.4314
        },
        {
            "id": "h5czd0u",
            "score": 3,
            "text": "Up next they’re going to make it illegal for cops to plant evidence on people .",
            "title_similarity": "0.7351731",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5czebg",
            "score": 1,
            "text": "Question: how does one enforce this new law?",
            "title_similarity": "0.3701768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5czlw6",
            "score": 2,
            "text": "Isn’t it funny (in a sad pathetic way) that a law is needed to keep cops from lying to children?",
            "title_similarity": "0.6290976",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h5d03l0",
            "score": 1,
            "text": "\"Leaked\" from the Kremlin.",
            "title_similarity": "0.2802388",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5d04lc",
            "score": 3,
            "text": "So you are telling me until now police could lie to minors everywhere? 😱",
            "title_similarity": "0.65874064",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5d0h93",
            "score": 1,
            "text": "But will they enforce it?",
            "title_similarity": "0.14191309",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5d0nie",
            "score": 1,
            "text": "First!?",
            "title_similarity": "-0.0184657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5d0txc",
            "score": 4,
            "text": "They can still lie to everyone else though, and will. But lie to them, and it’s a crime! Ain’t that neat?",
            "title_similarity": "0.49983996",
            "sentiment_compound": -0.2598
        },
        {
            "id": "h5d11wh",
            "score": 1,
            "text": "4 years from now, like big permed hair.",
            "title_similarity": "0.08647628",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5d1mzx",
            "score": 1,
            "text": "Wait what the fuck? First Jesus, then Santa, tooth fairy and Easter bunny... does authority every truth?",
            "title_similarity": "0.31669703",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h5d1osd",
            "score": 2,
            "text": "Glad to see Illinois will do everything except do better for education.\n\nTeach students their rights and nail it in their heads.",
            "title_similarity": "0.49518806",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5d1r9i",
            "score": 4,
            "text": "Police have been falsifying official forms for years. I hope this law has bigger balls than the purgatory laws do.",
            "title_similarity": "0.46912825",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5d224k",
            "score": 2,
            "text": "It is utterly shocking how little accountability there is four how much power a cop holds.",
            "title_similarity": "0.43660897",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h5d29gs",
            "score": 2,
            "text": "Yay! Illinois finally makes the news for something good!",
            "title_similarity": "0.29212326",
            "sentiment_compound": 0.7835
        },
        {
            "id": "h5d2ufe",
            "score": 3,
            "text": "Why just minors, you shouldn't lie to anyone, wtf...  Corruption at its finest.",
            "title_similarity": "0.54243934",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h5d3d3x",
            "score": 3,
            "text": "Why are our servants lying to us in the first place? 🤔",
            "title_similarity": "0.41044372",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5d4b7i",
            "score": 3,
            "text": "Police shouldn’t be able to lie to anyone, especially unaccompanied minors who should have their parents present before questioning any how.",
            "title_similarity": "0.65776366",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5d4bov",
            "score": 2,
            "text": "The first. FFS. Murkah.’",
            "title_similarity": "0.06703872",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h5d5dsc",
            "score": 1,
            "text": "Oh well cool. That will definitely stop the police from lying to minors during interrogations",
            "title_similarity": "0.6767107",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5d5qps",
            "score": 1,
            "text": "What? Why was that legal in the first place?",
            "title_similarity": "0.27219522",
            "sentiment_compound": 0.2168
        },
        {
            "id": "h5d6ftc",
            "score": 2,
            "text": "Blackstone's ratio: It is better that ten guilty persons escape than that one innocent suffer.\n\nI think this article reflects that belief. My follow up: why is it lefal for police to lie ever?",
            "title_similarity": "0.53924584",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5d6gq0",
            "score": 3,
            "text": "Teach your kids to give cops only *very* basic info if questioned. Name, date of birth, address, parents names and phone numbers. That's all. \n\nI practice it with my teenagers. I run through the stupid shit a cop might say and have them respond with \"I need an attorney. Please contact my parents.\"",
            "title_similarity": "0.6038239",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h5d7agm",
            "score": 4,
            "text": "Teach the young to lawyer up. No one should talk to the police period.",
            "title_similarity": "0.6927608",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5d7l5v",
            "score": 1,
            "text": "But have they banned minors from lying to Police?",
            "title_similarity": "0.70261115",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h5d8ehf",
            "score": 3,
            "text": "Things you thought were already illegal :(",
            "title_similarity": "0.41367772",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h5d8kle",
            "score": 1,
            "text": "Jesus I didn't even think of that",
            "title_similarity": "0.22451717",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5d8ocr",
            "score": 3,
            "text": "If you're innocent, cops are your enemy. If you're guilty, cops are your enemy. Do not talk to cops. You want your lawyer.",
            "title_similarity": "0.61971974",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h5d8she",
            "score": 5,
            "text": "They shouldn’t lie full stop.",
            "title_similarity": "0.27303338",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5d96nj",
            "score": 3,
            "text": "that never has stopped them in the first place.",
            "title_similarity": "0.12023409",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h5d9be6",
            "score": 1,
            "text": "Oh cool! I live there",
            "title_similarity": "-0.08794326",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h5d9c2s",
            "score": 2,
            "text": "So, are they going to close down the chicago police black site where they torture people, too?",
            "title_similarity": "0.6126429",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h5daggy",
            "score": 5,
            "text": "I remember legal advice is to never talk to police in regards to a crime you are being accused of committing. No one has ever been found innocent from a police interview, but many have been wrongly found guilty from them",
            "title_similarity": "0.6574918",
            "sentiment_compound": -0.7227
        },
        {
            "id": "h5dakxo",
            "score": 2,
            "text": "Why the fuck can they in every other state?!",
            "title_similarity": "0.3107889",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h5danwb",
            "score": 4,
            "text": "I knew the police could lie to suspects. I guess it never occurred to me they could do it to minors.\n\nThis is overdue.",
            "title_similarity": "0.6833075",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5dao6t",
            "score": 4,
            "text": "“49 states allow police to lie, including to minors”",
            "title_similarity": "0.67656577",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5dbf8e",
            "score": 1,
            "text": "suspect: Excuse me, before we begin this interrogation I need to state that I am a minor (17).  \nofficer: so?  \nsuspect: are you a police officer?  \nofficer: ...shut up.  \nsuspect: no need to be rude but i'm going to take your nonanswer as an omission.  \nsuspect: do you like fishsticks?  ...",
            "title_similarity": "0.6229944",
            "sentiment_compound": -0.6531
        },
        {
            "id": "h5dc0t8",
            "score": 2,
            "text": "This was legal??!?",
            "title_similarity": "0.053091813",
            "sentiment_compound": 0.3252
        },
        {
            "id": "h5dchyz",
            "score": 5,
            "text": "This is a very slippery slope! \n\nToday it’s “No lying to minors during interrogation”. \n\nTomorrow it’s “No lying in court”. \n\nBefore you know it it’s going to be “No kneeling on people’s necks and killing them in the streets”!!!\n\nI’m telling you, it’ll all end in tears!!!",
            "title_similarity": "0.605132",
            "sentiment_compound": -0.9357
        },
        {
            "id": "h5ddqw1",
            "score": 2,
            "text": "“First state” \nmeaning ALL of the others are free to entrap by lying.",
            "title_similarity": "0.4696651",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h5ddvg7",
            "score": 1,
            "text": "Wait does this mean they can lie to majors during interrogations....?",
            "title_similarity": "0.47230673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5de15x",
            "score": 3,
            "text": "Yea. That’ll stop them.",
            "title_similarity": "0.2356307",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5deqr9",
            "score": 2,
            "text": "The police:  be truthful and honest and you can join us.\n\nAlso the police: now that you are the police you may lie.",
            "title_similarity": "0.52754855",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h5detmp",
            "score": 2,
            "text": "Wgich means its not illegal in 49 other states, right? And here I thought I couldn't hate how evil our justice system is any more than I already did.",
            "title_similarity": "0.5334657",
            "sentiment_compound": 0.9159
        },
        {
            "id": "h5deu1q",
            "score": 2,
            "text": "And I’m sure the police will omit that information.",
            "title_similarity": "0.46447277",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5df36e",
            "score": 3,
            "text": "How was it legal for them to ask a minor anything without their guardian present anyway?",
            "title_similarity": "0.52759624",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5df5tg",
            "score": 2,
            "text": "Cops don't need to k ow the laws to do their job. What's this going to do if they can claim that they're ignorant of the laws and \"mistaken\" their intention?",
            "title_similarity": "0.64715725",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5df9up",
            "score": 4,
            "text": "Doesnt matter if its banned; if it's not criminalized and actively prosecuted, it just becomes one more thing the defendant has to prove happened, while all the cops and police paperwork claims it remained \"by the books\".",
            "title_similarity": "0.58438647",
            "sentiment_compound": -0.7674
        },
        {
            "id": "h5dfg0d",
            "score": 1,
            "text": "Just a reminder that Brendan Dassey is innocent. Good to see Laura Nirider making progress",
            "title_similarity": "0.22833586",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h5dfn2j",
            "score": 2,
            "text": "how tf was it not already illegal",
            "title_similarity": "0.3083352",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h5dfrp5",
            "score": 1,
            "text": "Big W",
            "title_similarity": "-0.08433892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5dgoly",
            "score": 3,
            "text": "The idea that American police can lie to suspects during interrogation at all is stupid and is why there are so many false admitments",
            "title_similarity": "0.573089",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5dgs7b",
            "score": 2,
            "text": "The police shouldn’t be allowed to lie to ANYONE during interrogation",
            "title_similarity": "0.6000672",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5dhgn7",
            "score": 1,
            "text": "London taxi cab drivers need to know how to drive around London , it's called \"the knowledge\" .\nHow about all of these fucks(the dumb cunting troopers) learn the rules dictating their behaviour before they can be released upon the public . I mean all of the laws and dictates..... No more fucken excuses , period . They're just a gang like a bunch of bikies , hiding behind a fucken badge and gun .",
            "title_similarity": "0.57955927",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5di1in",
            "score": 4,
            "text": "How the fuck is it legal for the police to lie to anyone?!",
            "title_similarity": "0.59355927",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h5dihp0",
            "score": 3,
            "text": "Most other western democracies banned those interrogation tactics on adults years ago",
            "title_similarity": "0.58776265",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h5dip88",
            "score": 1,
            "text": "What that was legal in the first place wtf is wrong with the police",
            "title_similarity": "0.5447427",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h5dj0sa",
            "score": 1,
            "text": "This week in \"How is this a thing?\"",
            "title_similarity": "0.11788769",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5dj7bz",
            "score": 1,
            "text": "This reminds me of the Chris Rock bit like \"hey I look after my kids.... Ive never been to jail!\"",
            "title_similarity": "0.45444828",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h5dkbby",
            "score": 2,
            "text": "Why just minors… as an attorney I guarantee this pisses off the cops. Crazy how they can lie to you period especially when you haven’t been charged with a crime",
            "title_similarity": "0.6372928",
            "sentiment_compound": -0.8151
        },
        {
            "id": "h5dkoky",
            "score": 2,
            "text": "So they can still lie to majors?",
            "title_similarity": "0.38721073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5dky4r",
            "score": 2,
            "text": "It should be illegal for cops to interrogate minors without a lawyer present. And those lawyers should be specialized in assisting minors.",
            "title_similarity": "0.6911604",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5dl4pa",
            "score": 2,
            "text": "Yet another reason why America is not the land of the free. \n\nOf all the people who should uphold the truth your Police don't have to do it. \n\nIn the UK it would potentially put a trial at risk of collapse if it was found out the police had lied during an interview.",
            "title_similarity": "0.6437693",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5dlb11",
            "score": 3,
            "text": "Absolutely insane how far behind the us is",
            "title_similarity": "0.18289334",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h5dlrqn",
            "score": 1,
            "text": "Hold on, sorry, what do you mean, first?",
            "title_similarity": "0.06576595",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5dn59a",
            "score": 2,
            "text": "oh good they banned it, it'll stop",
            "title_similarity": "0.38825",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5dnvk8",
            "score": 1,
            "text": "A Far Cry From The GOP Guy That Got Getting Convicted For Trying To Sell Obama's Seat... That Crook In Chief Pardoned...So The Anti-Americans Freak Can Do More Damage, Likely...",
            "title_similarity": "0.5907213",
            "sentiment_compound": -0.8588
        },
        {
            "id": "h5dojce",
            "score": 2,
            "text": "TIL one more reason to mistrust police.",
            "title_similarity": "0.4356082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5doylk",
            "score": 1,
            "text": "Yet another reason to never ever trust the police.",
            "title_similarity": "0.46066964",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h5dp91k",
            "score": 1,
            "text": "How did I know he was 13? I didn't check his ID, and if I did I didn't do the math, and if I did I'm a cop fuck you.",
            "title_similarity": "0.60095006",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5dpoyo",
            "score": 1,
            "text": "How about banning them from lying to the rest of us while you are at it?",
            "title_similarity": "0.5633809",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5dpvht",
            "score": 1,
            "text": "Like it's going to stop them.",
            "title_similarity": "0.24923486",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h5dvkiz",
            "score": 2,
            "text": "I mean honestly, lying is an underhanded tactic, but lying to a minor is pretty underhanded. Besides, honestly most of the things minors are involved aren’t big things like murder or other terrible crimes.",
            "title_similarity": "0.51307046",
            "sentiment_compound": -0.714
        },
        {
            "id": "h5dwoul",
            "score": 2,
            "text": "Good. Now become the first state to not interrogate minors without their parent or attorney in the room.",
            "title_similarity": "0.69656694",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5dynp0",
            "score": 1,
            "text": "Chicago is like the wild west 20 plus people shot and some killed weekly. I don't think this is the state of Illinois biggest concern.",
            "title_similarity": "0.53219914",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h5dzjru",
            "score": 1,
            "text": ">Any confession made under those circumstances will be inadmissible in court unless prosecutors can prove “by a preponderance of the evidence that the confession was voluntarily given.”\n\nWell there's a loophole that certainly won't be abused.",
            "title_similarity": "0.57937473",
            "sentiment_compound": 0.7353
        },
        {
            "id": "h5dzp2h",
            "score": 1,
            "text": "They shouldn’t be lying in the first place",
            "title_similarity": "0.30854046",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5dzzhj",
            "score": 1,
            "text": "What about police blacksites? Fuck the Chicago PD.",
            "title_similarity": "0.598688",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5e0m9x",
            "score": 1,
            "text": "It's weird that that's not already a law",
            "title_similarity": "0.22524923",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h5e3j6j",
            "score": 1,
            "text": "I have no doubt that they will drive tractor trailers through the loopholes.",
            "title_similarity": "0.34644252",
            "sentiment_compound": 0.2755
        },
        {
            "id": "h5e4im8",
            "score": 1,
            "text": "That is all cops do is lie and lie for each other",
            "title_similarity": "0.4852411",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5e6mw9",
            "score": 1,
            "text": "LOL doesn’t matter the laws we put on cops, they’ll just break them like they always do.",
            "title_similarity": "0.6031985",
            "sentiment_compound": 0.7297
        },
        {
            "id": "h5e7zo1",
            "score": 1,
            "text": "It’s sad this needed to be made a law, the people who are here solely to protect us have to be reminded and told not to lie, damn",
            "title_similarity": "0.43552434",
            "sentiment_compound": 0.1921
        },
        {
            "id": "h5eb8wh",
            "score": 1,
            "text": "As a purely ethical concern (not to mention a Constitutional one) it seems contradictory to lie in the pursuit of the truth. \n\nThough I am not sure ***the truth*** is the goal in these cases.",
            "title_similarity": "0.36614037",
            "sentiment_compound": 0.1454
        },
        {
            "id": "h5ebl36",
            "score": 1,
            "text": "Considering lying persecution is how Cosby got out of jail, cops are doing worse with lying to anyone. It’s sabotaging the very justice they are supposed to be serving. Had they just shut the fuck up on their faulty promises, they could find enough to press charges without a stupid deal like they made that was their entire undoing.",
            "title_similarity": "0.6262586",
            "sentiment_compound": -0.7376
        },
        {
            "id": "h5ecqjp",
            "score": 1,
            "text": "Or lying to any member of the public while in the commission of their duties.",
            "title_similarity": "0.48401573",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5ed2o9",
            "score": 1,
            "text": "It is amazing that we need a law to prevent police from lying to minors while they’re being interrogated.  They usually don’t know their rights.",
            "title_similarity": "0.6314153",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5eg9ka",
            "score": 2,
            "text": "Don’t talk to cops EVER.  They are not your friends",
            "title_similarity": "0.50748324",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h5ehg7m",
            "score": 1,
            "text": "So can u sue if u were forced into a false confession years ago",
            "title_similarity": "0.46873328",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h5ehwo4",
            "score": 1,
            "text": "They had to make that illegal? WTF?",
            "title_similarity": "0.47188202",
            "sentiment_compound": -0.8588
        },
        {
            "id": "h5ei682",
            "score": 1,
            "text": "The world’s on fire and civilization as we know it is going to collapse in our life time and the only thing standing between the People and the organizations causing this are 1312.",
            "title_similarity": "0.42247835",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5ek5p4",
            "score": 2,
            "text": "Just for minors? It shouldn’t be legal for cops to lie to anyone.",
            "title_similarity": "0.6260189",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5el53f",
            "score": 1,
            "text": "Wait, so it wasn’t illegal before???",
            "title_similarity": "0.26415873",
            "sentiment_compound": -0.6601
        },
        {
            "id": "h5enfvk",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.13369349",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5eovri",
            "score": 1,
            "text": "Not lying to kids is not always about getting confession. This whole thing about cops being required to be brutally frank, honest and forthcoming with young people, is simply smoke and mirrors on the part(s) of some political leaders. It is an effort to hide the real truth about crime in America. It is an attempt by legislators to somehow insert a kind of logic (reason) behind the homicide rates in some of our inner cities. The current homicide rates in Chicago, for example, far exceed the very recent KIA rate(s) in Iraq and Afghanistan. I know that when I returned home from both theatres of operation (Afghanistan, Iraq), I actually felt safer in Iraq and Afghanistan, than I did walking the streets of Oakland, Calif.",
            "title_similarity": "0.6623672",
            "sentiment_compound": -0.6411
        },
        {
            "id": "h5epj5f",
            "score": 1,
            "text": "Wow.. Police should be banned from lying to anyone. WTF.  But yeah, to lying to vulnerable individuals like minors is unethical, immoral and just plain shady.",
            "title_similarity": "0.65082735",
            "sentiment_compound": -0.9315
        },
        {
            "id": "h5eru1k",
            "score": 1,
            "text": "I think we are moving into an era where before long arrests will also be prohibited unless you are firearms owner.",
            "title_similarity": "0.5563517",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5etgtd",
            "score": 1,
            "text": "how is it that police lying to people was legal in the first place? isnt lying supposed to be the very opposite of what the legal system is meant to stand for?\n\nyou go to court and are sworn to be honest, but authorities have just been able to lie the whole time. seems a very messed up system in need of from the ground up replacement.",
            "title_similarity": "0.6480142",
            "sentiment_compound": -0.3739
        },
        {
            "id": "h5f0sxs",
            "score": 1,
            "text": "This actually has to be written. Welcome to that land of the free where police actively look to jail you with lies.",
            "title_similarity": "0.5456697",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h5f13f0",
            "score": 1,
            "text": "Please, everyone, please listen to this...\n\"Don't Talk to the Police. \"\n\nhttps://youtu.be/d-7o9xYp7eE",
            "title_similarity": "0.5103672",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5f2at2",
            "score": 1,
            "text": "Why does this need to be a law?",
            "title_similarity": "0.312354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5f30ov",
            "score": 1,
            "text": "Feeling more proud of my state than perhaps I ever have. Pritzker's leadership is really helping improve things here.",
            "title_similarity": "0.15135384",
            "sentiment_compound": 0.8613
        },
        {
            "id": "h5f4ox9",
            "score": 1,
            "text": "Rant incoming, loosely related. \n\nAmerica’s justice system and war on drugs are the two biggest reasons I can’t take republicans seriously at all anymore. They cheered the cops on as entrapment laws were changed and the cops were allowed to lie to our faces in attempts to trick us into letting them destroy our lives. These masks are too much!?!? You’ve supported the cops raiding elderly homes for tomato plants because it MIGHT be weed. I really want schools to start telling kids their parents are evil for being anti vax. Can you imagine how corrupt it would be for the state to start trying to turn children against their parents over a personal choice?!?!? Sorry Timmy you’re parents are a threat to society because they won’t vaccinate and could spread a disease to everyone/ sorry Timmy your parents choose to smoke a plant that the government doesn’t like so we’re gonna trick you into getting them arrested. This personal freedom argument from them is disgusting. I’ve seen how you treat people that make choices you disagree with. Wanna add abortion to this?! None of your damn business but for some reason you gotta have a fuckin opinion right?! Your fucking hypocrisy is so rank it’s destroying America. You reap the fruits you sow. The rest of us will watch videos of you crying about losing your jobs, being denied activities and reading your obituaries. I hope one day you can be piss tested for the vaccine and denied employment if you don’t have it.",
            "title_similarity": "0.59927815",
            "sentiment_compound": -0.9822
        },
        {
            "id": "h5fa3cx",
            "score": 1,
            "text": "What about the lying minors??",
            "title_similarity": "0.41245428",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h5fdq7m",
            "score": 1,
            "text": "Haha",
            "title_similarity": "-0.10973528",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5fj6t3",
            "score": 1,
            "text": "next we should ban undercover cops and disarm them, criminals for the win wooohoooo",
            "title_similarity": "0.6213465",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5flrqi",
            "score": 2,
            "text": "Imagine having to pass a law to make law enforcement tell the truth.  Oh wait...",
            "title_similarity": "0.5401155",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5foz8n",
            "score": 1,
            "text": "Does it include minors lying to police during interrogations?",
            "title_similarity": "0.56323886",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5fxq6r",
            "score": 1,
            "text": "Lol, ffs, idiocracy defined.",
            "title_similarity": "0.24241495",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5g8wf3",
            "score": 1,
            "text": "These anti-cop comments on this forum are making me wonder why I'm progressive. I saw a lot of violence recently. Both last summer and on Jan 6. The cops put themselves in danger protecting people and businesses from being attacked, looted, robbed and raped. For the commenters who hate cops so much: How about the hundreds of cops killed in the line of duty every year?    How about their friends and families. Many cops got killed trying to protect their communities. I'm not one of \"those cops are always right\" people, but come on!!",
            "title_similarity": "0.57388496",
            "sentiment_compound": -0.9207
        },
        {
            "id": "h5gpleb",
            "score": 2,
            "text": "Police shouldn't be able to lie to anyone.  It is impossible to teach my child to trust police that they have his best interests at heart and they are there for his protection, because you can not trust police they are less concerned with facts then with making an arrest Which will lead to a prosecution weather the person they arrested is guilty or not i",
            "title_similarity": "0.6287738",
            "sentiment_compound": 0.1275
        },
        {
            "id": "h5i83cb",
            "score": 1,
            "text": "How about reducing to omission only for adults? I don't think investigators should lie, this traps you and could make you plea based on false information only.\n\nNow, not telling someone everything keeps a liar perp in check, necessary.",
            "title_similarity": "0.6227523",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5j97o4",
            "score": 1,
            "text": "This is a thing they had to make a law about. This is a basic human decency you would expect of people tasked with upholding the law and social values. And we had to make a law requiring it.",
            "title_similarity": "0.34844568",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5kxrpm",
            "score": 1,
            "text": "I kinda feel like police shouldn't be able to lie a all...but ok",
            "title_similarity": "0.48878145",
            "sentiment_compound": 0.5302
        },
        {
            "id": "h5l0q8d",
            "score": 1,
            "text": "I can’t believe they have to BAN this! I know cops will do anything to get what they want, but this still shocks me.",
            "title_similarity": "0.40359816",
            "sentiment_compound": -0.7358
        },
        {
            "id": "h5ljjl8",
            "score": 1,
            "text": "I'm not shocked but disgusted with the fact police can beat up intimidate and lie to minors all in the name of an interrogation",
            "title_similarity": "0.59068",
            "sentiment_compound": 0.4488
        },
        {
            "id": "h5me9my",
            "score": 1,
            "text": "Just don't say ANYTHING, and if you really need to, just cross your arms and say \"*lawyer*\" over and over",
            "title_similarity": "0.43192264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5n1ge0",
            "score": 1,
            "text": "Can you believe at one point they were basically trained to use this as a tactic in order to do their job?  Protect & Serve “at all costs” lmao",
            "title_similarity": "0.28897607",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h5p3661",
            "score": 1,
            "text": "Doesn't lying equal entrapment? If so, isn't that wrong, period?",
            "title_similarity": "0.3185869",
            "sentiment_compound": 0.6898
        },
        {
            "id": "h5qwkwn",
            "score": 1,
            "text": "I iu tu uu888>88,88. 76-⁷7",
            "title_similarity": "0.094022825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5y3yo7",
            "score": 1,
            "text": "Holy crap, so police are otherwise allowed to just lie to minors?! They shouldn't be allowed to lie to anyone much less an individual who isn't even technically responsible for themselves.",
            "title_similarity": "0.6576911",
            "sentiment_compound": -0.5932
        },
        {
            "id": "h5yc8wj",
            "score": 1,
            "text": "First? This should have been the default position, fuck I hate cops.",
            "title_similarity": "0.52542716",
            "sentiment_compound": -0.802
        },
        {
            "id": "h5yhvif",
            "score": 1,
            "text": "Wow 2021 and CPD finally adhears to constitutional rights FUCPD as a native fuck off Chicago police department solve some fucking crimes",
            "title_similarity": "0.6607064",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5yhwt4",
            "score": 1,
            "text": "Central Park Five 🙏🏾✊🏾",
            "title_similarity": "0.087329224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5yupqv",
            "score": 1,
            "text": "Lying to whites okay? Good!",
            "title_similarity": "0.29831374",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h5zu3xy",
            "score": 1,
            "text": "so, besides instructing my students on how to act when they get pulled over - key out of the ignition; hands on the top of the steering wheel; yes, sir and no, sir - and what to say - am I being arrested; am I free to go - and that they have the legal right when being pulled over to pull over in a place that is public and well-lit,go slow with flashers on, and that if they are arrested they are never to admit to anything, just keep asking for their parent(s) or their lawyer -  I should remind them that they need to remember that the police can legally lie to them.  How are we ever to remember all these rules in a free society?",
            "title_similarity": "0.6047567",
            "sentiment_compound": 0.6379
        },
        {
            "id": "h632sl9",
            "score": 1,
            "text": "What about adults?",
            "title_similarity": "0.12710175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ubtj2",
            "score": 1,
            "text": "wait, wut?",
            "title_similarity": "0.028329318",
            "sentiment_compound": 0.0
        }
    ]
}