{
    "Capitol police ordered to arrest Congress lawmakers, staff and visitors who refuse mask mandate\n": [
        {
            "id": "h6z0gg4",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.5305267",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h6zm44s",
            "score": -3,
            "text": "Man, y'alls dicks are getting really hard over the idea of arresting people for not wearing a mask. That's not a worrisome sign at all, nope not at all lol.",
            "title_similarity": "0.58395153",
            "sentiment_compound": -0.1943
        },
        {
            "id": "h6zn31u",
            "score": -14,
            "text": "What's the rationale behind vaccinated people wearing masks?\n\nThere's an abundance of vaccine. If people don't want it, then let them get covid.\n\nI'm not masking up because morons don't want the shot.",
            "title_similarity": "0.45496917",
            "sentiment_compound": -0.4106
        },
        {
            "id": "h6z1in6",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zezl3",
            "score": -7,
            "text": "Biden has been out hugging random people without wearing a mask. Maybe he should be arrested lmao.",
            "title_similarity": "0.5788622",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6zgg05",
            "score": -1,
            "text": "Christ I wish our politicians have a shit about governing rather than fucking culture wars.",
            "title_similarity": "0.45814127",
            "sentiment_compound": -0.6983
        },
        {
            "id": "h6z1cir",
            "score": -5,
            "text": "Love this. This is the kind of 'fuck you' to anti-mask GOP agitators I've been waiting for.",
            "title_similarity": "0.42533946",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h6z1ddp",
            "score": 5,
            "text": "This is just noise to distract from gerrymandering and voter suppression going on.",
            "title_similarity": "0.5399369",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6z67pn",
            "score": 32,
            "text": "i'm as left wing as you can get but this will not end well",
            "title_similarity": "0.22343221",
            "sentiment_compound": -0.3007
        },
        {
            "id": "h6zgfy8",
            "score": 11,
            "text": "But they are vaccinated. No?",
            "title_similarity": "0.17934234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zenhj",
            "score": -8,
            "text": "  \n\"As nightfall does not come all at once, neither does  \noppression. In both instances, there is a twilight when everything  \nremains seemingly unchanged. And it is in such twilight that we all  \nmust be most aware of change in the air - however slight - lest  \nwe become unwitting victims of the darkness.\"  \n \\-Justice William O. Douglas",
            "title_similarity": "0.3881547",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6zuurs",
            "score": 1,
            "text": "Fuck the police.",
            "title_similarity": "0.52796316",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6z9zdm",
            "score": 14,
            "text": "Question, is this one of those things leading into the whole “slippery slope” thing?",
            "title_similarity": "0.20860605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zklcr",
            "score": -6,
            "text": "This is payback from the Capitol Police for the GQP’s shitty responses to the 1/6 insurrection and their refusal to support a congressional commission to determine who (I mean the GQP) incited the violence that occurred.",
            "title_similarity": "0.7646065",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h6zgx4h",
            "score": 8,
            "text": "That website is worse than covid.",
            "title_similarity": "0.3628354",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70p3j3",
            "score": 3,
            "text": "If the Democrats push for lockdowns again they might as well kiss the 2022 midterms goodbye.",
            "title_similarity": "0.4379429",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6zxjv1",
            "score": -3,
            "text": "I thought Biden wasn’t an authoritarian. What about the democrats who didn’t wear masks when they were leaving Texas? Didn’t Biden say you don’t need to wear a mask anymore?",
            "title_similarity": "0.40775675",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zgvow",
            "score": -11,
            "text": "Are the hair salons still open?",
            "title_similarity": "0.19639324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zx04w",
            "score": 11,
            "text": "That is an absolutely terrible idea. It's almost August 2021. Anti maskers have been wrong for so long that they circled back around to being right.\n\nArrest a single vaccinated person for not wearing a mask and goodbye 2022.\n\nDemocrats never pass up an opportunity to shoot themselves in the foot.",
            "title_similarity": "0.59015197",
            "sentiment_compound": -0.8601
        },
        {
            "id": "h6zwz79",
            "score": 18,
            "text": "the amount of people cheering this on is psychotic even for this sub",
            "title_similarity": "0.4520393",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h6zropt",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zbc4n",
            "score": -8,
            "text": "Funny thing is the code they cite mentions nothing about wearing masks.",
            "title_similarity": "0.31302488",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zvfij",
            "score": 2,
            "text": "Awesome. A militarized police force arresting elected representatives. The US is finally starting to learn how to run a government.",
            "title_similarity": "0.6860541",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h6z4vaf",
            "score": 6,
            "text": ">Capitol police chief Thomas Manger ordered officers to report any members of Congress who refuse to wear a mask, warning they would be subject to arrest for unlawful entry under DC Code 22-3302.\n\nHuh.  \n\nPay attention to that detail Conservatives, especially [Andrew Clyde](https://nymag.com/intelligencer/2021/07/gop-rep-stands-by-comparison-of-jan-6-to-tourist-visit.html) who said:\n\n“So, I’m sorry if you didn’t understand that or if you didn’t maybe get that information, but I am not going to vote to give **Speaker Pelosi a gold medal because she is the one who is in charge of the Capitol Police** and the sergeant at arms. She is responsible,” he added, **echoing the current Republican stance of laying the blame for the Capitol riot on Nancy Pelosi**.",
            "title_similarity": "0.82953817",
            "sentiment_compound": -0.802
        },
        {
            "id": "h6zwbvv",
            "score": 3,
            "text": "Authoritarian much? Now masks are a breach of freedom. Considering the bumpkins in office and their followers in congress... America is doomed.",
            "title_similarity": "0.652662",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71fp0o",
            "score": 0,
            "text": "Interesting how they will arrest you for no mask but not for rioting and destruction of property.",
            "title_similarity": "0.62205935",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h72hx5r",
            "score": 0,
            "text": "Just say you're there to storm the capital, and they'll start crying.",
            "title_similarity": "0.68868285",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h719lon",
            "score": -1,
            "text": "Arrest Nancy Pelosi",
            "title_similarity": "0.62881565",
            "sentiment_compound": -0.34
        },
        {
            "id": "h70wxvh",
            "score": 5,
            "text": "I miss when Dems were anti-authoritarian.",
            "title_similarity": "0.38913763",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6zzmz5",
            "score": 3,
            "text": "As someone who identifies as left leaning, and would have supported this policy pretty much any time pre vaccine..\n\nIn a post vaccine world, this seems heavy handed. Being a jerk who flouts the rules to be obstinate towards the left is childish and unbecoming of a political leader. Arresting vaccinated people for not wearing a mask is just spiteful. \n\nThe spite might feel justified,  but I expect more from our leaders.",
            "title_similarity": "0.5530423",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h7169mj",
            "score": 1,
            "text": "At this point the Democrats are shooting themselves in the foot and squandering the goodwill they've accumulated from handling the pandemic correctly. There is no good reason to mandate mask wearing again. The vaccine is freely available to anyone who wants it and most adults are vaccinated. By starting all these mask mandates and lockdowns etc. again they are going to lose voters. I can guarantee it.\n\nAnother major problem with what they're doing is continuing to fixate on cases as a metric. Cases are going to spike during certain times of the year for literally the rest of time. Covid-19 is never going away. It is going to be like the seasonal flu and kill probably tens of thousands every year (people who willingly choose not to get vaccinated). Getting the vaccine doesn't prevent infection and case numbers from rising. The point of the vaccine is to prevent death when you get sick. The only metric that is relevant at this point is the number of deaths.",
            "title_similarity": "0.55926293",
            "sentiment_compound": -0.9297
        },
        {
            "id": "h717qgb",
            "score": 3,
            "text": "Dumb ass rules",
            "title_similarity": "0.26301008",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h71dqov",
            "score": 2,
            "text": "It’s pretty clear this isn’t about preventing the spread of infection. It’s about getting republicans to wear a mask because they hate the idea of that so much. It’s petty af. The US government is such a joke now. Every single person in that capitol building is a joke. Both sides. Mock me if you want for saying BoTh SiDeS but it’s the truth.",
            "title_similarity": "0.6108477",
            "sentiment_compound": 0.5217
        },
        {
            "id": "h6zoz7k",
            "score": -5,
            "text": "How about arresting rand Paul for the campaign fund fraud he just committed? Or trump for trying to overthrow our democracy?",
            "title_similarity": "0.6766014",
            "sentiment_compound": -0.4696
        },
        {
            "id": "h6zs7th",
            "score": -1,
            "text": "Natural selection...let nature take its course",
            "title_similarity": "0.08903144",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6ztut6",
            "score": 1,
            "text": "Just comply and you won’t get shot…. This isn’t hard.",
            "title_similarity": "0.10016705",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h6zv6hb",
            "score": -1,
            "text": "I think they should arrest the one who said “There is no need for anybody to be walking around with a mask” in the early days of the pandemic, also do you remember “come join us in Chinatown “  that’s where I would start.",
            "title_similarity": "0.5765336",
            "sentiment_compound": -0.34
        },
        {
            "id": "h70qmae",
            "score": 1,
            "text": "This headline is a literal lie.",
            "title_similarity": "0.2870361",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70v8bl",
            "score": 0,
            "text": "That's ridiculous, I thought If you are vaccinated then masks were unnecessary?",
            "title_similarity": "0.3782958",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h71diag",
            "score": -2,
            "text": "OMG THIS IS LITERALLY 1984!!!….right?…..I mean I’ve never read the book but this must be it right?….",
            "title_similarity": "0.30023864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71gcir",
            "score": 0,
            "text": "How are people possibly cheering this on? This is insane.",
            "title_similarity": "0.2867262",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h708loq",
            "score": 7,
            "text": "Lol if theyre all vaccinated who the fuck care? Sounds like an excuse lol",
            "title_similarity": "0.34482223",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h6zly3g",
            "score": 0,
            "text": "Why can't he with the other's wear a mask and deal with issues related to the boarder?\n\nHow are masks preventing him/them from continuing the debate on the border?\n\nThis seems like a farce.\n\nEveryone wants to go back to a normal life, however it's the governments responsibility to make sure the safety of the citizens is maximized. \n\nIt's like before doing any dangerous activity deep-diving/sky-jumping without prior proper safety precautious.",
            "title_similarity": "0.5266191",
            "sentiment_compound": 0.3022
        },
        {
            "id": "h700iki",
            "score": 0,
            "text": "Lol, what about that racist congress woman lady that won because there was no opponent? Are we gonna see her arrested now?",
            "title_similarity": "0.4813429",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h706pri",
            "score": 0,
            "text": "This is so embarrassing! Can you imagine how much mockery We’re suffering and the world right now? This rich Nation, with so much advantage, behaving with nothing short of stupidity while other Nations have to wait for their chance at vaccinations",
            "title_similarity": "0.46725124",
            "sentiment_compound": 0.3528
        },
        {
            "id": "h70dmo1",
            "score": 0,
            "text": "Not communist… lol",
            "title_similarity": "0.09065804",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h70uctn",
            "score": 0,
            "text": "I hope there is a law to back up these arrests. I read 22-3302 and it doesn't sound like it applies. They have to specifically say that not wearing a mask is a violation that prohibits entry. If I were a member of the Capitol Police I would not be arresting anyone.",
            "title_similarity": "0.5858985",
            "sentiment_compound": -0.6497
        },
        {
            "id": "h71jg44",
            "score": 0,
            "text": "Ohh YESSS! It makes my tiny acorn so hard that any lawmaker could get arrested for something that will set the precedent for other naughty naughty rule breakers to get arrested too! We are hive mind! We are the Reddit borg!",
            "title_similarity": "0.5913863",
            "sentiment_compound": -0.8494
        },
        {
            "id": "h6zratj",
            "score": 5,
            "text": "Bots. \n\nBots everywhere",
            "title_similarity": "0.31804848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ztpmz",
            "score": 4,
            "text": "This is dangerous",
            "title_similarity": "0.23002309",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70x0n2",
            "score": -6,
            "text": "Get the vaccine, wear a mask, dont be near people, also dont say a damn word about it or else you're a neanderthal, fascist, racist, stupid waste of air.  Reddit is such a nice place",
            "title_similarity": "0.44365522",
            "sentiment_compound": -0.8671
        },
        {
            "id": "h6z4lw6",
            "score": -6,
            "text": "Make them all take an IQ test and then we can all guess which one scored over 100. I'm going with none of the above.",
            "title_similarity": "0.35709885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zznul",
            "score": 5,
            "text": "What was the whole point of the Vaccines then? Will this ever be over?",
            "title_similarity": "0.3722387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70ocz0",
            "score": 3,
            "text": "Congresspeople cannot be arrested except for treason, felony and breach of peace when going about there congressional duties. It’s not a felony, it’s not treason and it’s not a breach of peace. It would be unconstitutional to arrest congresspeople for this",
            "title_similarity": "0.5858752",
            "sentiment_compound": 0.7193
        },
        {
            "id": "h6z3g6q",
            "score": 14,
            "text": "I hope they get used to those handcuffs. These are the same people that were most likely in on the Jan. 6th coup attempt.",
            "title_similarity": "0.41802278",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6z9dpq",
            "score": 9,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zgpke",
            "score": 10,
            "text": "This seems like a recipe for the excessive use of police force.",
            "title_similarity": "0.5082505",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6zy83x",
            "score": 6,
            "text": "And with one headline, Reddit is unsurprisingly pro police",
            "title_similarity": "0.40846145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zyt7r",
            "score": 6,
            "text": "Friendly reminder: When politicians start arresting other politicians, eventually the fascists win. Don't be so excited just because it's \"your team\" is the one that starts it, because once something is done in one Congress, it becomes the status quo for all future Congresses. If GOP people start getting arrested for minor violations of law, you can guarantee that the next time they're in power they'll arrest every DNC politician for all sorts of laws.\n\nThe fact is, nearly every congressperson does illegal things. They could all be arrested if push really came to shove. There's a reason we don't go down that path.",
            "title_similarity": "0.7021883",
            "sentiment_compound": -0.6467
        },
        {
            "id": "h715n05",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zx58g",
            "score": 4,
            "text": "That escalated quickly. Not sure how this is supposed to help though? You're now forcing them to do to congress what the Ds in Texas were trying to do.\n\nIt's almost like you're helping them and this is all theater.",
            "title_similarity": "0.5497347",
            "sentiment_compound": 0.5969
        },
        {
            "id": "h703823",
            "score": -3,
            "text": "Whatever. Fuck everyone. To the gas chambers with all politicians.",
            "title_similarity": "0.6044184",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h709zqs",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70fo6d",
            "score": 2,
            "text": "This is getting fuckin stupid.",
            "title_similarity": "0.21273132",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h70s4d8",
            "score": 3,
            "text": "Insanity, makes you really wonder which side would be the ones going door to door like the gestapo in Nazi Germany.",
            "title_similarity": "0.5236858",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6zma7z",
            "score": 1,
            "text": "What about the ones who helped plan an Insurrection???",
            "title_similarity": "0.42998326",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6znq5n",
            "score": -1,
            "text": "It's about fucking time",
            "title_similarity": "0.053234775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zu2jp",
            "score": 1,
            "text": "So Pelosi CAN order the police to arrest people? Here I thought all those subpoenas that were ignored over the past few years were unenforceable...\n\nWell glad to see she finally grew a pair.",
            "title_similarity": "0.62279737",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6zui9x",
            "score": -1,
            "text": "Mor clickbait huh?",
            "title_similarity": "0.097877204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zx0oq",
            "score": -1,
            "text": "It may be different on the house side, but in the Senate id estimate that less than 50% of staffers are wearing mask and Capitol police officers are by and large massless. \n\nThis is a very inaccurate and misleading headline",
            "title_similarity": "0.53827286",
            "sentiment_compound": -0.6054
        },
        {
            "id": "h708dkv",
            "score": 1,
            "text": "Who gives such an order and what law are they enforcing?",
            "title_similarity": "0.37180948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70b7do",
            "score": -1,
            "text": "Isn't this unconstitutional? I specifically remember the constitution having a clause that gave members of congress immunity from arrest while they are either coming to, going to, or in Congress.",
            "title_similarity": "0.6620225",
            "sentiment_compound": -0.34
        },
        {
            "id": "h70i250",
            "score": 1,
            "text": "Yeah just, run down people who don't want to take the nyquil you so badly need them to take wtf. \n\nWalter White was less cracked out than these tweekers up in dc.",
            "title_similarity": "0.48895106",
            "sentiment_compound": -0.7791
        },
        {
            "id": "h70i98h",
            "score": -1,
            "text": "Hmmm, using state security forces to target your political rivals.  Nope, this won’t end badly.",
            "title_similarity": "0.4941147",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h70xzaq",
            "score": 1,
            "text": "Oh my god, are the Capitol Police going to start actually doing job???",
            "title_similarity": "0.6303245",
            "sentiment_compound": 0.3899
        },
        {
            "id": "h70zqu0",
            "score": -1,
            "text": "So if whomever in charge could order this.  Why could he, or she get additional officers to help protect the capital during the violent protests?  🤷🏻‍♂️.  What’s up with that???   It’s not like they didn’t see it coming.   Everyone had been repeating on it for awhile….   Maybe we will get an answer to that from the investigation.  Who knows… 🤷🏻‍♂️🤷🏻‍♂️🤷🏻‍♂️",
            "title_similarity": "0.66696346",
            "sentiment_compound": -0.5529
        },
        {
            "id": "h71bf73",
            "score": -1,
            "text": "Great. Can they please arrest any Texas Lawmakers who are shirking their responsibilities and send them back home too?  You can recognize them by the fact that they smell their own farts and form circle jerks whenever possible. Those of us who voted for them and rely on them would like them to come back and do their jobs.",
            "title_similarity": "0.6384185",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6zqher",
            "score": 5,
            "text": "Excessive",
            "title_similarity": "0.06953311",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z45mc",
            "score": 9,
            "text": "\"With pleasure.\" -Capitol police, probably",
            "title_similarity": "0.31905648",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h6zox7g",
            "score": -18,
            "text": "The capitol police are going to be the new SS of America,  just give it a few years.",
            "title_similarity": "0.43651998",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zpzke",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h705cue",
            "score": 4,
            "text": "This sends the worst possible message to the conspiracy-laden heads of far-right Republicans. That WaPo article and now this? What the hack is going on with the left wing establishment? This may not end well.",
            "title_similarity": "0.5737634",
            "sentiment_compound": -0.741
        },
        {
            "id": "h6zi30t",
            "score": -12,
            "text": "Seems a bit excessive tbh, unless the area is getting a bunch of new, worse variants I’m not aware of",
            "title_similarity": "0.32772768",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6zo533",
            "score": -2,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zphyy",
            "score": -3,
            "text": "Fuck these republican assholes",
            "title_similarity": "0.45519683",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h6zws3w",
            "score": -2,
            "text": "Honestly good. Get they asses.",
            "title_similarity": "-0.0009801947",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h6zwusp",
            "score": 3,
            "text": "Ironically, the same congress lawmakers should probably already be arrested for inciting a insurrection.",
            "title_similarity": "0.6896861",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6zy9yc",
            "score": -2,
            "text": "Is this kinda like when pelosi instituted the metal detectors and said anyone not using them to enter would be fined. Then she proceeded to not use them and won’t pay her fine lmao.",
            "title_similarity": "0.63025355",
            "sentiment_compound": 0.7584
        },
        {
            "id": "h6zywod",
            "score": -1,
            "text": "But I thought anybody protesting anything is immune to Covid in America?  Lol. Your country is a political joke.",
            "title_similarity": "0.5256938",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h700jhw",
            "score": 1,
            "text": "Looks like the ‘crazy’ conspiracy theorists were right again.",
            "title_similarity": "0.2951126",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h704hee",
            "score": -2,
            "text": "With all the bullshit going on in the world today. And this is the theatrics going on? Fucking disgusting. Wear the mask, or not, who cares. There’s more important work to be done. But in typical congressional fashion, here we are.",
            "title_similarity": "0.61638445",
            "sentiment_compound": -0.6046
        },
        {
            "id": "h70509m",
            "score": -2,
            "text": "Remember when Nancy got her hair done when all salons where ordered closed had a hair service an didnt wear a mask... \n\nYay I also want everyone to wear a mask on tv, also the police officers wear their masks while on duty.",
            "title_similarity": "0.543661",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h70isb1",
            "score": 2,
            "text": "“Pandemic of the vaccinated”",
            "title_similarity": "0.38007125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70nl1a",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70sza8",
            "score": -2,
            "text": "Has everyone lost their fucking minds",
            "title_similarity": "0.4021673",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h70tk40",
            "score": -2,
            "text": "Even if they're vaccinated, ???",
            "title_similarity": "0.22901356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h717dh8",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h719uot",
            "score": -1,
            "text": "it's all theater and this stupid sub is complicit",
            "title_similarity": "0.47395003",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h72l2yg",
            "score": -2,
            "text": "AOC to Pelosi: \"Mom, Megan's not wearing her mask!!!\"\nPelosi on loudspeaker: \"Megan Boebert to the principal's office\"",
            "title_similarity": "0.51650405",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z70mj",
            "score": 13,
            "text": "I would give my left nut to see anyone from the current GOP in hand cuffs.",
            "title_similarity": "0.31509715",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h70ipno",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h7137ug",
            "score": -5,
            "text": "Nobody stops and questions, even for a moment, if these mask mandates are 1) legitimate under the authority of an executive order, or 2) prudent? Anyone? Even Fauci admitted that they were empty of any efficacy.",
            "title_similarity": "0.3825719",
            "sentiment_compound": -0.264
        },
        {
            "id": "h704fr4",
            "score": -3,
            "text": "The Totalitarian State has begun",
            "title_similarity": "0.34178692",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70efoj",
            "score": -2,
            "text": "How is this declaration not a violation of HIPAA?\n\nWe have been told that it is a violation of HIPAA for a government employee to ask if we have been Vax’d. How is this different?\n\nIs everyone in the building required to wear masks, no matter what their status?\n\nLooking for some clarification…",
            "title_similarity": "0.6562716",
            "sentiment_compound": -0.2928
        },
        {
            "id": "h70s4p3",
            "score": 3,
            "text": "Thanks for nothing, anti-vaxxers. Worse than flat earthers.",
            "title_similarity": "0.35358873",
            "sentiment_compound": 0.6656
        },
        {
            "id": "h712vis",
            "score": -3,
            "text": "Let it go to the Supreme Court. Won’t last.",
            "title_similarity": "0.40785706",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h72q0fe",
            "score": -4,
            "text": "for all the time leftist cried about trump being literally hitler....\n\nthis is the closest i have seen america go to fascism in a while.",
            "title_similarity": "0.5023708",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h70hbne",
            "score": -9,
            "text": "Smells like communism to me. Hopefully I’ll be rich and gone before shit makes the ceiling fan fall.",
            "title_similarity": "0.36821437",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h6zo8dm",
            "score": 4,
            "text": "Oh god please let me see Ted Cruz get arrested for not wearing a mask",
            "title_similarity": "0.7123647",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6zucgf",
            "score": 0,
            "text": "Well...give them some credit for some semblance of truth.\n\nThe original tag was:  Capitol police ordered  Big Foot to arrest Congress lawmakers...",
            "title_similarity": "0.7454593",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6zup6k",
            "score": 0,
            "text": "I'm not sure the Capitol Police can arrest members of Congress.  What I read was that they were to arrest visitors and staff who refuse to comply, but to report members of Congress.",
            "title_similarity": "0.8324359",
            "sentiment_compound": -0.5394
        },
        {
            "id": "h6zv2sd",
            "score": 0,
            "text": "wow",
            "title_similarity": "-0.09474414",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6zvwwq",
            "score": 0,
            "text": "While its a good idea its unconstitutional to stop the lawmakers: \n\nArticle 1 Section 6:\n\nThey shall in all Cases, except Treason, Felony and Breach of the Peace, be privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same; and for any Speech or Debate in either House, they shall not be questioned in any other Place.",
            "title_similarity": "0.62032974",
            "sentiment_compound": 0.3391
        },
        {
            "id": "h6zwac3",
            "score": 0,
            "text": "Conservatives should like this, this is a strong man move",
            "title_similarity": "0.13428912",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h6zwh3j",
            "score": 0,
            "text": "It's about time.",
            "title_similarity": "-0.037040465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zwqfb",
            "score": 0,
            "text": "Please don’t be too nice",
            "title_similarity": "0.25384793",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h6zx86p",
            "score": 0,
            "text": "If you only saw the videos, you would think COVID was just a harmless tourist visit. Terrorists like BLM and Antifa would have you believe that masks will save your life.\n\n&#x200B;\n\n/s\n\n(in case I need to add that)",
            "title_similarity": "0.421493",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6zxpjz",
            "score": 0,
            "text": "Misleading title is misleading",
            "title_similarity": "0.20599668",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h6zy9fp",
            "score": 0,
            "text": "They are just patriot's intent on Spreading the virus like a good socialist's. OOOPS",
            "title_similarity": "0.34520477",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6zysiy",
            "score": 0,
            "text": "Just say you’re there to riot and you’ll get a slap on the wrist.",
            "title_similarity": "0.49862152",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6zz1yg",
            "score": 0,
            "text": "If they couldn't shoot the insurrectionists, I have very little faith they could arrest congressmen.",
            "title_similarity": "0.58842146",
            "sentiment_compound": 0.3445
        },
        {
            "id": "h6zzf8q",
            "score": 0,
            "text": "Sure. That'll happen. Spoiler: nothing will happen.",
            "title_similarity": "0.06679798",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7000h6",
            "score": 0,
            "text": "About fucking time..",
            "title_similarity": "0.019023392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7002tt",
            "score": 0,
            "text": "Time for the Capital Police to get a little payback on the cowards who set them up to get beat and killed by trumps followers.",
            "title_similarity": "0.67789084",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h700729",
            "score": 0,
            "text": "Good!",
            "title_similarity": "-0.135432",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h700kze",
            "score": 0,
            "text": "popcorn.gif",
            "title_similarity": "-0.0034002792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7015v4",
            "score": 0,
            "text": "I'd be amused to watch the right break, torn between \"they're coming after US SEE\" and \"blue lives\" rhetoric. \nI don't know if I have any hope that anything will happen to these ridiculous wastes but I hope MTG or Gaetz, who Venmo'd a child for sex, goes first if so.",
            "title_similarity": "0.39074787",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h7035be",
            "score": 0,
            "text": "I can wait for those Congressmen get the “tour” of the prison facility they wanted.",
            "title_similarity": "0.5139372",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7043tz",
            "score": 0,
            "text": "Starting with the: Mask rule",
            "title_similarity": "0.09978607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h704qkp",
            "score": 0,
            "text": "Gimmie those mugs shots!",
            "title_similarity": "0.25493124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7056sr",
            "score": 0,
            "text": "\"Don't take me, bro! Don't tase me!\". Oh god, I wish.",
            "title_similarity": "0.33905423",
            "sentiment_compound": 0.658
        },
        {
            "id": "h706g78",
            "score": 0,
            "text": "Title is a bit confusing 😜",
            "title_similarity": "0.13734503",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h707ty0",
            "score": 0,
            "text": "Soft fuckers",
            "title_similarity": "0.007618134",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h70al50",
            "score": 0,
            "text": "Unfortunately, members of Congress are immune from arrests while in session, unless they commit a felony, treason, or 'breaching the peace.'\n\n_\"Article I, Section 6, Clause 1:\n\nThe Senators and Representatives shall receive a Compensation for their Services, to be ascertained by Law, and paid out of the Treasury of the United States. They shall in all Cases, except Treason, Felony and Breach of the Peace, be privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same; and for any Speech or Debate in either House, they shall not be questioned in any other Place.\"_",
            "title_similarity": "0.63148594",
            "sentiment_compound": 0.127
        },
        {
            "id": "h70fq0h",
            "score": -5,
            "text": "We now have an armed federal police force that takes orders directly from the president. Let that sink in guys, nothing scary going on here.",
            "title_similarity": "0.6074616",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h70nat1",
            "score": 0,
            "text": "Headlines are sooo misleading",
            "title_similarity": "0.2994281",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h70rtqu",
            "score": 0,
            "text": "We pay these people a lot of money for them to ^own the ^libs via viral Facebook moments.",
            "title_similarity": "0.37007093",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h718o8a",
            "score": 0,
            "text": "They’ll just let them in instead.",
            "title_similarity": "0.15477665",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71aj3w",
            "score": 0,
            "text": "Stupid as fuck",
            "title_similarity": "0.22389644",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h71b8a8",
            "score": 0,
            "text": "My dick is presently rating very high on the Mohs scale of hardness. Right up there with tungsten which incidentally may be the material used to handcuff them.",
            "title_similarity": "0.36367097",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h71cf1v",
            "score": 0,
            "text": "Nearly 70,000 people liked.  Does that not speak volumes to what we the people think??   Joe Biden and administration,  I hope you are listening.  I trust that you all are.",
            "title_similarity": "0.33133197",
            "sentiment_compound": 0.8541
        },
        {
            "id": "h71eenx",
            "score": 0,
            "text": "They’ll probably need to raise funds……..",
            "title_similarity": "0.14445493",
            "sentiment_compound": 0.0
        },
        {
            "id": "h72mpi8",
            "score": 0,
            "text": "Will\nThey enforce? Will some just fist bump knowing they let rioters into the Capitol?",
            "title_similarity": "0.7743701",
            "sentiment_compound": 0.0
        },
        {
            "id": "h72tpw0",
            "score": 0,
            "text": "Arrested for not wearing a mask… what has the world come to",
            "title_similarity": "0.5958667",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h737rbu",
            "score": 0,
            "text": "Perfect!  Let’s arrest people for not wearing a mask, but free convicted prisoners due to the risk of not being able to protect incarcerated people during a pandemic.  Government policies are not grounded in common sense, but instead being used for political positioning.",
            "title_similarity": "0.6537376",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h73fccw",
            "score": 0,
            "text": "Fuck your mask in your ass",
            "title_similarity": "0.4056347",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h7lmivl",
            "score": 0,
            "text": "Never mind the CDC report that said mask fail to prevent the spread of viruses 98.3% of the time.  This has nothing to do with public health. It's ALL about control.",
            "title_similarity": "0.4746015",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h70oxgd",
            "score": -9,
            "text": "Of course. I expect nothing less from the Democrat fascists in congress.\n\nTruly the heirs of the party of Hitler.",
            "title_similarity": "0.4375223",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h70plw9",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zxyzg",
            "score": -5,
            "text": "I hope Nancy Pelosi doesn’t have a hair appointment soon",
            "title_similarity": "0.40723893",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h703h4c",
            "score": -5,
            "text": "Sounds like that freedom is going down the tube.",
            "title_similarity": "-0.020946812",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h70k7k4",
            "score": -5,
            "text": "This is very authoritarian",
            "title_similarity": "0.30808607",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70khkd",
            "score": -6,
            "text": "Mask mandate is stupid to start with.",
            "title_similarity": "0.26763058",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h70l7pf",
            "score": -5,
            "text": "That's silly",
            "title_similarity": "-0.013099267",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6zjd5w",
            "score": -26,
            "text": "most police and military dont have an irrational fear of covid, doubt this will be enforced. Leftists trying to intimidate and bully with police is vile",
            "title_similarity": "0.5603385",
            "sentiment_compound": -0.9147
        },
        {
            "id": "h6zjjvm",
            "score": -32,
            "text": "Nazis are at it again",
            "title_similarity": "0.31720173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zxdqk",
            "score": -10,
            "text": "and some of you are praising shit like this…",
            "title_similarity": "0.16330445",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6z5ap0",
            "score": 8,
            "text": "Put them all in the communal holding cells, that'll show them!",
            "title_similarity": "0.35482284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zayxf",
            "score": 5,
            "text": "this is legal?",
            "title_similarity": "-0.029590977",
            "sentiment_compound": 0.128
        },
        {
            "id": "h702tuk",
            "score": -6,
            "text": "That’s a terrible idea",
            "title_similarity": "0.25079405",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70izb5",
            "score": -6,
            "text": "Thought the vaccine works?!",
            "title_similarity": "0.11040553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70x8rm",
            "score": -6,
            "text": "As far as I know McCarthy has not changed his stance on masks. If the Republicans had done something like this the Dems would call it Political Silencing or An attack on Democracy or An abuse of power. I'm tired of the blatant hypocrisy of the government. Same goes for the Vaccine, if Trump was in office they wouldn't be pushing people to get it, and before you ask, no even if Trump was in office I still wouldn't get the shot, three years was the average for making a vaccine, I don't trust the government.",
            "title_similarity": "0.5576592",
            "sentiment_compound": -0.9202
        },
        {
            "id": "h713r28",
            "score": -7,
            "text": "So stupid.. on the count that even Kamala wasn't wearing masks internationally 🤣🤣😅",
            "title_similarity": "0.33973512",
            "sentiment_compound": 0.6378
        },
        {
            "id": "h721nxv",
            "score": -6,
            "text": "Well, that's it folks. Freedom was fun while it lasted. Why does it seem that authoritarianism almost always comes from the left?",
            "title_similarity": "0.16322747",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h6zxcwt",
            "score": -11,
            "text": "Your thin piece of cloth does nothing but virtue signal.",
            "title_similarity": "0.036360536",
            "sentiment_compound": -0.4585
        },
        {
            "id": "h6zaokl",
            "score": 1,
            "text": "Ohhhh American gov got me all giddy now",
            "title_similarity": "0.16917422",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6zddp8",
            "score": -1,
            "text": "[Oh sweet!  ]( https://i.redd.it/has6ciu555151.jpg  )",
            "title_similarity": "0.058857415",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h6zq4qj",
            "score": -1,
            "text": "Woohoo!  Someone finally grew some balls!",
            "title_similarity": "0.049947053",
            "sentiment_compound": 0.5972
        },
        {
            "id": "h6zthig",
            "score": 1,
            "text": "They should of ordered that jan 6 instead of Caesars pizza",
            "title_similarity": "0.3238039",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zug2b",
            "score": -1,
            "text": "Is it a \"lawful\" order?\nThat's the question isn't it?",
            "title_similarity": "0.096453026",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zvl50",
            "score": -1,
            "text": "To tell on lawmakers but arrest staff and visitors smh why the lawmakers get a free pass?",
            "title_similarity": "0.7305526",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6zvtie",
            "score": -1,
            "text": "Vaccinated people should be exempt.",
            "title_similarity": "0.26991093",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6zw68a",
            "score": 1,
            "text": "Can't wait to see the Karen videos of these officials losing their shit.",
            "title_similarity": "0.5490198",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h6zwlan",
            "score": 1,
            "text": "You’d think that at least marjorie trash face would take advantage and hide her ugly mug behind a mask but she wants to flaunt that thing?",
            "title_similarity": "0.43822956",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6zwo16",
            "score": 1,
            "text": "So where is Boebert in cuffs? She threw a mask at a staffer.",
            "title_similarity": "0.5873948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zwrxx",
            "score": 1,
            "text": "I’d be very surprised if they arrest a Repub congressperson. They only fuck with black and brown Dems",
            "title_similarity": "0.59576964",
            "sentiment_compound": -0.5729
        },
        {
            "id": "h6zwzd9",
            "score": -1,
            "text": "I guess it is better than just shooting them in the neck.",
            "title_similarity": "0.19767833",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zy6ni",
            "score": -1,
            "text": "Where is the bigotry? Think about the financial movements of the world. \n\nIf let me guess you also forget how well they have treated their people through all of this. \n\nWelding peele into their homes. They aren't known for caring about people.. this is why they are willing to excitement in them and have no ethical concerns over full coming experiments... Learned about this while doing prerequisites for med school. \n\nIt's simple implication that without faces or voice we have no influence over the leaders.",
            "title_similarity": "0.49964556",
            "sentiment_compound": -0.4819
        },
        {
            "id": "h702i34",
            "score": -1,
            "text": "I’m all for arresting lawmakers, but for taking bribes and neglecting their duty to the people, not for some stupid mask noncompliance…",
            "title_similarity": "0.6803795",
            "sentiment_compound": 0.0294
        },
        {
            "id": "h702uqx",
            "score": -1,
            "text": "Next up: what constitutes a mask? See through mesh? Under the nose? Chin diapers? Shirt pulled over the nose?",
            "title_similarity": "0.18138981",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7030iq",
            "score": -1,
            "text": "> Capitol police ordered to arrest Congress lawmakers, staff and visitors who refuse mask mandate\n\nWhat if they're vaccinated?",
            "title_similarity": "0.9303422",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h7046lf",
            "score": 1,
            "text": "There's probably a few zip ties still lying around they could use.",
            "title_similarity": "0.096881606",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h70bczy",
            "score": -1,
            "text": "Aren’t most of these folks vaccinated? This seems like REALLY bad messaging or just a flat out power grab.",
            "title_similarity": "0.50344175",
            "sentiment_compound": -0.4635
        },
        {
            "id": "h70goy5",
            "score": 1,
            "text": "The Senators and Representatives …….in all Cases, except Treason, Felony and Breach of the Peace, be privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same; and for any Speech or Debate in either House, they shall not be questioned in any other Place.\n\nYet again proving none of them (or you)  have even read the constitution",
            "title_similarity": "0.64211875",
            "sentiment_compound": 0.1769
        },
        {
            "id": "h70k0gj",
            "score": 1,
            "text": "They will figure a way out of it. Look at Andrew Clyde who owes $15,000 for not wearing masks last time they had a policy. He changed his tax withholdings so he only gets paid $1 and gets the rest back on his tax return.\n\nhttps://www.cnn.com/2021/07/28/politics/andrew-clyde-mask-fine/index.html",
            "title_similarity": "0.46543196",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70k16i",
            "score": 1,
            "text": "Are these the same Capitol police that allowed people to storm the Capitol at the behest of certain “lawmakers and staff”",
            "title_similarity": "0.8728888",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h70k3tl",
            "score": 1,
            "text": "execute order 69",
            "title_similarity": "0.15100718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70mjs6",
            "score": 1,
            "text": "Just comply.",
            "title_similarity": "0.0029464625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70odsk",
            "score": 1,
            "text": "These people are so petty, I can’t believe they actually represent the US, the “christian” population at that. It feels like they are mimicking the outrage of BLM and directing it towards mask mandates but they don’t understand, BLM is valid, denying science is not.\n\nI guess they can’t comprehend that no one else wants to wear masks or get vaccinated - and we ALL are tired of this - but we do what we need in order to be responsible and kind to one another. \n\nFunny that caring for others is lost on them.",
            "title_similarity": "0.47335923",
            "sentiment_compound": 0.4436
        },
        {
            "id": "h70of4c",
            "score": 1,
            "text": "I, for one, am looking forward to the next headline in r/politics \"Republican screams about their freedoms as they're escorted out of the building for not wearing a mask\"",
            "title_similarity": "0.6555575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70p19u",
            "score": 1,
            "text": "Hahaha🤣",
            "title_similarity": "-0.049705166",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h70s0w3",
            "score": -1,
            "text": "https://constitution.congress.gov/browse/essay/artI-S6-C1-1-2/ALDE_00001047/#:~:text=They%20shall%20in%20all%20Cases,questioned%20in%20any%20other%20Place.\n\nHow does that work against this?",
            "title_similarity": "0.46460396",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70sku4",
            "score": -1,
            "text": "That’ll really attract people to our nation’s capital. \n\nKeep goin’.",
            "title_similarity": "0.25653166",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h70t0aq",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7128ry",
            "score": -1,
            "text": "For some of the people not wearing masks, would being vaccinated allow them to avoid being reported?  It seems silly forcing a vaccinated person to wear a mask.  I get it for unvaccinated, maskless members though.",
            "title_similarity": "0.42439166",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h712ebg",
            "score": -1,
            "text": "Are you sure they're up to the job? Their testimony before the house indicates it may be a challenge for some of them.",
            "title_similarity": "0.49416518",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h719d8n",
            "score": 1,
            "text": "Queue the martyrs in 3, 2, 1!",
            "title_similarity": "0.37508258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71bxjp",
            "score": -1,
            "text": "What about the general public? if people who haven't been vaccinated aren't allowed to petition the government, wouldn't that be violating the constitution ?",
            "title_similarity": "0.59059227",
            "sentiment_compound": 0.4956
        },
        {
            "id": "h71dtyt",
            "score": 1,
            "text": "And if they can make sure to film each arrest to fuel my erection",
            "title_similarity": "0.45222902",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h71fj1f",
            "score": 1,
            "text": "Arresting is a bit of an overreaction. Just bar them from entire federal buildings",
            "title_similarity": "0.67066",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h71l6hv",
            "score": -1,
            "text": "Arrested for going with cdc guidelines. This country is fucked.",
            "title_similarity": "0.7127018",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h71nu2m",
            "score": -1,
            "text": "Pelosi owes George Floyd and his family an apology.",
            "title_similarity": "0.36116198",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h71oksu",
            "score": 1,
            "text": "Apparently the Capitol Police aren't actually supposed to arrest lawmakers not wearing masks but I wouldn't be surprised if a few times they spot a congressperson who has said unkind things about the Capitol Police, \"forgets\" not to arrest them and by the time they get reminded the congressperson has been charged with resisting arrest, assault on an officer('s foot with their face), and destruction of government property (by bleeding on a police uniform), you know, the usual stuff. They probably won't think they can get away with trying the give contradictory orders than shoot for disobeying routine on a congressperson but the Capitol Police may just be in the mood for some light police brutality and the members of Congress that have caught their attention might want to avoid giving them an excuse (and the ones prone to carrying weapons in the Capitol should probably leave them at home and try not to reach for their wallet or anything like that).\n\nI'd prefer Capitol Police stick with arresting people, when appropriate, with no unnecessary force but cops are cops and it would be kinda funny for the rich and powerful to be the ones to deal with them for once (especially the ones who don't mind police brutality when its happening to the poor and/or POC). Either way I genuinely hope this ends without anyone getting shot (not even the ones who generally like unjustified shootings by police).",
            "title_similarity": "0.7526107",
            "sentiment_compound": -0.9339
        },
        {
            "id": "h71wjvp",
            "score": -1,
            "text": "Even if they got the vaccine? That’s crazy y’all.",
            "title_similarity": "0.37541354",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7201pd",
            "score": 1,
            "text": "Manipulated headline.  Both by OP, who didn’t post the exact language in the headline, as well as the Independent who misreported the “order”.  The order is to report, and warn them they risk arrest.",
            "title_similarity": "0.6434682",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h72naut",
            "score": -1,
            "text": "If someone was vaccinated, I don't see the point of wearing a mask... I think this type of enforcement is not a great look. \n\nOdds are low that they'll get covid. The people they would be protecting from potential covid are the same people who have chosen at this point to not get the vaccine so I don't see what the issue is was not wearing one.",
            "title_similarity": "0.42790928",
            "sentiment_compound": -0.6591
        },
        {
            "id": "h72qvb6",
            "score": -1,
            "text": "This is communism.",
            "title_similarity": "0.20297395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h730ifb",
            "score": 1,
            "text": "Of all the hills for them to die on, they pick not wearing a mask... It'll be amusing if this is what finally kicks off the chain reaction of the Republican traitors finally getting removed from congress.",
            "title_similarity": "0.6091419",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7c6rmk",
            "score": -1,
            "text": "Looting and rioting = don’t arrest them\n\nBeing pro-face = arrest them",
            "title_similarity": "0.6745613",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h70461j",
            "score": -8,
            "text": "If you don’t see the problem with this, you’re in full favor of a dictatorship.",
            "title_similarity": "0.3525061",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70iyku",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h702par",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h708n7r",
            "score": -8,
            "text": "Slowly headed towards dictatorship",
            "title_similarity": "0.22746901",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70knwi",
            "score": -7,
            "text": "1. Its not a law.\n\n\n2. Its not a law\n\n\n3.  Its not a law",
            "title_similarity": "0.18065324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7107zf",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h7140ng",
            "score": -8,
            "text": "Arrest under no authority...sounds about right for liberals. Now they love the cops how shameful and disgusting...",
            "title_similarity": "0.5205722",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h707c28",
            "score": -9,
            "text": "We used to live in a free society. It was nice while it lasted.",
            "title_similarity": "0.010053078",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h72b54k",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zghfu",
            "score": 2,
            "text": "This will be fun to see play out.",
            "title_similarity": "-0.04626225",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h6zje4b",
            "score": 2,
            "text": "Nancy’s playing hardball",
            "title_similarity": "0.22191602",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6zjrtx",
            "score": 2,
            "text": "People who don't wear a mask? Police instructed to lock'em up.\n\nPeople who ignore subpoenas? Police instructed to hide in a corner and masturbate.",
            "title_similarity": "0.70414287",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h6zlyob",
            "score": 2,
            "text": "Finally took the kid gloves off. BRAVO DEMOCRATS MAKEM ACCOUNTABLE!!",
            "title_similarity": "0.4300028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zlyw5",
            "score": 2,
            "text": "most mask refusers have committed worse crimes already...",
            "title_similarity": "0.4788214",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6zm69m",
            "score": 2,
            "text": "Republicans are willing to have their voters die to prove how much they hate Democrats. \nRepublican Motto: On the wrong side of history since 1969.",
            "title_similarity": "0.5661444",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h6zms71",
            "score": -2,
            "text": "Do it",
            "title_similarity": "-0.06729582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6znq7v",
            "score": 2,
            "text": "Can’t wait to hear all the republican persecution complex nonsense that will spew forth in the coming days. My advice to these bad faith GQP clowns: “Just comply.”",
            "title_similarity": "0.5834081",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h6zoc4f",
            "score": -2,
            "text": "Arrest them, hold a vote that they'll be absent for due to their arrest.",
            "title_similarity": "0.6968163",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6zp795",
            "score": -2,
            "text": "As they should. Make an example out of them.",
            "title_similarity": "0.054302186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zp7yh",
            "score": -2,
            "text": "Fuckin do it",
            "title_similarity": "0.09192807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ztb91",
            "score": 2,
            "text": "Who wants to bet that if Republicans take the house in 2022 and covid is still around (most likely because of these imbeciles), whoever they choose as speaker will require that nobody wears masks, then claim it's freedom or some shit, completely ignoring what little babies they are currently being about what the rules are now?",
            "title_similarity": "0.5838809",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h6ztqw8",
            "score": -2,
            "text": "what about the rainforests guys?",
            "title_similarity": "0.17912236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zubw3",
            "score": -2,
            "text": "Not a fucking chance this actually happens.",
            "title_similarity": "0.19078329",
            "sentiment_compound": -0.2398
        },
        {
            "id": "h6zuvaj",
            "score": 2,
            "text": "Im sure the capitol police that the Republicans threw under the bus will enjoy this.",
            "title_similarity": "0.50845206",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h6zxf5z",
            "score": 2,
            "text": "This is a big win for Trusting the Science in Our Democracy! The heckin’ Secret Service and Intelligence Communiterino are going to kick butt like the girlbosses they are!",
            "title_similarity": "0.3994643",
            "sentiment_compound": 0.9133
        },
        {
            "id": "h6zyldu",
            "score": 2,
            "text": "Wtf took so long",
            "title_similarity": "0.20561424",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6zzj62",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zzkjt",
            "score": 2,
            "text": "Nancy Mace:  \"Madam Speaker Come and get me.\"\n\nSpeaker Pelosi:  \"OK.\"",
            "title_similarity": "0.35036248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7005p4",
            "score": 2,
            "text": "Watch MTG get herself arrested for the clicks.",
            "title_similarity": "0.6752846",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h700prf",
            "score": 2,
            "text": "Back the blue until it affects them. Lol",
            "title_similarity": "0.16608092",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h700wkt",
            "score": 2,
            "text": "Back the blue they screamed!  Now it’s affecting them so screw the blue huh?",
            "title_similarity": "0.3934394",
            "sentiment_compound": -0.5359
        },
        {
            "id": "h7016uh",
            "score": 2,
            "text": "Hallelujah. This is what we need across the country.",
            "title_similarity": "0.20286545",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h701m2b",
            "score": -2,
            "text": "We're primed for civil war",
            "title_similarity": "0.43331575",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h702s2z",
            "score": -2,
            "text": "Do you think the democrats caught not wearing a mask will be arrested?",
            "title_similarity": "0.6647306",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h702s3r",
            "score": 2,
            "text": "This is ridiculous and all you bootlicking science deniers should be ashamed of yourselves.",
            "title_similarity": "0.5614389",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h703wch",
            "score": 2,
            "text": "I want to see this happen.",
            "title_similarity": "0.06859395",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h703z4q",
            "score": 2,
            "text": "Throw Karen taylor-greene in the gulag",
            "title_similarity": "0.44464076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7048tk",
            "score": -2,
            "text": "Yes state violence. Do it.",
            "title_similarity": "0.39654252",
            "sentiment_compound": -0.34
        },
        {
            "id": "h705tk2",
            "score": 2,
            "text": "It baffles me that “police ordered to arrest congressmen seen breaking the law” isn’t just... obvious.\nBut this is the United States.\n\nThe court literally allows reps to say things that would violate the law , but since it’s in the chamber during debate, that’s not a crime... this is ... er... a “political question “ the court just can’t handle",
            "title_similarity": "0.73044187",
            "sentiment_compound": 0.3559
        },
        {
            "id": "h706875",
            "score": 2,
            "text": "A step in the right direction.\n\nThose neo nazis will play the victim card again though.",
            "title_similarity": "0.37036985",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7069f0",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h707e3j",
            "score": 2,
            "text": "I was expecting the title to read \"...who were complicit in the 1/6 insurrection.\"",
            "title_similarity": "0.50043136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h707xrg",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7092vd",
            "score": -2,
            "text": "Utter crap",
            "title_similarity": "0.19359143",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h70a99t",
            "score": 2,
            "text": "They didn't arrest people storming the building with zip tie cuffs, bear mace, knives...",
            "title_similarity": "0.4975527",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h70bqol",
            "score": -2,
            "text": "Don’t see how there’s justification for arrest. You know them, their address and contact details. They can simply be sent to court without arrest.",
            "title_similarity": "0.4444276",
            "sentiment_compound": -0.0936
        },
        {
            "id": "h70dbdt",
            "score": -2,
            "text": "Thought we were getting rid of the police?",
            "title_similarity": "0.5126906",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70dj78",
            "score": 2,
            "text": "God i wish everything didn’t have to be about democrats and republicans",
            "title_similarity": "0.35496315",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h70ifik",
            "score": 2,
            "text": "Ordered to report you mean? What a shit headline. At least try to be factual a little bit would ya?",
            "title_similarity": "0.41973567",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h70ji7e",
            "score": 2,
            "text": "Throwing temper tantrums and refusing to wear masks is not a good look for U.S. Congress",
            "title_similarity": "0.6097547",
            "sentiment_compound": -0.8558
        },
        {
            "id": "h70pofk",
            "score": 2,
            "text": "So we know that a number of the Capitol Police aided and abetted the 1/6 insurrection . . . Which itself was led by right wing conspiracy theorists, who of course are anti-maskers.  So then, how does one go about arresting one’s-self?",
            "title_similarity": "0.7446853",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70x9q6",
            "score": 2,
            "text": "And they should taser these criminal shitbags too",
            "title_similarity": "0.5297811",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h712zsi",
            "score": -2,
            "text": "If you're willing to do so kindly, can you tell me how the unvaccinated are at risk of catching covid from anyone who has received their vaccines?",
            "title_similarity": "0.46902728",
            "sentiment_compound": 0.4618
        },
        {
            "id": "h718zs9",
            "score": 2,
            "text": "About time! Go Americans go!",
            "title_similarity": "0.20922223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71bhtw",
            "score": -2,
            "text": "Thats uber gay",
            "title_similarity": "0.06745937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71gmtf",
            "score": -2,
            "text": "Authoritarian",
            "title_similarity": "0.25831735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71iis8",
            "score": -2,
            "text": "These conformist don’t have a clue about leadership and problem solving.",
            "title_similarity": "0.3867575",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h71myh0",
            "score": -2,
            "text": "That's insane.",
            "title_similarity": "0.14245102",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h71q8js",
            "score": 2,
            "text": "https://en.m.wikipedia.org/wiki/Jacobson_v._Massachusetts",
            "title_similarity": "0.19028719",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71ssuk",
            "score": 2,
            "text": "BREAKING: Police weakly vow to enforce basic decency laws on our millionaire oligarch representatives. For more on the eventual outcomes of this promise, let’s go to a common person from literally any era ever!\n\nThe common person: “yeah, they’ll get away with anything they want to do.” \n\nAnd there you have it!",
            "title_similarity": "0.5724602",
            "sentiment_compound": 0.1801
        },
        {
            "id": "h72fa2g",
            "score": -2,
            "text": "People are tuning out of cnn and msnbc and tuning in to conservative news it’s in the metrics it can be measured in ratings and the migration is massive so what are you missing?",
            "title_similarity": "0.52553916",
            "sentiment_compound": -0.296
        },
        {
            "id": "h73jc02",
            "score": 2,
            "text": "Starting to get more and more like a police state.\nExactly what they want. Libs and rinos in total control. Smarten up people, before its too late.\nThere should be a negative sum of celebration over this, but most will dance and howl, while all along they are helping to cement their own demise. If they do it here, they can do it everywhere. It's the brownshirt culture rounding the bend, except the \"nazis\" aren't the ones the MSM tell you they are, it's the establishment that they are concealing. I used to think this was tinfoil hat thinking, but now, it's looking more like the apparent upcoming reality. They've got us divided through politics, race and gender, so even modicums of civility between Americans is difficult or impossible. If we let them turn the corner, and seize this kind of power, we are truly doomed...Peace and love my fellow Americans...",
            "title_similarity": "0.5002292",
            "sentiment_compound": 0.9414
        },
        {
            "id": "h70svzy",
            "score": -10,
            "text": "I got the vaccine and “did my part.” Now we gotta go back to fucking masks again?! And the White House announced today that more lockdowns are potentially on the table. Anyone else regret voting for Biden? I hated Trump but I don’t care who runs in 2024, I’m voting Republican next time around and I’m voting Republican in 2022 to hopefully flip my state back to Red in the senate",
            "title_similarity": "0.53311473",
            "sentiment_compound": 0.7186
        },
        {
            "id": "h6z8zal",
            "score": 20,
            "text": ">We have thousands of immigrants with COVID crossing our boarders and Speaker Pelosi wants us to wear masks in the People's House?\n\nFrom the video. It is a solid argument. Right up there with \"Your neighbor owns a dog and You think it's ok to shower 2x a day?\"",
            "title_similarity": "0.5190022",
            "sentiment_compound": 0.168
        },
        {
            "id": "h6zlc3k",
            "score": -22,
            "text": "But, but, I thought the vaccine worked??",
            "title_similarity": "0.1195683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z3qqf",
            "score": 33,
            "text": "Arrest them, charge them, jail them, and for their crimes before/on/after January 6th these traitors should then watch as the key gets tossed away.   One can only hope these enemies to the United States are held accountable for the actions that are akin to treason.",
            "title_similarity": "0.69124997",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6zekpz",
            "score": 2,
            "text": "they thrown their hands up and say \"I have no idea why people aren't taking the vaccine!!\"\n\n&#x200B;\n\nyes you do, exactly this fucking behavior. This selfish bullshit about masks. We now know you can still carry and transfer the virus to other people, even when vaccinated. I don't want that on my conscience, and I don't think you do either. However most of the GOP seems to be very  selfish and the exact opposite of empathetic.\n\n&#x200B;\n\nAre they next going to claim \"I have no idea why people are refusing to wear masks, i totally support them and always have!\"...\n\n&#x200B;\n\nfucking gop....",
            "title_similarity": "0.555563",
            "sentiment_compound": -0.8991
        },
        {
            "id": "h6zfa8e",
            "score": 3,
            "text": "Good I’m sick of republicans breaking all the damn rules!",
            "title_similarity": "0.6164859",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h6zleb1",
            "score": 2,
            "text": "There is no good reason why vaccinated individuals in a room with other vaccinated individuals need to wear masks",
            "title_similarity": "0.41222036",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h6zp0ye",
            "score": 4,
            "text": "WAAY over due.",
            "title_similarity": "0.038829874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zpa5a",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zygf9",
            "score": -2,
            "text": "Hey whatever .Uk this is another attempt of yours to create confusion and mistrust in the US.  How about you quit the clickbait and talking shit about things you know nothing about and let Americans figure it out without your lies? UK is supposed to be friends and allies, but this makes it seem like you’d rather be friends with Russia than the US.",
            "title_similarity": "0.5177751",
            "sentiment_compound": 0.8301
        },
        {
            "id": "h700av5",
            "score": 1,
            "text": "Let's go back to 1918 when they fined people for not wearing masks.\n\nhttp://imgur.com/gallery/3BxWR3g",
            "title_similarity": "0.6221486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h700n4f",
            "score": -5,
            "text": "Vaccinated people shouldn't worry about COVID right? At least not dying from it.",
            "title_similarity": "0.3132915",
            "sentiment_compound": 0.3412
        },
        {
            "id": "h700xdb",
            "score": 3,
            "text": "\"They can't arrest us all!\" - Lawmaker who ends up the only one arrested",
            "title_similarity": "0.4599055",
            "sentiment_compound": -0.3304
        },
        {
            "id": "h701ydz",
            "score": -2,
            "text": "Thank you Joe Biden, MY PREKEKIDENT, for getting this party started! Shadilay frens, have fun and be safe out there! 🐸",
            "title_similarity": "0.17279297",
            "sentiment_compound": 0.9083
        },
        {
            "id": "h702dm7",
            "score": -3,
            "text": "That's not ok",
            "title_similarity": "0.14480586",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h703psi",
            "score": -3,
            "text": "... What are these fucking manchildren doing?",
            "title_similarity": "0.35353142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70560j",
            "score": -3,
            "text": "Totalitarianism at its finest",
            "title_similarity": "0.13945326",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h706awx",
            "score": 3,
            "text": "Taze them if they resist. Ooooh please let me see this on the news.",
            "title_similarity": "0.45623899",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h706gv9",
            "score": 3,
            "text": "Given who the mask resisters are, I bet the Capitol police will have fun doing this task.",
            "title_similarity": "0.43665552",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h706w9w",
            "score": 4,
            "text": "Arrest them and fine them.",
            "title_similarity": "0.36511326",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h707gq3",
            "score": -3,
            "text": "You guys really are the genocidal breed. God speed.",
            "title_similarity": "0.19190326",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h709k2y",
            "score": -4,
            "text": "Antifa suspiciously silent on this one.\n\nSuspiciously silent in general actually I kinda forgot about them",
            "title_similarity": "0.2147691",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h70hut4",
            "score": 3,
            "text": "Or, we could actually make people get the Covid vaccine. If people don’t want to get it, then they should be excluded from all indoor activities, not further burdening fully vaccinated people.  The mask was the temporary band aid, until we got a real solution in place…….",
            "title_similarity": "0.46313453",
            "sentiment_compound": 0.304
        },
        {
            "id": "h70ib28",
            "score": -4,
            "text": "I'm pro-vaxx but fuck that",
            "title_similarity": "0.23665816",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h70uitb",
            "score": -2,
            "text": "Absolutely despicable.",
            "title_similarity": "0.164231",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70va2l",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70vo2j",
            "score": -4,
            "text": "Great. So the Democrats and waggle their fingers and the Republicans can wear their handcuffs like badges of honor. Both sides will be galvanized among their constituents while the country as a whole continues falling apart.",
            "title_similarity": "0.57735103",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h715hf0",
            "score": 4,
            "text": "As of 2018, about 700,000 people have died of HIV/AIDS in the U.S. since the beginning of the HIV epidemic, and nearly 13,000 people with AIDS in the United States die each year.\n\nCovid deaths since 2020? 612,519.\n\n[https://www.cdc.gov/hiv/policies/law/states/exposure.html](https://www.cdc.gov/hiv/policies/law/states/exposure.html)\n\n\"...specific laws that criminalize or control behaviors that can potentially expose another person to HIV.\"\n\nCovid is more deadly and transmissible than HIV...\n\nWhy do we tolerate the unvaccinated?!",
            "title_similarity": "0.4628666",
            "sentiment_compound": -0.7877
        },
        {
            "id": "h71j568",
            "score": -4,
            "text": "If the vaccine works…?\n\nWay to assure the unvaxxed to get it!  Great example Nancy.",
            "title_similarity": "0.27666968",
            "sentiment_compound": 0.7777
        },
        {
            "id": "h71kzpp",
            "score": -3,
            "text": "While I m in favor of everyone masking up, going as far as arresting them is going overboard. I don't support this at all. And I think liberals supporting these measures is priming them for even more authoritarian police state in the future. Don't fall for this just cause you hate republicans.",
            "title_similarity": "0.5979766",
            "sentiment_compound": -0.092
        },
        {
            "id": "h71m6tk",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h71mgtk",
            "score": -3,
            "text": "They will arrest no one. There is no law and order anymore. It’s a free for all ladies and gentlemen.",
            "title_similarity": "0.36611533",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h71w0oh",
            "score": -4,
            "text": "Well fauci and the democrats steadily telling the public that the vaccines won't protect them and they'll still have to wear masks sure isn't going to persuade anyone to get vaccinated",
            "title_similarity": "0.5582704",
            "sentiment_compound": 0.2996
        },
        {
            "id": "h71xuz8",
            "score": -2,
            "text": "Arrest pissloci",
            "title_similarity": "0.52355474",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zpb7d",
            "score": -12,
            "text": "Capitol Police also followed Bowser, let rioters off the bus, and lied about Nancy Pelosi being offered 10,000 troops 6x and denying them every time.\n\n&#x200B;\n\nr/politics \\- You are the epitome of what's wrong with this nation. \n\n&#x200B;\n\nGet followers. Tell the followers this and that. The followers do not explore deep enough and you've just earned your \"victims\".\n\n&#x200B;\n\nDon't believe everything you hear, see, read, etc. Take CNN as an example. Now take CNN and apply there strategy to r/Politics. Catching on?\n\n&#x200B;\n\nEveryone, and I mean EVERYONE has the power to look deep enough to find the truth. If you find it and you ignore it, it will catch up.\n\nI suggest you start talking about Biden regime and his incoherent sentences. Or maybe talk about  Iran, Russia, and China teaming up- Biden cutting down US pipeline to Germany and allowing Russia's pipeline. Or maybe talk about the 4 years of \"RUSSIA RUSSIA RUSSIA\" hoax spread from Democratic leaders.\n\nSpeak  truthfully or not at all. Jut wanted to remind you how obvious your bias is. Its like the hedge funds with GME and AMC. We all see it, but you continue anyways.\n\n&#x200B;\n\n&#x200B;\n\nReally, im just asking you to cover the important issues instead on continuing to stir the pot.",
            "title_similarity": "0.6723483",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6z3rwl",
            "score": 78,
            "text": "I agree with this however, I am just awaiting the \"martyrs\" that get propped up by the GQP because of this.",
            "title_similarity": "0.3983067",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6z0uqd",
            "score": 234,
            "text": "Is this when the context of “fuck around and find out” comes into play?",
            "title_similarity": "0.2885008",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6z35km",
            "score": 5,
            "text": "This makes sense. We wouldn't let someone with HIV go around infecting people freely.",
            "title_similarity": "0.36895537",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6z41qt",
            "score": 4,
            "text": "Good. Finally.",
            "title_similarity": "-0.11432639",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6z4uqp",
            "score": 4,
            "text": "This is just like the holocaust! - Dipshit Boebert",
            "title_similarity": "0.31949842",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h6zq4es",
            "score": 4,
            "text": "I am not a lawyer but this seems of questionable legality. The U. S. [constitution](https://constitution.congress.gov/browse/essay/artI-S6-C1-1-2/ALDE_00001047/) protects senators and representatives:\n\n> They shall in all Cases, except Treason, Felony and Breach of the Peace, be privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same . . .\n\nThe [law referred to](https://code.dccouncil.us/dc/council/code/sections/22-3302.html) says that unlawful entry in a public  building is a misdemeanor. \n\nI’d love it if a lawyer could weigh in.",
            "title_similarity": "0.63991696",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h6zr8hw",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zrsul",
            "score": -5,
            "text": "Pelops I on the warpath and power hungry.",
            "title_similarity": "0.3724901",
            "sentiment_compound": 0.0
        },
        {
            "id": "h701jb7",
            "score": -2,
            "text": "Arrest the vaccinated too\n\nThey still spread it!\n\nNO ONE SHOULD BE THERE \n\nWe MUST protect the vulnerable from this absolutely deadly disease that definitely didn’t come from a lab",
            "title_similarity": "0.6132648",
            "sentiment_compound": -0.3016
        },
        {
            "id": "h708iky",
            "score": -3,
            "text": "Just let people who want to wear them wear them and the ones who don’t shouldn’t have to. Idc it doesn’t bother me just like the vaccine if you want it get it, if not don’t.",
            "title_similarity": "0.22266878",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h70ebwy",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h70en7h",
            "score": -5,
            "text": "Uh-oh! Looks like democrats are going to have to actually face consequences if they don’t live by the same rules they force other people to live by.",
            "title_similarity": "0.55562985",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h70fi9f",
            "score": -3,
            "text": "Highly illegal",
            "title_similarity": "0.29189998",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h70h4yn",
            "score": 4,
            "text": "GOOD!\n\nfucking assholes",
            "title_similarity": "0.12604035",
            "sentiment_compound": -0.1906
        },
        {
            "id": "h70iiep",
            "score": 4,
            "text": "It's Pelosi's house now. Put on a mask or get out.",
            "title_similarity": "0.44647408",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70jhhe",
            "score": -4,
            "text": "Why is there a mask mandate???",
            "title_similarity": "0.1868387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h711yak",
            "score": -5,
            "text": "This is pretty sad",
            "title_similarity": "0.17960432",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h714tb6",
            "score": -3,
            "text": "Those of you who voted for Biden...wait...that's fake news.",
            "title_similarity": "0.46377724",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h71ntdc",
            "score": -5,
            "text": "Show me that law. I’d like to see it. Sounds like something a dictator would say.",
            "title_similarity": "0.43896866",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6z56rg",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zajxg",
            "score": 5,
            "text": "Now I'm afraid to leave the couch. The FOMO is thick in the air.\n\nHoney, bring me an Arnold Palmer & all the  Cheetos, will ya'?",
            "title_similarity": "0.36593568",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h6zbt96",
            "score": 4,
            "text": "No, they are SPECIFICALLY order [NOT to arrest lawmakers](https://twitter.com/RepKatCammack/status/1420727107735461888), or noncompliant staff accompanied by lawmakers.  \n\nRead the order, and write an honest headline! Disappointed in you, Independent.",
            "title_similarity": "0.62203646",
            "sentiment_compound": 0.367
        },
        {
            "id": "h6zfs5z",
            "score": 5,
            "text": "Only in this moronic country are masks even an issue. This country is so dumb",
            "title_similarity": "0.34108326",
            "sentiment_compound": -0.863
        },
        {
            "id": "h6zr07d",
            "score": -5,
            "text": "Ridiculous and despotic, specially if the mask mandate doesn't include ANY standard for the facemasks.",
            "title_similarity": "0.47968584",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h6zr0du",
            "score": -5,
            "text": "Where’s this sentiment at the southern border?",
            "title_similarity": "0.13057658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zrnpc",
            "score": -5,
            "text": "This is only going to embolden the right wing. This country is too far gone. Thanks Obama!",
            "title_similarity": "0.3525643",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h6zscq9",
            "score": -6,
            "text": "We all saw how well capitol \"police\" did their jobs back in January, im sure they can be depended upon to do them just as effectively in this case. Which is to say, not at fucking all.",
            "title_similarity": "0.47084165",
            "sentiment_compound": 0.743
        },
        {
            "id": "h6zttfr",
            "score": -3,
            "text": "Why do vaccinated members of Congress need a mask when the CDC actually didn’t cite any data regarding transmission from vaccinated people to others. Fauci also said there is no data regarding viral loads of vaccinated people and transmission. If the unvaccinated wear masks what’s the issue? Or hey maybe everybody can just get vaccinated.",
            "title_similarity": "0.52861893",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6zv46t",
            "score": -4,
            "text": "Wow. This is a bit much. Just offer testing before anyone can walk in. Much cheaper and effective. Especially if one is vaccinated, the government is going against anoth governmental agencies guidelines to say they will arrest you. If they didn’t arrest the idiots trespassing on Jan. 6, I doubt they’re going to arrest someone over a fucking mask. Proof of vaccination and daily testing, it’s that easy. They should be testing anyway, even with the vaccination as one can still be infected and spread it with Delta being over 80% of all cases worldwide now.",
            "title_similarity": "0.50253475",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6zvrt7",
            "score": -5,
            "text": "No arrests are going to be made lol",
            "title_similarity": "0.29079872",
            "sentiment_compound": 0.6377
        },
        {
            "id": "h700j23",
            "score": 3,
            "text": "Amen. Enough of this whacked out anti mask Q shit.",
            "title_similarity": "0.32023123",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h701ren",
            "score": -4,
            "text": "When a illegal regime doing illegal regime things.",
            "title_similarity": "0.4018402",
            "sentiment_compound": -0.802
        },
        {
            "id": "h705azv",
            "score": -5,
            "text": "But I thought the vaccine worked super duper well?",
            "title_similarity": "0.17193346",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h706h2w",
            "score": 7,
            "text": "Pass the popcorn!",
            "title_similarity": "0.054713957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71crja",
            "score": 5,
            "text": "But yet they wear pants and shirts and shoes with no objection… it’s a piece of fabric, get over it.",
            "title_similarity": "0.03746221",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h71k3g5",
            "score": -5,
            "text": "Commie America is here. Conform or be cast out. America has fallen.",
            "title_similarity": "0.4399467",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h71pv7e",
            "score": -4,
            "text": "Look at me with a strait face and tell me that this policing will not lead to tyranny",
            "title_similarity": "0.3346842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71vdiz",
            "score": -5,
            "text": "This is straight tyrannical",
            "title_similarity": "0.29874828",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h725us9",
            "score": -5,
            "text": "What laws did they break? Mandates aren’t laws tho",
            "title_similarity": "0.4475175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z0rzu",
            "score": 78,
            "text": "This is what happens when you don't give a shit about them on 1/6 and also are antivaxx... same people...",
            "title_similarity": "0.39945212",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h6zkefy",
            "score": 5,
            "text": "Hell yeah, lock these murdering bastards up.",
            "title_similarity": "0.5844219",
            "sentiment_compound": -0.9136
        },
        {
            "id": "h6zroa3",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zud2l",
            "score": -5,
            "text": "Can’t do it to the people though. As long as your little power trip stays in the government, we won’t have any problems",
            "title_similarity": "0.38063163",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6zvw8f",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zvxa4",
            "score": -6,
            "text": "Sieg heil! 🤚",
            "title_similarity": "0.08530927",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h6zwv42",
            "score": -6,
            "text": "This can be challenged in a reasonable court.",
            "title_similarity": "0.16826692",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h6zxbzk",
            "score": 6,
            "text": "These people are supposed to represent us and lead by example and instead they need to be babysat like kindergartners.",
            "title_similarity": "0.29982126",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h704xka",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h709hpk",
            "score": -6,
            "text": "Meanwhile the Biden administration is refusing to release COVID data from White House staffers.",
            "title_similarity": "0.6427177",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h70cja4",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h70k3ew",
            "score": 7,
            "text": "Wrong, the actual memo states that those (other than actual members of Congress) without masks will be asked to leave, then if they REFUSE, they would be arrested.  No different than what a private business would do.",
            "title_similarity": "0.72948456",
            "sentiment_compound": -0.8893
        },
        {
            "id": "h7129mq",
            "score": -7,
            "text": "And, so it starts.  Next, forcing people off of Medicare, Medicaid, SNAP, and other programs.\n\nSome \"free government.\"  Might as well admit Biden is a communist and get it over with.  \n\nPersonally, I wouldn't set foot in that place.  Very paranoid and hate filled.",
            "title_similarity": "0.69277394",
            "sentiment_compound": -0.0146
        },
        {
            "id": "h71qr9v",
            "score": -6,
            "text": "And soon they'll be coming for the rest of us. This is truly terrifying",
            "title_similarity": "0.40833217",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h7223ol",
            "score": -6,
            "text": "What science is behind making vaccinated wear a mask?\n\nThe 1/10000 chance of infection, the 1/23000 chance of spreading it, or the 1/30000 chance of becoming hospitalized?\n\nHow about the lie that the delta variant is the most deadly, 35 deaths per 10000 cases in NY?   99% of which are among unvaccinated?\n\nIf someone wants to follow the cult and wear a mask (or two) while vaccinated, go ahead but leave the rest of us sane people the frack alone.",
            "title_similarity": "0.5489881",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h7237hd",
            "score": -5,
            "text": "Haha when the left mask slips and you see that they thirst for authoritarianism against their political opponents. It's quite funny. This is why socialism won't work folks because you're in denial of your true motives",
            "title_similarity": "0.53567654",
            "sentiment_compound": 0.8399
        },
        {
            "id": "h727iak",
            "score": -5,
            "text": "One question... where did all the people go who wanted less of an authoritarian police regime? We're gonna arrest people over not putting a piece of cloth over their face?\n\nSetting a great precedent guys. Petty arrests are a very dangerous thing to support. We don't need more barely needed arrests of peaceful citizens and chances for police brutality and abuse than we already have.",
            "title_similarity": "0.672098",
            "sentiment_compound": -0.879
        },
        {
            "id": "h6z54nb",
            "score": 72,
            "text": "I'm super excited to watch this shit escalate",
            "title_similarity": "0.15561737",
            "sentiment_compound": 0.2617
        },
        {
            "id": "h6zpc39",
            "score": -23,
            "text": "Much like a nazi state thanks liberals",
            "title_similarity": "0.20448643",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6zd3xb",
            "score": 9,
            "text": "Any video of our favorite GOP skidmarks getting placed in cuffs and loudly resisting arrest would break social media. Hundreds of millions of views.\n\nImagine Cruz/McCarthy/Mitch/mjt/Boebert etc etc \n\nThe memes alone….",
            "title_similarity": "0.677359",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6zhwyo",
            "score": 7,
            "text": "They better watch out the Capitol Police are already not happy with most of the GOP delegation in congress. Lock em Up.",
            "title_similarity": "0.8430709",
            "sentiment_compound": -0.0253
        },
        {
            "id": "h6zqgas",
            "score": -5,
            "text": "mandates are now laws?  \n\nSo I guess the Communist parties just Mandate everything!\n\n It's starting to make sense!",
            "title_similarity": "0.42328545",
            "sentiment_compound": 0.508
        },
        {
            "id": "h6zu09s",
            "score": -6,
            "text": "And the 50 or so Democrats from Texas that were mask less are setting a great example, but that’s ok they said they just had bad judgment, wow",
            "title_similarity": "0.4066678",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h6zv5p8",
            "score": -7,
            "text": "The Dems here are straight up tar tar. \n\nPelosi wore a mask and is vacced, now she has covid. Congratulations democrats, y'all are stupid.",
            "title_similarity": "0.46541095",
            "sentiment_compound": 0.34
        },
        {
            "id": "h700sxh",
            "score": -7,
            "text": "Holy shit this is not ok. Can’t believe stuff like this is happening in our day and age. And this is just the beginning, guaranteed",
            "title_similarity": "0.3821445",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h709ccm",
            "score": 7,
            "text": "Cannot wait to see space laser lady get arrested for punching a cop when asked to put a mask on.",
            "title_similarity": "0.6268769",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70g9sq",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70kwnk",
            "score": 7,
            "text": "Now if we can just get them to arrest the senators that helped the insurrectionists on Jan 6th.",
            "title_similarity": "0.7192849",
            "sentiment_compound": -0.34
        },
        {
            "id": "h70vjvr",
            "score": -7,
            "text": "We'll see, Nancy is usually the first one to break the mask rule. Might not apply to her though since she's (D)ifferent.",
            "title_similarity": "0.42084932",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70wi9g",
            "score": -7,
            "text": "The libs go from ACAB, to celebrating unnecessary arrests and fines.",
            "title_similarity": "0.5705962",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h719rc8",
            "score": 7,
            "text": "It'd be nice if they could first go ahead and arrest those lawmakers who sponsored and planned the Jan. 6th terrorist attack on the Capitol to overturn legitimate election results.",
            "title_similarity": "0.71996164",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h71hasf",
            "score": -7,
            "text": "Gestapo tactics. No one should be forced. Before long they will be trying to force us all. This is America we have rights",
            "title_similarity": "0.5511856",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h6ztw2x",
            "score": -9,
            "text": "There has yet to be an RCT showing that masks have any effectiveness against coronavirus. So much for the party of science.",
            "title_similarity": "0.3635489",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6zvnb6",
            "score": -9,
            "text": "Arrested for what? \nA mandate is not a law. \nCan we all see who the wanna be fascists are now?",
            "title_similarity": "0.53534454",
            "sentiment_compound": -0.644
        },
        {
            "id": "h6zw5di",
            "score": -9,
            "text": "Total hypocrisy and control issues w/the left!  Under  the Constitution and the Bill of rights, politicians do not have the right to stifle my freedoms!  Neither does anyone else in this Country.  If the liberals like Government control so much, then they should move to a Communist Country and enjoy their wishes.  However, all of you, can mind your own business and stay the heck out of mine!",
            "title_similarity": "0.53036654",
            "sentiment_compound": 0.8547
        },
        {
            "id": "h702h1x",
            "score": -8,
            "text": "Masks on fully vaccinated individuals is pure stupidity, if you’re vaccinated and still scared of this virus, you may need help adapting to society.   The goal posts have been moved over and over and we just keep letting it happen.  You comply because you want it to end, but it’s your compliance why it may never end",
            "title_similarity": "0.49777114",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h702idq",
            "score": -8,
            "text": "still circle-jerking over masks?",
            "title_similarity": "0.26664823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70yzvu",
            "score": -8,
            "text": "We are stepping into communism boys.",
            "title_similarity": "0.35911313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h710s7v",
            "score": -8,
            "text": "So much for the vaccine being trusted. Looks like we were lied to again. Even with the vaccine, mask up. How long will you continue to trust these people?",
            "title_similarity": "0.39215714",
            "sentiment_compound": 0.743
        },
        {
            "id": "h72a5in",
            "score": -8,
            "text": "Liberals have lost their minds",
            "title_similarity": "0.3440164",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6zsj16",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zsr7w",
            "score": -7,
            "text": "Just one more piece of evidence that this isn’t about “the science” but rather about control.",
            "title_similarity": "0.27292907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zsz75",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zuof1",
            "score": -10,
            "text": "Our Chinese owners only want faceless masses that way they can keep things depersonalized",
            "title_similarity": "0.4254966",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6zvx9b",
            "score": -10,
            "text": "This mask trip is as far as the nazi left can go . They are just mad",
            "title_similarity": "0.54557073",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h70qoli",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h700vv7",
            "score": -10,
            "text": "Being arrested for not wearing a mask is very unreasonable and tyrannical",
            "title_similarity": "0.57068896",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h701y2j",
            "score": -10,
            "text": "1984",
            "title_similarity": "0.08864249",
            "sentiment_compound": 0.0
        },
        {
            "id": "h704pww",
            "score": 9,
            "text": "Folks, it's a public health issue. It's safety. Also, this is clearly not the go-to tactic. The GOP refuse to follow such a simple and harmless rule to the point that it has come to this. What else can they do? How many times can you ask? The GOP literally can't just do whatever the hell they want. THEY have turned an otherwise minor issue into a big, petty mess. THEY did this to THEMSELVES.",
            "title_similarity": "0.5216783",
            "sentiment_compound": -0.5661
        },
        {
            "id": "h70mn28",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70mqha",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zt6f0",
            "score": -10,
            "text": "Nancy Pelosi is a tyrant, just like Joe Biden and his handlers.",
            "title_similarity": "0.59994084",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6zu73s",
            "score": -11,
            "text": "Another perfect day in our North Korean paradise!",
            "title_similarity": "0.019581545",
            "sentiment_compound": 0.8478
        },
        {
            "id": "h706jiv",
            "score": 10,
            "text": "i need a live stream of lauren boebert's arrest please and thank you",
            "title_similarity": "0.4972487",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6z2cga",
            "score": 916,
            "text": "Thank you. About fucking time. \n\nI’m sure Capitol police will be more than happy because the overlap between insurrection supporting Congressional officials and anti-maskers is quite large.",
            "title_similarity": "0.50307286",
            "sentiment_compound": 0.8988
        },
        {
            "id": "h6zs0df",
            "score": -12,
            "text": "Fascism in America coming to a City near you. Starting with all Liberal states. Lol.",
            "title_similarity": "0.39245322",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h70gfno",
            "score": 11,
            "text": "Instead of arresting the Congress person or Senator, who will only use an arrest to fund raise “to beat the libs” just take away their privileges…\n\nNo more free or reserved parking at the Capital.\n\nno lawmaker only elevator, take the stairs with the rest of the plebes!\n\nNo more free gym, your banned for a year from private gym at the Capital building.\n\nNo more free hair stylist or barber at Capital. Go to Supercuts after work.\n\nNo more limo rides for free or taxpayer dime to and from work. Work laye get a limo home..Take the bus Gus!\n\nNo more white linen and silver service free lunches,  go to McDs blocks away..\n\nNo more free healthcare and 24 hour on call Dr or medical workers that come to your office. Make an appointment 20 miles away or go wait at the ER!\n\nDo this and everyone of them will be wearing masks for fear of losing perks..",
            "title_similarity": "0.6240245",
            "sentiment_compound": -0.983
        },
        {
            "id": "h70q9w8",
            "score": -11,
            "text": "Fascism on the rise",
            "title_similarity": "0.21619143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70zs40",
            "score": 13,
            "text": "Super-tough, brave, bad ass, skull cracking GQP can't be seen wearing a mask during a resurging (thanks to them) pandemic.  Its harsh fibers against their face brings tears to their eyes. \n\nWhat a ludicrous self image they have.",
            "title_similarity": "0.5645205",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6z0kw5",
            "score": 982,
            "text": "So if certain idiots like greene or boebert refuse to wear one, they can get arrested?",
            "title_similarity": "0.61437964",
            "sentiment_compound": -0.1082
        },
        {
            "id": "h6z0poy",
            "score": 1689,
            "text": "Lock 'em up!",
            "title_similarity": "0.40162143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z0rrg",
            "score": 46,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6z1wke",
            "score": 728,
            "text": "I'm fascinated by the mental gymnastics the current GQP mind has to perform when navigating issues like these. The concept of a mask mandate has been long criticised but if it's enforceable then that's where the police come in. The consequence of this is that those who 'back the blue' or claim to represent law and order must follow this or admit that protesting against the law or enforcement itself is entirely legitimate. I know this can't be admitted to because when ReTrumplicans compare January 6th to protests last year, they always forget to mention lockdown protestors invading state capitals.",
            "title_similarity": "0.6675691",
            "sentiment_compound": -0.5919
        },
        {
            "id": "h6zodwz",
            "score": -18,
            "text": "So Jan 6th was the Democrats Reichstag fire, and now the capital police are their brown shirts?",
            "title_similarity": "0.528316",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6z22hn",
            "score": 124,
            "text": "> A spokesman for Ms Pelosi told the outlet she does not control the US Capitol police.",
            "title_similarity": "0.66002214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z3rim",
            "score": 210,
            "text": "I'm almost fresh outta hope, but this would be nice if they ACTUALLY enforce it.",
            "title_similarity": "0.18571463",
            "sentiment_compound": 0.7203
        },
        {
            "id": "h6z1d6q",
            "score": 22,
            "text": "This is called the Asshole Tax.",
            "title_similarity": "0.35412398",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zhsi0",
            "score": 69,
            "text": "Somebody quick go bait Boebert and mtg on twitter into defying the mandate.",
            "title_similarity": "0.5085614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z399z",
            "score": 3401,
            "text": "> \"I had Covid, I’ve had two vaccinations, I’m washing my hands, I’m even wearing my mask inside the chamber, but I’m not going to wear it anywhere else. So Madam Speaker, come and get me,\" Mace said.\n\nKinda sad that this, compared to other \"people\" in the GOP, is almost rational.",
            "title_similarity": "0.49303883",
            "sentiment_compound": -0.5734
        },
        {
            "id": "h6z1j87",
            "score": 9158,
            "text": "every one of those capitol police officers know two things today - who voted this week against giving them the budget they need and what the reps think of the hearing on Tuesday\n\nedit: thanks for gold",
            "title_similarity": "0.63097996",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6zc3o3",
            "score": 8355,
            "text": "From the article:\n\n> Capitol police chief Thomas Manger **ordered officers to report any members of Congress who refuse to wear a mask,** warning they would be subject to arrest for unlawful entry under DC Code 22-3302.\n\nEmphasis mine.\n\nSeems a bit different than what the article head line says.  Ordered to arrest versus ordered to report.",
            "title_similarity": "0.8884197",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h6z0o8p",
            "score": 7,
            "text": "Woo-hoo!",
            "title_similarity": "-0.015063964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z4b5w",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6z4fby",
            "score": 19,
            "text": "Some of them would love that. They get to act like a martyr and fill their campaign coffers some more.",
            "title_similarity": "0.36864978",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h6z63ie",
            "score": 2,
            "text": "I can watch Massie get arrested?\n\nThat sounds super gratifying.",
            "title_similarity": "0.41690338",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h6z6u92",
            "score": 3,
            "text": "Likely because this is the Independent the headline is not going to be entirely accurate. I can't read it all but it seems like it's most of a threat to maybe arrest them than an actual declaration they'll be arrested.",
            "title_similarity": "0.5039609",
            "sentiment_compound": -0.8749
        },
        {
            "id": "h6z7r96",
            "score": 2,
            "text": "Lock em up!",
            "title_similarity": "0.39964452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z7scw",
            "score": 6,
            "text": "This should be interesting.",
            "title_similarity": "-0.07597719",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6z7t3l",
            "score": 3,
            "text": "About time!!!!",
            "title_similarity": "-0.032926172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z80k9",
            "score": 5,
            "text": "Thank fucking god, it's about time people get tough with these idiots.",
            "title_similarity": "0.4191832",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h6z81o9",
            "score": 3,
            "text": "Please please please let me see MTG and Boebert as the first ones to go",
            "title_similarity": "0.15397121",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h6z8nan",
            "score": 2,
            "text": "About goddamned time!",
            "title_similarity": "0.06992738",
            "sentiment_compound": -0.4753
        },
        {
            "id": "h6z8tni",
            "score": 3,
            "text": "Oh boy, shits about to get wild lol",
            "title_similarity": "0.27266628",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h6z8uce",
            "score": 1,
            "text": "These narcissistic psychopaths never grew up and neither did their voters. You can’t run a hot dog stand with that level of incompetence and immaturity, much less a country. Start requiring psychological testing before you can run for federal office.",
            "title_similarity": "0.58731496",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6z91ge",
            "score": 1,
            "text": "are things heating u\\\\p?",
            "title_similarity": "0.12149062",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6z9hu7",
            "score": 7,
            "text": "Think they'll be able to tack a resisting arrest charge onto it?",
            "title_similarity": "0.51597345",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6za5qw",
            "score": 1,
            "text": "I preemptively want to send Taylor Greene and Boebert to the moon for the tantrums they're about to throw.",
            "title_similarity": "0.41034666",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6zac9d",
            "score": 3,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zaimh",
            "score": 2,
            "text": "The only police brutality I can get behind.",
            "title_similarity": "0.36389005",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h6zamot",
            "score": 2,
            "text": "Do it!",
            "title_similarity": "-0.027552504",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zaqw7",
            "score": 2,
            "text": "How many of these offenders bring their guns into the chamber?",
            "title_similarity": "0.59846705",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h6zb5wq",
            "score": 3,
            "text": "\"back the blue!\"\n\n\"No! Not like that!\"",
            "title_similarity": "0.22306378",
            "sentiment_compound": -0.4563
        },
        {
            "id": "h6zbhwl",
            "score": 1,
            "text": "Lock those bastards up!!!!",
            "title_similarity": "0.5374845",
            "sentiment_compound": -0.7326
        },
        {
            "id": "h6zbim1",
            "score": 1,
            "text": "This ought to be fun.  Can they deploy tasers for non-compliant members?",
            "title_similarity": "0.30948508",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h6zc0n9",
            "score": 2,
            "text": "Ah shit, i read the first part of this and thought pelosi was getting serious about jan 6. Oh well. I wish they enforced literally any other rule as hard as this one.",
            "title_similarity": "0.4540463",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6zc27d",
            "score": 2,
            "text": "Wonder how the law and order party will react?",
            "title_similarity": "0.40251788",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6zc4yl",
            "score": 2,
            "text": "Awww yeah… finally!",
            "title_similarity": "-0.063699074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zca34",
            "score": 2,
            "text": "I can't wait to see these fuckers get arrested.  It'll be glorious.",
            "title_similarity": "0.41362888",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6zcmrm",
            "score": 2,
            "text": "Oh this'll be good...",
            "title_similarity": "-0.14782354",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zcr9t",
            "score": 3,
            "text": "Arrest them all.",
            "title_similarity": "0.55957544",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zcttg",
            "score": 1,
            "text": "Woohooo",
            "title_similarity": "-0.064673275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zcy1f",
            "score": 1,
            "text": "MGT in the Pokey",
            "title_similarity": "0.12701857",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zd307",
            "score": 2,
            "text": "Put them in a full spit hood, just in case.",
            "title_similarity": "0.2551816",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zd8ti",
            "score": 2,
            "text": "lock them all up yes yes yes",
            "title_similarity": "0.4817106",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h6zdo9e",
            "score": 3,
            "text": "Now THIS is the level of spicy I ordered",
            "title_similarity": "0.109292075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zdxhs",
            "score": 3,
            "text": "About time",
            "title_similarity": "-0.07136808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zea82",
            "score": 2,
            "text": "The cons will not be happy about this. I can already hear the cries of a partisan witch hunt.",
            "title_similarity": "0.579127",
            "sentiment_compound": -0.8019
        },
        {
            "id": "h6zeama",
            "score": 1,
            "text": "Marjorie Taylor Greene is on my bingo card…",
            "title_similarity": "0.1541825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zefz9",
            "score": 2,
            "text": "what's the venn diagram look like for this group of anti-maskers and congresspeople that were just saying 1/6 is Pelosi's fault?\n\noh, it's a fucking circle of hypocrisy? i thought so.",
            "title_similarity": "0.6588173",
            "sentiment_compound": -0.1431
        },
        {
            "id": "h6zeqoo",
            "score": 1,
            "text": "Great news I’m loving this turn of the worms.",
            "title_similarity": "0.026736487",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h6zesy3",
            "score": 2,
            "text": "Please, oh please can we see Greene and Boebert being hauled out in cuffs?",
            "title_similarity": "0.44371936",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6zf4jv",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h6zf8gl",
            "score": 1,
            "text": "So arrest republicans. \n\n*bender laughing in the background*",
            "title_similarity": "0.3948536",
            "sentiment_compound": 0.1298
        },
        {
            "id": "h6zfc27",
            "score": 2,
            "text": "We’re gonna have a bunch of people using the arrest politically",
            "title_similarity": "0.63981485",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zfvt2",
            "score": 1,
            "text": "I’ll believe it when I see it",
            "title_similarity": "0.04181487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zfwrr",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zfxub",
            "score": 1,
            "text": "It’s about time - lock up the scum.",
            "title_similarity": "0.3960634",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zg1bb",
            "score": 1,
            "text": "lmao i've been in thomas massie's home-- talk about little man syndrome. massive cache of weapons (of dubious legality) and probably hit his wife in the past. SAD!\n\nalso, guarantee he's been vaccinated but doesn't want his troglodyte supporters to figure THAT out.",
            "title_similarity": "0.6425725",
            "sentiment_compound": 0.3904
        },
        {
            "id": "h6zgnka",
            "score": 5,
            "text": "It’s got them not leaving when asked to. They get asked to wear a mask. They say no. They get asked to leave. They say no. They then get trespassed. You can imagine the spin taking place in right wing spheres.",
            "title_similarity": "0.48603988",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h6zgo4a",
            "score": 3,
            "text": "I imagine that, given the anti-maskers' collective response to the 1/6 hearing on Tuesday, that the Capitol Police will have no problems enforcing this particular order. They know who appreciates them and cares about their safety and who is a cowardly weasel who claims the terrorists that made him cry are actually \"just tourists\" because it's politically expedient for him to do so.",
            "title_similarity": "0.5630836",
            "sentiment_compound": 0.1426
        },
        {
            "id": "h6zgpec",
            "score": 2,
            "text": "Oh hell yeah",
            "title_similarity": "-0.027378432",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h6zgvhr",
            "score": 1,
            "text": "good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zhbyc",
            "score": 2,
            "text": "I’m sure the capitol police will take NO joy in this. \n\nEspecially since all the people who will not be wearing masks are the people who just voted to defund them after letting them get attacked on Jan 6 and then said it was nothing.",
            "title_similarity": "0.68075347",
            "sentiment_compound": -0.671
        },
        {
            "id": "h6zhk7g",
            "score": 1,
            "text": "I bet they will enjoy that.",
            "title_similarity": "-0.07706771",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6zhqez",
            "score": 1,
            "text": "Oh yeah! Finally! That’s what I’ve been waiting for finally showing some teeth rather then laying on their backs",
            "title_similarity": "0.18997577",
            "sentiment_compound": 0.3786
        },
        {
            "id": "h6zhqor",
            "score": 2,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zhwcg",
            "score": 1,
            "text": "congress lawmakers? maybe you meant \"congressional lawmakers\"?",
            "title_similarity": "0.40554327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zi1bj",
            "score": 4,
            "text": "1st up, MTG",
            "title_similarity": "0.09310681",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zirc1",
            "score": 6,
            "text": "Can't wait to hear the blue lives matter folks malign the police (again) with no self awareness whatsoever",
            "title_similarity": "0.58131444",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6ziza7",
            "score": 2,
            "text": "From Missouri here, SHOW ME ! (and I am all for this)",
            "title_similarity": "0.18438536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zj4nr",
            "score": 6,
            "text": "I want to see Bobert screaming \"I DEMAND TO SPEAK TO YOUR MANAGER!\" while being tased.",
            "title_similarity": "0.55640054",
            "sentiment_compound": -0.5893
        },
        {
            "id": "h6zjpta",
            "score": 2,
            "text": "If someone would arrest Ted Cruz I would be so happy",
            "title_similarity": "0.2799106",
            "sentiment_compound": 0.5173
        },
        {
            "id": "h6zk2c4",
            "score": 2,
            "text": "Don't do that. Don't give me hope.",
            "title_similarity": "0.23307067",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h6zk6t5",
            "score": 4,
            "text": "About time!\n\nRules for thee my ass!",
            "title_similarity": "0.18411237",
            "sentiment_compound": -0.6229
        },
        {
            "id": "h6zka55",
            "score": 7,
            "text": "You can't hear it through the screen but I am applauding I can't wait to see this in action.",
            "title_similarity": "0.14113417",
            "sentiment_compound": 0.631
        },
        {
            "id": "h6zkhao",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zkiv5",
            "score": 3,
            "text": "This will be fun, how many people will expose themselves to be entitled pricks.",
            "title_similarity": "0.36489522",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zkkrs",
            "score": 1,
            "text": "So what exactly happens if they do arrest a congress member? Do they sit in timeout for an hour? Seriously though…",
            "title_similarity": "0.6080097",
            "sentiment_compound": -0.5362
        },
        {
            "id": "h6zktx4",
            "score": 1,
            "text": " Nothing will come of this. No one will be arrested.",
            "title_similarity": "0.24045952",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h6zkuub",
            "score": 2,
            "text": "Please arrest Chip Roy, he is a disease-ridden fascist.",
            "title_similarity": "0.54158545",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6zkvom",
            "score": 3,
            "text": "Finally, this was what we had to do during the spanish flu.",
            "title_similarity": "0.26280606",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6zkwe1",
            "score": 1,
            "text": "Excellent!!!",
            "title_similarity": "-0.10552013",
            "sentiment_compound": 0.6784
        },
        {
            "id": "h6zkwqv",
            "score": 4,
            "text": "Lauren Bobert , Marjorie Taylor Greene , Matt Gaetz, Ted Cruz, Tom Bolton, plz fuck yourselves with noncompliance.",
            "title_similarity": "0.44270638",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6zkyqi",
            "score": 3,
            "text": "I can't wait for the video of the one of those anti-mask idiots being arrested and dragged out of the chambers by their feet.",
            "title_similarity": "0.6993249",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6zkzmg",
            "score": 1,
            "text": "It always comes back to the border.",
            "title_similarity": "0.11885652",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zl5lm",
            "score": 2,
            "text": "WOOHOO. Let's see some GOP get arrested.",
            "title_similarity": "0.5641408",
            "sentiment_compound": 0.2342
        },
        {
            "id": "h6zl8ot",
            "score": 5,
            "text": "Watch out, if enough hillbillies vote the GOP back into power Dems will be arrested for wearing a mask, not wearing a mask, or just not loving Trump as tenderly as they require. As with any power they get ahold of, they will abuse it.",
            "title_similarity": "0.7068144",
            "sentiment_compound": -0.8246
        },
        {
            "id": "h6zl956",
            "score": 1,
            "text": "Margie they are coming for ya girl",
            "title_similarity": "0.25794324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zlahb",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zlbvj",
            "score": 1,
            "text": "\"would be subject to arrest\"\n\nTell me when it actually happens.  We have a LOT of laws that make people \"subject to\" various penalties but the rich always seem to not be \"subject to\".",
            "title_similarity": "0.5993219",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6zlfe0",
            "score": 1,
            "text": "Now we also need to throw out of office those giving comfort to insurrectionists. (sec 3, Amendment 14) These people think the law doesn't apply to them as they have blatantly and openly supported insurrection against their oath to protect and defend the constitution.",
            "title_similarity": "0.67859316",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h6zlj37",
            "score": 1,
            "text": "This plays right into the hands of Marjorie Taylor Greene. Imagine the donations she’ll raise by tweeting a video of her in handcuffs perp walked out by the deep state",
            "title_similarity": "0.44898045",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6zljpc",
            "score": 3,
            "text": "Also a good way to round up those who helped facilitate the Jan 6 insurrection attempt at the same time.",
            "title_similarity": "0.34490836",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zlp1w",
            "score": 2,
            "text": "Lock enough of them up, and we can start passing laws again.",
            "title_similarity": "0.5168873",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zlpzs",
            "score": 2,
            "text": "This is the oldest Congress in history. I’d say this a safe move to ensure we don’t lose a chunk of our legislative branch because a few people are too stupid to be reasonable.\n\nDisclaimer: I just tested positive for Covid-19, and I had two shots of the Moderna vaccine back in May.",
            "title_similarity": "0.4578771",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h6zlqbh",
            "score": 2,
            "text": "Haha fuck em.",
            "title_similarity": "0.22654213",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6zlqhh",
            "score": 1,
            "text": "And when they start getting arrested, all these idiot GOPs will start crying about what persecuted victims they are, liberal fascism and every other whine they can dream up.",
            "title_similarity": "0.60897195",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h6zlrwt",
            "score": 1,
            "text": "So any bets on who the first congressman to refuse to mask up and get arrested will be? At least one is gonna do it on purpose so they can play martyr to their base.",
            "title_similarity": "0.6082921",
            "sentiment_compound": -0.3892
        },
        {
            "id": "h6zlwo2",
            "score": 1,
            "text": "Who’s going to be the first one? My money is on Marjorie Taylor Greene, and my close second is Lauren Boebert",
            "title_similarity": "0.20293152",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zm62d",
            "score": 3,
            "text": "It will be the group that is fond of saying \"Just comply with the police and you won't get shot\" who will be refusing to comply with the police on this.",
            "title_similarity": "0.5396755",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h6zm714",
            "score": 4,
            "text": "Oh boy, this is going to get really interesting really fast.\n\nI can already predict someone like Marjorie Taylor Greene getting physically aggressive against the police for asking her to wear a mask.",
            "title_similarity": "0.5710268",
            "sentiment_compound": 0.5984
        },
        {
            "id": "h6zm8ti",
            "score": 2,
            "text": "Gosh I'm sure the anti-vaxxers/maskers will comply with whatever the police say. 😏😏😏",
            "title_similarity": "0.39715588",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6zm9xo",
            "score": 2,
            "text": "I thought they couldn't arrest them?  The same reason why they still had to let them in with guns.   The constitutional amendment prevents interfering with a vote like not letting them in.",
            "title_similarity": "0.5303982",
            "sentiment_compound": 0.5908
        },
        {
            "id": "h6zmd3s",
            "score": 2,
            "text": "Oh, baby",
            "title_similarity": "-0.056626197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zmgmx",
            "score": 2,
            "text": "i want to see ted cruz in cuffs let's go",
            "title_similarity": "0.44019872",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6zmgza",
            "score": 2,
            "text": "My bet is that GOP lawmakers will get arrested and try to liken their arrests to “persecution” of their freedoms. Meanwhile, We’ve got lawmakers being arrested for advocating for voting rights. One is not like the other but I’m sure it will be interpreted that way through media and the GOP.",
            "title_similarity": "0.7129921",
            "sentiment_compound": -0.2628
        },
        {
            "id": "h6zmhgr",
            "score": 3,
            "text": "Arresting a Congress person would not be new. They recently arrested Ohio Congresswoman Joyce Beatty for protesting on Capital Hill.  So Republicans shouldn’t assume they won’t be arrested for breaking the rules after being warned.",
            "title_similarity": "0.7276906",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h6zmkkk",
            "score": 1,
            "text": "As much as I want to see those arrested who refuse the mandate, you know it's just going to be fed to their moron followers as \"is this democracy or China?\"",
            "title_similarity": "0.6404959",
            "sentiment_compound": -0.802
        },
        {
            "id": "h6zmlwr",
            "score": 3,
            "text": "The Trump terrorists are now using the delta variant as their suicide bomber. \n\nThey don't care about the collateral damage, themselves, or their country.",
            "title_similarity": "0.5038199",
            "sentiment_compound": -0.9374
        },
        {
            "id": "h6zmmbj",
            "score": 1,
            "text": "MTG getting arrested when?",
            "title_similarity": "0.6081475",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6zmpc8",
            "score": 1,
            "text": "I want to see this",
            "title_similarity": "0.021428024",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6zmsdc",
            "score": 2,
            "text": "The republican party has officially put more effort into overturning this new mask mandate than they have into seriously investigating the January 6th coup attempt in which assailants sought to kidnap and murder their own colleagues, including members of their own party.\n\nThe whole party is just entirely irredeemable. There's no way anybody can claim to be a republican and expect any sort of respect, no matter what they personally believe, when they choose to stand alongside the rest of these clowns.",
            "title_similarity": "0.688046",
            "sentiment_compound": 0.172
        },
        {
            "id": "h6zn38s",
            "score": 2,
            "text": "Rand Paul’s neighbor is gonna Randy Marsh his home office to see Paul cuffed kicking and screaming by the Capitol Police",
            "title_similarity": "0.7512702",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6zn46o",
            "score": 2,
            "text": "They are protected by the constitution and cannot be arrested while on the hill.",
            "title_similarity": "0.30049497",
            "sentiment_compound": 0.6656
        },
        {
            "id": "h6zn58t",
            "score": 1,
            "text": "About god-damned time!",
            "title_similarity": "0.0969426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zn8n3",
            "score": 2,
            "text": "It's a good thing that they have treated the capital police so well over the past few months. I'm sure that there's no grudges.",
            "title_similarity": "0.2737847",
            "sentiment_compound": 0.6948
        },
        {
            "id": "h6znafq",
            "score": 1,
            "text": "If they're endangering the health of congress, lock them up!",
            "title_similarity": "0.67657006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zndw9",
            "score": 3,
            "text": "Article says Chief Thomas Manger ordered officer to REPORT any members who refuse to wear a mask. Not that they will arrest them. It’s click bait, and we Capitol police refuse to do their fucking jobs.",
            "title_similarity": "0.7901981",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h6znoe1",
            "score": 2,
            "text": "This lays the ground work for a federally required mask mandate and enforcement.  This is a good thing. I’m making the call that sept 15 will be when we go all masks mandated federally and lock down number 2 … \n\nMy timing is based off children starting to die when they go back to school and the governors that fucked around are about to find out what actual angry mothers can do.",
            "title_similarity": "0.59100044",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h6znrmn",
            "score": 1,
            "text": "Just getting my popcorn ready…who’s brining the chips and candy! Can’t wait for the shit show to begin.",
            "title_similarity": "0.28558737",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h6zntq6",
            "score": 1,
            "text": "I would assume there is a rule that says you have to wear pants on the floor. She should make a big deal out of that and see who shows up in their underwear.",
            "title_similarity": "0.33146662",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6znwcp",
            "score": 1,
            "text": "The only problem is some GQP type is going to become some stupid anti-mask martyr.",
            "title_similarity": "0.4269505",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h6zoak0",
            "score": 2,
            "text": "OHHHH HAHAHA!   \nThis is going to be fucking amazing! Every shit head anti-vaxxer there is going to  try and propel their career by playing victim. But there will be too many so they all are going to start make dumber and dumber comparisons to try and raise to the top of the shit pile. The insane statements that we'll get from them is goign to be comedy gold.  \nWho will be the first to try to compare them not wearing a mask to the holocausts? Place your bets.",
            "title_similarity": "0.48433453",
            "sentiment_compound": -0.8574
        },
        {
            "id": "h6zobdn",
            "score": 2,
            "text": "I bet were gonna hear a lot of people screaming \"Do you know who I am\"?  when they are arrested.",
            "title_similarity": "0.66469127",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h6zol70",
            "score": 1,
            "text": "I hope they also arrest the morons who pull it down under their nose to signal they don’t actually want to wear it.",
            "title_similarity": "0.577216",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6zoncl",
            "score": 2,
            "text": "It’s gotta feel so good to arrest the fuckers who almost killed your coworkers",
            "title_similarity": "0.5452405",
            "sentiment_compound": -0.7923
        },
        {
            "id": "h6zoofo",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.16183937"
        },
        {
            "id": "h6zoogd",
            "score": 3,
            "text": "This won't go over well with Russians, Republicans and other traitors to the flag who want to spread the virus.",
            "title_similarity": "0.5575246",
            "sentiment_compound": -0.1316
        },
        {
            "id": "h6zosyp",
            "score": 1,
            "text": "Now watch them spin this as “they are kidnapping us!” Or some other bullshit.",
            "title_similarity": "0.542097",
            "sentiment_compound": -0.6239
        },
        {
            "id": "h6zotf6",
            "score": 3,
            "text": "The reality show just got real. Perform all you want. No one's putting up with this shit any more. You just know the GOP is going to stage something in mass for publicity. Fuck them. Arrest them all. And while they're locked up, bring bills to the floor for a vote.\n\nThen take it a step further. While in lock up, force a 14 day isolation, and release them only when they test negative for covid. Eat something that barely resembles oatmeal, hot dogs and beans, and shit on a shingle just like everyone else.",
            "title_similarity": "0.60388374",
            "sentiment_compound": -0.9615
        },
        {
            "id": "h6zovri",
            "score": 2,
            "text": "I don’t know I agree with this… If the republicans decide to go in with out masks and get arrested it would be insanely good for their narrative of the right being persecuted and left being authoritarian and trying to take over politics through force.",
            "title_similarity": "0.5738833",
            "sentiment_compound": -0.0
        },
        {
            "id": "h6zp0mp",
            "score": 4,
            "text": "If I finally see Marjorie Taylor Greene in handcuffs I might bust a 🥜 so hard I get pushed into another dimension.",
            "title_similarity": "0.4802385",
            "sentiment_compound": -0.2183
        },
        {
            "id": "h6zp9p7",
            "score": 2,
            "text": "they'd arrest people with loaded guns, wouldn't they...? Even if the gun wielder didn't believe in guns or that guns hurt people.",
            "title_similarity": "0.6866026",
            "sentiment_compound": -0.802
        },
        {
            "id": "h6zpbfk",
            "score": 3,
            "text": "In before MTG is like ‘omg this is just like nazi Germany’",
            "title_similarity": "0.32535255",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6zpcox",
            "score": 3,
            "text": "And you know someone is going to break the rule mostly for the press that comes with being arrested for this. \n\nIt'll play well for someone in Congress.",
            "title_similarity": "0.6752589",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6zpif3",
            "score": 1,
            "text": "I'll be honest I just got pretty mad when I was leaving a comment for my GQP congresswoman. She's a Karen who loves Trump, but won't consider that his words are why 600,000 people are dead. Well I said fuck once but otherwise I wasn't too out of line. She either needs to support New Mexico and advocate for us to become the least infected state or she needs to write a bill called the Karen act, which by surpassing the constitution, the rights of one, are more important than the health, security, and rights of the greater whole. This is getting to the point where asking for them to consider their people is unheard of for them.",
            "title_similarity": "0.5198197",
            "sentiment_compound": 0.8091
        },
        {
            "id": "h6zpjm3",
            "score": 2,
            "text": "MTG will be first one to seek attention and Boebert is lacking some recently, so gonna jump on the attention seeking shit quickly.",
            "title_similarity": "0.31419474",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h6zpk4b",
            "score": 1,
            "text": "Finally, sheesh.",
            "title_similarity": "-0.045645542",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zq683",
            "score": 3,
            "text": "I imagine the US Capitol Police will be 100% professional.in their duties.to arrest Republicans.  Can't fault the officers if they have shit-eating grins while they do it.",
            "title_similarity": "0.5261156",
            "sentiment_compound": 0.1921
        },
        {
            "id": "h6zq88m",
            "score": 3,
            "text": "Just imagine how one looks misleading his poor uninformed voters that \"not wearing a mask to protect yourself and others is your right\" as the delta variant spreads, killing some.\n\nWe really can't fix stupid, can we?",
            "title_similarity": "0.5583565",
            "sentiment_compound": -0.6768
        },
        {
            "id": "h6zq9lu",
            "score": 2,
            "text": "\"Capitol police chief Thomas Manger ordered officers to report any members of Congress who refuse to wear a mask, warning they would be subject to arrest for unlawful entry under DC Code 22-3302.\"\n\n\n\"Ordered  to report\" isn't encouraging. I don't think we will publicly see these arrests, if they even happen. They will likely give them a warning, which they will comply with while throwing a tantrum.",
            "title_similarity": "0.8350017",
            "sentiment_compound": -0.9421
        },
        {
            "id": "h6zq9pc",
            "score": 1,
            "text": "Play stupid games",
            "title_similarity": "0.2550614",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6zqgb2",
            "score": 3,
            "text": "honestly, I thought they're going to arrest those political terrorists for 1/6 at first... \n\nbut yeah, this is still good",
            "title_similarity": "0.5791832",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6zqk8x",
            "score": 1,
            "text": "To me it’s pretty obvious these people are simply unfamiliar with the nuances of electoral politics and spew these tirades to satiate their frothing “anti-tyranny” bases. They won’t be around long. That said, it should be alarming to all that arrests of elected officials are taking place on a direct party line, in the nation’s capitol. If the situation with Delta is so dire, go back to holding Congress sessions on Zoom as opposed to further stoking partisan flames by arresting Republicans on national TV and martyring these dangerous views.",
            "title_similarity": "0.7548598",
            "sentiment_compound": -0.6669
        },
        {
            "id": "h6zqmrf",
            "score": 5,
            "text": "I can think of a few clowns who would gladly get arrested to stir up their rabid conspiracy theorist followers.",
            "title_similarity": "0.5351684",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h6zqqxs",
            "score": 2,
            "text": "The I back the blue only if they’re beating and arresting people of color group.",
            "title_similarity": "0.61949384",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6zqssu",
            "score": 1,
            "text": "Now is the time when shills are separated from believers.",
            "title_similarity": "0.34643114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zqusi",
            "score": 2,
            "text": "…is that legal?  I’m vaccinated and wear a mask where required, but it seems like legally the most you could do would be to bar them entrance until they put a mask on, but no law criminalizing not wearing a mask has been passed, so it doesn’t seem clear how they could arrest people for it.",
            "title_similarity": "0.4449254",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6zqvcl",
            "score": 3,
            "text": "Only way I'd have a problem with this is if EVERY SINGLE DEM isn't also obeying.  No two rules bullshit.  Single rule for everyone and I'm completely good w/it.",
            "title_similarity": "0.2444553",
            "sentiment_compound": -0.344
        },
        {
            "id": "h6zqwdl",
            "score": 1,
            "text": "Do it",
            "title_similarity": "-0.06729582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zqxw3",
            "score": 2,
            "text": "Start arrests with childman Chip Roy, Goofy Gohmert, and Crackpot Marge. Please.",
            "title_similarity": "0.5306588",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6zqxz9",
            "score": 5,
            "text": "So many of these mask refusers are so righteous about the impingement of their personal freedom regarding what they do with their own bodies. Can anyone explain to me how this squares with their stance on women’s reproductive rights?  ‘Cause I’m having some real difficulty with that.",
            "title_similarity": "0.4807772",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h6zqzou",
            "score": 2,
            "text": "I hope they bag their faces like they do when drink people spit on cops trying to arrest them",
            "title_similarity": "0.58716",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h6zr1nh",
            "score": 1,
            "text": "Please let’s see all the GOP perp walks!",
            "title_similarity": "0.44055057",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h6zr2jj",
            "score": 3,
            "text": "About fucking time.",
            "title_similarity": "0.012413025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zr5k5",
            "score": 3,
            "text": "I'll believe it when I see it.  Until then it's just empty threats.",
            "title_similarity": "0.1867571",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h6zr6dy",
            "score": 1,
            "text": "I want to see this live",
            "title_similarity": "0.08433008",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6zr7dn",
            "score": 2,
            "text": "You know there are a few they are just itching to take down.  Looking at you Teddy Cruz and Randollup Paul.",
            "title_similarity": "0.45573986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zr873",
            "score": 2,
            "text": "Please let one try to escalate. Please tase, spray and handcuffs any who resist also make it public.",
            "title_similarity": "0.5109141",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6zr8pk",
            "score": 2,
            "text": "MTG gonna be so upset...my life will be worth living if i cld only see her arrested for not masking up🤣",
            "title_similarity": "0.51392007",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6zr8t2",
            "score": 3,
            "text": "Oh boy I can’t wait for Lauren Boebert or MTGs publicity stunt!",
            "title_similarity": "0.3780867",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zr9co",
            "score": 2,
            "text": "Finally. We can take covid seriously. \n\nArrest those dumb hicks that can't think of anyone but themselves.",
            "title_similarity": "0.5657959",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6zr9zf",
            "score": 1,
            "text": "You just know some morons are gonna show up to be arrested for the cameras or tik tok \"im standing against tyranids\" or some shit",
            "title_similarity": "0.7400632",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h6zrghh",
            "score": 1,
            "text": "Guess we know what the GQP is funding on.",
            "title_similarity": "0.10427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zrgo5",
            "score": 2,
            "text": "Until they start arresting people for not wearing masks, these assholes are not going to wear a mask.  This is the sad reality",
            "title_similarity": "0.66978574",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h6zrhlb",
            "score": 3,
            "text": "Good, what a bunch of idiots endangering others just because they’re selfish and want to ignore the rules.",
            "title_similarity": "0.46383777",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zrjwy",
            "score": 3,
            "text": "God I can’t wait to see MTG getting thrown in the back of a squad car.\n\nEdit: missed a word.",
            "title_similarity": "0.50137556",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6zrmlp",
            "score": 2,
            "text": "Law and order party will not like this",
            "title_similarity": "0.46448642",
            "sentiment_compound": 0.1506
        },
        {
            "id": "h6zrms4",
            "score": 3,
            "text": "About time. So many of them weren't wearing masks and facing no consequences for it. Maybe now they'll learn that playing stupid games results in winning stupid prizes",
            "title_similarity": "0.2798996",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6zro2u",
            "score": 2,
            "text": "I wish they would mandate vaccines instead of masks.",
            "title_similarity": "0.29544002",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6zrqln",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zrv7v",
            "score": 2,
            "text": "Lawmakers thinking they're above the law? What else is new?",
            "title_similarity": "0.43704355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zry7a",
            "score": 1,
            "text": "This is amazing. Children need to learn there are consequences for their actions.",
            "title_similarity": "0.2031723",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6zrzej",
            "score": 2,
            "text": "Oh lord.  You know what'll happen next - the Lauren Boeberts of the world are going to purposefully get arrested to create outcry.  Try to use it as proof of a tyrannical government.",
            "title_similarity": "0.7286516",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h6zs1s0",
            "score": 5,
            "text": "I don't see how wearing a mask is a hill to die on. If a place mandates masks I'll wear one because it's not a challenge at all, if they do not.. I won't wear one. \n\nNo hope for humanity if wearing a mask is asking too much.",
            "title_similarity": "0.31011266",
            "sentiment_compound": -0.7599
        },
        {
            "id": "h6zs5ck",
            "score": 1,
            "text": "Good p",
            "title_similarity": "-0.11762373",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zs5l5",
            "score": 4,
            "text": "Does this mean that Democrats might possibly be showing signs of growing a spine?",
            "title_similarity": "0.26840687",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h6zs8uh",
            "score": 3,
            "text": "Being a capital cop must suck so much, arresting these children who can probably get you fired the next week",
            "title_similarity": "0.6780552",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h6zs97r",
            "score": 1,
            "text": "This feels an awful lot like the 'f' word to me",
            "title_similarity": "0.14898351",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6zsc1w",
            "score": 2,
            "text": "Wud love to see it ❤️",
            "title_similarity": "-0.027415652",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6zsjhh",
            "score": 5,
            "text": "Good. They want to be the victims so bad, let them. They can spend months in jail for all I care.",
            "title_similarity": "0.5709449",
            "sentiment_compound": -0.1005
        },
        {
            "id": "h6zske7",
            "score": 2,
            "text": "/popcorn",
            "title_similarity": "-0.01031604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zsld0",
            "score": 3,
            "text": "Yes, make martyrs out of them. It's what they want.",
            "title_similarity": "0.27309197",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h6zsqpp",
            "score": 4,
            "text": "Finally a start toward the consequences of their actions.",
            "title_similarity": "0.14826308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zsrmq",
            "score": 7,
            "text": "This impinges upon their freedom to be selfish pricks who don't give a shit about their fellow coworkers or countrymen and are willing to spread a disease and set a bad example for the country....or as conservative media puts it, to be a freedom loving patriot",
            "title_similarity": "0.46110064",
            "sentiment_compound": 0.8282
        },
        {
            "id": "h6zstpo",
            "score": 2,
            "text": "Lol good can't wait for this shit show to pop off",
            "title_similarity": "0.2892477",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h6zstzc",
            "score": 2,
            "text": "Finally the law is being upheld.",
            "title_similarity": "0.1299501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zsx1g",
            "score": 3,
            "text": "About fucking time.",
            "title_similarity": "0.012413025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zsx3b",
            "score": 3,
            "text": "please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks please don't wear masks",
            "title_similarity": "0.37620956",
            "sentiment_compound": -0.9929
        },
        {
            "id": "h6zsypv",
            "score": 1,
            "text": "🎅 early Christmas?!",
            "title_similarity": "0.1301313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zsz67",
            "score": 1,
            "text": "Is it even possible for them to arrest people who aren't black?",
            "title_similarity": "0.5522557",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zsz6t",
            "score": 3,
            "text": "MTG is going to get herself arrested and make like she’s Rosa fuckin’ Parks.",
            "title_similarity": "0.6385306",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6zt06m",
            "score": 3,
            "text": "And no complaining if that means you miss a vote.",
            "title_similarity": "0.19369292",
            "sentiment_compound": -0.0021
        },
        {
            "id": "h6zt217",
            "score": 3,
            "text": "Bunch of conservaturds about to martyr themselves.\n\nOh well. If it keeps MTG out of our hair and in the drunk tank for a few days, works for me.",
            "title_similarity": "0.52052313",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h6zt3r9",
            "score": 1,
            "text": "Dang I didn’t finish reading and thought it said “Capitol Police ordered to arrest Congress lawmakers, staff, and visitors that were involved in the insurrection. “",
            "title_similarity": "0.91065574",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zt3rh",
            "score": 2,
            "text": "Wait...I was so confused. I thought I was in r/squaredcircle for a second.",
            "title_similarity": "0.30410576",
            "sentiment_compound": -0.4572
        },
        {
            "id": "h6zt8is",
            "score": 3,
            "text": "Wooot! Maybe MTG and discount Barbie will get arrested.",
            "title_similarity": "0.552112",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h6ztajq",
            "score": 3,
            "text": "\"I will die for my country\"  -draft dodging, no mask wearing GOP",
            "title_similarity": "0.41621658",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h6ztcga",
            "score": 1,
            "text": "I guess if they won’t arrest them for insurrection may as well arrest them for not wearing a mask? OK.",
            "title_similarity": "0.61758757",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6ztdgn",
            "score": 2,
            "text": "Sounds about white. What are the odds you send a mob of insurrectionists to prevent the certification of an election and face no consequences but end up in jail six months later for not wearing a mask?",
            "title_similarity": "0.6576884",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h6zte5w",
            "score": 2,
            "text": "Watch them scream and kick like little girls (Karen's)",
            "title_similarity": "0.30370253",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h6ztf7z",
            "score": 4,
            "text": "How about the FBI arrest that pedophile who keeps screaming about cancel culture and sucking at tit of QAnon?",
            "title_similarity": "0.64586043",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h6zticz",
            "score": 3,
            "text": "About fucking time!!",
            "title_similarity": "0.044097893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ztljo",
            "score": 3,
            "text": "We should do this on public transportation and schools too.",
            "title_similarity": "0.21592635",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ztm4g",
            "score": 2,
            "text": "They are not above the law, rules or regulations. Haughty and ignorant lawmakers.",
            "title_similarity": "0.50003064",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6ztmp6",
            "score": 2,
            "text": "Well this is great timing for some payback for those congresspeople who disrespected those Capitol police officers.",
            "title_similarity": "0.6686863",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6ztsxj",
            "score": 5,
            "text": "Oh the contradictory thinking they can weave. First, they (falsely) claim Pelosi is responsible for Jan 6 because she is over Capitol security. Now they say she has no authority over security protocols.",
            "title_similarity": "0.66956615",
            "sentiment_compound": 0.5389
        },
        {
            "id": "h6ztukj",
            "score": 5,
            "text": "I hope the Capitol Police achieve a 100% arrest record for lawbreakers.",
            "title_similarity": "0.53356314",
            "sentiment_compound": 0.128
        },
        {
            "id": "h6zu179",
            "score": 2,
            "text": "Back the blue right? Right?",
            "title_similarity": "-0.019077545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zu1qp",
            "score": 2,
            "text": "While I support this, this plays right into Republicans hands. \n\nThey’ll play martyrs on TV while comparing it to Jan 6th terrorist who have been arrested (which is their voter base). \n\nThey will spin this as the federal government declaring war on Trump supporters.",
            "title_similarity": "0.6228141",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6zu1xt",
            "score": 3,
            "text": "*me, crossing my fingers that they invite trump to that committee hearing to testify and he shows up without a mask*",
            "title_similarity": "0.6041686",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6zu2q5",
            "score": 2,
            "text": "Can we stream this on cspan?",
            "title_similarity": "0.09945987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zu5j3",
            "score": 3,
            "text": "does this mean we're going to get vids of meltdowns as those that refuse to wear masks are handcuffed? I need to start preparing the popcorn.",
            "title_similarity": "0.5213045",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6zub6y",
            "score": 2,
            "text": "It's about time. Arrest that Canadian putz too, Rafael Cruz! POS Ted!",
            "title_similarity": "0.5450893",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h6zud8r",
            "score": 3,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zue8v",
            "score": 5,
            "text": "I gather the republicans don’t have too many friends in the Capitol Police right now…",
            "title_similarity": "0.4795295",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h6zugvg",
            "score": 1,
            "text": "Lock all those terrorists up.",
            "title_similarity": "0.64771104",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h6zuiq6",
            "score": 3,
            "text": "Good. Tired of people letting idiots run amok.",
            "title_similarity": "0.3858382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zumaz",
            "score": 3,
            "text": "Capitol police: Oh no, arrest these people who care so deeply about our welfare? This is such a tough decisi-",
            "title_similarity": "0.7458528",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6zuntk",
            "score": 1,
            "text": "I remember like 2 months ago when masks were lifted good times",
            "title_similarity": "0.20417947",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6zupun",
            "score": 3,
            "text": "In India LEO were allowed to crack people not abiding to the mandate with a hickory stick. Arrest might be too dramatic just use common sense measures.",
            "title_similarity": "0.5728678",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6zuweq",
            "score": 2,
            "text": "And republicans will gladly do it and become Martyrs for the \"liberal oppression.\"",
            "title_similarity": "0.28958216",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6zuwy9",
            "score": 3,
            "text": "Well hey, at least those arrested will have \"no one to blame but themselves\", right?",
            "title_similarity": "0.273165",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6zuxue",
            "score": 2,
            "text": "I bet you gym jordan, bobert, greene and that other dipshit who open carries get so excited for these announcements, like it's a snow day in elementary school.\n\n>\"oh boy, I don't have to do any of that boring reading or listen to that stinky old teacher talk. I just get to hassle some cops at the metal detector, go on fox to say 'the democrats want to hassle the cops!!!' and then come home and have ice cream!!!\"\n\nIn this instance, ice cream means cocaine or pills!",
            "title_similarity": "0.52464855",
            "sentiment_compound": -0.4857
        },
        {
            "id": "h6zuz6s",
            "score": 4,
            "text": "So who wants to take bets on how long it takes traitor queen Marjorie to get arrested",
            "title_similarity": "0.59007186",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6zv99g",
            "score": 1,
            "text": "Yessss",
            "title_similarity": "-0.104033545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zval5",
            "score": 2,
            "text": "Lock. Them. The fuck. UP!",
            "title_similarity": "0.44086158",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h6zvbaz",
            "score": 1,
            "text": "I ill-advisedly watched Boebert's statement and it occurred to me that certain Republicans are likely to discover that most Americans really do want to see the destruction of the political parties, so saying that Kinzinger and Chaney are working to destroy the party will actually be a winner at the polls.  Insurgent Republicans (in deeply red places) might win votes upon votes from people that are sick of being taken for granted by their Republican representatives.\n\nI mean, it is amazing and quite an opportunity that a conservative can actually present hiimself as \"anti-establishment\" in a deep red area.\n\nI mean, Democrats can say \"look, we're trying to make things better for you... don't hate us that much\"  but Republicans really can't say that.  They have spent years and years ignoring the needs of the population at large and instead worked to advance their personal best interests, compromise any accountability or democratic process that might hold them accountable and basically made life worse for (almost) everyone in America.\n\nThe \"right\" angle would be for brave \"Republicans\" to primary the stupidest candidates by playing the \"anti-Trump\" and \"working for you\" angle.\n\nDon't get me wrong, the Republican party is beyond any redemption.  These cynical, nasty people deserve to be cast out and never have a place in American society again because they are leading out country to certain ruin, but I like to fantasize about a potential brawl among the \"bad guys.\"",
            "title_similarity": "0.5475947",
            "sentiment_compound": 0.587
        },
        {
            "id": "h6zvd30",
            "score": 1,
            "text": "It is medically unsafe for them to wear a mask as they will choke on the bullshit that streams from their mouths.",
            "title_similarity": "0.4697565",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h6zvilz",
            "score": 4,
            "text": "This is an unbelievably satisfying thing to read.",
            "title_similarity": "-0.028345553",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h6zvkwm",
            "score": 2,
            "text": "So is Byotch Taylor Greene in jail and fined yet?",
            "title_similarity": "0.58635294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zvnv1",
            "score": 3,
            "text": "I wonder if the people strongly objecting to this would still do so if the headline were “people who insist on walking around in the Capitol building with their dick and balls hanging out of their pants will be arrested”?",
            "title_similarity": "0.79829264",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6zvq0j",
            "score": 2,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zw1ay",
            "score": 2,
            "text": "Taze/pepper spray them please",
            "title_similarity": "0.18462664",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6zw1hx",
            "score": 1,
            "text": "Maybe this is how they charge the lawmakers with the insurrection.",
            "title_similarity": "0.72832763",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zw5mr",
            "score": 2,
            "text": "Fuck yes, get the circus clowns packed up and make them get dressed properly for their fucking real jobs.",
            "title_similarity": "0.4530056",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6zwe8g",
            "score": 2,
            "text": "Arresting them is going to make them look like martyrs but go ahead…",
            "title_similarity": "0.5160898",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h6zwgxw",
            "score": 3,
            "text": "I feel like I’m getting stupider just living here",
            "title_similarity": "0.28205577",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6zwybr",
            "score": 3,
            "text": "Cool cool. Can we arrest those that helped instigate and take part in the capitol riots?",
            "title_similarity": "0.7581285",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h6zxagj",
            "score": 1,
            "text": "I thought it expressly blocked lawmakers under the entire you can't stop a congressperson from voting.",
            "title_similarity": "0.6512648",
            "sentiment_compound": -0.0547
        },
        {
            "id": "h6zxbcw",
            "score": 1,
            "text": "This is a good time to invest in the stock market of popcorn going to be a lot of eating.",
            "title_similarity": "0.2171302",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zxboz",
            "score": 1,
            "text": "I'm sure this is bound to end well.",
            "title_similarity": "-0.040242374",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h6zxr4q",
            "score": 2,
            "text": "chippy boy is only concerd about the border ... but hey FUCK the 600,000 + people who have died to covid right republicans he says let's get back to normal ... GET STUCK IN THE FUCKING ARM PUSSY",
            "title_similarity": "0.49754566",
            "sentiment_compound": -0.9464
        },
        {
            "id": "h6zxt39",
            "score": 2,
            "text": "In before some moron gets \"arrested\" as a performance stunt to make themselves a martyr in the eyes of other morons.",
            "title_similarity": "0.6177853",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h6zxtwr",
            "score": 3,
            "text": "Get rekt GOP",
            "title_similarity": "0.19578874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zy11a",
            "score": 1,
            "text": "Thank God that is literally a national security risk if too many members of our lawmakers are sick at once",
            "title_similarity": "0.6126136",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6zy5cl",
            "score": 1,
            "text": "Can we lock em up forever",
            "title_similarity": "0.3455949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zy5qj",
            "score": 1,
            "text": "Wow these are such real hardos:  https://twitter.com/mediaite/status/1420838160087531524?s=21",
            "title_similarity": "0.35073444",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6zy7ax",
            "score": 1,
            "text": "“Lock them up!  Lock them up!”",
            "title_similarity": "0.44986695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zybw7",
            "score": 1,
            "text": "Now we're talking. Reasonable people have been asked to make way for the irrational beliefs of others for years now. Doing so in a pandemic means death. Stop.",
            "title_similarity": "0.5505508",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h6zyg8w",
            "score": 1,
            "text": "“Me ne frego.”",
            "title_similarity": "0.001972407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zz274",
            "score": 1,
            "text": "I’d like the think these officers feel glad to arrest the people who think the attack on their lives didn’t happen on Jan 6th.",
            "title_similarity": "0.5503091",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zz3s8",
            "score": 1,
            "text": "I can’t wait for the inevitable split in the GOP when non-Trump Republicans create a new party so that I’m no longer stuck in the duopoly.",
            "title_similarity": "0.48344314",
            "sentiment_compound": 0.4725
        },
        {
            "id": "h6zz834",
            "score": 1,
            "text": "Love to see it",
            "title_similarity": "-0.062664665",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6zzb28",
            "score": 1,
            "text": "Love it!",
            "title_similarity": "-0.11002478",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h6zzcu2",
            "score": 1,
            "text": "They should be doing the same across the country.",
            "title_similarity": "0.12712777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zzg0d",
            "score": 1,
            "text": "100% agree. We are past the time of playing around. If our elected leaders can't summon the ability to use common sense and protect themselves and others they belong behind bars with hefty fines. You want to make life difficult for others? Then you can sit in a lock up until a judge see's you tomorrow morning. Or better yet, do to them what a lot of places do to normal every day folks, and keep you a week or so.",
            "title_similarity": "0.55921745",
            "sentiment_compound": 0.6846
        },
        {
            "id": "h6zzihr",
            "score": 1,
            "text": "Fuckin A!",
            "title_similarity": "0.19822964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6zzsua",
            "score": 3,
            "text": "Good. Throw them in a cell. Don’t let them out. Let them fucking rot.",
            "title_similarity": "0.496814",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6zzvyr",
            "score": 1,
            "text": "Fuck yeah",
            "title_similarity": "0.043720387",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7009ah",
            "score": 2,
            "text": "Hey why in for oh u know just didn't wear my mask",
            "title_similarity": "0.2752083",
            "sentiment_compound": 0.0
        },
        {
            "id": "h700o1l",
            "score": 2,
            "text": "Do the Capitol Police know that Republican politicians urged, aided & facilitated the Jan. 6th mob riot and violence against the Capitol Police? Probably.\n\nDo the Capitol Police know that Democrats voted to give them more funding and Republicans voted against? Probably.\n\nDoes that mean the Capitol Police will overcome their racist bias and stop treating white Republicans with kid gloves while treating black Democrats as thugs & criminals? Probably Not.\n\nI'm sorry to be such a cynic but I have lost all faith in humanity in general and America specifically.",
            "title_similarity": "0.71080095",
            "sentiment_compound": -0.8215
        },
        {
            "id": "h700tn7",
            "score": 3,
            "text": "Here come the fake martyrs to make a public fuss in an attempt to make things worse for everyone for political gain and kill a few people to boot!  But don't worry, they won't get into trouble.  These negligent assassins will claim they don't understand what they're doing.",
            "title_similarity": "0.594633",
            "sentiment_compound": 0.3691
        },
        {
            "id": "h700uks",
            "score": 3,
            "text": "Can they also arrest nasty little GQP morons who shun suit jackets? Especially those named Gym (Jordan) who lie about covering up the known activity of a pervert?",
            "title_similarity": "0.66597295",
            "sentiment_compound": -0.8929
        },
        {
            "id": "h7019wj",
            "score": 1,
            "text": "It is what it is",
            "title_similarity": "-0.0977767",
            "sentiment_compound": 0.0
        },
        {
            "id": "h701bsn",
            "score": 2,
            "text": "About time.  Fuck their (GOP) willfull ignorance.",
            "title_similarity": "0.31666973",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h701c2s",
            "score": 2,
            "text": "Honestly so dope. Can definitely see some Q folks taking this as some deep state plot or something else dumb as hell.",
            "title_similarity": "0.41013217",
            "sentiment_compound": -0.4472
        },
        {
            "id": "h701hn9",
            "score": 1,
            "text": "Cool. Except that making \"martyrs\" of these dipshits will do little other than fire up their base of nitwits and their persecution fetishes.",
            "title_similarity": "0.45798752",
            "sentiment_compound": 0.0422
        },
        {
            "id": "h701ias",
            "score": 2,
            "text": "Oh this is going to get fun!!!",
            "title_similarity": "-0.083678365",
            "sentiment_compound": 0.6341
        },
        {
            "id": "h701iwy",
            "score": 1,
            "text": "Variants are bad,  mmmkay?",
            "title_similarity": "0.23518926",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h701snh",
            "score": 1,
            "text": "Pass the popcorn!",
            "title_similarity": "0.054713957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h701tuw",
            "score": 1,
            "text": "Same lies different day",
            "title_similarity": "0.14157318",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h701v5e",
            "score": 1,
            "text": "Any congressperson who defies the mask mandate should be arrested immediately and not allowed to vote on any bills until he/she promises to abide by all lawful requirements without opening their ugly flaccid traps.",
            "title_similarity": "0.70884967",
            "sentiment_compound": 0.2964
        },
        {
            "id": "h7025up",
            "score": 4,
            "text": "I can't wait to see what the \"Just comply and nothing will happen\" crowd has to say about this.",
            "title_similarity": "0.32640475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h702a4b",
            "score": 1,
            "text": "The GOP is suddenly vying for the pole position of victim hood. Who will get arrested first?",
            "title_similarity": "0.5656799",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h702c2k",
            "score": 2,
            "text": "What about the ones who aided and abetted an attempted coup?",
            "title_similarity": "0.44022167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h702ew2",
            "score": 2,
            "text": "After these last few days I’m sure the capitol police will give special treatment to those that opposed the hearing",
            "title_similarity": "0.57152367",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h702g3c",
            "score": 2,
            "text": "It helps keeps the virus from spreading, and it gives professional victims a cross to climb up onto. Win/Win.",
            "title_similarity": "0.34067607",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h702jrs",
            "score": 2,
            "text": "Imagine claiming to uphold and cherish the constitution, but refuse to \"provide for the common defense\" or \"promote the general welfare\" Its literally part of the preamble. These idiots aren't patriots. This is virtue signaling at its worst. People don't act this way about seatbelts, claiming it's their choice and legislation to save lives are bad. Actual patriots got their vaccines a long time ago, because the military mandates tons of vaccines.",
            "title_similarity": "0.5409775",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h702qef",
            "score": 1,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h702qr4",
            "score": 1,
            "text": "The GOP new fist full of crap is now \"defund the police\".",
            "title_similarity": "0.6709178",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h702vh4",
            "score": 1,
            "text": "I hope they do it. Make an example out of some of these idiots.",
            "title_similarity": "0.27941355",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h702wgp",
            "score": 3,
            "text": "Please oh please fucking arrest them if they don't.",
            "title_similarity": "0.5722045",
            "sentiment_compound": 0.228
        },
        {
            "id": "h70302d",
            "score": 3,
            "text": "the more rightwingers that are jailed the better----  felonies and then kicked out of congress",
            "title_similarity": "0.7066251",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h7032x3",
            "score": 3,
            "text": "Grabs popcorn",
            "title_similarity": "0.019514885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h703glv",
            "score": 2,
            "text": "If you arrest a congress member for not wearing a mask, you turn them into a martyr. They'll use it to bolster their next election. \"I was willing to go to jail for you guys. Let's stand up for what's right. Now give me your money. *You owe me.*\"",
            "title_similarity": "0.6993211",
            "sentiment_compound": -0.34
        },
        {
            "id": "h703k20",
            "score": 1,
            "text": "They should use that picture from the pandemic in 1918 with the person with the sign around their neck at the entrance to the Capitol.",
            "title_similarity": "0.49679768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7049bb",
            "score": 5,
            "text": "I'll give anything to see MTG's mugshot published.",
            "title_similarity": "0.38269836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h704jxt",
            "score": 2,
            "text": "It says report not arrest in the official statement.  I think it’s wishful thinking that people will finally be held accountable",
            "title_similarity": "0.3928012",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h705m2m",
            "score": 2,
            "text": "I just want to see BoBo the Clown dragged out in handcuffs, that would be intensely satisfying.",
            "title_similarity": "0.29880285",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h705ni5",
            "score": 2,
            "text": "Good!",
            "title_similarity": "-0.135432",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h705ped",
            "score": 1,
            "text": "Finally some whisky rebellion levels of balls.",
            "title_similarity": "0.3066095",
            "sentiment_compound": -0.128
        },
        {
            "id": "h705rtu",
            "score": 2,
            "text": "*grabs popcorn",
            "title_similarity": "0.081863835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h705ww2",
            "score": 2,
            "text": "Many of the political maggots still believe they are above the laws of the land...",
            "title_similarity": "0.38060117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7062ek",
            "score": 2,
            "text": "For a short moment I thought they were going to arrest the lawmakers that were at the root of the 6th of January terrorist attack/insurrection.",
            "title_similarity": "0.6951561",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h7064h1",
            "score": 2,
            "text": "Surely the party of \"law and order\" will have no issue adhering to the rules.",
            "title_similarity": "0.19958216",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h7064nv",
            "score": 1,
            "text": "No mask? Strait to jail. Bad mask? Also jail. Two masks? Believe it or not, jail",
            "title_similarity": "0.4937296",
            "sentiment_compound": -0.7383
        },
        {
            "id": "h7065s2",
            "score": 2,
            "text": "Can we please reverse the loophole allowing them to insider trade and make millions ... when any normal person would be throw in jail",
            "title_similarity": "0.5277967",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h706ag2",
            "score": 1,
            "text": "Hey maybe they’ll bring up the other rules and laws they broke from the one arrest!",
            "title_similarity": "0.5592916",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h70715q",
            "score": 3,
            "text": "Why did this take so long? Pandemic has been going on for over a year and finally just now they make people wear masks in public buildings.",
            "title_similarity": "0.49446058",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7071yh",
            "score": 2,
            "text": "If there is one thing the US Capitol Police do very well it’s cite people for minor offences. This is so totally in their wheelhouse it would be wild if they messed it up.",
            "title_similarity": "0.67026955",
            "sentiment_compound": -0.3415
        },
        {
            "id": "h7087gj",
            "score": 2,
            "text": "Please let there be video.",
            "title_similarity": "0.052624285",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7089eb",
            "score": 1,
            "text": "If their followers are anything to go by, this won't end well for the officers. Hope they have their riot gear and helmets ready for the temper tantrums",
            "title_similarity": "0.56945825",
            "sentiment_compound": -0.6501
        },
        {
            "id": "h708bwm",
            "score": 1,
            "text": "Can a member of Congress be arrested while in the Capitol building while Congress in session?\nI would think they would have written some law for themselves granting the immunity.",
            "title_similarity": "0.75227565",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h708dlj",
            "score": 7,
            "text": "I LOVE the idea that these anti-mask, traitor, insurrectionist, Q worshippping, rotten GOP twats would end up in a jail cell at the mercy of the officers they’ve mocked and ridiculed for months, but this is not going to be the case. Headline is SUPER misleading. The only person getting arrested is gonna be some anti-mask tourists from Florida come to relive the glory days of the insurrection.",
            "title_similarity": "0.5629713",
            "sentiment_compound": 0.6874
        },
        {
            "id": "h708o9o",
            "score": 4,
            "text": "This season of American is getting interesting",
            "title_similarity": "0.16445044",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h708s5k",
            "score": 3,
            "text": "Well, let’s go ahead and arrest a bunch of them. Put them in jail. Push for votes on policy. Consider them all not present. And move forward with a lot of legislation. Maybe? Idk how it works. But it sounds nice.",
            "title_similarity": "0.66068923",
            "sentiment_compound": 0.5187
        },
        {
            "id": "h7090pf",
            "score": 1,
            "text": "This will surely go over well.",
            "title_similarity": "-0.040516403",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h709fy8",
            "score": 3,
            "text": "Ohhh this is gonna be fun.. given that there's *quite* the overlap between those Congress critters that refuse to wear masks, and those complicit in the recent insurrection... \n\nNot that the Fine Upstanding Officers would *ever* consider doing something so shameful as getting a little payback....",
            "title_similarity": "0.59844893",
            "sentiment_compound": -0.5586
        },
        {
            "id": "h709fzm",
            "score": 2,
            "text": "From U.S. Capitol Police:\n\n>Regarding the House mask rule, there is no reason it should ever come to someone being arrested. Anyone who does not follow the rule will be asked to wear a mask or leave the premises. The Department's requirement for officers to wear masks is for their health & safety.\n\n[Source](https://twitter.com/CapitolPolice/status/1420810728387264517)",
            "title_similarity": "0.61960685",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h709j76",
            "score": 1,
            "text": "QAnon Republicans: \"Hold my mask.\"",
            "title_similarity": "0.239243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h709ki1",
            "score": 4,
            "text": "I'm going to be watching C-SPAN like it's the Super Bowl when this starts! Chicken wings & chill dogs at my house!",
            "title_similarity": "0.28362256",
            "sentiment_compound": 0.7896
        },
        {
            "id": "h709srm",
            "score": 2,
            "text": "We gave have come to this , How freaking embarrassing",
            "title_similarity": "0.29325962",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h709ujj",
            "score": 5,
            "text": "Suck it up! Everyone has to follow rules at work if they want to keep their job. Those politicians are no different. It’s just their job.",
            "title_similarity": "0.48402637",
            "sentiment_compound": -0.6239
        },
        {
            "id": "h709yi6",
            "score": 1,
            "text": "Put em all in a cell closely packed",
            "title_similarity": "0.28120726",
            "sentiment_compound": 0.0
        },
        {
            "id": "h709z3i",
            "score": 2,
            "text": "meanwhile fox news is talking shit about them about the jan 6 stuff.  I hope they heavily tax these idiots with fines and detainment",
            "title_similarity": "0.63978064",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h70a3jo",
            "score": 3,
            "text": "About time",
            "title_similarity": "-0.07136808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70a8ve",
            "score": 3,
            "text": "I just had a moment where I read “Capital police ordered to arrest Congress lawmakers…” and thought some really heinous shit was going down. Great headline wording",
            "title_similarity": "0.7574012",
            "sentiment_compound": -0.2911
        },
        {
            "id": "h70a9mf",
            "score": 3,
            "text": "Any updates on arresting the ones that committed treason?",
            "title_similarity": "0.60735655",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h70a9q4",
            "score": 4,
            "text": "Oh, so now when the police tell law makers what to do, it's infringing on rights. This will be interesting.",
            "title_similarity": "0.55091476",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h70aht1",
            "score": 5,
            "text": "Seriously, we’re now at a point where these people will start a civil war rather than wear masks for a month. Hoenstly, i think they want to keep prolonging the pandemic, give themselves a way feed grievances.",
            "title_similarity": "0.5393527",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h70ahxj",
            "score": 3,
            "text": "🤞🏻oh please please please March them out in handcuffs 🤞🏻",
            "title_similarity": "0.3586853",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h70alqq",
            "score": 2,
            "text": "Based. Not because of the mask mandate, but because I fucking hate politicians",
            "title_similarity": "0.56843424",
            "sentiment_compound": -0.7572
        },
        {
            "id": "h70atr3",
            "score": 14,
            "text": "If they can arrest congressmen and women peaceful protesters then by all means they should be able to arrest the assholes who are primarily responsible for this shitshow.",
            "title_similarity": "0.6907176",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h70au2h",
            "score": 2,
            "text": "HAHA let’s see it",
            "title_similarity": "-0.014922485",
            "sentiment_compound": 0.5766
        },
        {
            "id": "h70avrs",
            "score": 4,
            "text": "It's so nice having the adults back in town.",
            "title_similarity": "0.08845066",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h70awca",
            "score": 2,
            "text": "Seems like they’re going for a second insurrection this year.",
            "title_similarity": "0.35293132",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h70b6yf",
            "score": 4,
            "text": "Bad behavior deserves rough consequences.",
            "title_similarity": "0.29656845",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h70bdm6",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70bf47",
            "score": 3,
            "text": "terrific.  lock em up while you're at it.",
            "title_similarity": "0.39629495",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h70bkhl",
            "score": 2,
            "text": "As long as it is universal, both parties, then more power to it!",
            "title_similarity": "0.10958042",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h70bnnz",
            "score": 2,
            "text": "Please video this",
            "title_similarity": "0.024368864",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h70bnww",
            "score": 3,
            "text": "Make an example out of these traitors and drag them out of our house",
            "title_similarity": "0.67536616",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h70bqgl",
            "score": 5,
            "text": "Errr… correct me if I’m wrong… but isn’t the whole Republicans attacking Capitol police testimony biting the hand that feeds them? Like, are they so entitled that they are willing to mock their own security for fearing for their own lives while enjoying their protection?",
            "title_similarity": "0.727643",
            "sentiment_compound": 0.7559
        },
        {
            "id": "h70bvuk",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h70c5p4",
            "score": 1,
            "text": "And the “martyrdom” will begin soon",
            "title_similarity": "0.24010766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70csvp",
            "score": 1,
            "text": "Oh fuck yeah",
            "title_similarity": "0.044261847",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h70cth2",
            "score": 1,
            "text": "Pelosi also said she will order judges to be arrested.",
            "title_similarity": "0.596278",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70cvkt",
            "score": 1,
            "text": "Ban together and go on strike. Everyone who's down put your money together and strike",
            "title_similarity": "0.5518746",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h70d12j",
            "score": 3,
            "text": "This is legitimately no different than arresting someone who's pissing on the capitol steps or on the inside of the capitol walls lol.",
            "title_similarity": "0.7508106",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h70d2uk",
            "score": 2,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h70d6d0",
            "score": 3,
            "text": "Great, we’ll finally see arrests of the Jan 6th traitors.",
            "title_similarity": "0.52722853",
            "sentiment_compound": 0.296
        },
        {
            "id": "h70dck4",
            "score": 4,
            "text": "Arrest them and shame them. Under their mug shot put how many in their district have died from COVID-19 with the names of the deceased. Really drive it home.",
            "title_similarity": "0.65760446",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h70dggd",
            "score": 4,
            "text": "Dont allow conservatives to gaslight you into being a shitty person. Wear a fucking mask",
            "title_similarity": "0.5240464",
            "sentiment_compound": -0.6447
        },
        {
            "id": "h70dgq6",
            "score": 4,
            "text": "*Justice boner intensifies*",
            "title_similarity": "0.29502177",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h70dt3j",
            "score": 1,
            "text": "So just to clarify, which one doesn't work? The masks or the vaccines?",
            "title_similarity": "0.3489189",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70dw7v",
            "score": 2,
            "text": "Don't want a nanny state?\n\nThen stop acting like a toddler.",
            "title_similarity": "0.5097065",
            "sentiment_compound": 0.0201
        },
        {
            "id": "h70dxwr",
            "score": 2,
            "text": "What are they going to cry about when their constituents dropping dead because they were exercising their right to refuse to wear a mask. Keep it up GOPers there won’t be anyone left to vote",
            "title_similarity": "0.6269938",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h70dyoo",
            "score": 4,
            "text": "Who’s gonna be the first republican clown to get arrested on purpose?",
            "title_similarity": "0.57039213",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70dz06",
            "score": 2,
            "text": "Here come the martyrs!!!",
            "title_similarity": "0.24867502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70e177",
            "score": 3,
            "text": "Arrest, jail, whatever it takes, freedom isn’t free and everyone is fed up with these assholes.",
            "title_similarity": "0.5980853",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h70eh18",
            "score": 2,
            "text": "I’m willing to bet that not one Democrat has to be warned or arrested",
            "title_similarity": "0.3705041",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h70ejq8",
            "score": 3,
            "text": "lock em up!",
            "title_similarity": "0.39964452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70elra",
            "score": 3,
            "text": "Not true. It doesn’t apply to members of Congress:\n\nhttps://thehill.com/homenews/house/565450-capitol-police-asked-to-arrest-the-maskless?amp",
            "title_similarity": "0.72141683",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h70emim",
            "score": 3,
            "text": "So Congress lawmakers can be arrested for not wearing a mask but they can’t be arrested for treason?  They gave “tours” of the Capitol Building to domestic terrorists the day before the Capitol Building was attacked!",
            "title_similarity": "0.7893939",
            "sentiment_compound": -0.9682
        },
        {
            "id": "h70eqxb",
            "score": 7,
            "text": "I’m all for mask mandates but idk if I’m gonna be able to handle republicans whining when their representatives get arrested.",
            "title_similarity": "0.66098356",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h70exrz",
            "score": 2,
            "text": "Cool now do people who ignore subpoenas.",
            "title_similarity": "0.2628339",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h70ez5v",
            "score": 3,
            "text": "Man I hope they follow through.",
            "title_similarity": "0.018333033",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h70f0kw",
            "score": 1,
            "text": "The GQP is going to use this to try and discredit these officers and label them as partisan in their attempts to cover up January 6th. This is probably why they are going hard against the mask issue inside the capital.",
            "title_similarity": "0.7177123",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h70f2li",
            "score": 2,
            "text": "Bad politics.  I mean, FFS Nancy, get out of your own way.  \n\nI thought she did brilliantly by not accepting those traitors onto the committee that in all likelihood would have been investigating their own misconduct.  Holy shit, great tactical move.  I really mean it.  She impressed me for once.\n\nThen, we see this awesome testimony from the cops who saw the insurrection for exactly what it was, in real time.  Extremely gripping and impactful.  Great job.\n\nNow, we're going to hand over the narrative to the GQP.  \n\n\"See how biased the Capitol Police are?  They are persecuting us.  They are arresting our staffers to silence us.  The Capitol Police are corrupt!\"\n\nWas it worth it for this political stunt?  I'm all for fines, and anything Nancy can enforce without involving the Capitol Police.  But why are we giving them another avenue to drag the credibility of the Capitol Police through the mud for no fucking reason?\n\nDo better guys.",
            "title_similarity": "0.6184521",
            "sentiment_compound": 0.8384
        },
        {
            "id": "h70f5hp",
            "score": 2,
            "text": "Well this is a massive shit show waiting to happen. I'll grab the popcorn.",
            "title_similarity": "0.38419372",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h70f7ap",
            "score": 1,
            "text": "This seem like a more potent and effective insurrection….",
            "title_similarity": "0.14170732",
            "sentiment_compound": 0.7063
        },
        {
            "id": "h70f7k4",
            "score": 2,
            "text": "Good, let them be arrested, bunch of snowflakes stubborn dbags.",
            "title_similarity": "0.56747013",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h70f9o6",
            "score": 2,
            "text": "Lock them up…?",
            "title_similarity": "0.47511345",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70fbjq",
            "score": 3,
            "text": "Love it! Hah ha ha ha!!",
            "title_similarity": "-0.08076064",
            "sentiment_compound": 0.8713
        },
        {
            "id": "h70g81s",
            "score": 5,
            "text": "[it’s about GD time 👏🏽](https://media3.giphy.com/media/PBP2Bm8DstvXbRe4sp/200.gif)",
            "title_similarity": "0.19544598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70g8k9",
            "score": 4,
            "text": "Good. We're looking at worse COVID-19 numbers than we had six months ago. We need to stop fucking around and get vaccinated, wear masks. Unless we're all going for the \"keep letting the virus mutate to see how bad/interesting it could get\" option, in which case, keep it up, America.",
            "title_similarity": "0.52699494",
            "sentiment_compound": -0.34
        },
        {
            "id": "h70gbxi",
            "score": 1,
            "text": "Excellent.",
            "title_similarity": "-0.13212782",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h70gh6r",
            "score": 2,
            "text": "I wanna bet LB and MTG won't wear one just so they can get arrested and continue with their conservative martyr persona.",
            "title_similarity": "0.6087272",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70ghr9",
            "score": 2,
            "text": "Hopefully arrest comes with a gagging!",
            "title_similarity": "0.35832667",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h70go9w",
            "score": 3,
            "text": "Finally",
            "title_similarity": "-0.083739415",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70htrl",
            "score": 3,
            "text": "should be arresting them because they're traitors but sure",
            "title_similarity": "0.5657712",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h70i0nk",
            "score": 2,
            "text": "Lock them up! Lock them up!",
            "title_similarity": "0.45943964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70i5hf",
            "score": 4,
            "text": "Oh god, you just know a bunch of republican loons are gonna make a huge publicity stunt out of this by purposely breaking these rules and subsequently getting arrested. They'll say they're doing \"civil disobedience\" and taking a \"principled stand\" against government tyranny.",
            "title_similarity": "0.7128675",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h70ijau",
            "score": 1,
            "text": "Who could’ve possibly seen this coming…",
            "title_similarity": "0.16886339",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70j5n4",
            "score": 3,
            "text": "Hell yea",
            "title_similarity": "0.10858329",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h70jkji",
            "score": 2,
            "text": "MTG and Boebert are gonna be in prison in like 15 minutes if this is the case.",
            "title_similarity": "0.41880038",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h70jt6e",
            "score": 1,
            "text": " It not to arrest the Lawmakers and members of Congress who aided in Jan 6?",
            "title_similarity": "0.61944115",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h70jugn",
            "score": 1,
            "text": "Book 'em Dano.",
            "title_similarity": "0.055872027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70kf4v",
            "score": 2,
            "text": "Yes!",
            "title_similarity": "-0.10426611",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h70kmss",
            "score": 5,
            "text": "It is sad mask and the fight against covid is so politicized.",
            "title_similarity": "0.44518086",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h70ku60",
            "score": 8,
            "text": "The holding cell should be a Civid ICU.  Have fun without masks assholes",
            "title_similarity": "0.34191737",
            "sentiment_compound": 0.7485
        },
        {
            "id": "h70l3bo",
            "score": 5,
            "text": "Guarantee there will be Rs who don't wear their masks just so they make the news and look like a persecuted hero to their troglodyte constituents. I'm looking at you MTG and Qbert",
            "title_similarity": "0.6033684",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h70lbrd",
            "score": 3,
            "text": "They couldn’t handle angry fat people",
            "title_similarity": "0.39834356",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h70lrqw",
            "score": 1,
            "text": "I feel like this belongs in r/wcgw",
            "title_similarity": "0.023635413",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h70m3ge",
            "score": 3,
            "text": "Lol, this is awesome.",
            "title_similarity": "-0.12465904",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h70mdfh",
            "score": 4,
            "text": "So Marjorie is getting arrested in the coming days",
            "title_similarity": "0.5573085",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h70mio6",
            "score": 6,
            "text": "Just tell all the republicans that they will be fined, and that money will be donated to BLM charities in their names.",
            "title_similarity": "0.5970545",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h70nbc2",
            "score": 15,
            "text": "Looks like the trumpy trolls are out, you can tell by the incoherent rambling and whining.",
            "title_similarity": "0.48187053",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h70nrv6",
            "score": 3,
            "text": "Arrest for trespassing, than hold them for treason.",
            "title_similarity": "0.5610399",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h70ohmy",
            "score": 1,
            "text": "I bet that not only do Rupert Murdoch's staff at Fox and elsewhere have to be vaccinated but also that they have to wear a mask in the building etc.   I mean think about it, reporter's travel, increasing exposure and how would it exactly look if 5 + Fox hosts or executives were in a coma receiving oxygen on Fox's insurance.  If the health that Murdoch is offering employees is the same then without a doubt.  If they really were antimask and antivax the insurance rates would of gone sky high for ol Rupert and he wouldn't cop that.",
            "title_similarity": "0.53626305",
            "sentiment_compound": 0.395
        },
        {
            "id": "h70pq37",
            "score": 2,
            "text": "Meanwhile my ten year-old will be going to school with hundreds of kids with no masks.",
            "title_similarity": "0.31926858",
            "sentiment_compound": -0.296
        },
        {
            "id": "h70pu1o",
            "score": 4,
            "text": "Oh you know there are some that have been WAITING  to arrest some of these assholes.",
            "title_similarity": "0.55955654",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h70qegj",
            "score": 4,
            "text": "Explain to me why we’re doing a 180 and *arresting* visitors for this. Just kick them out; maybe issue a fine. Arrest people for *actual* crimes like, oh I don’t know, sedition and treason?",
            "title_similarity": "0.78862655",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h70qev5",
            "score": 4,
            "text": "They should just comply though, right?",
            "title_similarity": "0.031256385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70qzz8",
            "score": 5,
            "text": "Everyone should listen to Tim Ryan's speech today. People are flying from all over the country for these meetings, some from covid hot spots. I'd be pissed too.",
            "title_similarity": "0.557367",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h70r4xx",
            "score": 7,
            "text": "Hey, just “don’t break the rules” and you won’t get arrested, right? Remember? Just obey the law shit-brains.",
            "title_similarity": "0.37829298",
            "sentiment_compound": -0.5362
        },
        {
            "id": "h70s707",
            "score": 2,
            "text": "I won’t hold my breath.",
            "title_similarity": "0.17796662",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70smw4",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h70th27",
            "score": 5,
            "text": "Lol marjorie is gonna have a grande ol time with this",
            "title_similarity": "0.008799022",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h70ua09",
            "score": 3,
            "text": "This should have already happened.",
            "title_similarity": "0.106684",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70ujqy",
            "score": 2,
            "text": "Pay per view?",
            "title_similarity": "0.12578043",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h70uybw",
            "score": 3,
            "text": "Sick of these degenerates not being held accountable like every other citizen.  How do you expect others to follow the rules ..... oh wait, you don’t.",
            "title_similarity": "0.5713715",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h70uyrs",
            "score": 4,
            "text": "If they can mandate pants, they can mandate masks",
            "title_similarity": "0.079059236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70v31z",
            "score": 1,
            "text": "Get MTG first",
            "title_similarity": "0.12985158",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70vebt",
            "score": 1,
            "text": "Hey 'Republicans' reading this post: when they arrest your clown college reject leaders, how hilarious will that be?",
            "title_similarity": "0.6124976",
            "sentiment_compound": -0.34
        },
        {
            "id": "h70vfo5",
            "score": 1,
            "text": "Looking forward for the same actions for the covert employed/elected insurrectionists from January 6th.",
            "title_similarity": "0.38515428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70vgdm",
            "score": 1,
            "text": "Grab your popcorn folks.  Next couple weeks is going to be entertaining as hell.",
            "title_similarity": "0.2634597",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h70vpuz",
            "score": 3,
            "text": "Can’t wait to see MTG’s mugshot",
            "title_similarity": "0.3649952",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70vz77",
            "score": 4,
            "text": "Should've arrested them for aiding and abetting domestic terrorists six months ago, but better late than never I guess.",
            "title_similarity": "0.5653328",
            "sentiment_compound": 0.0644
        },
        {
            "id": "h70wch8",
            "score": 2,
            "text": "Good, I hope it's actually fucking enforced for a change.",
            "title_similarity": "0.20726858",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h70wlql",
            "score": 4,
            "text": "The headline is not correct. \n\nI hate that news organizations are doing this to get clicks. \n\nCapital police are not \"ordered to arrest,\" lawmakers. \n\nThe officers are ordered to take note of who is not wearibg a mask, and the head of the agency wants to remind everyone that they are subject to arrest. \n\nVery, very different.",
            "title_similarity": "0.7560321",
            "sentiment_compound": 0.3887
        },
        {
            "id": "h70wpnq",
            "score": 1,
            "text": "'Could', but 'won't-actually-be' arrested at some imaginary later, yet to be named, date...",
            "title_similarity": "0.27032954",
            "sentiment_compound": 0.5157
        },
        {
            "id": "h70wt5i",
            "score": 1,
            "text": "It would be nice if there was a consequence to refusing to follow the rules of the body.",
            "title_similarity": "0.32256234",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h70wyrb",
            "score": 1,
            "text": "Does anybody think that any Senator would be placed in handcuffs for this?  I want them all to be arrested, but there's no way in fucking hell that would happen.",
            "title_similarity": "0.688116",
            "sentiment_compound": -0.9107
        },
        {
            "id": "h70x58h",
            "score": 1,
            "text": "Do vaccine-havers have to wear the mask or what? i’m confused",
            "title_similarity": "0.36862686",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h70x5ir",
            "score": 3,
            "text": "Do it",
            "title_similarity": "-0.06729582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h70xal9",
            "score": 2,
            "text": "No more pussy footin’.",
            "title_similarity": "0.27983966",
            "sentiment_compound": -0.296
        },
        {
            "id": "h70xgtz",
            "score": 6,
            "text": "Good! And lock ALL the domestic terrorist TRAITOR Republicans up too!!! USA! USA! USA!",
            "title_similarity": "0.65448374",
            "sentiment_compound": -0.6083
        },
        {
            "id": "h70y0sz",
            "score": 3,
            "text": "Dan Crenshaw on IG telling people to refuse mask mandates if passed again.",
            "title_similarity": "0.64379966",
            "sentiment_compound": -0.296
        },
        {
            "id": "h70ya5r",
            "score": 1,
            "text": "Why can’t we just get along. We are all trying to live happy lives. Reddit isn’t a good place to have a healthy dialogue. I hope everyone here is doing well.",
            "title_similarity": "0.31438166",
            "sentiment_compound": 0.9231
        },
        {
            "id": "h70ysgb",
            "score": 1,
            "text": "You say you want a Revolution \n\nhttps://www.youtube.com/watch?v=BGLGzRXY5Bw",
            "title_similarity": "0.3257325",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h70yxp4",
            "score": 2,
            "text": "Woo! Hold em accountable!",
            "title_similarity": "0.14399856",
            "sentiment_compound": 0.5696
        },
        {
            "id": "h70zbf9",
            "score": 1,
            "text": "Let them fight.",
            "title_similarity": "0.26141894",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h70zohc",
            "score": 3,
            "text": "I'm really going to enjoy this.",
            "title_similarity": "-0.0988448",
            "sentiment_compound": 0.5367
        },
        {
            "id": "h70zyye",
            "score": 2,
            "text": "Well damn. They ain't fuckin' around.",
            "title_similarity": "0.15897739",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h7108j6",
            "score": 3,
            "text": "Sell pay per view tickets and pay off the debt",
            "title_similarity": "0.24760444",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h710lgw",
            "score": 1,
            "text": "Nothing to see here, citizen, move along.",
            "title_similarity": "0.28917027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71138j",
            "score": 5,
            "text": "I wish all politicians left and right would just get together and help the country out. Who cares about who’s left and right. Just do what’s right for this country. \nIs no longer about who holds power like a chess board. Is about moving this country forward",
            "title_similarity": "0.39181834",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h711ch3",
            "score": 3,
            "text": "I mean, most of them are already seditious criminals anyway.",
            "title_similarity": "0.52612484",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h712dns",
            "score": 8,
            "text": "God.  Please let them follow thru with this.",
            "title_similarity": "0.046388857",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h71355s",
            "score": 1,
            "text": "Such heros.",
            "title_similarity": "0.04044075",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h714bxo",
            "score": 1,
            "text": "tight",
            "title_similarity": "0.026742011",
            "sentiment_compound": 0.0
        },
        {
            "id": "h714eee",
            "score": 6,
            "text": "Too bad the arrests don’t include those who thought the events of January 6th were just some good ol’ boys havin’ fun!",
            "title_similarity": "0.4218962",
            "sentiment_compound": -0.126
        },
        {
            "id": "h715eci",
            "score": 2,
            "text": "It is absolutely pathetic that someone in a seat of power like this would intentionally flaunt mask mandates because of their \"rights\". They know what they're doing and it has nothing to do with rights or liberties.  Wearing a mask is such a minor inconvenience for the greater good that to openly defy it is essentially declaring \"I'm a petulant child who cares more about the spotlight than the health of those around me!\"",
            "title_similarity": "0.42437875",
            "sentiment_compound": 0.7905
        },
        {
            "id": "h715l6r",
            "score": 3,
            "text": "This is awesome news!!",
            "title_similarity": "-0.018691875",
            "sentiment_compound": 0.6892
        },
        {
            "id": "h715s9a",
            "score": 1,
            "text": "You would think republitars would make informed decisions",
            "title_similarity": "0.11870385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h715woc",
            "score": 2,
            "text": "Do it and make the fine enormous",
            "title_similarity": "0.078690335",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h716af8",
            "score": 2,
            "text": "Just arrest the whole GQP.  They are all criminals and traitors anyway.",
            "title_similarity": "0.68540084",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h716d8r",
            "score": 2,
            "text": "I recognize you from Squaredcircle",
            "title_similarity": "0.06146391",
            "sentiment_compound": 0.0
        },
        {
            "id": "h717m8j",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h717p5u",
            "score": 1,
            "text": "Wonder who will be the first one.",
            "title_similarity": "0.05677848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h717rou",
            "score": 1,
            "text": "How many variants will there be? Anyone care to guess?",
            "title_similarity": "0.123435006",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h7187z7",
            "score": 1,
            "text": "I wonder if it’s a felony or misdemeanor.",
            "title_similarity": "0.37616068",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7188ic",
            "score": 2,
            "text": " Good &  about Gdamn time some  congress members are non believers in truth& science selfish these Congress members are  not doing their patrioic duty  to portect the nation .\nPpl are dying bc of their  lies .\nThey just dont give a damn & \nIts obvious .",
            "title_similarity": "0.5503696",
            "sentiment_compound": 0.1426
        },
        {
            "id": "h718h86",
            "score": 2,
            "text": "I will jump with excitement if they handcuff them then apply masks to their faces.",
            "title_similarity": "0.27615795",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h718lbo",
            "score": 1,
            "text": "Goddamn right.",
            "title_similarity": "-0.06096829",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h718ymy",
            "score": 5,
            "text": "Let's see the Republicans held to the same standards they claim to uphold.\n\nLaw And Order...",
            "title_similarity": "0.23232213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71afnr",
            "score": 2,
            "text": "r/actlikeidiotsbetreatedlikeidiots",
            "title_similarity": "0.10683274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71aktr",
            "score": 3,
            "text": "I just can’t understand why some people won’t wear a mask. I mean, I’m NOT a no-vax but I can understand the skepticism towards vaccines, it’s something injected in your body and you might get (for no reason imo) hesitant but wearing a mask? At least do that!\nWe need to understand covid has 2 solutions: masks and vaccines, together atm!",
            "title_similarity": "0.4282074",
            "sentiment_compound": -0.7457
        },
        {
            "id": "h71aud7",
            "score": 3,
            "text": "Republicans will be free to go mask-less at the local D.C. jail.",
            "title_similarity": "0.42444342",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h71auyx",
            "score": 1,
            "text": "this virus is making the world crazy",
            "title_similarity": "0.49089867",
            "sentiment_compound": -0.34
        },
        {
            "id": "h71b7uz",
            "score": 1,
            "text": "Beside the 24 boner, which my wife loved btw, I had no reactions to the vac shots",
            "title_similarity": "0.31679082",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h71bpai",
            "score": 2,
            "text": "That’s right‼️ Ignore your boss, don’t do what’s asked of you, THATS JUST THE TYPE OF LEADERSHIP WE NEED TO SHOW TO THE NATION💥",
            "title_similarity": "0.5168501",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h71c2w3",
            "score": 1,
            "text": "Breaking news... Marjorie Taylor Green arrested.\n\nMore breaking news... Matt Gaetz arrested. \n\nThis is classic. These are 2 morons and they are dangerous for their districts.",
            "title_similarity": "0.6748434",
            "sentiment_compound": -0.891
        },
        {
            "id": "h71c4kq",
            "score": 2,
            "text": "So we can arrest them for no mask/vax but not organizing an insurrection?",
            "title_similarity": "0.5877328",
            "sentiment_compound": -0.3468
        },
        {
            "id": "h71ceg1",
            "score": 1,
            "text": "CSpan is going to be on tomorrow",
            "title_similarity": "0.035785574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71d0eb",
            "score": 1,
            "text": "Based based based based",
            "title_similarity": "-0.020572614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71eloy",
            "score": 1,
            "text": "Where's Bobert and Karen Greene? I demand a mask update!",
            "title_similarity": "0.2835548",
            "sentiment_compound": -0.2003
        },
        {
            "id": "h71f69q",
            "score": 1,
            "text": "Gotta feeling they’d be all too eager to lock some mofos up",
            "title_similarity": "0.4279907",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h71fgnz",
            "score": 2,
            "text": "Bah...more like slaps on the wrist nothing more will come out of this",
            "title_similarity": "0.33489907",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h71fqt2",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h71g0e5",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.18934314"
        },
        {
            "id": "h71g46c",
            "score": 1,
            "text": "I think Anti-Maskers are just lazy to wear it",
            "title_similarity": "0.22765508",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h71g6us",
            "score": 1,
            "text": "Excellent",
            "title_similarity": "-0.13145857",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h71gfhr",
            "score": 1,
            "text": "Don’t make martyrs",
            "title_similarity": "0.264041",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71gpw4",
            "score": 2,
            "text": "Weird, what hills people choose to die on ...",
            "title_similarity": "0.37137413",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h71gv71",
            "score": 1,
            "text": "Proud of my home city and state, cops enforcing the laws.",
            "title_similarity": "0.423287",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h71h4e8",
            "score": 1,
            "text": "They don't arrest politicians for prostitution, trafficking underaged girls, rape, insurrection etc they're not gonna get arrested for this. Laws to them are loose guidelines that only poor people have to follow.",
            "title_similarity": "0.49186838",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h71hi0b",
            "score": 1,
            "text": "Wow. Thank God.",
            "title_similarity": "-0.09043001",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h71i04z",
            "score": 2,
            "text": "This I can -NOT- wait to see.",
            "title_similarity": "0.03884819",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71iilm",
            "score": 1,
            "text": "This is a r/nottheonion moment",
            "title_similarity": "0.07876818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71jc9o",
            "score": 1,
            "text": "They won't",
            "title_similarity": "0.12158412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71jo5t",
            "score": 1,
            "text": "Obey the rules",
            "title_similarity": "0.10912327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71jwc7",
            "score": 1,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h71kbt5",
            "score": 3,
            "text": "F'Congressmen and women who won't wear a mask at OUR Capitol who encouraged  thousands of savages to literally $hit all over the place. We've been wearing masks and all kinds of other things for over a year so got nothing for these Trump cultie cry baby self entitled wanna be's. F' them all.",
            "title_similarity": "0.6481067",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h71krgd",
            "score": 1,
            "text": "Has anything been done about all those politicians, that slapped restrictions and lockdowns on their state to just ignore it themselves? Or is it now since most have forgoten they jump on top of this?",
            "title_similarity": "0.7170098",
            "sentiment_compound": -0.264
        },
        {
            "id": "h71ksnj",
            "score": 3,
            "text": "Can we lock up all the idiots that are getting their constituents killed by Covid",
            "title_similarity": "0.71791005",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h71lhw2",
            "score": 2,
            "text": "I’m really sure the Capital police are amped up arresting Congress members who been disrespecting them this whole time! Hope after the arrest them they duct tape a mask over their faces",
            "title_similarity": "0.7875463",
            "sentiment_compound": 0.5244
        },
        {
            "id": "h71mdtb",
            "score": 3,
            "text": "I don’t want them to arrest the members of Congress, even though when reading the article, it looks like they won’t. I don’t want them to give them the opportunity to be martyrs. They love being victims",
            "title_similarity": "0.52370566",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h71rmg9",
            "score": 5,
            "text": "The screams will be incredible.  I mean whining, the whining will be incredible.",
            "title_similarity": "0.2498318",
            "sentiment_compound": -0.6444
        },
        {
            "id": "h71rskk",
            "score": 1,
            "text": "they're just going to find the capitol cop sympathizer and walk right in.",
            "title_similarity": "0.61595625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71sx3w",
            "score": 4,
            "text": "I really want to see at least all of them tazed.",
            "title_similarity": "0.2480038",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h71sxao",
            "score": 5,
            "text": "Hold networks accountable for allowing hosts to knowingly pass off bad information.",
            "title_similarity": "0.46610054",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h71vb4q",
            "score": 5,
            "text": "Finally.",
            "title_similarity": "-0.09112351",
            "sentiment_compound": 0.0
        },
        {
            "id": "h71vlmr",
            "score": 2,
            "text": "Good.",
            "title_similarity": "-0.14557905",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h71w1zr",
            "score": 1,
            "text": "Nice, looks like republicanism are finally going to jail",
            "title_similarity": "0.43482095",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h71wmye",
            "score": 4,
            "text": "Gonna bet a 50 that the Republicans will now listen to defunding after this. Sad that it takes them denying science rather than police brutality",
            "title_similarity": "0.44138545",
            "sentiment_compound": -0.8757
        },
        {
            "id": "h71xc0p",
            "score": 3,
            "text": "Would love to see this",
            "title_similarity": "-0.051408224",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h71ydir",
            "score": 2,
            "text": "this is good",
            "title_similarity": "-0.15373412",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h720801",
            "score": 2,
            "text": "Who was the person talking in Congress? San Antonio? You’re a fucking moron bud, a fucking disgrace to the people you represent. Maybe the people you represent are also disgraces? I don’t know, but you’re a damn moron.",
            "title_similarity": "0.6471833",
            "sentiment_compound": -0.9167
        },
        {
            "id": "h7214g6",
            "score": 1,
            "text": "Make all the sense in the world",
            "title_similarity": "-0.014764172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h726ict",
            "score": 3,
            "text": "This should get interesting 🤔💬",
            "title_similarity": "-0.029933233",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h72772f",
            "score": 2,
            "text": "And finally a headline that makes me excited for the next week or so!",
            "title_similarity": "0.16646716",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h7296cn",
            "score": 4,
            "text": "So many of our elected officials look much better when masked, don't you think?",
            "title_similarity": "0.2473396",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h729vkv",
            "score": 8,
            "text": "Fucking A. Biden needs to get mean. They're gonna act like children? Treat them like children.",
            "title_similarity": "0.44386256",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h72a7l1",
            "score": 3,
            "text": "“The surest way to work up a crusade in favour of some good cause is to promise people they will have a chance of maltreating someone. To be able to destroy with good conscience, to be able to behave badly and call your bad behavior 'righteous indignation' — this is the height of psychological luxury, the most delicious of moral treats.”\n\n-Aldous Huxley",
            "title_similarity": "0.36871117",
            "sentiment_compound": 0.5849
        },
        {
            "id": "h72cev6",
            "score": 5,
            "text": "About time. Let them know it’s serious.",
            "title_similarity": "0.058323484",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h72dz34",
            "score": 5,
            "text": "Can’t wait to see how they handle the January 6th deniers",
            "title_similarity": "0.36265412",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h72h3aw",
            "score": 3,
            "text": "Lock them up",
            "title_similarity": "0.45687172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h72ld45",
            "score": 1,
            "text": "Fuck yeah!",
            "title_similarity": "0.06292741",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h72moel",
            "score": 2,
            "text": "Anyone else foresee MTG in handcuffs.",
            "title_similarity": "0.38697186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h72si7x",
            "score": 2,
            "text": "Fuck around, find out.",
            "title_similarity": "0.20727655",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h72tzzs",
            "score": 1,
            "text": "So- citizens have to follow laws. Honestly, folks this sounds legit.",
            "title_similarity": "0.4136467",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h72vvz7",
            "score": 1,
            "text": "As much as I agree. Never gonna happen.",
            "title_similarity": "0.109469995",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h72zfdx",
            "score": 1,
            "text": "Now *these* are boots I’ll lick!",
            "title_similarity": "0.08935348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h734n2d",
            "score": 1,
            "text": "Meanwhile our planet burns and melts from climate change, people die of starvation, roads and bridges crumble, floods kill thousands, pandemic kills thousands, Americans are under-paid and homeless...but these worthless f\\*\\*ks are fighting over a piece of cloth.\n\nAnyone else ready to admit this system is entirely broken?",
            "title_similarity": "0.5471879",
            "sentiment_compound": -0.9558
        },
        {
            "id": "h73505s",
            "score": 1,
            "text": "They fucked around and found out.",
            "title_similarity": "0.3614639",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h739y1q",
            "score": 1,
            "text": "time to message your (R) reps and call them cowards for wearing a mask. let's see how many break down",
            "title_similarity": "0.57526016",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73aohm",
            "score": 2,
            "text": "All while Biden turns over thousands of COVID positive aliens at the border to Christian charities that rent out a whole hotel in a small town to house them not quarantine them. People called police bc they noticed obviously sick people in a burger joint. Turns out the police nor public health officials where told these people would be wondering around their town. But yah let’s all crap on the “crazy” Republicans that don’t mask and praise Biden for “protecting” us. That”s why we refer to you as sheep.",
            "title_similarity": "0.5770631",
            "sentiment_compound": 0.5789
        },
        {
            "id": "h73e4nn",
            "score": 1,
            "text": "Authoritarian regime of the current administration",
            "title_similarity": "0.3984005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73h3f1",
            "score": 1,
            "text": "What a fucking joke.  Mask mandate is absolutely bullshit in DC.",
            "title_similarity": "0.45025998",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h73ho2z",
            "score": 1,
            "text": "It's unlawful to enter a building, any building, especially the White House, during COVID while wearing a mask.  All the Republicans had to do was put a mask on. Now what?",
            "title_similarity": "0.6196146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73ijcs",
            "score": 3,
            "text": "If I can be arrested for having drugs on my person not even to sell or I can get 25 years for stealing to feed my family. A lawmaker can get arrested for possibly infecting people and hurting the security of our nation. Plus it only harms people in the government if they’re the ones forced to wear a mask. They’re not arresting you or I because we walk into a gas station without a mask. I mean definitely not me since I’m vaccinated but still the point stands.",
            "title_similarity": "0.6271714",
            "sentiment_compound": -0.7814
        },
        {
            "id": "h73jfdq",
            "score": 1,
            "text": "Ah yes, the Republican Representatives insist they can't be arrested.\n\nhttps://www.theguardian.com/us-news/2021/jul/29/sheila-jackson-lee-arrested-voting-rights-protests\n\nBut when black Representatives are arrested, those are just criminals.",
            "title_similarity": "0.67064124",
            "sentiment_compound": -0.8212
        },
        {
            "id": "h73kelq",
            "score": 1,
            "text": "I don't think a lot of people realize that these crazy Republican reps probably WANT to get arrested to look like martyrs to their base .",
            "title_similarity": "0.63989663",
            "sentiment_compound": -0.2422
        },
        {
            "id": "h73oixi",
            "score": 1,
            "text": "They had better put up or shut up.  Without teeth, this mandate will have no bite.  I honestly hope congressional members remember that Texas is about arrest democrats on site for exiting that atrocious vote against voting rights in the state.  If they don't do the same for the big C, then this is nothing more than political theater.",
            "title_similarity": "0.6311985",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h741gvi",
            "score": 1,
            "text": "good",
            "title_similarity": "-0.14225076",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h778lv1",
            "score": 1,
            "text": "Senators and Representatives shall receive a Compensation for their Services, to be ascertained by Law, and paid out of the Treasury of the United States. *They shall in all Cases, except Treason, Felony and Breach of the Peace, be privileged from Arrest during their Attendance at the Session of their respective Houses, and in going to and returning from the same; and for any Speech or Debate in either House, they shall not be questioned in any other Place.*",
            "title_similarity": "0.54497564",
            "sentiment_compound": 0.6481
        },
        {
            "id": "h78x4wl",
            "score": 1,
            "text": "the fact of the matter is   \n the fact is ...  \n why cant I remember what the fact of the matter is ?",
            "title_similarity": "0.20309359",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h7he6qv",
            "score": 1,
            "text": "How come Ashli Babbitt’s killer wasn’t arrested?",
            "title_similarity": "0.46163505",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h7i2vte",
            "score": 1,
            "text": "In the UK, MPs would be told to leave the chamber for violating standing orders. In America, the equivalent get arrested and charged with a criminal offense, or are issued a criminal penalty summarily.",
            "title_similarity": "0.80073243",
            "sentiment_compound": -0.9607
        },
        {
            "id": "h7ivj2b",
            "score": 1,
            "text": "I’m sorry Dolly says I should apologize for calling you vaccine twats so I’m sorry that was rude.😢",
            "title_similarity": "0.4431942",
            "sentiment_compound": -0.7635
        },
        {
            "id": "h7nthj7",
            "score": 1,
            "text": "Away with anybody who refuses to not wearing the mask and not going by the rules. These are the guys which should pay for all of the companies gone bankrupt and all of the other things that happened because of Covid",
            "title_similarity": "0.602129",
            "sentiment_compound": -0.6124
        }
    ]
}