{
    "Judge asks why Capitol rioters are paying just $1.5 million for attack, while U.S. taxpayers will pay more than $500 million\n": [
        {
            "id": "h8botar",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.31690037",
            "sentiment_compound": -0.6537
        },
        {
            "id": "h8ch1yd",
            "score": -2,
            "text": "500 million. What bullshit.  How about charging the rioters summer of 2020 for the billions in damages.  Oh wait, they let them go.",
            "title_similarity": "0.7792859",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h8ca72v",
            "score": 28,
            "text": "Are the taxpayers paying for the blm riots too?",
            "title_similarity": "0.60345113",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8ch3jt",
            "score": -15,
            "text": "How much is BLM paying for the last year snd a half $0.00",
            "title_similarity": "0.6474492",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cj3ck",
            "score": 2,
            "text": "Let's just completely forget about the 2020 summer riots.",
            "title_similarity": "0.3268501",
            "sentiment_compound": -0.6697
        },
        {
            "id": "h8cht5z",
            "score": 2,
            "text": "Fuck them, Make them pay all of it. \nFuck the blm rioters too costing waay more.",
            "title_similarity": "0.46225846",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h8bqg00",
            "score": 18,
            "text": "Honest question....If you break in to my house, are you responsible for the cost for me to upgrade the security I previously didn't have?  I don't think you would be, just for the damage you caused.",
            "title_similarity": "0.49665612",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8cw9xk",
            "score": 0,
            "text": "Good question, but if you ask this question, you also have to ask why BLM and Antifa pay $0.00 for several hundred attacks on private businesses causing billions of dollars of damage to the businesses and to the economy, for burning down a police precinct, for the attempt to burn down a federal court, for occupying 6 blocks in Seatle claiming autonomy and destroying everything within their autonomous zone, including the murder of a teenager.\n\nYou have to ask, why none of these terrorists within the autonomous zone have been arrested for treason. Declaring an area inside the United States as autonomous means that they denounce the authority of the American government. They also denounced their citizenship with this act. Yes, read up if you don't believe me. Now that they are not American citizens anymore and they are occupying American soil declaring it as their land, they are becoming foreign terrorists on domestic soil and should have been charged as such.\n\nYet, nobody in the autonomous zone in Seatle was charged with anything, at least nothing made it into the media.\n\nDefinition of an autonomous Zone: A permanent autonomous zone (PAZ) is a community that is autonomous from the generally recognized state or authority structure in which it is embedded. ***PAZs are not controlled by any government.***\n\nPlease don't get me wrong, what happened on January 6 was 100% wrong and people need to be held accountable, and that includes the police officers who opened the doors for them, gave them water to drink, and let them go inside without any resistance. The police didn't resist until the intruders got further into the building.",
            "title_similarity": "0.7779629",
            "sentiment_compound": -0.9835
        },
        {
            "id": "h8cl4l5",
            "score": -2,
            "text": "So... right after that they'll track down the \"mostly peaceful\" 2020 \"protestors\", right? Right?!?!\n\nnow lemme be real cereal here for a second: what caused more damage to the American economy, a bunch of idiots entering the Capitol and causing some $10k of damage, or the \"protests\" during June of 2020?",
            "title_similarity": "0.72196746",
            "sentiment_compound": -0.7868
        },
        {
            "id": "h8cgvt7",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8ck67o",
            "score": 9,
            "text": "Cool.  I agree.  They should pay more.  But now also do BLM and Antifa.  The hundreds of millions of damage in Portland Oregon to government buildings are getting footed squarely by taxpayers.  I only wish $1.5 million were coming to offset that too.",
            "title_similarity": "0.7889056",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h8bugzf",
            "score": 1,
            "text": "The same reason why any criminal who causes more in damages than he is worth doesn't end up paying out of pocket for the damage.",
            "title_similarity": "0.5080381",
            "sentiment_compound": -0.835
        },
        {
            "id": "h8bw0b0",
            "score": -11,
            "text": "Democrats would rather kick the can than ever hold anyone in a position of power accountable for anything. No legal consequences for anyone in the Reagan administration after the Iran-Contra scandal, no consequences for the Bush administration's war crimes, no consequences for any of the banksters who caused 2008, and no consequences for anyone in the Trump administration for their treason. If they want people to start labelling them as controlled opposition then they're doing a damn good job.",
            "title_similarity": "0.4833325",
            "sentiment_compound": -0.9345
        },
        {
            "id": "h8c9ypx",
            "score": 13,
            "text": "Insurance will pay for it just like it did the $2Bn in damages from the summer of 2020 riots.",
            "title_similarity": "0.69607294",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8chelr",
            "score": -10,
            "text": "What was the antifa damage total?",
            "title_similarity": "0.24801886",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8c58dr",
            "score": 16,
            "text": "So the judge is pulling numbers out of his ass or what ? 500 Million dollars. I call bullshit.",
            "title_similarity": "0.81620955",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h8co7e0",
            "score": -4,
            "text": "Now do BLM riots...",
            "title_similarity": "0.2771542",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8ck9gp",
            "score": 2,
            "text": "r/PoLiTicS",
            "title_similarity": "0.07287698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ct1wh",
            "score": 1,
            "text": "Who had to pay for all the damage that nationwide BLM protests caused?",
            "title_similarity": "0.5665622",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h8cq5mz",
            "score": 2,
            "text": "$500 fucking million?  After the 25 grand in repairs, who the hell is getting paid off this time?",
            "title_similarity": "0.83298767",
            "sentiment_compound": -0.4515
        },
        {
            "id": "h8c4qmf",
            "score": -11,
            "text": " Because they are WHITE",
            "title_similarity": "0.02030204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8brfpm",
            "score": -2,
            "text": "Good luck. Try building a wall and making Mexico pay for it.",
            "title_similarity": "0.34133452",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8co2a9",
            "score": -6,
            "text": "What are all the looters and Antifa paying for their attacks that are and will be felt by even the non-taxpayers?",
            "title_similarity": "0.5330808",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8bz0w5",
            "score": 18,
            "text": "Man I wish I was the contractor that said yeah this is 500 million worth of damage in here.",
            "title_similarity": "0.76255435",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8cill5",
            "score": -9,
            "text": "Wait till you hear about how much the BLM riots cost us over the summer, lol",
            "title_similarity": "0.5819297",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8c7rca",
            "score": 2,
            "text": "Zuckerberg should be prosecuted for TREASON he gave Russian agents access to Facebook tools and data that allowed interference in 2016",
            "title_similarity": "0.51704884",
            "sentiment_compound": -0.7378
        },
        {
            "id": "h8cx4jb",
            "score": -2,
            "text": "Same reason Antifa doesn't clean up their messes I guess",
            "title_similarity": "0.20815718",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h8dmhct",
            "score": 0,
            "text": "its because the rioters wanted to teach us about socialism.",
            "title_similarity": "0.30795518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dnp54",
            "score": 0,
            "text": " Washington Post: Brought to you by Jeff Bezos and Amazon.",
            "title_similarity": "0.3148687",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8du89c",
            "score": 0,
            "text": "Because taxpayers are already footing the bill for BLM riots you fuckin morons. You do all realize that if BLM picked their targets better instead of just fucking up downtown whogivesafucklandago they would be miles ahead with a shitload more support right?\n\nThe US is filled with fucking morons.",
            "title_similarity": "0.59729755",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h91p4sa",
            "score": 0,
            "text": "Why the BLM rioters aren't paying?",
            "title_similarity": "0.34398025",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c9ybg",
            "score": 8,
            "text": "I'd like to know where the 3/4 of a trillion dollar we spend EVERY FUCKING YEAR on \"defense\" goes. 3/4 of a trillion and some hillbilly in a chewbacca bikini walks in the the front door. They didn't even have bullet proof glass or panic buttons for fuck sake.",
            "title_similarity": "0.61344194",
            "sentiment_compound": -0.436
        },
        {
            "id": "h8cgz9w",
            "score": -5,
            "text": "But what about the BLM Riots that cause a kajillion-batrillion-Supercalifragilisticexpialidocious-billion dollars??????  /s",
            "title_similarity": "0.6119241",
            "sentiment_compound": -0.7514
        },
        {
            "id": "h8cimgu",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8cl7rw",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.0023898557"
        },
        {
            "id": "h8clete",
            "score": -4,
            "text": "curious how much the BLM rioters paid?",
            "title_similarity": "0.5445545",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8cje13",
            "score": 5,
            "text": "500 Million?!! Lol was everything made out of gold? What a joke",
            "title_similarity": "0.6424588",
            "sentiment_compound": 0.7135
        },
        {
            "id": "h8cq2or",
            "score": 1,
            "text": "I didn’t read the article so don’t know if it says in there, but how exactly did they come up with the $500 million figure?",
            "title_similarity": "0.68105334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cv5bu",
            "score": 1,
            "text": "How much did the rioters pay for the blm riots ?",
            "title_similarity": "0.6515024",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8cwa9e",
            "score": 1,
            "text": "The truth is there weren't many people inside the capital and there's not 500 million between them to even get.  You can fine people all you want but if they can't pay you don't get anything",
            "title_similarity": "0.5050328",
            "sentiment_compound": 0.3907
        },
        {
            "id": "h8cwba2",
            "score": 1,
            "text": "LOL at the government pretending to care about spending",
            "title_similarity": "0.34666407",
            "sentiment_compound": 0.7983
        },
        {
            "id": "h8cxrt1",
            "score": 1,
            "text": "Why is 501.5 million being spent to clean the capitol building (a building of less worth than a hot dog stand)?",
            "title_similarity": "0.72576797",
            "sentiment_compound": 0.5118
        },
        {
            "id": "h8da7tz",
            "score": -1,
            "text": "Pretty sure they didn’t do 501.5 million dollars of damage in 3-4 hours. Where is this money going?",
            "title_similarity": "0.6280625",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8dblkb",
            "score": -1,
            "text": "Why are Black Lives Matter paying for the 10billion in damages since 2014?",
            "title_similarity": "0.7457658",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8dcysm",
            "score": -1,
            "text": "I say the city of DC sues them for the entire cost of the damage!\n\n>!Right after they fine Antifa and BLM for the billions in damages across the country.!<",
            "title_similarity": "0.6581519",
            "sentiment_compound": -0.7332
        },
        {
            "id": "h8de76v",
            "score": 1,
            "text": "Because we elected morons who overreacted and kept the national guard in town for 5 extra months. We should vote better.",
            "title_similarity": "0.73056203",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8dmbpb",
            "score": -1,
            "text": "I read on CNN and MSNBC a while back that the cost was so high because President Biden had the national guard surround the building for MONTHS after the Capitol riot. Completely unnecessary IMO.",
            "title_similarity": "0.6871526",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8dsvsx",
            "score": -1,
            "text": "While we’re on this topic, how much did BLM rioters pay for the summer of destruction? Asking for a friend…",
            "title_similarity": "0.6134679",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8bwvu1",
            "score": -2,
            "text": "When it's proven (already is in my mind...) that Trump is in fact responsible for this, the bill should fall at his feet.  Ruining him financially as he spends what days remain in jail.",
            "title_similarity": "0.57347524",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8chmv5",
            "score": 0,
            "text": "Because they are white and GQP terrorist.",
            "title_similarity": "0.35517156",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h8civ86",
            "score": -1,
            "text": "I marvel at the hopefulness of many redditors about how some members of the Democratic party can hold Republican politicians accountable. These people play for the same team; the only difference is that they wear different Jerseys. Nothing is going to change.",
            "title_similarity": "0.4702228",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h8ckfgc",
            "score": 3,
            "text": "$500M???   how?",
            "title_similarity": "0.64440864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cqkxb",
            "score": 1,
            "text": "This is the first time I’m hearing of the $500 million being paid by taxpayers.\n\nOk, so I did some reading about it and the 26,000 troops came for the Inauguration of Biden not to retake the Capital. I think it was 2 weeks after the Jan 6 riot that they came. Then, the cost was inflated because they stayed for like 2 months I think? (One article said they left mid-March)\n\nSo the $500 million was for preventative measures of the Inauguration and then for some other reasons they were still deployed a month afterwards. Interesting that I’m only hearing of this now.\n\nI think it is correct, though clearly unpopular, that the Jan 6 rioters don’t pay that fee because it wasn’t something they were directly involved in. The National Guard came to protect the Inauguration rather than displace any of those rioters. \n\nIt’s like saying a hacker should pay, not for the data breach but, they should also pay for the massive overhaul and brand new security system of a company.",
            "title_similarity": "0.8129884",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h8cweys",
            "score": -3,
            "text": "Why don't we get the ones who burned down cities and businesses to also pay?",
            "title_similarity": "0.5343138",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cxl5w",
            "score": 2,
            "text": "Are blm or antifa paying the billions in property damage done last summer? Oh wait, they only damaged innocent civilians property, not that of the government that fucks us all over at every turn.",
            "title_similarity": "0.6925391",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h8cyqmo",
            "score": -1,
            "text": "I wonder who pays for the riots that happened after George Floyd riots for BLM? All of the taxpayers in every city..",
            "title_similarity": "0.6711532",
            "sentiment_compound": -0.765
        },
        {
            "id": "h8dz9tp",
            "score": -2,
            "text": "Can we sue the BLM rioters too for driving business away by burning them down as well?",
            "title_similarity": "0.50446343",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8e4qox",
            "score": -2,
            "text": "Why are none of the rioters and looters in Portland and Minneapolis not paying any restitution but taxpayers are? That’s an even more interesting question",
            "title_similarity": "0.505309",
            "sentiment_compound": 0.611
        },
        {
            "id": "h8e67gh",
            "score": -3,
            "text": "The idea they were trying to overthrow the government is laughable.  How’d they get to 500 million?  Including the crazy manhunt By the fbi  going after these people that were let in the capital building by cops.  to see government go after these people Does one thing... Killing the first amendment and sending the message.  Fascism will always come from antifascits.",
            "title_similarity": "0.68384624",
            "sentiment_compound": -0.765
        },
        {
            "id": "h8d911t",
            "score": -7,
            "text": "Probably because the $500 million was due to congress overreacting and calling out the National Guard. The night of Jan 6th only 68 people were arrested breaking the curfew. Compared to the BLM \"[protests](https://www.cnn.com/2021/01/08/us/dc-police-arrests-blm-capitol-insurrection-invs/index.html)\", there was less people arrested and violent, though in both cases violence was not excusable.",
            "title_similarity": "0.74232495",
            "sentiment_compound": -0.9315
        },
        {
            "id": "h8cv0he",
            "score": -3,
            "text": "What is BLM paying for their summer shenanigans?",
            "title_similarity": "0.30746055",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8drgac",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8chk0u",
            "score": 0,
            "text": "Clearly rioters NOW believe in socialism.",
            "title_similarity": "0.24466711",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8ckvoh",
            "score": 0,
            "text": "For the same reason tax papers part for all riots. Because the people that cause then don't make enough to fix it in their lifetimes.\n\n... I'm not justifying. It is just a logical and practical conclusion.",
            "title_similarity": "0.56646675",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8cmrhg",
            "score": 0,
            "text": "Because the capitol rioters don't have a net worth of more than $500,000,000.00 and aren't comprised of 200,000,000+ people. Bill them and see how well that collection goes for you because a few dozen F-150s and gun collections aren't going to get you to 500 million.",
            "title_similarity": "0.7980571",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8cnfua",
            "score": -5,
            "text": "I think the problem here is 99.x% of the attendees to the rally had no intention and exhibited no actions of insurrection.  \n\nPretty much anyone who knows someone who went knows this.\n\nNow, if you accept this fact, then you have to recognize that you should not just round up everyone in attendance, certainly not if you want any semblance of justice to be served.\n\nSo, now you need to go track down the however many people actually trespassed and vandalized and/or committed violence at the capital. Then you have to prove intent, which is a lot harder.\n\nFinally, I can't find a reliable estimate of the number of people who actively engaged in the trespassing, vandalism, and violence. If you were to assume 1000 people that would amount to 500k per person, which the vast majority do not have the means to pay...\n\nIt is better to go after the actual, verifiable premeditated conspirators and nail them to the wall.",
            "title_similarity": "0.5976836",
            "sentiment_compound": 0.6096
        },
        {
            "id": "h8cnjh7",
            "score": -4,
            "text": "Because it wasn't a riot",
            "title_similarity": "-0.10873699",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h8cot3o",
            "score": 0,
            "text": "Or less than 10 dollars per taxpayer",
            "title_similarity": "0.3829551",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cpv62",
            "score": 3,
            "text": "It’s very amusing to me all the conservatives on here demanding that BLM pay for damages that occurred last summer. I’m sure they would have to pay for damages of it were a priority to find individuals who caused damages. I’d wager that the attempted coup/insurrection is higher on the pecking order. Because, you know, domestic terrorism - overthrowing the government, etc. the looting of a few Targets that unfortunately happened after a well intentioned protest isn’t excusable but there are just bigger fish to fry and frankly sane people aren’t interested in your narrative. We are over here trying to keep the country together.",
            "title_similarity": "0.6344147",
            "sentiment_compound": -0.4595
        },
        {
            "id": "h8cr6ib",
            "score": 0,
            "text": "It’s all a waste of taxpayers $",
            "title_similarity": "0.34403163",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8crf19",
            "score": 0,
            "text": "Good fucking question",
            "title_similarity": "-0.04610654",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8crn5l",
            "score": 0,
            "text": "Lol pay for news lol",
            "title_similarity": "0.24534094",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8cv79k",
            "score": 0,
            "text": "For taking a selfie in the senate,\n\nAn odd job man would take a week to fix it, a hand rail to screw back up, a fire extinguisher to put back on a hook after not being used to batter a pig, a few panes of glass ect.",
            "title_similarity": "0.5736456",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8cwmsx",
            "score": 0,
            "text": "Why do people post WaPo content so much on reddit? I refuse to give that douche any more money.",
            "title_similarity": "0.4867407",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8cx50d",
            "score": 0,
            "text": "Because you won't get that much out of them. The hundred idiots that stormed the capital don't have that kind of money.",
            "title_similarity": "0.58364594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cxst0",
            "score": -4,
            "text": "How about Antifa and their 1.5 billion though?\n\nOh yeah, we don’t talk about that.",
            "title_similarity": "0.50318533",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8czeem",
            "score": 0,
            "text": "Or just get the series S or X",
            "title_similarity": "0.031740323",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d04op",
            "score": 0,
            "text": "Boys have penises and girls have vaginas",
            "title_similarity": "0.20236737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d45lw",
            "score": 0,
            "text": "Answer: Because the government has a thing for subsidizing loses and privatizing profits",
            "title_similarity": "0.50606537",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8d8xal",
            "score": 0,
            "text": "How the actual fuck were the damages $500M?",
            "title_similarity": "0.8195736",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h8d9haw",
            "score": 0,
            "text": "That's about the amount of damage they did in that day. The rest was a result of the increased security after the fact. \n\nIf you think that's weird. Should all the criminals in Chicago have to pay for the increased police presence because of the high crime rate?",
            "title_similarity": "0.6238231",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h8d9us9",
            "score": 0,
            "text": "Ask why landlords are paying the same amount as the taxpayers and the government, who banned landlords rights to their properties, is paying the rioters share?",
            "title_similarity": "0.6651852",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8dawpp",
            "score": 0,
            "text": "Paywall",
            "title_similarity": "0.2409384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8daz75",
            "score": 0,
            "text": "Cause they’re white and that’s how America works?\n\nPre-emptive edit to tell all the “bUt ItS a ClAsS tHiNg” people to shut up and read a book.",
            "title_similarity": "0.37805256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dca6z",
            "score": 0,
            "text": "I got the white answer",
            "title_similarity": "-0.055927165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ddtkt",
            "score": 0,
            "text": "I wonder how much tax payers are dishing out for portland? At least this way we arent paying for all of it.",
            "title_similarity": "0.5774523",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dedgy",
            "score": -5,
            "text": "Probably the same reason the BLM and antifa thugs won’t be paying the $4B (and counting) of damage that they caused…..",
            "title_similarity": "0.6097799",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8dengy",
            "score": -5,
            "text": "Good question. Also, Will blm protesters be paying for the city's they burned?",
            "title_similarity": "0.5697757",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8dfuf0",
            "score": 0,
            "text": "How is there half a billion in damages?!!",
            "title_similarity": "0.65297985",
            "sentiment_compound": -0.5399
        },
        {
            "id": "h8dgr9j",
            "score": -5,
            "text": "Who’s paying for the BLM riots?",
            "title_similarity": "0.47279745",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8dlryy",
            "score": 0,
            "text": "Lmao it’s ridiculous the number the government can come up with for what shit costs",
            "title_similarity": "0.48562357",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8ds11h",
            "score": -4,
            "text": "Did we charge BLM for the riots last summer?",
            "title_similarity": "0.53711116",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8dy56s",
            "score": 0,
            "text": "What riot?",
            "title_similarity": "0.16073486",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8e2n15",
            "score": 0,
            "text": "Weird how we've collectively ignored the whole thing. Almost like the rioters are too stupid to be tried as adults.",
            "title_similarity": "0.38160643",
            "sentiment_compound": -0.6361
        },
        {
            "id": "h8e2ntt",
            "score": -4,
            "text": "Good question! And why is BLM paying $0 instead of $8 Billion?",
            "title_similarity": "0.6645672",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h8e6lzb",
            "score": 0,
            "text": "That's hilarious. The government didn't care about the millions of property damaged until it was their property.",
            "title_similarity": "0.516052",
            "sentiment_compound": -0.4268
        },
        {
            "id": "h8e8x9x",
            "score": 0,
            "text": "For the same reason protesters can burn down a city, because the usa is just a horrible reality show",
            "title_similarity": "0.50120455",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8eb34n",
            "score": 0,
            "text": "Cause it was a mostly peaceful protest like the ones in Portland or Chicago. You know the ones that burned down a police station over threw the local government and created the autonomous zone killing dozens.",
            "title_similarity": "0.5769632",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8ekt83",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.0023898557"
        },
        {
            "id": "h8eq4d8",
            "score": 0,
            "text": "Know whats funny? \n\nThe second you unplug from the internet, just about everyone you meet will call these people patriots and heroes.",
            "title_similarity": "0.47699603",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h8eunm5",
            "score": 0,
            "text": "Half a billion dollars worth of damage? Of course the assholes who caused the damage should be punished strongly, but how do you cause half a billion US dollars worth of damage. Where do they get that number from. This cant be limited to structural damage. Half a billion dollars is the gdp of many small countries (guessing cos i dont know)",
            "title_similarity": "0.7745939",
            "sentiment_compound": -0.886
        },
        {
            "id": "h8f0aso",
            "score": 0,
            "text": "Yay!\n\nAnother **paywalled** article!\n\nThanks OP!",
            "title_similarity": "0.28373036",
            "sentiment_compound": 0.8007
        },
        {
            "id": "h8f9le7",
            "score": 0,
            "text": "Similar thing happened with all the BLM riots",
            "title_similarity": "0.2997873",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8g0o6c",
            "score": 0,
            "text": "Hmmm, same could be said for all the billions lost during the BLM riots.",
            "title_similarity": "0.68442905",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h8g1dk0",
            "score": 0,
            "text": "Well there are roughly 350 million tax payers and les than a thousand capital rioters so.. this is misleading. \n\nBut they had their public info released and they were also arrested so... I mean do we need to really charge them 500 million so they just go bankrupt?",
            "title_similarity": "0.8816873",
            "sentiment_compound": -0.8847
        },
        {
            "id": "h8ggzwp",
            "score": 0,
            "text": "So we're really gonna talk about nothing but Trump and January 6th every single day, 7 months after the fact? There are other things happening in politics right now.",
            "title_similarity": "0.54618573",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8h37g8",
            "score": 0,
            "text": "$500M is just under what it will cost of damages in the Minneapolis riots last summer. \n\nAnd, no cops were killed in Minneapolis.",
            "title_similarity": "0.7485228",
            "sentiment_compound": -0.9169
        },
        {
            "id": "h8hi5t2",
            "score": 0,
            "text": "Those are expensive windows",
            "title_similarity": "0.24758942",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fb10f",
            "score": 0,
            "text": "And who will pay for the billions in damages caused by the BLM riots? Which were a series of actual riots not some patriots walking into a public building and taking photos",
            "title_similarity": "0.7021328",
            "sentiment_compound": -0.872
        },
        {
            "id": "h8bpxxe",
            "score": 22,
            "text": "Probably a pragmatic issue - a judge can impose a $500,000 judgement against a party, but if that party is never going to be able to pay that, it's meaningless.",
            "title_similarity": "0.8361809",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h8chabr",
            "score": -4,
            "text": "Those “rioters” are actually tax paying citizens.",
            "title_similarity": "0.47976625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cwis5",
            "score": -6,
            "text": "I’d like to ask why BLM is paying zero while the taxpayers are paying 2 billion.",
            "title_similarity": "0.6878005",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8dbdeq",
            "score": -6,
            "text": "$500 million for some broken windows? What?\n\nThere were no cities being razed to the ground like there were last summer during the BLM/Antifa riots.",
            "title_similarity": "0.7735552",
            "sentiment_compound": -0.755
        },
        {
            "id": "h8dscvv",
            "score": -5,
            "text": "What about the destruction from BLM and Antifa from all last year?? Smh",
            "title_similarity": "0.50897306",
            "sentiment_compound": -0.7476
        },
        {
            "id": "h8coue4",
            "score": 6,
            "text": "Look at all the sheep comparing the coup attempt to the BLM riots. Hilarious! No one said the riots were a good thing. Unlike she coup attempt where Republicans and other morons say simultaneously that they didn’t happen and they were no big deal and they were Pelosi’s fault. The mental weakness of the traitor movement is a good thing for we true patriots.",
            "title_similarity": "0.5217309",
            "sentiment_compound": -0.7777
        },
        {
            "id": "h8dnbs4",
            "score": -6,
            "text": "While tax payers are also paying a shit ton of money for the BLM riots too, right?",
            "title_similarity": "0.6101318",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h8cirdr",
            "score": 1,
            "text": "Does the judge not understand how expensive it is to prosecute (and locate) an individual? I really can't believe the judge is serious.",
            "title_similarity": "0.49115556",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8cixtd",
            "score": 1,
            "text": "500million? Gov contracts are fishy",
            "title_similarity": "0.5804073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cj7y1",
            "score": 1,
            "text": "Maybe we’d pay less if it wasn’t for the constant pursuit of new things to tax Americans for. Let us not forget the ones taxing us are the very politicians behind the attacks in the first place.",
            "title_similarity": "0.61726946",
            "sentiment_compound": -0.3887
        },
        {
            "id": "h8ck8zw",
            "score": -1,
            "text": "Can somebody explain?  Are there rioters paying anything?",
            "title_similarity": "0.35035628",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8clf3z",
            "score": -1,
            "text": "To so readily accuse people of being conspiracy theorists , I am hearing a lot of conspiracy theory",
            "title_similarity": "0.34642962",
            "sentiment_compound": -0.835
        },
        {
            "id": "h8cm5e9",
            "score": 1,
            "text": "Y'all are getting grifted grifted LMAO America is such a shit show. Slap on the wrist for terrorists and the taxpayer foots the bill for Capitol renovations. Repairs wouldn't cost 500 milly, this is them taking advantage of the situation and turning this into Pimp My Capitol.",
            "title_similarity": "0.7086743",
            "sentiment_compound": -0.1197
        },
        {
            "id": "h8cmola",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8cpfdn",
            "score": -1,
            "text": "The tax payers? LoL the ultra rich movie stars and billionaires ? Hahaha who paid for all the riots? The regular people did, we pay for everything in one way or another.",
            "title_similarity": "0.6509553",
            "sentiment_compound": 0.7808
        },
        {
            "id": "h8croje",
            "score": -1,
            "text": "Half a billion dollars?! come on now the whole building isn't worth that",
            "title_similarity": "0.5630446",
            "sentiment_compound": -0.2401
        },
        {
            "id": "h8ctwdv",
            "score": 1,
            "text": "They should pay every dime. So should the rioters who set fire to federal court houses in Portland and burned down buildings in Minneapolis. Somehow this is a controversial view.",
            "title_similarity": "0.63989455",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8cuh9d",
            "score": 1,
            "text": "Taxpayers won't \"pay\" anything. Federal government funds itself.",
            "title_similarity": "0.35613465",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h8cv1yl",
            "score": -1,
            "text": "How bout asking what tax payer dollars will cover the billions in damage from BLM \"peaceful\" protests?",
            "title_similarity": "0.72146416",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8cv3t5",
            "score": -1,
            "text": "What about the BLM and antifa mostly peaceful protest? If we’re gonna make the Jan 6 dipshits pay for the damages, then let’s go after the others.",
            "title_similarity": "0.491678",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8d2de6",
            "score": -1,
            "text": "Man I wish I could pull 500 million out of my ass for security. The fuck are robocops defending the fucking place?",
            "title_similarity": "0.78567344",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8d3i0a",
            "score": 1,
            "text": "500 mill for a broken window.. makes sense",
            "title_similarity": "0.5406263",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8d3j3m",
            "score": 1,
            "text": "How will it cost the government $500M? For what?",
            "title_similarity": "0.7836636",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d3ots",
            "score": 1,
            "text": "It's ridiculous how little people actually went to jail for this. None of the politicians that instigated it got thrown in jail. Shit is so weird.",
            "title_similarity": "0.48156416",
            "sentiment_compound": -0.796
        },
        {
            "id": "h8d76hr",
            "score": -1,
            "text": "I've possessed a collection of almost 2tb of videos taken during the incident and have watched many, many hours of them.  \nI have some serious doubts that the repairs are going to cost anywhere near $500 Million. I'd like to see the receipt.  \n\nIt's okay though. Being a warmongering country, US taxpayers have paid way more than that to this date, and will continue to pay way more than that going forward. On things unspeakable and unquestionable. This is but a small blip, a distraction, and an excuse.",
            "title_similarity": "0.76772034",
            "sentiment_compound": -0.6059
        },
        {
            "id": "h8d7cbd",
            "score": -1,
            "text": "Were the windows made of diamonds? Wtf could cost 1.5 million, let alone half a billion",
            "title_similarity": "0.76610863",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h8dfdub",
            "score": 1,
            "text": "I warned that these fuckers rioting should be billed for all costs associated. Fucking dumb. Fuck you trump supporters.",
            "title_similarity": "0.5351054",
            "sentiment_compound": -0.8878
        },
        {
            "id": "h8dglqo",
            "score": 1,
            "text": "I say make each convicted insurrectionist share the total cost. Should they provide information to lead to an arrest, they get a credit on the debt and adding more names also lowers the burden for themselves further. It could potentially spread through the swamp like wildfire.",
            "title_similarity": "0.52610683",
            "sentiment_compound": -0.3102
        },
        {
            "id": "h8dh5v9",
            "score": 1,
            "text": "What exactly is the taxpayer paying for? 500 million dollars for what? For some spray paint?",
            "title_similarity": "0.7852352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dj8a5",
            "score": -1,
            "text": "You’re comparing 200 million people to a few thousand or less which is an unfair comparison. If you did the math you’d realise that the capital rioters are paying significantly more in proportion to taxpayers.",
            "title_similarity": "0.76483095",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8dotqo",
            "score": 1,
            "text": "Maybe because there’s about 150 million more taxpayers than there were rioters",
            "title_similarity": "0.7027807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dteaa",
            "score": -1,
            "text": "Um. I'd like to see an itemized bill. Seems a little steep for the damage done. Even including the cost of tracking down those involved.",
            "title_similarity": "0.46000555",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8e1qrt",
            "score": -1,
            "text": "Question is why BLM and Antifa don't pay anything",
            "title_similarity": "0.18076873",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h8e33jt",
            "score": 1,
            "text": "how come none of the billionaires of the US are donating to repair these damages? when an old shitty church in france burns down, everyone’s happy to fork over millions to repair it, but when the capitol gets a few scratches on it, nobody has a dollar to spare?",
            "title_similarity": "0.64339435",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h8ee8bi",
            "score": -1,
            "text": "$500 million for what?  They broke a few windows.  They didn't burn down cities and businesses and cars like BLM and Antifa did all last year.  Nobody had a problem with that.",
            "title_similarity": "0.7076615",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8efld9",
            "score": -1,
            "text": "How are you guys still on this?, CHAZ/CHOP was much worse and nobody goes on about that anymore",
            "title_similarity": "0.26378426",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8egi2b",
            "score": -1,
            "text": "BLM terrorists paid nothing",
            "title_similarity": "0.29280192",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8ei0ht",
            "score": -1,
            "text": "Murica, do you know what is a real riot ?? \nOh yeah, i forgot Portland and his \"peaceful protest\".. lmao",
            "title_similarity": "0.42939937",
            "sentiment_compound": 0.6199
        },
        {
            "id": "h8elrfd",
            "score": -1,
            "text": "Hmm, I don't see BLM having to pay anything for their billions of dollars in damage.",
            "title_similarity": "0.48899752",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8jzsqr",
            "score": -1,
            "text": "How much are the summer rioters paying for the vandalism, looting, burning, and killing?",
            "title_similarity": "0.5687513",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8d5dnl",
            "score": -6,
            "text": "You donkey do realize it was antifa dressed in maga gear that stormed the capital right?",
            "title_similarity": "0.3870617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dapzf",
            "score": -7,
            "text": "Now ask the same question to the BLM movement and multiple that amount by 10",
            "title_similarity": "0.29791772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dmnsd",
            "score": -8,
            "text": "How much did BLM pay?",
            "title_similarity": "0.33332616",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8c9mib",
            "score": 2,
            "text": "Because white Republicans",
            "title_similarity": "0.22888982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ch9hk",
            "score": 2,
            "text": "Why are we paying $500M?  I mean honestly how much do new windows cost",
            "title_similarity": "0.85317314",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8cikir",
            "score": -2,
            "text": "Maybe the rioters got a second quote and found a decent price , unlike the government taking the highest bidder",
            "title_similarity": "0.5480995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cj6rh",
            "score": 2,
            "text": "So what about this costs $500 million? And why do I have to be a part of paying for it?",
            "title_similarity": "0.80044484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cl5t3",
            "score": -2,
            "text": "Same reason the military paid with their lives while the right and left wings of our government spent TRILLIONS of dollars of our tax paying money to fund wars for oil and power.",
            "title_similarity": "0.67515403",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8clpjq",
            "score": -2,
            "text": "Jan 6?  Peaceful tourists.  Never happened.  Both sides.  Move along.  Nothing to see.",
            "title_similarity": "0.15067884",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8coc6z",
            "score": -2,
            "text": "They did more damage then the BLM rioters combined.. I think that total was like 40 million?",
            "title_similarity": "0.6847055",
            "sentiment_compound": -0.1815
        },
        {
            "id": "h8covfu",
            "score": 2,
            "text": "better question what part of it was even remotely close to $500M in damages? the largest number ive seen thrown around is $32M wtf",
            "title_similarity": "0.8252237",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8crvbm",
            "score": -2,
            "text": "I could fix that broken window for like $20 but who would’ve thought that the state doesn’t effectively use tax payers money",
            "title_similarity": "0.74636817",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h8cusgg",
            "score": -2,
            "text": "How much did the damage cost around the country when the BLM/Antifa rioters caused during summer of 2020🤡",
            "title_similarity": "0.6227696",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8cvzon",
            "score": -2,
            "text": "The people who entered the Capitol were criminals like the Black Live Matter criminals!  all those who go against the police are also criminals! Criminals for prison now !!!",
            "title_similarity": "0.5522697",
            "sentiment_compound": -0.9563
        },
        {
            "id": "h8cxg6p",
            "score": -2,
            "text": "Literally nothing happened lmfao",
            "title_similarity": "0.013240658",
            "sentiment_compound": -0.431
        },
        {
            "id": "h8czcje",
            "score": -2,
            "text": "The same reason why the people who live in Minneapolis and Portland are.",
            "title_similarity": "0.18999653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d3k63",
            "score": -2,
            "text": "Lol what about all the shit tax payers will end up paying for in all the cities that got looted and businesses burned? What's that? Crickets? Figured",
            "title_similarity": "0.6363493",
            "sentiment_compound": 0.8095
        },
        {
            "id": "h8d3sqv",
            "score": 2,
            "text": "How in the world is that costing us 500 million dollars?? What are they spending all that money on damn.",
            "title_similarity": "0.8138974",
            "sentiment_compound": -0.4696
        },
        {
            "id": "h8d4tnj",
            "score": -2,
            "text": "Now do the riots all over the country",
            "title_similarity": "0.41133994",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8d86a6",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8d910r",
            "score": 2,
            "text": "The damage done was 500 million? What exactly did they break?",
            "title_similarity": "0.7650111",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h8d9m6o",
            "score": -2,
            "text": "How much did the terrorists in Minneapolis have to pay when they burned businesses to the ground?",
            "title_similarity": "0.6457248",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h8dfmgv",
            "score": -2,
            "text": "Now do the BLM/Antifa riots and looting over last 5yrs.",
            "title_similarity": "0.613351",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8dkmva",
            "score": -2,
            "text": "What about the BLM riots all throughout 2020",
            "title_similarity": "0.34530902",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8dn4zl",
            "score": -2,
            "text": "Biden is a schmuck.",
            "title_similarity": "0.12865743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8doz70",
            "score": -2,
            "text": "Great question. I'd like to know when all those rioters will pay back all the businesses they destroyed too! After all, we'd hate to endorse lawlessness and it's not fair that taxpayers foot the bill amirite?",
            "title_similarity": "0.5996627",
            "sentiment_compound": -0.1665
        },
        {
            "id": "h8dx2z7",
            "score": 2,
            "text": "I mean yeah, they should have all been sentenced to death or thrown out of the country. They are traitors who attacked the capitol, they are not americans.",
            "title_similarity": "0.5497601",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h8ecbn9",
            "score": -2,
            "text": "How much did taxpayers pay for the BLM riots?",
            "title_similarity": "0.680483",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8gj1f7",
            "score": -2,
            "text": "Who’s paying for all the BLM riots that caused billions in damages?",
            "title_similarity": "0.7217648",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h8bzteq",
            "score": -9,
            "text": "500 million for what?",
            "title_similarity": "0.4990337",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c7je7",
            "score": 2,
            "text": "Good fucking question.",
            "title_similarity": "-0.045299236",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8cbotu",
            "score": 4,
            "text": "Their glorious leader, trump should pay.",
            "title_similarity": "0.26177934",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8cfwff",
            "score": 3,
            "text": "500 million? Another example of government financial negligence.",
            "title_similarity": "0.71819735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cfxcj",
            "score": 3,
            "text": "Dang 500 million. I want to see receipts.",
            "title_similarity": "0.61623996",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8cicdk",
            "score": 4,
            "text": "I'm not saying that the rioters shouldn't pay more, but $500million Also seems like a lot to spend...it's like to see a break down of what that's being spent on",
            "title_similarity": "0.8337131",
            "sentiment_compound": 0.7682
        },
        {
            "id": "h8cil80",
            "score": 4,
            "text": "What’s the breakdown of this 500 million lol",
            "title_similarity": "0.6089873",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8cj10c",
            "score": 2,
            "text": "I doubt capital rioters even have 15 brain cells to rub together. Fat chance of them coughing up 500 mil.",
            "title_similarity": "0.7924501",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8codp1",
            "score": 4,
            "text": "Can someone tell me where they are getting this figure from? $500m??",
            "title_similarity": "0.7394918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cq00z",
            "score": -4,
            "text": "Shit, I live in Portland and I ask that question in regards to my city everyday!",
            "title_similarity": "0.2117722",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h8crabr",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8cuux0",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.049614143"
        },
        {
            "id": "h8d0crh",
            "score": -3,
            "text": "Now do antifa for the last 2 years",
            "title_similarity": "0.30641013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d2ypp",
            "score": -3,
            "text": "In this thread: dems start caring about government spending",
            "title_similarity": "0.35046434",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8d5la5",
            "score": -5,
            "text": "Can someone explain what in the world cost 500 million? They broke some windows. The fuck",
            "title_similarity": "0.764258",
            "sentiment_compound": -0.743
        },
        {
            "id": "h8d7fb9",
            "score": -4,
            "text": "What about the rioters who burnt down businesses and police stations?",
            "title_similarity": "0.44162828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8djwtn",
            "score": -2,
            "text": "How much did antifa/blm pay for the extensive damage, arson and injuries to 60 SS agents that they caused in our nations Capitol during 2020’s “summer of love” ??",
            "title_similarity": "0.71232456",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h8e59zq",
            "score": -3,
            "text": "How much did BLM have to cough up?",
            "title_similarity": "0.26834697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8e8ch6",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8emlv0",
            "score": -4,
            "text": "Why is no one upset that the anti police movement did around 2 billion in damage and the rioters were freed through a bail fund supported by the Vice President.",
            "title_similarity": "0.7213936",
            "sentiment_compound": -0.1321
        },
        {
            "id": "h8cr3w0",
            "score": -14,
            "text": "How much did antifa or BLM pay for all the shit that they destroyed?",
            "title_similarity": "0.57328254",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h8c6jsq",
            "score": 26,
            "text": "In another thread today, someone suggested that we do \"forensic audits\" in multiple states to placate Trump and his followers. It's as if people don't know where money comes from and how much things cost!\n\nThe US should sue Trump and his accomplices for every penny, plus some. And do not spend even one more taxpayer dollar on any more frivolous election lawsuits or audits. Way too much time, money, and energy has been spent placating buffoons, grifters and crooks.\n\nInstead, just \"Lock them up.\"",
            "title_similarity": "0.6807423",
            "sentiment_compound": 0.1352
        },
        {
            "id": "h8crvxc",
            "score": -15,
            "text": "Are we just going to ignore BLM burnt down cities and destroyed businesses???",
            "title_similarity": "0.45606774",
            "sentiment_compound": -0.7383
        },
        {
            "id": "h8bxyho",
            "score": 3,
            "text": "We’re always cleaning up after these idiots’ messes.",
            "title_similarity": "0.16810313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c5plc",
            "score": 5,
            "text": "It's your typical White Elephant sale discount",
            "title_similarity": "0.30648243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8caji6",
            "score": 3,
            "text": "Send the bill for the rest to the republican party.",
            "title_similarity": "0.4608094",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8cem3w",
            "score": -5,
            "text": "What are the cops that waved them in paying?",
            "title_similarity": "0.31424284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ci09n",
            "score": 4,
            "text": "Because their combined net worth is only $9,000",
            "title_similarity": "0.49454907",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8clfy7",
            "score": -6,
            "text": "Why isn’t Antifa and BLM paying for all of the destruction they caused?",
            "title_similarity": "0.49816984",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8cm2f0",
            "score": -4,
            "text": "Putting it into a better context, who is paying for the damage and police protection caused by rioters in many cities over the last 18 months or so, in the name of racial strife and principles of equality?",
            "title_similarity": "0.6237335",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8cm687",
            "score": -4,
            "text": "Blm?",
            "title_similarity": "-0.071919024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cngsr",
            "score": -5,
            "text": "Same fucking reason why MSP took money out of everyone's pockets to repair damage from the riots last year. Depending on estimates it was $300 million+. I think that was only for property damage, not to mention the months of guard and police deployments.\n\nHow about we treat those rioters the same as the ones on Jan 6?",
            "title_similarity": "0.7909496",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h8conr6",
            "score": 3,
            "text": "What if there was a supposed billionaire who sparked all this that could be held liable…",
            "title_similarity": "0.44832858",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cwdco",
            "score": 4,
            "text": "I would have no problem turning out every single family who included a  treasonous rioter into the fucking street and leave them destitute, except for the ones who turned them in.   In that case, they should get a tax cut on a percentage of the traitors assets for assisting the federal government in rooting out these traitors.\n\nFucking Trump supporters donate millions to Cheeto Wussolini, they can pony up to keep these families of traitors off goobermint welfare.\n\nI'm kinda waiting for one of these scumbags to whine about how their life is ruined now that they has a criminal record, and that no one will hire them and how their spouse and kids left them and hate their fucking guts for the shit they put them through.",
            "title_similarity": "0.67926955",
            "sentiment_compound": -0.8758
        },
        {
            "id": "h8d1ulp",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.049614143"
        },
        {
            "id": "h8d59nf",
            "score": -4,
            "text": "Who paid for all the ANTIFA burning looting and murders?",
            "title_similarity": "0.5413385",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h8dgt27",
            "score": -5,
            "text": "Now do BLM and all the shit they’ve done for the past few years.",
            "title_similarity": "0.27892998",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h8e59k7",
            "score": -5,
            "text": "How much did the leftist rioters pay for their year of fun last year?",
            "title_similarity": "0.6776838",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8ecpo6",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.049614143"
        },
        {
            "id": "h8ci806",
            "score": -14,
            "text": "They shouldn’t lay anything. BLM rioters caused around 2 Billion dollars in damages just after Floyd’s death, and they are t paying for any of it.",
            "title_similarity": "0.69855547",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h8clt9y",
            "score": 16,
            "text": "I do not care if the government makes a profit. I don't even care if insurrectionists go to prison.\n\nI want convictions. I want proof that attempting to overthrow the US government is a crime.",
            "title_similarity": "0.49036485",
            "sentiment_compound": -0.8204
        },
        {
            "id": "h8c1xtp",
            "score": -6,
            "text": "Because the government needs to ~~give money to Israel~~ fund social programs!",
            "title_similarity": "0.3710426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cjl9p",
            "score": 5,
            "text": "Bankrupt them and the cowardly gravy seal organizations they represent, including the Republican party.",
            "title_similarity": "0.50677514",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8clbw6",
            "score": -7,
            "text": "Why don't you have the Blm and Antifa organizations pay the 2 billion worth of damage they caused.",
            "title_similarity": "0.7385646",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8cp9ra",
            "score": 4,
            "text": "Well, it's because they're white, judge, do you really not know this?",
            "title_similarity": "0.27339506",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8csrsr",
            "score": -6,
            "text": "Don’t ask how much taxes paid to recover from blm rioters",
            "title_similarity": "0.536435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cz264",
            "score": -6,
            "text": "The same reason BLM and Antifa didn't pay their share after destroying shit. Politicians don't care about holding people accountable.",
            "title_similarity": "0.38905156",
            "sentiment_compound": -0.8865
        },
        {
            "id": "h8cz48i",
            "score": -5,
            "text": "How did that cost $500 million?  What did the BLM riots cost?",
            "title_similarity": "0.8487339",
            "sentiment_compound": -0.5661
        },
        {
            "id": "h8d0nm4",
            "score": -6,
            "text": "Why aren’t blm rioters paying anything at all. The real question is why are Capitol protestors being kept in solitary confinement 24/7",
            "title_similarity": "0.43415076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d1288",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.049614143"
        },
        {
            "id": "h8d3092",
            "score": -5,
            "text": "How much was the year long 2020 riots?",
            "title_similarity": "0.49641612",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8d35on",
            "score": -6,
            "text": "I didn't know moving podium back costs 500M.\nI guess he calculates the cost of the national guard, you know the guys they brought there after it was all over but kept them there because it was \"really cereal you guys\".",
            "title_similarity": "0.63198006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d3omu",
            "score": -5,
            "text": "why are they expected to pay millions for breaking a window but the antifa/blm thugs didn't have to pay a cent for the cities they burned?",
            "title_similarity": "0.7104099",
            "sentiment_compound": 0.0629
        },
        {
            "id": "h8dj4ik",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8djakx",
            "score": -5,
            "text": "That's what we asked about the BLM protests all last summer.....",
            "title_similarity": "0.37075114",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8dnr5q",
            "score": -3,
            "text": "This is true, it’s also true that those who did damage during BLM riots aren’t being held accountable either. So at least it’s equal",
            "title_similarity": "0.31330216",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8dp48d",
            "score": -5,
            "text": "How mush did BLM pay of their damages? Or Antifa? Yall are seriously clowns",
            "title_similarity": "0.46245503",
            "sentiment_compound": -0.6553
        },
        {
            "id": "h8ecaey",
            "score": -5,
            "text": "How much did BLM and Antifa rioters pay for 3 billion in destruction to our cities?",
            "title_similarity": "0.71176875",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8cimnf",
            "score": 19,
            "text": "watching the\\_donald lose it's collective minds in this thread is hilarious. You lost control of the narrative dipshits.",
            "title_similarity": "0.35067967",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8c74tf",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8cl56b",
            "score": -6,
            "text": "This is outrageous Nancy Pelosi should take responsibility like a real adult",
            "title_similarity": "0.2494671",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8clh2z",
            "score": -7,
            "text": "What BLM paying for the summers riots?",
            "title_similarity": "0.5105401",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8clmaz",
            "score": -6,
            "text": "Who is paying for BLM riots?",
            "title_similarity": "0.44508368",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8clyu6",
            "score": -7,
            "text": "Did the rioters from last summer fully reimburse all of the cities they destroyed ? Asking for a friend",
            "title_similarity": "0.65900004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cmo5q",
            "score": -6,
            "text": "Imagine if we went after all the assholes that burnt businesses and murdered folk and took over city blocks.",
            "title_similarity": "0.5091107",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h8cneu1",
            "score": 6,
            "text": "Make trump pay for it, he started it.",
            "title_similarity": "0.3328045",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cpnw7",
            "score": 5,
            "text": "America:\n\nPrivatize the profits to those on top.\n\nSocialize the losses to everyone.\n\nWe are paying because this is how it always works",
            "title_similarity": "0.47728643",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8cze8o",
            "score": -8,
            "text": "How much damage did those BLM freaks cause?",
            "title_similarity": "0.39223313",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8czkf1",
            "score": -6,
            "text": "How much are the BLM rioters paying?",
            "title_similarity": "0.5815319",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d52pr",
            "score": -8,
            "text": "Did the make the few BLM looters and arsonists pay back damages? \n\nLegit question. I don't know how these type of riots have been dealt with in the past regarding paying damages",
            "title_similarity": "0.602777",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h8dpkwa",
            "score": -5,
            "text": "You forgot about the over 1 billion in damage because of the BLM protests and riots",
            "title_similarity": "0.6577045",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h8cgla6",
            "score": 25,
            "text": "When a cop kills someone and the city pays their family 10 million dollars, all of that money is coming from the innocent taxpayers, ***and none of it is coming from the cop who caused the lawsuit.***",
            "title_similarity": "0.7382511",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8ckayv",
            "score": 8,
            "text": "Conservatives? Pay for something? That a joke?",
            "title_similarity": "0.30882704",
            "sentiment_compound": 0.327
        },
        {
            "id": "h8cpgdq",
            "score": -8,
            "text": "Why aren't blm rioters being made to pay for their damage?",
            "title_similarity": "0.4443481",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8cpmhj",
            "score": -7,
            "text": "I don’t think dems want to go down this road… the riots throughout the country cost way more then the capital riots",
            "title_similarity": "0.6151619",
            "sentiment_compound": -0.743
        },
        {
            "id": "h8cpz9h",
            "score": -9,
            "text": "Serious question: what about the billions of dollars and lost businesses from the summer 2020 riots? We don’t care about THOSE people, but you’re going after the lunatics who entered the capitol building. Okay.",
            "title_similarity": "0.73351336",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8crl74",
            "score": -8,
            "text": "People think trump said to attack the capitol but he never did",
            "title_similarity": "0.481055",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h8cs4we",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.049614143"
        },
        {
            "id": "h8ct75r",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "-0.002389839"
        },
        {
            "id": "h8cu7ep",
            "score": -6,
            "text": "What about the billions of dollars in damage done by antifa and BLM?\n\nEdit: Ya, you see, there’s a deeply satisfying irony in realizing a sarcastic, immature retort is as valid as the initial point I made. For me, the pleasure comes from knowing my rebuttal was as pointless as the partisan focus on insurrection in light of equivalent (if not worse) BLM/Antifa assault, murder, and property damage. The moral of this story is that being divided is a joke, both sides are enraged at their respective exploitation. I’m poking fun at the conditioned “yes, but” when anything right of center is bought up in this sub.",
            "title_similarity": "0.5067581",
            "sentiment_compound": 0.5633
        },
        {
            "id": "h8cd36l",
            "score": 7,
            "text": "How is it even possible that $500,000,000 in damages were caused by this?",
            "title_similarity": "0.8185421",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8cgtka",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8cm18n",
            "score": -9,
            "text": "Go after the BLM/ Antifa rioters, they destroyed whole cities and caused far more damage than some building nobody gives a fuck about",
            "title_similarity": "0.54373527",
            "sentiment_compound": -0.8805
        },
        {
            "id": "h8cmon9",
            "score": -9,
            "text": "What about the summer riots that destroyed our beautiful cities. Merchandise stolen in the name of robbing and looting honest hard working business people. A joke who is accountable for that? Some people like my husband and  I who have worked our asses off to pay our mortgage and send kids and now Grandkids to school? Play me your🎻",
            "title_similarity": "0.6229278",
            "sentiment_compound": 0.4871
        },
        {
            "id": "h8cnvt2",
            "score": -9,
            "text": "Maybe because of the BLM riots?",
            "title_similarity": "0.3203575",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8cqbz0",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8d2tuf",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "-0.0023898557"
        },
        {
            "id": "h8c5642",
            "score": 42,
            "text": "Because Republicans are corrupt and NEVER pay their fair share-their whole existence is cheat, greed and milk the system while avoiding all taxes. I paid $16K last year. Republicans just stash their money offshore and pay very little.",
            "title_similarity": "0.6467744",
            "sentiment_compound": -0.8468
        },
        {
            "id": "h8cmpv7",
            "score": -9,
            "text": "By this logic what are BLM and ANTIFA paying for all the destruction theme caused for the last few years?.",
            "title_similarity": "0.5846205",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8cog09",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8cp5l6",
            "score": 7,
            "text": "Infuriating. Had they been black people they would have been shot on sight. Definitely a two tier justice system. I’d say even three tier since wealthy people get away with anything. Ugh!!",
            "title_similarity": "0.68696606",
            "sentiment_compound": 0.4559
        },
        {
            "id": "h8cpj51",
            "score": -11,
            "text": "The BLM riots cost a billion....with a \"B\" and is the most  expensive insurance claim(s) in history.",
            "title_similarity": "0.68646747",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8cpl04",
            "score": -11,
            "text": "How much are the BLM rioters paying for their $2 Billion damages last summer?",
            "title_similarity": "0.8344558",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8csndi",
            "score": -9,
            "text": "What about the 1 billion in property damage from the summer of riots?",
            "title_similarity": "0.7306874",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h8cbs6k",
            "score": 9,
            "text": "I mean judging by who was there… is their sum net worth even worth $1.5 million? Even if you count the Donald that gets you to $1 million tops",
            "title_similarity": "0.7636307",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8cm5yn",
            "score": -10,
            "text": "Whos gonna pay for Portland? Seattle? Boston? St Louis? Etc.....they just walk away. This is bullshit.",
            "title_similarity": "0.37476003",
            "sentiment_compound": -0.7319
        },
        {
            "id": "h8cqf7e",
            "score": -12,
            "text": "What about the BLM riot costs?",
            "title_similarity": "0.36683694",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8cnrvd",
            "score": -10,
            "text": "I wonder how much of that 3 billion in BLM damages got paid back by taxpayers? Probably all of it. But that's ok! Some riots that cause tax payers money are ok but others aren't.....\n\nJust make sure you don't touch a few podiums and reddit will love you.",
            "title_similarity": "0.6668635",
            "sentiment_compound": 0.2614
        },
        {
            "id": "h8crgab",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8cnnao",
            "score": -12,
            "text": "Very true. Should also be asking why BLM and Antifa aren’t paying for the cities they burnt down. Also for the family’s of all the small businesses they ruined.",
            "title_similarity": "0.6136048",
            "sentiment_compound": -0.0018
        },
        {
            "id": "h8bw672",
            "score": 59,
            "text": "Because of we're not charging them with insurrection like we should be.",
            "title_similarity": "0.1430521",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8cp0eq",
            "score": -12,
            "text": "How much is BLM paying?",
            "title_similarity": "0.3570094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cpa5a",
            "score": -12,
            "text": "And BLM rioters pay none",
            "title_similarity": "0.27790645",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cswt9",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "-0.049614202"
        },
        {
            "id": "h8buz6y",
            "score": 215,
            "text": "$1.5 million dollars?!?! Since these Q worshippers love LARPing as soldiers, why not form a military force, consisting of nothing but rioters, and send them out to places deemed too dangerous for soldiers? You know, to save some money?\n\nA [Q-Force](https://youtu.be/Fk9s-zTbq28), if you will.",
            "title_similarity": "0.736959",
            "sentiment_compound": 0.6902
        },
        {
            "id": "h8bryi3",
            "score": 519,
            "text": "I don't think there's an appropriate measurement of distance to measure just how far the public is from putting Republicans on the hook for NEVER internalizing major threats to the US. That goes for terrorism, healthcare, climate, pandemics, gun violence, I mean, everything.\n\nI can't imagine anything more dangerous than a Republican getting elected.",
            "title_similarity": "0.55568635",
            "sentiment_compound": -0.9177
        },
        {
            "id": "h8c3zhd",
            "score": 79,
            "text": "Trump has collected well over $100M from this lie…the DOJ should seize it as proceeds of a crime.",
            "title_similarity": "0.7531927",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8bsm0y",
            "score": 867,
            "text": "Why are taxpayers supporting an uprising? Who came up with that idea? Hell no. Start taking property and garnishing wages but get the money from the folks who wanted to overthrow the government not those that support it.",
            "title_similarity": "0.57080513",
            "sentiment_compound": -0.6245
        },
        {
            "id": "h8c144d",
            "score": 2080,
            "text": "Got money for healthcare or loan forgiveness? Nope not a cent.\n\nHow about endless wars, billionaire bailouts and fixing your fancy office that your supporters trashed?  Yeah here’s a blank check and 3 more just in case.\n\nWe need to spend taxes on erecting a giant colorful tent over this country so everyone knows we’re a bunch of fucking clowns living in a circus.",
            "title_similarity": "0.62027955",
            "sentiment_compound": 0.4515
        },
        {
            "id": "h8c5abt",
            "score": 365,
            "text": "Insurrectionists. Media needs to stop soft pedaling their actions.",
            "title_similarity": "0.19740471",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8c2vfe",
            "score": 602,
            "text": "Say everyone....If you get busted for pot or any other nonsense offense, ask to plead to insurrection. \n\nIt appears the penalties and fine are far more lenient for that offense.",
            "title_similarity": "0.44687468",
            "sentiment_compound": -0.3626
        },
        {
            "id": "h8chi9k",
            "score": 59,
            "text": "Hol' up. The party of 'personal responsibility' isn't taking said personal responsibility? Color me shocked.",
            "title_similarity": "0.303757",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h8cb83l",
            "score": 1290,
            "text": "They need to arrest the figureheads. The senators and congressmen who spoke at the rally and Trump himself. This will continue to happen again and again and only get worse.",
            "title_similarity": "0.49427935",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h8bqcc3",
            "score": 9003,
            "text": "Go after the deeper pockets and indict them under the RICO statutes.  This will allow for tripling the damages or 1.5 billion USD.  That might make the wannabe dictators wake up.",
            "title_similarity": "0.7161957",
            "sentiment_compound": -0.25
        },
        {
            "id": "h8c4r3o",
            "score": 64,
            "text": "Make trump pay the 500 million.",
            "title_similarity": "0.73627895",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8bsu2f",
            "score": 226,
            "text": "When are the people that actually planned and implemented this insurrection going to be arrested by DoJ?  It's nice they're going after the small fry, but most of the charges and fines seem to be fairly minor compared to the fact that they tried to overthrow the U.S. government.",
            "title_similarity": "0.61579967",
            "sentiment_compound": -0.4932
        },
        {
            "id": "h8c4v3a",
            "score": 107,
            "text": "Can someone explain to me how the insurgency cost 500m dollars? That’s obscene and I’m having a hard time wrapping my mind around where this money went.",
            "title_similarity": "0.7159457",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h8bqb20",
            "score": 1868,
            "text": "Can they get 'Sedition insurance'? (just in case)",
            "title_similarity": "0.20796806",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8bwi8x",
            "score": 1,
            "text": "Because Capitol rioters believe in small government so the judges relented.",
            "title_similarity": "0.47014567",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bys0d",
            "score": 2,
            "text": "Those traitors should be paying with everything they own plus life in prison.",
            "title_similarity": "0.47756773",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8bz1q1",
            "score": 1,
            "text": "Cause you can’t get blood from a stone?",
            "title_similarity": "0.21024725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bz6f1",
            "score": 1,
            "text": "Wait...do the US not have insurrection insurance?",
            "title_similarity": "0.25411403",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bzojl",
            "score": 1,
            "text": "I think the 1/6 people paying more would be universally agreed upon. From the normal people who watched them to the loons that think Antifa/Soros/crisis actors/etc was behind the whole thing.",
            "title_similarity": "0.41280863",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8c5ppl",
            "score": 2,
            "text": "Madness and insanity happening all around.  Will leaders step up and right the ship or will we sail into the abyss?",
            "title_similarity": "0.403221",
            "sentiment_compound": -0.765
        },
        {
            "id": "h8c81eu",
            "score": 2,
            "text": "Because we pick up after our children in this country.",
            "title_similarity": "0.16439041",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c8dt3",
            "score": 1,
            "text": "I'm sure most of them are on social security anyway.",
            "title_similarity": "0.34813017",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8c9kag",
            "score": 2,
            "text": "That’s a really great question! I hope that judge will require them to pay for the damage they caused.",
            "title_similarity": "0.3769408",
            "sentiment_compound": 0.6105
        },
        {
            "id": "h8c9xt8",
            "score": 1,
            "text": "Taking a play straight off of Wallstreet.",
            "title_similarity": "0.13898194",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8caozi",
            "score": 5,
            "text": "Just as a bit of a tangent, why the hell are we paying $500 million? I'd love a breakdown of those costs.",
            "title_similarity": "0.78767145",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cbga7",
            "score": 2,
            "text": "I would also be curious as to the answer to this question.",
            "title_similarity": "-0.042058624",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8cbmx9",
            "score": 2,
            "text": "Excellent question",
            "title_similarity": "-0.06906991",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8cdwsr",
            "score": 1,
            "text": "I really wish a news channel or some tv channel would make a special program documenting the whole capital riot and show all the damage that was done.",
            "title_similarity": "0.52026916",
            "sentiment_compound": -0.2748
        },
        {
            "id": "h8cf86g",
            "score": 2,
            "text": "Charge the former President and his cronies",
            "title_similarity": "0.41904873",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cfeva",
            "score": 1,
            "text": "Proly bc $1.5 million is already larger than the net worth of all those who attended…",
            "title_similarity": "0.6791734",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8cff7f",
            "score": 2,
            "text": "Because the gop is good at deflection grifting& gaslighting, is the quick answer.",
            "title_similarity": "0.1999805",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8cfgxr",
            "score": 1,
            "text": "You can destroy the capitol and only be stuck with 1/750th of the bill but student debt can’t be canceled. Sounds about right.",
            "title_similarity": "0.6875198",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h8cfmna",
            "score": 2,
            "text": "About $50k per terrorist.",
            "title_similarity": "0.78202826",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h8cftit",
            "score": 2,
            "text": "Because they’re assholes and never face consequences for their actions?",
            "title_similarity": "0.1391396",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8cg89z",
            "score": 1,
            "text": "This is a good question. \n\nAlthough I have some ideas",
            "title_similarity": "-0.08395761",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8cg8n4",
            "score": 1,
            "text": "I mean, there's a lot more if us (taxpayers)?",
            "title_similarity": "0.37603933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cg9u0",
            "score": 1,
            "text": "I mean…why aren’t they rotting in jail or taken out and shot for treason? We all have valid questions here mr judge",
            "title_similarity": "0.49186665",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8cgar1",
            "score": 1,
            "text": "Is the photo the doors where that dumbfuk got shot trying to climb through ?",
            "title_similarity": "0.39152813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cgbsn",
            "score": 1,
            "text": "A just question, my liege",
            "title_similarity": "-0.04232355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cgcgl",
            "score": 1,
            "text": "One time my brother punched a wall, he found out it was a foam wall. Well he was locked up and had to pay something like $500 to fix it.\nHe didn’t get to pay $0.14 and call it a day.",
            "title_similarity": "0.7538297",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8cge4x",
            "score": 1,
            "text": "If you know anything about WW1 punishments leading to WW2 then this doesn’t really require an explanation…",
            "title_similarity": "0.20660935",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8cgebj",
            "score": 1,
            "text": "Because thats how this stupid country works.",
            "title_similarity": "0.14265887",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h8cgmel",
            "score": 1,
            "text": "you first interview witnessed under oath, and get their feedback.  then you get the call records to confirm if they were honest.",
            "title_similarity": "0.3094815",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8cgojf",
            "score": 3,
            "text": "Because our DOJ and AG fucking suck.",
            "title_similarity": "0.19573048",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h8cgzb1",
            "score": 2,
            "text": "Add it to their taxes!!!  And every Senator or congress person that participated or denied it!",
            "title_similarity": "0.5799678",
            "sentiment_compound": -0.6209
        },
        {
            "id": "h8cgzf7",
            "score": 1,
            "text": "Now that’s a good question!",
            "title_similarity": "-0.10863936",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h8ch09h",
            "score": 1,
            "text": "Hey cool, I am asking that too but unlike the judge, I can't fix it.",
            "title_similarity": "0.21102843",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h8ch9v9",
            "score": 2,
            "text": "Did I read that right? $500 MILLION?!  God damn!\n\n(Not subscribed to the Washington Post, so I can’t read the article.)\n\nI’m guessing that’s including the cost of tracking down and prosecuting those involved?  \n\nStill an insane cost, though.",
            "title_similarity": "0.81191593",
            "sentiment_compound": -0.6623
        },
        {
            "id": "h8chb5w",
            "score": 1,
            "text": "White men and women.  That's why.",
            "title_similarity": "0.10953537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8chekb",
            "score": 1,
            "text": "So we going to start charging demographics who are responsible for crimes more than others? I'm all for it but it'll get called racist real quick if you flip it the other way",
            "title_similarity": "0.5480016",
            "sentiment_compound": -0.705
        },
        {
            "id": "h8chrj4",
            "score": 2,
            "text": "I just hope that they go after the people that are responsible for this and just use all these pawns to make a case against the organizers.",
            "title_similarity": "0.3474095",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8chtfq",
            "score": 4,
            "text": "I am getting paywalled. Is there a way I can read this somewhere else?",
            "title_similarity": "0.30965114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8chti6",
            "score": 1,
            "text": "Taxpayers are asking that too. What the hell is going on here? Who knew sedition got you a slap on the wrist?!",
            "title_similarity": "0.47031555",
            "sentiment_compound": -0.8152
        },
        {
            "id": "h8chvgm",
            "score": 2,
            "text": "Shouldn’t they pay for ALL of the damage THEY caused? WTF?",
            "title_similarity": "0.4289322",
            "sentiment_compound": -0.8588
        },
        {
            "id": "h8chwvx",
            "score": 1,
            "text": "Because you can't pull blood from a stone?",
            "title_similarity": "0.18817106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ci400",
            "score": 2,
            "text": "Probably because they don't have 500 million.",
            "title_similarity": "0.4390489",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ci7kz",
            "score": 1,
            "text": "> Assistant U.S. Attorney Clayton Henry O’Connor told Howell the government would explain how it computed the damage and restitution estimate before October.\n\nSo it's not an official, thought out, and documented policy.  Basically, the DOJ is going to have to sift through tons of precedence to back into a random number they chose to reduce the risk of bad PR.",
            "title_similarity": "0.6264825",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h8cibgd",
            "score": 1,
            "text": "Because they don't have that much fucking money durrr",
            "title_similarity": "0.213346",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cild8",
            "score": 1,
            "text": "Because \"fuck you, taxpayers,\" that's why!  It's all your fault!  Also, you're going to pay for a few trillion dollars in spending on pointless wars in the Middle East and Central Asia, you peasant filth!  \n\nAnd you're going to pay obscene rates for higher education and inflated healthcare costs, you miserable bastards!  This while you live amidst crumbling infrastructure and cities that increasingly look like dystopian third-world shantytowns.",
            "title_similarity": "0.62538713",
            "sentiment_compound": -0.9693
        },
        {
            "id": "h8cj47f",
            "score": 2,
            "text": "Didn't politicians pay to have the rioters bus/flown to DC?",
            "title_similarity": "0.58413404",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h8cjfjc",
            "score": 1,
            "text": "This country is a fucking joke",
            "title_similarity": "0.13775927",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h8cjkbs",
            "score": 1,
            "text": "Don't worry, we'll get it back...",
            "title_similarity": "-0.13630569",
            "sentiment_compound": 0.3412
        },
        {
            "id": "h8cjvx6",
            "score": 5,
            "text": "This is a very valid question. They should foot the bill for all of that. Not me. I’m all about fighting for rights or perceived rights.",
            "title_similarity": "0.23498544",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8cjzqv",
            "score": 3,
            "text": "Because most are poor, stupid hicks.",
            "title_similarity": "0.311094",
            "sentiment_compound": -0.793
        },
        {
            "id": "h8ck5h5",
            "score": 1,
            "text": "That dang trump. Why, if I ever met him I’d tell him a thing or two.",
            "title_similarity": "0.2750552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ck627",
            "score": 2,
            "text": "Where do they get the $500 million figure from?",
            "title_similarity": "0.73350656",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ckdnw",
            "score": 2,
            "text": "Imagine if wealthy people (and corporations) had to actually pay out an amount that would truly be sufficient to cover the damages of their crimes when found guilty for damaging the environment, people's health, etc.? A man can only dream...",
            "title_similarity": "0.64615875",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8ckp8p",
            "score": 2,
            "text": "Yup, this takes the cake. \n\n\n>america",
            "title_similarity": "0.31815523",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cl3zi",
            "score": 1,
            "text": "They should call for joint and severally liable for $500mil each.",
            "title_similarity": "0.72769177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cla3j",
            "score": 2,
            "text": "I’d like to know why is it going to cost $500 million to fix.",
            "title_similarity": "0.79096144",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8clqa7",
            "score": 1,
            "text": "We need to have a domestic WSLA that suspends statue of limitations for these types of acts. Go after all of them.",
            "title_similarity": "0.31092793",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8clx4r",
            "score": 2,
            "text": "how is 500 million? ive seen more property damage at punk rock shows.",
            "title_similarity": "0.7114713",
            "sentiment_compound": -0.539
        },
        {
            "id": "h8clzfm",
            "score": 2,
            "text": "The damage cost 500 million. Whaat?",
            "title_similarity": "0.75133765",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8cm30f",
            "score": 3,
            "text": "Valid question",
            "title_similarity": "-0.10988434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cm81x",
            "score": 2,
            "text": "As your respecting neighbour north of the Saint Lawrence river. Please get your act together USA. Too many of your great citizens are being led down the s**t hole bye very wealthy self-serving pseudo- politicians",
            "title_similarity": "0.49065703",
            "sentiment_compound": 0.908
        },
        {
            "id": "h8cm9t0",
            "score": 2,
            "text": "Half a billion is the taxpayer burden? Holy shit, how is it that insanely expensive?",
            "title_similarity": "0.64515436",
            "sentiment_compound": -0.782
        },
        {
            "id": "h8cmfpx",
            "score": 9,
            "text": "Fuck paywalls.",
            "title_similarity": "0.27811927",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8cmil2",
            "score": 1,
            "text": "Same reason you pay for the mistakes of everyone else. When some idiot burns his house down you pay for the fire fighters.\n\nWhen a murder goes to jail your tax dollars pay to house him.",
            "title_similarity": "0.62118566",
            "sentiment_compound": -0.936
        },
        {
            "id": "h8cmkq7",
            "score": 2,
            "text": "Ya and fuck billionaires!",
            "title_similarity": "0.39221478",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h8cmm43",
            "score": 3,
            "text": "Why don’t you guys make billionaires pay taxes either? Who knows",
            "title_similarity": "0.65993977",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cmssc",
            "score": 2,
            "text": "also because it is like a little bit under 2 dollars a person since there is close to 350 million people in the U.S. so it is really easy just to ask for 2 dollars a person rather than about the 550 people charged to pay around a million dollars each",
            "title_similarity": "0.660661",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h8cmsxn",
            "score": 1,
            "text": "Ahh the old, \"look what you made our country do\" tactic. Like this is the only fucked up situation WE payed for.",
            "title_similarity": "0.4035198",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8cmtms",
            "score": 33,
            "text": "Because prosecutors are treating them like trespassers instead of the insurrectionists that they are. They were committing felonies and people died during the commission of those felonies. They should be charged accordingly.",
            "title_similarity": "0.48015213",
            "sentiment_compound": -0.8625
        },
        {
            "id": "h8cmvre",
            "score": 2,
            "text": "500 million worth of damage?! Can someone please tell me what they ruined that amounts to that? Genuinely curious. Too lazy to Google.",
            "title_similarity": "0.6900754",
            "sentiment_compound": -0.6062
        },
        {
            "id": "h8cn4x0",
            "score": 1,
            "text": "\nA federal judge on Monday questioned why U.S. prosecutors are asking Capitol riot defendants to pay only $1.5 million in restitution while American taxpayers are paying more than $500 million to cover the costs of the Jan. 6 attack by a pro-Trump mob.\n\nChief U.S. District Judge Beryl A. Howell of Washington challenged the toughness of the Justice Department’s stance in a plea hearing for a Colorado Springs man who admitted to one of four nonviolent misdemeanor counts of picketing in the U.S. Capitol.",
            "title_similarity": "0.8716113",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8cn5mr",
            "score": 2,
            "text": "The traitors should pay it all. Split it up amongst those we've identified. Garnish wages. Offer a deal to cut their amount owed in half if they can turn in someone in that hasn't already been identified with enough proof to be convicted.",
            "title_similarity": "0.5916369",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8cn60t",
            "score": 1,
            "text": "Trump should cover the rest!",
            "title_similarity": "0.25345784",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cn8h0",
            "score": 7,
            "text": "I will ask why Donald Trump and Republicans who support them are also not on trial.",
            "title_similarity": "0.4855904",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8cnfwz",
            "score": 3,
            "text": "Thank you !!!! And why are not branded terrorists also .....",
            "title_similarity": "0.22305596",
            "sentiment_compound": 0.7883
        },
        {
            "id": "h8cnjdz",
            "score": 2,
            "text": "Cant read the article cause its on a site that requires me to log in/set up account. Is there another link to the article that doesnt require that?",
            "title_similarity": "0.25132135",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cnquh",
            "score": 3,
            "text": "Why do people link articles that you have to pay for?",
            "title_similarity": "0.288691",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cnr7p",
            "score": 1,
            "text": "Fyy",
            "title_similarity": "-0.1483123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cnwza",
            "score": 3,
            "text": "why is nobody asking why it costed $500,000,000\n\nlike wtf is that number, 700 people with cancer? am i dumb",
            "title_similarity": "0.81547797",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h8co042",
            "score": 5,
            "text": "Who cares about the money? Why are the ringleaders walking free?!",
            "title_similarity": "0.4054346",
            "sentiment_compound": 0.7877
        },
        {
            "id": "h8co2kg",
            "score": 4,
            "text": "Should not the individual who requested the insurrection be personally and financially be responsible to the lawful taxpayers?",
            "title_similarity": "0.431854",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8co3d0",
            "score": 1,
            "text": "Why does the govt pay billions to fund Israel? lol",
            "title_similarity": "0.6478424",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8cofy1",
            "score": 1,
            "text": "Not to mention the initial $2Billion for the new and improved capital police force",
            "title_similarity": "0.69200754",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8cohfa",
            "score": 3,
            "text": "How to quell extremist violence, take their paycheck. \n\n-someone somewhere",
            "title_similarity": "0.33871615",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8colly",
            "score": 3,
            "text": "These guys shit in the Capitol. Literally took a dump inside the capitol.",
            "title_similarity": "0.48187265",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h8colmg",
            "score": 2,
            "text": "Real talk",
            "title_similarity": "-0.12586418",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8comnh",
            "score": 2,
            "text": "Because they’re a bunch of broke ass motherfuckers lmao",
            "title_similarity": "0.36762482",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8cop5y",
            "score": 2,
            "text": "As tax payers wouldn’t we have standing to bring a class action suit against the accused and convicted?",
            "title_similarity": "0.5860739",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8coptd",
            "score": 2,
            "text": "They should be paying with decades of their lives",
            "title_similarity": "0.3922724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cp30f",
            "score": 4,
            "text": "Simple : “ I take no responsibility at all “ just like their leader.",
            "title_similarity": "0.06966368",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8cp8rh",
            "score": 3,
            "text": "Watch Ben Shapiro cover this.",
            "title_similarity": "0.020600244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cpg8x",
            "score": 1,
            "text": "Because at the end of the day it will never be the people actually accountable that take the fall, it will always be the forgotten man.",
            "title_similarity": "0.29440832",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8cpw8f",
            "score": 6,
            "text": "Probably because you keep referring to them as \"rioters\" instead of \"insurrectionists.\"\n\nLessening the impact means there's going to be a lesser impact.\n\nWho knew?",
            "title_similarity": "0.33737993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cq353",
            "score": 3,
            "text": "I’m sorry, what the fuck is costing us 501.5 million dollars, exactly?",
            "title_similarity": "0.7343439",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8cq5bh",
            "score": 1,
            "text": "It’s a great question",
            "title_similarity": "-0.075303935",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8cq91v",
            "score": 2,
            "text": "I'm ok if this is a LOAN.\n\nMake the guilty pay restitution to the sum of everyone, but them, who filed taxes last year getting an appropriately sized tax refund.",
            "title_similarity": "0.6698934",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8cqbcx",
            "score": 2,
            "text": "I can’t believe we have to pay for what crazy white people do it’s not fair.",
            "title_similarity": "0.40710527",
            "sentiment_compound": -0.5806
        },
        {
            "id": "h8cqp7d",
            "score": 2,
            "text": "Bc… they don’t have it? That’s not how this works. That said, they should be paying more for it in presión years.",
            "title_similarity": "0.43187743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cqt3b",
            "score": 3,
            "text": "Real question is to why this costs 500 million in the first place?",
            "title_similarity": "0.7310438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cqy2w",
            "score": 1,
            "text": "Why is this costing half a billion dollars to begin with? Unreal",
            "title_similarity": "0.6196276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cqzuh",
            "score": 1,
            "text": "how about the organizers pay something? Trump? Mrs. Thomas?",
            "title_similarity": "0.38824332",
            "sentiment_compound": -0.2359
        },
        {
            "id": "h8csnvx",
            "score": 2,
            "text": "The simple answer is they probably don’t have that much combined. I’d say charge trump the full amount, but he probably doesn’t have that much either",
            "title_similarity": "0.4396058",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8csv1y",
            "score": 2,
            "text": "Why doesn’t trump pay for this? Make him sell some assets to foot the bill",
            "title_similarity": "0.53063047",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8cszsn",
            "score": 1,
            "text": "$500M is a steal i thought it would be at least $10B in damages.",
            "title_similarity": "0.8069396",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h8ct4br",
            "score": 1,
            "text": "Kind of makes you sick when you compare to the sentencing handed out to drug dealers, or brown people that only talked about overthrowing the government.",
            "title_similarity": "0.5799912",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8ctb9s",
            "score": 3,
            "text": "Gym Jordan needs to be subpoenaed.",
            "title_similarity": "0.3008421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctjhy",
            "score": 2,
            "text": "Send the invoice to the Trump Organization and RNC",
            "title_similarity": "0.39320183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctp9a",
            "score": 2,
            "text": "Why isn't Trump paying for it?",
            "title_similarity": "0.30169177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctprf",
            "score": 1,
            "text": "Cant read the article, what's the 500 million it's talking about?",
            "title_similarity": "0.72470033",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctqyi",
            "score": 1,
            "text": " Nice paywall, WaPo",
            "title_similarity": "0.12628216",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8ctsua",
            "score": 4,
            "text": "Money? LOL. There's a part of me that wants to say \"revoke their citizenship, take them out to International waters, and drop them off in life rafts with survival gear and supplies, and *leave them there to fend for themselves*\", but that wouldn't be terribly humane of me, now would it?\n\nBesides which, they're just **pawns**. Need to go after the people who encouraged them.",
            "title_similarity": "0.4836722",
            "sentiment_compound": 0.8447
        },
        {
            "id": "h8ctwce",
            "score": 2,
            "text": "This. This is the right question.",
            "title_similarity": "-0.1117775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctx89",
            "score": 1,
            "text": "Pay wall articles should be banned.",
            "title_similarity": "0.22319148",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8ctyo4",
            "score": 1,
            "text": "Why aren’t the prosecutors asking this.",
            "title_similarity": "0.2226893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cu321",
            "score": 3,
            "text": "I wonder if this same judge ever wondered why billion dollar companies get $1000 fines.",
            "title_similarity": "0.7735101",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cu5j9",
            "score": 2,
            "text": "Probably because the justice system is bloated, inefficient, in effective, and riddle with corruption.",
            "title_similarity": "0.33171093",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h8cu926",
            "score": 1,
            "text": "Meh.",
            "title_similarity": "-0.13810892",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8cu9ki",
            "score": 2,
            "text": "wait wut?  oh no you caught some folks make them pay.\n\nLotta \"what about\" in this thread and not enough outrage that these people aren't paying enough.",
            "title_similarity": "0.43355507",
            "sentiment_compound": 0.0263
        },
        {
            "id": "h8cuc39",
            "score": 1,
            "text": "Yeet",
            "title_similarity": "-0.1222661",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cufab",
            "score": 2,
            "text": "The former president has about a hundred million stashed away, that was supposed to help pay for his STS campaign  maybe he should be encouraged to donate a yuge chunk to help make repairs. It did happen on his watch.",
            "title_similarity": "0.7234896",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h8cuh3b",
            "score": 1,
            "text": "Damned good question.",
            "title_similarity": "-0.037187073",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8cuwhd",
            "score": 1,
            "text": "Why are taxpayers paying 500 million…?",
            "title_similarity": "0.8016644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cv935",
            "score": 1,
            "text": "“That’s not how taxes work!”\n\nCongress, with a gun pointed behind my head: “Always has been.”",
            "title_similarity": "0.41722766",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h8cv95e",
            "score": 2,
            "text": "Because 500 Million is for random unrelated, unhelpful shit.\n\nThe 1.5 Million is probably only divided between the people who entered the captiol, so like <200 people.",
            "title_similarity": "0.7005675",
            "sentiment_compound": -0.0922
        },
        {
            "id": "h8cvbf6",
            "score": 2,
            "text": "Just gonna drop this snippet from FBI.gov\n\n>DOMESTIC TERRORISM: Violent, criminal acts committed by individuals and/or groups to further ideological goals stemming from domestic influences, such as those of a political, religious, social, racial, or environmental nature.",
            "title_similarity": "0.4513767",
            "sentiment_compound": -0.9278
        },
        {
            "id": "h8cvbwa",
            "score": 2,
            "text": "This is absolute bullshit. Us non-insurrectionists shouldn’t have to pay a god damn dime for this.",
            "title_similarity": "0.32413238",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h8cvcmc",
            "score": 3,
            "text": "Get it from trump",
            "title_similarity": "0.19518557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cveib",
            "score": 3,
            "text": "Now THAT is an EXCELLENT question, Your Honor.  I would love to hear an answer as well.",
            "title_similarity": "0.0037725503",
            "sentiment_compound": 0.9317
        },
        {
            "id": "h8cvf8q",
            "score": 2,
            "text": "This is the white question?!",
            "title_similarity": "0.028882518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cvgly",
            "score": 8,
            "text": "$500m / 605 ~# people charged~ = ~$824k per head.\n$824k / 45 years = ~$18k per year per person.\nLikely income per year per felon is ~$25k assuming two part time jobs of minimum wage pay & complimentary hours.\n\nThe People are gonna have to take a monetary loss on this one.",
            "title_similarity": "0.8274852",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8cw2ad",
            "score": 2,
            "text": "The real travesty is how people are going home with time served and keeping the right to vote and bare arms. These are dangerous people.",
            "title_similarity": "0.32557824",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h8cwf4a",
            "score": 2,
            "text": "Making America great again, by wasting money on something other than solar panels",
            "title_similarity": "0.4346205",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8cwnab",
            "score": 2,
            "text": "Chief U.S. District Judge Beryl A. Howell of Washington",
            "title_similarity": "0.25910908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cwo3e",
            "score": 1,
            "text": "Lets just sweep this under the carpet with the most minimum of charges and as little fanfare as possible. Lets all just move on and forget this whole nasty business. /s",
            "title_similarity": "0.28703183",
            "sentiment_compound": -0.7823
        },
        {
            "id": "h8cwuc5",
            "score": 2,
            "text": "Any got a copy paste of the article?",
            "title_similarity": "0.16820565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cwxhv",
            "score": 2,
            "text": "This is an interesting point. I wonder how this goes for incarceration. A criminal gets caught and gets imprisoned. He (well they are mostly he anyhow) serves his term. Let's say he served a 10-year term. Would this be a net tax deficit or profit? There is a boatload of private prison facilities. They get paid by the Federal and State government via tax right? Sorry for the distraction. It still got me thinking... Should we reduce the length of sentences in general in order to lower taxes? We could I imagine\\~",
            "title_similarity": "0.7260872",
            "sentiment_compound": -0.879
        },
        {
            "id": "h8cx5hr",
            "score": 2,
            "text": "Man this is infuriating and I’m Australian. Can’t imagine what it’s like to be an American (one of those with a working brain) at the moment.",
            "title_similarity": "0.4032833",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8cxchi",
            "score": 1,
            "text": "Does this mean the US taxpayer will get a refund for those pesky weapons of mass destruction?",
            "title_similarity": "0.5868077",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h8cxdla",
            "score": 1,
            "text": "For real WTF",
            "title_similarity": "-0.050016314",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h8cxmeu",
            "score": 1,
            "text": "Get’em",
            "title_similarity": "-0.13798597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cxw2p",
            "score": 1,
            "text": "Go after the guy they were advertising for on those big blue and red signs",
            "title_similarity": "0.3946678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cy681",
            "score": 2,
            "text": "naw they need to pay up for the damages in full or get excommunicado",
            "title_similarity": "0.38373905",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8cy8wv",
            "score": 1,
            "text": "If it's cheaper to burn it down I vote for that.",
            "title_similarity": "0.31330538",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cydf2",
            "score": 1,
            "text": "Good question.. they should all have to pay restitution.",
            "title_similarity": "0.20782661",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8cynd4",
            "score": 2,
            "text": "Good question!!!!",
            "title_similarity": "-0.07769181",
            "sentiment_compound": 0.6209
        },
        {
            "id": "h8cyqkn",
            "score": 1,
            "text": "325 million Americans that’s that’s 1.5 mil each",
            "title_similarity": "0.65758234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cz9u9",
            "score": 1,
            "text": "Bro just get the healthcare system to charge them. Problem solved",
            "title_similarity": "0.28801256",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8czb9w",
            "score": 19,
            "text": "A federal judge on Monday questioned why U.S. prosecutors are asking Capitol riot defendants to pay only $1.5 million in restitution while American taxpayers are paying more than $500 million to cover the costs of the Jan. 6 attack by a pro-Trump mob.\n\n\nChief U.S. District Judge Beryl A. Howell of Washington challenged the toughness of the Justice Department’s stance in a plea hearing for a Colorado Springs man who admitted to one of four nonviolent misdemeanor counts of picketing in the U.S. Capitol.\nHowell has already asked in another defendant’s plea hearing whether no-prison misdemeanor plea deals offered by the government are too lenient for individuals involved in “terrorizing members of Congress,” asking pointedly whether the government had “any concern about deterrence?”\n\n\nOn Monday, she pressed the U.S. attorney’s office in Washington on why it was seeking to require only $2,000 in each felony case and $500 in each misdemeanor case.“I’m accustomed to the government being fairly aggressive in terms of fraud when there have been damages that accrue from a criminal act for the restitution amount,” said Howell, a former Brooklyn federal prosecutor and Senate Judiciary Committee general counsel.“Where we have Congress acting, appropriating all this money due directly to the events of January 6th, I have found the damage amount of less than $1.5 million — when all of us American taxpayers are about to foot the bill for close to half a billion dollars — a little bit surprising,” she said.\n\nThe judge alluded to a $2.1 billion security bill passed overwhelmingly July 29 by Congress to cover the costs of the Jan. 6 attack, including reimbursements totaling $521 million for the National Guard and $70 million to the Capitol Police, plus $300 million for Capitol security improvements.\n\nAuthorities say the riot contributed to the deaths of five people during or immediately following the attack and the deaths by suicide of multiple police officers. The attack also led to assaults on nearly 140 officers and forced the evacuation of a joint session of Congress meeting to confirm the results of the 2020 presidential election.Assistant U.S. Attorney Clayton Henry O’Connor told Howell the government would explain how it computed the damage and restitution estimate before October.The department and U.S. attorney’s office declined to comment beyond court statements.\n\nProsecutors gave few details in early June when they put a price tag for the first time on damage done to the Capitol in the riots, saying in court filings that as of mid-May the sum totaled “approximately $1,495,326.55.”The basis of the estimate was not clear but appeared to reflect the immediate costs of replacing broken windows, doors and other property. A spokeswoman for the Architect of the Capitol said the agency gave damage assessments to the Justice Department, which calculated the per-case penalty, and separate assessments to House and Senate appropriators for wider security costs.Federal law allows judges at sentencing to order convicted offenders to reimburse victims for property damage and other losses, depending whether losses are a direct and foreseeable result of an offender’s crime. But the law also makes restitution a negotiable item pursuant to plea agreement.\n\nHowell on Monday eventually accepted the guilty plea of Glenn Wes Lee Croy, 46, who admitted traveling with an Ohio co-defendant to attend a rally for President Donald Trump at the Ellipse, walking to the Capitol, and standing at its steps for about an hour before entering the just-breached building at 2:20 p.m.\n\nCroy shared a photo of himself next to a statue of Abraham Lincoln before leaving after about 20 minutes.Croy and his attorney, Kira Anne West, acknowledged that before entering, he understood access to the Capitol was restricted because he saw police at the top of the steps firing smoke or pepper spray grenades at the crowd but did not know gathering outside was prohibited.O’Connor noted that in a plea deal signed by both sides on July 31, prosecutors did not agree as they have for some other defendants that a no-jail, probation-only sentence might be appropriate for Croy, which Howell noted.",
            "title_similarity": "0.86738515",
            "sentiment_compound": -0.9942
        },
        {
            "id": "h8czj5y",
            "score": 1,
            "text": "Good for her.... asking beyond laziness, no spine, take the easy road, business as usual.",
            "title_similarity": "0.047241785",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h8czuze",
            "score": 2,
            "text": "But why $500 million?",
            "title_similarity": "0.67482996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d0e8d",
            "score": 1,
            "text": "How do I see this article without paying? lol",
            "title_similarity": "0.24630038",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h8d0ezq",
            "score": 1,
            "text": "Nothing says misinformation like Reddit subtitles lol",
            "title_similarity": "0.20715788",
            "sentiment_compound": 0.3923
        },
        {
            "id": "h8d0fra",
            "score": 1,
            "text": "Once again this is the publication owned by the richest man on earth whom pays slave wages…",
            "title_similarity": "0.5152743",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8d0w5s",
            "score": 2,
            "text": "$500 MILLION?  Did they steal with Washington Monument?",
            "title_similarity": "0.80681837",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h8d1pc7",
            "score": 1,
            "text": "And?  How about the unvaccinated lying in hospitals at 20 grand a day or far more, that could and should have taken the vaccine?",
            "title_similarity": "0.7060014",
            "sentiment_compound": -0.1926
        },
        {
            "id": "h8d1tb8",
            "score": 18,
            "text": "Can we start calling these people the “Capitol Terrorists” instead of rioters?\n\nLanguage matters.",
            "title_similarity": "0.54151434",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8d2g78",
            "score": 1,
            "text": "There surely was enough of them to cover the whole bill, couldn’t we Venmo all the rioters or something",
            "title_similarity": "0.48517036",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8d2yq5",
            "score": 3,
            "text": "Very good question, and now I’m even more pissed about it.",
            "title_similarity": "0.18252282",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8d3le9",
            "score": 1,
            "text": "That's a pretty good question.",
            "title_similarity": "-0.0638235",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8d44yv",
            "score": 10,
            "text": "Bin Laden didn’t fly the plane…    \nI don’t know, maybe I’m an idiot but I feel like we can prosecute people a bit higher up the insurrection chain.",
            "title_similarity": "0.53644025",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h8d45mc",
            "score": 2,
            "text": "Breakdown of the 500 million?",
            "title_similarity": "0.53283846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d4kdk",
            "score": 2,
            "text": "Why is nobody asking how the damage total is THAT fucking high?\n\nEdit to explain: think about it, whole riots across cities cost less than that, and entire buildings get burned to the ground. How the fuck did what these idiots do total HALF A BILLION DOLLARS",
            "title_similarity": "0.7349721",
            "sentiment_compound": -0.875
        },
        {
            "id": "h8d4oa7",
            "score": 1,
            "text": "They have to be looked into that",
            "title_similarity": "-0.11605312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d4slk",
            "score": 2,
            "text": "No way did those stupid hogs deal $500 million damage",
            "title_similarity": "0.7810185",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h8d4x6h",
            "score": 1,
            "text": "Look, the deep-pocketed funders of those in Congress and otherwise who spread the online hate that led to this should foot the bill. Accountability. All the more reason why dark money should be banned.",
            "title_similarity": "0.5570951",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h8d5drz",
            "score": 1,
            "text": "Got a pay wall anyway anyone can help me out. Synopsis would be cool don’t wanna hurt journalists but ya know….. Daddy Bezos…..",
            "title_similarity": "0.36534238",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8d5eqe",
            "score": 3,
            "text": "Because socialism is only acceptable when it benefits white conservatives. Otherwise, it's considered evil.",
            "title_similarity": "0.37465864",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8d5f03",
            "score": 1,
            "text": "How do you think FBI informants get paid?",
            "title_similarity": "0.4875476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d5j50",
            "score": 2,
            "text": "Bankrupt all those traitors",
            "title_similarity": "0.3960175",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8d5u50",
            "score": 1,
            "text": "Sure, charge all the rioters the entire amount. Let’s see how they manage to actually pay that sum. And because we all know that they can’t, what is supposed to be done? Only fix what the rioters can pay for?",
            "title_similarity": "0.5624419",
            "sentiment_compound": 0.2168
        },
        {
            "id": "h8d5w53",
            "score": 2,
            "text": "Just have them each earn money at the federal minimum wage for 40 hours a week, and stay in prison until it is all paid up.",
            "title_similarity": "0.56723785",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h8d65ru",
            "score": 2,
            "text": "Unpatriotic fascists",
            "title_similarity": "0.113046825",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8d6hi7",
            "score": 4,
            "text": "For those asking about the money, it's reimbursing the National Guard and police, cleaning, repairing stuff*, and adding security. I may have missed something, going on memory. \n\n*remember the place is marble and expensive wood",
            "title_similarity": "0.5252699",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8d6jot",
            "score": 1,
            "text": "> Judge asks why Capitol rioters are paying just $1.5 million for attack, while U.S. taxpayers will pay more than $500 million\n\nThe clowns have that much in the bank?",
            "title_similarity": "0.96940136",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8d6y0w",
            "score": 1,
            "text": "Privatize the gains, socialize the attempted overthrow of the government. It's the Republican way.",
            "title_similarity": "0.43536922",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8d71gw",
            "score": 2,
            "text": "Go after the organizers and instigators, like the former president. He’s took in over $250 million after the election, and is still sitting on over $100 million in PAC money.",
            "title_similarity": "0.77450305",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8d7xlk",
            "score": 2,
            "text": "God I'm so sick of all this. I understand it's not that simple but everyone involved in that day, including those who perpetuated the big lie, need to be put on trial for treason and tossed into the pits of historical disgrace like Benedict Arnold",
            "title_similarity": "0.4971333",
            "sentiment_compound": -0.7681
        },
        {
            "id": "h8d894a",
            "score": 1,
            "text": "It only matters if they can pay out. For example, Neo-Nazi Andrew Anglin had a $14M judgement against him. But the woman he led a mass-harassment campaign against likely won't see a dime of that money.",
            "title_similarity": "0.7035033",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h8d8b8n",
            "score": 1,
            "text": "*“peaceful protesters” have left the chat*",
            "title_similarity": "0.1383949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d8zzs",
            "score": 1,
            "text": "In the 40s prominent wealthy, corporate Titans (Henry Ford, Prescott Bush etc) attempted to muster a military coup to stop Roosevelt. The General they approached testified before Congress. Nothing happened to any of them. Nothing! https://harpers.org/2007/07/1934-the-plot-against-america/",
            "title_similarity": "0.6658814",
            "sentiment_compound": 0.4389
        },
        {
            "id": "h8d9tus",
            "score": 2,
            "text": "It’s like trying to sue the Taliban and all you can get are goats…",
            "title_similarity": "0.42642772",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8dah3j",
            "score": 1,
            "text": "But it is a crime to incite a violent government insurrection.",
            "title_similarity": "0.40073264",
            "sentiment_compound": -0.9022
        },
        {
            "id": "h8dbmqv",
            "score": 1,
            "text": "If it ain’t not broke, don’t not fix it!",
            "title_similarity": "0.08732747",
            "sentiment_compound": 0.3867
        },
        {
            "id": "h8dbx8q",
            "score": 1,
            "text": "They couldn’t even afford to get there without Charlie Kirk",
            "title_similarity": "0.3131451",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dchrs",
            "score": 2,
            "text": "Paywall free link.\n\nhttp://web.archive.org/web/20210809224956if_/https://www.washingtonpost.com/local/legal-issues/capitol-riot-costs-defendants-pay/2021/08/09/ff05f4b0-f923-11eb-9c0e-97e29906a970_story.html",
            "title_similarity": "0.381926",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8dcydk",
            "score": 2,
            "text": "These domestic terrorists have nearly matched the ROI of the 9/11 attackers",
            "title_similarity": "0.5649061",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h8dddjt",
            "score": 6,
            "text": "Cool. Domestic terrorists attack our capitol, and my broke ass has to help pay for it. Fuck every one of you that took part on the 6th, you are shit human beings and deserve more than the worst things possible.",
            "title_similarity": "0.58392394",
            "sentiment_compound": -0.9697
        },
        {
            "id": "h8ddeks",
            "score": 1,
            "text": "How did they get to the $500 million number in damages?",
            "title_similarity": "0.83117753",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8ddtj5",
            "score": 1,
            "text": "New core math skills 🤷‍♀️🤦‍♀️",
            "title_similarity": "0.15174943",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dfuq2",
            "score": 3,
            "text": "Because white supremacy comes with privilege...",
            "title_similarity": "0.17750432",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8dfvqs",
            "score": 3,
            "text": "Trump told them to do it. He’s a criminal and leader of a terrorist organization. End of story.",
            "title_similarity": "0.47076666",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h8dgvsk",
            "score": 1,
            "text": "So do the people who were at the Capitol not pay taxes or something?",
            "title_similarity": "0.52797997",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h8dh1lk",
            "score": 1,
            "text": "Good point...Bezos why aren't u paying any taxes either. You're certainly fucking over everyone on your way to being spacedaddy. Weirdo",
            "title_similarity": "0.5106487",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8dhtcf",
            "score": 2,
            "text": "No one is being prosecuted because the DOJ is probably afraid of stoking violent right wing extremists",
            "title_similarity": "0.31681347",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h8dhwkp",
            "score": 1,
            "text": "lol now we care about tax payer money haha",
            "title_similarity": "0.3776909",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h8diafc",
            "score": 2,
            "text": "stop posting paywalled crap.",
            "title_similarity": "0.22392476",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8diaoa",
            "score": 2,
            "text": "Meanwhile cops get away with murder with paid vacation.",
            "title_similarity": "0.4346056",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h8digaw",
            "score": 3,
            "text": "Should be exclusively on the perpetrators, Trump family and company, and the Republican Party. They should pick up 100% of the tab.",
            "title_similarity": "0.5429077",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8dj2im",
            "score": 1,
            "text": "Why exactly is it going to cost half a billion? Are they talking for ongoing security costs? Cuz I thought that we already had pretty significant tax for military uses…?",
            "title_similarity": "0.6881019",
            "sentiment_compound": 0.787
        },
        {
            "id": "h8djsim",
            "score": 1,
            "text": "They take our money for anything and everything no matter what. Why complain at this point?",
            "title_similarity": "0.27371353",
            "sentiment_compound": -0.3765
        },
        {
            "id": "h8djtu6",
            "score": 1,
            "text": "Yeah I'm asking that too.",
            "title_similarity": "-0.1711147",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8dk61a",
            "score": 1,
            "text": "How did they run up $500mm? Serious question also they should be 120% responsible",
            "title_similarity": "0.7275928",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8dk6s5",
            "score": 1,
            "text": "there’s a lot more citizens that rioters",
            "title_similarity": "0.35427034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dkdpy",
            "score": 1,
            "text": "I wonder the same thing for things like the 2008 crash...",
            "title_similarity": "0.44475153",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8dkmvo",
            "score": 1,
            "text": "they don't have insurance ?",
            "title_similarity": "0.07704021",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dl9pe",
            "score": 1,
            "text": "Not going to happen. Did he see those overachievers?",
            "title_similarity": "0.24140735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dlo35",
            "score": 1,
            "text": "Uh...because government loves to tax.",
            "title_similarity": "0.3239425",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8dlwlc",
            "score": 2,
            "text": "Fuck Trump",
            "title_similarity": "0.21824174",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8dlwur",
            "score": 1,
            "text": "So who didnt pay insurance at the capital that month 😂 pay your bills uncle Sam",
            "title_similarity": "0.6302487",
            "sentiment_compound": 0.4695
        },
        {
            "id": "h8dlzac",
            "score": 1,
            "text": "Ruin them",
            "title_similarity": "0.032466978",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8dlzcf",
            "score": 1,
            "text": "Probably cause they don’t have $500 million?",
            "title_similarity": "0.6744627",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dn2y3",
            "score": 1,
            "text": "once again we, the people, are the ones who suffer",
            "title_similarity": "0.14802757",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8dntwo",
            "score": 2,
            "text": "Because they are white. Duh.",
            "title_similarity": "0.003106461",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8do1zz",
            "score": 1,
            "text": "That's a great question, Judge.",
            "title_similarity": "0.069637045",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8dpfgd",
            "score": 1,
            "text": "How in the fuck did that cost 500 million, no like really think about the amount of damage you need to do to equal 500 million in damages. Even factoring labor that’s full of shit.",
            "title_similarity": "0.7864688",
            "sentiment_compound": -0.9361
        },
        {
            "id": "h8dpxxd",
            "score": 1,
            "text": "What’s with the spam pop ups ban these on this site!",
            "title_similarity": "0.27178404",
            "sentiment_compound": -0.75
        },
        {
            "id": "h8dq8ri",
            "score": 1,
            "text": "Paywall",
            "title_similarity": "0.2409384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dr4ws",
            "score": 1,
            "text": "COLOUR me shocked",
            "title_similarity": "0.030081725",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8ds3cr",
            "score": 2,
            "text": "It’s basically the GOP version of welfare. But instead of feeding the hungry their funding the alt-right. Maybe they should start issuing hate-stamps to pay for zip ties and buffalo horns.",
            "title_similarity": "0.5486088",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8ds5gj",
            "score": 1,
            "text": "why? because we're AMERICA THAT'S WHY!!!",
            "title_similarity": "0.24941593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ds9uw",
            "score": 3,
            "text": "To quote Chris rock, “if it’s all white, it’s all right” That stand up show from circa 1997 was classic",
            "title_similarity": "0.25679958",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dst0w",
            "score": 1,
            "text": "Probably because there are 300,000 tax payers compared to the hundreds of capitol rioters. How much is the average tax payer paying in comparison? I bet it’s pretty low, if it’s hurting anybody significantly then it’s someone who is rich, but I’m sure it’s still insignificant for them. But let’s make an issue out of nothing.",
            "title_similarity": "0.77325726",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h8dude3",
            "score": 2,
            "text": "I still can’t get over the fact that republicans were allowed to vote on whether they themselves should be investigated or not.",
            "title_similarity": "0.4303241",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dvm88",
            "score": 1,
            "text": "Expensive window",
            "title_similarity": "0.2238768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dx3mp",
            "score": 1,
            "text": "500 million? For what its not like they burned the place down",
            "title_similarity": "0.5820972",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h8dxmbg",
            "score": 3,
            "text": "the state always picks up the bill for the right.",
            "title_similarity": "0.22535245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dzzko",
            "score": 2,
            "text": "The comments are cancerous.",
            "title_similarity": "0.19226187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8e2mj7",
            "score": 2,
            "text": "There is no way there was 500 million in damages that is a insane claim and they did not back it up at all",
            "title_similarity": "0.43848842",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h8e6knd",
            "score": 2,
            "text": "Some say you shouldn’t compare Trump to Hitler. I 100% agree with this. Hitler actually got arrested",
            "title_similarity": "0.49339688",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8e6ynh",
            "score": 1,
            "text": "Be nice and split the bill evenly between those caught, encourage them to turn their friends in that were there too to get their portion lowered. 5% off for those who turn themselves in.",
            "title_similarity": "0.6151986",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h8e7mpl",
            "score": 3,
            "text": "Remember this thing called the American Civil War?  And how there was this thing called Reconstruction that basically amounted to a slap on the wrist of the rebels?  And remember how that lead to those rebels to immediately taking back power in their state governments and disenfranchising nearly every black person in the South?  And remember how local law enforcement never caught or even seriously investigated white supremacists who lynched thousands of Black Americans and their white allies?  Yeah, that's what we're heading for if we let the Trump terrorists get off easy.  Charge every single one with treason, sedition, and felony-murder.",
            "title_similarity": "0.6512622",
            "sentiment_compound": -0.9356
        },
        {
            "id": "h8e7sjv",
            "score": 1,
            "text": "*Capitol Seditionists, Capitol Treasonists, Capitol Assholes\n\nAny of those work better than “rioters”.",
            "title_similarity": "0.5331371",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8e7uio",
            "score": 1,
            "text": "2.5 billion. Don’t forget that Congress felt that capital police needed another 2 billion off the cuff",
            "title_similarity": "0.80720365",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8e8p2x",
            "score": 2,
            "text": "Good on this judge.  Enough with the leniency.  Life sentences for all involved.  GQP is pro-prison, this is one way to fill them up and meet quotas!",
            "title_similarity": "0.3606784",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h8ebxt4",
            "score": 1,
            "text": "So why 500 million that seems like alot for a few doors",
            "title_similarity": "0.6099331",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8ecdtr",
            "score": 1,
            "text": "Taxpayers just paid two billion for some blimps and extra FOB’s for the capital police and then 30 million more because they spent so much of the 2 billion on blimps they couldn’t make payroll",
            "title_similarity": "0.7620257",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8eclxz",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.0023898557"
        },
        {
            "id": "h8ecore",
            "score": 1,
            "text": "The rioters caused the damage and should be made to pay the repair fees. $0 should be paid by the law abiding citizens who did not attempt to overthrow a legitimate government just because the guy they voted for lost.",
            "title_similarity": "0.63595665",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h8edhxy",
            "score": 1,
            "text": "That's easy. They can't afford the 1.5 million!",
            "title_similarity": "0.55429626",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h8efayj",
            "score": 1,
            "text": "Just reading the headline but seriously these lowlifes that attack the capitol you think that they could pay back 500 million? I’d be surprised if the government ever sees the 1.5mil alone. That might be the one answer.",
            "title_similarity": "0.89406997",
            "sentiment_compound": -0.9052
        },
        {
            "id": "h8efld6",
            "score": 1,
            "text": "Why do people post links to paywalls?!",
            "title_similarity": "0.3443808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8efne8",
            "score": 1,
            "text": "Because the govt has the ultimate power to steal anything.",
            "title_similarity": "0.37678295",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8eg7g0",
            "score": 2,
            "text": "Are all you guys really subscribed to the Washington post? I can’t read shit",
            "title_similarity": "0.44407642",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8egfmn",
            "score": 1,
            "text": "Why will it cost 500 million though? How much damage did they do? This sounds a bit like my \"insurance negotiated medical bill.\"",
            "title_similarity": "0.7641546",
            "sentiment_compound": -0.264
        },
        {
            "id": "h8eh5wn",
            "score": 2,
            "text": "I would say send the bill to Trump but it will never get paid…",
            "title_similarity": "0.44369155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8eibbz",
            "score": 1,
            "text": "Good question, your honor.",
            "title_similarity": "-0.023851339",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8eqe8f",
            "score": 1,
            "text": "By this logic corrupt market makers should also be fined triljon of dollars and life in jail.",
            "title_similarity": "0.58726144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8erp6j",
            "score": 1,
            "text": "Why is it costing taxpayers half a billion dollars? Wasn't it fewer than 100 traitors?",
            "title_similarity": "0.78905207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8erswm",
            "score": 1,
            "text": "500 million. There is no way so much damage was cause. \n\nThe repair contract probably went to someone's buddy and they inflated the cost.",
            "title_similarity": "0.64657545",
            "sentiment_compound": -0.6887
        },
        {
            "id": "h8etw3a",
            "score": 1,
            "text": "Give the rest of the bill to Tump. He’s the one that t instigated it.",
            "title_similarity": "0.36130905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8eykqi",
            "score": 1,
            "text": "Bill trump when his week gets supeanud",
            "title_similarity": "0.39080426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8f43k7",
            "score": 1,
            "text": "Does the White House have home owners insurance?",
            "title_similarity": "0.36593944",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8f50y5",
            "score": 1,
            "text": "Why are we paying for Kenosha and the chop/chaz zones that cost us billions in damage",
            "title_similarity": "0.6854938",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8f594e",
            "score": 2,
            "text": "Let’s be real, if they all collectively got sued for $500 million I highly doubt they even have 1% of that between them.",
            "title_similarity": "0.82913226",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h8foobe",
            "score": 1,
            "text": "That's the difference between $1.40 for the taxpayers and $2500 for those charged",
            "title_similarity": "0.7170115",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8g4z1d",
            "score": 1,
            "text": "500 million dollars of damage was done? I find that a ridiculous amount. There is no way that they did 500 million dollars worth of damage. If the whole building was burnt to the ground I would still find it hard to believe. Are there solid gold waste baskets in there? This sounds like a new Enron scam to me. I don't care what political side you're on. 500 million goes to show that We The People are still being lied to.",
            "title_similarity": "0.74736893",
            "sentiment_compound": -0.9558
        },
        {
            "id": "h8gbpnr",
            "score": 1,
            "text": "1.5 million is pretty low for attacking the US Capitol. But also who not tax the rich better. Two separate issues but both aren’t paying enough.",
            "title_similarity": "0.7181629",
            "sentiment_compound": -0.1245
        },
        {
            "id": "h8gsd4o",
            "score": 2,
            "text": "America must be the least educated 1st world country on the planet. I'm 63 years old and have seen a few things in my life. HOW, can anyone feel good about a former president who is responsible for the death of a police officer?",
            "title_similarity": "0.6593353",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8h0ezf",
            "score": 1,
            "text": "Tradition",
            "title_similarity": "-0.17675552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8hby7f",
            "score": 2,
            "text": "Can we get this same judge to question why the tax payers have to foot all the recount charges that trump made happen?",
            "title_similarity": "0.65407026",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8kzg7w",
            "score": 1,
            "text": "CIA/antifa",
            "title_similarity": "0.14564332",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8md31y",
            "score": 1,
            "text": "what, where, how and why 500K  ?",
            "title_similarity": "0.5342625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8qyj8n",
            "score": 1,
            "text": "Oh HELL NO!  They can pay \"Their Fair Share\" of ALL of it.",
            "title_similarity": "0.26543057",
            "sentiment_compound": -0.5461
        },
        {
            "id": "h8s9v3q",
            "score": 1,
            "text": "Thats what insurance is for.\n\nThats what we were told when antifa and BLM were rioting and causing tens of millions in property damage.",
            "title_similarity": "0.6361592",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8uzl3p",
            "score": 1,
            "text": "That's a very good question, your honor.  How about the insurrection's ringleader Donald J. Trump paying out a few million in restitution, by himself?  How about some of his accomplices like Rudy Giuliani and Rep. Mo Brooks paying their fair share as well?",
            "title_similarity": "0.717631",
            "sentiment_compound": 0.9307
        },
        {
            "id": "h91spwa",
            "score": 1,
            "text": "Harsh fines for an unscheduled tour",
            "title_similarity": "0.32011393",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hcpgeed",
            "score": 1,
            "text": "First one needs to be fancy",
            "title_similarity": "0.0837622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hspqmnz",
            "score": 1,
            "text": "It's because the terrorists are Republicans. If they were democrats you can bet your ass they'd be held accountable for every single damn penny.",
            "title_similarity": "0.6913948",
            "sentiment_compound": -0.8834
        }
    ]
}