{
    "Elizabeth Warren agrees Texas abortion law is like The Handmaid’s Tale. ‘When abortion is illegal, rich women still get abortions’\n": [
        {
            "id": "hbfifdm",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.49128366",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hbft68t",
            "score": 20,
            "text": "Such a backward un evolved country, no wonder the rest of the world laughs at them continuously",
            "title_similarity": "0.37088537",
            "sentiment_compound": 0.25
        },
        {
            "id": "hbfynpr",
            "score": -35,
            "text": "The lady that pretended to be Native American to get handouts? Really!?",
            "title_similarity": "0.4884661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfvt7k",
            "score": -30,
            "text": "If she really cared about progressive ideals she wouldn't have been a spoiler candidate meant to divide the progressives.",
            "title_similarity": "0.41407967",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hbg5goj",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbg27vf",
            "score": -3,
            "text": "Maybe someone should tell them that this means more Democrats will be born than ever before. That might get them to reconsider.",
            "title_similarity": "0.48140186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgcbst",
            "score": -18,
            "text": "She can afford the pearls she's clutching.  \n\nI can't believe people listen to this irrelevant loser.",
            "title_similarity": "0.54472315",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hbg8awc",
            "score": 2,
            "text": "This is just like when Voldemort created the Death Star.",
            "title_similarity": "0.35002685",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hbfzkqg",
            "score": -15,
            "text": "....Uhh that wasn't what the book was about. They kinda had the exact opposite problem. I wonder if she hasn't read it or is pandering to those who haven't while being ok with looking dumb to those who have?",
            "title_similarity": "0.43391234",
            "sentiment_compound": -0.7838
        },
        {
            "id": "hbg2ptv",
            "score": 1,
            "text": "I agree with Biden’s press secretary Jen Psaki. Women don’t need to be told what to do by men and vice versa. I also agree with Dave Chappell, if women get to choose whether or not the baby lives, I should get to decide whether I pay for it.",
            "title_similarity": "0.6453236",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbfrg9w",
            "score": -43,
            "text": "Congratulations Ms. Warren, you just figured out why gun control will never work, because the same logic applies",
            "title_similarity": "0.55865383",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbgww6x",
            "score": -5,
            "text": "It’s nothing like handmaid’s tale.  What stupidity.",
            "title_similarity": "0.31151918",
            "sentiment_compound": -0.6136
        },
        {
            "id": "hbh6233",
            "score": -2,
            "text": "Funny because Abortion isn’t illegal in Texas BEFORE six weeks. How about not using Abortion as birth control?\n\nHandmaids tale reminds me what things would be like if the Green Deal supporters had their way. A society built on hypocrisy and the “better good” of everyone not in the ruling class.",
            "title_similarity": "0.7710364",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbg0nhm",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbg0ne3",
            "score": -23,
            "text": "This is mostly Gavin Newsom’s fault. If he didn’t completely fuck up Cali then all of the wokesters wouldn’t be moving to Texas and we wouldn’t have to turn the dial up to 1,000 to persuade them to leave.",
            "title_similarity": "0.5702681",
            "sentiment_compound": -0.7713
        },
        {
            "id": "hbfykpq",
            "score": -44,
            "text": "Elizabeth Warren the fake native American has no moral standing",
            "title_similarity": "0.28979886",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hbg0lq4",
            "score": -21,
            "text": "Gasp!!! A Democrat agrees stopping abortion is bad? Who would’ve thought? Let’s upvote 16k times",
            "title_similarity": "0.61367047",
            "sentiment_compound": -0.6742
        },
        {
            "id": "hbgunku",
            "score": 1,
            "text": "Same energy as 'Wow this is just like Harry Potter!'",
            "title_similarity": "0.3244311",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hbh6fmb",
            "score": -1,
            "text": "Elizabeth Warren is an opportunist.",
            "title_similarity": "0.36171275",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hbhdtva",
            "score": -1,
            "text": "Glad she came down from the reservation to let us know her ideas. Maybe she can put it as a thought before a recipe in her next cook book.",
            "title_similarity": "0.50379825",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hbfxqrh",
            "score": 0,
            "text": "It’s becoming more obvious each passing day that the aim of the Texas legislature is to destroy minorities. Restrictive voter laws, easier gun ownership, harder abortion. They want to push the country back to Jim Crow.",
            "title_similarity": "0.55494255",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hbglucw",
            "score": 0,
            "text": "And there it is. Proving women have always been the backbone. Behind every successful man is a woman.",
            "title_similarity": "0.47096223",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hbgxtlr",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbh5tf4",
            "score": 0,
            "text": "Now imagine what would happen if Democrats applied that logic evenly...",
            "title_similarity": "0.35638574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhr01g",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbilpjy",
            "score": 0,
            "text": "Maybe dems should have fought those scotus nominations a little harder? I’m annoyed at Feinstein for hugging Graham. And I remember all the downvotes and hate I got on here from y’all saying I was a hater for calling her out on it and it’s dems like me that just tear them down, well, It looks even worse now.\n\nStill wondering why trump was never arrested on 1/20 like all y’all said either 🤣\n\nKids on Twitter Jesus, I heard this same shit about bush a decade ago. And here we are.",
            "title_similarity": "0.5379545",
            "sentiment_compound": -0.4909
        },
        {
            "id": "hbiwnn9",
            "score": 0,
            "text": "Poor women get abortions, also.  EW=irrelevant.",
            "title_similarity": "0.6553041",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbfv28x",
            "score": -24,
            "text": "democrats need to stop comparing things to the handmaid's tale.   it just makes them sound like idiots.",
            "title_similarity": "0.46115902",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbfwhw1",
            "score": -2,
            "text": "I'd say let's keep it going and take their right to vote",
            "title_similarity": "0.3316266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg0n7w",
            "score": 1,
            "text": "Ireland didn't have abortions up until very recently (and even now, I believe it's illegal after 12 weeks). Can we have the data regarding how many women lost their lives by NOT being able to have abortions in that country?",
            "title_similarity": "0.63460743",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hbg8kmq",
            "score": -1,
            "text": "Maybe I’m wrong, but it seems like Democrats waited until the worst time to start promising legislative protections against this type of thing. Any idea why?",
            "title_similarity": "0.4526853",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbg8ywc",
            "score": -2,
            "text": "And if we applied the exact same logic to gun control, these idiots would be clamoring saying “that’s a good thing”",
            "title_similarity": "0.5717095",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbh9a9q",
            "score": -4,
            "text": "Women in Texas can't work, read, or use contraception? And are the sexual slaves of military commanders, with like half the men in the military?\n\n\"Like The Handmaid's Tale\", lol, I love leftist hyperbole. Those places do kinda exist though. You know where.",
            "title_similarity": "0.7095604",
            "sentiment_compound": 0.9074
        },
        {
            "id": "hbhccm8",
            "score": -2,
            "text": "Wow, a corrupt politician lies for publicity. What a surprise",
            "title_similarity": "0.3819207",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hbfw730",
            "score": 5,
            "text": "Rich people also get away with being phonies and hypocrites.",
            "title_similarity": "0.4620705",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbftzd4",
            "score": -18,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbfsmh9",
            "score": -23,
            "text": "She would know….she’s a rich woman!",
            "title_similarity": "0.4491346",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hbg0qxp",
            "score": -19,
            "text": "Yes, Elizabeth Warren, the beacon of sanity",
            "title_similarity": "0.31172717",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbfkquo",
            "score": 46,
            "text": "Triple the child support payments from the fathers",
            "title_similarity": "0.27868694",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbg1std",
            "score": -7,
            "text": "She should crack open a beer and tell us all about it. Yknow, Since she’s just like the rest of us.",
            "title_similarity": "0.5825743",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbfrzu3",
            "score": -28,
            "text": "Remember when Warren accused Bernie of being a sexist?",
            "title_similarity": "0.4158357",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbfs0ri",
            "score": 1,
            "text": "I wonder if all the other out of state clinics will just say if your from Texas your not allowed to be have service here. Wonder how long that will take to get the point across.",
            "title_similarity": "0.5329612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh1nax",
            "score": 1,
            "text": "Should just leave Texas if thats the case. They will suffer without the revenue “libs” bring in to the state. Have corporations put their money where their mouth is.",
            "title_similarity": "0.6319008",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hbh2x74",
            "score": -1,
            "text": "That's cute. Maybe she should have thought about that before she stabbed Bernie in the back and then twisted the knife over🐍🐍🐍 on Maddow.\n\nBecause you know Bernie would be pulling any maneuvers he could to stop this. Joe Biden won't because he's spineless, except for in the issue of Afghanistan.\n\nI'm not saying it's all her fault, but really that should haunt her the rest of her political career.\n\nAnd she should be primaried for it in 2022, but I'm pretty pessimistic on that.",
            "title_similarity": "0.606703",
            "sentiment_compound": -0.648
        },
        {
            "id": "hbfpt6d",
            "score": 6,
            "text": "[Under his eye, blessed be the fruit](https://imgur.com/WDn7p4U)",
            "title_similarity": "0.33836716",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hbgax1a",
            "score": -17,
            "text": "Correct me if I’m wrong but this is only an abortion ban AFTER six weeks correct? Abortions are still legal up to six weeks, I don’t understand the outrage in how we can look at a tiny bacteria on Mars and say “ooooh this is life!!”, then turn around and say a fetus with a heartbeat isn’t a life",
            "title_similarity": "0.65579593",
            "sentiment_compound": -0.9049
        },
        {
            "id": "hbgv6ch",
            "score": -11,
            "text": "Don’t use abortion like birth control",
            "title_similarity": "0.4520493",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbghi0y",
            "score": -5,
            "text": "How is a terrible awful abortion law comparable to enslaving women to have your children due to the infertility of 99% of women?   Did Elizabeth Warren not watch the show or is it just her Alzheimer’s?",
            "title_similarity": "0.6150546",
            "sentiment_compound": -0.755
        },
        {
            "id": "hbfxsjj",
            "score": -27,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbfipkw",
            "score": 13,
            "text": "...and this my friends is the very definition of one rule for you and one for me.",
            "title_similarity": "0.31112653",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hbgvwfv",
            "score": -4,
            "text": "Pocahontas can STFU..",
            "title_similarity": "0.2021428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfvpan",
            "score": 3,
            "text": "As someone who has followed the AMC/Gamestop drama closely, I've come to realize that laws for the rich and elite are actually more suggestions than rules.",
            "title_similarity": "0.5703961",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbfylp4",
            "score": 2,
            "text": "So we can all agree that we’re against government controlling our bodies?",
            "title_similarity": "0.43474337",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbg1gfn",
            "score": 2,
            "text": "Liz Warren and the rest if Congress can fix this in a afternoon. Biden is pushing to codify Roe as Federal law. That’s the path that should have been followed in 73.",
            "title_similarity": "0.5141445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg91rt",
            "score": -1,
            "text": "Well that’s fvcking great! She agrees. Now what",
            "title_similarity": "0.26212615",
            "sentiment_compound": 0.807
        },
        {
            "id": "hbg9xgl",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbgdmzx",
            "score": -2,
            "text": "same with guns",
            "title_similarity": "0.17588082",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbha803",
            "score": 0,
            "text": "\"If murder is illegal, the rich will hire a hitman\" is not an argument for murder",
            "title_similarity": "0.5350616",
            "sentiment_compound": -0.8515
        },
        {
            "id": "hbhy5iw",
            "score": -1,
            "text": "Lol ahh yes it’s all the handmaidens tale and nazis. Y’all are going to have to come up with actual arguments at some point. Hell I wish we could just be honest about what we’re doing and why so we could have a real discussion instead of this nonsense talk. \n\nHey I think we should be able to kill unwanted babies prior to birth because of convenience. In western civilization there is a very long history of doing this and good reasons for the practice. \n\nHey I think we should not do that because I value the sanctity of that life for morale reasons. \n\nCool then we can have a real argument at least and I’m inclined to side honesty with the latter argument but we’ll never get anywhere with all this hyperbole. All these people thinking they’re pro life and pro choice when they’re really having the argument of when is it okay to kill an inconvenient person who has rights when and what are they.  I wish we could just hammer out our cultures view on killing .",
            "title_similarity": "0.66151166",
            "sentiment_compound": -0.9569
        },
        {
            "id": "hbg1y3e",
            "score": -11,
            "text": "When drugs are illegal, poor and rich people still get drugs. That doesn’t mean that they shouldn’t be criminalized. For a smart woman, this is a dumb argument.",
            "title_similarity": "0.63318336",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hbfyjsq",
            "score": -5,
            "text": "You know none of these articles complaining about a state's decision is going to change the outcome, just like elections, and other laws that passed.  All its going to do is make the other side look stronger and more outcomes will pass with flying colors.   Maybe some need to shut up before the situation gets even worst.  Watch out.  Roe V Wade is going to dissappear before you all know it.",
            "title_similarity": "0.5694114",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hbg482c",
            "score": -5,
            "text": "Just like guns amirite?",
            "title_similarity": "0.3455149",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbh63rw",
            "score": -8,
            "text": "This is so pathetic. It blows my mind how many people fight for the right, which is not in the constitution, to end a life.",
            "title_similarity": "0.40033787",
            "sentiment_compound": -0.8096
        },
        {
            "id": "hbg04fj",
            "score": -9,
            "text": "Has she actually ever watched handmaids tale?",
            "title_similarity": "0.426552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfwj0c",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbhgjyw",
            "score": -4,
            "text": "Honest question, why does the whole world seem to be behind human rights, bettering the lives and treatment of others, and still think millions of abortions are ok?",
            "title_similarity": "0.7015486",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbfykn7",
            "score": -22,
            "text": "Warren's hypocrisy knows no bounds. While having a net worth of at least $12 million, she continues to cast every issue in America as an example of classism.",
            "title_similarity": "0.603585",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hbg17bn",
            "score": 0,
            "text": "So this law made news a couple years ago, how come it was only implemented now?",
            "title_similarity": "0.4173246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg2m8g",
            "score": -3,
            "text": "Cool. Now do guns.",
            "title_similarity": "0.2549385",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbgsbk2",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbh3gfi",
            "score": 0,
            "text": "Didn’t she say she had no problem with billionaires?",
            "title_similarity": "0.47283393",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hbh45uf",
            "score": 0,
            "text": "Did Texas cut funding to all free abortion clinics?",
            "title_similarity": "0.69478565",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbh8241",
            "score": 0,
            "text": "Kinda like haircuts......",
            "title_similarity": "0.17359063",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hbh8ry2",
            "score": 0,
            "text": "Welcome to the gun control debate",
            "title_similarity": "0.45326686",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hbh9vak",
            "score": 0,
            "text": "agrees.....\n\n&#x200B;\n\nas if that is a statement of fact. \n\nThe book, movie and show are overrated.",
            "title_similarity": "0.45620587",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbhks8y",
            "score": 0,
            "text": "\"If you ban abortions then they will just get abortions in back alleys. You'll make a black market\"\n\nGun owners: wait, I've seen this one",
            "title_similarity": "0.6932677",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hbhl9hn",
            "score": 0,
            "text": "It's wild how people - primarily white liberals - seem to think women in Texas don't know how to drive to a different state. \n\nFor the record I think the Texas law is wrong, but this is the same as when white liberals talk about how black people don't know how to get ID or can't afford internet: https://www.youtube.com/watch?v=3JGmKHrWKMQ",
            "title_similarity": "0.6654146",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hbhlgrf",
            "score": 0,
            "text": "She’s also “Native American” and Bernie sanders told her that a  woman could never win the presidency…she’s a politician through and through… fuck her",
            "title_similarity": "0.6176872",
            "sentiment_compound": -0.763
        },
        {
            "id": "hbhojx4",
            "score": 0,
            "text": "Snitchistan",
            "title_similarity": "0.17545041",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhp26o",
            "score": 0,
            "text": "Rich people get to do things poor people can't.\n\nAlert the media",
            "title_similarity": "0.45982182",
            "sentiment_compound": -0.0997
        },
        {
            "id": "hbhrvuy",
            "score": 0,
            "text": "Wow sounds kind of like gun laws....",
            "title_similarity": "0.46590242",
            "sentiment_compound": 0.5584
        },
        {
            "id": "hbhsxbq",
            "score": 0,
            "text": "And when masks are required, liberal elites dgaf.",
            "title_similarity": "0.43990764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbht5ki",
            "score": 0,
            "text": "Ow, the snale agrees it's bad? Case closed the. We can safely ignore it from now on and pretend it's \"complicated \"?",
            "title_similarity": "0.42890596",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hbhu7c4",
            "score": 0,
            "text": "When anything is illegal, it’s still available.\nLook at Chicago, California, phliladelphia, New York City.",
            "title_similarity": "0.46700442",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbhv5rl",
            "score": 0,
            "text": "Gonna take a wild guess and say they have no idea what actually happens in that story.",
            "title_similarity": "0.27807143",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbhw348",
            "score": 0,
            "text": "It’s not illegal",
            "title_similarity": "0.07111305",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hbi1n55",
            "score": 0,
            "text": "How do rich women get abortions if it illegal?",
            "title_similarity": "0.75434196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbid7am",
            "score": 0,
            "text": "Wait until they find out about regressive taxes…",
            "title_similarity": "0.3835482",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbihwtj",
            "score": 0,
            "text": "No one here lives in Texas so relax!",
            "title_similarity": "0.2868534",
            "sentiment_compound": 0.4278
        },
        {
            "id": "hbiiaxj",
            "score": 0,
            "text": "Can’t you just drive an hour and leave the state, get an abortion, then return? Lol",
            "title_similarity": "0.60787284",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbitlef",
            "score": 0,
            "text": "“Yeah, it’s totally like Handmaid’s Tale” is what i imagine the quote is.",
            "title_similarity": "0.45332342",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hbjly2i",
            "score": 0,
            "text": "More red meat for whichever side your on. Blah, blah, blah. Who cares what Elizabeth Warren or Gov. Abbot says or does. Isn't it about time we discuss the simple issue of whether or not a human is worthy of human rights if it's in an early stage of it's natural development?",
            "title_similarity": "0.51629823",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hbjnrkh",
            "score": 0,
            "text": "Who gives a shit what she thinks? This woman is a blight on society and a disgrace on the senate.",
            "title_similarity": "0.39981782",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hbjw3eu",
            "score": 0,
            "text": "Tell me what is wrong with protecting the most innocent and vulnerable among us? Does an unborn child have the right to decide if he or she wants to be born? Where is the choice for the fetus? I hear the clamor about women's reproductive rights When a child is conceived, the selfish perspective of the woman being the center of her universe ends. It is now the life in her womb who should be both prioritized and protected. If her pregnancy is unplanned, either embrace it or consider adoption as an alternative. Every child deserves to be born. He or she was created by God for a very special purpose. The Texas law may well represent a precedent for ridding society of abortion in its entirety. We need more compassion toward the unborn and not to have them regarded as expedient and immaterial. Women have been brainwashed  by abortion providers saying that the procedure is safe or that \"you won't really feel a thing\". But  the woman is discarded like used Kleenex after the termination has been completed and abandoned to pick up both the psychological and physical wreckage of her life on her own.  Let us not forget the baby as well. That baby in the womb is feeling the total pain of its premeditated murder.Abortion is never a win for its victims only for the abortion providers who gleefully capitalize on a woman's vulnerability and/or desperation. I heartily endorse the Texas law and hope it is affirmatively received by every other state.",
            "title_similarity": "0.6169338",
            "sentiment_compound": -0.7601
        },
        {
            "id": "hbjylqc",
            "score": 0,
            "text": "Why and how does Pocahontas still retain enough legitimacy to open her mouth on anything? Also, the UK has enough issues to be dealing with, mind your business.",
            "title_similarity": "0.50533307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbk16tu",
            "score": 0,
            "text": "Isn't this the same woman that lied about her native American heritage on the bar exam? Why does her opinion even matter her integrity is questionable.",
            "title_similarity": "0.55760634",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hbkox00",
            "score": 0,
            "text": "So, when I post about gun issues to r/politics the moderators remove it because it isn't \"political\".  \nI remind them that the dimensions of the issue are entirely political to no avail.  \nGlad to see they are acknowledging that reproductive freedom is political.",
            "title_similarity": "0.5481386",
            "sentiment_compound": -0.2832
        },
        {
            "id": "hc0mypd",
            "score": 0,
            "text": "Imagine if y’all worked this hard to stop for human trafficking,pedophilia help people in poverty but Na bring down the heavens for this people are a riot",
            "title_similarity": "0.5350058",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbfx1pc",
            "score": -20,
            "text": "How is this fraud even still relevant?  She’s so disingenuous and an obvious liar.  Super Native American too.",
            "title_similarity": "0.41481727",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hbfwd9d",
            "score": -27,
            "text": "Wonderful thing about the US is that you can find a state that aligns with your views. Dont like it? gtfo of Texas.",
            "title_similarity": "0.56666696",
            "sentiment_compound": 0.3798
        },
        {
            "id": "hbfzqig",
            "score": 30,
            "text": "If men could get pregnant, the morning after pill would be available in ranch, BBQ and Extreme Nacho….",
            "title_similarity": "0.5071714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfulma",
            "score": -14,
            "text": "Just how when there were mask mandates but half of Congress (D’s and R’s) didn’t wear masks except for when in front of the cameras.",
            "title_similarity": "0.35305682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgxrv8",
            "score": -7,
            "text": "It’s not illegal though. You can still get one at 6 weeks.",
            "title_similarity": "0.34901983",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hbfw1z4",
            "score": 17,
            "text": "r/republican and r/conservative are domestic terrorists",
            "title_similarity": "0.43537027",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hbfwjsv",
            "score": -17,
            "text": "Elizabeth Warren got rich by falsely claiming that she was a Native American.\n\nState Bar registration;\n\nRace: American Indian\n\n\"The AALS directories were used by law schools when searching for new professors, prompting some Republicans to charge that she was claiming Native identity to get ahead.\n\nWarren moved from the University of Texas to the University of Pennsylvania in 1987. After she worked at Penn for about two years, the university changed her recorded race from white to Native American, school records show. Warren has told the Boston Globe that she requested the change, saying it was important for her to reflect what she believed to be her family heritage.\n\nSeveral months after Warren started working at Harvard Law School in late 1995, Harvard recorded her ethnicity as Native American, according to university records reported by the Globe. The records include a memo showing that Warren signed off on the change.\"\n\n\nhttps://www.washingtonpost.com/politics/after-new-document-is-revealed-warren-struggles-with-questions-of-identity/2019/02/06/bf380538-2a24-11e9-b011-d8500644dc98_story.html\n\nhttps://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MT5TG7RJU4I6TGCNTOH3UAB6QE.png\n\n\"A 1997 Fordham Law Review article described Democratic Senate hopeful Elizabeth Warren as Harvard Law School's \"first woman of color,\" saying in footnotes that the information was based on a 1996 telephone interview with a Harvard spokesman.\n\nThe spokesman cited, Michael Chmura, also described Ms. Warren in a 1996 Harvard Crimson article as a Native American, and an example of faculty diversity at a time when the law school was facing heat that it was too male and too white.\"\n\nhttps://www.wsj.com/articles/SB10001424052702304371504577406901777485754\n\nThe blonde haired, blue eyed, Elizabeth Warren listed herself as a Native American in the directories and changed her school records to start saying Native American. This eventually got her to Harvard where she was listed as Harvard Law School's  \"first woman of color\".",
            "title_similarity": "0.62654066",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hbgbaac",
            "score": -17,
            "text": "How dare they ban the killing of unborn babies at 6 weeks who already have developing brains, spinal cords, and beating hearts! Oh, the humanity!",
            "title_similarity": "0.4962916",
            "sentiment_compound": -0.8065
        },
        {
            "id": "hbg4fa7",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbfz72i",
            "score": -1,
            "text": "I am absolutely disgusted and appalled",
            "title_similarity": "0.091161534",
            "sentiment_compound": -0.788
        },
        {
            "id": "hbg0igo",
            "score": -1,
            "text": "Idiocracy is real",
            "title_similarity": "0.2926104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgqtvc",
            "score": -1,
            "text": "is that what that show is about?",
            "title_similarity": "0.10820854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgrre5",
            "score": -1,
            "text": "“Wealthy politicians are evil!…but let’s blindly listen to them anyway, because they represent my team.”",
            "title_similarity": "0.5832127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbguglq",
            "score": -1,
            "text": "90s Russia had treated abortion as an immediate first resort to the point that their demographics are hollowed out, but I'd hardly think Democrats would consider it a feminist paradise.",
            "title_similarity": "0.66654944",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hbgyfmb",
            "score": -1,
            "text": "You are free to leave the state.",
            "title_similarity": "0.26417598",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hbh6oa8",
            "score": 1,
            "text": "It's been a while since I read the book but isn't the premise that only very few women are fertile and the ones who are fertile are given to men of high status to use a breedmares? How is that like an abortion ban?",
            "title_similarity": "0.6310057",
            "sentiment_compound": -0.4606
        },
        {
            "id": "hbhbyup",
            "score": 1,
            "text": "You would think democrats having the house and senate would have gave us better things like a nationwide min wage increase , legalize weed , or have abortions without the fear of being arrested. But no we got this . Thx Biden . Ps great job on pulling out of Iraq, that’s not sarcasm. I’m glad we left a 20yr old war",
            "title_similarity": "0.71315277",
            "sentiment_compound": 0.3905
        },
        {
            "id": "hbhe4vx",
            "score": -1,
            "text": "I have never heard of a woman wanting to \"poison\" herself if she wanted to get an abortion but didn't have the financial means to do so. That is such a hypothetical and lacks any statistical analysis. I've heard of women becoming depressed during and after pregnancy, now that's a given especially in a rare case when a woman bares a rapist's child.\nThe issue of abortion is not simple, but I fear that the general allowance of this act if not set with the right parameters + the degradation of family structure will inhibit the murder of many innocent children.",
            "title_similarity": "0.62536126",
            "sentiment_compound": -0.9762
        },
        {
            "id": "hbhfo1c",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbhhir9",
            "score": 1,
            "text": "…says the woman that’s used her position to become wealthy",
            "title_similarity": "0.4976967",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbhltuv",
            "score": -1,
            "text": "funny how 64k people are convinced with this shit logic, it is bad if only rich can do it",
            "title_similarity": "0.5345584",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbhnr6r",
            "score": 1,
            "text": "Saying this is equal to the Handmaid's Tale is not only hyperbolic, but extremely disrespectful to the millions of woman living under truly horrific and oppressive conditions.\n\nThese two woman with more power and money than most men in the country complaining they are being oppressed because Texas passed an abortion law that they are free to criticize on national TV (while getting paid to do it), vote against, and protest against is mind blowing. \n\nAt this same time these two assholes are making millions bitching on TV about how they are oppressed, millions of woman are being brutalized in other countries for real. \n\nDebate abortion all you want; argue it diminishes woman's rights; but saying this means we are all living in a dystopian oppressive patriarchy is complete bullshit.",
            "title_similarity": "0.67660445",
            "sentiment_compound": -0.9921
        },
        {
            "id": "hbhntgh",
            "score": 1,
            "text": "jUsT lIkE 1984",
            "title_similarity": "0.12662902",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbhoh99",
            "score": 1,
            "text": ">Elizabeth Warren \n\nStopped reading there",
            "title_similarity": "0.2830102",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbhosoz",
            "score": 1,
            "text": "People should read more shit than Handmaids Tale or 1984. The lack of catchphrase diversity is becomming annoying.",
            "title_similarity": "0.48003638",
            "sentiment_compound": -0.8357
        },
        {
            "id": "hbhpoao",
            "score": -1,
            "text": "No idiots rich people have kids. They dont want poor people to have kids.  Think about it morons.",
            "title_similarity": "0.47259146",
            "sentiment_compound": -0.6239
        },
        {
            "id": "hbiqwda",
            "score": -1,
            "text": "Rich people dont get abortions like poor people do. The can afford children",
            "title_similarity": "0.61762965",
            "sentiment_compound": -0.1556
        },
        {
            "id": "hbiw4wp",
            "score": -1,
            "text": "Imagine caring what Elizabeth warren thinks",
            "title_similarity": "0.38654867",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbiwyut",
            "score": 1,
            "text": "Remember when that lying nut claimed she was Native American?",
            "title_similarity": "0.43854654",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hbj8t2c",
            "score": -1,
            "text": "Literally nobody cares what she thinks about talk about the biggest perpetrating a fraud in existence we really. For the love of God. If anybody cares what this woman’s opinion is they literally have no opinion to anything. Elizabeth Warren is the definition of perpetration of fraud",
            "title_similarity": "0.5648388",
            "sentiment_compound": 0.4144
        },
        {
            "id": "hbfz8ad",
            "score": 10,
            "text": "I remember getting into an argument on /r/pics of a picture of a bunch of protestors dressed as handmaids after Amy Coney Barrett got on the Supreme Court and people were laughing and saying they were overreacting. *sigh*",
            "title_similarity": "0.5907866",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbg3k3g",
            "score": -9,
            "text": "“When murder is illegal, rich women still murder.” So fucking what?",
            "title_similarity": "0.69630516",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hbfpzzi",
            "score": 2,
            "text": "I had a good comment….. but then I thought. Oh wait… this how the beginning of Idiocracy started. This bill just opens the door for that.",
            "title_similarity": "0.43342072",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hbg9zw8",
            "score": -2,
            "text": "The one thing I hate about this narrative is that it frames wealthy socially conservative women as financially independent which, in states like Texas, is often completely untrue. How naive do you have to be to think that rich, white, evangelical patriarchs are just gonna be totally okay with their girlfriends, wives and daughters getting illegal abortions when it’s been proven time and time again that they won’t? If those women don’t have access to money outside of the men in their lives they’ll be screwed too. And even if they can get illegal abortions it won’t be a walk in the park; it will be a scary and traumatic visit to an illegal doctor or across state lines where you’ll be terrified of anyone finding out the whole time. Money isn’t always a misogyny get out of jail free card and plenty of middle and upper class women will be impacted by this too. I just don’t think we need this kind of rhetoric right now.",
            "title_similarity": "0.7608709",
            "sentiment_compound": -0.9576
        },
        {
            "id": "hbga1lw",
            "score": -2,
            "text": "Refresh my memory. Was it largely Texans who empowered this group ? Or did someone else sneak in while y’all were asleep and vote for them?",
            "title_similarity": "0.5351679",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgewy3",
            "score": 2,
            "text": "Texas is becoming a dystopian nightmare",
            "title_similarity": "0.30610353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgg8ce",
            "score": 2,
            "text": "Women should stop having sex with men and see how fast their problems get solved.",
            "title_similarity": "0.57111263",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hbgjqsg",
            "score": -2,
            "text": "The Asian girl in the picture expresses my feelings much better than I could possibly do",
            "title_similarity": "0.44294548",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbgn38a",
            "score": -2,
            "text": "She don’t have to worry. She is rich.",
            "title_similarity": "0.37017998",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hbgnnnb",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbgq8bt",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbh15if",
            "score": -2,
            "text": "How is this news? Of course she agrees. She would never, ever approve of a conservative policy in the same way a Republican would never ever agree with a liberal policy. \n\nPolitics has become 100% partisan with NO discussion or compromise. It's now all excessively theatrical, polarized nitpicking and pearl-clutching while the majority of Americans (who fall in the middle with slight left/right leanings) are left frustrated and with an ever more expensive bill.",
            "title_similarity": "0.5617486",
            "sentiment_compound": -0.7679
        },
        {
            "id": "hbh1tgc",
            "score": 2,
            "text": "Having a baby is a greater money sink and greater profit compared to abortions.",
            "title_similarity": "0.548395",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hbh4x2t",
            "score": -2,
            "text": "Just accept it do what the government says! its not your body not your choice get vaccinated too, stop abortions",
            "title_similarity": "0.67482257",
            "sentiment_compound": 0.1759
        },
        {
            "id": "hbh503r",
            "score": -2,
            "text": "Most white feminists can't make it through the first episode. And if they did, they would hear the first line of the series ends with \"I just want to reach for the nearest GUN.\" They'd also get to see [how well picket signs and civility work against mustache machine gun man](https://youtu.be/-v0FBDjaeB0). White women every other time they \"want to avoid being controversial\" and get what they deserve for \"positive vibes only\" every other time.",
            "title_similarity": "0.64386845",
            "sentiment_compound": -0.2808
        },
        {
            "id": "hbh7ygc",
            "score": -2,
            "text": "Why is that? Rich people are the only people that can drive across the Texas border?  I mean I agree that this law is shit.  But this is just more Warren bullshit.",
            "title_similarity": "0.62640834",
            "sentiment_compound": -0.7373
        },
        {
            "id": "hbh8t7r",
            "score": -2,
            "text": "Is this the best the Left can muster? She's arguing a very esoteric analogy...using a movie with a fictional dystopian plot...that fewer than 1% of the US population have seen...while claiming the law itself is \"hyperbolic\"...? Does she not know that this is self-contradictory?\n\nSeriously, is Elizabeth Warren the best that the Left has to offer? Does she represent the prevailing \"Progressive/Liberal/Left\" point of view?\n\nIf so, they are ripe fruit for another Vladimir Lenin...",
            "title_similarity": "0.6326653",
            "sentiment_compound": 0.7691
        },
        {
            "id": "hbh9ugh",
            "score": 2,
            "text": "Not only is this sentiment moronic but it's embarrassing someone like elizabeth warren is repeating this for public record and only further inciting people who know fuck all about abortion and more broadly the state of women's advancement in modern society to keep pretending that any woman w means to do so can simply opt of of this.\n\nmost of these \"rich\" women are not independently wealthy; they married into wealth. they are financially dependent on their male partners. Wealth does not instantly equal access specifically for women who may have the barrier that is a domineering husband who dictates her financial security. princess diana flung herself down a goddamn flight of stairs in  attempt to induce a miscarriage for chrissake. was she not a rich woman?\n\nnevermind that this puts any woman who has or ever will suffer a miscarriage at risk. remember in ireland several years ago when they let that woman die from a septic miscarriage b/c they refused her care? that's b/c spontaneous abortion, aka a miscarriage, and abortion are medically identical and the procedure for both is the same. any woman who experiences an organic miscarriage is vulnerable to accusations that she made attempts to induce it purposefully and there will be no way in which to tell and could then die of sepsis b/c no one is willing to potentially abet an abortion. \n\nthe horror of it is bad enough as a matter of government sanctioned forced pregnancy and denial of bodily autonomy. it does not have to be compounded by saying it is bad *more so* b/c it will primarily affect poor women/non-white women/disabled women etc. this could impact any woman, full-stop.",
            "title_similarity": "0.67172086",
            "sentiment_compound": -0.9947
        },
        {
            "id": "hbhbi38",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbhf0kc",
            "score": 2,
            "text": "Republicans appear to believe that women are simply service animals.",
            "title_similarity": "0.6405097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhg0bl",
            "score": 2,
            "text": "This is simply something else the Republicans can plague poor women with. When the wives of these bastards want abortions trust me they will get them without any problem whatsoever.",
            "title_similarity": "0.807233",
            "sentiment_compound": -0.3054
        },
        {
            "id": "hbhh0mu",
            "score": 2,
            "text": "This travesty masquerading as law is yet another salvo in the Republican Party’s 40 plus year- War On Women—which ultimately seeks to give conservatives dominion over a woman’s body and reproductive decisions. \n\nThe very basis for the law is a biologically and scientifically fraudulent claim that a “heartbeat” exists in an embryo at 6 weeks. *It does not.*\n\nA physician placing a stethoscope on the stomach of a woman who is pregnant at 6 weeks cannot detect a heartbeat. The heart is still being formed during the third trimester (starting at 27 weeks). Sophisticated ultrasound machines at or before six weeks of pregnancy detect a “flutter” of electrical impulses from embryonic cells.\n\nForced-birth fanatics have also falsely claimed that abortion is linked to breast cancer and promoted the quack notion that it possible to “reverse” abortion, so this stupefyingly disingenuous law is par for the course. \n\n Anyone who seriously believes that women with life-threatening pregnancies will truly be exempted or protected under this bill is blissfully naive or ignorant of Republicans’ willingness since aligning with Donald Trump to lie, distort and misrepresent the facts on any issue. \n\n Moreover, preventing  a woman from exercising reproductive freedom— *even if it kills her* —is a long-standing GOP policy goal. \n\nThe Republican National Convention’s platform every four years starting in 1980 has called  for amending the U.S. Constitution to completely, unequivocally and totally eradicate women’s reproductive freedom. No exceptions for saving the life of the mother, much less for rape or incest. \n\nThis Texas law is monstrously flawed in so many ways. It appallingly empowers forced-birth fanatics to morph into forced-birth vigilantes motivated by $10,000 bounties to spy on, stalk and literally snitch to the state on women and anyone attempting to assist them in seeking to exercise their still-constitutionally protected right to reproductive freedom. \n\nThis law also deliberately upends and circumvents decades of legal procedure and jurisprudence to effectively bar direct legal challenges to the law. The conservative 5th U.S. Circuit Court of Appeals and a 5-4 ultraconservative bloc of the U.S. Supreme Court bought into this racket by refusing to hold a single hearing or otherwise accept any challenges to the measure before it became law—even though the bill was passed and signed into law in mid-May 2021, nearly 4 months before it took effect.\n\nIf this irretrievably flawed law is allowed to stand, forced-birth fanatics will almost certainly next turn to contraception/birth control, which wasn’t legal even for married couples until the 1965 Supreme Court decision in *Griswold v. Connecticut.* \n\nReactionaries like forced-birth fanatics *never stop* with rolling back just one major individual or civil right.",
            "title_similarity": "0.6618506",
            "sentiment_compound": 0.8616
        },
        {
            "id": "hbhh7lf",
            "score": 2,
            "text": "Religon has been declining for years repeatedly but some state passed a law making it so that you cant abort a baby past six weeks. Yea thats definitley Handsmaid Tale.",
            "title_similarity": "0.56119156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhqy0f",
            "score": -2,
            "text": "She’s on the warpath for women’s rights. Something is going to drop on her like never before. Those that love her will see a weight press her like a winepress. \nGOD is not mocked.",
            "title_similarity": "0.6626316",
            "sentiment_compound": 0.8978
        },
        {
            "id": "hbhsjky",
            "score": -2,
            "text": "she's soooo dumb haha",
            "title_similarity": "0.1338142",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hbhwady",
            "score": -2,
            "text": "I love r/politics.  It like reading clown world in plan text. 🤣",
            "title_similarity": "0.4214394",
            "sentiment_compound": 0.872
        },
        {
            "id": "hbfs5xi",
            "score": -27,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbg1ff4",
            "score": -10,
            "text": "Democrats: Oh no! Disproportionately more children of color will be born!! What an outrage. This is dystopia. This is the American Taliban.",
            "title_similarity": "0.46364316",
            "sentiment_compound": -0.6341
        },
        {
            "id": "hbg1w8p",
            "score": -11,
            "text": "abortion should be legal so people like elizabeth warren don’t exist",
            "title_similarity": "0.64414084",
            "sentiment_compound": 0.507
        },
        {
            "id": "hbg35uv",
            "score": 8,
            "text": "Church and state should be seperated at all times. Texas living in the stone ages.",
            "title_similarity": "0.4035911",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg51lk",
            "score": 11,
            "text": "Anti-abortion laws have *always* been about keeping poor women - specifically women of color - under control. Rich white women can leave the state/country and have a \"vacation\". Poor women cannot.  Many can't even get to the next town. \n\nKeep the poor, poor. Keep black and Latina women even poorer.",
            "title_similarity": "0.76181924",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hbfojek",
            "score": 21,
            "text": "Serious question. What's the next step to get this overturned? Is it really over because the supreme court has been compromised?",
            "title_similarity": "0.39429852",
            "sentiment_compound": 0.5661
        },
        {
            "id": "hbfuteq",
            "score": -21,
            "text": "So get an abortion before 6 weeks. Derp.",
            "title_similarity": "0.5557487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgbxis",
            "score": -12,
            "text": "Nah just stop killing children. Look at the stats and the overwhelming majority of abortions are by low income POC.",
            "title_similarity": "0.7135072",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hbfn9k7",
            "score": -33,
            "text": "I can't listen to Warren because I'm always afraid she's going to say, \"The mommas and daddies,\" and it's going to make me cringe more than the last time she said it.",
            "title_similarity": "0.4115718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfw62s",
            "score": 4,
            "text": "There is a workaround. Texas law is too clever for its own good :Texas has taken a novel approach in their wording of the legislation: Rather than have the government enforce the law, private citizens will be allowed to sue the provider or anyone that helps the woman to get an abortion. The Texas Tribune writes that \"supporters of the bill hope this novel provision will trip up legal challenges to the legislation, as without state officials enforcing the ban, there will be nobody for pro-women's rights groups to sue.\"[8]\n\n1. Citizens enforce the law\n2. No heartbeat is the cutoff. \n3. Citizens apprehending people having an abortion must prove there is no heartbeat to enforce the laws \n4. To prove there is no heartbeat, a trans-vaginal ultrasound is required \n5. performing any medical procedure on a patient without consent is assault. \n6. Therefore no citizens will enforce the law without being charged with assault \n7. Women can get an abortion so long as they do not obtain an ultrasound or reveal such results.",
            "title_similarity": "0.8043952",
            "sentiment_compound": 0.7797
        },
        {
            "id": "hbfyn1e",
            "score": -3,
            "text": "Now do it with guns !",
            "title_similarity": "0.21384585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfzqk0",
            "score": -2,
            "text": "Funny how this logic applies but when it’s a 2A argument stating “criminals will still have guns” it’s based.",
            "title_similarity": "0.5337608",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbg4aic",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbg7jtg",
            "score": -2,
            "text": "She is saying rich women will break the law.  I guess she knows that rich people can break the law.",
            "title_similarity": "0.72535086",
            "sentiment_compound": 0.802
        },
        {
            "id": "hbg8v8b",
            "score": -4,
            "text": "Get rich duh",
            "title_similarity": "0.21770662",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgad4c",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbgdp2c",
            "score": -3,
            "text": "Blah blah blah all words when it comes to Warren",
            "title_similarity": "0.16178018",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbgjk9x",
            "score": -2,
            "text": "Big mad?😂",
            "title_similarity": "0.09305287",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hbgjpv8",
            "score": -2,
            "text": "Please. If you want to see the Handmaids Tale in real life, look to Afghanistan.",
            "title_similarity": "0.4530954",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbgrgg4",
            "score": -2,
            "text": "It is just a tax on the wealthy, but this is nothing like the hand maids tale. Seriously fuck off",
            "title_similarity": "0.5178289",
            "sentiment_compound": -0.9033
        },
        {
            "id": "hbh1jdt",
            "score": -2,
            "text": "How about this All life is precious and all life has the right to exist even microbes that would kill us the Earth is a special place you don't see animals in nature purposely terminating their pregnancies,  Don't want to have children use contraception condoms have existed for decades birth controls existed for decades, Or if you really don't want to have them get yourself fixed tubes tied or if your a man get snipped they even have reversible procedures now and you can store your eggs and semen you can even store viable embryos,  There is no excuse in the modern world to have one anymore there are so many other options.",
            "title_similarity": "0.616629",
            "sentiment_compound": -0.063
        },
        {
            "id": "hbi0fi5",
            "score": -3,
            "text": "How can anyone take anything this woman says seriously? She doesn't even know what race she is. She thinks she's Native American. So sad 😞",
            "title_similarity": "0.44561338",
            "sentiment_compound": -0.843
        },
        {
            "id": "hbi16qu",
            "score": -4,
            "text": "I am as deeply distressed, as many of you are, that Senator Warren's ancestors on the reservation, were so poor that they did not have access to birth control.",
            "title_similarity": "0.38724524",
            "sentiment_compound": -0.7955
        },
        {
            "id": "hbg178s",
            "score": -12,
            "text": "Elizabeth Warren is all about stirring up class warfare in America — I really dislike her for that.",
            "title_similarity": "0.477902",
            "sentiment_compound": -0.624
        },
        {
            "id": "hbfqsh7",
            "score": 3,
            "text": "Hmmm. Under the Texas law as it is what are the chances that poor women who can't get abortions will report rich women who do?",
            "title_similarity": "0.80285215",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbft4lx",
            "score": 4,
            "text": "Everybody needs to understand this. For the lower and middle class, this is about religion, following marching orders from their pastors, punishing women, power over women, the standard right wing stuff.\n\n*However,* the ultra-wealthy dark money groups and the highly educated upper upper class controlling this movement is pushing to ban abortion is actually about making more dumb, uneducated, easily manipulated, Republican voters.\n\nA party of angry, single men is a political dead end. Republican dark money think tanks know this, but without abortion, women get less access to education. Women have less power to make their own choices. Removing abortion literally creates more Republican voting women, and where the women go... then men shall follow... but it's even more sinister than that. Because that child you forced that woman who will no longer be able to get an education to have will also be very unlikely to be able to get a good education, and then will become yes another Republican voter, and the cycle continues.",
            "title_similarity": "0.65083563",
            "sentiment_compound": -0.9178
        },
        {
            "id": "hbfu2p3",
            "score": -3,
            "text": "When will people realize that “your vote matters” actually doesn’t matter...everything happens behind closed doors, and whoever is “donating” the most money gets to make the rules...the common people actually have no say at all",
            "title_similarity": "0.41406262",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbfu7ct",
            "score": -5,
            "text": "Oh now she acknowledges that the rich don't care about fines and that it is an issue only the lower class experiences. \n\nWell, if this law is the catalyst to government understanding this then he'll I actually am glad the law was passed. Not for women but for precident.",
            "title_similarity": "0.6718891",
            "sentiment_compound": 0.3476
        },
        {
            "id": "hbg10sl",
            "score": -3,
            "text": "Does Liz forget that in Handmaids Tale wealth doesn’t protect women either? I’m not sure why women are told that watching their rights be taken shouldn’t bother them depending on their assets. Unless the point is to divide women so this slide continues.",
            "title_similarity": "0.5987986",
            "sentiment_compound": 0.3045
        },
        {
            "id": "hbg3y2x",
            "score": -3,
            "text": "The same is true of drug use or vehicular manslaughter or any crime. Is this an argument to repeal all laws because the rich will get away with crimes by virtue of being rich?",
            "title_similarity": "0.6265436",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hbg7dwd",
            "score": -4,
            "text": "It doesn’t mean anyone should be having them the Dutch should face a murder charge like anyone else",
            "title_similarity": "0.42282504",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hbg8ga7",
            "score": -4,
            "text": "I'm all for easing the burdens of single mothers, but this is a silly argument. Literally any crime can be used as a counterpoint, with varying success.\n\n\"When hiring assassins is illegal, rich women still hire assassins\"\n\"When flying an unlicensed jet is illegal, rich women still fly unlicensed jets.\"\n\"When embezzling is illegal, rich women still embezzle.\"\n\nSo? Murder-for-hire should still be illegal, not subsidized so that poor women can more easily get someone whacked wtf",
            "title_similarity": "0.74367297",
            "sentiment_compound": -0.9449
        },
        {
            "id": "hbg8u88",
            "score": -4,
            "text": "Ah yes, because rich people can so can everyone else.",
            "title_similarity": "0.35022625",
            "sentiment_compound": 0.743
        },
        {
            "id": "hbg91kz",
            "score": -4,
            "text": "How is that the story line of handmaids tale? I thought it was about people not able to have babies so rich powerful people steal the babies of the poor and powerless.",
            "title_similarity": "0.58226836",
            "sentiment_compound": -0.2036
        },
        {
            "id": "hbgahq3",
            "score": -4,
            "text": "Glad we are using tv shows to dictate policy lmao",
            "title_similarity": "0.39587545",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hbgashd",
            "score": -4,
            "text": "Texas law didn’t make abortions illegal. It allowed people to sue those who got an abortion or abortion providers in civil court",
            "title_similarity": "0.8003988",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbgdufq",
            "score": -4,
            "text": "Why Will this stop non rich women from just going to another state if this wild shit ever happened",
            "title_similarity": "0.52013874",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hbgfmzq",
            "score": -3,
            "text": "As a rich woman...she would know.",
            "title_similarity": "0.43542686",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbggaa4",
            "score": -4,
            "text": "She would know.",
            "title_similarity": "0.15778418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgism3",
            "score": -4,
            "text": "Same exact thing with guns. When guns are illegal, only criminals and the rich get them. So just stop restricting either, both an abortion ban and gun control is an encroachment on our rights.",
            "title_similarity": "0.66366947",
            "sentiment_compound": -0.933
        },
        {
            "id": "hbgu78d",
            "score": -4,
            "text": "Rich woman don't usually get abortions. The  woman that get abortions are middle class and poor. The poor have more of an excuse to get abortions then middle class. But many middle class women use abortion like birth control..!! Which is why many abortions are done...!! This is why the new laws...!  But a I agree and disagree with them... But the are necessary..",
            "title_similarity": "0.775747",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hbhsx5m",
            "score": -3,
            "text": "Abortion is not illegal in Texas. It IS legal up to 6 weeks. If you are sexually active and don’t want to have kids it is on you to make sure you do not get pregnant or find out if pregnant or not ASAP. Personal responsibility.",
            "title_similarity": "0.67904043",
            "sentiment_compound": 0.8282
        },
        {
            "id": "hbfupzi",
            "score": 16,
            "text": "Making abortions illegal doesn’t stop abortions. It just makes abortion much more dangerous for women. All this fascist bill is about is controlling women. This bill is abhorrent.",
            "title_similarity": "0.6736514",
            "sentiment_compound": -0.9555
        },
        {
            "id": "hbfs60y",
            "score": 4,
            "text": "Don’t forget mistresses of rich and well connected men.",
            "title_similarity": "0.39939708",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hbfwuzu",
            "score": -3,
            "text": "I have the same opinion on firearms",
            "title_similarity": "0.29197538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfx4oz",
            "score": -3,
            "text": "\"when BLANK is illegal, only outlaws will have BLANK\"\n\nHmmm....",
            "title_similarity": "0.4440999",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbfzrq6",
            "score": -7,
            "text": "Relevance of anything Elizabeth Warren says is near-zero.",
            "title_similarity": "0.22783872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg2s5u",
            "score": -5,
            "text": "Talk about politics without referencing fictional media challenge?",
            "title_similarity": "0.3236264",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbg3x6c",
            "score": -6,
            "text": "Why does everything always have to be “but rich people….”\n\nMeanwhile, she’s wealthy herself.\n\nEdit: to the buffoon telling me I’m ignoring context — sure, whatever you say.  Im ignoring context, you’re ignoring hypocrisy.  That’s fine.",
            "title_similarity": "0.6243538",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbg4ew9",
            "score": -6,
            "text": "Why didn't you drop out of the primary before super Tues?",
            "title_similarity": "0.43325025",
            "sentiment_compound": 0.6921
        },
        {
            "id": "hbg4jc1",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbg5frc",
            "score": -7,
            "text": "Warren pretends (like all leftys) to be for the poor people\nas they live in mansions and fly private jets",
            "title_similarity": "0.45159176",
            "sentiment_compound": -0.25
        },
        {
            "id": "hbg6k15",
            "score": -3,
            "text": "Lol “Elizabeth Warren says” is the easiest way to know to ignore whatever follows",
            "title_similarity": "0.4562447",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hbg6ss8",
            "score": -5,
            "text": "Well if we can force people to inject themselves with an unwanted experimental drug, we don’t have bodily autonomy anymore, do we?  So pardon me if I can’t summon the outrage.",
            "title_similarity": "0.51787794",
            "sentiment_compound": -0.0281
        },
        {
            "id": "hbg91q2",
            "score": 5,
            "text": "Does anyone honestly think this is about abortions? It’s about keeping people in poverty.",
            "title_similarity": "0.6164563",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hbg9gx5",
            "score": -7,
            "text": "Warren is a crazy rich woman that cares for no one but herself. She lied about being a native american so she could get a $300k job at a Ivy League university and instruct a class one day week for two hours.",
            "title_similarity": "0.54569393",
            "sentiment_compound": -0.34
        },
        {
            "id": "hbga0u8",
            "score": 6,
            "text": "**WOMEN IN TEXAS:** \n\nIf you don't like what's happening in Texas, delete your profiles on dating apps and then uninstall the app immediately. [Liberia organized a sex strike which played a part in ending a civil war and also electing their first female president.](https://www.cnn.com/2012/08/29/opinion/ghitis-sex-strikes/index.html) A lot of these dating apps are publicly traded companies and access to a lot of women is the \"product\" that they sell. If you delete in mass, those powerful companies will pressure Texas, along with all of the angry regular people that notice that all of the local women are gone.\n\n**EVERYONE ELSE IN THE WORLD THAT WANTS TO HELP:**\n\nPlease go to any of the online reporting tools and break them with false reports. \n\nRemember to submit legitimate sounding names, clinics and actual cities and not just \"Mickey mouse\"\n* they can quickly deploy logic to sort through that goofy stuff, but realistic entries can make their hate mission near impossible. \n* Bonus points if you can find actual immoral doctors licensed in Texas that supported this legislation. \n* Oh, and use the real names of those fake clinics posing as \"pregnancy crisis centers\"and \"family planning clinics\" and tricking/shaming women into carrying babies they can't support and don't want, to term.\n* Find the names of actual Texas representatives and government employees that were caught with mistresses or outright paying for, or demanding, that they get abortions and submit a report with the real details of that story.\n* Find employees and leadership of the hate group behind this website, and their funders, from places like LinkedIn and use their names in reporting.\n\n**Examples of made up reports that sound credible enough to waste their time:**\n\n\"Dr. Ralph Genez at the New Hope Family Care Center in Houston told my cousin to stop going to church and to get an abortion.\"\n\n\"Dr. Charlotte Grivenstein at the Notrees Center for Medicine in Notrees, TX lied and said 'an abortion is not murder' and so my girlfriend got an abortion without telling me.\"\n\nIf you do get a follow-up contact, do what you can to play phone tag, give them the runaround (in a believable way) and generally waste their time and resources.\n\n**Some helpful links from user LightningRod:**\n* [Texas Young Republican Officers](https://texasyr.gop/officers/)\n\n* [Find a Pro-Life OBGYN](https://aaplog.org/find-a-pro-life-obgyn-search/?frm_search=Texas&show_view=yes)\n\n* [TEXAS STATEWIDE HEALTH COORDINATING COUNCIL](https://www.dshs.texas.gov/chs/shcc/members/members.shtm)",
            "title_similarity": "0.7512865",
            "sentiment_compound": -0.8501
        },
        {
            "id": "hbgdh9z",
            "score": -6,
            "text": "Right, because not killing your baby is the same making you a rape slave. Y'all have lost your minds",
            "title_similarity": "0.5296217",
            "sentiment_compound": -0.5399
        },
        {
            "id": "hbgf0ub",
            "score": -6,
            "text": "She’s a fraud",
            "title_similarity": "0.288197",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hbgfiq1",
            "score": -4,
            "text": "When guns are illegal, criminals still get guns",
            "title_similarity": "0.5056011",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hbggaim",
            "score": -6,
            "text": "Elizabeth Warren says \"kill the poor\" essentially",
            "title_similarity": "0.50980824",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hbgixse",
            "score": -6,
            "text": "So is the left back to \"our body, our choice\" because we have been hearing about forcing vaccinations and other insane things. Can we get daily updates on what the left believes for the day since this seems to change in complete 180s every other day? Democrat religion is very difficult to follow, unless blindly, and without questioning the constant contradictions.",
            "title_similarity": "0.5936629",
            "sentiment_compound": -0.7577
        },
        {
            "id": "hbgklzx",
            "score": -4,
            "text": "Oh ya because she's a trust worthy source",
            "title_similarity": "0.29029325",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hbgm4pt",
            "score": -4,
            "text": "Why is she still around? She isn’t Native American yet got all college benefits from claiming she was.  DNA test she took says she’s white.   “I’m going to get myself a beer” “ opens fridge” only thing in it is a beer bottle. \n\n“ my mother said I’m Native American”.    Maury- DNA test says you are not Native American",
            "title_similarity": "0.6519855",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbgsxi6",
            "score": -5,
            "text": "Yeah abortion should be legal , but what about just not getting pregnant? Amongst my friends I see way to many people that are struggling to make ends meet simply b/c they decided to have children even thou their income is way to low to raise kids properly.",
            "title_similarity": "0.6604432",
            "sentiment_compound": -0.09
        },
        {
            "id": "hbgvw3m",
            "score": -6,
            "text": "It’s irritating when democrats just use Handmaid’s Tale to describe anything they don’t like \n\nNobody was getting abortions in Handmaid’s Tale, rich or not. However women WERE getting fingers removed for reading in public. \n\nI think this Texas abortion law is absurd and it does absolutely nothing to end abortion, and it opens the pathway for a litany of frivolous lawsuits that go way past abortion issues and causes far more problems than it is even supposed to solve. \n\nBut this Handmaid’s Tale talk is Just obnoxious overdramatization. Look at the Middle East if you’re that desperate to find Handmaid’s Tale incarnate",
            "title_similarity": "0.7418026",
            "sentiment_compound": -0.778
        },
        {
            "id": "hbfvsz6",
            "score": -4,
            "text": "This flawed and horrible person said something I agree with so I’m going to pretend she’s not a flawed and horrible person for awhile.",
            "title_similarity": "0.5548376",
            "sentiment_compound": -0.754
        },
        {
            "id": "hbg25br",
            "score": 6,
            "text": "as a person who’s lived in Texas for nearly thirty years let me tell you… Fuck Texas.",
            "title_similarity": "0.36221254",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbg5m7h",
            "score": -6,
            "text": "They don't have abortions on hand maids tale. The rich ladies can't get pregnant hence the hands maids.  Geez.",
            "title_similarity": "0.6096591",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hbg5ned",
            "score": -7,
            "text": "White people pushing for abortions among minorities… I don’t think I’ve ever seen an advertisement or them advertising to their own race! Just saying",
            "title_similarity": "0.5597577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg5o8w",
            "score": -5,
            "text": "If you’re too stupid to use protection I think you should have an abortion. The only reason I agree with it",
            "title_similarity": "0.69961023",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbg69gx",
            "score": -7,
            "text": "is it illegal tho? they have 6 weeks to decide no? is 6 weeks not long enough? i could understand for medical purposes",
            "title_similarity": "0.52016854",
            "sentiment_compound": -0.6298
        },
        {
            "id": "hbgd7wm",
            "score": -6,
            "text": "No one is forcing women to not take control of their bodies before pregnancy.",
            "title_similarity": "0.45005095",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbgiv7x",
            "score": -6,
            "text": "Therefore logically, allow ALL women to kill their children. That way every woman has the equal right to kill their child",
            "title_similarity": "0.5530118",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hbfizqg",
            "score": 320,
            "text": "[removed]",
            "title_similarity": "0.046575073"
        },
        {
            "id": "hbfvnh5",
            "score": -9,
            "text": "Its funny, everyone says its your body, you should be able to do anything you want to it, but if you don't want the Covid vaccine in your body your now an asshole and you put others at risk , possibly death.  Either way, someone has a chance of dying, by abortion or not being vaccinated, ones not better then the other. I see so many Pro Abortion people complaining about their rights, but they jump down the throats of the unvaccinated ..its ok for them to kill an innocent life, but criticize the unvaccinated, seems hypocritical to me.",
            "title_similarity": "0.6614727",
            "sentiment_compound": -0.9642
        },
        {
            "id": "hbfvysl",
            "score": 6,
            "text": "Hear, hear.\n\nSen. Liz Warren is, as usual, spot on.",
            "title_similarity": "0.3839701",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfyjot",
            "score": 6,
            "text": "I feel like now is the perfect time to introduce very strict legislation against men who commit rape and incest, with a one strike you're out policy in which they are castrated. That's right, castrated. Cause you see laws can go both ways when it comes to being strict.",
            "title_similarity": "0.54291284",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbg0ukk",
            "score": 6,
            "text": "Under his eye",
            "title_similarity": "0.011364506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg3u4x",
            "score": -8,
            "text": "Despite all the noise, it’s generally a great thing that Texas stood up for the lives of unborn children.",
            "title_similarity": "0.59990716",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hbgk8w3",
            "score": -5,
            "text": "Elizabeth Warren thinks she's part Indian. What a joke. She shouldn't be giving her opinion on anything.",
            "title_similarity": "0.40037078",
            "sentiment_compound": 0.0423
        },
        {
            "id": "hbgnldn",
            "score": -7,
            "text": "Murdering your baby should be illegal",
            "title_similarity": "0.42474547",
            "sentiment_compound": -0.836
        },
        {
            "id": "hbft6u0",
            "score": 200,
            "text": "Everybody needs to understand this. For the lower and middle class, this is about religion, following marching orders from their pastors, punishing women, power over women, the standard right wing stuff.\n\nHowever, the ultra-wealthy dark money groups and the highly educated upper upper class controlling this movement is pushing to ban abortion because it's actually about making more uneducated, easily manipulated, Republican voters.\n\nA party of angry, single men is a political dead end. Republican dark money think tanks know this, but without abortion, women get less access to education. Women have less power to make their own choices. Removing abortion literally creates more Republican voting women, and where the women go... then men shall follow... but it's even more sinister than that. Because that child you forced that woman who will no longer be able to get an education to have will also be very unlikely to be able to get a good education, and then will become yes another Republican voter, and the cycle continues.",
            "title_similarity": "0.64635164",
            "sentiment_compound": -0.8953
        },
        {
            "id": "hbfz648",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbg3l6e",
            "score": -8,
            "text": "Elizabeth warren doesn’t even come to her own fucking district tho\n\nI’ve met her. Fake woman",
            "title_similarity": "0.45221332",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbg3yuk",
            "score": -9,
            "text": "I hate this wo-man.",
            "title_similarity": "0.078556396",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hbg46fv",
            "score": -10,
            "text": "The solution is move to a state where abortions are legal. Instead you get all this bitching.",
            "title_similarity": "0.7079834",
            "sentiment_compound": 0.1091
        },
        {
            "id": "hbgig5x",
            "score": -8,
            "text": "Woman are gonna have to be responsible for their sexual choices! What kind of world is this!?!?!",
            "title_similarity": "0.458043",
            "sentiment_compound": 0.5897
        },
        {
            "id": "hbgkjgg",
            "score": -7,
            "text": "It’s not illegal…. This is a bad as saying Voter ID is racist…. There are many ways to not get pregnant and if you do you can still have an abortion if you pay attention to the you know….. missing period…… the KKK loves the murder of black and brown babies",
            "title_similarity": "0.778225",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hbgq1c2",
            "score": -8,
            "text": "Whatever the case, murdering children is wrong. Y’all are sick.",
            "title_similarity": "0.36699516",
            "sentiment_compound": -0.8934
        },
        {
            "id": "hbhdvtf",
            "score": -8,
            "text": "What’s so hard about getting plan B?  I am sick of women thinking they have the right to end a human life. It is disgusting.",
            "title_similarity": "0.44629997",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hbfv0br",
            "score": 29,
            "text": "Texas is a shithole state. Worst state I've ever lived in.",
            "title_similarity": "0.3249858",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hbfw2dr",
            "score": -9,
            "text": "No, no it isn’t.",
            "title_similarity": "-0.022361614",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbg8lbt",
            "score": -9,
            "text": "Does anyone actually care what this lying hag has to say on any subject?",
            "title_similarity": "0.25362983",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hbg8o7e",
            "score": 10,
            "text": "https://www.plancpills.org/\n\nhttps://aidaccess.org/\n\nr/auntienetwork is also super helpful if you need advice or someone to talk to\n\nThese sites offer access to abortion pills, even in Texas. Please be safe and be aware of clinics (e.g. Crisis Pregnancy Centers) that give out dangerous misinformation on abortions and pregnancy.\n\nIf you've seen me comment this before, hi again! Sorry if this is annoying, but I'm putting this on as many relevant posts as I can to get the information out there. Feel free to join me!",
            "title_similarity": "0.7329968",
            "sentiment_compound": 0.8193
        },
        {
            "id": "hbg9p94",
            "score": 9,
            "text": "Poor women will continue to get abortions...they'll just die from botched procedures.",
            "title_similarity": "0.6402261",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hbftqnd",
            "score": -9,
            "text": "Speaking from personal experience?",
            "title_similarity": "0.10285574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfxflm",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbfz1hs",
            "score": 10,
            "text": "I’m curious what would happen if women went on a sex strike in the us. “Don’t have sex if you don’t want to get pregnant.” Lol ok, try us.",
            "title_similarity": "0.5746447",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hbfrmfx",
            "score": -37,
            "text": "People say bacteria is life on Mars, but a heartbeat isn’t life on earth. Weird.",
            "title_similarity": "0.37364572",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hbg6sb9",
            "score": 34,
            "text": "I know a woman in Georgia from college. Got pregnant sophomore year. Had an abortion when she went back home for a ‘long weekend’. She never regretted it, the guy she’d been seeing was relieved  and life moved forward.  We follow each other on social media like so many others do with old friends. I know she got married, house in the ‘burbs, has three kids, the whole supposed suburban dream.  Two of her kids are teenage girls. Yesterday I saw her post saying ‘god bless Texas’ superimposed over a baby and praying hands and I soooo badly want to call out her but I’m a better person than that fake Christian hypocrite- so I won’t.  I guarantee if one of her girls gets pregnant unintentionally, that college student will also go home for a ‘long weekend’ Women betraying other women hurts me the most.",
            "title_similarity": "0.7084037",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hbft6kd",
            "score": 10,
            "text": "Duh, the law puts these cases into civil court. As far as I’m aware there is no right to an attorney in civil cases. So I’m sure the texan jihadist groups will have attorneys lined up and funded already, where as the women being ‘sued’ under this law will have to pay for their own lawyers. So yea, this will basically be a rich group of jihadist going after poor women in court. \n\nAlso the punishment is just a fine anyway so rich people other than being able to hire a good lawyer even if they loose can just pay the fine and move on. While poor women get thrown into debt.\n\nOh and ya’ll best believe this new tactic of ‘deputizing’ everyone to sue other people over things they are not wronged by is gonna get expanded to ‘voter fraud’ next.",
            "title_similarity": "0.7203796",
            "sentiment_compound": 0.7164
        },
        {
            "id": "hbfxqs9",
            "score": 12,
            "text": "Instead of making abortion illegal we could neuter rapists and abusers. Not all pregnancies are voluntary. Also not every pregnancy’s easy. Some might die if they don’t get an abortion. This world is ruled by men and it makes me sick.",
            "title_similarity": "0.6336347",
            "sentiment_compound": -0.9687
        },
        {
            "id": "hbg4m3t",
            "score": -11,
            "text": "So I'm still scratching my head over this.... At what point is it cool to use abortion as birth control?\n\nWhen you ran out of condoms?\n\nWhen he dumps you?\n\nTwo trimesters in when you decide that maybe the life you've been growing inside your body doesn't deserve to live?",
            "title_similarity": "0.60458034",
            "sentiment_compound": 0.3094
        },
        {
            "id": "hbg12md",
            "score": -12,
            "text": "Why would rich women want an abortion? Lmao",
            "title_similarity": "0.71539426",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hbfkzpp",
            "score": 200,
            "text": "This is only going to widen the social divide and many poor women will pay with their lives. Sad to see this happening in the US. But I can understand why this is possible as the seeds were sown by the previous administration.",
            "title_similarity": "0.60383034",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hbfriwa",
            "score": 51,
            "text": "And these rich women will.  Always, when they need one.  This is no secret.  This law is aimed at the poor, to belittle and shame and scare them.  The wealthy can buy anything.",
            "title_similarity": "0.68521565",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hbfl9yc",
            "score": 90,
            "text": "I mean that's true of all laws. It seems the rich never have to face consequences, unless the crimes are so depraved that society it's self dry heaves at the thought.",
            "title_similarity": "0.58108336",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hbfz8g3",
            "score": 100,
            "text": "Amy Coney Barrett was a \"Handmaid\" in this weird Christiany culty thing: https://www.washingtonpost.com/investigations/amy-coney-barrett-people-of-praise/2020/10/06/5f497d8c-0781-11eb-859b-f9c27abe638d_story.html",
            "title_similarity": "0.5534266",
            "sentiment_compound": -0.2204
        },
        {
            "id": "hbfrwok",
            "score": 224,
            "text": "It is so ironic that republicans have touted that the troops were in the Middle East protecting America’s freedoms, and almost immediately after exiting Afghanistan Republicans steal freedoms from American citizens themselves.",
            "title_similarity": "0.5904532",
            "sentiment_compound": -0.2479
        },
        {
            "id": "hbfuhhr",
            "score": 31,
            "text": "I don’t care if you don’t like Warren but she’s right and you know it.",
            "title_similarity": "0.41266063",
            "sentiment_compound": 0.431
        },
        {
            "id": "hbfyny1",
            "score": 34,
            "text": "The loudest pro lifers will still get abortions when its them or their daughters getting pregnant.",
            "title_similarity": "0.7243066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfj6os",
            "score": 89,
            "text": "Rules for thee not for me. Fuck you I have mine. These are the GOP's mottos.",
            "title_similarity": "0.39569804",
            "sentiment_compound": 0.431
        },
        {
            "id": "hbfqsv7",
            "score": 671,
            "text": "This won’t reduce abortions as much as it will reduce SAFE abortions",
            "title_similarity": "0.5237952",
            "sentiment_compound": 0.5622
        },
        {
            "id": "hbfpltt",
            "score": 122,
            "text": "This needs to be framed as a constitutional crisis, where state law is superseding federal legal precedent. Pro-choice persuasion is tried and failed. It doesn’t convince the GOP or its herd, and likely never will. Democrats have a profound messaging deficiency.",
            "title_similarity": "0.4543799",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hbftj1t",
            "score": 54,
            "text": "It’s funny sorta because it’s like they all voted for a higher crime rate like 20 years into the future. A bunch of unwanted children don’t grow up usually to be well adjusted adults. Maybe that’s what they want though, I mean you have to keep your slave prisons full so you can keep your slave production rates at max capacity.",
            "title_similarity": "0.61746746",
            "sentiment_compound": 0.5627
        },
        {
            "id": "hbfluae",
            "score": 1421,
            "text": "Also Republicans had no issue with Trump having doctors perform secret hysterectomies on immigrants at the boarder",
            "title_similarity": "0.6110939",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbfrulp",
            "score": 145,
            "text": "There will ALWAYS be abortion.\nThe only thing Texas has succeeded in is making it more dangerous and deadly.",
            "title_similarity": "0.69835716",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hbfr3mm",
            "score": 112,
            "text": "Actually, this is going to greatly impact how Texas women get health care. If I were a doctor in Texas, I would be packing my bags. There will be a serious lack of health care in Texas. There already aren’t enough doctors for the amount of patients.",
            "title_similarity": "0.6078767",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hbfj5x0",
            "score": 2124,
            "text": "Rich women will get abortions from doctors. Poor women will get them from whoever is willing to wield a coat hanger.",
            "title_similarity": "0.8038829",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbfpeoa",
            "score": 5258,
            "text": "If the penalty for a crime is only a fine, then it's only a crime for the poor.\n\nEdit: I know I heard this line somewhere on the internet in the past. It's definitely not a creation of mine. Lots of folks are citing the *Final Fantasy* game series.",
            "title_similarity": "0.56443125",
            "sentiment_compound": -0.8863
        },
        {
            "id": "hbfk4tn",
            "score": 8994,
            "text": "Should I just accept the fact that a Texas government official is going to get caught helping his mistress get an abortion and spare myself the trouble of getting upset about it?",
            "title_similarity": "0.74095607",
            "sentiment_compound": -0.128
        },
        {
            "id": "hbfl9ri",
            "score": 11,
            "text": "And most the time it’s republicans paying the woman to do it.",
            "title_similarity": "0.5825349",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfqyac",
            "score": 6,
            "text": "sure and rich mens mistresses",
            "title_similarity": "0.35408223",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hbfra7b",
            "score": 17,
            "text": "We may see an increase of ‘at risk pregnancy’. Doctors are usually cool people, talk to them long enough, and they’ll do what they can. \n\nFriend of mine has aplastic anemia…her immune system completely collapsed out of NOWHERE! Zero health coverage having to go through bone marrow transplant, chemo, radiation…for TWO YEARS (2017-2019). \n\nNow she has, of course, all these residual problems? Like, getting infections SUPER easy. Still no insurance, but often times…the doctors get into contact with billing, tell you where/who is better and cheaper, sometimes free meds! \n\nKeep hopes everyone! If they’re going to weaponize fear, we’re going to keep hope.",
            "title_similarity": "0.71960163",
            "sentiment_compound": 0.9598
        },
        {
            "id": "hbfs45k",
            "score": 8,
            "text": "The undocumented won’t even be able to head across the border to Mexico to get an abortion. Way to get more “anchor babies” Republicans!!",
            "title_similarity": "0.63823956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfs4rz",
            "score": 7,
            "text": "Always remember that, while the capitalists may not all want to live under fascism, they view it as an in-one-country problem for which capital and person can be moved overseas until any storms pass. This is why they're willing to support religious fanatics who will push laws they have no intention of being affected by.",
            "title_similarity": "0.5295681",
            "sentiment_compound": -0.4628
        },
        {
            "id": "hbfs5qj",
            "score": 2,
            "text": "Some parts of the US seem determined to recreate the medieval period. What a mess",
            "title_similarity": "0.33020177",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hbfs6ac",
            "score": 4,
            "text": "Further and further we go, we become less of a melting pot and more akin to a boiling pot and the government isn't at the stove watching.",
            "title_similarity": "0.2934026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfs6j1",
            "score": 1,
            "text": "A $10,000 fine is nothing to a rich woman.",
            "title_similarity": "0.4900833",
            "sentiment_compound": -0.2787
        },
        {
            "id": "hbfsaj5",
            "score": 20,
            "text": "Guaranteed this horrific law will spread like wildfire around the red states in the coming weeks now the corrupted SC has shown their hand.  Cancer starts with a single cell before it kills the body.",
            "title_similarity": "0.49534404",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hbfsff5",
            "score": 5,
            "text": "Are we finally recognizing that income level supersedes culpability?",
            "title_similarity": "0.35665923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfslo3",
            "score": 1,
            "text": "Replace the word abortion with literally anything else and it’s still a true sentence",
            "title_similarity": "0.63621306",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hbfsoyk",
            "score": 1,
            "text": "\n\nThe Texas Abortion Insurance market is like the Wild West",
            "title_similarity": "0.703279",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbft2gs",
            "score": 1,
            "text": "Preach",
            "title_similarity": "0.08461873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbft4b2",
            "score": 1,
            "text": "Why do conservatives want a world overpopulated with poor, desperate people? You’d think they’d be in favor of abortions for poor people, whom they despise so much.",
            "title_similarity": "0.58068013",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hbft6l5",
            "score": 87,
            "text": "She's completely right. In order to leave the state and get an abortion, you need to not only have the money to get there, but also the money and ability to take time off to wait the standard 24 hrs before getting said abortion. A lot of women just don't have the resources.",
            "title_similarity": "0.67305875",
            "sentiment_compound": 0.431
        },
        {
            "id": "hbftmj5",
            "score": 1,
            "text": "Rich men get them for their female victims, too.",
            "title_similarity": "0.5106442",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbftngc",
            "score": 1,
            "text": " When you look at the big three laws in totality they executed a fascist minority foundation brilliantly. Abortion law establishes foundational Christian Sharia, the Voter law gives them suppression and protection against future challenges and the Gun law gives them INTIMIDATION by “true believers” against anyone trying to vote or protest differently. Effectively Taliban Texas. Rewatch the Handmaids Tale episode where she’s in the old Boston newspaper office and she takes all the old articles and shows how it was just one small thing here one small thing there.",
            "title_similarity": "0.7165428",
            "sentiment_compound": -0.516
        },
        {
            "id": "hbfto46",
            "score": 1,
            "text": "It so fucking is. And the anonymous tip and reward line? Unreal.",
            "title_similarity": "0.35746077",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbfto61",
            "score": 2,
            "text": "Conservative Politicians will also encourage abortions for their family members.",
            "title_similarity": "0.64814645",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbftq0w",
            "score": 4,
            "text": "Good book to read: When She Woke, by Hillary Jordan.  Fiction, story about a woman whose skin is genetically dyed completely red for having an abortion even after her incarceration.  Peopled are dyed different colors for different infractions, and need to learn to survive once back in society.",
            "title_similarity": "0.6866979",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbftrwa",
            "score": 1,
            "text": "No shit she agrees. What are you going to do about it?",
            "title_similarity": "0.30993974",
            "sentiment_compound": 0.5753
        },
        {
            "id": "hbftsv2",
            "score": 2,
            "text": "also, the porn stars that presidents are fucking while that president's 3rd (or 4th?) wife is pregnant.",
            "title_similarity": "0.53982127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfttaj",
            "score": 2,
            "text": "Exactly, all this will do is make people rely on social welfare programs more",
            "title_similarity": "0.39132714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbftuey",
            "score": 1,
            "text": "You could say this about anything illegal. *Equal justice under law* is a lie.",
            "title_similarity": "0.46344805",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hbftujm",
            "score": 1,
            "text": "Eric Cartmenez was right!",
            "title_similarity": "0.18569176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbftvhd",
            "score": 1,
            "text": "When *anything* is illegal, rich people still do it.",
            "title_similarity": "0.55658853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbftyts",
            "score": 1,
            "text": "BIG facts",
            "title_similarity": "0.08316572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfu2bu",
            "score": 1,
            "text": "JFC finally someone is saying it who’s in some form of power.",
            "title_similarity": "0.18561323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfuere",
            "score": 1,
            "text": "That is how the rich want it.",
            "title_similarity": "0.3350481",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hbfuwzo",
            "score": 1,
            "text": "\"Nolite te bastardes carborundorum\"",
            "title_similarity": "0.28334236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfuxt8",
            "score": 1,
            "text": "Now every Texan can sue any other Texan for aiding an abortion regardless of evidence and defendants cant recoup legal fees even if they win. Seems like a pretty clear path forward for prochoice activists.",
            "title_similarity": "0.7593036",
            "sentiment_compound": 0.8941
        },
        {
            "id": "hbfuz9n",
            "score": 1,
            "text": "What do they think Cruz was doing in Mexico?",
            "title_similarity": "0.33700728",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfuzd6",
            "score": 1,
            "text": "Texas making the big plays for future white genocide propaganda.",
            "title_similarity": "0.54870874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfv470",
            "score": 2,
            "text": "They built a wall and hunt societal undesirables.\n  \nIch bin ein Texan.",
            "title_similarity": "0.40974987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfv5y2",
            "score": 2,
            "text": "That's why I dont get the control aspect. Like, play that tape forward. This is the fastest way for rich white folk to get vastly outnumbered by us poors & people of color. That's who's babys are gonna outnumber their kids. \n\n\n\nI'm fine with it, I just wish we could get there without forcing children into the world faster than they need to come. And without saddling pregnant people with lives they're not prepared to support.",
            "title_similarity": "0.5774374",
            "sentiment_compound": 0.8433
        },
        {
            "id": "hbfvdoh",
            "score": 1,
            "text": "I dont know why people move there from California. Seems like a bad decision.",
            "title_similarity": "0.34611654",
            "sentiment_compound": -0.25
        },
        {
            "id": "hbfvkuz",
            "score": 1,
            "text": "Lol stahp",
            "title_similarity": "0.08161545",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbfvqfa",
            "score": 1,
            "text": "We should count the laws/fees/punishments that only affect poor people and send her a list.\n\n  \n\nI'll start.\n\n  \n\n1. Abortion (actually any law which is makes something illegal in your state/country but is legal over the border)\n2. Minimum amount in bank account fee\n3. Parking fines\n4. Overdue fines\n5. Court fees",
            "title_similarity": "0.7939986",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hbfvr2t",
            "score": 1,
            "text": "When just about anything is illegal, the rich can still get it. Rememver covid lock downs? Remember the rich still having huge parties with no masks in sight?",
            "title_similarity": "0.56913257",
            "sentiment_compound": 0.7757
        },
        {
            "id": "hbfvuv4",
            "score": 1,
            "text": "Let’s just stop having sex. Haven’t they made sex androids yet? Last I heard “real dolls” we getting pretty advanced.",
            "title_similarity": "0.53946036",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hbfvvcc",
            "score": 1,
            "text": "The US in decline",
            "title_similarity": "0.09282642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfvwts",
            "score": 1,
            "text": "You know they’ll just charter a vacation and presto! No pregnancy 😂\n\nBut those who can’t just up and do that will be chastised for not being responsible.  \n\nYou know the old saying of “elections have consequences”, especially when it results in a supermajority",
            "title_similarity": "0.5826702",
            "sentiment_compound": -0.7707
        },
        {
            "id": "hbfvwxh",
            "score": 1,
            "text": "European here. This is bonkers. Can a texan woman get an abortion in another state ?",
            "title_similarity": "0.695511",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfvxqn",
            "score": 1,
            "text": "And right she is.",
            "title_similarity": "0.11361827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfw54w",
            "score": 1,
            "text": "What the postage to send a wire hanger via USPS to abbots office?",
            "title_similarity": "0.357387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfw84u",
            "score": 2,
            "text": "Poor women will still get abortions, too. I just won't be done at a medical facility by a qualified doctor.",
            "title_similarity": "0.63272464",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbfw9z0",
            "score": 1,
            "text": "I'm most interested to see if there will be sex strikes organized over this.  Women just withold sex (historically, other \"domestic duties\" as well) with men until their demands are met.",
            "title_similarity": "0.5979556",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hbfwbrr",
            "score": 5,
            "text": "What Elizabeth Warren said. Republican anthem: I fought the poor, and the poor ... got the shit kicked out of them. \n\nEverything is about class.",
            "title_similarity": "0.5163213",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbfwfja",
            "score": 1,
            "text": "Damn, they're so close to figuring out how the entire capitalist system is flawed.",
            "title_similarity": "0.39731848",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hbfwj20",
            "score": 1,
            "text": "Move out of Texas we don’t want uou",
            "title_similarity": "0.33381426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbfwlcy",
            "score": 3,
            "text": "Move to Massachusetts",
            "title_similarity": "0.14028348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfwo8j",
            "score": 1,
            "text": "I dont agree with a lot that she says.. because most of it is pandering to the “in thing” on the SJW woke crowd..\n\nBut shes 100% right on this one… the rich will still get abortions… the mistresses of these GOP law makers will still get abortions…\n\nThe poor can not and to top it off slide down the hole of despair trying to feed another child without ANY help from the state…\n\nIts so beyond hypocritical and draconic.. and people actually believe these clowns..",
            "title_similarity": "0.81994724",
            "sentiment_compound": -0.8989
        },
        {
            "id": "hbfwt3y",
            "score": 1,
            "text": "I can't wait to sue one of these rich Republicans in the state legislature when they force their mistress to have an abortion.",
            "title_similarity": "0.6819169",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbfwud3",
            "score": 1,
            "text": "Nobody is going to talk about the person to the right of Warren in this picture?",
            "title_similarity": "0.17398143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfwv1j",
            "score": 1,
            "text": "Now extend that to all crimes",
            "title_similarity": "0.26901805",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hbfx03w",
            "score": 1,
            "text": "The same can be said for pretty much any law in the country. The rich live by their own set of rules. Laws are made for us lowly peasants to abide by.",
            "title_similarity": "0.55240774",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hbfx4wt",
            "score": 1,
            "text": "I had a great idea - with this bill, if someone is suspected of an abortion you can sue them. But is their any limit on the number of people who can sue?\n\nCould you imagine if 50000 people pool together resources to all individually sue the same person (ostensibly a R lawmaker or their child) all at once?",
            "title_similarity": "0.7079288",
            "sentiment_compound": 0.4423
        },
        {
            "id": "hbfx9pv",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbfxbby",
            "score": 1,
            "text": "You don’t exactly have to be rich but yeah. Maybe middle class.",
            "title_similarity": "0.32336968",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hbfxcql",
            "score": 1,
            "text": "That applies to just about any “crime” that only has a monetary fine associated with it.",
            "title_similarity": "0.38845968",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbfxdus",
            "score": 2,
            "text": "I’m going to say something a little rude: if you are correct, only rich women will get abortions, then poor women will (as we all agree) get a back alley abortion OR keep the child, which will be an unwanted child. The child will most likely face neglect of some sort and most likely become a criminal. If Republicans want to know where criminals come from, well- that’s one way to make them. \n\nWhen a child is unwanted, the child may not be as cared for from a mental stand point, not just a financial stand point. If you ever listen to someone talk about how no one wanted them or cares about them, it’s truly heartbreaking. \n\nIt’s another social aspect to consider and that’s how it will affect society. It’s similar to Peter letting the bad guy get away only for Uncle Ben to be murdered by the bad guy.",
            "title_similarity": "0.74175155",
            "sentiment_compound": -0.9735
        },
        {
            "id": "hbfxre6",
            "score": 1,
            "text": "Her hair looks amazing",
            "title_similarity": "0.17467523",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hbfxufu",
            "score": 1,
            "text": "\n\nIf a woman denies that she was pregnant how will they be able to prove that she was pregnant? That she had an abortion? Without having access to medical records? Don't most clinics that provide abortions also provide other medical services? Will they be able to subpoena her records. Based on an anonymous tip?\n\nWhat a fucking nightmare.",
            "title_similarity": "0.6717044",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hbfy4az",
            "score": 2,
            "text": "With this law making anyone eligible to sue, does it work retroactively or is it for new cases of abortion only? \n\nIt would be awfully lawful to sue any politicians that helped in an abortion.",
            "title_similarity": "0.7751744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfy5vt",
            "score": 1,
            "text": "They wouldn’t want to make the fines reflect a percentage of their total income. Fines to the rich are just fees for special privileges.",
            "title_similarity": "0.45777348",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hbfy90e",
            "score": 1,
            "text": "The Rich always need more poor people to do their work for cheap.",
            "title_similarity": "0.43791103",
            "sentiment_compound": 0.0534
        },
        {
            "id": "hbfy9ub",
            "score": 1,
            "text": "So replicate this bill everywhere to stop that? Thanks Warren, what a suggestion!",
            "title_similarity": "0.43322974",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hbfyc67",
            "score": 1,
            "text": "If the Democrats were a competent party they'd be instructing the state legislatures they control to be drafting bounty bills aimed at the unvaccinated right now",
            "title_similarity": "0.5513433",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hbfydi8",
            "score": 1,
            "text": "How is something like this possible in 21st century in USA of all countries. Yall guys just go down deeper and deeper in the eyes of the world. I dont hear american dream aa before",
            "title_similarity": "0.37868702",
            "sentiment_compound": 0.1926
        },
        {
            "id": "hbfyfei",
            "score": 1,
            "text": "Pretty much.  When a rich person gets an unwanted pregnancy, they take a “family vacation” and the problem goes away.\n\nYou never hear of a billionaire’s 15 year old daughter getting pregnant.  But they’re teens and I bet they’re fucking every bit as much as poor kids.",
            "title_similarity": "0.61513364",
            "sentiment_compound": -0.4678
        },
        {
            "id": "hbfyfty",
            "score": 2,
            "text": "Well none of the laws ever apply to the rich soooo...",
            "title_similarity": "0.29759935",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hbfyhrt",
            "score": 1,
            "text": "I'm so sick of losing. Why is the right so much better at politics than the left? There are so many more of us to the left of center in this country but we can do nothing while the right pulls this, or look at California where they have a legitimate shot at replacing the governor with a Trump ally. \n\nWe spend all our energy on the internet clamoring to preach, from our soapbox placed on top of our high horse, about how we understand socialism better than everyone else. Is the only thing we can really come up with is to boycott Texas which will achieve nothing but making us feel better while driving the left out of Texas and ensuring Texas stays red forever?",
            "title_similarity": "0.5837555",
            "sentiment_compound": 0.8878
        },
        {
            "id": "hbfyk90",
            "score": 2,
            "text": "Yeah but rich people in general get away with illegal stuff all of the time so this is absolutely no different…",
            "title_similarity": "0.5056917",
            "sentiment_compound": -0.3898
        },
        {
            "id": "hbfyr41",
            "score": 3,
            "text": "It's ironic that in the handmaid's tale Texas stands up to these policies and forms the Republic of Texas",
            "title_similarity": "0.60531086",
            "sentiment_compound": -0.128
        },
        {
            "id": "hbfyv21",
            "score": 5,
            "text": "When penalties are fines, they only apply to the poor, the rich still do whatever they want",
            "title_similarity": "0.53277624",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbfyy3x",
            "score": 2,
            "text": "Maybe (just hear me out) all the rich women in Texas of reproductive age need to be fitted with internal tracking devices so we know they are not getting illegal abortions. Submitting their cycle data online would also be a great idea so Governor Abbot knows what they are up to at all times. /s",
            "title_similarity": "0.7208856",
            "sentiment_compound": 0.8916
        },
        {
            "id": "hbfyyzm",
            "score": 6,
            "text": "Can’t Texans just go to another state to get the abortion? (dumb swede here)",
            "title_similarity": "0.676836",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hbfz24q",
            "score": 1,
            "text": "\"I'm from Texas, after all.....",
            "title_similarity": "0.41247618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfz7a7",
            "score": 1,
            "text": "You know what would make abbot really really mad?  Set up a North American Union between Mexico, United States, Canada, and their territories in the spirit of the European Union. \n\nThen make marijuana legal\n\nDrugs and Mexicans will cross the border freely and there’ll be nothing he can do about it.",
            "title_similarity": "0.5773835",
            "sentiment_compound": 0.4817
        },
        {
            "id": "hbfzaqy",
            "score": 2,
            "text": "That’s the nicest Elizabeth Warren headline I’ve ever seen",
            "title_similarity": "0.4179346",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbfzfty",
            "score": 1,
            "text": "My question is this: is it right to turn in the rich, conservative folks who will still be doing it? If they're gonna do it to others, isn't it fair game to punish them back?",
            "title_similarity": "0.566129",
            "sentiment_compound": -0.2783
        },
        {
            "id": "hbfzj5o",
            "score": 2,
            "text": "Not so Breaking news… the rich have no laws.",
            "title_similarity": "0.39230132",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbfzov7",
            "score": 1,
            "text": "That's their fault for being poor. \n\n-Texas",
            "title_similarity": "0.3919081",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hbfzplc",
            "score": 1,
            "text": "The first time you hear something like this, it seems profound.  Unfortunately, I don’t think you could name any law on the books in this entire country (perhaps any country) which a wealthy person doesn’t have a better chance of circumventing than a poor person. \n\nOne thing you’ll never get from our esteemed Native American senator Elizabeth Warren is wisdom.",
            "title_similarity": "0.5627754",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hbfzr2e",
            "score": 1,
            "text": "We need the poor to stay poor! You've seen what's happening, who else is going to work the shitty jobs no one else wants?\n\nTaking away abortion rights for the poor ensures future poor generations!",
            "title_similarity": "0.5950033",
            "sentiment_compound": -0.957
        },
        {
            "id": "hbfzuvl",
            "score": 1,
            "text": "Sounds alot like gun laws too.",
            "title_similarity": "0.5151594",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hbfzza0",
            "score": 1,
            "text": "Federal government is like a wimp in this case, they cannot do anything even a state government starts a gas chamber",
            "title_similarity": "0.3933195",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hbfzznd",
            "score": 3,
            "text": "That's the whole point of the law. They have no doubt when they sign these laws that if one of their daughters needs one they'll get her on the next flight to another state for it.",
            "title_similarity": "0.63255066",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hbg06z5",
            "score": 2,
            "text": "It’s basically just a $10,000 abortion tax, which the browns can’t afford.",
            "title_similarity": "0.5560041",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg0ex5",
            "score": 1,
            "text": "Another capitalist dub. Want an abortion? Get rich by working hard /s",
            "title_similarity": "0.60509336",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hbg0zqi",
            "score": 2,
            "text": "Can someone explain to me whether or not a lawyer can just argue that abortion is healthcare, should be protected under HIPAA laws, and that HIPAA laws are Federally enforced and supercede state laws?",
            "title_similarity": "0.6610118",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbg1cpl",
            "score": 1,
            "text": "So she’s saying that the rich are above the law. That’s not news.",
            "title_similarity": "0.5266184",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbg22ty",
            "score": 4,
            "text": "Don’t get it twisted. This is class warfare.",
            "title_similarity": "0.2733367",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbg2d7g",
            "score": 1,
            "text": "Backwards texan savages.  Holy!!!\n\n&#x200B;\n\nSo...mass exodus to nearby states then is it?\n\nWho the fuck would willfully remain in such a primitive society where choice and freedom do not exist?  \n\nFor that matter...wtf is it with Texas and Florida??  Two of the most savage  and dumb as fuck states in all of USA...and that is REALLY quite the statement.\n\n&#x200B;\n\nTwo sets of laws...one for the commoners, the peons, and one for those in charge...the elite who rule the piss ants who pay taxes.\n\nPsst....Canada has a great sale on 3/4\" thick rope.  Stress tested to take a 500lb sudden jolt of force and not break.  We can ship thousands of feet to you within days.\n\nOrder now while quantities last...",
            "title_similarity": "0.5486353",
            "sentiment_compound": -0.9493
        },
        {
            "id": "hbg2ev5",
            "score": 2,
            "text": "I’m surprised no GOP supporters are talking about how The Taliban has managed to conquer Texas so soon after the fall of Kabul.",
            "title_similarity": "0.53584933",
            "sentiment_compound": -0.4031
        },
        {
            "id": "hbg2lls",
            "score": 4,
            "text": "Rich women will be fine, but poor women will be forced to go through unplanned pregnancies and then those kids will grow up to accept any low, poverty wage jobs they can find. Meanwhile the rich get richer... the cycle continues.",
            "title_similarity": "0.697531",
            "sentiment_compound": 0.09
        },
        {
            "id": "hbg2nlk",
            "score": 3,
            "text": "Elizabeth is correct.",
            "title_similarity": "0.20324066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg2tid",
            "score": 1,
            "text": "Rich people don’t care about laws.",
            "title_similarity": "0.31626117",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hbg2trm",
            "score": 2,
            "text": "It’s infuriating to live in Texas and watch this happen and be able to do absolutely nothing about it.",
            "title_similarity": "0.36361152",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hbg35js",
            "score": 1,
            "text": "so it is simply a crime of the poor.",
            "title_similarity": "0.24928918",
            "sentiment_compound": -0.765
        },
        {
            "id": "hbg35u6",
            "score": 2,
            "text": "Exactly! Different rules for everyone else, but the rule makers and their families will operate under different rules and regulations. This whole situation is rotten. It should have never gotten this far. A minority of the population wants to rule everyone else with their whacked ideologies, while attempting to take this nation back 100 years! Make sure you vote!",
            "title_similarity": "0.49249572",
            "sentiment_compound": -0.5229
        },
        {
            "id": "hbg37zc",
            "score": 3,
            "text": "I wonder how many abortions The Orange has paid for.",
            "title_similarity": "0.6388508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg3be9",
            "score": 2,
            "text": "I thought republicans were low key in favour of poor black people having abortions? (Because demographic war etc)",
            "title_similarity": "0.650009",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hbg3gx2",
            "score": 1,
            "text": "r/readanotherbook",
            "title_similarity": "0.20288947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg3mgz",
            "score": 1,
            "text": "I’m not sure the exact net worth we define as wealthy, but regardless, they live under a different set of rules than the rest of us.",
            "title_similarity": "0.35319787",
            "sentiment_compound": 0.1825
        },
        {
            "id": "hbg3wmy",
            "score": 1,
            "text": "The law states that anyone can accuse anyone else  of helping with an abortion and they will suffer the consequences of paying for legal fees. Why not not sue all the Texan legislators and everyone involved in the bill for just that. It doesn’t matter if they did it, they’ll still need to defend themselves and pay for legal fees. It’s their fault for writing such language in the bill.\n\nKeep suing all the craziest until you clog up the courts system.",
            "title_similarity": "0.6653672",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hbg42cy",
            "score": 3,
            "text": "She is entirely correct.  When abortion is illegal, if you've got the money then you just get your gyno to say you require a D&C.  They will do this for you in the hospital.  Unfortunately it's the women with no money nor insurance that suffer.",
            "title_similarity": "0.7900866",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hbg4ac6",
            "score": 4,
            "text": "Texas fighting their final breath as a red state who still masturbates to the idea of their mere 5 year of “history” \n\nThat state is in the process of Turning blue and these people in power are kicking and screaming with all their might before their last breath",
            "title_similarity": "0.4731658",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hbg4e0z",
            "score": 1,
            "text": "literally 1984",
            "title_similarity": "0.13539496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg4gcl",
            "score": 1,
            "text": "New theory just dropped",
            "title_similarity": "0.23825832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg4iz3",
            "score": 2,
            "text": "To be fair the entire US healthcare system is already pay-to-win",
            "title_similarity": "0.49120986",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbg4qig",
            "score": 2,
            "text": "Making abortion illegal only hurts the lower class. Kids are expensive and having a kid when you're poor will likely keep you in lower class.",
            "title_similarity": "0.59337056",
            "sentiment_compound": -0.9217
        },
        {
            "id": "hbg4uts",
            "score": 2,
            "text": "Ahh the ol' rich-enough-to-break-laws scheme.",
            "title_similarity": "0.4797939",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg4wof",
            "score": 1,
            "text": "Abraham Lincoln said \"The best way to get a bad law repealed is to enforce it strictly.\"  So maybe Texans need to be on the lookout and start suing Southwest Airlines.",
            "title_similarity": "0.60113597",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hbg59dj",
            "score": 2,
            "text": "Abortion > Unwanted children",
            "title_similarity": "0.42998576",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbg5bmf",
            "score": 1,
            "text": "Poor women get abortions too, they just tend to fucking die from them",
            "title_similarity": "0.6280333",
            "sentiment_compound": -0.807
        },
        {
            "id": "hbg5esv",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbg5nru",
            "score": 1,
            "text": "rich women get more than just their own abortions, they can afford to buy the fetus nutrients of the poor women who are forced to have unsafe abortions.",
            "title_similarity": "0.7807888",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hbg5qqg",
            "score": 1,
            "text": "When abortion is illegal everyone* still get abortions. The difference is how safe and traumatizing the procedure is",
            "title_similarity": "0.77003515",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hbg5rg8",
            "score": 2,
            "text": "Can somebody explain to a Brit how this law is legal? I thought Roe v Wade ensured abortions remain legal federally?",
            "title_similarity": "0.7085742",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hbg5rvr",
            "score": 35,
            "text": "[The former GOP Speaker of the Florida House repeatedly refers to women as a \"host body\".](https://twitter.com/BillyCorben/status/1433489268354293771)\n\nEdit: And pay attention to his wording here. Besides the fact that he's likening all women to simply a vessel for babies, he also says \"At the end of the day, that body has to have a certain amount of rights because at the end of the day that host body carries this entire other body to term\"\n\nHe's basically saying women have no rights outside of just being vessels for babies. They get just enough rights so that they can have the baby, but independent of that, they have none. This thinking is prevalent in GOP circles.",
            "title_similarity": "0.66599566",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hbg5yhv",
            "score": 2,
            "text": "Question: under this new law, if I help someone financially to go to another state to have an abortion, can I still be sued by the guy next in line at the supermarket? Or aiding and abetting is limited to abortions done in texas?",
            "title_similarity": "0.7348897",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hbg636t",
            "score": 1,
            "text": "I get that sometimes Conservatives can be tired of being accused of passing and legislating towards an authoritarian theocratic state,  but if they don't want that aviation they should stop passing laws that would be at home in Gilead.\n\nThis  path that Republicans are giddy to travel down ends with a woman's body being treated like a crime scene like it is in some Central American countries.  Shackled to a bed, spread open for others to inspect.",
            "title_similarity": "0.692466",
            "sentiment_compound": -0.6408
        },
        {
            "id": "hbg6fao",
            "score": 1,
            "text": "I have some scruples about abortion myself, but all these attempts to bad it are just going to force actually desperate women to go through illegal routes for it. And I don’t see why all these restrictions are necessary when it’s already at record lows and dropping.",
            "title_similarity": "0.66369164",
            "sentiment_compound": -0.9413
        },
        {
            "id": "hbg6m4d",
            "score": 3,
            "text": "Republican politicians daughters can get abortions & no one bats an eye because it’s swept under the table",
            "title_similarity": "0.7305124",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbg6qn7",
            "score": 2,
            "text": "And all the mistresses of old ass republican fucks",
            "title_similarity": "0.4604709",
            "sentiment_compound": -0.765
        },
        {
            "id": "hbg6vb0",
            "score": 3,
            "text": "Somewhere right now a Texas Republican's mistress needs an abortion.",
            "title_similarity": "0.7120979",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg6wy7",
            "score": 1,
            "text": "Maybe it's time for anyone who isn't a moron to find a different state to live in?",
            "title_similarity": "0.33270425",
            "sentiment_compound": 0.3875
        },
        {
            "id": "hbg7any",
            "score": 5,
            "text": "Texas abortion law is absolutely disgusting. Shame on you. Come on America, you’re better than this.",
            "title_similarity": "0.6210568",
            "sentiment_compound": -0.6335
        },
        {
            "id": "hbg7dk5",
            "score": 1,
            "text": "Blue states should do the same thing with guns. Offer the citizens a bounty to sue gun stores if they sell handguns to someone.",
            "title_similarity": "0.58507127",
            "sentiment_compound": -0.34
        },
        {
            "id": "hbg7j6c",
            "score": 1,
            "text": "I propose a straight up trade with Mexico: Texas for Tijuana.",
            "title_similarity": "0.5381931",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbg7m5n",
            "score": 3,
            "text": "She hit the nail right on the head. It would be a very opportune moment to put Republican politicians that have gotten their mistresses abortions on blast rn to highlight the absolute hypocrisy of it all",
            "title_similarity": "0.6968608",
            "sentiment_compound": 0.659
        },
        {
            "id": "hbg7wuh",
            "score": 2,
            "text": "Rich white men passing laws that penalize only the poor.",
            "title_similarity": "0.4822487",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbg7y6g",
            "score": 1,
            "text": "Cue cheerleaders' parents sueing each other. That'll be fun.",
            "title_similarity": "0.6393885",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hbg847b",
            "score": 2,
            "text": "Poor people go to war. Hence why they want you to have babies.",
            "title_similarity": "0.5477079",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hbg85zi",
            "score": 1,
            "text": "Those are some animated faces in this picture",
            "title_similarity": "-0.0071055368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg87kz",
            "score": 1,
            "text": "texas what the fuck. banning abortions completely? weirdos",
            "title_similarity": "0.5450534",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hbg8qf8",
            "score": 1,
            "text": "Has anyone stopped to think that this is the very nature of the system design? Force poor people to have their unwanted children, furthering dependence on state structures. Additional children mean, through lack of abortions also adds to our dying population in the US. With an education system that sucks...the newly born children will ultimately grow up easily manipulated for political gains. \n\nIt's largely what's happening now, but with extra steps. Instead of allowing immigrants from selected nations to become debt slaves, we'll just make it easier to for Americans to become debt slaves.",
            "title_similarity": "0.65720755",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hbg90zp",
            "score": 6,
            "text": "In a world of 2A and guns.....the laws always skew to the serve the conservative men who own guns. It's not freedom from tyranny, it's just the tyranny they want.\n\nBecause they don't fear women, immigrants, poor people and other vulnerable groups standing up for their rights using the threat of violence that they have.",
            "title_similarity": "0.584265",
            "sentiment_compound": -0.9176
        },
        {
            "id": "hbga7v1",
            "score": 2,
            "text": "The second law they need to pass is men start paying full child support at 6 weeks of age - medical bills, living expenses, food expenses, etc. Men should carry around financial support as much as condoms. I’m a dude but I also think that law is absolute bullshit.",
            "title_similarity": "0.5145048",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbgaahr",
            "score": 2,
            "text": "Just replace the word “abortion” with “guns” and you’ll see what hypocrites and criminals these people really are.",
            "title_similarity": "0.59621894",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hbgabuz",
            "score": 1,
            "text": "Poor women can get them too still, just join one of those semi pro women’s football leagues",
            "title_similarity": "0.6422382",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbgaer0",
            "score": 2,
            "text": "SCOTUS has been consistent...the law is the law... legislature must change it.... SCOTUS does not opine on human desires....just the law.",
            "title_similarity": "0.42531595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgakwn",
            "score": 2,
            "text": "Handmaids tale is fiction. Let’s not disregard that this has been the actual REALITY for women of color.",
            "title_similarity": "0.5640215",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hbgam2d",
            "score": 1,
            "text": "Rich people get away with a lot of immoral actions. What is her point?",
            "title_similarity": "0.49500495",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hbgaozo",
            "score": 1,
            "text": "When your rich laws are more of a suggestion",
            "title_similarity": "0.416192",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgb4qd",
            "score": 1,
            "text": "After listening to today's The Daily episode, I'm convinced that this is going to be repeated in every red state across the country. Also though, this same law can be turned on the 2nd Amendment in the blue states.",
            "title_similarity": "0.5113565",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbgbcqw",
            "score": 1,
            "text": "My Queen Elizabeth😌",
            "title_similarity": "0.31270808",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbgbdx6",
            "score": 1,
            "text": "When machine guns are illegal, rich people still buy machine guns.",
            "title_similarity": "0.6361203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgbfsp",
            "score": 1,
            "text": "They only want marginalized babies to keep the capitalist machine turning. That’s it",
            "title_similarity": "0.543754",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbgblnn",
            "score": 2,
            "text": "So kill the rich. This is basic shit",
            "title_similarity": "0.36346343",
            "sentiment_compound": -0.6936
        },
        {
            "id": "hbgby44",
            "score": 6,
            "text": "When anything is illegal, rich people still get to do it without consequences",
            "title_similarity": "0.4957425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgc3a1",
            "score": 1,
            "text": "Should have run with her Americans",
            "title_similarity": "0.47995406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgc64c",
            "score": 2,
            "text": "How does that saying go? If a penalty for a crime is a fine then that law only applies to the lower class..",
            "title_similarity": "0.43989825",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hbgc8eb",
            "score": 5,
            "text": "When one needs to turn religious ideologies into laws, it is a sign that the religion is dying and the religious institutions are losing money. If one thinks these laws will suddenly make everyone more religious, one is completely delusional. It will have the opposite effect and it will show in a few generations. Good luck and good riddance.",
            "title_similarity": "0.5512718",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hbgca9z",
            "score": 1,
            "text": "*Rich women still get safe abortions while poorer women have to get unsafe abortions and possibly die from them.*",
            "title_similarity": "0.8189766",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hbgcawx",
            "score": 2,
            "text": "Not just rich women, but women with rich baby daddies outside of wedlock",
            "title_similarity": "0.603747",
            "sentiment_compound": 0.6044
        },
        {
            "id": "hbgckle",
            "score": 3,
            "text": "Starting to think the world would be better if Democrats were more corrupt. Follow the Republicans step for step and see how quickly Republicans cage themselves.\n\nThis morning's The Daily posed this though with this scenario: supposed Massachusettes did the same thing Texas did but for gun ownership. $10,000 for everyone who brings a case against someone who has a gun in that state if they win the case.\n\nWanna make the fillibuster illegal? Fillibuster everything republicans do.\n\nSure, in 50 years will still have to hear about how Democrats gerrymandered the NC 12th district, but fuckit. We will live in a better place for it",
            "title_similarity": "0.663221",
            "sentiment_compound": 0.431
        },
        {
            "id": "hbgcusi",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbgd0k4",
            "score": 1,
            "text": "And which demographic overwhelmingly voted for Abbott?",
            "title_similarity": "0.3664022",
            "sentiment_compound": -0.128
        },
        {
            "id": "hbgd0nr",
            "score": 5,
            "text": "And poor women get dependent on men, while breeding a crop of low-wage workers to be exploited by the rich and the military. Conservative heaven.",
            "title_similarity": "0.53559655",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbgd4ej",
            "score": 7,
            "text": "I cant believe there are no consequences for gqp putting in these two trashbqg judges after cunting Obama out of a judge.",
            "title_similarity": "0.5057144",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbgd93b",
            "score": 1,
            "text": "And not just rich women, but the wives, girlfriends, escorts, or any random woman that becomes pregnant by a wealthy man. You think they are going to just accept babies in their lives?  Funny.",
            "title_similarity": "0.6870167",
            "sentiment_compound": 0.8604
        },
        {
            "id": "hbgdbxy",
            "score": 1,
            "text": "Bodily autonomy used to always trump our perception of “right to life”. Every single time. How taking away some people’s bodily autonomy and not all is not consistent and also unreasonable.",
            "title_similarity": "0.44027933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgdht8",
            "score": 1,
            "text": "I like to understand my politics through pop culture references",
            "title_similarity": "0.44366598",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbgdl1i",
            "score": 2,
            "text": "It's remarkable that Trump, a man who has probably personally paid for more abortions than any other person in history, didn't feel even slightly uneasy about all of this.",
            "title_similarity": "0.5947502",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hbgdowv",
            "score": 1,
            "text": "And poor women, just a smidgen more dangerously",
            "title_similarity": "0.37817225",
            "sentiment_compound": -0.7501
        },
        {
            "id": "hbgemtw",
            "score": 1,
            "text": "Same thing if you sell opiates.",
            "title_similarity": "0.45612907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgetg6",
            "score": 1,
            "text": "I’m sad that woman isn’t president.",
            "title_similarity": "0.43896917",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbgf0hv",
            "score": 1,
            "text": "That's true of every law.",
            "title_similarity": "0.23214869",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbgf2vw",
            "score": 1,
            "text": "Its time to start calling Republicans what they are a threat to society and national health, if you've been paying any attention. Between the Covid response and misinformation, regressively revoking women's rights, as well the capital and denying climate change. ITs never been more clear who these racist christian conservative dinosaurs are. Furthermore there is absolutely no reason to vote republican unless your obscenely rich, or really really really fucking stupid. As you're actively voting against your own interest, the only reason this party still exists is because they are so good at manipulating the uneducated of the country and are backed by old money. The younger generations need to vote instead of being outraged when these people do what the party is known for. Vote these people out and stop allowing Scrooge Mc Duck's party to do so much goddamn harm.",
            "title_similarity": "0.64635265",
            "sentiment_compound": -0.9256
        },
        {
            "id": "hbgf5t6",
            "score": 1,
            "text": "Elizabeth Warren would have been one of the greatest Presidents this nation has ever seen. Oh well. Looking for the next person to have a plan for everything I stead of just talkin out of their ass.",
            "title_similarity": "0.5669991",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbgf81b",
            "score": 2,
            "text": "I couldn’t agree more. The women with no means will be the ones to suffer. What scares me the most is that women who can’t afford to get their abortion will take the way of trying anything to have the abortion and decimating their bodies in the process. The poor always pays for draconian laws. Voting suppression included. The women take the brunt and the men who impregnated them walk away, free to enjoy life.  Will it only empower men to rape more if they know they can now get away with zero consequences?",
            "title_similarity": "0.6944791",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hbgfa8f",
            "score": 2,
            "text": "But it’s the poor ones who actually need it",
            "title_similarity": "0.2432099",
            "sentiment_compound": -0.631
        },
        {
            "id": "hbgfcr7",
            "score": 2,
            "text": "For my whole life being a Texan has been a thing of pride or joy but damn it’s getting hard to be proud to be a Texan. Regardless of where you stand on abortion this new law is embarrassing. Fuck Abbott.",
            "title_similarity": "0.6669438",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hbgfcxv",
            "score": 7,
            "text": "She is absolutely right. The law only affects poor and middle class women. How about we force all unmarried men to get vasectomies.",
            "title_similarity": "0.72890925",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbgfe9l",
            "score": 1,
            "text": "I think this will blow up in their faces. It wouldn’t surprise me if 5 years from now they discover that the birth rate is even lower",
            "title_similarity": "0.49714696",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hbgfgti",
            "score": 1,
            "text": "Wow; that's shocking. She's just going to have a beer now.",
            "title_similarity": "0.46240282",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbgfiqe",
            "score": 3,
            "text": "Florida and Texas are really becoming the worst parts of America.",
            "title_similarity": "0.3853555",
            "sentiment_compound": -0.6557
        },
        {
            "id": "hbgfvbd",
            "score": 3,
            "text": "Poor women will still get abortions if they’re made illegal too. They’ll just be doing them with coat hangers instead of going to a clinic",
            "title_similarity": "0.76494026",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hbgfzrm",
            "score": 6,
            "text": "It honestly seems like the Republicans watched the Handmaid's Tale and took notes. It's uncanny.",
            "title_similarity": "0.5503976",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hbgga9s",
            "score": 2,
            "text": "I have a question that I’m interested in comments:\n\nWith this draconian law, will it give men more reasons to rape knowing they are safe from any prosecution? What is their responsibility in being the other half of making life?",
            "title_similarity": "0.486549",
            "sentiment_compound": -0.6025
        },
        {
            "id": "hbggeh5",
            "score": 2,
            "text": "Definitely is true. The far right want woman and minorities to be jobless and powerless over their future. Making voting harder for minorities and people with less money, making abortions much harder. It’s all their master plan of the real “Elites” to continue their control over the masses.\n\nThe irony dripping since so many far righters think their party is fighting the people controlling their lives. The very rich control America. One party supports that super rich system the other fights it. \n\nThe super rich sit back and love these heated political times when far right and left think each other are the reason they can’t afford insurance and a house. Meanwhile they make record profits.",
            "title_similarity": "0.6690881",
            "sentiment_compound": 0.985
        },
        {
            "id": "hbggpea",
            "score": 2,
            "text": "Of course this is against poorer women and minorities. Rich white women will be able to go wherever they want to get abortions. It's a fucking joke.",
            "title_similarity": "0.77549314",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hbggqmi",
            "score": 2,
            "text": "Can someone ELI5 how this is possible? Like \"yeah we don't want you to be in charge of your own body\". Like... What. Are these people mental? How is this a thing in 2021.",
            "title_similarity": "0.3382817",
            "sentiment_compound": 0.746
        },
        {
            "id": "hbgguhe",
            "score": 2,
            "text": "Republicans didn't make it illegal, they just put a price tag on it. A price tag of $10k.",
            "title_similarity": "0.5005133",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hbgh1z0",
            "score": 2,
            "text": "Exactly !!! Except rich women refer to those abortions as D&C procedures.",
            "title_similarity": "0.82621175",
            "sentiment_compound": 0.6679
        },
        {
            "id": "hbgh2p3",
            "score": 2,
            "text": "Actually they need to release the names of every senator and representative that has had a sexual harassment payout made on their behalf.  As taxpayers we should know if our tax dollars are paying this and for who.  I think a lot of people would be surprised at who would be on that list.",
            "title_similarity": "0.58873093",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hbghlin",
            "score": 2,
            "text": "Texas' #abortion\\_prohibition law significantly impedes access to much-needed health care - especially for people of color and low-income people.",
            "title_similarity": "0.5774343",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbghw3w",
            "score": 2,
            "text": "Are vasectomies legal when abortion isn’t? Wouldn’t the same rule apply?",
            "title_similarity": "0.67494",
            "sentiment_compound": 0.2168
        },
        {
            "id": "hbgifw2",
            "score": 2,
            "text": "Even if this had nothing to do with “secret access” to abortion doctors *within* TX, rich women still absolutely have guaranteed access to abortion in *nearby* states, that will happily provide them. \n\nWorking class or women in poverty don’t always have the same luxury to take time off, travel, and possibly pay for a medical procedure on the other side of the same country.",
            "title_similarity": "0.7984234",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hbgj1m6",
            "score": 3,
            "text": "Rich conservatives will still get them. They just pander pander pander to a religious extreme, and where does that end?",
            "title_similarity": "0.6097976",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgjir0",
            "score": 2,
            "text": "The laws have never applied to the rich.",
            "title_similarity": "0.293083",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgjiza",
            "score": 2,
            "text": "Rich women will still get abortions, so will poor desperate women but it will be far more dangerous for them.  They won’t have the resources they might need in case of a medical problem that could arise from the procedure.",
            "title_similarity": "0.66036224",
            "sentiment_compound": -0.8693
        },
        {
            "id": "hbgju53",
            "score": 1,
            "text": "Soo why do we care what foreign powers say about states rights? Should we ask Russia and North Korea next?",
            "title_similarity": "0.34285885",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hbgk3eb",
            "score": 1,
            "text": "Sounds like..... The gun argument",
            "title_similarity": "0.3425347",
            "sentiment_compound": -0.34
        },
        {
            "id": "hbgk5xi",
            "score": 1,
            "text": "Someone said earlier that Texas did this because they need more mindless drones to vote for Republicans.  I just realized,  it's because they're killing their voters with corona virus misinformation. And they need babies to be indoctrinated,  so in 18 years these kids will vote for them. \n\n\nIt's too smart of a plan for a Republican to think of.",
            "title_similarity": "0.645624",
            "sentiment_compound": -0.8221
        },
        {
            "id": "hbgk6ah",
            "score": 1,
            "text": "For the rich, “legal fees” and “bail” mean “the cost of committing my crime of choice.”",
            "title_similarity": "0.53828156",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hbgkj5c",
            "score": 4,
            "text": "When abortion is illegal rich women will get safe abortions, poor women will risk their lives and health to get theirs.",
            "title_similarity": "0.77355194",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbgkwmm",
            "score": 2,
            "text": "I wonder how many politicians mistresses will be able to get \"medical care\" for \"an issue\", which isn't being discussed because it's \"private\"",
            "title_similarity": "0.5124152",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbgl38x",
            "score": 3,
            "text": "Rich children don’t work the fast food register. They need poor people to keep churning out cashiers.",
            "title_similarity": "0.3897766",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbgljwz",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbglk0w",
            "score": 6,
            "text": "Abortion is illegal in my country. That didn’t stop our former President’s daughter to go to the United States to get one. Illegal abortion hurts poor women the most.",
            "title_similarity": "0.77297735",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hbgll17",
            "score": 5,
            "text": "Republicans’ mistresses will still be able to get abortions.",
            "title_similarity": "0.7351074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbglnwg",
            "score": 2,
            "text": "Especially if the father is a Republican politician.",
            "title_similarity": "0.35674524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbglph4",
            "score": 1,
            "text": "*love that journey for her*",
            "title_similarity": "0.30796653",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbglr0c",
            "score": 4,
            "text": "It's just a scheme to keep poor people poor. Conservatives have never stuck to their morals and never will",
            "title_similarity": "0.40385252",
            "sentiment_compound": -0.6662
        },
        {
            "id": "hbglsl4",
            "score": 3,
            "text": "If Margaret Atwood would have been able to negotiate a royalty every damn time “A Handmaid’s Tale” was brought up by an American politician, she’d be rich as Sheldon Adelson by now.",
            "title_similarity": "0.6784649",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbglvkl",
            "score": 3,
            "text": "I sincerely hope there's a movement where all the Republican politicians who make their mistress get an abortion get put on blast. Like they should.",
            "title_similarity": "0.7013887",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hbgm426",
            "score": 1,
            "text": "it's time for dem states to sanction texas.",
            "title_similarity": "0.42370713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgmh3g",
            "score": 2,
            "text": "Rich = immune from criminal prosecution, generally.",
            "title_similarity": "0.46488544",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hbgmhrl",
            "score": 3,
            "text": "When gunns are taxed with heavy fines, rich people still have guns.",
            "title_similarity": "0.56696355",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgmlr3",
            "score": 1,
            "text": "so will this finally turn Texas blue?",
            "title_similarity": "0.2931093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgmr9m",
            "score": 3,
            "text": "What is so ironic is, that it's laws like this that contribute to poverty and increase pressure on systems in place to help the needy and on the legal and law enforcement systems. \n\nIf people just thought it out for a minute, they'd realize they have everything to gain by lifting people up and giving them a new direction and brighter future then repressing them and actively enacting laws to make things more difficult for the people who have fewer resources.",
            "title_similarity": "0.5135541",
            "sentiment_compound": 0.4966
        },
        {
            "id": "hbgmtv8",
            "score": 1,
            "text": "My husband and I just discussed this very scenario this morning. It’s absolutely going to happen.",
            "title_similarity": "0.27442998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgn2sk",
            "score": 1,
            "text": "Unpopular opinion: I care less about Warren's opinions ever since she dropped out of the Democratic primaries and refused to endorse Bernie, whom her political beliefs align the most closely with.",
            "title_similarity": "0.49044773",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbgn6t1",
            "score": 1,
            "text": "Ha",
            "title_similarity": "-0.03719413",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbgng0m",
            "score": 5,
            "text": "So there will be more brown and black babies .... groups who have higher poverty rates than white women. I guess what Texas republicans want, no?",
            "title_similarity": "0.5885898",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hbgnhyn",
            "score": 1,
            "text": "I love EW ever since her frontline interviews",
            "title_similarity": "0.4200516",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbgnizi",
            "score": 3,
            "text": "I’m just confused how does this law hold up\nConstitutionally and what changed from Roe V wade. I get that the justices are tilted heavily as Republicans. That said they still have to provide a reason they upheld this does anyone knelt what that is? Like in layman’s terms.",
            "title_similarity": "0.5312609",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hbgnm46",
            "score": 1,
            "text": "She may have pretended to be Native American, but she is right.\n\nThis won’t affect rich people.",
            "title_similarity": "0.48028356",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hbgnxd1",
            "score": 1,
            "text": "I enjoy how women are supposed to represent.",
            "title_similarity": "0.40210342",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbgo5n6",
            "score": 3,
            "text": "#DO YOU NEED AN ABORTION?\n\nhttps://www.womenonwaves.org\n\nhttps://www.plancpills.org/\n\nhttps://aidaccess.org/\n\nr/auntienetwork is also super helpful if you need advice or someone to talk to\n\nPlanC and AidAccess offer access to abortion pills, even in Texas. WoW is a global resource for those in countries outside the USA as well as within, who need these pills too. Please be safe and be aware of clinics (e.g. Crisis Pregnancy Centers) that give out dangerous misinformation on abortions and pregnancy.\n\nIf you've seen one of us comment this before, hi again! Sorry if this is annoying, but we are putting this on as many relevant posts as we can to get the information out there. Feel free to join us!",
            "title_similarity": "0.77561855",
            "sentiment_compound": 0.8881
        },
        {
            "id": "hbgoiu5",
            "score": 1,
            "text": "This is very true. Well said Elizabeth.",
            "title_similarity": "0.24905427",
            "sentiment_compound": 0.6674
        },
        {
            "id": "hbgona7",
            "score": 1,
            "text": "How ironic the public outcry Biden withdraw Afghan affect local women’s rights. Also Democrats just make loud sound no action. Politics is not just about go on CNN making passionate speech.",
            "title_similarity": "0.6103578",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hbgotc7",
            "score": 2,
            "text": "She ain't lying",
            "title_similarity": "0.16911358",
            "sentiment_compound": 0.4168
        },
        {
            "id": "hbgow99",
            "score": 2,
            "text": "I support a woman's right to choose to abort their pregnancy. But am beyond fed up with Abortion always being in the top 5 political issues. Politicians just seem to always drag it out and make it dance when they want to distract the voters from important issues like getting this infrastructure deal done.  And this handmaid's shit takes the dramatics way over the top for such an important matter.  \n\nThere is absolutely no end in sight and I find myself caring less and less regardless of which side is currently getting what they want.",
            "title_similarity": "0.6902611",
            "sentiment_compound": 0.6073
        },
        {
            "id": "hbgpeg9",
            "score": 3,
            "text": "Ppl who voted for it will still get abortions when it suits them. This is a stunt to get the debate in front of the Supreme Court where they think they have a conservative majority",
            "title_similarity": "0.7755891",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgpew6",
            "score": 5,
            "text": "The thing that I don’t understand about these laws and this way of thinking is that, historically we know women will abort a pregnancy by any means necessary.\n\nSo these laws don’t prevent anything, they just limit women’s access to safe medical treatment and put their lives at risk to more dangerous methods.\n\nIt’s disgusting. Anybody that supports this is disgusting.",
            "title_similarity": "0.6493987",
            "sentiment_compound": -0.7778
        },
        {
            "id": "hbgptnn",
            "score": 6,
            "text": "Saw the pic of the Texas law makers posing after they passed the abortion ban. 80-85% old white dudes.... writing laws on women reproductive rights. That's just wrong. They don't care about facts, they don't care about women's safty/health, and they don't care about the kids that will be forcibly born to this world. \n\n\n The numbers on injuries related to back ally abortions are terrifying as well. World wide there are an estimated 20 million \"unsafe abortions\" performed. This results in an estimated 68,000 women dying from these procedures, and an estimated 5 million  with long term health effects. So this means roughly 1/270 receiving an unsafe abortion will lose their life, and 1/4 will have lasting health consequences from it. In fact, unsafe abortions are the leading cause of death for maternal death rates at a whopping 13%( that's an estimated 1 death every 8 minutes). \n\nNow the relation to unsafe abortions and restrictive abortion laws are of course in direct relation to each other. The median rate of unsafe abortions in the 82 countries with the most restrictive abortion laws is up to 23 of 1000 women compared with 2 of 1000 in nations that allow abortions. As you can imagine, abortion related death are much higher in restrictive areas/countries at 34/1000 per child birth in restrictive and 1/1000 per child birth in unrestricted.  \n\nThe common misconception down here(I live in TX) Is that if abortion is made legal, people will \"abuse it\" and use it as an excuse to have copious amounts of unprotected sex, thus getting a ton of abortions. This is inherently false. In countries where abortion is legal(Belgium, Germany, and the Netherlands)the average rate of abortion between the ages of 15-44 is 10 per 1000 as where the inverse abortion rates(heavily unsafe ones) are 39 per 1000 women. This drastic increase can be correlated to a lack of sex ed(religious reasoning) and lack of contraceptives available. \n\nSo in conclusion, these law makers don't care about women, they dont care about kids, they only care about getting reelected and stroking their religios ego. Women's rights in Texas have been set back decades and Texas is trying to turn neighbors on each other. There is no good end with these types of laws in place.\n\nEdit:added stats and info\n\nSource: \nUnsafe abortions: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2709326/",
            "title_similarity": "0.6977437",
            "sentiment_compound": -0.9924
        },
        {
            "id": "hbgpw6n",
            "score": 2,
            "text": "But then we can all sue the rich husband or boyfriend. We can all get a piece.",
            "title_similarity": "0.54739845",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hbgq2r3",
            "score": 1,
            "text": "if it effected the rich, the republicans wouldnt have been allowed to pass it.",
            "title_similarity": "0.42090005",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgqs8e",
            "score": 1,
            "text": "Texas finally found a way to get kicked out of the union. Imagine that.",
            "title_similarity": "0.5688864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgratm",
            "score": 2,
            "text": "… and rich men’s mistresses.",
            "title_similarity": "0.42612135",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbgrb47",
            "score": 2,
            "text": "\"Well if I can't have it then I don't want them to either.\"",
            "title_similarity": "0.19294941",
            "sentiment_compound": 0.2211
        },
        {
            "id": "hbgrfy7",
            "score": 3,
            "text": "The quote should have been, “When abortion is illegal, rich women will still get SAFE abortions”.  The poor and disadvantaged will be forced to either carry to term or procure the services of “back alley butchers” for their abortions. I don’t understand why this is so difficult for Republicans and anti abortionist to grasp. Perhaps it’s time to float a medical ship that performs abortions only off the coastal waters of Texas.",
            "title_similarity": "0.88772404",
            "sentiment_compound": -0.866
        },
        {
            "id": "hbgs63p",
            "score": 3,
            "text": "The creepiest part is that abortion is legal. They're literally using a loophole and a weaponized body of private citizens to deny people the right to carry out a legal proceedure by targetting the provider. Imagine if CA gave you the right to sue restaurants who serve 1200 calorie meals to other people as a public health measure (actually more justified than this given you could at least pretend that's vaguely a harmful service). Crowder would be on a sidewalk shoving burgers in his mouth with an armed guard of proud boys.",
            "title_similarity": "0.63017446",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hbgsbuo",
            "score": 3,
            "text": "This particular law is weird, though, because of the bounties. Tons of \"nice\" white sorority girls get abortions, and they're the ones with money in the family. So when they call their mommies to get money to fly to LA to take care of a \"little problem,\" they'd better hope their cleaning ladies don't hear about it, because they have 10,000 reasons to spill the info.",
            "title_similarity": "0.71872354",
            "sentiment_compound": 0.8141
        },
        {
            "id": "hbgsgd8",
            "score": 2,
            "text": "Yeah that's pretty much how it goes. If you're rich enough you can get out of paying taxes or even being beholden to laws.",
            "title_similarity": "0.47774196",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hbgsxtx",
            "score": 2,
            "text": "Yes. They will go in secret to Los Angeles, New York or even Toronto. \n\nWhile poor women have to give birth to children that are going to end up at social service. \nMost will never get adopted, because anti-abortion people would rather go to their bed and fuck until they get pregnant instead of adopting these children.",
            "title_similarity": "0.62657964",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hbgtakt",
            "score": 1,
            "text": "Are there nearly as many rich people as poor people in Texas? Or is this problem negligible.",
            "title_similarity": "0.46643537",
            "sentiment_compound": -0.3869
        },
        {
            "id": "hbgtdie",
            "score": 3,
            "text": "Want to cut down on unwanted teen pregnancy?   Make a law where the father gets arrested if the woman has an abortion.   Then invest in profilactic stock.",
            "title_similarity": "0.6787758",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hbgtexz",
            "score": 3,
            "text": "Republicans are our Talibans.",
            "title_similarity": "0.43572596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgtmk4",
            "score": 2,
            "text": "The Planned Parenthood’s in CO and NM are about to get an influx of Abortion Tourists",
            "title_similarity": "0.62971276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgu40t",
            "score": 2,
            "text": "Anti abortion lawmakers whos daughters get knocked up by a minority man will have them get abortions too.",
            "title_similarity": "0.6540382",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbgu4at",
            "score": 2,
            "text": "And republican women never stopped getting abortions either.  They call it \"summering on the coast\".",
            "title_similarity": "0.70852137",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hbgu6fl",
            "score": 1,
            "text": "Her thoughts 💭 .  ” See that’s happened.",
            "title_similarity": "0.29011434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgudw7",
            "score": 1,
            "text": "We should close that loophole too.",
            "title_similarity": "0.25990105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgufrk",
            "score": 3,
            "text": "On one hand I understand that a lot of these people believe that they are protecting babies and that is good. Empathy is a good trait, keep it up.\n\nOn other hand, they aren't.",
            "title_similarity": "0.44695842",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hbgukrs",
            "score": 2,
            "text": "A government that can force people to give birth can also force people to have abortions.",
            "title_similarity": "0.6449083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbguxgk",
            "score": 3,
            "text": "We have a Republican Supreme Court! It's no a Supreme Court. It is a biased court! We cannot abide by their decisions, opinions, silence, etc. The Supreme Court of the USA is not for all. It's just for Republicans.",
            "title_similarity": "0.48321724",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hbgv9i2",
            "score": 1,
            "text": "Good idea.  Bad snake.",
            "title_similarity": "0.28301126",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbgvo63",
            "score": 1,
            "text": "Elizabeth Warren is good at screwing people over, she would know.",
            "title_similarity": "0.5669224",
            "sentiment_compound": 0.25
        },
        {
            "id": "hbgvs4t",
            "score": 1,
            "text": "Well it seems the right subs. ATM refused to direct talk about it.",
            "title_similarity": "0.3296763",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hbgvtfr",
            "score": 1,
            "text": "Like you",
            "title_similarity": "-0.011094794",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbgw1g5",
            "score": 3,
            "text": "Taliban Texas",
            "title_similarity": "0.37958428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgwaj5",
            "score": 1,
            "text": "Michael Porter Jr\n\nHe’s r/army’s very enjoyable. What’s he going to do something in extremely poor taste.",
            "title_similarity": "0.3960532",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hbgwcts",
            "score": 2,
            "text": "Options to hack this new law?\n\n1. A private legal firm (also considered “Persons” under law) sets up website for women planning an abortion to report themselves with the evidence. Then the firm files the first lawsuit (has primacy), wins lawsuit quickly and with minimal cost as they have evidence. Women do not retain counsel and incur no cost. Legal firm declines payment, or returns fee payment to the women. Women cannot be retried twice. \n\n2. Can you or family members as private citizens report you and use the same loophole as outlined above?\n\nEDIT: Yes, it’s the providers being sued, but they’re being sued based on a suspected specific instance, so the same approach would apply.",
            "title_similarity": "0.7758534",
            "sentiment_compound": -0.237
        },
        {
            "id": "hbgwg97",
            "score": 1,
            "text": "Hello Ms Elizabeth, when anything is illegal rich people still do it",
            "title_similarity": "0.58179414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgwm5k",
            "score": 2,
            "text": "That headline statement is true though....",
            "title_similarity": "0.23175803",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbgwnp4",
            "score": 2,
            "text": "Ironic that the same lawmakers all probably 100% support the death penalty.",
            "title_similarity": "0.57418597",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hbgwqzg",
            "score": 1,
            "text": "Except white women allowed this to happen smh",
            "title_similarity": "0.49076566",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbgx237",
            "score": 3,
            "text": "I can't believe the majority of republicans really want this authoritarian fascist lifestyle to become the norm in the US.  How is it that they can be so completely out of tune with what is happening these days?  Do people drift to the republican party because they can't think for themselves?",
            "title_similarity": "0.5002511",
            "sentiment_compound": -0.1697
        },
        {
            "id": "hbgx6bo",
            "score": 3,
            "text": "Listen, Iverticim can be used to induce an abortion, so maybe we should report Joe Rogan as a Texas resident.",
            "title_similarity": "0.7402115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgxprk",
            "score": 2,
            "text": "Laws have always been for the poor. The rich get away with murder remember?",
            "title_similarity": "0.61168087",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hbgy20p",
            "score": 1,
            "text": "Forgot about that. 20% of someones income?",
            "title_similarity": "0.25812268",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgy52s",
            "score": 1,
            "text": "I feel like the same thumbnail is used for every story about her",
            "title_similarity": "0.4335475",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbgy6at",
            "score": 2,
            "text": "When guns are illegal, rich women still get guns",
            "title_similarity": "0.73381203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgygup",
            "score": 2,
            "text": "Alright Texas, now let's get some forced organ donation laws, after all it is about saving life right?  Well plenty of people are in need of organs, time for Texans to be forced to give their kidneys and parts of their livers and lungs and monthly blood.",
            "title_similarity": "0.65413284",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hbgysv4",
            "score": 3,
            "text": "Of course. That's the point isn't it? Do you think Republican politicians would allow a law to pass that impacts *their* freedom?",
            "title_similarity": "0.49150538",
            "sentiment_compound": 0.755
        },
        {
            "id": "hbgywcu",
            "score": 2,
            "text": "Of course they do, and so do the women in the white male lawmakers' realms of power.  It's the ultimate in hypocrisy and one can hope their God will have them pay dearly when their number's up.",
            "title_similarity": "0.62085986",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hbgzczv",
            "score": 2,
            "text": "I can't imagine there's any way this actually get enforced in the long run. Put aside the Roe V Wade discussion and just talk about the fact they're encouraging friends and family to sue for something that's federally legal. This law does not trump federal law. \n\nNot to mention, for a political party that likes to call masks and vaccines similar to \"Nazi Germany\", they sure are acting a lot like Nazi Germany. \n\nEerily similar when Germans would reward family/friends/neighbors for turning in Jewish people in hiding. Of all the Nazi like things the Republican party has done the last 5 years, this is by far the most extreme. The fact it's escalating has me scared to even visit that state as a Jewish (although atheist) man. \n\n\nSide note on that last part because some people might think that's contradicting. Here's a wiki article explaining.\n\nhttps://en.wikipedia.org/wiki/Jewish_atheism",
            "title_similarity": "0.68661",
            "sentiment_compound": 0.9571
        },
        {
            "id": "hbgzekd",
            "score": 3,
            "text": "Don't worry, republican opposition to vaccines and affordable healthcare will handle any unwanted children swiftly, as god intended.",
            "title_similarity": "0.6080617",
            "sentiment_compound": 0.5867
        },
        {
            "id": "hbgzhy7",
            "score": 1,
            "text": "Is it like the show because women that can have babies are being forced to when they don’t want to be pregnant? \n\nI thought the show had people that couldn’t have babies. so they slaved people that could have babies. Then took the babies. \n\nI’m not saying these laws are right.. I’m struggling to see the correlation to the show.",
            "title_similarity": "0.608901",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hbgzviw",
            "score": 1,
            "text": "I like how everyone is complaining about bypassing the law and not the actual law? Sounds reasonable.",
            "title_similarity": "0.53352624",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hbgzzid",
            "score": 3,
            "text": "Well, I guess when haircuts are illegal, rich girls still get haircuts.",
            "title_similarity": "0.7043358",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbh09sz",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbh0fxe",
            "score": 1,
            "text": "HEADLINE:  \"Someone said something and then someone else agreed with that statement.\"\n\nIt just seems like an odd, clunky headline.",
            "title_similarity": "0.33309132",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbh0hj1",
            "score": 3,
            "text": "This does disproportionately affect poorer people, which are usually young people. Minorities are also usually more economically challenged by the American economic system so doesn’t this work against Texas republicans fear of white people loosing their manifest destiny of superiority?",
            "title_similarity": "0.49576452",
            "sentiment_compound": -0.6096
        },
        {
            "id": "hbh0npy",
            "score": 1,
            "text": "No rich women will get IUDs or use any of the other 38 forms of birth control they have…",
            "title_similarity": "0.53922635",
            "sentiment_compound": -0.4449
        },
        {
            "id": "hbh0v6w",
            "score": 3,
            "text": "Who is going to pay for the pre-natal care for unplanned/unwanted pregnancies? Who is going to pay for the birth and related hospital bills? Births are expensive! Who is going to pay for the NICU stays for babies born with health problems because the woman couldn't afford pre-natal care or just didn't look after herself while pregnant and has a baby with spina bifida? Who is going to adopt the babies forced to be born? Wtaf?!",
            "title_similarity": "0.5974053",
            "sentiment_compound": -0.8004
        },
        {
            "id": "hbh15au",
            "score": 6,
            "text": "And over in r/firearms they're crowing left and right about TX getting constitutional carry, talk about a state with fucked up priorities",
            "title_similarity": "0.54824567",
            "sentiment_compound": -0.2885
        },
        {
            "id": "hbh1dne",
            "score": 5,
            "text": "Also, when you have an \"exception for rape\" its actually an exception for rape provable in a court of law. Good luck with that, especially when the rapist is a frat boy with daddy's law team behind him.",
            "title_similarity": "0.53859353",
            "sentiment_compound": -0.8925
        },
        {
            "id": "hbh1ks6",
            "score": 2,
            "text": "Moral of the story - If you live in Texas don't be smart and poor.",
            "title_similarity": "0.54014754",
            "sentiment_compound": -0.6551
        },
        {
            "id": "hbh1nsu",
            "score": 5,
            "text": "So do I get $10,000  when I report a Texas politician schedules a D&C for their pregnant mistress, daughter or wife?  These women never have had to fear a back room abortion.",
            "title_similarity": "0.7274175",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hbh1ogk",
            "score": 3,
            "text": "Uh, yeah. If you don't get pout the next things to go will be:  Your right to vote(without pretending not to be doing it, but just take it away) Your job, your money, your right to own property and your right to read. On the bright side you may be blessed with fine weather.",
            "title_similarity": "0.4533645",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hbh1ree",
            "score": 6,
            "text": "At this point let’s just have Texas secede that way we don’t have to deal with their dumbshit anymore.",
            "title_similarity": "0.5012946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh26bj",
            "score": 3,
            "text": "Poor women also still get abortions, they just also get injured/ killed by them more often.",
            "title_similarity": "0.620328",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hbh30xp",
            "score": 2,
            "text": "Yes that is how all laws work.... I am confused is this actually news to anyone?",
            "title_similarity": "0.29708016",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hbh3285",
            "score": 2,
            "text": "EW — truth to power",
            "title_similarity": "0.24593842",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbh37ri",
            "score": 2,
            "text": "There are just too many reasons to never step foot in Texas.",
            "title_similarity": "0.34494242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh3da0",
            "score": 5,
            "text": "Every single woman in Texas that isn't completely insane needs to vote blue and every man that cares need to stand by them.  When I heard of this law all I could think about was that old white dudes keep imposing their will on women and seriously what do any of us know about being a woman?",
            "title_similarity": "0.6053125",
            "sentiment_compound": 0.5227
        },
        {
            "id": "hbh3evy",
            "score": 3,
            "text": "Texas is Gilead now. Smmfh…\n\nWTF is wrong with our country?",
            "title_similarity": "0.50075513",
            "sentiment_compound": -0.824
        },
        {
            "id": "hbh3f0k",
            "score": 3,
            "text": "it's obvious, here in Brazil they were trying to put this kinda law here too, the only explanation I can see is: 1- only rich people can do it (its obviously so that the politicians can still cheat on their respective wifes and pay for the abortion before everyone else discover it)\n2- the poor people who cannot afford it, will have to face having a child and force the family members and the child to work since early until late af, so the production \"wheel\" never stops turning.\nAnd they have the guts to use religious excuses for something obviously political for them",
            "title_similarity": "0.68431556",
            "sentiment_compound": 0.0885
        },
        {
            "id": "hbh3xbd",
            "score": 2,
            "text": "All politicians ever do is talk, or tweet.  That's it!",
            "title_similarity": "0.39359817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh400h",
            "score": 3,
            "text": "Same with drug use... nothing is illegal if you have enough money. We really just penalize people for being poor.",
            "title_similarity": "0.5541668",
            "sentiment_compound": -0.0454
        },
        {
            "id": "hbh4zhv",
            "score": 2,
            "text": "How robust are social services in Texas? 'Cause they're going to need them.",
            "title_similarity": "0.51913",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbh5xck",
            "score": 3,
            "text": "Warren is right, of course; however, every woman who voted for Trump either already perceives themselves as \"rich\" or anticipates they soon will be. They've no interest in taking actions to curtail any current privileges or those for when they finally \"arrive\" there. The Senator knows her message only sticks to already sticky minds. She also knows any attempt to convince the Teflon minded is like trying to talk marbles into being cubes.",
            "title_similarity": "0.68386257",
            "sentiment_compound": 0.8031
        },
        {
            "id": "hbh6ayu",
            "score": 2,
            "text": "Facts",
            "title_similarity": "0.10600449",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh6bge",
            "score": 3,
            "text": "someone needs to confront these people and show them that the concept of church and state  is an unamerican ideal.",
            "title_similarity": "0.34706086",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbh6c8f",
            "score": 2,
            "text": "Is anything going to be done about or are politicians just going to agree that it's terrible?",
            "title_similarity": "0.33576256",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbh6y0l",
            "score": 3,
            "text": "Laws/rules never have applied to the rich.  Unless one of their own screws them (Madoff).",
            "title_similarity": "0.41635",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbh701d",
            "score": 3,
            "text": "In Texas the “leaders” and stupid people that heard along with them (anti-vacation) believe it is their right to NOT wear a mask. \n\nBut when it comes to a woman having to make a tough personal decision, those governments offices believe those women DO NOT have the right to make that decision. In fact, they make it illegal for them. \n\nCrazy",
            "title_similarity": "0.6473044",
            "sentiment_compound": -0.899
        },
        {
            "id": "hbh7610",
            "score": 3,
            "text": "They just ban safe abortions, this will not actually stop people from having them; so \"accidents\" and the Black Market will increase in terms of abortions.",
            "title_similarity": "0.7142474",
            "sentiment_compound": -0.1289
        },
        {
            "id": "hbh7awp",
            "score": 3,
            "text": "If the punishment for a crime is a fine, it is a law for the lower class",
            "title_similarity": "0.43396354",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hbh7h5q",
            "score": 1,
            "text": "\"Elitism\"has many faces, Sexism, Racism, and others, all allow people to feel better about themselves. But, at the expense of others.",
            "title_similarity": "0.38853264",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hbh7kvs",
            "score": 2,
            "text": "Can we sue Trump now or does it not work retroactively?",
            "title_similarity": "0.42366874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh80hh",
            "score": 3,
            "text": "And Texas AG, Ken \"El Corrupto\" Paxton, will be prosecuting the cases.",
            "title_similarity": "0.544738",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh86ee",
            "score": 3,
            "text": "The whole law is BS. How do they not have any exceptions for minors or rape victims? That’s terrible! Ruining the lives of both the child and the mother. How does the state expect a 15 yr old from a poor background to provide for a baby?  How is it the girls fault that they were raped? Why should a rape victim keep a baby that reminds her of the worst trauma that happened to her? Isn’t the mental/physical trauma enough already? Shame on the people that were part of this becoming a law!",
            "title_similarity": "0.54970056",
            "sentiment_compound": -0.9921
        },
        {
            "id": "hbh89c0",
            "score": 3,
            "text": "Can’t wait for a rape baby to appear in a rich women since I definitely know they will have an abortion and even announce it. Mark my words, the rich will prosper and the poor will suffer",
            "title_similarity": "0.7651678",
            "sentiment_compound": -0.34
        },
        {
            "id": "hbh8est",
            "score": 3,
            "text": "later this month, the House will vote on the Women’s Health Protection Act, which will block restrictive abortion laws like the one in Texas. Here is a link that withh outomaticly send an email out to your local congress member. The email asks for the WHPA to be passed. The site is made and funded by Bedsiders which is a site that helps women get contaceptive and sexual health help online. Here is the link.\n\n[https://www.votervoice.ne](https://www.votervoice.net)\n\n[t](https://www.votervoice.net)",
            "title_similarity": "0.70191485",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hbh8rgl",
            "score": 1,
            "text": "The abortion issue is a well structured smokescreen under the guise of pro-life - when it’s systemically ensuring United States of debt maintains and ensures the poverty cycle continues.",
            "title_similarity": "0.7248372",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hbh8ug1",
            "score": 3,
            "text": "Texas sounding more and more fascist by the day. \n\n- far-right \n- authoritarian ultranationalism\n- forcible suppression of opposition\n- strong regimentation of society\n\nAt what point do we stop butting into other countries’ affairs and stomp out the fires in our very own backyard? \n\nUmm, hello? Where’d all our raging human rights warriors go? My guess is they love to rage about other countries’ human rights issues. But when it comes to our own human rights abuses the country is collectively radio silent save a handful of genuine good people. \n\nHow pathetic.",
            "title_similarity": "0.564432",
            "sentiment_compound": -0.7406
        },
        {
            "id": "hbh9nod",
            "score": 3,
            "text": "Same thing with guns\n\nSame thing with voting restrictions\n\nSame thing with drugs \n\nWhy do we keep going around and around and around?",
            "title_similarity": "0.5701555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh9qxq",
            "score": 2,
            "text": "I mean its true, lots of things are \"Illegal\" but people with ridiculously disposable income always find a way.",
            "title_similarity": "0.48794946",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbh9sxi",
            "score": 1,
            "text": "Now I wish she'd say the same about gun control🤷",
            "title_similarity": "0.48766357",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbha8qz",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.07086487"
        },
        {
            "id": "hbhacfw",
            "score": 3,
            "text": "The Handmaid's Tale is to feminists what 1984 is to conservatives",
            "title_similarity": "0.67149955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhagfp",
            "score": 2,
            "text": "Except everything in the bill is outlawed.",
            "title_similarity": "0.31888407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhah24",
            "score": 2,
            "text": "So if anyone can sue people who had an abortion… can I sue people for being unvaccinated?",
            "title_similarity": "0.64567775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhalgt",
            "score": 2,
            "text": "Of-Jim can be emotional at times.",
            "title_similarity": "0.12587392",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hbhao9z",
            "score": 3,
            "text": "State funded abortions target women of color.",
            "title_similarity": "0.69095325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhasbo",
            "score": 3,
            "text": "If a woman flies out of state to get an abortion, then does the law allow a person to sue the captain of the plane, the manufacturer of the plane, and the airline for aiding in the abortion? Why not sue the company that runs the passenger terminal as well?\n\nIf an Uber driver can be sued for helping a woman get to an abortion provider by car, then presumably anyone involved in the transport by air would be equally liable under this law?",
            "title_similarity": "0.69094884",
            "sentiment_compound": 0.6946
        },
        {
            "id": "hbhb9l4",
            "score": 1,
            "text": "Abortions just cost $10,000 plus medical fees now. \n\nIt's still actually one of the cheaper major medical procedures in America.....",
            "title_similarity": "0.6378703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhbi2i",
            "score": 2,
            "text": "So the answer to everything in life is to get rich? Otherwise we're just cattle?",
            "title_similarity": "0.44217455",
            "sentiment_compound": 0.6072
        },
        {
            "id": "hbhc9uz",
            "score": 2,
            "text": "\\*agrees in North Carolina.",
            "title_similarity": "0.21799439",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbhd2gs",
            "score": 1,
            "text": "She has a dap,",
            "title_similarity": "0.2585162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhd38q",
            "score": 1,
            "text": "But it’s ok when Democrats do the same thing with guns…",
            "title_similarity": "0.5208136",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbhd42n",
            "score": 2,
            "text": "The only sort of actual logic I can go on here why conservative leadership is so adamant about abortion isn't simply because it's been a deep running issue for a long time but also - forcing poor people to have babies only extends the poverty cycle, it gives them more sheep to vote against their own interests and tax into permanent servitude",
            "title_similarity": "0.68276036",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hbhdewy",
            "score": 2,
            "text": "Me and my partner recently just had a pregnancy scare... Test came up negative but one of the things I said to reassure her was \"at least we aren't in Texas\"\n\nTexas and the south just seems like a backwards ass wasteland",
            "title_similarity": "0.63955414",
            "sentiment_compound": -0.431
        },
        {
            "id": "hbhdfn8",
            "score": 2,
            "text": "So does that mean that rich people tend to break the law with no repercussions? Huh...",
            "title_similarity": "0.55345494",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbhdly0",
            "score": 3,
            "text": "When pedophilia is illegal, rich people still molest children",
            "title_similarity": "0.51601505",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbhdw7q",
            "score": 2,
            "text": "they just fly to Cancun.",
            "title_similarity": "0.30347475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhfjxs",
            "score": 2,
            "text": "Well yeah, it's all going as planned.",
            "title_similarity": "0.1133665",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbhfn4g",
            "score": 2,
            "text": "So do something about it please",
            "title_similarity": "0.044686772",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbhfyex",
            "score": 2,
            "text": "Herself being a \"rich woman\", she should know! Have a beer there, Liz",
            "title_similarity": "0.6282499",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hbhhc7t",
            "score": 2,
            "text": "Abortion should be legal because what if the condom burst's.",
            "title_similarity": "0.6515344",
            "sentiment_compound": 0.128
        },
        {
            "id": "hbhkx59",
            "score": 1,
            "text": "A fine is just another fee in the eyes of the rich.",
            "title_similarity": "0.42133278",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbhm65i",
            "score": 1,
            "text": "This is the obvious unspoken truth. \nTbh our laws just really apply to the poor (most of us)",
            "title_similarity": "0.483872",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hbhmfst",
            "score": 3,
            "text": "Boycott Texas. Cancel all conventions. Don't spend a dime there.",
            "title_similarity": "0.3371993",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hbhnbks",
            "score": 1,
            "text": "Texas = no cream pie zone",
            "title_similarity": "0.36719388",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbhnrag",
            "score": 1,
            "text": "Does this mean they won't supply monoclonal therapies anymore? Aren't they from aborted fetuses? Seems kind of weird to say no abortion but some Rep government official then demands a therapy treatment after getting Covid. Please educate me if I'm wrong.",
            "title_similarity": "0.6208718",
            "sentiment_compound": -0.5656
        },
        {
            "id": "hbhnrtd",
            "score": 2,
            "text": "I don't think this is the biggest issue with the Texan transpose. It in essence is a technique to circumvent any human or constitutional right. So basically the whole Constitution is at stake, not just abortion/privacy.",
            "title_similarity": "0.5396203",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhnv5e",
            "score": 1,
            "text": "...at home",
            "title_similarity": "0.06430172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhoebj",
            "score": 2,
            "text": "Truth.",
            "title_similarity": "0.09585119",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbhrl1e",
            "score": 1,
            "text": "Dude I've been trying to say this. Just like vaccine passports not applying to celebrities, and sports players and stuff. The rich do what they want and make rules for the poor.",
            "title_similarity": "0.60855925",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbhsa22",
            "score": 3,
            "text": "Anything that only carries a fine is for poor people.",
            "title_similarity": "0.36032784",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbhsssr",
            "score": 2,
            "text": "Fucking Texas government is a circus.",
            "title_similarity": "0.47107184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhtkkq",
            "score": 1,
            "text": "Wow. Sounds like how when gun ownership is banned, rich people and politicians still get guns for protection.",
            "title_similarity": "0.6611655",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hbhun19",
            "score": 1,
            "text": "If you haven't figured out that the poor and middle classes exist to cater to the rich, you ain't been in US politics long enough!",
            "title_similarity": "0.4872973",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hbhuu5c",
            "score": 1,
            "text": "Its not about the pasta!!! (Abortions ) it’s about keeping Texas red.  Unfortunately women’s rights are just a casualty - It’s so disgusting it makes my skin crawl. I want out of this whole country. I don’t even feel bad saying this -I hope delta wipes the whole state out, once all the normal people leave of course as the GOP planned.",
            "title_similarity": "0.67602265",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hbhuujs",
            "score": 1,
            "text": "Good to know that Elizabeth Warren agrees. Couldn’t have guess it.",
            "title_similarity": "0.37190354",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbhv61j",
            "score": 3,
            "text": "Yep. If you can take a few days off work, you can always just go to New Mexico/California/Canada if need be and get it done there.\n\nTeenagers and poor women who can't afford to take off work have no such restriction.",
            "title_similarity": "0.614918",
            "sentiment_compound": -0.3151
        },
        {
            "id": "hbhvmma",
            "score": 2,
            "text": "Why are politicians referencing TV shows? What is this?\n\nAlso fuck Texas. Ratify Roe vs Wade",
            "title_similarity": "0.5566123",
            "sentiment_compound": -0.594
        },
        {
            "id": "hbhx821",
            "score": 5,
            "text": "I don't think its an ethical argument but a basic medical right.\n\n\n In Australia the high court ruled that women should have access to healthcare (family planning clinics/ abortion clinics) without fear of protesters. It was deemed that for huge amounts of reasons women has the right to see a doctor to discuss options. The high court stopped any ethical debate by clarifying that this was about the right to access healthcare. \n\nNot all women abort fetus. But some women do for a load of reasons ie rape, medical issues etc.\n\nAlso in Australia women access family planning clinics for loads of other reasons. These centres provide medical and psychological support during the entire pregnancy, birth control, issues with domestic violence during pregnancy, and medical support if there is concerns that the mother or baby are unwell.\n\nThis is a basic medical right for a women to get free medical treatment. Regardless of the women's choice the courts in Australia have made it clear that a women should be able to access healthcare away from any protesters or ethical arguments. It's a basic right",
            "title_similarity": "0.7404336",
            "sentiment_compound": 0.904
        },
        {
            "id": "hbhxr02",
            "score": 2,
            "text": "75% of women who get abortions are below the poverty line. Rich women don’t get abortions because they access to better birth control,",
            "title_similarity": "0.6921731",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hbhxreb",
            "score": 2,
            "text": "This could honestly be said about most illegal shit I feel like.",
            "title_similarity": "0.437348",
            "sentiment_compound": -0.5059
        },
        {
            "id": "hbi0cwh",
            "score": 3,
            "text": "I thought it was just assumed that if something is illegal, rich people will still do it and not get in any trouble anyways",
            "title_similarity": "0.50540835",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hbi0p29",
            "score": 7,
            "text": "I actually agree with her. They forgot the part where most of these women who are seeking abortions don’t have the means to raise a child on their own... they will ultimately need taxpayer support.",
            "title_similarity": "0.7474592",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbi0wzz",
            "score": 6,
            "text": "If the penalty for breaking a law is a fine, then it’s only a law against poor people.",
            "title_similarity": "0.50084275",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hbi1eqg",
            "score": 7,
            "text": "Come on people , we all have to get out there and vote these idiots out! Before you know it this country will be as bad as Afghanistan. Whether you think this is not about you, it is! If you have grandchildren  or daughters , this is about you! Get out and vote them out!!! It is about all of us women !$",
            "title_similarity": "0.5674199",
            "sentiment_compound": -0.6876
        },
        {
            "id": "hbi4q9l",
            "score": 6,
            "text": "It's to bad people can't camp out and record everyone that enters an abortion clinic. Every clinic in the country. Then when they see a gop member or their wife/girlfriend/mistress going in they could put that up on every major news station. Because we all know that every rich pro-life person will get an abortion if a pregnancy interferes with their life dreams and plans.",
            "title_similarity": "0.7288526",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbi77lu",
            "score": 5,
            "text": "Can we also point out boys or men here are in no way saddled with their poor decision? I’ve given birth, it’s fucking brutal. I cannot even fathom the poor girls raped by who knows what and are forced through that reality. Texas is off it’s hinges.",
            "title_similarity": "0.6370632",
            "sentiment_compound": -0.9657
        },
        {
            "id": "hbi9mpc",
            "score": 2,
            "text": "Rich women *and* the mistresses of rich men",
            "title_similarity": "0.49351734",
            "sentiment_compound": 0.802
        },
        {
            "id": "hbici9l",
            "score": 2,
            "text": "The possible repercussions of this are frightening. In prison, snitchers are dealt in a not so kind way. It kind of reminds me of the general tenet of books Fahrenheit 451 and 1984. Is this the beginning of a snitching social culture? The rich Texan \"ladies\" can afford to travel to New York and the less rich have to deal with dark alley procedures at best. We as a society are better than this. I would like to see Texas withdraw from Union, and any other state choosing to restrict women's and voter's rights. RASA would be cool cap for all the exiting misogynists and autocrats.",
            "title_similarity": "0.69892347",
            "sentiment_compound": 0.7364
        },
        {
            "id": "hbicjj6",
            "score": 1,
            "text": "That’s just a blanket  statement that you could just fill in the blank for the final subject",
            "title_similarity": "0.29747826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbidqnq",
            "score": 1,
            "text": "“This order is not based on any conclusion about the constitutionality of Texas’s law, and in no way limits other procedurally proper challenges to the Texas law, including in Texas state courts,” the majority opinion states.",
            "title_similarity": "0.45581478",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbiez3q",
            "score": 2,
            "text": "I don't even like abortion (but I have my reasons as to why I wouldn't essentially completely ban it), the thing that I don't like with this law and the other laws is it's telling a woman what they're supposed to do.\n\nI wouldn't have even commented on this law at any place online though until I heard about the part where every private citizen can sue an abortion provider. That's just odd to me.\n\nAnyway, since this conservative Supreme Court is fairly likely to let all these heartbeat bills stand, it will be interesting to me down the road to see the statistics on:\n\n- Maternal deaths\n\n- The amount of handicapped children that are under control of the states doing these heartbeat bills\n\nMy guess, since I'm cynical here, is that both will be increasing.",
            "title_similarity": "0.68967104",
            "sentiment_compound": 0.6238
        },
        {
            "id": "hbifr0k",
            "score": 2,
            "text": "I’d like to remind everyone about the moderator’s recent “Update to our Rules Against Harm”. Please do not “advocate for” or “express extreme indifference towards” abortion, as this clearly violates the politics page policy.",
            "title_similarity": "0.5127636",
            "sentiment_compound": 0.4822
        },
        {
            "id": "hbig9r8",
            "score": 1,
            "text": "I totally agree. If you make something illegal that has been illegal for years, there will still be a market.  Now ask her about gun control and she would turn it around but Chicago is a great example of what happens when you ban guns.   Prohibition is a good example.  That made it all the way to our bill of rights and then had to be reversed.... of course because people need to drink.   Take it away and humans will find a way to get what they need.  Nature almost.  Warren is and idiot.  Just think.  She was running for president and didn't measure up to Joe Biden!",
            "title_similarity": "0.71296877",
            "sentiment_compound": -0.5492
        },
        {
            "id": "hbii0th",
            "score": 1,
            "text": "The Texas Taliban must be defeated.",
            "title_similarity": "0.45090404",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbiiw8d",
            "score": 2,
            "text": "But is she gonna do anything about it, like sponsoring a federal law making abortion legal and has to he covered by health insurance?",
            "title_similarity": "0.63772607",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hbijzxs",
            "score": 1,
            "text": "Hey Texas Democratic Party — perhaps a simple slogan like “Vote Blue So Your Daughters Don’t Wind Up Sex Slaves”",
            "title_similarity": "0.63627905",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbik6ov",
            "score": 4,
            "text": "If the punishment for breaking a law is a fine, then that law only exists to target a below a specific socioeconomic status.",
            "title_similarity": "0.41749048",
            "sentiment_compound": -0.34
        },
        {
            "id": "hbipbo3",
            "score": 3,
            "text": "I could have sworn Taliban were supposed to be invading Afghanistan, but here we have clear evidence of them invading Texas.",
            "title_similarity": "0.56611526",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hbiwgo1",
            "score": 2,
            "text": "Taking his back to the good old days when men ruled everything. That's kind of f***** up don't you think? I thought we were better than that I guess not. Come on women wake up what the f*** is wrong with you.",
            "title_similarity": "0.53635633",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbizkx9",
            "score": 2,
            "text": "Women never fare well under the Taliban.  The Texas Taliban is even worse.",
            "title_similarity": "0.49898344",
            "sentiment_compound": -0.6012
        },
        {
            "id": "hbiztyo",
            "score": 1,
            "text": "Am i the only one who thinks we might want to have a closer look at the bibles they're reading? \n\nI mean... *red state school book take on electricity*\n\n*and slavery*\n\n*and the civil war*\n*and*\n\n you get the point.",
            "title_similarity": "0.47219175",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hbj01da",
            "score": 3,
            "text": "That is literally everywhere. The rich flount the laws all the time. Or just go to a country that it's legal.",
            "title_similarity": "0.48002043",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hbj1i8m",
            "score": 2,
            "text": "Everyone talking about how this is just against women your wrong. this is bigger than that,  texas gop is systematically cutting out poor democrats from their state. To insure easier elections in the future.",
            "title_similarity": "0.6513396",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hbj3p38",
            "score": 2,
            "text": "The true measure of wealth, is what illegal things you can do.",
            "title_similarity": "0.44030035",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbj8ksm",
            "score": 2,
            "text": "r/showerthought\n\nAnti-abortionists who try to legitimately turn in or sue a woman for getting an abortion should be forced to register to adopt a child and the bounty $10,000 should be donated to their local public school.\n\nIf its all about the life of the child, put up or shut up.",
            "title_similarity": "0.65017664",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbj9tlj",
            "score": 2,
            "text": "I'm glad I don't live in texas. I wouldn't want to live where the f****** women let men rule the world. I thought we were equal apparently not there and not in TexAss",
            "title_similarity": "0.5238848",
            "sentiment_compound": 0.4172
        },
        {
            "id": "hbjgm8i",
            "score": 3,
            "text": "For those that didn’t read the text of the law:\n\n> Sec. 171.208.  CIVIL LIABILITY FOR VIOLATION OR AIDING OR ABETTING VIOLATION. (a)  Any person, other than an officer or employee of a state or local governmental entity in this state, may bring a civil action against any person who:\n\n> (1)  performs or induces an abortion in violation of this subchapter;\n\n> (2)  knowingly engages in conduct that aids or abets the performance or inducement of an abortion, including paying for or reimbursing the costs of an abortion through insurance or otherwise, if the abortion is performed or induced in violation of this subchapter, regardless of whether the person knew or should have known that the abortion would be performed or induced in violation of this subchapter; or\n\n> **(3)  intends to engage in the conduct described by Subdivision (1) or (2).**\n\nThat’s right... If you intend, or think, about having an abortion without even having to enact it or even be the woman having it done on her, you can be sued for it.\n\nFor a party that endlessly cries about the left’s “thought policing”, it sure as hell looks like it is in fact the **Republicans that are policing intent, and therefore thought.**\n\nBetween this and forcing local schools to do what state politicians want, regardless of what every domestic and international public health organization says to during a pandemic, it’s abundantly clear that Republicans are overreaching with government power, forcing everyone within their respective states to do what a few wants, not the majority.\n\nThis is authoritarianism.",
            "title_similarity": "0.6529796",
            "sentiment_compound": -0.9135
        },
        {
            "id": "hbjkvlr",
            "score": 2,
            "text": "Poor women do as well, it’s just in unregulated, often unsafe situations. You can’t get rid of abortions, you just stop safe abortions from happening",
            "title_similarity": "0.6130935",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hbjn128",
            "score": 1,
            "text": "Rich women and rich men who will pay for their hook ups’ abortions",
            "title_similarity": "0.66480625",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hbjr1i3",
            "score": 2,
            "text": "This is just a distraction from jan 6. This is how far they’ll go.",
            "title_similarity": "0.3319424",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hbk3um8",
            "score": 1,
            "text": "Also when trying to give out 10k to rat on someone? Wonder who that’s trying to target.. I’m thinking ppl should get 10 k to abort with this fuckin world. Ffs",
            "title_similarity": "0.49799812",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hbkgrzo",
            "score": 2,
            "text": "Social control in its most basic form, where only the rich are given exception",
            "title_similarity": "0.39399475",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbllvov",
            "score": 1,
            "text": "This law will get tossed. Since most of the plaintiffs will have no real legal standing, all the defendant needs to do is ask for the proceeding to be dropped as being baseless (lacking standing) and counter sue for all court costs and attorney fees. If it goes beyond this, the plaintiff will lose on appeal. The Texas law is unconstitutional due to the fact that most plaintiffs have no legal standing.",
            "title_similarity": "0.52099335",
            "sentiment_compound": -0.6571
        },
        {
            "id": "hblm0vc",
            "score": 1,
            "text": "Also, you know, rich men make any woman get an abortion.",
            "title_similarity": "0.66850567",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbmxyqr",
            "score": 3,
            "text": "I love Elizabeth Warren so fucking much",
            "title_similarity": "0.3249228",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbo8vwm",
            "score": 4,
            "text": "Voter suppression and anti-abortion laws have something in common; it’s called racism. https://www.elephantjournal.com/2021/09/jane-elliott-explains-why-republicans-are-pushing-voter-suppression-anti-abortion-laws-robert-busch/",
            "title_similarity": "0.6478535",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hbsb3b7",
            "score": 1,
            "text": "So do poor people. It's called a coat hangar. Jesse Jackson might know something about that.",
            "title_similarity": "0.4012104",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hbuspr0",
            "score": 1,
            "text": "Yeah…this is basically the case for any law out there. Rich people get away with anything, that doesn’t mean we should do away with all laws. Very poor argument",
            "title_similarity": "0.6045683",
            "sentiment_compound": -0.376
        },
        {
            "id": "hc04z59",
            "score": 1,
            "text": " Margaret Sanger actually founded Planned Parenthood to be genocide of the black race in America \n  The genocide all thoughts were shared with Hitler. \nhttps://jodysview.com/2021/04/margaret-sanger-and-adolph-hitler/",
            "title_similarity": "0.5702193",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc3zidz",
            "score": 1,
            "text": "No shortage of ultra rich women, or mother/daughter teams hoping on a plane for Switzerland or other countries for an abortion back in the day.",
            "title_similarity": "0.6335696",
            "sentiment_compound": 0.7987
        },
        {
            "id": "hc54pva",
            "score": 1,
            "text": "fight, fight, fight, for your right",
            "title_similarity": "0.16735227",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hc877t5",
            "score": 1,
            "text": "F Texas.",
            "title_similarity": "0.24683177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc87gpc",
            "score": 1,
            "text": "Can we trade Mexico for Texas?",
            "title_similarity": "0.4789344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcee81o",
            "score": 1,
            "text": "How many people here agree with vaccine mandates? Admittedly, I assume all of you. So, if the government can tell you what to put into your body, how can they not tell you what not to take out of your body? As in no abortion after a set time, like when it’s got a heartbeat. Most of you think animals are better than humans, which goes to show, you only want things that are happy when you show up and you are useless. You don’t live in Azkaban. You are not a Disney character. Elizabeth warren would agree to anything to get into the news cycle, much like chairman Bernie. People that think like this are the most feeble minded, self righteous, hypocritical, virtue signaling asses. That’s the only way I could describe current events. Fuck yourself",
            "title_similarity": "0.6802416",
            "sentiment_compound": 0.8209
        },
        {
            "id": "hdcl2ee",
            "score": 1,
            "text": "At the age of 13, I stood up to my mother and my doctor to stop have plastic surgeries to correct a birth defect. I had had 13 up to that point and starting at the age of 7 or 8, I wanted them to stop. I was fine with the way I looked and fine with my own face. \n\nYes, I know that very concept is alien to most 13 year olds. I was forced to mature early. :)\n\nMy mom and doctor did the right thing and tried to convince me that I should continue with the surgeries. I stood my ground and said no. I was done. I told them that the state of Ohio recognized that at 13, I had the ability to make decisions about my reproductive health, meaning I could get birth control without parental consent, the same should apply to the rest of my medical health. So, I said no more surgeries and they stopped.\n\nNow, at the age of 40, if I lived in Texas, I no longer have the right to make my own medical decisions about my medical and reproductive health. \n\nThat is just one of the many serious repercussions that the Supreme Court is failing to recognize. I just lost a right that I earned 27 years earlier as a child. \n\nI am prochoice, not because I am for an abortion, but I have first hand experience of having someone else make medical decisions about my own body. It sucks. You feel helpless, hopeless, and can make you not even feel real. You feel like you are just someone else's plaything, a doll. Why get out of bed? Why live if you literally have the inability to make decisions about yourself? Are you even real at that point? I will not tell another woman what she should or should not do with her own body because I don't want that to happen to me again.\n\nWhile, rich women will still be able to get abortions because they can afford to travel, poor women in Texas are in the position I was at 13, except they have real longterm life changing consequences and no way out. They are going to have to deal with these consequences. Not the government, not religious nuts, not the State of Texas. Women. \n\nTo the Texas Legislature, while I know you will never read this, please stop trying to make women second class citizens in their own state. Please stop trying to take away rights that we earned simply by growing up. \n\nTry thinking of the issue like this. What if there was a law that demanded all women to get an abortion? Those emotions... those are the same ones many women are feeling right now.",
            "title_similarity": "0.56701815",
            "sentiment_compound": -0.8072
        },
        {
            "id": "hdo0xgs",
            "score": 1,
            "text": "Fucking A right y’a queers",
            "title_similarity": "0.24970803",
            "sentiment_compound": 0.0
        },
        {
            "id": "he1vzu2",
            "score": 1,
            "text": "Warren is a fucking loser",
            "title_similarity": "0.14553791",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hfcwpfe",
            "score": 1,
            "text": "Abortion is a LOSING issue for the Right, because even sensible Right-wing women at the end of the day, will object to some man telling them what they can or cannot do with their bodies. While the same said men's wives, girlfriends, children and mistresses will continue to have access to it? It's all about CONTROL and has very little to do with \"God\", \"Saving children\", etc. Just another con to gain political or religious CONTROL.",
            "title_similarity": "0.6361912",
            "sentiment_compound": 0.2885
        },
        {
            "id": "hpl9dhg",
            "score": 1,
            "text": "According to the Texas law, the person being sued cannot get their attorneys fees back, even if they prevail. Lets sue everyone in Texas and make them prove their innocence in court. If they dont show up, we get our pitchforks and go collect our $10,000! It would grind Texas courts to a halt and effectively make it impossible to sue anyone for this law due to being so far at the back of the line. If we all sued everyone individually, that would amount to 300 million Americans suing all 29 million Texans. That comes to ..... 87 QUADRILLION lawsuits. They would have to go through each one individually to sus out the merits of the case. What do you all think?!",
            "title_similarity": "0.60367703",
            "sentiment_compound": 0.7256
        }
    ]
}