{
    "Biden declares October 11 Indigenous Peoples' Day and says restoring national monuments is the 'easiest thing I've ever done so far as President'\n": [
        {
            "id": "hfz8nyg",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.30212426",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hfzrrxw",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.018709796"
        },
        {
            "id": "hfzusi0",
            "score": -2,
            "text": "Good, now restore Mount Rushmore. We carved those faces just to humiliate native Americans.",
            "title_similarity": "0.4835662",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hfzho2o",
            "score": 11,
            "text": "Okay great, cool, awesome. Now get to work on voting rights legislation, thanks",
            "title_similarity": "0.5739763",
            "sentiment_compound": 0.936
        },
        {
            "id": "hfzslyk",
            "score": 12,
            "text": "'Easiest thing I've done so far as President.'\n\nDoing the right thing can be easy.  Mostly because Republicans weren't involved.",
            "title_similarity": "0.7029085",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hfzuuyj",
            "score": 1,
            "text": "[just gonna leave this here](https://m.youtube.com/watch?v=aRQFli6zMh4)",
            "title_similarity": "0.23373505",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hfz8xb6",
            "score": 42,
            "text": "Not to take the piss out of this, but is it anything more than ceremonial lip service?",
            "title_similarity": "0.29131353",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hfzz7jr",
            "score": -14,
            "text": "Booo add a new paid holiday please",
            "title_similarity": "0.47729385",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hg0m0an",
            "score": -7,
            "text": "Fucking up Afghanistan didn’t seem to be all that difficult for him",
            "title_similarity": "0.37689653",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hfzvvu3",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hfzsmwb",
            "score": 1,
            "text": "I have a coworker who argues for Columbus Day and I ask him “What did Columbus contribute to this country that makes you want to defend his crimes, other than tradition?”\n\nHe comes back with “He discovered America”. I’m not a smart man. And I don’t know if there were other Europeans here before Columbus. But who cares who discovered a piece of rock that much?",
            "title_similarity": "0.5139084",
            "sentiment_compound": 0.4733
        },
        {
            "id": "hg0kcxy",
            "score": -4,
            "text": "Wow great lip service, literally just changing the name of a day some people get off. Too bad we still don’t have Election Day off. You know a day that actually matters.",
            "title_similarity": "0.6153338",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hfzog3d",
            "score": -27,
            "text": "Yeah. Probably cause he hasnt done shit.",
            "title_similarity": "0.28324366",
            "sentiment_compound": 0.6278
        },
        {
            "id": "hg051ze",
            "score": -4,
            "text": "Biden is the best",
            "title_similarity": "0.45215482",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfzso00",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "-0.005639661"
        },
        {
            "id": "hg0xhna",
            "score": 1,
            "text": "Columbus Day is about celebrating the achievements of Italian-Americans. Generally speaking we treated Italians poorly, so America decided give them a holiday for it. We did the same for the Irish, Mexicans, and Blacks in one way or another as well (I'm not comparing the severityof the bad treatment, just saying that it happened). Frankly, I'm all about giving federal holidays to remember our national triumphs and failures, but we don't need to replace one with another. If you want to celebrate or honor indigenous people, try doing it on one of the 354 days that aren't already a national holiday, maybe one that has some significance to them. Putting the two days on the same day just upsets Italian-Americans, and sends the message that natives are only defined as the shitty treatment they have received for the last 500ish years.",
            "title_similarity": "0.555789",
            "sentiment_compound": 0.9161
        },
        {
            "id": "hg0uwtp",
            "score": -4,
            "text": "What's hilarious is the same argument against the Confederate lovers in the South is completely ignored in regards to Indigenous people. Majority of those tribes were at war with the US and LOST. We make fun of the the Confederate folks for praising the losers when the majority of tribes were losers too.",
            "title_similarity": "0.3794471",
            "sentiment_compound": -0.7119
        },
        {
            "id": "hg01o53",
            "score": 1,
            "text": "Can we get back to student loan forgiveness please? :(",
            "title_similarity": "0.2782988",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg17v7n",
            "score": 0,
            "text": "Columbus was a genius, his innovative navigating techniques allowed him to do what no man had done successfully before, cross an ocean and make it back. This puts him on par with Steve Jobs and Bill Gates for world changing innovations, Now, it is also true that he was a medieval fuck who went medieval on the natives, but in his defense he was LITERALLY born in medieval times. The concept of Peace love and understanding would not even be thought of for another 400 + years \n\nAnd the natives were not angles living in a utopian paradise.. They spent plenty of time killing each other way before he showed up",
            "title_similarity": "0.63626516",
            "sentiment_compound": 0.9337
        },
        {
            "id": "hfzl6g8",
            "score": 4,
            "text": "Is this a paid holiday? Because that's what is ultimately important here.",
            "title_similarity": "0.41438675",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hg0c3lc",
            "score": 2,
            "text": "Cool, now cancel student debt",
            "title_similarity": "0.3539651",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg0sz6e",
            "score": 1,
            "text": "Yeah I don't have much sympathy for natives. I knew a lot in Southern Mexico and while many were great, humble people, the culture as a whole was very violent, mysoginist, and racist. They were constantly murdering each other and selling their women like property. By far the most mysoginist culture I've ever seen firsthand. And the government protects their shitty behavior on the grounds that they are indigenous. \n\nAgain, they aren't all bad by any means—but we tend put indigenous people on a pedestal.",
            "title_similarity": "0.46416074",
            "sentiment_compound": -0.7394
        },
        {
            "id": "hg0evgj",
            "score": -6,
            "text": "What is the definition of indigenous? Because technically everyone is indigenous given a short enough time frame and nearly no one is given a long enough one.",
            "title_similarity": "0.49227828",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg1t9eo",
            "score": -2,
            "text": "Clearly the highest of priority. This is just virtue signaling and the left will fall for it just like the right fell for the ones Trump did.",
            "title_similarity": "0.53259516",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hfzezcv",
            "score": -18,
            "text": "Cool. Now push for something meaningful to make up for the displacement and marginalization of indigenous people. Start with giving back land and allowing the option of full sovereignty.",
            "title_similarity": "0.41506737",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hg17u0y",
            "score": -8,
            "text": "This is the stupidest thing I've ever heard.....it Columbus Day and always will be.....",
            "title_similarity": "0.5366441",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hg0nn3j",
            "score": 5,
            "text": "If listen carefully, you can hear the cries of thousands of GOP members. Or you can just go to r/conservative and read the crying",
            "title_similarity": "0.26053816",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hg039f1",
            "score": 0,
            "text": "Here Biden goes again trying to install communism and taking away my freedoms.\n\nEdit: Little concerned some people might take this seriously.../s",
            "title_similarity": "0.31964594",
            "sentiment_compound": 0.296
        },
        {
            "id": "hg1s3a5",
            "score": 0,
            "text": "So easy it only took 9 months",
            "title_similarity": "0.51791656",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hg2tko0",
            "score": 0,
            "text": "But when will he actually put money towards minorities ? Or do something actually meaningful? He took away MILLIONS of dollars from the black college fund. It’s all for optics, they don’t care about you",
            "title_similarity": "0.49673605",
            "sentiment_compound": 0.8229
        },
        {
            "id": "hfzuei4",
            "score": -2,
            "text": "This is the first and only time I have ever agreed with biden on something. Giving Columbus the boot was the right thing to do.",
            "title_similarity": "0.6809325",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hfzw617",
            "score": -3,
            "text": "Well, they got a national day of recognition just like tacos and donuts. Problem solved. /s\n\nI'm curious how indigenous people feel about this but I know that in their place I'd find it borderline offensive in the way it prioritizes the appearance of doing anything meaningful over doing anything actually meaningful.",
            "title_similarity": "0.46826878",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hg1etgp",
            "score": -3,
            "text": "the easiest thing he’s done is raise the gas prices",
            "title_similarity": "0.6363264",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfztkfr",
            "score": 3,
            "text": "The most interesting thing, to me, is that we've all heard how atrocious Columbus was, and all the horrible things he did.\n\nBut the fact is, he wasn't even a skilled navigator. He assumed the Americas didn't exist, which is a fine assumption, but if he had been correct, there is no chance his ships could've reached Asia with the supplies he brought. He underestimated the distance by like 2/3. Every other sailor at the time knew it was a dumb idea to try and get from Europe to Asia by going west, using the technology they had at the time. He also lied in his reports and claimed to the be the first person to spot land during the voyage, which he was not (it was one of his crew). \n\nHe seriously wasn't that good at his job. Even if you could set aside that he was a total piece of garbage, I don't know how you avoid noting he wasn't that great a sailor. He went to his grave insisting he had found Asia, even though all his contemporaries understood this was a completely different continent.",
            "title_similarity": "0.4683544",
            "sentiment_compound": -0.9706
        },
        {
            "id": "hg0q3h9",
            "score": 1,
            "text": "This president is the best at doing the absolute minimum.",
            "title_similarity": "0.6188531",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hg0zmy3",
            "score": 0,
            "text": "What an amazing empty gesture to distract from that jobs report",
            "title_similarity": "0.3887333",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hg1a7hj",
            "score": -1,
            "text": "Typical US politics, its nothing more that a token gesture, throw them a bone and hope to shut them up for a bit while looking like a saint in the process. Also stop focusing on Columbus, yes he was probably a vial human, but he lived and died hundreds of years ago and anything he did absolutely pales in comparison to what US troops have done within our lifetime.\n\nIts just more propaganda that you're all lapping up, keep mentioning 'the evil European colonizers' so that when the average American thinks of Europe that's what they first think of and not countries that are far superior to the USA, anything to keep the dream alive though right....",
            "title_similarity": "0.49172398",
            "sentiment_compound": -0.3269
        },
        {
            "id": "hfzudhg",
            "score": 5,
            "text": "Fantastic!  Hey, by the way, how’s that health care reform coming along?",
            "title_similarity": "0.4321798",
            "sentiment_compound": 0.7959
        },
        {
            "id": "hg02u8b",
            "score": 5,
            "text": "I’m sure this helps our people out so the white liberals can pat themselves on the back and call it a day",
            "title_similarity": "0.6277426",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hg0iae4",
            "score": -7,
            "text": "What a scum bag fuck Biden more useless than Trump and Trump was shit",
            "title_similarity": "0.311298",
            "sentiment_compound": -0.8805
        },
        {
            "id": "hg0fy4r",
            "score": 2,
            "text": "Trudeau already did this in Canada and it backfired. Natives are not a new tasty snack, side dish, or different flavor for when black lives matters and feminist propaganda looses its zing. They honestly are different, they have different values and traditions, and its not suppose to be treated as an amusement park, circus, or free buffet, and their garments are not a yellow vest you can throw on because you have an 1/8 of BS somewhere down the line. Theyve always been here, but now that theyre being put on display for it just goes to show who politicians are dowsing in blood before throwing into shark infested waters. It turns them into clowns and theyre not really cool with it, nor are they interested in pity parties for others to look down on them for.\n\nJust giving a heads up to all the yanks that think riding different races for blood drama is a fun idea. It causes more problems than solves any, and its seen for being something done out of boredom, which lets be honest, is exactly what this hype is about. Look up \"Hanky Panky\" painting, and consider Biden in Trudeau's shoes for pulling the same sh*t.",
            "title_similarity": "0.46413636",
            "sentiment_compound": 0.8482
        },
        {
            "id": "hg1ales",
            "score": 2,
            "text": "Somewhere Elizabeth Warren is thrilled.  The 1/10000 Native American in her is finally being rewarded.",
            "title_similarity": "0.6749798",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hg0432m",
            "score": -1,
            "text": "Let me guess. They will halt trading on that day. In an attempt to delay the crash.",
            "title_similarity": "0.2608933",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hg0iry7",
            "score": -1,
            "text": "Wouldn't it make sense to make it a different day?  He still proclaims it as Columbus Day as well.  \n\nI am not native American, but I would think I would prefer a day just for remembering my people and opposed to sharing it.  \n\nCurious what others think.",
            "title_similarity": "0.46398693",
            "sentiment_compound": 0.802
        },
        {
            "id": "hg0kid2",
            "score": 3,
            "text": "Yeah, because it’s purely symbolic. Of course it was easy.",
            "title_similarity": "0.47444314",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg0tzub",
            "score": 1,
            "text": "As a Native American fuck indigenous ppl day.\n\nwhat a load of shit",
            "title_similarity": "0.36782616",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hg1ezsc",
            "score": -1,
            "text": "\"We want to end oppression\"\n\"Best I can do is a federal holiday\"",
            "title_similarity": "0.56085294",
            "sentiment_compound": 0.802
        },
        {
            "id": "hg0gpzx",
            "score": -12,
            "text": "Liberals “we don’t celebrate losers” also liberals",
            "title_similarity": "0.44373822",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hfzxzmf",
            "score": 0,
            "text": "He should pull a Trudeau and go surfing",
            "title_similarity": "0.27971655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg02u8c",
            "score": 0,
            "text": "Yes. This is the real issue that needs fixing",
            "title_similarity": "0.18684597",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg0apcy",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg0hmtt",
            "score": 0,
            "text": "Biden going to Tofino this weekend then?",
            "title_similarity": "0.28097045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0i143",
            "score": 0,
            "text": "once again \n\nhttps://youtu.be/ZEw8c6TmzGg",
            "title_similarity": "0.22114739",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0kq8v",
            "score": 0,
            "text": "Does anyone know why Obama refused to do this?",
            "title_similarity": "0.30205008",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg1g4ux",
            "score": 0,
            "text": "More like the only thing he’s done as president.. I can’t believe I actually wanted him in office. Talk about a massive disappointment. \nBut… yay statues right?",
            "title_similarity": "0.6137494",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hg1lujc",
            "score": 0,
            "text": "What a great guy!",
            "title_similarity": "0.351623",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hg1u97y",
            "score": 0,
            "text": "Let’s go Brandon !",
            "title_similarity": "0.15737358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzpqt3",
            "score": -29,
            "text": "So do the Italian-Americans get a new holiday to show our appreciation of them... since that was kind of the point of Columbus Day?",
            "title_similarity": "0.50379205",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hfzdxub",
            "score": -10,
            "text": "I was thinking October 11th jmshould just be nothing. \n\nMake Thanksgiving an official Indigenous People's Day and the day after be an immigrant celebration day. Not just pilgrims or the English, but everyone including today's immigrants. Everyone gets a holiday, 4 day weekend. Plus Indigenous people get to call the immigrant holiday \"black friday\".",
            "title_similarity": "0.6305619",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hfzp5i7",
            "score": 2,
            "text": "Do we finally get it off from work again, then?",
            "title_similarity": "0.19573632",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg18lgl",
            "score": -1,
            "text": "Still calling it COLUMBUS DAY.",
            "title_similarity": "0.35047334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg21zhu",
            "score": -1,
            "text": "He's letting a foreign company destroy my family's reservation's wild rice supply and pollute their wetlands while jailing protestors as we speak. But sure is an easy gesture to make.",
            "title_similarity": "0.42153713",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hg1ctnc",
            "score": -5,
            "text": "You could say “the only thing I’ve ever done so far as president”",
            "title_similarity": "0.62799895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg036w9",
            "score": -25,
            "text": "Ah so just fuck italian americans then? Seem like the majority of people in this thread have no idea why Columbus day was created in the first place. No it was not to honor Columbus. It was to help stop the hatred towards italian americans.",
            "title_similarity": "0.34727818",
            "sentiment_compound": -0.8752
        },
        {
            "id": "hfzmqz1",
            "score": 27,
            "text": "I'm getting mixed messages...\n\n>NOW, THEREFORE, I, JOSEPH R. BIDEN JR., President of the United States of America, do hereby proclaim October 11, 2021, as Columbus Day.\n\nhttps://www.whitehouse.gov/briefing-room/presidential-actions/2021/10/08/a-proclamation-on-columbus-day-2021/\n\n>NOW, THEREFORE, I, JOSEPH R. BIDEN JR., President of the United States of America, do hereby proclaim October 11, 2021, as Indigenous Peoples’ Day.  \n\nhttps://www.whitehouse.gov/briefing-room/presidential-actions/2021/10/08/a-proclamation-indigenous-peoples-day-2021/",
            "title_similarity": "0.55593216",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hg032sw",
            "score": -1,
            "text": "Can we get rid of some of our bs identarian holidays and just get more pto",
            "title_similarity": "0.4236841",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hg04hbg",
            "score": -1,
            "text": "I feel like this is better than anything Canada ever did, and it seems sincere too, not just political to look good.",
            "title_similarity": "0.65434915",
            "sentiment_compound": 0.875
        },
        {
            "id": "hg0503f",
            "score": 1,
            "text": "More things that make it look like he's doing something that actually doing something.",
            "title_similarity": "0.12939861",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hg05ch6",
            "score": -1,
            "text": "Now just get back to the agenda of forgiving student debt, so our generation and future generations don’t have to choose between starting off $60+k in debt or having a shit job that doesn’t pay enough to pay the rent.",
            "title_similarity": "0.51056534",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hg088xv",
            "score": -1,
            "text": "sounds like it'll be the easiest undone as well",
            "title_similarity": "0.47147077",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hg0erk8",
            "score": 1,
            "text": "This is nothing to me. I'm sure that it means a lot to others which is fine but I'm still waiting for criminals to go to jail.\n\nSTILL WAITING FOR T HE COUP MAN TO GO TO JAIL.\n\nStill waiting.  Giving people a day is nothing.  A single day? Out of 365 days? Seriously?  That's it?\n\nthat's all they get?\n\nWOW.",
            "title_similarity": "0.4366963",
            "sentiment_compound": 0.7438
        },
        {
            "id": "hg0hhsa",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.018709796"
        },
        {
            "id": "hg0ilmv",
            "score": 1,
            "text": "Biden baby, you know me.",
            "title_similarity": "0.3167571",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0j4jv",
            "score": -1,
            "text": "it would be great if he listened to indigenous people about line 3",
            "title_similarity": "0.43543747",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg0of9v",
            "score": -1,
            "text": "Now we need leif erikson day, the actual motherfucker who stepped foot on this continent",
            "title_similarity": "0.47018266",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hg0ous8",
            "score": -1,
            "text": "Well al least one thing was easy for joe",
            "title_similarity": "0.38956207",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hg10ovy",
            "score": 1,
            "text": "Fact that the media and Reddit hate because we love in a 1984 nightmare: Columbus Day in America started, more or less, as a way for Italian Americans to gain acceptance. The only reason Columbus is such a symbol of \"white people\" is, ironically, that Italian Americans were so successful that they are now considered \"white people\" so now their culture and history can be painted over as \"white supremacy\".\n\nhttps://en.m.wikipedia.org/wiki/Columbus_Day\n\nDefeating Columbus Day has nothing whatsoever - beyond lip service and confusion and lies - to do with white supremacy, and in fact, in many ways is erasing a whole lot of cultural history that was intended to fight racism and bigotry to begin with!\n\nYay living in 1984!",
            "title_similarity": "0.57553",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hg14hxj",
            "score": 1,
            "text": "How many pipelines are currently under construction going through native land again?",
            "title_similarity": "0.36553735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg15v3k",
            "score": 1,
            "text": "Happy COLUMBUS DAY 😃.... was, is, and always will be👍 sorry, you can’t change history.",
            "title_similarity": "0.600983",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hg17wbg",
            "score": 1,
            "text": "Well why not. Today is Leif Erickson Day.",
            "title_similarity": "0.4687901",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hg18b1f",
            "score": 1,
            "text": "Virtue signaling is free and easy",
            "title_similarity": "0.44021243",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hg18fz6",
            "score": 1,
            "text": "This “nice little gesture” is not enough to save Sleepy Joe post-Afghanistan.",
            "title_similarity": "0.36334938",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hg1ci4k",
            "score": -1,
            "text": "Because he has done nothing but harm during his presidency?",
            "title_similarity": "0.6226109",
            "sentiment_compound": 0.5824
        },
        {
            "id": "hg1e26c",
            "score": -1,
            "text": "Pretty sure it’s been even easier for him to ignore literally every major problem in the US.",
            "title_similarity": "0.5850061",
            "sentiment_compound": 0.4228
        },
        {
            "id": "hg1eisn",
            "score": 1,
            "text": "I thought the easiest thing he did was get away with groping and huffing kid’s pheromones",
            "title_similarity": "0.4337244",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg1k83r",
            "score": -1,
            "text": "Yeah. That bad ass bad to the bone approval rating says this dude is as bad as DJT lmao",
            "title_similarity": "0.268356",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hg1mc3g",
            "score": -1,
            "text": "maybe this will make up for the 38% approval rating and the government running out of money lmao",
            "title_similarity": "0.44892502",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hg1yoxk",
            "score": -1,
            "text": "Biden was VP when the cops he militarized tear gassed Standing Rock because Natives were protesting construction of an oil pipeline that went on to poison their land. The fact that everyone is choosing to have a goldfish brain in order to celebrate such an empty gesture is disgusting.",
            "title_similarity": "0.3963091",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hg27v2c",
            "score": -1,
            "text": "What’s funny is the top comment is talking about how Columbus was terrible human being but in reality we have absolutely terrible human beings doing terrible things on a scale we’ve never seen before and this is what we are worried about.\nEdit: there is not much difference between R and D, D just slaps a band aid on the crumbling dam with writing on that says “I hear you.”",
            "title_similarity": "0.413184",
            "sentiment_compound": -0.905
        },
        {
            "id": "hg28mkd",
            "score": -1,
            "text": "Love this for my people, hate this fucking President tho",
            "title_similarity": "0.51204413",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg2993f",
            "score": -1,
            "text": "The senile dude should work on getting Americans out of Afghanistan.",
            "title_similarity": "0.3889581",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg2ab6e",
            "score": -1,
            "text": "Congratulations Elizabeth Warren ❤️❤️",
            "title_similarity": "0.3773898",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hg2e19t",
            "score": -1,
            "text": "He did it because it was easy. If it cost him anything, he wouldn't have done it.",
            "title_similarity": "0.46655586",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg2sxvq",
            "score": -1,
            "text": "I mean leaving all that military stuff behind was pretty easy too.",
            "title_similarity": "0.5128747",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hg3b9se",
            "score": -1,
            "text": "The easiest thing Biden has done is destroy our economy and country! It must be real easy to leave Americans behind enemy lines",
            "title_similarity": "0.5980849",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hg0hwrf",
            "score": -7,
            "text": "I thought it was wrong to support the losing team?",
            "title_similarity": "0.21177465",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hg0i6i0",
            "score": -11,
            "text": "Just behind letting the Taliban take all of our weapons and vehicles eh Joe? You made that look pretty easy too 😂",
            "title_similarity": "0.58212984",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hg0kbtd",
            "score": -9,
            "text": "Happy Columbus Day!",
            "title_similarity": "0.46805486",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hfzvjoq",
            "score": -12,
            "text": "“Easiest thing I’ve done so far” \n\nNo shit you aren’t getting anything done and this doesn’t even change the national holiday.",
            "title_similarity": "0.6454477",
            "sentiment_compound": 0.7324
        },
        {
            "id": "hfzztkh",
            "score": 12,
            "text": "Yet he allows pipelines to continue to flow through indigenous lands",
            "title_similarity": "0.34966284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzxpu4",
            "score": 4,
            "text": "One victory for us, now we have to rebuild our communities with positivity instead of this land back bullshit. Every culture has been conquered since the beginning of time, it’s about how we grow back and have people see us like equals and that we actually exist.",
            "title_similarity": "0.6375343",
            "sentiment_compound": 0.25
        },
        {
            "id": "hg03lsy",
            "score": 4,
            "text": "We reached the front page of Reddit, let’s see if we can get this shit to the mainstream.  It’s horrible and barely mentioned on any news sites.  The trauma was just a generation away.\n\nUp to 40,000 Native American kids may have died at government schools https://www.dailymail.co.uk/news/article-9712255/Native-Americans-decry-unmarked-graves-untold-history-boarding-schools.html?ito=native_share_article-top",
            "title_similarity": "0.49029195",
            "sentiment_compound": -0.9294
        },
        {
            "id": "hg0iq9x",
            "score": 5,
            "text": "Something trump would never do",
            "title_similarity": "0.22016323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg18hps",
            "score": -4,
            "text": "No, it's Columbus Day",
            "title_similarity": "0.41298455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg191p7",
            "score": -4,
            "text": "It will always be Columbus Day, Bidens handlers got their way.. too bad they couldn't create a separate holiday. They had to undo a tradition created by Italian American Catholics just to be social justice warriors.",
            "title_similarity": "0.5537615",
            "sentiment_compound": 0.4188
        },
        {
            "id": "hg1bpov",
            "score": -3,
            "text": "Still calling it Columbus Day.",
            "title_similarity": "0.35047334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1t7hs",
            "score": -3,
            "text": "It will always be Chris C day for me. Sorry not sorry",
            "title_similarity": "0.531774",
            "sentiment_compound": -0.0201
        },
        {
            "id": "hg1ujyo",
            "score": -5,
            "text": "As easy as fucking up Afghanistan? Hahah \nhe’s a flop.",
            "title_similarity": "0.4573719",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg1vxii",
            "score": -4,
            "text": "I swear people are so easy to please.\n\nLiberals love to placate but never actually solve anything.  They constantly pick the worst solution and then are amazed it never helped.",
            "title_similarity": "0.5172663",
            "sentiment_compound": 0.6558
        },
        {
            "id": "hfzskrq",
            "score": -8,
            "text": "Hooray, we get a day... in 2021\n\n... and most other groups get a full month.\n\nThanks?",
            "title_similarity": "0.50610983",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hfzshx0",
            "score": 6,
            "text": "Do something about the Line 3 pipeline then. Stop with the oil drilling in general.",
            "title_similarity": "0.2634189",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg0nvni",
            "score": -4,
            "text": "Probably the only thing he’s done as president",
            "title_similarity": "0.5843812",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0u1v3",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg1fj2d",
            "score": -5,
            "text": "Collapsing an entire country’s Government must be exhausting for poor Joe.",
            "title_similarity": "0.31601062",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hfzw92m",
            "score": 2,
            "text": "Lief Ericsonsons Day.",
            "title_similarity": "0.30805647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzyo1x",
            "score": -3,
            "text": "Are they gonna un-bomb Mount Rushmore?",
            "title_similarity": "0.3138972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzziam",
            "score": -1,
            "text": "So what about Mount Rushmore then?? \n\nComplete bullshit statement from the president. Better than trump sure but let’s not kid ourselves",
            "title_similarity": "0.5570457",
            "sentiment_compound": 0.1431
        },
        {
            "id": "hg037bb",
            "score": -3,
            "text": "IF YOU THINK WHITE PEOPLE SHOULD OWN THIS COUNTRY... FUCK YOU\n\n-the Whitest kid u know... lol",
            "title_similarity": "0.50747967",
            "sentiment_compound": -0.347
        },
        {
            "id": "hg03fe7",
            "score": 0,
            "text": "Its the easiest to do because really, it accomplishes *nothing* there are no real benefits.",
            "title_similarity": "0.44534394",
            "sentiment_compound": 0.6686
        },
        {
            "id": "hg0494c",
            "score": -2,
            "text": "What an absolute spit in the face to Italian Americans.",
            "title_similarity": "0.21117863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg05690",
            "score": 2,
            "text": "And today is Leif Erikson Day!",
            "title_similarity": "0.44056165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg070i7",
            "score": 3,
            "text": "I'm sorry politics aside this is a great step forward, Columbus represented everything America is not and I strictly remember growing up them teaching me as a kid how the pilgrims came over from Europe and shared food and had a Thanksgiving meal with the native population peacefully. It horrified me that I was taught that and it is inherent lying and manipulation to be teaching our kids and glorifying such atrocities when all historians will agree Columbus was an awful man.",
            "title_similarity": "0.4913528",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg082aw",
            "score": -2,
            "text": "why is it not on November 25th ?  Its time everyone stopped celebrating something that never happened. The indigenous people of north america did not welcome the invading pale faces. They did not provide a giant feast for them. Their food was stolen by the pale faces. And they were murdered. Since I was a kid, my close friend has always called it \"Happy small pox blanket day\"!",
            "title_similarity": "0.46783274",
            "sentiment_compound": -0.171
        },
        {
            "id": "hg0kbu1",
            "score": -2,
            "text": "Still can’t cap drug prices of legalize weed tho\n\n\nWorthless man \n\nOr maybe he’ll do it near Election Day so he can win easily? Lol",
            "title_similarity": "0.4687428",
            "sentiment_compound": 0.7479
        },
        {
            "id": "hg0ocmn",
            "score": -3,
            "text": "This isn’t the slam dunk he thinks it is",
            "title_similarity": "0.12596518",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hg0r9pu",
            "score": -2,
            "text": "Is this the only thing he is doing?",
            "title_similarity": "0.16434208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0rcje",
            "score": -2,
            "text": "Honestly, they should have changed “Columbus Day” to “Italian American Day” because that’s basically what it was anyway. Nobody actually celebrates Christopher Columbus with parades. It’s celebrating Italian heritage, which is why so many people feel a since of ownership over this holiday and are against changing it. This move essentially just takes a holiday from one ethnicity and gives it to another, but it’s okay because the one getting jacked here is white people /s",
            "title_similarity": "0.50053084",
            "sentiment_compound": 0.8739
        },
        {
            "id": "hg0tahd",
            "score": -1,
            "text": "Lol, I bet jacking up the price of insulin by 800% was real easy",
            "title_similarity": "0.6328546",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hg1cwrl",
            "score": -2,
            "text": "Just say Indian day",
            "title_similarity": "0.32530725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1dhp2",
            "score": -2,
            "text": "If you believe in Natural Selection and survival of the fittest then the USA, and major European Powers did nothing wrong. That native peoples were inferior and were wiped out due to their inability or unwillingness to adapt to a changing world. And Smallpox.  \n\n\nDances with wolves is one of my favorite movies though.",
            "title_similarity": "0.5563842",
            "sentiment_compound": 0.3927
        },
        {
            "id": "hg1f8nm",
            "score": 2,
            "text": "About time!!! \n\nAs a school kid in the 90’s, I was taught so many lies about Columbus and then as I started homeschooling my kids, I was shocked to find how many lies I was taught. \n\nColumbus was an evil man and should not have a day recognizing him. \n\nThis is a huge moment for America and I hope everyone can appreciate it. It can’t fix what happened in the past, but it is a way to honor and recognize the native Americans and their history, bring them pride, recognition and awareness of the authorities their ancestors faced due to colonization.",
            "title_similarity": "0.5036613",
            "sentiment_compound": 0.7534
        },
        {
            "id": "hg1p9z2",
            "score": -2,
            "text": "Yeah, declaring days and creating statues to buy people off does sound easy",
            "title_similarity": "0.596955",
            "sentiment_compound": 0.743
        },
        {
            "id": "hg1wz74",
            "score": -3,
            "text": "Yea, natives want monuments and not their land back. Dems. 😒🙄",
            "title_similarity": "0.4002",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hg21mnt",
            "score": -3,
            "text": "Tony Soprano would not be pleased.",
            "title_similarity": "0.11835662",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hg2ombj",
            "score": -2,
            "text": "Fuck Joe Biden",
            "title_similarity": "0.17550993",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hg3b5fm",
            "score": -2,
            "text": "Actually, Trump declared this last year.",
            "title_similarity": "0.5044601",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0l4x6",
            "score": -9,
            "text": "I thought losers don't get awards...",
            "title_similarity": "0.27488035",
            "sentiment_compound": -0.7077
        },
        {
            "id": "hfzpt5w",
            "score": -18,
            "text": "It’s funny how some white women think they’re part of the indigenous people.",
            "title_similarity": "0.38816077",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfzvu43",
            "score": -3,
            "text": "Isnt is the official day of Columbus day the 12th tho? Why change the day",
            "title_similarity": "0.44707024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzvwxc",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg0341e",
            "score": 2,
            "text": "Cool now tear down Mount Rushmore",
            "title_similarity": "0.3542526",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hg0cbuj",
            "score": -4,
            "text": "Indigenous people who actually migrated from East Asia.",
            "title_similarity": "0.2067017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0ma18",
            "score": -3,
            "text": "Why does it have to be on the day celebrating my Italian heritage? having a day to celebrate Ingenious People sounds great, but why erase the celebration of my heritage in the process?",
            "title_similarity": "0.5098716",
            "sentiment_compound": 0.7657
        },
        {
            "id": "hg0nsee",
            "score": -3,
            "text": "What else has he accomplished in 10 months?  Is this the big tent pole accomplishment he's going to run on in 2024?",
            "title_similarity": "0.5169616",
            "sentiment_compound": 0.504
        },
        {
            "id": "hg0p42t",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg0ru77",
            "score": -3,
            "text": "Indigenous Peoples' Day is a nonsensical idea for a holiday. What event are you celebrating? What's the theme? Not that Columbus day is any better. So I guess it doesn't matter, you are replacing one stupid holiday with another one.\n\nI think we should just lean into the whole Columbus thing and change it to national pirate day, and everybody can dress up as pirates and drink ale.",
            "title_similarity": "0.54519486",
            "sentiment_compound": 0.8354
        },
        {
            "id": "hg1akwn",
            "score": -3,
            "text": "Edit:\nBiden declares October 11 Indigenous Peoples' Day and says restoring national monuments is the 'only thing I've ever done so far as President'",
            "title_similarity": "0.90063965",
            "sentiment_compound": 0.296
        },
        {
            "id": "hg1gjlx",
            "score": -4,
            "text": "WRONG! Easiest thing he’s done was destroying our country!",
            "title_similarity": "0.48153055",
            "sentiment_compound": -0.7365
        },
        {
            "id": "hg1hp0y",
            "score": -2,
            "text": "Anything to get the peoples attention off the fact that we have an incapacitated degenerate for a president. \nHow did we come to this?..",
            "title_similarity": "0.41291904",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hg1ibat",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg1mgud",
            "score": -2,
            "text": "Biden also confirmed later that it was also his first coherent thought for the month of october.",
            "title_similarity": "0.50515527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg20dzt",
            "score": -4,
            "text": "The only good thing he’s done so far lol",
            "title_similarity": "0.48296058",
            "sentiment_compound": 0.7165
        },
        {
            "id": "hg25cj2",
            "score": -3,
            "text": "This is Biden’s way of sayin “hey I fucked up the border, i fucked up the afghan retreat, i fucked up our oil prices, i fucked up with vaccine mandates, i fucked with increased crime, and im gonna fuck up whole lot more just like when obama told you guys not to underestimate me in fucking up things. But hey, here’ a lolly. Come on man, cheer up there a lot more fucking up to do.” And the liberals and democrats celebrate it.",
            "title_similarity": "0.46845317",
            "sentiment_compound": -0.2997
        },
        {
            "id": "hg28nl5",
            "score": -3,
            "text": "Clearly. Because the hardest thing for him has been to stop sniffing little kids and fighting his arch enemy, the Teleprompter.",
            "title_similarity": "0.31400907",
            "sentiment_compound": -0.6412
        },
        {
            "id": "hfzw6tp",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hfzw0g4",
            "score": -25,
            "text": " Biden is a clown",
            "title_similarity": "0.2226942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0fdw7",
            "score": 8,
            "text": "I don’t like Biden, but I have more respect for him now",
            "title_similarity": "0.30994496",
            "sentiment_compound": 0.7461
        },
        {
            "id": "hg1pne7",
            "score": -8,
            "text": "Biden is a joke",
            "title_similarity": "0.112483576",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfzxmxs",
            "score": 0,
            "text": "If he actually wanted to help indigenous people, he'd be fighting tooth and nail for voting rights reform to stop Native Americans from being broadly disenfranchised in GOP states. But all we hear on that is crickets.",
            "title_similarity": "0.41230935",
            "sentiment_compound": -0.128
        },
        {
            "id": "hfzy3ed",
            "score": -5,
            "text": "Thanks Biden we’re looking forward to millions of tourist and busses in bears ears!",
            "title_similarity": "0.44086748",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hfzzo5j",
            "score": 3,
            "text": "Columbus Day is for people who say \"I'd kill for a day off of work\". Indigenous People's Day is for people who say \"I'd rather be dead than go to work today\".",
            "title_similarity": "0.45806813",
            "sentiment_compound": -0.875
        },
        {
            "id": "hfzzpfi",
            "score": 0,
            "text": "> Christopher Columbus, the Pilgrims, and colonial imperialists committed biological warfare against indigenous people with sars blankets, etc\n\n> germs are discovered in 1860",
            "title_similarity": "0.2744824",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hg02aav",
            "score": 0,
            "text": "Are we stuck in a South Park episode again??",
            "title_similarity": "0.13395292",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hg02lcn",
            "score": 0,
            "text": "Sureal.",
            "title_similarity": "0.21948193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg064ra",
            "score": 0,
            "text": "Honest question. Where does this leave Italian Americans? That was always our holiday. Not saying indigenous groups shouldn't get their day and that Columbus shouldn't be the focus of an Italian American holiday it just feels like we're getting the short straw with this decision",
            "title_similarity": "0.5185932",
            "sentiment_compound": 0.8735
        },
        {
            "id": "hg0721g",
            "score": -4,
            "text": "Great, now deliver on the rest of your fucking campaign promises you senile fuck",
            "title_similarity": "0.3280884",
            "sentiment_compound": 0.539
        },
        {
            "id": "hg07dp0",
            "score": 0,
            "text": "If this was the \"easiest thing [he's] ever done so far as President\" why did it take 9 months?  Bears Ear could have been restored in January. \n\nBetter late than never, though.  I'll take what I can get.",
            "title_similarity": "0.7441225",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hg080g2",
            "score": 5,
            "text": "Any ideas how the trump Christian evangelical racist republikkkans will complain about this?",
            "title_similarity": "0.3531921",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hg0brtf",
            "score": 4,
            "text": "Good! There shouldn't have ever been a \"Columbus Day\" in the first place. He was a murdering, maniacal rapist that didn't \"discover\" anything!!!",
            "title_similarity": "0.41135788",
            "sentiment_compound": -0.8679
        },
        {
            "id": "hg0bzp7",
            "score": -4,
            "text": "Probably the easiest because he doesn't have to give any complicated speeches, the ancient lich skin bag he is.",
            "title_similarity": "0.5540071",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg0dzvt",
            "score": -5,
            "text": "But isn't removing Columbus day a slap to the Italian Americans.\nThey were treated very bad as was the Irish and that is one of the reasons why the holiday was crafted",
            "title_similarity": "0.3613316",
            "sentiment_compound": -0.1875
        },
        {
            "id": "hg0mjq6",
            "score": -5,
            "text": "Lol he bragged about doing the bare minimum",
            "title_similarity": "0.38802564",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg0uml6",
            "score": 0,
            "text": "Oh was it? Was it the easiest thing ever, so fucking easy it took you 6 months to write on a piece of paper?\n\nThis is honestly pissing me off more than it should, this guy is taking his sweet ass time on *everything,* even the easiest shit he could have done Day 1. This is nuts man. It's a bittersweet victory. I'm glad it happened but what in the actual fuck is taking this guy so long to do any of this shit?",
            "title_similarity": "0.66892755",
            "sentiment_compound": -0.8841
        },
        {
            "id": "hg0wpgz",
            "score": 0,
            "text": "But he can’t get sinema and manchin to vote on the infrastructure bill 🤦‍♂️smh",
            "title_similarity": "0.27005845",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0yiae",
            "score": 0,
            "text": "Easiest things he's done, of course it is Biden because you didn't have to do anything, there wasn't a master plot no one to pay off and surely no master class on it, that should have never been anything you had to do, the ppl that helped destroy them should have been fixing them, like the white person scrubbing paint off Floyd wonders monument!",
            "title_similarity": "0.6355163",
            "sentiment_compound": -0.1007
        },
        {
            "id": "hg110f0",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg11lh9",
            "score": 0,
            "text": "I thought October 11 was Columbus day",
            "title_similarity": "0.45677695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg123o6",
            "score": 0,
            "text": "Reparations need to be payed along with the monuments or it’s just performative",
            "title_similarity": "0.28900272",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg155f6",
            "score": 0,
            "text": "Careful, there's still plenty of time to fuck this up.",
            "title_similarity": "0.28444064",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hg156yx",
            "score": 0,
            "text": "Breaking news: Biden drinks water",
            "title_similarity": "0.18038946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg16d07",
            "score": 0,
            "text": "Its also the only thing he has done",
            "title_similarity": "0.3706718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg17c53",
            "score": 0,
            "text": "Bout.....  Fucking...... Time.....",
            "title_similarity": "0.13143618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg19upx",
            "score": 0,
            "text": "They needed their recognition like everyone else as a half Indian kudos but screw Biden he’s screwed our country up fast and hasn’t been a year",
            "title_similarity": "0.5259985",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hg1a367",
            "score": 0,
            "text": "Could of sworn there was a whole month dedicated to indigenous people.",
            "title_similarity": "0.45750508",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hg1b3aw",
            "score": 0,
            "text": "Ughhhh",
            "title_similarity": "0.056826264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1c6np",
            "score": 0,
            "text": "Sweet! Now maybe let’s get Canada to get them drinkable water,  that would be kinda cool, no?",
            "title_similarity": "0.42278707",
            "sentiment_compound": 0.6484
        },
        {
            "id": "hg1elph",
            "score": 0,
            "text": "So we only need one day a year to acknowledge a particular group? Seems okay, this is the kind if thing that will eventually create segregation.\n\nRights and acknowledgement of eachother isn’t something that should get forced, paraded or marketed into a holiday. It’s something or at least something that should be fundamental to the way of life.",
            "title_similarity": "0.60038126",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hg1epj0",
            "score": 0,
            "text": "Good, now make Puerto Rico a god damn state please.",
            "title_similarity": "0.4283365",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hg1fydk",
            "score": 0,
            "text": "Great. Now scrap Columbus Day.",
            "title_similarity": "0.32918516",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg1fymn",
            "score": 0,
            "text": "I'm glad we finally have a day where we can all gather together and be indengnious",
            "title_similarity": "0.53065276",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hg1grha",
            "score": 0,
            "text": "Columbus Day - a lie all my life????\nWhat else is world history deceiving me about???????\n\nDem - Rep - or whoever - gimme the truth for once …….",
            "title_similarity": "0.44087663",
            "sentiment_compound": -0.264
        },
        {
            "id": "hg1h39w",
            "score": 0,
            "text": "Child sacrifice is underrated",
            "title_similarity": "0.15582359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1ikmv",
            "score": 0,
            "text": "One step forward. Hope he takes more action to make right the wrongs of our ancestors.",
            "title_similarity": "0.43734568",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg1inqt",
            "score": 0,
            "text": "It’s odd to celebrate Columbus and Indians in the same day.",
            "title_similarity": "0.40150833",
            "sentiment_compound": 0.34
        },
        {
            "id": "hg1it37",
            "score": 0,
            "text": "We need an Italian appreciation day or something. Columbus day was all we had.",
            "title_similarity": "0.4822669",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hg1jgzl",
            "score": 0,
            "text": "Well I hope he doesn't pull a Trudeau and go on vacation on the inaugural indigenous peoples day.",
            "title_similarity": "0.5074293",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hg1lff2",
            "score": -4,
            "text": "He destroyed America pretty easily 🤷‍♂️",
            "title_similarity": "0.40816164",
            "sentiment_compound": 0.34
        },
        {
            "id": "hg1mkxz",
            "score": 0,
            "text": "Yea he'll do this, but he wont stop line 3.",
            "title_similarity": "0.37637234",
            "sentiment_compound": 0.3252
        },
        {
            "id": "hg1mz6d",
            "score": 0,
            "text": "Now all he needs to do is dismantle the institutions (education, medical, political to name a few) that perpetuate the subjugation/demise/abuse/slaughtering of indigenous people and their culture that we destroyed. Sorry bud but a day ain’t gonna cute it.",
            "title_similarity": "0.33448327",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hg1ubvj",
            "score": 0,
            "text": "Is this a new federal holiday?",
            "title_similarity": "0.38164234",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg1w3fa",
            "score": 0,
            "text": "Is it bad, my first thought was \"pretty funny/appropriate it comes before Thanksgiving\"",
            "title_similarity": "0.46154612",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hg1x0xv",
            "score": -3,
            "text": "Biden is a shitty president",
            "title_similarity": "0.20722592",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hg1xpu1",
            "score": 0,
            "text": "As long as I keep my day off I’m happy",
            "title_similarity": "0.43100464",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hg1y9eb",
            "score": 0,
            "text": "Let's go Brandon!",
            "title_similarity": "0.17010641",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg291y1",
            "score": 0,
            "text": "Can't wait to hear about how this is virtue signaling, and pandering, and liberal wokeness...\n \nBut Columbus Day is totally fine.",
            "title_similarity": "0.6514834",
            "sentiment_compound": 0.5483
        },
        {
            "id": "hg2h3ry",
            "score": 0,
            "text": "Screw you, Simpsons! South Park predicted the future this time!",
            "title_similarity": "0.42319477",
            "sentiment_compound": -0.2462
        },
        {
            "id": "hg2utwt",
            "score": 0,
            "text": "Biden is really a great President. The media hates his no drama style",
            "title_similarity": "0.58420277",
            "sentiment_compound": 0.0717
        },
        {
            "id": "hg3ctm5",
            "score": 0,
            "text": "Great just in time for me to still have work on Monday lol. Fml",
            "title_similarity": "0.48610258",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hg3dpyg",
            "score": 0,
            "text": "r/OffToControversialIgo",
            "title_similarity": "0.085817754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg3r83y",
            "score": 0,
            "text": "Get educated on the great things that Columbus did.  How he in fact helped the indigenous people. Don't buy the Media's and Academia's bullshit. Learn to think for yourself, don't be a sheeple.",
            "title_similarity": "0.62744015",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hg49jfg",
            "score": 0,
            "text": "Why is an old rich white man allowed to declare a day for indigenous people? Thats the most racist white saviorist shit ever. Everyone forgets that this entire country was stolen from native americans by white people who murdered 99% of them. And there will be no peace until every sqft of the US is returned to native ownership. Im sure theyd be happy to lease it to white people afterward for a fee.",
            "title_similarity": "0.60989565",
            "sentiment_compound": -0.8671
        },
        {
            "id": "hg4at7y",
            "score": 0,
            "text": "I have never heard so much misinformation in my life about Columbus.  Stop being sheeple and learn who Columbus really was.  He befriended many Native Americans, they traded and enjoyed sharing things about their world.  Do you hear anyone mention that?  The foolish argument that Columbus didn't discover the United States makes me laugh.  No one is ever taught that he did.\n\nToo many positives about Columbus to mention, but you try sailing across the Atlantic Ocean on a boat with only sails (without an iPhone or GPS) and being responsible for so many men's lives.  Maybe he deserves some respect.  Columbus opened up trade and later settlements in the New World.  He made three trips, the third one cost him his life.  Were there disputes with some Native Americans?  Of course there were, they're human.  In the 1400's disputes meant battles and often dying.  It's just what was.  Don't make the mistake of taking what is today and applying it to what was in 1492.  That is just foolish, different standards and morals.\n\nSo stop, think for yourselves, don't be sway by the woke crowd.  Stand on your own and have the courage to defend one of the most courageous man in history.",
            "title_similarity": "0.5604445",
            "sentiment_compound": 0.6704
        },
        {
            "id": "hg4tf7h",
            "score": 0,
            "text": "F… biden",
            "title_similarity": "0.045962367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg5ac3f",
            "score": 0,
            "text": "I wonder if this will help his 32% approval",
            "title_similarity": "0.3835811",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hfzw1st",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hfzzhb6",
            "score": -10,
            "text": "Nah the easiest thing Biden had done is putting more kids in cages.",
            "title_similarity": "0.55882865",
            "sentiment_compound": 0.34
        },
        {
            "id": "hg06egd",
            "score": -9,
            "text": "Indigenous people were no angels. They are humans just like Columbus and the conquistadors. They done some dirty shit too. Let’s not pretend anything different. Ty. Have a great day",
            "title_similarity": "0.5921433",
            "sentiment_compound": -0.2033
        },
        {
            "id": "hfzq2em",
            "score": 43,
            "text": "Should be October 10 like in Montana.\n\nColumbus was a child rapist and a slaver, and an incompetent explorer. It's well past time to forget his name.",
            "title_similarity": "0.43233493",
            "sentiment_compound": -0.743
        },
        {
            "id": "hfzvs0r",
            "score": 6,
            "text": "now stop the oil pipelines.",
            "title_similarity": "0.15644494",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg0eoul",
            "score": -5,
            "text": "Only thing he's done so far as president.",
            "title_similarity": "0.5765898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0m6vu",
            "score": -6,
            "text": "Who F*}*#*} cares.  How does this Improve anyone’s life even in the slightest?",
            "title_similarity": "0.4824497",
            "sentiment_compound": 0.7488
        },
        {
            "id": "hg0rrgx",
            "score": -5,
            "text": "Pandering",
            "title_similarity": "0.034577344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1luam",
            "score": -6,
            "text": "So he is going to replace all the monuments that blm tore down. Good for him. That’s an American thing to do.",
            "title_similarity": "0.58704376",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfzqyza",
            "score": 17,
            "text": "Because having a day acknowledging their existence is, quite literally, the least we can do. At least we’re doing it now.",
            "title_similarity": "0.5563917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzuckd",
            "score": -19,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg11d5x",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg03us9",
            "score": 6,
            "text": "Finally we can stop calling it columbus day.  What a stupid holiday.  Why celebrate a guy who \"discovered\" a nation full of an already established society.\n\nEspecially so when he wasnt even the first \"white guy\" to discover it.\n\nHe was just the first one with attachment to the group wanting to use it for profit.",
            "title_similarity": "0.6625808",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hg0do8k",
            "score": -6,
            "text": "what about his nap time , surely that must be pretty easy.",
            "title_similarity": "0.4757181",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hg1ujy9",
            "score": -6,
            "text": "Columbus Day.",
            "title_similarity": "0.27262035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzzjfq",
            "score": -14,
            "text": "Virtue signaling at its finest. President capable of overthrowing student debt, changing housing crisis, raising minimum wage. Would it be easy? Of course not. \n\nBut hey. Let’s make a day to the native Americans instead of actually doing something that will contribute to their well being.",
            "title_similarity": "0.6610731",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hfzsu6p",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hfzwiss",
            "score": -1,
            "text": "I think the American Pueblo would appreciate a nice open fire meal in their honor. The enemy’s spleen on a spigot.",
            "title_similarity": "0.4498759",
            "sentiment_compound": 0.743
        },
        {
            "id": "hfzww9c",
            "score": 1,
            "text": "I instantly had to think of that South Park episode where Randy hated everything Columbus related and tried to convince people he was a Native American. He ended up changing Columbus day to this exact holiday but completely missed what 'Indigenous' means. The episode was absolutely hilarious.",
            "title_similarity": "0.47841373",
            "sentiment_compound": 0.128
        },
        {
            "id": "hfzx7r9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hfzxzvt",
            "score": 1,
            "text": "Great, now do every day",
            "title_similarity": "0.36043566",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg01sor",
            "score": 1,
            "text": "Maybe I am missing something but this is literally the verbatim statement from the official White House website [NOW, THEREFORE, I, JOSEPH R. BIDEN JR., President of the United States of America, do hereby proclaim October 11, 2021, as Columbus Day. ](https://www.whitehouse.gov/briefing-room/presidential-actions/2021/10/08/a-proclamation-on-columbus-day-2021/)",
            "title_similarity": "0.6139426",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hg01su7",
            "score": 1,
            "text": "They'll kill you and take your land, but it's okay...you get a day! Haha na it's a step in the right direction",
            "title_similarity": "0.51588166",
            "sentiment_compound": 0.3489
        },
        {
            "id": "hg03l2k",
            "score": -1,
            "text": "The day after Columbus Day (Oct. 10)",
            "title_similarity": "0.4081073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg03rfg",
            "score": -1,
            "text": "Yes, symbolic gestures are easy.",
            "title_similarity": "0.33215043",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hg04axg",
            "score": -1,
            "text": ">performative \"change\"\n\n>'easiest thing I've ever done so far as President' \n\nno kidding?",
            "title_similarity": "0.8020967",
            "sentiment_compound": 0.362
        },
        {
            "id": "hg04ebl",
            "score": -1,
            "text": "Here’s the original intent of Columbus Day y’all take it out of historical context of its creation which ain’t how ur suppose to analyze history.  : \n\nThese anti-Italian sentiments occasionally led to brutal violence. One of the largest mass lynchings in the United States occurred in New Orleans in 1891, when 11 Sicilian immigrants were lynched after the city's police commissioner was killed and suspicion had been placed on the Italian community. (The 11 men had been found not guilty before the lynching. A New York Times editorial had this reaction: \"Yet while every good citizen will readily assent to the proposition that this affair is to be deplored, it would be difficult to find any one individual who would confess that privately he deplores it very much.\")\n\nThe first official commemoration of Columbus' journey occurred in 1892, just a year after the New Orleans lynchings. That's when President Benjamin Harrison became the first president to call for a national observance of Columbus Day, in honor of the 400th anniversary of Columbus' arrival. Harrison's proclamation directly linked the legacy of Columbus to American patriotism, with the proclamation celebrating the hard work of the American people and Columbus equally:\n\n\"On that day let the people, so far as possible, cease from toil and devote themselves to such exercises as may best express honor to the discoverer and their appreciation of the great achievements of the four completed centuries of American life.\"\nHarrison's proclamation is notable in that there are no real references to Columbus' life, work or nationality. Instead, it was very specific to the 400th anniversary of Columbus' journey and how far America as a whole had come since then.\n\nCelebrating Heritage, Via Columbus\n\nBecause Italian-Americans were struggling against religious and ethnic discrimination in the United States, many in the community saw celebrating the life and accomplishments of Christopher Columbus as a way for Italian Americans to be accepted by the mainstream. As historian Christopher J. Kauffman once wrote, \"Italian Americans grounded legitimacy in a pluralistic society by focusing on the Genoese explorer as a central figure in their sense of peoplehood.\"\n\n\n\nhttps://www.npr.org/sections/codeswitch/2013/10/14/232120128/how-columbus-sailed-into-u-s-history-thanks-to-italian",
            "title_similarity": "0.4296329",
            "sentiment_compound": 0.9747
        },
        {
            "id": "hg055k0",
            "score": 1,
            "text": "Get rid of columbus day and itll mean something",
            "title_similarity": "0.31469476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg07dun",
            "score": -1,
            "text": "Is it still Columbus Day too?",
            "title_similarity": "0.34845245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg07fks",
            "score": -1,
            "text": "Soon as I saw this article I googled it and saw the White House proclamation which states it is \nINDIGENOUS PEOPLE/ COUMBUS DAY\n\nGet rid of that nasty fucking dude! he’s not worthy to share a day with indigenous people. Letting him share the day with him is an insult to them wtf",
            "title_similarity": "0.5083001",
            "sentiment_compound": -0.9199
        },
        {
            "id": "hg07t0s",
            "score": 1,
            "text": "This might sound...  i dunno... stupid... but i gained a whole new appreciation for native americans after playing Red Dead Redemption 2.",
            "title_similarity": "0.5008906",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hg0871q",
            "score": -1,
            "text": "I can’t wait for when it’s my turn to cancel something I don’t like.",
            "title_similarity": "0.24916875",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg092mp",
            "score": 1,
            "text": "Great now decriminalized cannabis!",
            "title_similarity": "0.32676867",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hg09v0v",
            "score": 1,
            "text": "As an Italian American I have zero issue with us picking literally any other Italian to represent our heritage. Vespucci, Mother Cabrini, Padre Pio, it doesn’t matter to me. I just want a day where we can celebrate our heritage that’s it. Many Italian immigrants bled for this country, before they were considered “white.” I knew an entire older generation that struggled to get jobs when places refused to hire Italians.",
            "title_similarity": "0.5159345",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg09yrg",
            "score": 1,
            "text": "And schools announce that there will be school on this day, because it doesn’t celebrate a white man. This is what my school is doing.",
            "title_similarity": "0.5381843",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hg0bxbj",
            "score": -1,
            "text": "Why don’t you give them their land back since you feel so bad",
            "title_similarity": "0.20517081",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hg0dksu",
            "score": -1,
            "text": "that old bat needs to choose his words better.  we all know he means \"easiest decision I've made\".  but saying \"easiest thing I've done\" opens it up for republicans to twist until it's not at all what it's supposed to mean.",
            "title_similarity": "0.5484892",
            "sentiment_compound": 0.7615
        },
        {
            "id": "hg0fgk3",
            "score": 1,
            "text": "Death by Nerf-herders",
            "title_similarity": "0.16264585",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hg0j7ar",
            "score": 1,
            "text": "Find crazy horse plz",
            "title_similarity": "0.13083597",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hg0kwf6",
            "score": 1,
            "text": "And keep speaking English!",
            "title_similarity": "0.280914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0mboh",
            "score": -1,
            "text": "Some white person explain to me what was wrong with the term \"Native American\"",
            "title_similarity": "0.36557823",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hg0mu87",
            "score": 1,
            "text": "Like to see them make it a national holiday.",
            "title_similarity": "0.5200199",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hg0ran7",
            "score": 1,
            "text": "Time for conservative grifters to compare and contrast Indigenous Peoples' Day and the Confederacy",
            "title_similarity": "0.44806644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0rkqr",
            "score": 1,
            "text": "Sort by controversial, and let it ride…",
            "title_similarity": "0.13393086",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hg0rn0b",
            "score": 1,
            "text": "This was done to counter Disingenuous Peoples Day that President Trump created.",
            "title_similarity": "0.4601425",
            "sentiment_compound": 0.25
        },
        {
            "id": "hg0ylbg",
            "score": -1,
            "text": "Thats a great consoloation prize for a group of indigenous people that have basically been moved out of sight while others wait for them to die.\n\nThanks Joe 👏 im sure you did everything you could\n\nEdit: dont come at me with a whataboutism or \"thats just how its been\"  Ipse dixit fallacy. I know yall are smarter than that.",
            "title_similarity": "0.55104053",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hg0zfk4",
            "score": -1,
            "text": "People in the back: How about a month?",
            "title_similarity": "0.19359508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg103vi",
            "score": -1,
            "text": "“…but we keeping all the nice land we stole. Enjoy your day “ Let’s Go Brandon",
            "title_similarity": "0.60131896",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hg10dvu",
            "score": -1,
            "text": "I heckin love Indians",
            "title_similarity": "0.46388507",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hg10lvk",
            "score": -1,
            "text": "It’s the only positive thing he’s actually done, congrats Mr. Biden",
            "title_similarity": "0.6108858",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hg10z7c",
            "score": -1,
            "text": "Why Biden doesn’t recognize the genocide of indigenous peoples of America.",
            "title_similarity": "0.3779484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg11y00",
            "score": 1,
            "text": "Call it Double Quarter Pounder Appreciation Day for all I care. As long as I get that day off I'm good.",
            "title_similarity": "0.6541251",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hg14ij9",
            "score": -1,
            "text": "Capitalists declare something a day or month in order for it to appear like they care.",
            "title_similarity": "0.3945915",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hg15iqg",
            "score": -1,
            "text": "I KNEW he was going to do this! I was thinking about this this week. Although an important gesture, it is a gesture, and doesn't entail any wealth transfer to the working class. That's like the Democrat signature.",
            "title_similarity": "0.64581025",
            "sentiment_compound": 0.2415
        },
        {
            "id": "hg169qs",
            "score": -1,
            "text": "Fuck Biden",
            "title_similarity": "0.07089539",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hg16f82",
            "score": -1,
            "text": "Joe’s,  Tearing down the dead white guys statues. Everyone else gets to have a statue.",
            "title_similarity": "0.41603446",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hg18kag",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg19bse",
            "score": -1,
            "text": "Easier than pulling out the Middle East while being advised not to 😏😳",
            "title_similarity": "0.368477",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg19g13",
            "score": -1,
            "text": "This is the most anti Italian thing I have ever seen",
            "title_similarity": "0.35407555",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hg19ybl",
            "score": 1,
            "text": "pls give us healthcare and free college",
            "title_similarity": "0.51175827",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hg1cdeq",
            "score": 1,
            "text": "You can’t beat america when it comes to hollow feel good gestures. How about reparation? How about upholding federal treaties?",
            "title_similarity": "0.46584082",
            "sentiment_compound": 0.504
        },
        {
            "id": "hg1dfvl",
            "score": 1,
            "text": "r/conservative: “wE oNlY cArE aBoUt CoLoMbUs DaY”",
            "title_similarity": "0.45957667",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hg1f3ik",
            "score": 1,
            "text": "As long as it’s a day off work/school, call it whatevs",
            "title_similarity": "0.40583625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1fv5p",
            "score": -1,
            "text": "So while I am celebrating Thanksgiving you all will be celebrating Indigenous Peoples' Day. That sounds right.",
            "title_similarity": "0.6110536",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hg1gabm",
            "score": -1,
            "text": "It’s the only thing he’s done as president",
            "title_similarity": "0.6079806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1h1h8",
            "score": 1,
            "text": "\"This may be the easiest thing I've ever done so far as President\" maybe that's because it's the only thing he's capable of doing.",
            "title_similarity": "0.7467167",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hg1hnlx",
            "score": 1,
            "text": "It's unclear if this is renaming Columbus Day or is just being held on the same day now... \n\nCause Columbus Day really needs to stop being a thing too...",
            "title_similarity": "0.36128858",
            "sentiment_compound": -0.5367
        },
        {
            "id": "hg1l6lv",
            "score": -1,
            "text": " No thanks.",
            "title_similarity": "0.08204132",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hg1lg8s",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg1mq77",
            "score": 1,
            "text": "Positing. Means nothing without landback regarding stewardship.",
            "title_similarity": "0.41920426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1n57t",
            "score": 1,
            "text": "Damn libs trying to rewrite history and erase National Coming Out Day! /s",
            "title_similarity": "0.38515586",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hg1ntv1",
            "score": 1,
            "text": "Happy Leif Erikson Day! Not just a brave explorer, a good man which is a much rarer thing.",
            "title_similarity": "0.5349095",
            "sentiment_compound": 0.6269
        },
        {
            "id": "hg1nuu3",
            "score": -1,
            "text": "Him finding his applesauce was the second easiest.",
            "title_similarity": "0.544445",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg1ocoy",
            "score": -1,
            "text": "[obligatory south park clip](https://southpark.cc.com/video-clips/2y4k65/south-park-what-is-a-holiday)",
            "title_similarity": "0.34849125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1t7kz",
            "score": -1,
            "text": "I saw this article, this morning and was wondering why Oct 11th. Seemed random. Was reminded later, it is technically Columbus Day on Monday. Oh, that makes sense.\n\nDont have a state job, and havent been in school in 2 decades. No reason for me to give a damn.",
            "title_similarity": "0.58268505",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hg1wpj7",
            "score": -1,
            "text": "Shouldn’t it be Indigenous Person’s Day, for Kennewick Man?",
            "title_similarity": "0.47731566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1wwf5",
            "score": -1,
            "text": "How many white oppressors showed up? ( satire)",
            "title_similarity": "0.31863746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1yu3d",
            "score": -1,
            "text": "Tell him to avoid the Canadian prime minister's lead on the 11th.",
            "title_similarity": "0.32231283",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg2dkhd",
            "score": 1,
            "text": "Of course it's the easiest, all he did was declare a holiday",
            "title_similarity": "0.69359875",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hg30vlf",
            "score": -1,
            "text": "But they lost.\n\nSound familiar?",
            "title_similarity": "0.12609623",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hg3es38",
            "score": 1,
            "text": "And one of the only things he’s done.",
            "title_similarity": "0.33680177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg019sk",
            "score": 5,
            "text": "We gonna restore mount Rushmore?",
            "title_similarity": "0.42163292",
            "sentiment_compound": 0.296
        },
        {
            "id": "hg1oyxp",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg22on8",
            "score": -7,
            "text": "No one is complaining about his $600 audits on people like you and I. He’s got y’all fooled",
            "title_similarity": "0.61016315",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hg01jdh",
            "score": -7,
            "text": "How about a day for those whose lives where lost during the horrible Afghanistan pull out?",
            "title_similarity": "0.3233639",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hg01kh3",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg04umf",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg0mrqo",
            "score": -7,
            "text": "Biden's handlers declared October 11 Indigenous People's Day and said say that \"restoring national monuments is the easiest thing you had to do so far.\"",
            "title_similarity": "0.9459456",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hg1nosx",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hfztn7x",
            "score": -2,
            "text": "The only reason I give a crap about any days celebrating past figures/peoples is if it's a holiday and I can spend more time with my wife/kids.  Other than that idgaf.",
            "title_similarity": "0.6141988",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfzu6rf",
            "score": 2,
            "text": "Good thing all those monuments will still be around long after we've killed ourselves off from climate change.",
            "title_similarity": "0.6490264",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hfzuzt6",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hfzx65q",
            "score": 2,
            "text": "By the picture I would think that’s a pride parade",
            "title_similarity": "0.38921028",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfzy0r2",
            "score": -2,
            "text": "Easiest thing?\n\nI could think of a couple of other things. Biden is looking for any 'win' he can get with the public and this is one because it is a good thing to do.",
            "title_similarity": "0.4465676",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hfzyge4",
            "score": 2,
            "text": "Could also abolish Columbus day... Just saying",
            "title_similarity": "0.2781834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzz4ka",
            "score": -2,
            "text": "Why do monuments need restoring?  Are they not maintained?",
            "title_similarity": "0.3069226",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hfzzlua",
            "score": -2,
            "text": "Alcohol sales went thru the roof!  I own a liquor market and I say thanks to all.",
            "title_similarity": "0.4792732",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hg00e7r",
            "score": -2,
            "text": "When your all celebrating genocide day on Monday will the markets still be open?",
            "title_similarity": "0.5317002",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hg00ps6",
            "score": -2,
            "text": "....do people got off for it? if not than its not a real holiday",
            "title_similarity": "0.3289602",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hg0169z",
            "score": -2,
            "text": "Great job. A holiday. Like he really cares",
            "title_similarity": "0.5708929",
            "sentiment_compound": 0.9117
        },
        {
            "id": "hg03243",
            "score": 2,
            "text": "Now as long as he just doesn’t pack up his family and fly to Tofino, BC for a vacation on the day he himself declared, he’ll be a step up from Trudeau.",
            "title_similarity": "0.47932312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg04l3v",
            "score": -2,
            "text": "All he does from the moment he enters ... is populist decisions aimed at bringing more voters to the next Democratic election.",
            "title_similarity": "0.51059145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg05v1z",
            "score": -2,
            "text": "Wow so brave and courageous",
            "title_similarity": "0.31993917",
            "sentiment_compound": 0.9033
        },
        {
            "id": "hg06kho",
            "score": 2,
            "text": "But he won’t cancel line 3",
            "title_similarity": "0.3180274",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hg071b5",
            "score": -2,
            "text": "Cool when are you going to stop virtue signaling and do something that actually makes peoples lives better",
            "title_similarity": "0.43579012",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hg076ib",
            "score": -2,
            "text": "Beware of small symbolic acts. They are aversion to real change. #LandBack",
            "title_similarity": "0.22801729",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hg07hq3",
            "score": -2,
            "text": "Probably the only thing he's done right.",
            "title_similarity": "0.4161958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg09qkq",
            "score": -2,
            "text": "Hopefully Biden isn’t surfing in cali on Monday.",
            "title_similarity": "0.37807977",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg09yam",
            "score": 2,
            "text": "Sure it was easy but it’s not a federal holiday until Congress makes it so.",
            "title_similarity": "0.6249027",
            "sentiment_compound": -0.0739
        },
        {
            "id": "hg0b83e",
            "score": -2,
            "text": "Let's go Brandon!",
            "title_similarity": "0.17010641",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0d5mc",
            "score": 2,
            "text": "Colorado made the first Monday in October Mother Cabrini Day into a State Holiday . Honestly this is the best way to keep the original spirit of the holiday, removing Columbus' troublesome past while also opening the holiday up to non-Italians.\n\nStill honoring an Italian, she's the patron saint of immigrants, she actually came to the US and to my knowledge there is nothing controversial about her.",
            "title_similarity": "0.7203706",
            "sentiment_compound": 0.9577
        },
        {
            "id": "hg0kyvw",
            "score": -2,
            "text": "So his he going to retire Mount Rushmore",
            "title_similarity": "0.29285836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0mb30",
            "score": 2,
            "text": "Google has had this on my calendar since before October started....  \nAnd Governor Tony Evers of WI did this ~~last year (approximately)~~ [two years ago](https://oneida-nsn.gov/blog/2019/10/08/gov-evers-signs-executive-order-declaring-indigenous-peoples-day-in-wisconsin/). Not federal, obviously.  \nI'm loving Indigenous Peoples’ , [but why is he keeping that fuck Columbus around](https://www.whitehouse.gov/briefing-room/presidential-actions/2021/10/08/a-proclamation-on-columbus-day-2021/) on the same day?  \nAnd why are Indigenous People still being attacked by private security forces for trying to stop oil pipelines from destroying our water supply?\n\nThey still haven't removed cannabis (formerly \"marihuana\") from the schedule list.\n\nForgive me for pointing out the hypocrisy of this action /s  \nI hope we all celebrate the absolute fuck out of Indigenous Peoples’ Day though.\n\nEdit: Gov. Evers declaration",
            "title_similarity": "0.7122586",
            "sentiment_compound": -0.755
        },
        {
            "id": "hg0nzl9",
            "score": -2,
            "text": "This will solve so many problems now!",
            "title_similarity": "0.31660828",
            "sentiment_compound": -0.3549
        },
        {
            "id": "hg0vtek",
            "score": 2,
            "text": "Pretty fucked up not to give us the day off on indigenous peoples day-looking at you employer…",
            "title_similarity": "0.42872342",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg0xdll",
            "score": 2,
            "text": "Let’s go brandon",
            "title_similarity": "0.14254348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0yst8",
            "score": -2,
            "text": "That and also building the cages for illegal immigrants kids with Obama in 2014 😆\nSeparating Mexican families by the thousands",
            "title_similarity": "0.40289146",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hg10myu",
            "score": -2,
            "text": "I wonder if Biden will spend that day on vacation like Trudeau.\n🙄",
            "title_similarity": "0.4100002",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hg119ru",
            "score": 2,
            "text": "If Biden wants to respect indigenous people he can start by restoring indigenous ownership of the Black Hills. “National monuments” exist in violation of treaties that were made between the US government and indigenous people.",
            "title_similarity": "0.41267776",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hg14cg4",
            "score": -2,
            "text": "A lot of you need a history lesson on Columbus: https://youtu.be/ZEw8c6TmzGg",
            "title_similarity": "0.3132687",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg15fhm",
            "score": -2,
            "text": "Ah yes segregation but with a nice color splashed on it",
            "title_similarity": "0.23300074",
            "sentiment_compound": 0.6757
        },
        {
            "id": "hg1c90a",
            "score": 2,
            "text": "Let’s Go Brandon!",
            "title_similarity": "0.15737355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1dnrr",
            "score": 2,
            "text": "Easiest thing he's done so far as president? I'm pretty sure that's the only thing he's done so far as president.",
            "title_similarity": "0.72906125",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hg1hl1q",
            "score": -2,
            "text": "Restoring? The left just keeps saying the opposite of reality and what they do, then rely on soft people to believe it. They just say it and say it and hope eventually people just give up on knowing.",
            "title_similarity": "0.22555436",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg1kf3g",
            "score": -2,
            "text": "Why not the fucking 12th like the rest of the fucking continent that was affected by colonialism and slavery. And then you wonder why a lot of minority do not vote.",
            "title_similarity": "0.28285018",
            "sentiment_compound": -0.5606
        },
        {
            "id": "hg1mlef",
            "score": -2,
            "text": "But do I still have Columbus Day off?",
            "title_similarity": "0.39669788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1pbyw",
            "score": -2,
            "text": "I mean yeah. He’s not exactly handling the hard stuff",
            "title_similarity": "0.10722604",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hg21nyu",
            "score": 2,
            "text": "That’s a bare minimum… a step in the right direction would be restoring and returning natural / cultural resources which are currently being destroyed by line 3…",
            "title_similarity": "0.51309156",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg24z2p",
            "score": -2,
            "text": "I will now turn over all the states back to the native Americans and dissolve the US Government, once again showing my commitment to my fellow Americans.",
            "title_similarity": "0.43763867",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hg27vy1",
            "score": -2,
            "text": "Not a Biden fan but extremely happy about this!",
            "title_similarity": "0.44531053",
            "sentiment_compound": 0.7431
        },
        {
            "id": "hg2a8z3",
            "score": -2,
            "text": "The holiday was meant to celebrate Italian Americans who faced a lot lynchings and racism at the time, this is the ignorant destruction of a holiday created to celebrate a group who was discriminated against.",
            "title_similarity": "0.34268004",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hg2d9h3",
            "score": -2,
            "text": "I am Osage, I will celebrate Columbus Day and I don't care about this \"Indigenous Peoples' Day.\" October 11th has absolutely no real meaning or connection to my people or myself, there are numerous days of more significance that would be more appropriate for such a holiday like June 2nd, May 28th, or August 3rd. This seems like a desperate ploy to increase poll numbers, and I find it personally disgusting as most of the administration's campaign promises to the tribes have either been ignored or barely touched. Christopher Columbus' voyages were vital to all of humanity, and deserve a holiday. If they wanted to make a holiday for the tribes they could have picked a day with actual meaning to the tribes of the USA.",
            "title_similarity": "0.65394557",
            "sentiment_compound": 0.9037
        },
        {
            "id": "hg2k791",
            "score": -2,
            "text": "Looks like a \"symbolic victory without economic equality and justice\". Do not be satisfied.",
            "title_similarity": "0.36595473",
            "sentiment_compound": 0.5526
        },
        {
            "id": "hg461hh",
            "score": 2,
            "text": "Restore Mount Rushmore next",
            "title_similarity": "0.35809577",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfzqp0s",
            "score": -10,
            "text": "Most “indigenous people” here in NY are Puerto Ricans wearing feathers",
            "title_similarity": "0.30692446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzryoq",
            "score": 11,
            "text": "Is he doing anything to stop the next president from unrestoring them?",
            "title_similarity": "0.27255863",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg01jn2",
            "score": 10,
            "text": "Now prove it isn't performative by implementing landback",
            "title_similarity": "0.18974599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg02wtq",
            "score": -10,
            "text": "“As president” Umm, he’s not president...",
            "title_similarity": "0.33659965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg07jon",
            "score": -11,
            "text": "No, shitting his pants & sniffing little kids is the easiest thing he's ever done as the Fraud-in-Chief.  \n\n\nBTW, Indigenous Peoples' Day a fraud too. Why?  \nDid those people sprout up out of the ground....OR....is it MORE LIKELY that those \"indigenous people\" murdered all the prior \"indigenous people\" in that area and erase their history?....think on this one.....I'll be celebrating Columbus Day whilst Stacking Silver in order to help destroy the   \nONE COMMON ENEMY OF HUMANITY:  \n\n\nThe New World Order Central Banking Pea Dough Files.  \nTHESE DEMONS ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ ARE HUMANITY'S ENEMIES.",
            "title_similarity": "0.6168906",
            "sentiment_compound": -0.9416
        },
        {
            "id": "hg0cizr",
            "score": -9,
            "text": "Sorry, I don’t celebrate losers. Put the Indians over in the corner with the confederate monuments.",
            "title_similarity": "0.4665907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzruca",
            "score": -19,
            "text": "Listen, I don't care what days this fucking ass clown adds. All I care about is getting off School.",
            "title_similarity": "0.43146762",
            "sentiment_compound": -0.4975
        },
        {
            "id": "hfzsdnb",
            "score": 90,
            "text": "White supremacist mad af",
            "title_similarity": "0.3350875",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hg0817u",
            "score": -12,
            "text": "Dementia patient is confused again, its columbus day.",
            "title_similarity": "0.2734062",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hfzqysy",
            "score": -2,
            "text": "But, do we still get the day off, that is the important question",
            "title_similarity": "0.38348395",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfzywyb",
            "score": -3,
            "text": "how about addressing poor employment and the housing shortage. Lmao",
            "title_similarity": "0.16224903",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hfzzepp",
            "score": -2,
            "text": "Is this CRT?",
            "title_similarity": "0.030779855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg00yz8",
            "score": 2,
            "text": "Does this mean I get work off Monday now?",
            "title_similarity": "0.3853224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg04rb3",
            "score": -3,
            "text": "This is why his approval rating is 38 and plummeting.",
            "title_similarity": "0.3671659",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hg05k1w",
            "score": 3,
            "text": "They get a holiday, we get to keep their land\n\nTotally fair",
            "title_similarity": "0.5886971",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hg05mz1",
            "score": -3,
            "text": "Columbus Day",
            "title_similarity": "0.28551233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0623e",
            "score": -3,
            "text": "Not doing anything to keep people in Afghanistan from being left behind was probably pretty easy too, but hey, Joe’s gonna be Joe. Good work on this one, Joe.",
            "title_similarity": "0.5553491",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hg06475",
            "score": -3,
            "text": "What a joke, it’s always going to be Columbus Day. Changing it is an insult to the Italians.",
            "title_similarity": "0.36235648",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hg06hcf",
            "score": -3,
            "text": "Both sides should be offended by this.  Indigenous People for being such a second thought that they can't even have their own day, and Italian Americans for losing or splitting their day.  Columbus Day was formed after the [New Orleans Lynchings of Italians](https://en.wikipedia.org/wiki/March_14,_1891_New_Orleans_lynchings).  It was never about Columbus he was just chosen back then.\n\nChange Columbus Day to Italian Heritage Day. Give Indigenous People their own day.  It's not that difficult.  But instead, in the truest American fashion, we do things that create a divide, mostly by people that have nothing to do with either holiday.  The US is around 6% Indigenous People and 14% Italian American? Guess who is creating most of the outrage.  Everyone else who just likes to be upset about other people's problems as long as it doesn't affect them.\n\nAlso, look into some history once in a while to find out why these days were created.  It's easy to just say Columbus was an asshole why does he deserve a day?  It's not easy to look at why a day was created in the first place.  America was a very ugly, hateful place for Italian Immigrants back in the day.  When will people ever bring that up?  They probably won't because it doesn't fit into what people become outraged about in this day and age.",
            "title_similarity": "0.4985242",
            "sentiment_compound": -0.8959
        },
        {
            "id": "hg06lfa",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.018709796"
        },
        {
            "id": "hg06rtk",
            "score": -4,
            "text": "Absolutely meaningless gesture. Won’t actually do anything to help American Indians.",
            "title_similarity": "0.30077025",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hg06snb",
            "score": -3,
            "text": "More and more tribalism. Good grief",
            "title_similarity": "0.33938718",
            "sentiment_compound": -0.0735
        },
        {
            "id": "hg07dcg",
            "score": -4,
            "text": "Cool now don’t bomb middle eastern children",
            "title_similarity": "0.28326124",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hg07hq1",
            "score": -4,
            "text": "It was pretty easy making sure diabetics have to pay 600$ for medicine with a pen stroke.",
            "title_similarity": "0.56073445",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hg09tth",
            "score": -3,
            "text": "I'm just glad Biden defunded the Black Communities that Trump funded, Trump doesn't deserve to be able to fund Black Communities because The Verge told me he was racist!",
            "title_similarity": "0.42888933",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hg0alk9",
            "score": -2,
            "text": "So irrelevant. Perhaps he needs to find something important to do.",
            "title_similarity": "0.10661364",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hg0anzd",
            "score": -3,
            "text": "i hope they won't come after the **VIKINGS** next...\n\nwell , who knows...it is ALL **SYMBOLIC** nowadays...(NOTHING seems REAL)",
            "title_similarity": "0.3367384",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hg0aun4",
            "score": -2,
            "text": "Who gives a shit, most of y’all are just looking for an argument anyway.",
            "title_similarity": "0.17614882",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hg0d8bx",
            "score": -4,
            "text": "Ok either Biden is stupid or just a jerk. He either doesn’t know oct. 11th has been indigenous peoples’ day for years or he is trying to steal other peoples ideas for his own.",
            "title_similarity": "0.39440387",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hg0duo4",
            "score": -3,
            "text": "Sure was easy for him to fuck up everything",
            "title_similarity": "0.3861073",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hg0hhvh",
            "score": -3,
            "text": "One of the only things he’s done right.",
            "title_similarity": "0.39827836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0ibpx",
            "score": 3,
            "text": "As a man with partial NA decent this makes me smile.",
            "title_similarity": "0.4089411",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hg0rqua",
            "score": -3,
            "text": "Nobody in that picture is indigenous and why are we the only ones that are doing this if literally every country in the world has taken land from another?",
            "title_similarity": "0.47392875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0wmfz",
            "score": -4,
            "text": "He’s definitely not going to do the hard stuff",
            "title_similarity": "0.17673856",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hg10k42",
            "score": -2,
            "text": "No way he said that. It was probably more like, ‘easy, easy, easiest, thing… I’ve uh, I’ve uh, done, this yesterday, uhhhh afternoon? As the only.. female senator!’",
            "title_similarity": "0.66004765",
            "sentiment_compound": 0.7813
        },
        {
            "id": "hg1jsuj",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.005639661"
        },
        {
            "id": "hg1rl2b",
            "score": -3,
            "text": "You mean cynical use of native Americans to advance your career. The bears eat monument was not created for the local native population. It was too deny that land from being leased for extraction of oil... Something that find the local tribes. This was just to pander till his base. Which isn't the impoverished first nations, it's the rich virtue signalers.",
            "title_similarity": "0.46908137",
            "sentiment_compound": 0.168
        },
        {
            "id": "hg1ryfo",
            "score": -3,
            "text": "I’m pretty sure the dinosaurs were around America before the Indians",
            "title_similarity": "0.52434725",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hg1skdk",
            "score": -2,
            "text": "Isn’t everyone indigenous to the area they were born?",
            "title_similarity": "0.35382625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1w70w",
            "score": 3,
            "text": "I am so happy for the native americans. This definitely casts biden in a better light for me…",
            "title_similarity": "0.61120975",
            "sentiment_compound": 0.8949
        },
        {
            "id": "hg1xtbb",
            "score": -3,
            "text": "What a waste of time those people don't give a shit about a fake holiday",
            "title_similarity": "0.34758484",
            "sentiment_compound": -0.0711
        },
        {
            "id": "hg1ylcn",
            "score": 3,
            "text": "Does this actually benefit native americans in this country in any way or is this just lip service and platitude for minority points",
            "title_similarity": "0.42962176",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hg27vrx",
            "score": -4,
            "text": "I think it’s going to be interesting hearing about stores’ Indigenous People’s Day Sales lol. Rolls right off the tongue lmao. Yea, Columbus was shitty and an idiot, but come up with a better name for the love of the spaghetti monster",
            "title_similarity": "0.39433146",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hfzutgr",
            "score": 12,
            "text": "Without looking at any conservative subreddits, I can just imagine those people wringing their hands and rending their garments over this.",
            "title_similarity": "0.29655492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzsdy3",
            "score": -28,
            "text": "Dude can barely remember his own name. The fact he even was able to muster up enough energy to say “indigenous” is an joe miracle in and of itself.",
            "title_similarity": "0.5581521",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hfzxzin",
            "score": -13,
            "text": "When is it white people appreciation day?",
            "title_similarity": "0.4962885",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hg04vs4",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "0.018709796"
        },
        {
            "id": "hg019ll",
            "score": -16,
            "text": "I'm sorry, but didn't they lose? Why are we celebrating losers?",
            "title_similarity": "0.35422707",
            "sentiment_compound": 0.5495
        },
        {
            "id": "hfzsj7b",
            "score": -4,
            "text": "Nice, do we get school off?",
            "title_similarity": "0.27089438",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg013m4",
            "score": -5,
            "text": "So the solution is that we take an existing “holiday” that originally was about colonialism/imperialism and just rename it to pander to indigenous people… great.",
            "title_similarity": "0.48524964",
            "sentiment_compound": 0.7703
        },
        {
            "id": "hg03pt1",
            "score": -4,
            "text": "> ~~and says restoring national monuments is the 'easiest thing I've ever done so far as President'~~\n\nand says restoring national monuments is the 'ONLY thing I've ever done so far as President'\n\nFTFY",
            "title_similarity": "0.9149704",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hg04laq",
            "score": -3,
            "text": "So far, this is his greatest accomplishment. No kidding, this is it.",
            "title_similarity": "0.52670884",
            "sentiment_compound": 0.5999
        },
        {
            "id": "hg04uhf",
            "score": -4,
            "text": "Idk fucking over Afghanistan and making the border crisis worse didn't take too much effort on Biden's part.",
            "title_similarity": "0.4413126",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hg075wn",
            "score": -4,
            "text": "It’s the only thing you’ve done as President!!! Terrible, terrible President!",
            "title_similarity": "0.53558004",
            "sentiment_compound": -0.811
        },
        {
            "id": "hg080cs",
            "score": -4,
            "text": "Also the most meaningless thing you’ve done. Empty gesture all fluff no substance behind his presidency. What a tragic disappointment",
            "title_similarity": "0.41419935",
            "sentiment_compound": -0.9099
        },
        {
            "id": "hg09upk",
            "score": -4,
            "text": "I assumed the easiest thing he's ever done is meeting the buyers of his junkie sons finger paintings. No kickbacks of course lol",
            "title_similarity": "0.70667195",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hg0bvhw",
            "score": -3,
            "text": "It’s also the only thing he’s done",
            "title_similarity": "0.38307035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0eh04",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg0hlx7",
            "score": 4,
            "text": "Respect, just a overall decent thing to do, this kind of common decency should be standard practice as president",
            "title_similarity": "0.6189033",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hg0m24c",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg0rokl",
            "score": -2,
            "text": "Well we all know he isn't doing much else while the country crumbles.",
            "title_similarity": "0.35930923",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hg0x3ld",
            "score": -4,
            "text": "I bet Biden doesn't even remember what he did last month.",
            "title_similarity": "0.36748216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0xf9f",
            "score": -4,
            "text": "I got banned on online platforms for saying I agree with the klan and the skin heads that blacks should go back to Africa. \n\nI’m black and we do want to go back to Africa! We want to say arrivederci! And let them never see our black asses again.\n\nBut it doesn’t happen!",
            "title_similarity": "0.34715226",
            "sentiment_compound": 0.2325
        },
        {
            "id": "hg1i4u8",
            "score": -4,
            "text": "Idk seemed pretty easy for him and his whole admit to keep cranking up debt, coming up with shitty ideas such as “build back better” etc",
            "title_similarity": "0.47608733",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hg1n6ed",
            "score": 4,
            "text": "Bitter sweet... And not necessarily on Bidens shoulders. You may disagree with him or his politics. It is sad WE haven't done something like this sooner. Still the effort is being made.",
            "title_similarity": "0.31150156",
            "sentiment_compound": -0.7657
        },
        {
            "id": "hg1rlaw",
            "score": -4,
            "text": "Lol another day that Biden is keeping people from working",
            "title_similarity": "0.2394283",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg1z7ae",
            "score": -5,
            "text": "Let’s go Brandon! #FJB",
            "title_similarity": "0.22987042",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg26xux",
            "score": -4,
            "text": "Why do so many people put blame on Columbus for spreading illness in America when anyone who came over from Europe would have probably done just as much damage",
            "title_similarity": "0.32164568",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hg2e029",
            "score": -3,
            "text": "So is like Elizabeth Warren included in this or is she really jus a Karen?",
            "title_similarity": "0.24837777",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hg0hohg",
            "score": 27,
            "text": "Maybe I'm just being cynical, but this is one of those things that is feel good for a lot of people, but how about we address something that actually helps indigenous people? Maybe [let them manage their own land](https://www.theatlantic.com/politics/archive/2016/07/native-americans-property-rights/492941/) and remove the federal government as the one who gets to decide what native people's can do with their own land. Which process is so convoluted it takes 46 steps to develop the land. And the legal process is so complicated that legal fees to work it all out are pretty steep. \n\nWant to know why there's crippling poverty on reservations? This is certainly one of the contributing factors. Reservations aren't sovereign nations, they are basically owned and managed (or should I say mismanaged) by the federal government.\n\nEdit: man that first sentence got messed up.",
            "title_similarity": "0.56362116",
            "sentiment_compound": 0.8874
        },
        {
            "id": "hfzkzhj",
            "score": 109,
            "text": "[Meanwhile, in Minnesota](https://www.stopline3.org/#intro)",
            "title_similarity": "0.28904435",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzxifa",
            "score": 5,
            "text": "That's actually something I didn't expect Biden to do, though it's kind of silly how we now officially have both Indigenous People's Day and Columbus Day",
            "title_similarity": "0.5553574",
            "sentiment_compound": -0.0498
        },
        {
            "id": "hg033rr",
            "score": -6,
            "text": "It's just about the only thing you've done",
            "title_similarity": "0.3625761",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg04mmi",
            "score": -4,
            "text": "Biden is dumbass. This is stupid.",
            "title_similarity": "0.16287708",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hg0537a",
            "score": -5,
            "text": "The Michigan Militia is the deep state of USA 🇺🇸! Wake up sheeple 🐑! There will be another civil war and the USA 🇺🇸 military will collapse immediately. Then different Militia groups (such as the Michigan Militia and the militia led by Grandmaster Jay) will take over different parts of the country. The USA 🇺🇸 will collapse soon since the USA 🇺🇸 sells guns on the supermarket.",
            "title_similarity": "0.3524313",
            "sentiment_compound": -0.8975
        },
        {
            "id": "hg07jy0",
            "score": -5,
            "text": "I thought maybe killing those 11 citizens in Afghan was tbh",
            "title_similarity": "0.36641407",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hg0drxl",
            "score": -5,
            "text": "Only thing he's done as a president*",
            "title_similarity": "0.5836549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0gu2p",
            "score": -6,
            "text": "Then why did it take him 10 months to get around to it??",
            "title_similarity": "0.3923107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0m1ph",
            "score": -5,
            "text": "“Forming a coherent sentence”, Biden says, after asking what’s the hardest part of being president. Good victory for America today though.",
            "title_similarity": "0.6320524",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg24rne",
            "score": -6,
            "text": "Happy Columbus Day !",
            "title_similarity": "0.46805486",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hg0sb7i",
            "score": 17,
            "text": "American Samoans: we have been a American territory for over 100 years, why can’t we vote and be citizens!?\n\nU.S government: listen jack! Best we can do is give you a holiday! It’s the easiest thing I’ve ever done!",
            "title_similarity": "0.8342397",
            "sentiment_compound": 0.8972
        },
        {
            "id": "hg0b6d7",
            "score": 19,
            "text": "Thank God.  This is what I primarily voted for last November.  Absolute tragedy to give away conservation land and lock the public out.  Fuck the \"ranchers\" who wanted the land....  They wanted it private so they could never actually step foot on it again?  Freal??",
            "title_similarity": "0.45032543",
            "sentiment_compound": -0.7041
        },
        {
            "id": "hg0a512",
            "score": 7,
            "text": "I love Biden so much!",
            "title_similarity": "0.37248763",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hg0dbli",
            "score": -6,
            "text": "Yeah, it can be difficult when you make illegal eviction moratoriums, let the southern border become overwhelmed by migrants, and make so many people lose their job over a dumb vax.\n\nI'm sure everyone chanting \"fuck Joe biden\" at sports auditoriums is great for you. Glad you can make an \"easy decision\" for monuments while you topple this entire country's economy.\n\nHope it wasn't too hard of a decision when you said fuck the American people and their allies in Afghan.",
            "title_similarity": "0.49229226",
            "sentiment_compound": -0.6671
        },
        {
            "id": "hg0puxn",
            "score": -7,
            "text": "Still, a shit President that made the economy shit and made inflation go through the roof. A PR stunt nothing more. I hate to say it as a Native American.",
            "title_similarity": "0.43181312",
            "sentiment_compound": -0.6119
        },
        {
            "id": "hg12qvq",
            "score": -6,
            "text": "How about we call it SLAP SOME SENSE INTO BIDEN DAY....what a 🤡 clown",
            "title_similarity": "0.37135994",
            "sentiment_compound": 0.3254
        },
        {
            "id": "hg1xk6v",
            "score": -7,
            "text": "Not restoring the one’s BLM destroyed",
            "title_similarity": "0.24560508",
            "sentiment_compound": -0.6234
        },
        {
            "id": "hg20hxl",
            "score": 6,
            "text": "He's by no means the best president ever but I can totally get behind this.",
            "title_similarity": "0.67996323",
            "sentiment_compound": 0.25
        },
        {
            "id": "hg22k6c",
            "score": -6,
            "text": "Only thing he’s done as president",
            "title_similarity": "0.56381756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg23nra",
            "score": -6,
            "text": "You spelled Columbus day wrong",
            "title_similarity": "0.24521314",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfzmb70",
            "score": 402,
            "text": "[deleted]",
            "title_similarity": "0.018709796"
        },
        {
            "id": "hfza8h6",
            "score": 701,
            "text": ">\"Since time immemorial, American Indians, Alaska Natives, and Native Hawaiians have built vibrant and diverse cultures — safeguarding land, language, spirit, knowledge, and tradition across the generations,\" a White House proclamation release from Biden said.  \n>  \n>Although Indigenous Peoples' Day will be celebrated on the same date as Columbus Day, Biden acknowledged the atrocities inflicted on Indigenous communities by European explorers in another proclamation and urged the country not to try and bury \"shameful episodes of our past.\"  \n>  \n>\"For Native Americans, western exploration ushered in a wave of devastation: violence perpetrated against Native communities, displacement and theft of Tribal homelands, the introduction and spread of disease, and more,\" a White House proclamation from Biden said. \"On this day, we recognize this painful past and recommit ourselves to investing in Native communities, upholding our solemn and sacred commitments to Tribal sovereignty, and pursuing a brighter future centered on dignity, respect, justice, and opportunity for all people.  \n>  \n>\"Biden also announced Friday that his administration will restore protections for the Bears Ears and Grand Staircase-Escalante national monuments in Utah, as well two monuments in New England.\"This may be the easiest thing I've ever done so far as President,\" Biden said Friday during a speech outside the White House.\n\nRepublican states will probably refuse to adopt Indigenous People's Day as they continue to try to cling to the whitewashed version of American History.\n\nThe purpose of Biden's restoring the monuments is to reverse Trump's decision to pimp them out to fossil fuel companies.\n\nThe purpose of declaring October 11 Indigenous People's Day is to honor the people first here in America and reverse the false history that Columbus discovered America.",
            "title_similarity": "0.5756211",
            "sentiment_compound": 0.9754
        },
        {
            "id": "hfzqy18",
            "score": -24,
            "text": "Other than ruin the economy and divide the country even more thanks Biden",
            "title_similarity": "0.40014884",
            "sentiment_compound": -0.1548
        },
        {
            "id": "hfzusya",
            "score": 24,
            "text": "Fuck, this is just nice.",
            "title_similarity": "0.3077072",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hg02abr",
            "score": 23,
            "text": "I've had a chip on my shoulder about Columbus ever since I learned about it in grade school.  Thing is, these things always come too late.  It's like somebody orders a pizza, we eat their pizza, then after it's all eaten, write them a note saying that we're sorry.\n\nThe rampant racism we endured over the last several centuries is government sanctioned as a means to preserve a certain culture, and to align the people with that culture.  Now that is no longer a threat to the culture they wanted, it's easy to say \"whoops, we were wrong, let's recognize you\", after their culture is gone.",
            "title_similarity": "0.46712914",
            "sentiment_compound": -0.765
        },
        {
            "id": "hfzuk67",
            "score": -7,
            "text": "Eh.  It would have been better to designate it Italian American Day since that's what it was really used for.",
            "title_similarity": "0.4759543",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg00yp9",
            "score": -9,
            "text": "You get a day, you get a day, and you get a day!\n\nBlack people, women, indigenous people.  So nice that they get days!",
            "title_similarity": "0.5135885",
            "sentiment_compound": 0.637
        },
        {
            "id": "hg01p40",
            "score": -8,
            "text": "will white Americans kneel down to indigenous people seek for their forgiveness?",
            "title_similarity": "0.39668304",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hg04k11",
            "score": -8,
            "text": "Well that's not a very high bar.\n\nConsidering the entire presidency has been a dieaster.",
            "title_similarity": "0.41189104",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hg04wj9",
            "score": -6,
            "text": ">'easiest thing I've ever done so far as President' \n\nHaha, all Sleepy Joe knows is easy.",
            "title_similarity": "0.7617042",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hg0a80d",
            "score": -8,
            "text": "God forbid you have a modicum of understanding of how life was back then.  We judge Christopher Columbus because he was a product of his generation….   So instead of praising a brave Italian male we would rather call him a monster and make a lame ass holiday In his stead..  it’s sickening.  I have no problem with indigenous peoples day but could we please just make it another day?  Not a cast off day from someone else we are trying to demonize for our cancel culture society?",
            "title_similarity": "0.515897",
            "sentiment_compound": 0.3444
        },
        {
            "id": "hfz8wjh",
            "score": 147,
            "text": ">**Former President Donald Trump had previously revoked protections for thousands of acres across the four monuments, Indian Country Today reported, which opened them up to mining, commercial fishing, and other developments.**\n\n>\"Today's announcement, it's not just about national monuments. **It's about this administration centering the voices of Indigenous people and affirming the shared stewardship of this landscape with tribal nations,\"** said Secretary of the Interior Deb Haaland, a citizen of the Laguna Pueblo nation.\n\nMeanwhile \n\nTitle: A Progressive Facade: Comparing the U.S. and Canada’s Treatment of Indigenous Peoples\n\n>In the current political climate, many disenchanted Americans have expressed, to various degrees of sincerity, a desire to escape to Canada. “If Trump gets re-elected, I’m crossing the border North.”\n\n>And while Native Americans are indeed much less visible in the U.S. political landscape, the U.S. government’s **recognition of indigenous statehood has laid the foundation for greater political empowerment, socioeconomic growth, and cultural revitalization.**\n\nhttps://harvardpolitics.com/a-progressive-facade-comparing-the-u-s-and-canadas-treatment-of-indigenous-peoples/\n\nTitle: Critical Race Theory Debate Is About Whitewashing the United States’ Racist History\n\n>There’s the explicitly racist language in the Federal Housing Authority’s Underwriting Manual that laid the groundwork for redlining; the government-funded Kerner Commission’s documented findings on the racial uprisings from 1965 to 1968; and the reality that Black Americans were considered to be three-fifths of a person. There’s also the obvious impacts that the genocide of Native Americans and the enslavement of African Americans has had on their descendants.\n\n>The fear of teaching American students how to think critically about race is alarming. If merely thinking about the construct of race is so dangerous, the practice of enforcing political and systemic divisions based on that same construct is even more dangerous. \n\nhttps://www.teenvogue.com/story/critical-race-theory-debate\n\n\nLastly:\n\n**Rick Santorum Slammed for Saying America Was Birthed From Nothing**, There 'Isn't Much Native American Culture'\n\nhttps://www.newsweek.com/rick-santorum-slammed-saying-america-was-birthed-nothing-there-isnt-much-native-american-1586529",
            "title_similarity": "0.5798601",
            "sentiment_compound": -0.8652
        },
        {
            "id": "hg01fwr",
            "score": 251,
            "text": "Yo fuck Christopher Columbus",
            "title_similarity": "0.27667397",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfzv8ft",
            "score": -6,
            "text": "This is like celebrating skyscrapers on 9/11.",
            "title_similarity": "0.47587407",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hg01zat",
            "score": -10,
            "text": "Indigenous, to where? Asia?",
            "title_similarity": "0.1253877",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg041wa",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg0akjr",
            "score": -7,
            "text": "Piece of crap president..pleasing his base of moronic followers...great job sleepy Joe",
            "title_similarity": "0.481178",
            "sentiment_compound": -0.743
        },
        {
            "id": "hg1oznd",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hg1p1wm",
            "score": -7,
            "text": "No it’s Columbus day.",
            "title_similarity": "0.38676125",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg208kg",
            "score": -7,
            "text": "🤣🤣🤣 happy Columbus Day.",
            "title_similarity": "0.47321647",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hfzc0vw",
            "score": 4586,
            "text": "Columbus was an atrocious human being and this has been confirmed by nearly every historical analysis of his time  in the Americas.  Raping, pillaging, enslaving, infecting indigenous people with disease.  This was long overdue.  Especially since it’s clear the Vikings got here long before Columbus.\n\nProtecting our national monuments and parks from pillaging by energy companies is also an overdue move",
            "title_similarity": "0.48685014",
            "sentiment_compound": -0.2111
        },
        {
            "id": "hfzt1kt",
            "score": -9,
            "text": "Great 👍🏼 now I can go to sleep peacefully knowing there is an indigenous peoples day lol great work Biden , keeping the country from falling apart seems to be top priority",
            "title_similarity": "0.60211897",
            "sentiment_compound": 0.9393
        },
        {
            "id": "hfzv8sk",
            "score": -10,
            "text": "hey could he maybe do something about our broken ass country? he’s been mumbling about making the rich “pay their fair share” so long im starting to think he doesn’t know how to do it. Hey remember when we missiled a family of 11 in Afghanistan? Why did he have to do that? Why not just let the family live? What’s up with this vaccine mandate? Theres like… a mandate, but it’s not enforceable i guess? Well then why have the mandate at all? Hey remember when the entire stock market colluded in order to steal money from poor people? Why wont he talk about that? Why wont he arrest those who are guilty? \n\nWe’re literally suffering like sick peasants under grandpa joe but all he seems to care about are statues and holidays 🤔",
            "title_similarity": "0.42468452",
            "sentiment_compound": -0.8362
        },
        {
            "id": "hg00b75",
            "score": -9,
            "text": "Despite this \"good news\", Biden is an international disgrace and will go down as the most corrupt President of all time who abused his power more than anyone ever before. OUr country is going straight into the drain at a rapid pace. In 8 months we've lost our borders, our irresponsible pull out from Afghanistan left behind a militaries worth of gear and weapons and ammo, and now the world has a new nation to answer to: The TALIBAN controlled Afghanistan. Biden instnatly shut down OUR pipelines which gave americans the cheapest fuel ever, and then gave Russia permission to open their pipeline. ALl our enemies are becoming increasingly bold in their missile launches and military movements because they don't respect our country. Crime is through the roof, unemployment is NOT bouncing back, and our economy is in tatters. Meanwhile, all the \"Front line workers\" that you literal fucking idiots spent a year and a half praising are now all being fired from their jobs during a \"scary Pandemic\" becaues they won't get the jab. Interesting that the medical workers who WORK IN THE FUCKING HOSPITALS don't want to get the jab, and even more interesting is that you praised these people as they worked for a year WITHOUT a vaccine, but now all of a sudden they're not important enough. Now, all of a sudden, this horrible scary evil big meanie head virus, looks even meaner and scarier because the \"hospitals are short staffed\".... yeah.... because you just fired all the nurses. \n\nReddit politics represents the literal dumbest and most brainwashed and least-informed group of \"political\" discussions and peopel that the world may actually have ever known. EAch of you is less informed than the last, each of you so easily swayed by simple headlines that are provably false, each of you manipulated by touching on your emotions. It's all so pathetic.",
            "title_similarity": "0.51956344",
            "sentiment_compound": -0.9923
        },
        {
            "id": "hg02yaa",
            "score": -9,
            "text": "What day is white people day? I want one for our white people",
            "title_similarity": "0.55214524",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hg0ddb2",
            "score": -10,
            "text": "Biden going to declare Anti Semitic/Christian/Constitutional Day? Just curious since the Left specializes in that.",
            "title_similarity": "0.39038473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzmkpc",
            "score": -29,
            "text": "Indigenous people…you mean the ones that came here across the land bridge between Russia and Alaska?",
            "title_similarity": "0.39074448",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfztsc3",
            "score": 157,
            "text": "He was also a rapist. Raping indigenous women as young as 10. Las Casas describes him as committing genocide.\n\nFrom Columbus’s diary:\n\n>They ... brought us parrots and balls of cotton and spears and many other things, which they exchanged for the glass beads and hawks' bells. They willingly traded everything they owned... . They were well-built, with good bodies and handsome features.... They do not bear arms, and do not know them, for I showed them a sword, they took it by the edge and cut themselves out of ignorance. They have no iron. Their spears are made of cane... . They would make fine servants.... With fifty men we could subjugate them all and make them do whatever we want.\n\n[Source](https://www.historyisaweapon.com/defcon1/zinncol1.html)\n\nEdit: If anyone wants to read more I've been doing research on this topic lately (specifically the justiifcation of the conquest) and here are some good books/articles:\n\n[\"What Good Can There Be In This Kind of Human?\" Spanish Justification for the Conquest of the Americas](https://cupola.gettysburg.edu/cgi/viewcontent.cgi?article=1243&context=ghj) (Gettysburg Historical Journal)\n\nCurrently love this book: [From Amazons to Zombies: Monsters in Latin America](https://www.amazon.com/dp/B0148Z6272/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1) \n\n[Columbu's Confusion about the New World](https://www.smithsonianmag.com/travel/columbus-confusion-about-the-new-world-140132422/) (Smithsonian Mag)",
            "title_similarity": "0.4109652",
            "sentiment_compound": -0.212
        },
        {
            "id": "hfzwpkm",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hfzzsy0",
            "score": -13,
            "text": "Has he done anything else aside from destroying a economy, dividing the people and opening up the borders to anyone and everyone?",
            "title_similarity": "0.30286378",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hg0coxm",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.0056396797"
        },
        {
            "id": "hfzz4wy",
            "score": -14,
            "text": "Native Americans aren’t indigenous since they originally came from Asia and did what the Europeans later did: travel to a new land. What a bunch of malarkey, Joe.",
            "title_similarity": "0.44939837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzdo2u",
            "score": 73,
            "text": "This is the best tl;dr I could make, [original](https://www.businessinsider.com/joe-biden-indigenous-peoples-day-national-monuments-october-columbus-day-2021-10) reduced by 63%. (I'm a bot)\n*****\n> Following years of campaigning by Native Americans for federal recognition, President Joe Biden issued the first presidential proclamation of Indigenous Peoples&#039; Day, which he declared would be observed on October 11 in honor of America&#039;s first inhabitants.\n\n> &quot;Since time immemorial, American Indians, Alaska Natives, and Native Hawaiians have built vibrant and diverse cultures - safeguarding land, language, spirit, knowledge, and tradition across the generations,&quot; a White House proclamation release from Biden said.\n\n> Although Indigenous Peoples&#039; Day will be celebrated on the same date as Columbus Day, Biden acknowledged the atrocities inflicted on Indigenous communities by European explorers in another proclamation and urged the country not to try and bury &quot;Shameful episodes of our past.\"\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/q4lxv0/biden_declares_october_11_indigenous_peoples_day/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~602714 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Native**^#1 **Biden**^#2 **monuments**^#3 **proclamation**^#4 **Indigenous**^#5",
            "title_similarity": "0.820767",
            "sentiment_compound": 0.9686
        },
        {
            "id": "hfzx256",
            "score": -16,
            "text": "I don’t understand, I thought when we take down confederate statues, we’re doing so in an effort to not celebrate losers that attacked the US government? Why celebrate this then?",
            "title_similarity": "0.44889957",
            "sentiment_compound": 0.2115
        },
        {
            "id": "hg0gfu3",
            "score": 16,
            "text": "Acknowledging Indigenous peoples AND restoring their monuments!? The right won't be happy about this.",
            "title_similarity": "0.5278812",
            "sentiment_compound": -0.2709
        },
        {
            "id": "hfzr540",
            "score": -18,
            "text": "So is Lee getting put back up?",
            "title_similarity": "0.18589145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzpbx5",
            "score": 4225,
            "text": "Great, now do election day",
            "title_similarity": "0.40505266",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfzg5yq",
            "score": -21,
            "text": "Indigenous people day<black history month?",
            "title_similarity": "0.37394628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0d8vg",
            "score": 25,
            "text": "Conservatives and fox are gonna have a meltdown.",
            "title_similarity": "0.30838925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzg72g",
            "score": -29,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg0100b",
            "score": 1198,
            "text": "I was born on October 12th. As a native Alaskan, it's pretty cool to go from sharing a birthday with Columbus Day to sharing a birthday with Indigenous Peoples' Day in my lifetime.",
            "title_similarity": "0.7313411",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hfzldep",
            "score": 3742,
            "text": "If you've never been to Grand Staircase Escalante or the Bears Ears region, you should try to at some point in your life.\n\nIt is an absolutely incredible natural/cultural region in the world. Dwellings of the ancestral Puebloan/Fremont culture are everywhere and the landscape is jaw-dropping.\n\nThis is a massive victory for the area, environmentalists, outdoor enthusiasts, and the Ute, Hopi, Paiute cultures (and more).\n\nJust always be mindful of regulations, don't promote the locations of ruins, leave no trace, etc..\n\nEdit: Yes, I am both saying:\n\n1) IF you visit archaeological sites, not to promote *specific* ruins (i.e. social media / geotagging, etc).\n\n2) That these extremely large regions of public lands are worth visiting if given the opportunity, even if just driving through, and show people just how special they are. People that actually see these lands generally gain a lot more respect for them, along with ideas of supporting preservation and conservation (instead of the drilling and atrocities that were going to take place).\n\nThe best thing about them is you can visit them with zero impact on any of the resources. If you haven't, I highly recommend learning about [Leave No Trace](https://lnt.org/) before going to any public lands.",
            "title_similarity": "0.67999613",
            "sentiment_compound": 0.8233
        },
        {
            "id": "hg0azlb",
            "score": 78,
            "text": "I'm only one native, but thank you.",
            "title_similarity": "0.5173084",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hfzt223",
            "score": 1,
            "text": "Biden",
            "title_similarity": "0.060951933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzthsn",
            "score": 1,
            "text": "Germany is far from being a problem",
            "title_similarity": "0.38258427",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfzufco",
            "score": 1,
            "text": "Let the right wing screaming and bigotry begin.",
            "title_similarity": "0.2152304",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hfzuyon",
            "score": 1,
            "text": "Let's go Brandon",
            "title_similarity": "0.15282544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzvk33",
            "score": 1,
            "text": "Ok but now make voting day a federal holiday",
            "title_similarity": "0.50185436",
            "sentiment_compound": 0.631
        },
        {
            "id": "hfzvkzh",
            "score": 1,
            "text": "This reminds me of that one episode of the Sopranos",
            "title_similarity": "0.31026775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzvuwp",
            "score": 1,
            "text": "Yay?",
            "title_similarity": "0.1436217",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfzwahw",
            "score": 1,
            "text": "A hero!",
            "title_similarity": "0.31195524",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hfzwmlv",
            "score": 1,
            "text": "Just waiting for Conservatives to say he was paid off by “Big Indian” and he doesn’t know what he’s doing because he’s senile. Sadly I’m not being sarcastic.",
            "title_similarity": "0.48230222",
            "sentiment_compound": -0.264
        },
        {
            "id": "hfzx147",
            "score": 1,
            "text": "Yeah bit of a no-brainer here. \n\nMost states were forced to \"drop\" Columbus day for MLK day anyway to keep getting various economic benefits. \n\nAz as an example dropped it to pick up Super Bowls.",
            "title_similarity": "0.4835153",
            "sentiment_compound": 0.5165
        },
        {
            "id": "hfzxeoz",
            "score": 1,
            "text": "Will he actually start protecting natural resources?\n\nBiden \"I will not ban fracking\"\n\nOh yeah just lip service for the shit libs",
            "title_similarity": "0.5025213",
            "sentiment_compound": 0.898
        },
        {
            "id": "hfzxmc3",
            "score": 1,
            "text": "Still not replacing the one for the guy that killed em huh?",
            "title_similarity": "0.26965633",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hfzxx5v",
            "score": 2,
            "text": "Biden is doing some good things",
            "title_similarity": "0.25748724",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfzykiu",
            "score": 2,
            "text": "We need our own Day of Truth and Reconciliation as well",
            "title_similarity": "0.38742834",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfzzfl3",
            "score": 1,
            "text": "And so the next Republican political football was born. It’ll be changed whenever a Republican is elected and then changed back when a democrat is elected. \n\nAlternating Columbus Day/Indigenous Peoples Day every other year is the best compromise. /s",
            "title_similarity": "0.6423102",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hg004fh",
            "score": 2,
            "text": "No brained we need to acknowledge the past what America did to Indians and appreciate there greatness of the Indian tribes and national pride",
            "title_similarity": "0.66537994",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg004zn",
            "score": 1,
            "text": "Hell yeah!",
            "title_similarity": "0.10756375",
            "sentiment_compound": -0.5707
        },
        {
            "id": "hg005sn",
            "score": 1,
            "text": "So Columbus Day is over?\n\nAlso are they removing Mt Rushmore?",
            "title_similarity": "0.3836137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg005ug",
            "score": 1,
            "text": "Oh man, r/conservative are gonna be pissed.",
            "title_similarity": "0.1849117",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hg00rfo",
            "score": 1,
            "text": "Easy stuff first, right joe",
            "title_similarity": "0.38639298",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg00v3w",
            "score": 1,
            "text": "Maybe give them some land back instead of shallow symbolism?",
            "title_similarity": "0.13651317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg01997",
            "score": 1,
            "text": "I mean, it doesn't have the same ring as \"National Rape, Pillage, Enslave, and Murder People Day.\"",
            "title_similarity": "0.31915617",
            "sentiment_compound": -0.9382
        },
        {
            "id": "hg01edd",
            "score": 1,
            "text": "Im still waiting on Biden to sign an executive order for the removal of Confederate Monuments on federal land. And rename places honoring confederate insurrectionists. \n\nhttps://en.wikipedia.org/wiki/List_of_Confederate_monuments_and_memorials",
            "title_similarity": "0.3794103",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hg01tpa",
            "score": 1,
            "text": "So just literally THIS October 11? I don’t see anything in the article indicating that this is a permanent change.",
            "title_similarity": "0.43274242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg01zxr",
            "score": 1,
            "text": "Taje note Biden, if you're invited to any ceremony on that day, don't go surfing.",
            "title_similarity": "0.36178488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg021xd",
            "score": 1,
            "text": "Hmm, maybe it's the easiest thing to do so far for you because it is generally easier to positively encourage and build-up one group's than it is two forcibly deconstruct and erase pieces of another group's culture...",
            "title_similarity": "0.50048983",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hg02ie0",
            "score": 1,
            "text": "So it’s no longer Columbus Day?",
            "title_similarity": "0.25404322",
            "sentiment_compound": -0.3566
        },
        {
            "id": "hg02zqy",
            "score": 1,
            "text": "Just don’t go surfing that day",
            "title_similarity": "0.20143284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg03s2z",
            "score": 3,
            "text": "So do I have this day off now or what?",
            "title_similarity": "0.26094216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg03tm0",
            "score": 1,
            "text": "Hopefully he doesn't go on vacation like our Prime Minister did...on Canada's first Truth and Reconciliation Day. What a joke...blew off invites from some of the First Nations groups in BC.",
            "title_similarity": "0.48749775",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hg04vp3",
            "score": 4,
            "text": "Technically it’s indigenous peoples day too in Canada as Columbus Day is our thanksgiving 😅",
            "title_similarity": "0.52360827",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hg058zk",
            "score": 5,
            "text": "Aw that’s a great idea",
            "title_similarity": "0.30790085",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg05f0p",
            "score": 3,
            "text": "I love it!",
            "title_similarity": "0.28812099",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hg05kq6",
            "score": 1,
            "text": "So do I get school off now?",
            "title_similarity": "0.20446664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg05zxz",
            "score": 1,
            "text": "Wasn’t this last year too?",
            "title_similarity": "0.26226938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg063jw",
            "score": 1,
            "text": "Dam let’s go Brandon!",
            "title_similarity": "0.17752644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg06e0h",
            "score": 1,
            "text": "I thought that Columbus day was indigenous peoples day...",
            "title_similarity": "0.47599387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg06jdm",
            "score": 1,
            "text": "Thanks for taking Canadian thanksgiving!",
            "title_similarity": "0.5278754",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hg06mvu",
            "score": 1,
            "text": "Wasn’t it already?",
            "title_similarity": "0.11726992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg06svy",
            "score": 1,
            "text": "People are weird.",
            "title_similarity": "-0.06570195",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hg06xza",
            "score": 1,
            "text": "Bout time. Took long enough",
            "title_similarity": "0.16915017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg070in",
            "score": 1,
            "text": "Would have been really easy to cancel pipelines and restore treaty rights.....",
            "title_similarity": "0.55116093",
            "sentiment_compound": 0.4818
        },
        {
            "id": "hg075ym",
            "score": 1,
            "text": "Now he better learn from prime minister Trudeau and not skip the holiday he just made",
            "title_similarity": "0.50408",
            "sentiment_compound": 0.1635
        },
        {
            "id": "hg07z2u",
            "score": 1,
            "text": "ok but can you tell my job to give us the day off then",
            "title_similarity": "0.39090842",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hg087f5",
            "score": 2,
            "text": "What will protect this legislation from being rolled back in the future?  Will this have any staying power?",
            "title_similarity": "0.22271618",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hg08ukv",
            "score": 1,
            "text": "Does this mean we have monday off again?",
            "title_similarity": "0.323895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg090g2",
            "score": 1,
            "text": "Is it always October 11th? Or will it be second Monday?",
            "title_similarity": "0.40608656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0971h",
            "score": 2,
            "text": "I grew up in Utah. Went to SUU. Rode motorcycles (on dirt roads) all over those areas before wilderness designations.\n\nBeautiful.\n\nStunning.\n\nBreathtaking.\n\nI miss “home.”",
            "title_similarity": "0.43119445",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hg09gj9",
            "score": 2,
            "text": "This is a good for everyone (im pretty sure)",
            "title_similarity": "0.3767262",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hg09ikx",
            "score": 2,
            "text": "Would this include Mt. Rushmore? Was that not sacred land before we defaced it with literal faces?",
            "title_similarity": "0.41493154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg09jgs",
            "score": 2,
            "text": "Virgina Company <3",
            "title_similarity": "0.18883927",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg09m2n",
            "score": 4,
            "text": "Not only the easiest but probably the best thing he's done so far.",
            "title_similarity": "0.5757295",
            "sentiment_compound": 0.7298
        },
        {
            "id": "hg09oby",
            "score": 6,
            "text": "Awesome about TIME ❤️❤️❤️❤️❤️😎❤️❤️😁😎❤️❤️❤️",
            "title_similarity": "0.34731787",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hg09oh8",
            "score": 2,
            "text": "I thought this was already a thing? Maybe I’m getting it wrong but I clearly remember in school having an indigenous peoples day and having them come to our school to talk to us about their culture and building our own teepees and eating specialty dishes as well.",
            "title_similarity": "0.45607775",
            "sentiment_compound": 0.631
        },
        {
            "id": "hg0a2iw",
            "score": 1,
            "text": "It’s all about kicking the can down the road further. I’m genetically “Italian”, yet the history of Columbus was never ethnically described to me. This whole thing is now left on our doorstep to take care of stuff that we shouldn’t be arguing about. It stresses me out, I’m glad to have more definition on it finally.",
            "title_similarity": "0.48430032",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hg0akol",
            "score": 1,
            "text": "Celebrating the people we took the land from. Merica",
            "title_similarity": "0.54435825",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hg0apiq",
            "score": 1,
            "text": "https://nick-nacks-plus.com",
            "title_similarity": "0.24396303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0auac",
            "score": 5,
            "text": "What's funny is that Columbus never set foot in America. LOL.",
            "title_similarity": "0.41207218",
            "sentiment_compound": 0.7531
        },
        {
            "id": "hg0b774",
            "score": 2,
            "text": "Hell yeah. What's next?",
            "title_similarity": "0.043921847",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hg0bp05",
            "score": 2,
            "text": "Neato. Kill the filibuster.",
            "title_similarity": "0.1920909",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hg0bx81",
            "score": 1,
            "text": "a symbolic victory",
            "title_similarity": "0.3573293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0c2l6",
            "score": 1,
            "text": "L moves",
            "title_similarity": "-0.04743162",
            "sentiment_compound": 0.5766
        },
        {
            "id": "hg0c6ae",
            "score": 2,
            "text": "Here’s the important question: will he cut the plans for pipelines that got through reservations, which thus make the local water safe to drink",
            "title_similarity": "0.38018402",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hg0crwe",
            "score": 2,
            "text": "Follow the link from that article to the official whitehouse.gov website. It literally says\n\n“NOW, THEREFORE, I, JOSEPH R. BIDEN JR., President of the United States of America, do hereby proclaim October 11, 2021, as Columbus Day.”\n\nPlease explain to me where it says Indigenous People’s day?",
            "title_similarity": "0.5784514",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg0cu04",
            "score": 3,
            "text": "Pretty cool that thats the same day as my birthday",
            "title_similarity": "0.54909605",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hg0d07s",
            "score": 2,
            "text": "Cool can he do something about the economy now that this kind of important stuff is done with?",
            "title_similarity": "0.39098966",
            "sentiment_compound": 0.4228
        },
        {
            "id": "hg0d3ay",
            "score": 2,
            "text": "Cool. Can we get to the reconciliation and infrastructure bills now?",
            "title_similarity": "0.3311054",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hg0d8w4",
            "score": 2,
            "text": "Anybody remember Native American Heritage Day? Just asking.",
            "title_similarity": "0.45898232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0e1j6",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg0edx1",
            "score": 3,
            "text": "About damn time!",
            "title_similarity": "0.2083444",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hg0emtd",
            "score": 1,
            "text": "Free day off school, let’s gooo!",
            "title_similarity": "0.54149956",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hg0eq1t",
            "score": 2,
            "text": "So when do we start getting these days off?",
            "title_similarity": "0.23113234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0equ2",
            "score": 1,
            "text": "Where does he plan on surfing that day?\n- Canada",
            "title_similarity": "0.34061363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0fdof",
            "score": 8,
            "text": "Thanks to Biden, and this cool guy at work; i even got the day off. nice.",
            "title_similarity": "0.6166817",
            "sentiment_compound": 0.8087
        },
        {
            "id": "hg0fs5h",
            "score": 1,
            "text": "fucking up eco was kinda easy too lol",
            "title_similarity": "0.48614573",
            "sentiment_compound": 0.6302
        },
        {
            "id": "hg0g0qr",
            "score": 1,
            "text": "😎 Vague 😎",
            "title_similarity": "0.054796826",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hg0g0st",
            "score": 1,
            "text": "I’d hope so",
            "title_similarity": "0.18089914",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg0h2ks",
            "score": 3,
            "text": "Love it",
            "title_similarity": "0.24141815",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hg0hg73",
            "score": 1,
            "text": "Let’s goo",
            "title_similarity": "0.086129494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0hi73",
            "score": 3,
            "text": "In Canada, the 11th is thanksgiving.",
            "title_similarity": "0.4539861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0i64e",
            "score": 5,
            "text": "Does it come with a day off?",
            "title_similarity": "0.21321553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0kgnw",
            "score": 1,
            "text": "That means public holiday for working folks?",
            "title_similarity": "0.4028688",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg0oc2d",
            "score": 2,
            "text": "So kinda like Canada or at least BC's Truth and reconciliation day?",
            "title_similarity": "0.40907168",
            "sentiment_compound": 0.5839
        },
        {
            "id": "hg0oxyk",
            "score": 2,
            "text": "Let's hope he does not permit any pipelines to be constructed through these monuments of which he speaks.",
            "title_similarity": "0.23964436",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg0qghf",
            "score": 2,
            "text": "So is that a day off?",
            "title_similarity": "0.21567373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0qhhz",
            "score": 2,
            "text": "Welp. I never realized but my wedding anniversary seems to be Indigenous Peoples' Day. That's a wonderful coincidence.",
            "title_similarity": "0.66502446",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hg0r7fe",
            "score": 4,
            "text": "My clientele is all boomers and when they ask why we have the day off because our signs say National Holiday, I say it’s Indigenous People’s Day. They don’t understand. You mention Columbus and they get upset we took all the statues and monuments down. It’s frustrating.",
            "title_similarity": "0.49184546",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hg0rku2",
            "score": 2,
            "text": "Why not just make thanksgiving indigenous peoples day? Or do they have two totally different undertones/purposes?",
            "title_similarity": "0.39601892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0rkue",
            "score": 1,
            "text": "Canada did it first",
            "title_similarity": "0.40562987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0s1my",
            "score": 1,
            "text": "Protip from a Canadian: Do not go for a family vacation to Tofino on that day!",
            "title_similarity": "0.38643688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0shmd",
            "score": 1,
            "text": "Ngl I thought it was a pride picture for a sec.",
            "title_similarity": "0.4130078",
            "sentiment_compound": 0.34
        },
        {
            "id": "hg0su8a",
            "score": 6,
            "text": "Our National Park system is one of the greatest things our country has ever done it should never be controversial to support and improve the parks.",
            "title_similarity": "0.7660543",
            "sentiment_compound": 0.8858
        },
        {
            "id": "hg0t07r",
            "score": 2,
            "text": "Should fly to Tofino",
            "title_similarity": "0.19192705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0t6mg",
            "score": 1,
            "text": "Cool. Now make state recognition get the same benefits as federally recognized tribes.",
            "title_similarity": "0.63069",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hg0tcek",
            "score": 1,
            "text": "Fuck Republicans, it’s past the point of empathy, they all need to be “space jewed”, as Dave chapelle said",
            "title_similarity": "0.4133212",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hg0tqno",
            "score": 2,
            "text": "So are they going to tear down Mt. Rushmore and give it back to the Lakota?",
            "title_similarity": "0.35926172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0u0a7",
            "score": 1,
            "text": "I'd say what was even easier was how fast the Vaccine rolled out once he was elected. It was literally within the first week!",
            "title_similarity": "0.70379776",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hg0uz5k",
            "score": 2,
            "text": "First of all what does he mean by restoring national monuments and secondly who cares about the name, most people only get a brief moment of interest because its the only day in October you get off from school",
            "title_similarity": "0.646422",
            "sentiment_compound": 0.802
        },
        {
            "id": "hg0v3x7",
            "score": 2,
            "text": "The originals",
            "title_similarity": "0.2825948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0vr1t",
            "score": 2,
            "text": "I wonder if I'm the only one who takes issue with its being a direct swap, i.e. one for the other. I would rather see an Indigenous People's Day be celebrated in its own right on a new date, rather than giving them Columbus' used holiday. Under such a scenario, one would then cancel the Columbus Day holiday as a separate act. It makes them look second-best by reusing the same day rather than giving them a new day.",
            "title_similarity": "0.51709783",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hg0w2mk",
            "score": 2,
            "text": "since a lot of people here seem to be misinformed on their hatred for colombus watch [this](https://youtu.be/ZEw8c6TmzGg)",
            "title_similarity": "0.110777",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hg0w8id",
            "score": 1,
            "text": "Did he then cross the country in a Government jet to take a surf vacation on the day of?",
            "title_similarity": "0.36764705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0wvcj",
            "score": 1,
            "text": "N                       \n    Tttmm",
            "title_similarity": "0.14433801",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0xzyf",
            "score": 2,
            "text": "Thats so awesome. Treasure our national monuments and protect them instead of turning them into a residential and commercial area like Trump wanted to do.",
            "title_similarity": "0.61994755",
            "sentiment_compound": 0.8995
        },
        {
            "id": "hg0y9df",
            "score": 1,
            "text": "Yeah how about he gives some of that land back.\n\nI'm sure if given the option between a national holiday and their land back they would choose to have their land back.",
            "title_similarity": "0.41003954",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hg0yb70",
            "score": 1,
            "text": "I've used ones similar to that. For science!",
            "title_similarity": "0.30064595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0yds1",
            "score": 1,
            "text": "this happened years ago wut",
            "title_similarity": "0.27832654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0yhxz",
            "score": 1,
            "text": "Oh hey, now I can say my b-day is on a holiday",
            "title_similarity": "0.45274603",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg0zdww",
            "score": 1,
            "text": "Good. Now do Oak Flats in Arizona.",
            "title_similarity": "0.472207",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg0zhoq",
            "score": 1,
            "text": "Good start, but a long ways to go for sure.\n\nSome official reports should be done regarding murdered and missing Indigenous women and girls like it was done only a few years back in Canada:\nhttps://www.mmiwg-ffada.ca/final-report/\n\nThere were similar things in the US like the so-called “residential schools” - this should also be officially investigated with sharing resources with Canadian governmental agencies and Indigenous communities. What will be found is that many serial predatory abusers were shifted across boarders to do the same depraved, degenerate acts on the vulnerable members of society with many children being buried in unmarked graves as well as many babies born from rapes and sexual exploitation were also killed in brutal inhumane ways.",
            "title_similarity": "0.3688808",
            "sentiment_compound": -0.976
        },
        {
            "id": "hg0zlbe",
            "score": 1,
            "text": "No one tell the republicans about this, they will try and deport these illegals…. (Oops forgot to add /s) before it goes /woosh",
            "title_similarity": "0.32997158",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg107jx",
            "score": 1,
            "text": "But is Biden/Democrats stopping Line 3 like Indigenous & environmental groups are asking him to do?! It’s easy to declare a holiday, but that’s hardly doing meaningful work for communities.",
            "title_similarity": "0.5426318",
            "sentiment_compound": 0.9113
        },
        {
            "id": "hg10brs",
            "score": 1,
            "text": "How about instead of a monument you stop line 3, or line 5",
            "title_similarity": "0.2154461",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg10wc2",
            "score": 1,
            "text": "oh okay. well mount rushmore is in bad shape. he can start there",
            "title_similarity": "0.25157166",
            "sentiment_compound": -0.128
        },
        {
            "id": "hg1293q",
            "score": 1,
            "text": "Does this mean Columbus Day doesn’t exist anymore? Or is this just for this year?",
            "title_similarity": "0.33747026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg12ry8",
            "score": 1,
            "text": "Everyone liked that. But seriously who would even have a problem with this.",
            "title_similarity": "0.3895724",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hg12sfs",
            "score": 1,
            "text": "Republicans melding right now",
            "title_similarity": "0.33991054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg132v7",
            "score": 1,
            "text": "I think more than a day is needed, but it's a start 💁🏽‍♀️",
            "title_similarity": "0.36004388",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hg13bib",
            "score": 4,
            "text": "The restoring of national monuments was a huge issue for a few of my good friends. Several of my fellow paleontologists do work in those regions, and their work was at risk when the orange buffoon planned to cut down on those parks. I was heartbroken on their behalf. Biden is far from perfect, but compared to 45 he is a breath of fresh air.",
            "title_similarity": "0.5651057",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hg13hzd",
            "score": 1,
            "text": "Cool but... when will you free the natives that are in prison for rightfuly defending their land?",
            "title_similarity": "0.41398466",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hg13lql",
            "score": 1,
            "text": "Continued to say. \"Really this place is a mess, this was literally the easiest thing.\"",
            "title_similarity": "0.5526175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hg141k5",
            "score": 2,
            "text": "Thanks for the land\nSorry we fucked you over and over again by reneging treaties since we arrived also here's a day off",
            "title_similarity": "0.4523809",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hg145ep",
            "score": 3,
            "text": "Wholeheartedly agree with this decision.",
            "title_similarity": "0.34919387",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hg14r9b",
            "score": 1,
            "text": "Does this mean I get off Monday?",
            "title_similarity": "0.35516876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg15txe",
            "score": 1,
            "text": "Awesome, this is great.",
            "title_similarity": "0.3017565",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hg1621n",
            "score": 1,
            "text": "Fuck yea daddy joe",
            "title_similarity": "0.27581123",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hg1623z",
            "score": 1,
            "text": "Had a college class discussion about doing just that 5 years ago, crazy it took until now for it to actually happen, good on Biden.",
            "title_similarity": "0.37223104",
            "sentiment_compound": 0.128
        },
        {
            "id": "hg16o77",
            "score": 1,
            "text": "Silvia Dante is fucking pissed",
            "title_similarity": "0.093458205",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hg17363",
            "score": 1,
            "text": "Owww",
            "title_similarity": "0.031219592",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg17dbf",
            "score": 1,
            "text": "Next easiest thing he can do would be to end casino monopolies and aid to that crap.",
            "title_similarity": "0.4783619",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hg17fcy",
            "score": 1,
            "text": "That’s got. But does it mean the native Americans will be treated any better by the federal government?",
            "title_similarity": "0.5029823",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hg17nkp",
            "score": 2,
            "text": "I hate to be the guy, but “declaring” a holiday really means very little if they can’t normalize it to be a federal holiday (for both public and private)\n\nIt’s easy to pay lip service and say “xyz” is a holiday, but harder to not piss off the capitalist overlords by making people actually have free time (if they do please) to recognize that day\n\nFor instance, MLK is a federal holiday, but most private companies don’t give it as a day off or anything. Mostly means it’s a normal day at the office for a lot of Americans even though it is a historic day",
            "title_similarity": "0.59751314",
            "sentiment_compound": 0.9785
        },
        {
            "id": "hg185mn",
            "score": 1,
            "text": "So….about that amount Rushmore…..",
            "title_similarity": "0.18742381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg189vy",
            "score": 1,
            "text": "Does that mean Columbus Day is gone??",
            "title_similarity": "0.22692122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg19rk7",
            "score": 1,
            "text": "Canadian here.  Hey Joe, I dig alot of your platform, word of advice and don't go on vacation that day.",
            "title_similarity": "0.481786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1cbiq",
            "score": 1,
            "text": "Time to rename Columbus Circle in NYC. Andrew Cuomo was the obstacle to calls for this, now’s the time, call it DaVinci circle or something, in fact, a Renaissance man would be ideal considering the artistic influence NYC has if you wanna cater to Italian-Americans.",
            "title_similarity": "0.41703826",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hg1cyvg",
            "score": 4,
            "text": "Then he needs to start freeing up the stolen land and giving support to help restore the nations that were robbed, raped and killed.",
            "title_similarity": "0.39374763",
            "sentiment_compound": -0.296
        },
        {
            "id": "hg1dije",
            "score": 1,
            "text": "These are the things",
            "title_similarity": "0.07394005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1en6f",
            "score": 1,
            "text": "I'm glad that Biden is probably smart enough to not go surfing on a newly created holiday to recognize indigenous peoples. Unlike a prime minister I know.",
            "title_similarity": "0.6510409",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hg1ezri",
            "score": 1,
            "text": "I bet it was...",
            "title_similarity": "0.16513687",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1f02x",
            "score": 2,
            "text": "Damn. It's so easy when white men in power decide to do the right thing. Things just happen.",
            "title_similarity": "0.59923595",
            "sentiment_compound": 0.1263
        },
        {
            "id": "hg1hqes",
            "score": 2,
            "text": "Great, now give the native Americans back black hills",
            "title_similarity": "0.30205315",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg1i45e",
            "score": 1,
            "text": "Another paid federal holiday?",
            "title_similarity": "0.44185477",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg1iax4",
            "score": 1,
            "text": "You might as well be in the Constitution...",
            "title_similarity": "0.24727741",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hg1ijnh",
            "score": 1,
            "text": "Still laughing at an article I read that quoted Romney where he claimed this would be bad for the American Indians in his state and it was one of the most absurd thing I’ve ever read",
            "title_similarity": "0.4488625",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hg1iw8g",
            "score": 1,
            "text": "It was already on my calendar tho",
            "title_similarity": "0.30304915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1jrvo",
            "score": 1,
            "text": "lets go brandon",
            "title_similarity": "0.16704562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1kjgn",
            "score": 2,
            "text": "Indigenous Peoples' Day is my favorite time of the year!",
            "title_similarity": "0.69434106",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hg1kwqc",
            "score": 1,
            "text": "Nice.",
            "title_similarity": "0.19351986",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg1l4su",
            "score": 2,
            "text": "love it, fuck columbus",
            "title_similarity": "0.403052",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hg1lds4",
            "score": 1,
            "text": "Now add the funding for the 800 LE Rangers that the NPS is short of so someone can actually protect the National Parks.",
            "title_similarity": "0.6841401",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hg1logp",
            "score": 1,
            "text": "God save us from ourselves.\n\nPlease",
            "title_similarity": "0.2725454",
            "sentiment_compound": 0.765
        },
        {
            "id": "hg1mnlk",
            "score": 3,
            "text": "Finally, fuck Columbus Day\n\nGenocidal, incompetent prick that he was.",
            "title_similarity": "0.23968382",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hg1mpa1",
            "score": 1,
            "text": "Nice.\n\nDon’t go to Tofino BC, Canada on that day.",
            "title_similarity": "0.38407886",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hg1mtp4",
            "score": 1,
            "text": "I think recognition of indigenous people is great. And teaching our children about the horrors of colonization is essential. That preservation of natural lands for future generations to enjoy is important.\n\nBut..\n\nAs the history of America did not begin when settlers arrived, so too it did not begin the day before. The peoples in those regions that day were not the first to settle there. They too had their battles, their wars, legacies of violence and shame.",
            "title_similarity": "0.533758",
            "sentiment_compound": -0.9489
        },
        {
            "id": "hg1nb2d",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg1ox3f",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.018709786"
        },
        {
            "id": "hg1p9li",
            "score": 1,
            "text": "Is it Oct 11th every year or is it the second Monday in October.",
            "title_similarity": "0.4013121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1xw30",
            "score": 2,
            "text": "Great Spirit be praised",
            "title_similarity": "0.29787427",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hg1y7uq",
            "score": 2,
            "text": "Well damn, This is really awesome",
            "title_similarity": "0.32470828",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hg211e3",
            "score": 4,
            "text": "Does this mean Columbus Day is finally gone?",
            "title_similarity": "0.30366474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg22jjn",
            "score": 5,
            "text": "Yes! Love this!",
            "title_similarity": "0.26794517",
            "sentiment_compound": 0.8168
        },
        {
            "id": "hg24a0r",
            "score": 6,
            "text": "Never saw that coming! This is great news!",
            "title_similarity": "0.4836694",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hg26laf",
            "score": 2,
            "text": "Christopher Who?",
            "title_similarity": "0.10509537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg272ez",
            "score": 1,
            "text": "Wait so is that a day off work?\n\nEither way good news.",
            "title_similarity": "0.5104761",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hg27ojr",
            "score": 1,
            "text": "Do I still get a day off from school?",
            "title_similarity": "0.32763094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg2bfad",
            "score": 1,
            "text": "On my mother's side of the family, there's full-blooded Cherokee. I have always loved the outdoors, bushcraft, learning to live off the land, build natural shelters, etc. I must say, though...this sort of parade thing in the photos looks more like an attempt to \"modernize\" the culture so as to be \"acceptable\" to today's culture. I haven't seen most of those specific colors on any Native American stuff. Is this the Pride version of Indigenous Peoples' Day or what? Or did they really want to beef up the colors to appeal to today's youth who are so ADD and ADHD that they need bright colors to help them notice anything? While many tribes do use bright color patterns in general, they are more traditional and not like these \"modern art\" decorations of coloring and clothing.",
            "title_similarity": "0.6278297",
            "sentiment_compound": 0.9649
        },
        {
            "id": "hg2citk",
            "score": 1,
            "text": "Ingenious Peoples Day? Who needs that? The Vikings were the first people in the Americas, not Columbus. We need Leif Erikson Day.",
            "title_similarity": "0.6713866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg2esmq",
            "score": 1,
            "text": "I just hope he doesn’t take a vacation day like a certain Canadian Prime Minister 🤬",
            "title_similarity": "0.39556852",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hg2hpqq",
            "score": 2,
            "text": "A new way I’ve come around to demonstrating just how long many indigenous people have been on their lands. There were Wampanoag in Massachusetts before there were English in England.",
            "title_similarity": "0.44769847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg2hwlg",
            "score": 2,
            "text": "The Obama administration was apparently really active about reclaiming tribal lands so it's not surprising to me that Biden would feel comfortable going this direction \n\nEasy win, imo",
            "title_similarity": "0.6813153",
            "sentiment_compound": 0.8982
        },
        {
            "id": "hg2qdz4",
            "score": 1,
            "text": "I'm British but this is awesome! \nI've always loved the natives and their culture, I'm glad it's finally getting the recognition it deserves",
            "title_similarity": "0.6584321",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hg2qwui",
            "score": 2,
            "text": "Definitely the right decision.  (White male, 57). \nThank you for this.",
            "title_similarity": "0.5713158",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hg33b98",
            "score": 2,
            "text": "Not only does Columbus Day essentially represent genocide, as of 2004 we have convincing proof that Columbus himself was pretty much a complete asshole. As unsurprising as that should be, we definitely shouldn't have a special day for this dude or any other, really. Why did it take this long to make a simple change to a federal holiday? Why is it so hard for people to accept justified change? We didn't do anything wrong before per se -- at worst we were naive. We have more information and perspective now and need to use it to correct these mistakes once we identify them. \"Indiginous Peoples' Day\" will never work, however. You've now flipped the script and defining winners and losers in this decision and it's not going to end well. The people protestings masks in schools will end up wearing Christopher Columbus hats and start protesting indinginous people for taking away their hero who they didn't even care about until now. You can't flip it like that and expect it to work -- might as well call it \"OJ Simpson Day\" honestly. Less than half of the country is onboard and the new label doesn't flow at all. I fully support the change but even I feel ridiculous saying the name outloud. Everyone is rolling their eyes at me when I say it -- even indiginous people! This will only lead to a bigger divide and less understanding... and half of the country won't even acknowledge the change period. If this holiday were a cryptocurrency, we'd have a fork in the chain and it would end up being a mess. It's gotta work on a superficial level before you bother going deeper into it and this gets snagged up. Maybe the best way to move forward isn't honoring individuals or groups anymore whether it's a federal holiday or a creepy statue. We spend too much time worshipping individuals, breaking people down into groups, obsessing over & a la carte accomplishments as if this stuff happened in a vacuum. We're standing on the shoulders of all those things but our primary objective should be looking forward and cooperation not division, no matter how ridiculous. We need to start viewing the world and each other differently. If somebody else gains something it doesn't have to mean you lose something. However, if we aren't celebrating something that everybody can be a part of, maybe it shouldn't be a federal holiday. I agree this should be the name... but we need to start winning people back we've lost all connection with because we need them. We need everybody. What should we name this amazing inclusive holiday? Has to be catchy. Has to really zip. My vote: \"Shark Week\"",
            "title_similarity": "0.5852625",
            "sentiment_compound": 0.9694
        },
        {
            "id": "hg3a7zk",
            "score": 2,
            "text": "But he didn’t remove Columbus Day?",
            "title_similarity": "0.29211605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg3ge5z",
            "score": 2,
            "text": "I wonder if the wingnuttosphere realizes that renaming Columbus Day 'Indigenous People's Day\" is encompassed by Critical Race Theory?",
            "title_similarity": "0.3855418",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hg3hefz",
            "score": 1,
            "text": "Yay, new holiday!",
            "title_similarity": "0.42655915",
            "sentiment_compound": 0.75
        },
        {
            "id": "hg3ja4l",
            "score": 3,
            "text": "Still here waiting for that min wage increase he campaigned on or pretty much anything else since everything he ran on he’s already caved in and we aren’t getting.\n\nBut I guess token gestures like this are cool too.",
            "title_similarity": "0.54265964",
            "sentiment_compound": 0.8381
        },
        {
            "id": "hg3ks35",
            "score": 1,
            "text": "I just cried. My ancestors are a little more at peace.",
            "title_similarity": "0.39500815",
            "sentiment_compound": 0.2298
        },
        {
            "id": "hg3skxw",
            "score": 2,
            "text": "It's about time. Indigenous Peoples helped the 'colonists' establish themselves here, until the colonists started singing and dancing their usual theme song \"We Own This Land and You Don't\"",
            "title_similarity": "0.6030948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg3uap3",
            "score": 1,
            "text": "Interesting to see political parties from different countries working in tandem.\n\nIn this case Canada who recently had a holiday for indigenous people as well. So now the U.S. follows suits.\n\nWhy are they working this way? Something to do with the U.N. agenda I believe. Maybe someone else knows more?",
            "title_similarity": "0.4125365",
            "sentiment_compound": 0.8611
        },
        {
            "id": "hg4192u",
            "score": 1,
            "text": "I bet, because getting out of bed and remembering his name is hard for him.",
            "title_similarity": "0.23191269",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hg46cia",
            "score": 1,
            "text": "As an Italian I still hope we celebrate Columbus Day, it’s usually an awesome day. Lots of good food,  carnival rides for the kids, parades, etc",
            "title_similarity": "0.512119",
            "sentiment_compound": 0.9274
        },
        {
            "id": "hg4apu6",
            "score": 1,
            "text": "If its even biden making the decision.",
            "title_similarity": "0.0927747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg4byn0",
            "score": 1,
            "text": "It seems to me that man didn’t really create anything, they just inhabit. We are all indigenous of the planet. Where we settle is irrelevant or important. We cannot claim we “own” a specific region, as anyone that attempts to move in or take over or conquer that region, history tells us that as time goes on, the cycle repeats. GOD is the creator, man is just a temporary inhabitant.",
            "title_similarity": "0.49583703",
            "sentiment_compound": 0.7207
        },
        {
            "id": "hg4py5t",
            "score": 1,
            "text": "That's because he fully intends for all of us to be living indigenous lifestyles by this time next year.",
            "title_similarity": "0.64965576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg4usou",
            "score": 1,
            "text": "People really need to stop living in the past",
            "title_similarity": "0.120517336",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hg50b01",
            "score": 1,
            "text": "Why has it taken this long??",
            "title_similarity": "0.08709944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg5629o",
            "score": 1,
            "text": "And leaves us a remarkably short two days to plan a holiday. Now when do we get a paid day off",
            "title_similarity": "0.4931284",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hg5xg21",
            "score": 1,
            "text": "That guy in the pick isn’t even Native.",
            "title_similarity": "0.17940213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg69qzw",
            "score": 1,
            "text": "We need to restore land not just monuments",
            "title_similarity": "0.29051906",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgbb9qg",
            "score": 1,
            "text": "Happy Indigenous People's Day!",
            "title_similarity": "0.5428549",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hghsdfv",
            "score": 1,
            "text": "Mejor celebrarla el 4 de julio... 😉",
            "title_similarity": "0.28107023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgnff3r",
            "score": 1,
            "text": "now give the land back",
            "title_similarity": "0.1733834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgrmti4",
            "score": 2,
            "text": "I am digging this move tbh.",
            "title_similarity": "0.20096055",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgzznrm",
            "score": 1,
            "text": "Biden is a disgrace and embarrassment to this country",
            "title_similarity": "0.20115131",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hh260t1",
            "score": 1,
            "text": "He should actually do something as President instead of making fake holidays and shit",
            "title_similarity": "0.5637085",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hhxq4ci",
            "score": 1,
            "text": "SMH joe Biden has and will always hate the Italian people we will always have our accomplishments swept from history",
            "title_similarity": "0.34002316",
            "sentiment_compound": -0.7739
        },
        {
            "id": "hicfhk6",
            "score": 1,
            "text": "LMAO, Columbus Day, that senile buffoon.",
            "title_similarity": "0.33436298",
            "sentiment_compound": 0.6841
        },
        {
            "id": "hjddb8n",
            "score": 1,
            "text": "Kudos for Native American out west.  Eastern ones still exist but are big biz.  Never got why western are still in poverty.",
            "title_similarity": "0.44193843",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hjhmo0j",
            "score": 1,
            "text": "Research the Aztecs dumbass…..",
            "title_similarity": "0.25748882",
            "sentiment_compound": 0.0
        }
    ]
}