{
    "Stacey Abrams PAC wipes out $212 million in medical debt for 108,000 people in 5 states\n": [
        {
            "id": "hk26445",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.16709363",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hk2d1ka",
            "score": 1,
            "text": "Let that be a lesson for you Joe Biden...Student Debt Relief is next and can cement you as a great president...You can do it by yourself...don't be a pussy Joe it's time to deliver to the people every way we can and the time is now...Make the other infrastructure bill irrelevant to you personally and it will pass because the people want it the opposition mostly want's to hurt you...Can you imagine the boost to our economy it will be huge!",
            "title_similarity": "0.4160896",
            "sentiment_compound": 0.784
        },
        {
            "id": "hk28zgm",
            "score": 12,
            "text": "I wonder how many of those 108k will either not vote in 2022 or vote Republican because 'CRT just doesn't belong in our schools'.",
            "title_similarity": "0.4988039",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2es7d",
            "score": -15,
            "text": "This seems pretty damn suspect...\n\nFrom the article:\n\"The Fair Fight Political Action Committee donated a total of $1.34 million to the nonprofit organization RIP Medical Debt to clear debts that carried a face value of $212 million, the Associated Press reported.\"\n\nShe paid off 212 million in debt for 1.34 million?  About half a penny per dollar owed?  They forgave 99.5% of the debt?\n\nThat's about $12/person?\n\nYeah, something's a little fishy here.",
            "title_similarity": "0.82498026",
            "sentiment_compound": 0.264
        },
        {
            "id": "hk2b83l",
            "score": -1,
            "text": "Phew, now that my medical bills are taken care of, I can go back to voting for the racists!",
            "title_similarity": "0.44957995",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hk2g7av",
            "score": -14,
            "text": "I mean that's great and all, but how is paying people's medical bills considered a political action?  At what point are we going to recognize political action committees are just bribe cover?",
            "title_similarity": "0.47428274",
            "sentiment_compound": 0.1803
        },
        {
            "id": "hk35f10",
            "score": 0,
            "text": "Buying votes",
            "title_similarity": "0.115307525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2d617",
            "score": 9,
            "text": "It's crazy that the Democrats are both Stacey Abrams, out there trying to do real good; and Joe Biden, trying to protect the oligarchy and former Administration. And when they lose, they won't point at Corporate Joe, they will blame others, and fail to learn that the only thing the people really need is folk like Stacey,  trying to do good.",
            "title_similarity": "0.3614754",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hk2h15r",
            "score": 1,
            "text": "Why can’t this woman be president instead?",
            "title_similarity": "0.3184998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ds35",
            "score": 8,
            "text": "if we had Medicare for All we would not have Medical debt.",
            "title_similarity": "0.4039063",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hk2gpdr",
            "score": 1,
            "text": "How in fuck does $212million only clear 108,000 people?",
            "title_similarity": "0.7082939",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hk2jtsz",
            "score": 4,
            "text": "Her back must be hurting from caring the entire Democratic Party on her back. She’s one of the few people I can think of right now that is not just *saying something* but actually delivering results to her community. She’s the reason why Georgia went blue and will probably be the reason Democrats can secure seats.",
            "title_similarity": "0.4005133",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk2e54m",
            "score": 0,
            "text": "Very impressive but probably would’ve been better to use that money to ~~bribe~~ lobby politicians to actually pass a decent healthcare reform bill for a lasting change in the system.",
            "title_similarity": "0.36552447",
            "sentiment_compound": 0.6245
        },
        {
            "id": "hk2fryr",
            "score": 0,
            "text": "This is the way",
            "title_similarity": "-0.21956176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2cr1d",
            "score": 0,
            "text": "If only the president could do something about this….",
            "title_similarity": "0.16790968",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2j0xb",
            "score": -1,
            "text": "Stacey Abrams For President 2024",
            "title_similarity": "0.38267902",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2kpmq",
            "score": -3,
            "text": "Can she be president?",
            "title_similarity": "0.24894102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2gny4",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk26qfi",
            "score": -10,
            "text": "That’s one way to secure party loyalty",
            "title_similarity": "-0.024763554",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hk2g16n",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk2ynjf",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk2ioon",
            "score": -1,
            "text": "Stacy for president",
            "title_similarity": "0.27109653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33hyi",
            "score": 0,
            "text": "How was no one up in arms about “muh fall of democracy” when she lost the election and refused to concede?",
            "title_similarity": "0.44995755",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hk2e29a",
            "score": 0,
            "text": "That’s awesome!",
            "title_similarity": "-0.18117711",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hk2wy1f",
            "score": 0,
            "text": "Isn't this just fundraising for debt collectors and the for profit medical establishment?",
            "title_similarity": "0.5247611",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hk35m7k",
            "score": 0,
            "text": "Wait - a private organization doing what government can't?  How progressive.",
            "title_similarity": "0.2134219",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk38w8z",
            "score": 0,
            "text": "then do student debt",
            "title_similarity": "0.23032868",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2d90g",
            "score": -3,
            "text": "We need her as governor in GA so bad... she was so close too. I think she'll get it next time.  Georgia is going blue, baby!",
            "title_similarity": "0.32276082",
            "sentiment_compound": -0.6988
        },
        {
            "id": "hk2dvhd",
            "score": 4,
            "text": "Is this woman even real? Is she a literal angel?",
            "title_similarity": "0.14971967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2i5k4",
            "score": -3,
            "text": "What is the racial/economic breakdown of the money spent?   need to make sure there wasnt any discrminatory practices in play",
            "title_similarity": "0.26743937",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hk2o5y3",
            "score": 3,
            "text": "That's nice of her to do, but that is not a healthcare system. Those 108,000 people who suffered under crippling medical debt will be replaced by a new 108,000 people immediately, until we actually fix the fucking problem. Relying on the kindness of strangers to alleviate the cruelties of our current dysfunctional system is not a long term plan and it is not scalable or sustainable or even rational.",
            "title_similarity": "0.60870254",
            "sentiment_compound": -0.902
        },
        {
            "id": "hk2jd4l",
            "score": -11,
            "text": "I like the sentiment, but how is this not the equivalent of a bribe for votes.  Vote for us, our PAC will pay your medical debt.  While it does shed light on just how fucked up our medical system is, it also is a very slippery slope.  What's to stop a GOP PAC from paying off people's cars or houses?",
            "title_similarity": "0.45452857",
            "sentiment_compound": -0.9349
        },
        {
            "id": "hk2ftse",
            "score": -1,
            "text": "She is so awesome.",
            "title_similarity": "-0.09260017",
            "sentiment_compound": 0.7384
        },
        {
            "id": "hk2hgx6",
            "score": -1,
            "text": "This lady is outstanding.  What a leader.",
            "title_similarity": "-0.022150539",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hk2hiy1",
            "score": -1,
            "text": "A true queen",
            "title_similarity": "-0.017213192",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk2pnj0",
            "score": 1,
            "text": "Let that be a lesson kids: you get more done as a private citizen than public. Government is where you send potential to die.",
            "title_similarity": "0.41643548",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hk2sltj",
            "score": 1,
            "text": "This is nice and all but when are we going to solve the root cause of medical debt and higher education debt?",
            "title_similarity": "0.39652225",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hk2w9pu",
            "score": -1,
            "text": "Fact: Stacey Abrams doesn't support single payer healthcare. \n\nIf you want to affect real change, vote for someone who supports it.\n\nIt's okay, ignore that, a PAC for Stacey gave money to insurance companies. That makes it all fine. /s",
            "title_similarity": "0.48924637",
            "sentiment_compound": 0.1882
        },
        {
            "id": "hk2wd58",
            "score": -1,
            "text": "Real question, and not meant to be an ass: couldn’t $200m in fundraising be better spent lobbying against medical debt in the first place?  Creating advocacy and making a grassroots movement?  This is obviously great for individuals but it doesn’t really address the system which is the problem .",
            "title_similarity": "0.5085169",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hk2y89i",
            "score": -1,
            "text": "Serious question: Are those 108,000 people still on the hook for paying the taxes on the money which paid off their medical debt?",
            "title_similarity": "0.7596112",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hk34cq8",
            "score": -1,
            "text": "I had no idea she was that rich!  That must put a huge dent in her personal fortune, being selfless with her own money like that.  What's that you say?  She used money donated for her campaign from other people, but she took credit for it?  Sounds like something a politician would do...hmmm.  Well, as long as it was done, that's good...but let's not give her angel wings just yet.",
            "title_similarity": "0.46129394",
            "sentiment_compound": 0.9194
        },
        {
            "id": "hk34v6k",
            "score": -1,
            "text": "Kinda crazy. That only some people got there debt forgiven. Should we all get that help equally. Not saying this didn’t help those that got it. Just where’s the equality in only 5 States receiving aid.",
            "title_similarity": "0.58890283",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hk35gpg",
            "score": -1,
            "text": "Alternate title: Stacey Abrams PAC gives $213 million in campaign contributions to insurance companies and debt collectors",
            "title_similarity": "0.7629967",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk35pdv",
            "score": 1,
            "text": "I greatly dislike the lady but if the title is true that is awesome!",
            "title_similarity": "0.09146564",
            "sentiment_compound": 0.8656
        },
        {
            "id": "hk3a4oq",
            "score": -1,
            "text": "I really wish she would run for President.",
            "title_similarity": "0.2898408",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hk3aae3",
            "score": 1,
            "text": "I see the comments above about PACs being slush funds and things like that, and I grant those positions, but I also am made a little uneasy by what's going on here, even as a Dem. This feels eerily like a campaign attempting to buy votes and I can see it potentially backfiring. It's a shame that doing **good** can be spun as something that is unethical, and I don't know if I'm necessarily committing to making the claim that this act is unethical (especially in the current political landscape), but something here makes me slightly uneasy.",
            "title_similarity": "0.25443393",
            "sentiment_compound": -0.8727
        },
        {
            "id": "hk3aowi",
            "score": -1,
            "text": "Can we start pushing her to run for president next election?",
            "title_similarity": "0.32270312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3hs8q",
            "score": 1,
            "text": "Now do college debt.",
            "title_similarity": "0.254492",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk4j71o",
            "score": -1,
            "text": "You can't really forgive a debt that someone had no intention of paying in the first place. I mean you can write that on paper all day but in reality it means nothing.",
            "title_similarity": "0.3504448",
            "sentiment_compound": -0.4583
        },
        {
            "id": "hk5l8kw",
            "score": -1,
            "text": "This is a prefect example of American corruption. I lean left but they’re basically buying 108,000 families votes with programs like this. Where can I sign up? Lol",
            "title_similarity": "0.6559537",
            "sentiment_compound": 0.7876
        },
        {
            "id": "hk5p7sd",
            "score": 1,
            "text": "She's buying votes.",
            "title_similarity": "0.16362788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwv7yw",
            "score": -1,
            "text": "Vote red! Thank god everyone I talk to will be voting against her! 💪💪",
            "title_similarity": "0.32423976",
            "sentiment_compound": 0.6351
        },
        {
            "id": "hk2qbgg",
            "score": 5,
            "text": "This is probably a controversial take, but as a donor to Fair Fight, this is not what the money should be used for. I've given several hundred dollars because I care about voting rights. She took my money to ostensibly use it to bolster voting rights. She shouldn't able to -- and I don't know how it is legal for her to -- take other people's money and not use it for what she said she was going to use it for. \n\nIf Abrams wants to pay down medical debt, she should start a new PAC for that purpose, not do this.",
            "title_similarity": "0.4757617",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hk2c87f",
            "score": 15,
            "text": "The problem here is that she probably wiped out that much debt by pay $50,000. Old “medical debt” costs thousands, but hangs over peoples heads for years.\n\n\nA local church bought a bunch of medical debt locally for charity, and then sent letters to people whose debt was cleared. My friend received a letter to their deceased spouse saying that their debt had been paid…it was a debt from the hospital where their kid was born 16 years earlier, and they had paid it!\n\nSo, there are plenty of medical errors in medical debt, too.",
            "title_similarity": "0.7711516",
            "sentiment_compound": -0.916
        },
        {
            "id": "hk2lydu",
            "score": -13,
            "text": "Is that buying votes? Seems like questionable actions for a political operation",
            "title_similarity": "0.18408294",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk37ubq",
            "score": -4,
            "text": "It’s buying votes.",
            "title_similarity": "0.070971005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2fheu",
            "score": -6,
            "text": "Stacey Abrams for President",
            "title_similarity": "0.26077074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2dugw",
            "score": -1,
            "text": "Stacy Abrams is too good for us.",
            "title_similarity": "0.05350308",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk2nppo",
            "score": -2,
            "text": "This is nice, but the money could have helped get Democrats elected so they can vote on legislation that could wipe out much more medical debt for many more people.",
            "title_similarity": "0.45746058",
            "sentiment_compound": -0.4152
        },
        {
            "id": "hk2nveb",
            "score": -2,
            "text": "Bet she didn’t use her money !!!",
            "title_similarity": "0.15557787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2bdly",
            "score": -11,
            "text": "Call me when my debt gets wiped",
            "title_similarity": "0.17965296",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2gr9b",
            "score": -3,
            "text": "Protect this Queen you stupid Democrats...",
            "title_similarity": "0.2748754",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hk2hmvi",
            "score": -3,
            "text": "Man, if Stacey Abrams can do for medical debt what she did for voting rights she'll carry out a few nice gestures and quietly drop the subject when Democratic party leadership decides not to do anything about it.\n\n*Edit:*\n\nStacey Abrams is (I believe) an earnest activist who does for liberals what dishonest grifter Candace Owens does for conservatives; reassures them, as a representative of black people, that black people like their political allies, so they don't need to challenge their party on the subject of race. That's why any critique of her is so furiously opposed. \n\nVoting rights are under attack by a party that, unlike the Democrats, is willing to take action to do the things they say they want to do. There's a possibility some of the damage could have been undone if Democrats had done more to bring errant members of the party into line with filibuster reform.  But they did not, apart from politely urging those members to reconsider their opposition. Some even speculate the party did not want to offend suburban white voters by appearing to cater to black people, so they used conservative members as scapegoats. \n\nRegardless of why, the fact remains that the party got elected on promises to do a thing, they have the members to do that thing, and they have chosen not to do it. They say some members are to blame but do nothing to sanction them. If election reform was ever truly a priority, they have functionally abandoned it.\n\nAbrams chose not to criticize that decision, or even to acknowledge it. She's one of many still pretending election reform is a nice thing that might happen on its own if we all say it should happen, and keep on donating and voting. \n\nUnfortunately this is a very difficult issue to talk about because most people just want to believe there's a good side versus a bad side, and that they chose the right one. For many it does feel like the issue was never a problem. We go vote and wait 15 minutes, come home and see people waiting 15 hours on tv and feel bad for them, or feel good that they're working so hard to support us and that's fine.  But if you aren't fine with it, fixing it means being honest about the fact that more needs to be done.",
            "title_similarity": "0.3888006",
            "sentiment_compound": 0.963
        },
        {
            "id": "hk2k71z",
            "score": -2,
            "text": "Bankruptcy bankruptcy bankruptcy!!!\n\n\nWhy are people so scared of filing for bankruptcy?\n\nCoffee.",
            "title_similarity": "0.46862853",
            "sentiment_compound": -0.6826
        },
        {
            "id": "hk2l19q",
            "score": -3,
            "text": "Hmmm…I wasn’t planning for my $25 donation to go to line the pockets of medical providers. How about you use that money to get into office Stacey and get some laws changed?",
            "title_similarity": "0.54775757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2vj0t",
            "score": -2,
            "text": "Abrams did nothing.  Her PAC paid a little over a million dollars.  And it wasnt really $212M.  The debt had already been reduced far less....",
            "title_similarity": "0.66968954",
            "sentiment_compound": -0.4144
        },
        {
            "id": "hk2wd14",
            "score": -4,
            "text": "Stacey Abrams has eaten all of the debt herself.",
            "title_similarity": "0.48057443",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2lfxa",
            "score": 6,
            "text": "I've always wondered why Oprah can't be bothered.",
            "title_similarity": "0.20369872",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hk299nr",
            "score": 4,
            "text": "If the GOP did stuff like this democrats might never win another election in GA. But they don't, so......",
            "title_similarity": "0.37135944",
            "sentiment_compound": -0.0736
        },
        {
            "id": "hk2hiov",
            "score": 4,
            "text": "The fact that nearly a quarter billion in medical debt can be wiped out with 1.34 million shows how broken the system is.",
            "title_similarity": "0.8067634",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hk2l7c5",
            "score": 5,
            "text": "Meanwhile, Republicans are arguing with Big Bird.",
            "title_similarity": "0.34186608",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hk2nhji",
            "score": 0,
            "text": "Crazy thing is you can buy debt for pennies on the dollar.\n\nSay you have a stack of debts to collect from people unlikely to pay, you know you aren't likely to collect so you sell the bad debt at a discount for someone else to try to collect.",
            "title_similarity": "0.41235465",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hk2q68s",
            "score": 4,
            "text": "How do we get her as president? She’s the only politician I’ve seen that actually does good things and not just talk about them.",
            "title_similarity": "0.435538",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk35drw",
            "score": 0,
            "text": "Righteous.   The healthcare system in the USA, not so much.",
            "title_similarity": "0.3504769",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk39kim",
            "score": 0,
            "text": "Upvote",
            "title_similarity": "-0.12336035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3a6vq",
            "score": 0,
            "text": "WON’T SOMEONE THINK OF THE POOR MEDICAL COMPANIES?!?!?! /s",
            "title_similarity": "0.4814489",
            "sentiment_compound": -0.7391
        },
        {
            "id": "hk3bso5",
            "score": 0,
            "text": "I'm not one to say billionaires should be forced to sell their shares to pay major taxes, but for some perspective of their wealth, Elon Musk could cover the full [US medical debt](https://siepr.stanford.edu/news/americas-medical-debt-much-worse-we-think) and only be worth half as much as he is today ([$281b as I write this](https://www.forbes.com/real-time-billionaires/#7f5df61f3d78)). He'd still have ~140b to play with. Still be 4th richest person in the world and with the way his value rises, he'd probably be back to #1 within a year or two \n\n-\n\n^^^^^(until ^^^^MOASS ^^^^and ^^^^RC ^^^^becomes ^^^^a ^^^^multi-trillionaire)",
            "title_similarity": "0.6212332",
            "sentiment_compound": 0.9505
        },
        {
            "id": "hk3et9s",
            "score": 0,
            "text": "Out of 140 Billion nation-wide. What on earth is going on down there?",
            "title_similarity": "0.43482134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4w08i",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk6084e",
            "score": 0,
            "text": "It’s nice but it’s just feeding and efficient and for-profit and for no good reason system",
            "title_similarity": "0.13869038",
            "sentiment_compound": 0.3593
        },
        {
            "id": "hk6d8u6",
            "score": 0,
            "text": "Woo! Glad those 5 people are now medical debt free!! \n\n(But on a serious note, this is awesome)",
            "title_similarity": "0.42762882",
            "sentiment_compound": 0.8892
        },
        {
            "id": "hk7iwe0",
            "score": 0,
            "text": "So... Stacy is just proving the Republicans' point that this stuff is handled better by private systems, not the govt.\nSweet.",
            "title_similarity": "0.26485652",
            "sentiment_compound": 0.1078
        },
        {
            "id": "hkbmpzx",
            "score": 0,
            "text": "I hope that she put some of that money back to fix that gap in her teeth!",
            "title_similarity": "0.2529446",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hkfub79",
            "score": 0,
            "text": "She’ll need it for that heart disease lmao",
            "title_similarity": "0.33036596",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hkkr0ww",
            "score": 0,
            "text": "Typical democrat handouts.  Doesn’t solve any problems.",
            "title_similarity": "0.18942636",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmq6850",
            "score": 0,
            "text": "This pig still not paying her student debt? Or is this nasty human being running ga since she didn’t lose?",
            "title_similarity": "0.29264256",
            "sentiment_compound": -0.8693
        },
        {
            "id": "hmv1b2z",
            "score": 0,
            "text": "How many were family",
            "title_similarity": "0.25834477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmvm9w9",
            "score": 0,
            "text": "Buying votes is illegal. And it is plain as that gap in her teeth that’s what she’s doing.",
            "title_similarity": "0.30219483",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hk2n4gw",
            "score": -13,
            "text": "Sounds like Stacey is buying votes. That's a federal crime.",
            "title_similarity": "0.40853086",
            "sentiment_compound": -0.25
        },
        {
            "id": "hk2pl24",
            "score": -9,
            "text": "Cool their debt is gone. My question is, how many votes did they buy?",
            "title_similarity": "0.4280374",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hk2gflh",
            "score": 6,
            "text": "If she runs, she's going to have a formidable chance of winning the Democratic nomination.",
            "title_similarity": "0.24094032",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hk3cdnt",
            "score": -4,
            "text": "Good old fashioned vote buying.",
            "title_similarity": "0.09968369",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk2e4ui",
            "score": -34,
            "text": "She needs to see a doctor about her obesity.",
            "title_similarity": "0.46677846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk35t67",
            "score": -6,
            "text": "*Fun fact:*\n\nTo this day, Abrams has yet to concede the 2018 gubernatorial election that she lost by 53,000 votes.",
            "title_similarity": "0.7031511",
            "sentiment_compound": 0.25
        },
        {
            "id": "hk2gj8a",
            "score": 1,
            "text": "I love this woman.",
            "title_similarity": "-0.059745464",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk2gx37",
            "score": 1,
            "text": "   Went to the ER because I thought I was dying, they  blood and told me all I had wrong with me was anxiety, it was my first time having a panic attack, felt like I was actually dying. \n   Anyway I left and waited for my bill in the mail, $5000 dollars to tell me I had anxiety...times are tough so I can't pay that so my credit score is currently being ruined so I can't rent or buy in the future. \n   America is awesome.",
            "title_similarity": "0.6486436",
            "sentiment_compound": -0.5806
        },
        {
            "id": "hk2hh11",
            "score": 1,
            "text": "Shouldn’t we be putting the pressure more on the politicians to stop the medical cartels who are overcharging all of us? A few players have used the law to carved their own monopoly niches. Paying this debt helps these indebted people for sure but it also helps the medical cartels since not only do they get their money, they will also continue overcharging all of us well into the future and the politicians will continue taking from the public funds in order to enrich the elites. Can’t you see the irony here of how the politician promises to help but they are really in bed with the elites?",
            "title_similarity": "0.4870416",
            "sentiment_compound": 0.9076
        },
        {
            "id": "hk2yira",
            "score": -1,
            "text": "What this points out it is the need for campaign finance reform, no politician should be able to amass such massive wealth in service to special interests…regardless of their altruistic motives…to many super wealthy are owning the US Congress not the actual voters",
            "title_similarity": "0.5173294",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hk37vzc",
            "score": -1,
            "text": "I knew never paying would pay off someday 😅",
            "title_similarity": "0.12221676",
            "sentiment_compound": 0.4207
        },
        {
            "id": "hk390jv",
            "score": -1,
            "text": "This is a positive thing, but it's pretty strange that people are portraying it as some unique, revolutionary act. Her PAC donated money to a charity that buys delinquent medical debt. John Oliver did the same thing. Various PACs, churches, and other organization have done the same thing. Charities like this are popular and have bought billions of dollars worth of medical and other debt over the years. It's a great cause, but it's hardly a reason to say someone should become president, as many in this thread are doing.",
            "title_similarity": "0.6271839",
            "sentiment_compound": 0.9714
        },
        {
            "id": "hk3965d",
            "score": 1,
            "text": "Do this instead of student debt.\n\nThe educated middle class needs help but others need more",
            "title_similarity": "0.18174532",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk3bays",
            "score": -1,
            "text": "Damnit it. I literally just maxed my credit card to pay mine off:(",
            "title_similarity": "0.39145386",
            "sentiment_compound": -0.296
        },
        {
            "id": "hk3bs0p",
            "score": 1,
            "text": "This means they've wiped about $1963.00 (edit - per person), which to me doesn't seem like a lot (from reading stories from others, such as a couple in this post).\nAs someone with access to free and universal healthcare, how much difference can this make? Sorry if this seems like a silly question, it's just not something I have a reference for.\nAlso, how far would $1963.00 go? Would it be a day in hospital, half-a-day plus test, etc?",
            "title_similarity": "0.60019267",
            "sentiment_compound": 0.6162
        },
        {
            "id": "hk3bwnl",
            "score": 1,
            "text": "Love you Stacy! As a former (very recent) Georgia resident, hope to see you in the Governor’s Mansion soon!!!",
            "title_similarity": "0.266876",
            "sentiment_compound": 0.8507
        },
        {
            "id": "hk3f4k9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk3hcyc",
            "score": 1,
            "text": "This is great!\n\nKeep it up so I'm not threatened with property seizure or prison to pay other people's medical bills.",
            "title_similarity": "0.23819953",
            "sentiment_compound": 0.5324
        },
        {
            "id": "hk3jleg",
            "score": -1,
            "text": "I mean she could have endorsed the person who ran on M4A instead of take Bloombergs money…idk, maybe that would have made more of a difference.",
            "title_similarity": "0.3068182",
            "sentiment_compound": 0.25
        },
        {
            "id": "hk3kkx7",
            "score": -1,
            "text": "Oh, do my student loans next!",
            "title_similarity": "0.22013932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3m7br",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk4fd6s",
            "score": -1,
            "text": "Not an efficient way to buy votes",
            "title_similarity": "0.1596289",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hk4x4gt",
            "score": -1,
            "text": "Bet none were white",
            "title_similarity": "0.116931766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk55dbg",
            "score": -1,
            "text": "Crime continues...",
            "title_similarity": "0.019884137",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk58f67",
            "score": -1,
            "text": "Wait till those people get that 1099-C in the mail next year as the IRS considers forgiven debt as income.",
            "title_similarity": "0.53205156",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk58qkr",
            "score": -1,
            "text": "Why can’t they raise money through a charity or something? I think it sets a bad precedent to show people the government is just willing to pay for their stuff.\n\nGlad these people got taken care of but there must be another way",
            "title_similarity": "0.33867118",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hk5asyn",
            "score": -1,
            "text": "It's pretty obvious. This isn't really an issue.",
            "title_similarity": "-0.13245104",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk5cvs5",
            "score": -1,
            "text": "Texan here laughing at this",
            "title_similarity": "0.0038665049",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk605lp",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk6i0wg",
            "score": 1,
            "text": "Any Republicans doing this? Or are they too busy getting paid?",
            "title_similarity": "0.2936287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk72hb2",
            "score": -1,
            "text": "How did Stacey Abrams wipe out this debt?",
            "title_similarity": "0.42220938",
            "sentiment_compound": -0.4357
        },
        {
            "id": "hk26a6j",
            "score": 64,
            "text": "She is an 😇.",
            "title_similarity": "0.025837041",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hk2i6ry",
            "score": 2,
            "text": "I just paid my $2700 monthly bill for medical and dental\n\nMe the wife \n3 kids",
            "title_similarity": "0.7852602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2imd9",
            "score": 2,
            "text": "Stacey Abrams for President!!",
            "title_similarity": "0.32818443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2j4ue",
            "score": 2,
            "text": "What an incredible human being.",
            "title_similarity": "-0.10220735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2k1y8",
            "score": 2,
            "text": "Wow! I’m really hoping this woman can run for President sometime",
            "title_similarity": "0.2515325",
            "sentiment_compound": 0.8012
        },
        {
            "id": "hk2kegh",
            "score": 2,
            "text": "This is what it means to be an American. Taking care of your neighbor. Solidarity. Love. Empathy.  Not the hate and divisions the GOP spouts every minute of every hour. Those who preach hate are always in it for personal power and enrichment. This has been true through all of human history.",
            "title_similarity": "0.34048256",
            "sentiment_compound": 0.8933
        },
        {
            "id": "hk2lc4o",
            "score": 2,
            "text": "Stacey Abrams, you are a ROCK Star! You go girl! Absolutely, you are my hero! Thank you for everything that you have done and continue to do.\n\nSigned, me a Florida girl!",
            "title_similarity": "0.26607433",
            "sentiment_compound": 0.8057
        },
        {
            "id": "hk2nyqo",
            "score": -2,
            "text": "“Thank you” - Healthcare industrial complex",
            "title_similarity": "0.20406842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2rzmz",
            "score": -2,
            "text": "Curious, what’s the position/stance of the creditors who are not going to be getting $212 million (minus the amount actually paid against that face value)?",
            "title_similarity": "0.6088164",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hk2togn",
            "score": 2,
            "text": "Sure, the Democrats are hard at work making life better for everyday people in the face of united republican opposition, and yet every single reddit thread about politics is carpet bombed with people insisting that both sides are exactly the same. People reading this website need to realize that being able to think that \"both sides are the same\" is an expression of privilege and wealth.",
            "title_similarity": "0.43586272",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hk2vyx8",
            "score": -2,
            "text": "Now imagine the cost if we wiped out the debt for everyone?",
            "title_similarity": "0.43254966",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk3bn2h",
            "score": 2,
            "text": "r/upliftingnews",
            "title_similarity": "-0.09045863",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3h3zi",
            "score": -2,
            "text": "The article states that the PAC has raised about $100M and they paid off $212M and they only did it in states where “Medicaid has not been expanded, even during a pandemic”. \n\nI take issue with Medicaid being expanded in Georgia because A) I live here, and B) I have a child on Medicaid. I can’t even begin to explain the bureaucracy that I have to go through for something as simple as a dentist or eyeglasses for my child.  We have been using Medicaid for the child’s doctor visits because it was all set up before we adopted. There are definitely issues that we have to find ways to overcome with the medical care. But for one off visits, to anyone else we have resorted to paying out of pocket because my time is worth more to me than sitting on the phone trying to find a provider and then get to the appointment and being told that they don’t pay for XYZ with Medicaid. \n\nWhy would you want to saddle those in our society who utilize emergency rooms for healthcare with the burdens of the Medicaid system. It is easier for them to continue with the status quo. \n\nAnd last but not least… why only 5 states?\n\nDiscussions are welcome…",
            "title_similarity": "0.74253714",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk3l5c2",
            "score": -2,
            "text": "she can't that, thats socialism",
            "title_similarity": "0.056835584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3n0zw",
            "score": 2,
            "text": "How about we talk about medical debt? Im literally thinking that most hospitals and doctors are criminal fraudsters....\n\nHere is my example:\nI went to my orthopaedic urgent care, because when I called to make an appointment, they told me to come in and get an X-ray of my pinky finger.... I had a big cut on it, and it was hurting a lot (I thought there was potentially a bone issue).\n\nWhen I got to the urgent care, they took my X-ray, and told me to absolutely go to an ER instead, because they dont put stitches on at the urgent care.... They dont have their own ER, so I had to find the closest one near me.\n\nI got into the ER, got checked in, waited in their waiting room with many other patients for 20-30 minutes. Then when it was my turn, I spoke with the doctor for possibly one minute? He asked me what I need? I told him the urgent care told me I need this pinky stitched. He said, alright, cool! (WTF did he even do?). \n\nSo then I went in a room with a Nurse, and she sat there, and we just had a chit chat (she was working on things not in any way relating to me). Then she does her thing, and puts a SINGLE STITCH on my pinky. Just one thread, with one loop, and then I am done, and leave the ER and go home.\n\nA month later, I get a letter from the ER stating that they billed my insurance company $5000, and I owe the hospital $1000 for their service. Then a month after that!? I get another bill from the Doctors group, saying that I owe the doctor $500 for his service.\n\n\n\nWHAT THE ACTUAL FUCK?! When do doctors make $500 bucks a minute? When can a nurse and doctor spend maybe a maximum of 10 minutes with a very healthy patient, and charge him a total of $5500?\n\nWhat kind of bullshit is this country coming to? These doctors and hospitals need to be sent to jail.",
            "title_similarity": "0.5874512",
            "sentiment_compound": -0.7719
        },
        {
            "id": "hk3o843",
            "score": -2,
            "text": "I think I’m this is key…when I get Texts to send Democrats money….it seems like that data just goes down the toilet. Tell me what the money is for, and show me that it got used. Commercial, billboard, etc?",
            "title_similarity": "0.3798074",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk3oxaq",
            "score": -2,
            "text": "Less than 2,000 per person?  Hmm,",
            "title_similarity": "0.44586825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3sj2z",
            "score": -2,
            "text": "Now time for her to pay her taxes",
            "title_similarity": "0.2163282",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hk3uctm",
            "score": -2,
            "text": "What about student debt",
            "title_similarity": "0.28568026",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk3zbsb",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk3zy9i",
            "score": -2,
            "text": "Isn't this an illegal use of funds?",
            "title_similarity": "0.06984706",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hk465ze",
            "score": -2,
            "text": "Let's say she runs against Kemp in 2022. \n\nPrevious gubernatorial election issues aside, does this create some sort of conflict of interest or issue with election law?\n\nSeems that paying of potential GA voter's debts could sway a voter?",
            "title_similarity": "0.43427765",
            "sentiment_compound": 0.484
        },
        {
            "id": "hk4iv08",
            "score": -2,
            "text": "Did she eat it?",
            "title_similarity": "0.024778757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4j007",
            "score": -2,
            "text": "Essentially she collected money from the taxpayers to transfer directly to the pockets of big pharma and health insurance honchos. What is needed is meaningful change aka universal care, not aid in debt collection.",
            "title_similarity": "0.4539599",
            "sentiment_compound": 0.7657
        },
        {
            "id": "hk4yjso",
            "score": -2,
            "text": "Isn’t that buying votes?",
            "title_similarity": "0.08460346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5h9hv",
            "score": -2,
            "text": "Stacy Abrams PAC raises 212 million for medical companies. \n\nThis is not feel good, this is a larger example of dystopian crowd funding.\n\nI'm glad for those ppl, but unhappy net result.",
            "title_similarity": "0.74440473",
            "sentiment_compound": -0.5272
        },
        {
            "id": "hk5k9vd",
            "score": -2,
            "text": "Buy votes anyway you can",
            "title_similarity": "0.03265527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5nuud",
            "score": -2,
            "text": "I read that it was 1.4 million from her PAC. Did some liberal minded person change this to be \"less than truthful\"???\n\nWhere does this 212 million dollar figure come from?",
            "title_similarity": "0.6886447",
            "sentiment_compound": 0.5693
        },
        {
            "id": "hk5phr1",
            "score": 2,
            "text": "From the political angle of this, good for her! Get her a fueled jet for next year's campaign stops! This is the kind of thing that people really need, not the BS that's occupying them in Washington.",
            "title_similarity": "0.43988004",
            "sentiment_compound": 0.5202
        },
        {
            "id": "hk5vg88",
            "score": -2,
            "text": "Stacey Abrams buys 108,000 votes. Ftfy.",
            "title_similarity": "0.6583236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk6bivj",
            "score": -2,
            "text": "I would have loved to see 212 million spend on lobbying to add laws that cap medical over billing or even 212 million helping people file bankruptcy so the hospitals get nothing.\n\nJust paying the bill isn't solving a problem.",
            "title_similarity": "0.54788524",
            "sentiment_compound": 0.7203
        },
        {
            "id": "hk6t0nv",
            "score": -2,
            "text": "The lady that should’ve been vice president, instead we get a babbling idiot.",
            "title_similarity": "0.3897075",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hk70b89",
            "score": -2,
            "text": "Great, now it’s tax payers debt, a job well done.",
            "title_similarity": "0.29510835",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hk2ar67",
            "score": -20,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk2imxe",
            "score": 22,
            "text": "HolUp… $212 Million worth of debt was cleared with only $1.34 Million? Healthcare in the US makes no fucking sense.",
            "title_similarity": "0.7968301",
            "sentiment_compound": -0.34
        },
        {
            "id": "hk2cv0a",
            "score": 2,
            "text": "We also need a law update so that this kind of jubilee doesn't come with tax strings attached, whether it's paid off or forgiven.\n\nMedical costs are price gouging. The number on the paper is ridiculously inflated compared to the actual cost of providing medical care. We bankrupt people over imaginary numbers.",
            "title_similarity": "0.51529115",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk2feb0",
            "score": 4,
            "text": "Nice to see our money going towards something useful for a change rather then sending billionaires on joyrides into space.",
            "title_similarity": "0.22294429",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hk2g28d",
            "score": -4,
            "text": "Certainly better than continually failing to fund an election victory.",
            "title_similarity": "0.21900964",
            "sentiment_compound": 0.25
        },
        {
            "id": "hk2htjg",
            "score": 4,
            "text": "Stacey Abrams is an awesome woman",
            "title_similarity": "0.07058824",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hk2ko1g",
            "score": 3,
            "text": "Meanwhile, MTG is going around calling the infrastructure bill \"communist\".",
            "title_similarity": "0.293345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2p3rm",
            "score": -3,
            "text": "Yet also works to keep the parasitic for-profit insurance industry that makes such relief necessary firmly in place as a matter of law\n\nBullshit",
            "title_similarity": "0.2610045",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hk2pe2m",
            "score": -2,
            "text": "Oh boy taxes…",
            "title_similarity": "0.16493544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2sjer",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk39vpe",
            "score": -3,
            "text": "I have to ask with election laws the way they are is this even legal?",
            "title_similarity": "0.19874057",
            "sentiment_compound": 0.128
        },
        {
            "id": "hk3acrk",
            "score": 2,
            "text": "Unfuckingbelievable.   That is one of the most humanitarian things I've seen any politician do.  The fact that this is so incredible depresses me because it shows what we accept as the standard with so many other politicians.",
            "title_similarity": "0.3975373",
            "sentiment_compound": -0.2895
        },
        {
            "id": "hk3ftu5",
            "score": 2,
            "text": "Medical debt? Lol. /Europe.",
            "title_similarity": "0.3450274",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk3hhqz",
            "score": -3,
            "text": "The headline makes it sound like HER PAC was responsible for clearing all that debt. Her PAC donated 1.8 million to a DIFFERENT org that wiped out the debt. This is a fluff piece to help her odds on 2022.",
            "title_similarity": "0.7000625",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk3njsg",
            "score": -2,
            "text": "Is that not misuse of pac funds?",
            "title_similarity": "0.13716717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3p9bw",
            "score": -4,
            "text": "Why doesn't she lobby her shitty insider friends to support Medicare for all than take these baby steps?",
            "title_similarity": "0.49792993",
            "sentiment_compound": 0.2792
        },
        {
            "id": "hk3qmr0",
            "score": -4,
            "text": "Awesome. She should do that rather than complain about rigged elections.",
            "title_similarity": "0.059563115",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk3s01p",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk3ukma",
            "score": -2,
            "text": "Guess she has to do something with the money, ain’t gonna get elected anywhere, might as well give it away.",
            "title_similarity": "0.23135471",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk3umib",
            "score": -3,
            "text": "So, three people then?",
            "title_similarity": "-0.028091908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk41h3x",
            "score": -3,
            "text": "She should have spent some on her teeth.",
            "title_similarity": "0.060436837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk41s9d",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk49uiv",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk4acf9",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk4tknr",
            "score": -3,
            "text": "Uh, this sounds like trying to buy votes. Has she stated that she's won't be running for office again?",
            "title_similarity": "0.27728218",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk5psu6",
            "score": -4,
            "text": "How'd that OSAMA CARE WORK FOR YOU?\n• Keep your doctor\n• Affordable healthcare w/govt aid\n• Premiums never increase\n• Political donations bail you out",
            "title_similarity": "0.5170581",
            "sentiment_compound": 0.4536
        },
        {
            "id": "hk2hty4",
            "score": 3,
            "text": "They really should have made her VP not Harris.",
            "title_similarity": "0.17303537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2nxar",
            "score": -3,
            "text": "the millionaire doctors whom they owe will be so happy? have you met the millionaire doctors yet? there's such fabulous people.",
            "title_similarity": "0.40423578",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hk2uai4",
            "score": -4,
            "text": "Using PACs to pay for campaigning is one thing…. But does anyone else see something a little offside by basically paying people for their votes….. ?",
            "title_similarity": "0.33695564",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hk2xad5",
            "score": -4,
            "text": "Republicans better put a stop to this shit.",
            "title_similarity": "0.1815387",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hk3325e",
            "score": 4,
            "text": "fuck everyone and everything that causes people to be thousands or even hundreds of thousands of dollars in medical debt. what a piece of shit system we have.",
            "title_similarity": "0.6616594",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hk34irs",
            "score": 3,
            "text": "While I disagree with her unwavering support of Israeli practices in Palestine, she is, without a shred of a doubt, the GOAT.\n\nThis is true life-changing, wellness-inducing measures. Those people's lives are about to change for the better. She's awesome!",
            "title_similarity": "0.2080837",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hk35c4q",
            "score": -4,
            "text": "I would rather she paid more in taxes and we had universal Healthcare, but whatever.\n\nMore propaganda for the philanthropists",
            "title_similarity": "0.37606508",
            "sentiment_compound": -0.4478
        },
        {
            "id": "hk366es",
            "score": -5,
            "text": "$212m, while an amazing act of altruism, could have bought think-tank messaging strategies the Democrats desperately need, and hours of radio and TV ads in places Democrats need to hammer their emotional AND fact-based message home.  When will Progressives learn that they need to win the messaging war?",
            "title_similarity": "0.493686",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk381j8",
            "score": -3,
            "text": "Dems just snuck a tax cut for the rich into the Build Back Better bill",
            "title_similarity": "0.48433834",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hk3eqkq",
            "score": -3,
            "text": "Is there a data on the racial distribution of people whose medical debts were paid for by the PAC?",
            "title_similarity": "0.603248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3f7g8",
            "score": -4,
            "text": "Well well well looks who’s running for president in 2024… staring off right with the pandering.",
            "title_similarity": "0.46875393",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hk3juem",
            "score": -4,
            "text": "So she gave a bunch of medical debt holders money for debt they never would have to pay back anyways there’s no debtors prisons in the US",
            "title_similarity": "0.62299377",
            "sentiment_compound": -0.765
        },
        {
            "id": "hk3kes2",
            "score": -4,
            "text": "Let me guess which people.",
            "title_similarity": "-0.12529159",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3nma8",
            "score": -3,
            "text": "God damm communists",
            "title_similarity": "0.12516432",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk3opar",
            "score": -4,
            "text": "> Stacey Abrams PAC wipes out $212 million in medical debt for 108,000 people in 5 states\n\nThat's nice of her, assuming she paid with her own money.",
            "title_similarity": "0.91578436",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk3w05f",
            "score": -3,
            "text": "What I read: 12 million $ transferred by friendly donators to the pockets of pharma corporate grifters :(",
            "title_similarity": "0.62660164",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk47g3b",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk47ym5",
            "score": -5,
            "text": "Has she conceded the governor’s race yet?",
            "title_similarity": "0.25095612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4sue5",
            "score": -5,
            "text": "She’s the one that refuses to concede her election right? Big yikes",
            "title_similarity": "0.2916735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5kkyt",
            "score": -3,
            "text": "She’s a talentless fraud—just like her “mail-in ballot” numbers. And a total bore.",
            "title_similarity": "0.32054013",
            "sentiment_compound": -0.3384
        },
        {
            "id": "hk6ex0m",
            "score": -4,
            "text": "I have two thoughts.  1 - How nice for the people that got bailed out!\n\n2 - Is this a legal use of campaign funds?  I would think not, but I don't know if rules are different for PACs.   \n\nRegardless, although this is a very kind and meaningful gesture, it would not make me more likely to vote for her if I lived in Georgia.",
            "title_similarity": "0.3802154",
            "sentiment_compound": 0.8963
        },
        {
            "id": "hk2p0r0",
            "score": 15,
            "text": "We need a President like her. No agenda just do good for the people. What an amazing person. Thank You",
            "title_similarity": "0.318216",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hk2ii9q",
            "score": -5,
            "text": "Why do I have to be responsible for my debt?\n\nEdit: I forgot the /s",
            "title_similarity": "0.24090785",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hk2kmwq",
            "score": 5,
            "text": "An average of just under 2k per person. That’s another sad part of this. That two grand is enough to put so many people in unrecoverable debt while the rich would wipe their ass with it.",
            "title_similarity": "0.61785877",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2l0um",
            "score": -5,
            "text": "From your tax increases",
            "title_similarity": "0.21664192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2lola",
            "score": -6,
            "text": "So they made 100 million and spent 1.34 million to settle 212 million in debt. Seems like a good return on 1.34%. Great publicity for actually changing very little.\n\nMost of that debt has probably already done the damage it will to the people who owed the bills. I would say they probably hadn't paid on the bills and the hospitals took what they could to just clear the books on a loss anyway.\n\nIt would have had a more tangible impact investment if they would have Given the cash to the actual people. \n\nBut this makes a nice story and makes others who didn't do a thing like the Democrats in general. Because feelz.",
            "title_similarity": "0.61488235",
            "sentiment_compound": 0.8233
        },
        {
            "id": "hk2mosm",
            "score": -5,
            "text": "IIT: PACs are good now!",
            "title_similarity": "0.0046870876",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hk2q1qe",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk2r074",
            "score": 6,
            "text": "My mom had to have a surgery to remove a tumor on her ovary that was the size of a 7 month pregnancy and now we have a crippling debt for her surgery bc she couldn’t afford insurance. Every few days we get collections notices for a few thousand, all for different parts of the procedure. Fuck America.",
            "title_similarity": "0.7719617",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hk2splk",
            "score": -5,
            "text": "I wonder what the percentage of these people who will now end up with a new debt within couple of years are",
            "title_similarity": "0.53185344",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2t3iu",
            "score": -4,
            "text": "Voter buying is nice. Also, wonder if those who received money had to be PoC or not. Betting they were.",
            "title_similarity": "0.1511197",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk2tmk3",
            "score": -6,
            "text": "This does not make sense, so they just gave 212M to bill collectors?\n\nMay be I should start buying up medical debt pennies on the dollar.\n\nI am not sure , how paying off ones medical debt will improve ones life? It would be much better to give them money to improve quality of life by buying essentials.\n\nThis money would have been better spent in lobbying to pass laws to reduce drug pricing, hospital costs, promoting single payer etc. This will help many people in the long run and would save billions in future for regular folks.\n\nDems should learn from NRA playbook.",
            "title_similarity": "0.56144476",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hk2v5bb",
            "score": -5,
            "text": " It sure how SA is able to collect 220 million in a few month.  Sounds like bullshit to me",
            "title_similarity": "0.63686675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2v67y",
            "score": -4,
            "text": "I'd be willing to bet 90+ % are black.  This lady is racist as fuck.",
            "title_similarity": "0.37093985",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hk2veo1",
            "score": -4,
            "text": "Who? 💩",
            "title_similarity": "-0.10926181",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3apwl",
            "score": -5,
            "text": "If true, this is big.  The problem is she has been caught lying before.  You can't just trust her.",
            "title_similarity": "0.28355408",
            "sentiment_compound": -0.7186
        },
        {
            "id": "hk3q7yt",
            "score": -5,
            "text": "Is that the women who faked that one shopping racist viral video",
            "title_similarity": "0.40548682",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hk3r8tt",
            "score": -5,
            "text": "Lmao $1.34 million too bad nobody in this echochamber bullshit of a sub actually reads articles.",
            "title_similarity": "0.621248",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hk4jg7t",
            "score": -5,
            "text": "Are we sure she didn’t spend that on donuts instead?",
            "title_similarity": "0.24051313",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk2dmxd",
            "score": 18,
            "text": "She did this with 1.5 million dollars.\n\nImagine if the US budget included just one billion (a less than 0.1% increase in cost) for canceling medical debt.",
            "title_similarity": "0.75066733",
            "sentiment_compound": -0.1189
        },
        {
            "id": "hk2iekf",
            "score": 6,
            "text": "Meanwhile Elon Musk over here the richest man in the universe and playing devil's accountant with world hunger.\n\nThe world is watching.",
            "title_similarity": "0.476613",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk2mw81",
            "score": -5,
            "text": "Lol they didn't wipe anything out. It just means everyone else will pay for it",
            "title_similarity": "0.13648656",
            "sentiment_compound": 0.34
        },
        {
            "id": "hk36reb",
            "score": -7,
            "text": "She’s a liar, cheater, race hustler, and a loser. She disenfranchised my vote in Dekalb county Georgia. She represents nobody. She can leave",
            "title_similarity": "0.48643342",
            "sentiment_compound": -0.886
        },
        {
            "id": "hk3bmi6",
            "score": -6,
            "text": "You know who's applauding this? Big health care corporations.\n\nShe's done a wonderful thing, but $200M might have had more impact if it had been used to lobby (*bribe) politicians to vote for an expansion of universal healthcare.",
            "title_similarity": "0.60763085",
            "sentiment_compound": 0.5346
        },
        {
            "id": "hk3ooe7",
            "score": -6,
            "text": "Buying votes? You decide.",
            "title_similarity": "0.07171299",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3ph19",
            "score": -6,
            "text": "Isn’t that the woman who lost a Georgia governor race, then tried to claim voter suppression?",
            "title_similarity": "0.4732679",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hk3ttfn",
            "score": -5,
            "text": "So basically this PAC paid a little over 1/2 of 1 penny on the dollar for this delinquent medical debt.  1.34 million/212 million.  You know what kind of debt sells for that cheap? -- typically debt that is beyond the statute of limitations, and furthermore has already fallen off the debtors credit report.  Even as a democrat, I'm calling this nothing more than a political publicity stunt.",
            "title_similarity": "0.73039055",
            "sentiment_compound": -0.7713
        },
        {
            "id": "hk3wi62",
            "score": -7,
            "text": "This is a bold face lie...it literally says she paid 1.34 million to help a debt with a face value of 212 million. She didn't pay off all that money.",
            "title_similarity": "0.71534395",
            "sentiment_compound": 0.6701
        },
        {
            "id": "hk46afm",
            "score": -6,
            "text": "Buying votes with PAC money? I feel there are laws broken somewhere here…",
            "title_similarity": "0.39522085",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk2r368",
            "score": 76,
            "text": "BoTh PaRtIeS aRe ThE sAmE sO i'Ll VoTe RePuBliKkKlAn!1!",
            "title_similarity": "0.16032964",
            "sentiment_compound": 0.508
        },
        {
            "id": "hk27c9d",
            "score": 27,
            "text": "Bam! Sticking it to the establishment and showing a way forward.",
            "title_similarity": "-0.06739767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ik8z",
            "score": -6,
            "text": "Now that’s how you buy votes",
            "title_similarity": "0.06904173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2kepi",
            "score": -7,
            "text": "Buying votes … lol.",
            "title_similarity": "0.1210784",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk2m8qw",
            "score": -6,
            "text": "She should wipe out her own credit card debt",
            "title_similarity": "0.32494757",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk2mg37",
            "score": -6,
            "text": "Half of that debt was to fix her teeth",
            "title_similarity": "0.48171872",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2myv8",
            "score": -7,
            "text": "Did she eat it?",
            "title_similarity": "0.024778757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2notz",
            "score": -7,
            "text": "So she diverted donations intended for fighting voter fraud to pay of medical debts by other people.\n\nWTF:  How is that NOT a crime?\n\nAlso, it was only 1.34 million paid to a collection agency.\n\nMakes one wonder if she has a stake in that company...",
            "title_similarity": "0.6677629",
            "sentiment_compound": -0.8549
        },
        {
            "id": "hk2e6ml",
            "score": 98,
            "text": "Her pac gave a charity (RIP? really, rest in peace is the charity name to pay off medical debt in bulk? lol, weird and sickly funny) $1.4M to wipe out $212M in debt?\n\nSo the person/people/corp (who or whatever) took $0.007 cents on the dollar for every dollar owed to clear the debt? \n\n>The group has aided more than 3 million people since it was founded in 2014, typically buying bundles of medical debt at steep discounts from the face value. The bills often are purchased from collection agencies that have been trying to get debtors to pay for years. The group has wiped out debt with a face value of more than $5.3 billion.\n\nAm i getting this correct?\n\nIf so , what i don't get, is if collection agencies can buy 10$ of medical debt from a hospital for less than 0.07 cents, then why don't the hospitals just put the price at 0.08 cents in the first place? \n\nOr are the hospitals losing money somewhere along the way while trying to collect the debt...and thus that is the increased price for medical costs ($0.90 cents of every dollar billed is actually to pay for the unpayed payments?) that those of us who can pay our debts (or have insurance) pay?  \n\nIf that is the case, then wouldn't medicare for all essentially be saving anyone that uses medical anything (so everyone) $0.90 cents on the dollar for healthcare? \n\nDo that many people just not pay for medical care? If so i feel like a dumb chump for paying for everything i have so far.",
            "title_similarity": "0.80778193",
            "sentiment_compound": 0.8011
        },
        {
            "id": "hk2bvzp",
            "score": 8,
            "text": "This will make conservatives very angry.",
            "title_similarity": "0.1907968",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hk2i5qb",
            "score": 8,
            "text": "Can she do my student loans😭?",
            "title_similarity": "0.12445036",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk2pd8i",
            "score": -9,
            "text": "Bribery at its best.",
            "title_similarity": "0.049782164",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk2s7yg",
            "score": -8,
            "text": "Why are PACs giving funds to voters instead of funding candidates?\n\nThis is corruption.  This is vote-buying. This is grossly wrong.",
            "title_similarity": "0.3353602",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hk2t7s7",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk3v721",
            "score": 8,
            "text": "If the Democratic Party has a future, it will be under this woman.",
            "title_similarity": "0.16262397",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk2bthr",
            "score": 28,
            "text": "Stacey Abrams is a national treasure",
            "title_similarity": "0.16614482",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk26a9a",
            "score": 9,
            "text": "Very, very cool!",
            "title_similarity": "-0.14160825",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hk2ingt",
            "score": 10,
            "text": "Actual Christians doing actual good in the world.",
            "title_similarity": "0.17244065",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk3ah65",
            "score": 10,
            "text": "To all of the both-sides idiots:\n\nWhich Republicans have done something like this?",
            "title_similarity": "0.3813036",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk2j8o9",
            "score": 208,
            "text": "There is no group of people on earth dumber and more embarrassing than Americans who fight against universal healthcare.",
            "title_similarity": "0.5096888",
            "sentiment_compound": -0.8479
        },
        {
            "id": "hk2oy9a",
            "score": -11,
            "text": "Keep paying the debt, people will continue to live an unhealthy lifestyle. What a joke.",
            "title_similarity": "0.20075962",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hk2pwcr",
            "score": 11,
            "text": "This woman should be running for President \n\nShe actually cares",
            "title_similarity": "0.23173672",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hk32vvp",
            "score": 10,
            "text": "Conservative here and I believe everyone should have healthcare in this country.  \n\nIt's pretty obvious.  This isn't really an issue.",
            "title_similarity": "0.31936023",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk2obt6",
            "score": 14,
            "text": "Imagine living in a country where we just had healthcare and people didn't actually have to be destitute because they needed care when they got sick. What a joke.",
            "title_similarity": "0.4120391",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk2o04g",
            "score": 15,
            "text": "Forget empty promises and charismatic speeches, this is the stuff that shows that you care about people and will address the problems they face",
            "title_similarity": "0.12170102",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hk2j59r",
            "score": 15,
            "text": "Great start! M4A next!",
            "title_similarity": "0.124811195",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hk2aaxp",
            "score": 587,
            "text": "She’s effective as hell. We need her in Washington.",
            "title_similarity": "0.1636264",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk278qx",
            "score": 1027,
            "text": "No Stacey, that's not what PACs are for, goddamit, do you even know how to politician? Where are your shitty attack ads? Do you even pay your family members for made up jobs? Smdh.",
            "title_similarity": "0.5214975",
            "sentiment_compound": -0.8702
        },
        {
            "id": "hk27dz3",
            "score": 286,
            "text": "I've said it before and I'm sayin' it again: I like this gal!",
            "title_similarity": "0.0032826457",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hk29fxh",
            "score": 24,
            "text": "Actions speak louder than words.",
            "title_similarity": "-0.043252226",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2slvo",
            "score": 25,
            "text": "Finally a politician doing something nice with her donations. Good move!",
            "title_similarity": "0.22544894",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hk2t68f",
            "score": 24,
            "text": "At this point, it'd probably be easier if Demorcrats launched a non-profit health insurance company to try and rival corporations like United Health Care.\n\nThe government won't back universal healthcare? Fine, start the systems ourselves via the private market. For some rough numbers, United Health Care has 70 million members and 81 million people voted for Biden in 2020. When you count their respective families probably accounts for well over 120-160 million people in this country.\n\nProbably only need to pull 10-20 million people away to make it in the Top 3-5 insurance companies, and at that point you've got leverage for negotiating prices the way the big insurance companies do.\n\nYes, I know this is a pipe dream, but if Abrams PAC can pay off medical debt, there is no reason a PAC couldn't just start working towards affordable healthcare on a grassroots level for anyone who wants it.",
            "title_similarity": "0.7138384",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hk29atr",
            "score": 417,
            "text": "Averages to almost $2000 per person.",
            "title_similarity": "0.5603345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk26hen",
            "score": 5089,
            "text": "Want people to vote democrats this is how you do it with tangible results that people can see.",
            "title_similarity": "0.25411785",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk34k5h",
            "score": 57,
            "text": "Fox news: \"Corrupt Democrats want to buy your vote, we'll tell you how they're doing it at 6. Up next, BP CEO invites Republican lawmakers to laser tag.\"",
            "title_similarity": "0.48924887",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk2qmpz",
            "score": 177,
            "text": "212 million face value paid off with just 1.34 million. How",
            "title_similarity": "0.6169042",
            "sentiment_compound": 0.34
        },
        {
            "id": "hk2nf7e",
            "score": 654,
            "text": "I have paid thousands and thousands in medical debt. I've worked my ass off for years to pay off what I owe. \n\nYou know what? I'm fucking happy that people won't have to go through what I went through. It doesn't \"build character\" to work yourself to death at the expense of time with your spouse/kids/dog/true aspirations. \n\nPay people a living fucking wage and don't put people into crippling debt just to stay alive. \n\nThis isn't fucking hard.",
            "title_similarity": "0.5848918",
            "sentiment_compound": -0.7265
        },
        {
            "id": "hk2cuoe",
            "score": 2557,
            "text": "I remember having $640,000 in medical debt upon leaving Denver Health in 2016 .. I was in the hospital for about 4 months due to a severe illness and had to work with physical therapy / Nutrionist daily to get my weight restored and strength back. \n\nI went into the hospital in a wheelchair chair but walked out myself. \n\nMy insurance company ~ United, rejected the majority of my treatments .. said it wasn’t necessary. We hired a medical advocate and fought for about 5 months with the insurance company .. eventually they agreed to cover and my amount lowered to around $32,000. I paid the remaining balance off just this year .. any Christmas bonus I just threw into the medical debt pile .. \n\nGlad that’s over .. but makes me sick to think the expense of things .. charging me $2 per pill for something CVS charges 10 cents for .. just gross.",
            "title_similarity": "0.8094909",
            "sentiment_compound": -0.882
        },
        {
            "id": "hk2a00y",
            "score": 6560,
            "text": "I hope this puts more light on the issue of medical debt.  One in four people in the south have medical debt.",
            "title_similarity": "0.6191827",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hk2fco5",
            "score": 2,
            "text": "Tfw she spend 0.63 cents per **Dollar** of debt I thought it was a math error at first",
            "title_similarity": "0.5191641",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hk2gk28",
            "score": 2,
            "text": "Amazing",
            "title_similarity": "-0.16901657",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk2gvnq",
            "score": 2,
            "text": "Imagine if PACs were more often used to fund policy issues and not politicians",
            "title_similarity": "0.28530207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2h2gm",
            "score": 1,
            "text": "Do apply for this? Im in Tennessee and had covid, pneumonia,  and c.diff for 5months. Having to work at wendys rn because I can show up late if feel bad",
            "title_similarity": "0.64331305",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk2hmir",
            "score": 1,
            "text": "How she isn’t at least governor is beyond me",
            "title_similarity": "0.122412205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2hwwu",
            "score": 1,
            "text": "About 2k per person",
            "title_similarity": "0.38372007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2i6yf",
            "score": 3,
            "text": "Stacy's just gonna end up making a whole alternate government isn't she.  She's paying for Healthcare, and school, and she can't even levy taxes.  I hope hers keeps growing",
            "title_similarity": "0.5249139",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hk2igbi",
            "score": 1,
            "text": "Super cool",
            "title_similarity": "-0.12437625",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hk2ij4m",
            "score": 1,
            "text": "Bravo Stacey!  Elected leadership *can* do for citizens.",
            "title_similarity": "0.25599205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ijxh",
            "score": 1,
            "text": "But Mr. Potato Head and Dr. Seuss!\n\nMan conservatism is such a fucking joke...",
            "title_similarity": "0.23742376",
            "sentiment_compound": 0.5471
        },
        {
            "id": "hk2ilhr",
            "score": 3,
            "text": "That same amount of money would cover the bills of sooo many more people in a not-for-profit system.",
            "title_similarity": "0.40484327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2imbk",
            "score": 3,
            "text": "It's hard to feel bad for Americans when you all do absolutely fucking nothing to change the system...",
            "title_similarity": "0.27224064",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hk2iprh",
            "score": 2,
            "text": "It’s a shame that this debt is not forgiven. The parties that set the prices and intended to collect got exactly what they wanted.",
            "title_similarity": "0.19837098",
            "sentiment_compound": -0.8419
        },
        {
            "id": "hk2j3lc",
            "score": 2,
            "text": "Can we just make her president?",
            "title_similarity": "0.26807648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2j3tf",
            "score": 2,
            "text": "Nice.",
            "title_similarity": "-0.23867881",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk2jeul",
            "score": 1,
            "text": "Shes fixin to run for president",
            "title_similarity": "0.262058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2jnox",
            "score": 1,
            "text": "Forgive medical debt > Forgive student loan debt",
            "title_similarity": "0.42335638",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hk2jp5x",
            "score": 2,
            "text": "Hope she targeted paying for GOP families, that would be one of the more effective ways of changing minds",
            "title_similarity": "0.100059785",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hk2jpd0",
            "score": 2,
            "text": "Does she take requests? 😂 I could certainly use some help with my mental health medical debts, Stacey!",
            "title_similarity": "0.35311902",
            "sentiment_compound": 0.807
        },
        {
            "id": "hk2jq5h",
            "score": 1,
            "text": "I thought PAC money was only allowed for expenses related to political campaigns",
            "title_similarity": "0.36350298",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2jy14",
            "score": 2,
            "text": "The point is she shouldn’t have even had to do this to begin with. I’m glad she did, and I’m glad she’s using this to shine a light on a really big problem in this country.",
            "title_similarity": "0.21483493",
            "sentiment_compound": 0.4627
        },
        {
            "id": "hk2k0f2",
            "score": 2,
            "text": "This is awesome. The problem is long term. The entire Conservative narrative is that the federal government shouldn’t be involved in handling of private people’s personal or financial lives. This proves that private organizations can help people and the federal government doesn’t need to be involved for the other millions of people still needing help because more PACs can handle it. This won’t help long term change in this country but glad it helped the recipients!",
            "title_similarity": "0.4431591",
            "sentiment_compound": 0.8605
        },
        {
            "id": "hk2k178",
            "score": 1,
            "text": "President when",
            "title_similarity": "0.17242694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2k1aa",
            "score": 1,
            "text": "interesting strategy for a presidential run- paying people's debt.",
            "title_similarity": "0.4045407",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hk2k7rk",
            "score": 7,
            "text": "America can't keep calling itself a free country when severely injured people beg passers by NOT to call an ambulance",
            "title_similarity": "0.4555538",
            "sentiment_compound": -0.34
        },
        {
            "id": "hk2k9fn",
            "score": 1,
            "text": "There needs to be videos of these people telling their circumstances and how she helped, and they need to be shared on social media by everyone.",
            "title_similarity": "0.22252671",
            "sentiment_compound": 0.34
        },
        {
            "id": "hk2kap0",
            "score": 1,
            "text": "Now do it for student debt",
            "title_similarity": "0.22939305",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2kcnv",
            "score": 1,
            "text": "So basically the hospitals and debt collection agencies had a nice payday? They would have never seen that money anyway.",
            "title_similarity": "0.45114818",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk2kdoz",
            "score": 1,
            "text": "Can't wait to see her run for national office so the shitty \"progressive\" bros can show their true colors again.\n\nMassive conspiracies committed by her PAC will be par for the course in their propaganda. It doesn't have to be true when your targeted audience already \"can't have a beer with her\".\n\nIn the end, she will hopefully succeed in her first attempt anyway, only to be widely branded a failure because she couldn't make a wildly varying progressive coalition happy in a year, and doesn't win any fans among centrists and conservatives by trying.",
            "title_similarity": "0.518162",
            "sentiment_compound": 0.6186
        },
        {
            "id": "hk2kfrx",
            "score": 1,
            "text": "FYI - John Oliver did a piece on this on Last week tonight (Available on YouTube)\n\nEssentially, when people can’t pay its sold off down the line at pennies on the dollar to debt collection agencies, if they can’t collect it’s sold again down the line once again at pennies on the dollar.\n\nWhen you wipe out debt that has got down to this level of collections the money you spend goes so so far. £212m spent but she likely wiped out 10x that in surface level debt",
            "title_similarity": "0.69637483",
            "sentiment_compound": -0.635
        },
        {
            "id": "hk2ki1a",
            "score": 2,
            "text": "If only there was some way, some possible way, to do this on a nationwide scale with some sort of elected body of representatives.",
            "title_similarity": "0.22973192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ki1r",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk2kmef",
            "score": 1,
            "text": "Anybody else thing this should be what PACs do?",
            "title_similarity": "0.014741603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2krpg",
            "score": 1,
            "text": "Fucking awesome!  What a concept.  Who's next?",
            "title_similarity": "-0.110266425",
            "sentiment_compound": 0.6893
        },
        {
            "id": "hk2kuag",
            "score": 1,
            "text": "What do you think guys? Stacy for president?",
            "title_similarity": "0.31239626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2l2db",
            "score": 4,
            "text": "It should be large corporations doing this.",
            "title_similarity": "0.21386637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2l6xg",
            "score": 1,
            "text": "Stacey for president ?",
            "title_similarity": "0.3063472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2lf1p",
            "score": 2,
            "text": "I would like my politicians to simply make medical care fee so this is unnecessary.  Use those funds to support more progressive candidates instead of small well intentioned donations.  108,000 is a fraction of the people we can actually help",
            "title_similarity": "0.5244118",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hk2lln8",
            "score": 2,
            "text": "After living in Japan and having pretty amazing healthcare...I was really quite sad to come back to the US...\n\nI even have really good insurance through my work and don't pay much at all every month. But I'd gladly pay the $400 USD equivalent in Japan again for complete coverage and never have to worry about medical expenses.",
            "title_similarity": "0.5507164",
            "sentiment_compound": 0.7662
        },
        {
            "id": "hk2low0",
            "score": 2,
            "text": "One of the best parts of this is that it went beyond swing states like Georgia & Arizona — plenty of money was spent in deep red areas like Alabama & Mississippi.\n\nCharity aside, Stacey Abrams has been one of the most effective people in American left wing politics of the 2010s.",
            "title_similarity": "0.41861308",
            "sentiment_compound": 0.9371
        },
        {
            "id": "hk2lu58",
            "score": 1,
            "text": "Shes amazing and was done so dirty",
            "title_similarity": "0.057168953",
            "sentiment_compound": 0.0152
        },
        {
            "id": "hk2lvll",
            "score": 1,
            "text": "So people need to take responsibility",
            "title_similarity": "-0.13183182",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ly3y",
            "score": 1,
            "text": "If things were right in this world.There is your next president",
            "title_similarity": "0.17352587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2lyyb",
            "score": 1,
            "text": "I want her as president.",
            "title_similarity": "0.19793981",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk2m0uv",
            "score": 1,
            "text": "Wow incredible!\nCan she now tackle student loans lol",
            "title_similarity": "0.2600746",
            "sentiment_compound": 0.784
        },
        {
            "id": "hk2m0vk",
            "score": 1,
            "text": "While I am in favor of this, is there a risk of being accused of buying votes? What if they had bought cars or paid for trips, for example? Again it’s great that they did this I just worry about potential legal issues. Also I am ignorant about the details of OAC spending regulations.",
            "title_similarity": "0.23790702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2m5uu",
            "score": 1,
            "text": "Stacey Abrams for President",
            "title_similarity": "0.26077074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2m7si",
            "score": 1,
            "text": "And people will still vote Republican.",
            "title_similarity": "0.16311243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2meob",
            "score": 1,
            "text": "she really is the best",
            "title_similarity": "0.00614419",
            "sentiment_compound": 0.6666
        },
        {
            "id": "hk2mhb4",
            "score": 1,
            "text": "Direct result of the health insurance industry. \n[From Snopes](https://www.snopes.com/fact-check/healthcare-profit-1973-hmo-act/)",
            "title_similarity": "0.45797062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2mjbb",
            "score": 1,
            "text": "I admire this woman.",
            "title_similarity": "-0.07930917",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hk2mod3",
            "score": 3,
            "text": "*This* is communism. -the right",
            "title_similarity": "0.13307616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2mu7v",
            "score": 1,
            "text": "Lady in purple clothing the south purple.",
            "title_similarity": "0.0308128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2mwr6",
            "score": 1,
            "text": "I wish I could vote for her. What a spectacularly amazing human.",
            "title_similarity": "0.133265",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hk2mx62",
            "score": 1,
            "text": "Oh there is going to be some seriously unhappy people.  Maybe this could be different, since it's for medical, but it wouldn't surprise me (however unlikely it may be) that someone is going to try to bar this or punish her for it.",
            "title_similarity": "0.24096325",
            "sentiment_compound": -0.8431
        },
        {
            "id": "hk2my6p",
            "score": 1,
            "text": "Hopefully she's the future of the Democratic party.",
            "title_similarity": "0.15002453",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hk2n1b2",
            "score": 1,
            "text": "God I hope she runs for something. Anything at all. If I can vote for her, I will.",
            "title_similarity": "0.058739744",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hk2n4bf",
            "score": 1,
            "text": "I hope these monies were distributed to marginalized peoples first and foremost.",
            "title_similarity": "0.10487442",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk2n946",
            "score": 2,
            "text": "Imagine having medical bills in the first place.",
            "title_similarity": "0.41432524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2nbtv",
            "score": 1,
            "text": "Put a cape on this lady.",
            "title_similarity": "-0.059045017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ngim",
            "score": 2,
            "text": "this is great and should not be needed",
            "title_similarity": "-0.1213322",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hk2nilu",
            "score": 2,
            "text": "I really want Abrams for Governor of GA.",
            "title_similarity": "0.09121158",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hk2nlpe",
            "score": 1,
            "text": "Yup this country is about to have a worse recession than 08",
            "title_similarity": "0.40011546",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hk2nn5n",
            "score": 1,
            "text": "Where do I sign up?",
            "title_similarity": "-0.11442781",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2no4q",
            "score": 1,
            "text": "Such a better use of fundraising than advertising which she can get for free for doing actions like this.",
            "title_similarity": "0.20042786",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hk2nqc2",
            "score": 2,
            "text": "\"Medical Debt\" .... bless the NHS",
            "title_similarity": "0.46449667",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk2nu5p",
            "score": 2,
            "text": "This is awesome! My Church has done something similar in the past too.",
            "title_similarity": "0.16120012",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hk2nyez",
            "score": 1,
            "text": "Actually $1.34 million her PAC donated",
            "title_similarity": "0.65229326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2o3c1",
            "score": 2,
            "text": "\"She can't do that! Shoot her...or something!\"\n\n-The GOP probably.",
            "title_similarity": "0.18277034",
            "sentiment_compound": 0.3859
        },
        {
            "id": "hk2o615",
            "score": 1,
            "text": "This is really, really wonderful.",
            "title_similarity": "-0.11866891",
            "sentiment_compound": 0.6453
        },
        {
            "id": "hk2ohqe",
            "score": 1,
            "text": "About $2000 a person? Holy shit",
            "title_similarity": "0.5434497",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hk2oit6",
            "score": 1,
            "text": "Should she be the 2024 nominee?",
            "title_similarity": "0.23698318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2okpq",
            "score": 1,
            "text": "Stacey Abrams is a national treasure.",
            "title_similarity": "0.1526151",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk2oli9",
            "score": 1,
            "text": "While this is good.  Without change, healthcare costs will continue to soar - especially when they can wipe out not just people's life savings but the PAC war chests too.  \n\nWe need systemic reform. Medicare for all.  National healthcare.",
            "title_similarity": "0.46030277",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hk2onw9",
            "score": 1,
            "text": "This is the type of publicity politicians need to be aiming for",
            "title_similarity": "0.050734483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2oo4t",
            "score": 1,
            "text": "Amazing. This is what humanity looks like folks.",
            "title_similarity": "-0.059906833",
            "sentiment_compound": 0.743
        },
        {
            "id": "hk2opz6",
            "score": 1,
            "text": "Wow! What badass!!",
            "title_similarity": "-0.04467538",
            "sentiment_compound": 0.795
        },
        {
            "id": "hk2os0g",
            "score": 1,
            "text": "How does $1M cover $200M in debt? What’s going on with the other $100M raised?",
            "title_similarity": "0.6805291",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hk2ou3k",
            "score": 2,
            "text": "I’m gonna get a flag with her name on it and fly it in the back of my pickup truck.",
            "title_similarity": "0.29934746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2p165",
            "score": 1,
            "text": "I wipe out my medical debt by ignoring it! 👍",
            "title_similarity": "0.3603875",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hk2p47q",
            "score": 2,
            "text": "“PAC subsidizes healthcare because no one else will help.” there I fixed the title",
            "title_similarity": "0.44745117",
            "sentiment_compound": -0.296
        },
        {
            "id": "hk2pk59",
            "score": 2,
            "text": "This is good know matter what side you on",
            "title_similarity": "-0.18218842",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hk2pqww",
            "score": 1,
            "text": "Nice.",
            "title_similarity": "-0.23867881",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk2ps5o",
            "score": 3,
            "text": "Granted i only have like 1800 in medical debt i'd still like for it to be cleared  :(",
            "title_similarity": "0.54358065",
            "sentiment_compound": 0.25
        },
        {
            "id": "hk2qtnp",
            "score": 2,
            "text": "That’s an average of $1,962.96/person.",
            "title_similarity": "0.47419217",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2rak9",
            "score": 7,
            "text": "Stacey Abrams is the hero we all need.",
            "title_similarity": "0.18145917",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hk2rgad",
            "score": 3,
            "text": "She deserves some huge award for all the stuff she’s accomplished. Not even sure what award would apply, I can’t think of any, but she deserves the hell out of one.",
            "title_similarity": "0.19997042",
            "sentiment_compound": -0.4178
        },
        {
            "id": "hk2rgh4",
            "score": 17,
            "text": "Can she run for president in 2024 or at least be on the ticket? She gets shit done and I can't imagine loses any negotiations.",
            "title_similarity": "0.45206457",
            "sentiment_compound": -0.3895
        },
        {
            "id": "hk2riw4",
            "score": 48,
            "text": "Doing the Lord's work, when Republicans won't.",
            "title_similarity": "0.06700716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2rmh0",
            "score": 3,
            "text": "Stacey Abrams is easily the best thing about Georgia right now.",
            "title_similarity": "0.19797869",
            "sentiment_compound": 0.765
        },
        {
            "id": "hk2roof",
            "score": 2,
            "text": "Finally someone who will just quit with the lip service and do it.",
            "title_similarity": "0.120686576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2rsp7",
            "score": 2,
            "text": "Wish mine got wiped 21 with 9k, really holding me back",
            "title_similarity": "0.39532435",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk2rvzr",
            "score": 3,
            "text": "Asked for comment on the PAC’s charitable efforts, Republicans responded by …further ‘redistricting’ 108,000 voters into oblivion.",
            "title_similarity": "0.672119",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk2s2r7",
            "score": 3,
            "text": "As much as I am for this…being selfish can her PAC do student loans next? Just saying if Biden and the government isn’t going to",
            "title_similarity": "0.3509501",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk2s4ok",
            "score": 2,
            "text": "Stacey Abrams's face needs to be on one of our dollar bills. She is a true patriot.",
            "title_similarity": "0.2666849",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk2s7mo",
            "score": 3,
            "text": "My (US) brother in law and his family are retired military and they LOVELOVELOVE their socialist medical care.  Trump voters. AOC/Bernie haters.",
            "title_similarity": "0.53602004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2sp0q",
            "score": 18,
            "text": "This is public service, at its best!  I can hear the trump hollow men shrieking socialism already",
            "title_similarity": "0.27909905",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hk2st20",
            "score": 2,
            "text": "I was wonder where this #queen has been during this !",
            "title_similarity": "0.12448585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2t4ov",
            "score": 3,
            "text": "This lady needs to be president …. If she ran in 2024 she’d have my vote",
            "title_similarity": "0.3814606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2t4pt",
            "score": 3,
            "text": "Stacy Abrams for president!",
            "title_similarity": "0.3431453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2tbog",
            "score": 2,
            "text": "Now they’re just going to be lazy and feel entitled to health \n\n/s",
            "title_similarity": "0.1396929",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hk2td9x",
            "score": 3,
            "text": "What are things billionaires have never done for anyone, ever, LeVar?",
            "title_similarity": "0.4018576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2ti8h",
            "score": 2,
            "text": "Abrams for President!!!",
            "title_similarity": "0.28279847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2tr53",
            "score": 2,
            "text": "This woman needs to be President , and I want to hate her, but love her. The unstoppable force of southern apathy and hate, meet the immovable object of Stacey Abrams will. Geez, someone should sell tickets.",
            "title_similarity": "0.3003552",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hk2tyf4",
            "score": 1,
            "text": "holy fuck.",
            "title_similarity": "-0.039174423",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk2u31g",
            "score": 1,
            "text": "More of this",
            "title_similarity": "-0.17979842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2uayf",
            "score": 1,
            "text": "That's about 2g per person",
            "title_similarity": "0.39277697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2uh6h",
            "score": 1,
            "text": "That's great to hear, but we still have problem...\n\nIts great to pay off the neighborhood mobster debt....\n\nBut we still have the mobster",
            "title_similarity": "0.2486023",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hk2uj4e",
            "score": 1,
            "text": "This is awesome! Can someone also do it with student loans?",
            "title_similarity": "0.13081442",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hk2ujcu",
            "score": 1,
            "text": "I need to give her PAC money.",
            "title_similarity": "0.14543343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2uohh",
            "score": 1,
            "text": "Trump could have done this as a billionaire.  Didn't.  Rupert Murdoch could have done this ten times over and still have $20,000,000,000.  Hasn't.  Draw your own conclusions.",
            "title_similarity": "0.57896996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2uq7i",
            "score": 1,
            "text": "Fine, we’ll make our own socialism, with blackjack and hookers. /s",
            "title_similarity": "0.2668575",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hk2utm4",
            "score": 1,
            "text": " Queen",
            "title_similarity": "0.0019359477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2vei5",
            "score": 1,
            "text": "What a freaking hero!",
            "title_similarity": "-0.014402177",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hk2vhxu",
            "score": 1,
            "text": "So uh... how do you get in on this \"having your medical debt\" paid off thing? It's basically keeping me from buying a house lol",
            "title_similarity": "0.5405905",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk2vqpx",
            "score": 1,
            "text": "Good work, but if we had free health plan that money would of been used in other areas such as homelessness, food, repair schools.  Thank you though.",
            "title_similarity": "0.27783993",
            "sentiment_compound": 0.8641
        },
        {
            "id": "hk2vr5n",
            "score": 1,
            "text": "Gonna have to start this with the obvious stuff here:\n\nThat is awesome! My wife and I do this on a small scale once we learned how it works. 212 million dollars is a lot even if that is the purchased amount and not the purchasing power. \n\nNow, my dark spot gets to talk (doctors orders)\n\nIt’s an answer to a problem that is created by the much bigger problem. Kudos, to everyone who does this for seeing pain and suffering and finding an avenue to make it go away… that is the spirit we need everywhere.\n\nHowever, we could buy all the medical debt up and it would still begin to accrue as soon as we stopped, maybe even worse, as markets tend to adapt to this type of activity.\n\nIt still leaves the mechanism in place for it to happen again.\n\nI know, I know: one thing at a time, right? Well no. That’s not how we do triage or emergency care, you take care of the GSW *and* the 6 inch laceration at the same time… and that’s what we should be amending to these real awesome stories, is how we also get free healthcare in place to stop this tax on existence.",
            "title_similarity": "0.53749156",
            "sentiment_compound": 0.636
        },
        {
            "id": "hk2vrv9",
            "score": 1,
            "text": "Holy shit she’s a mf’n saint",
            "title_similarity": "0.11972125",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hk2vzom",
            "score": 3,
            "text": "'BoTh PaRtIeS aRe ThE sAmE'",
            "title_similarity": "-0.036309786",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk2w1va",
            "score": 2,
            "text": "Medical debt should never be a thing.",
            "title_similarity": "0.22113416",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk2w4da",
            "score": 1,
            "text": "We need to change the “just say you are ‘suspending’ your campaign and you get to keep the money” stuff.",
            "title_similarity": "0.21079138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2wbrj",
            "score": 1,
            "text": "Health Fund and Delivery Day are two episodes of Superstore that shine a light (although a bit exaggerated) on what healthcare is like for some Americans if anyone  is interested. It’s so sad, but they make it funny.",
            "title_similarity": "0.38625008",
            "sentiment_compound": 0.6191
        },
        {
            "id": "hk2wcf8",
            "score": 1,
            "text": "Txt version if people dont or cant use link\n\nA political organization led by Stacey Abrams has paid off medical debts owed by 108,000 people in Georgia, Arizona, Louisiana, Mississippi and Alabama.\n\nThe Fair Fight Political Action Committee donated a total of $1.34 million to the nonprofit organization RIP Medical Debt to clear debts that carried a face value of $212 million, the Associated Press reported.\n\nThe state where the most people received the debt payoffs was Georgia, where 69,000 people had their medical bills paid. In Arizona, 27,000 had their debts paid, while 8,000 people in Louisiana had theirs forgiven, followed by about 2,000 people in both Mississippi and Alabama.\n\nAbrams founded Fair Fight Action after losing the 2018 election for governor of Georgia. The group has since raised more than $100 million. While Fair Fight Action has thus far been known mostly for voting rights advocacy, it recently started working toward broadening health care throughout the country.\nNewsweek Newsletter sign-up >\n\n\"I know firsthand how medical costs and a broken healthcare system put families further and further in debt,\" Abrams said in a statement. \"Across the sunbelt and in the South, this problem is exacerbated in states like Georgia where failed leaders have callously refused to expand Medicaid, even during a pandemic.\"\n\nFor more from Newsweek on Stacey Abrams, click here.\n\nFor more reporting from the Associated Press, see below.\nStacey Abrams\nStacey Abrams' PAC donated millions to pay off medical debts for 108,000 people. Above, Abrams accepts the Social Justice Impact Award during the 52nd NAACP Image Awards on March 27, 2021. NAACP via Getty Images\nNewsweek subscription offers >\n\nLauren Groh-Wargo, CEO of allied group Fair Fight Action and senior adviser to the PAC, said paying off medical debt is another facet of the group's advocacy seeking expansion of Medicaid coverage in the 12 states that have refused to expand the health insurance to all poorer adults.\n\n\"What is so important about this is the tie between Medicaid expansion and just crushing medical debt,\" Groh-Wargo said.\n\nOf the states targeted, Arizona and Louisiana have expanded Medicaid.\n\nLast week, Fair Fight Action launched ads last week demanding that Georgia Republican Governor Brian Kemp add Medicaid expansion to the list of topics that Georgia lawmakers will consider in a special session starting next week to redraw electoral districts. Democrats are hoping Abrams will run against Kemp again in 2022 after a narrow loss that launched her into political stardom.\n\nRIP Medical Debt said Fair Fight is giving the third-largest donation in its history. Philanthropist MacKenzie Scott gave the group $50 million last year. The group has aided more than 3 million people since it was founded in 2014, typically buying bundles of medical debt at steep discounts from the face value. The bills often are purchased from collection agencies that have been trying to get debtors to pay for years. The group has wiped out debt with a face value of more than $5.3 billion.\nRead more\n\n    Trump Says Stacey Abrams 'Might Very Well Be Better' as Georgia's Governor\n    Georgia GOP's Support of Trump Could Cost State Races in 2022\n    Prosecutor Was Forced Out After Refusing Trump Demands to Probe Voter Fraud\n    Why Black Lives Matter Winning Nobel Peace Prize Would be 'Brave Decision'\n\nAllison Sesso, executive director of RIP Medical Debt, said such liabilities often drive people into bankruptcy, can deter people from seeking needed medical care, and can lead to wages being garnished or liens filed on property.\n\n\"I wouldn't underestimate the mental anguish that people have from medical debt,\" Sesso said.\n\nSesso said her group is not just pursuing debt abolishment \"but thinking about how we can improve the system nationwide,\" trying to advocate that hospitals should do more to make charity care available. She also said research shows states that expanded Medicaid have lower rates of medical debt.\n\n\"We are not the permanent solution,\" Sesso said. \"There does need to be a larger solution around what we do about medical debt.\"\n\nGroh-Wargo said the money was given by donors for political action, but said the money represents \"only a small percentage\" of what Fair Fight has raised.\n\n\"I think of this as politically tithing to help the community we are advocating for and with,\" Groh-Wargo said, saying the group has done smaller-scale charitable efforts.",
            "title_similarity": "0.8398763",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hk2wg0c",
            "score": 1,
            "text": "How is this woman not our president? Every time I read this woman’s name, I get so happy!",
            "title_similarity": "0.29583317",
            "sentiment_compound": 0.7213
        },
        {
            "id": "hk2wg72",
            "score": 1,
            "text": "How is this woman not our president? Every time I read this woman’s name, I get so happy!",
            "title_similarity": "0.29583317",
            "sentiment_compound": 0.7213
        },
        {
            "id": "hk2whtn",
            "score": 2,
            "text": "It goes to show the USA 🇺🇸 is a 3rd world country with a Gucci belt. Trying to fake its way to first class",
            "title_similarity": "0.46616444",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk2wmj3",
            "score": 1,
            "text": "How many of these recipients will vote Republican in the next election? With their debts cleared they are on their way to becoming billionaires and Republicans put the interests of billionaires first.",
            "title_similarity": "0.5326395",
            "sentiment_compound": 0.34
        },
        {
            "id": "hk2wpu3",
            "score": 2,
            "text": "She's a goddamn national treasure",
            "title_similarity": "0.16825056",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hk2wrob",
            "score": 1,
            "text": "republicans will  call her a filthy communist",
            "title_similarity": "0.3062111",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2wsu2",
            "score": 1,
            "text": "talking that talk, but walking that walk.",
            "title_similarity": "-0.043764334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2xdt1",
            "score": 1,
            "text": "What is that? About $2k average per person?",
            "title_similarity": "0.5263885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2xgc1",
            "score": 2,
            "text": "Please run for prez. No joe no don. Stacey is it.",
            "title_similarity": "0.18671334",
            "sentiment_compound": 0.2472
        },
        {
            "id": "hk2xni7",
            "score": 1,
            "text": "She will run for Pres - well done her.",
            "title_similarity": "0.030704476",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk2xnoc",
            "score": 1,
            "text": "Give Stacy Abrams the DNC chair position… at least until She runs for Governor of Georgia, again",
            "title_similarity": "0.3371281",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2xykd",
            "score": 1,
            "text": "You can do that with a PAC?\n\nI had no idea.",
            "title_similarity": "0.13258244",
            "sentiment_compound": -0.296
        },
        {
            "id": "hk2yfdk",
            "score": 1,
            "text": "Obviously this is wonderful and potentially lifechanging for many people. But am I wrong to think that this is a band-aid on a very serious problem? Money raised for her candidacy was used to pay off debt collectors? Why should they have that money?\n\nIt's good but kind of twisted. \n\nBillionaires could wipe out tons of medical debt any time, but does that help us when the system will just create more medical debt the next day? And who is getting rich off it? Debt collectors and health insurance companies who have been gouging us in the first place?",
            "title_similarity": "0.59734476",
            "sentiment_compound": -0.8264
        },
        {
            "id": "hk2yh1a",
            "score": 2,
            "text": "Good shit, but that's only a drop in the bucket.  There are more than 50 million people in the US with medical debt.",
            "title_similarity": "0.80825114",
            "sentiment_compound": -0.7391
        },
        {
            "id": "hk2yhva",
            "score": 2,
            "text": "Good news for once. Fuckin' hell, man!",
            "title_similarity": "0.03163272",
            "sentiment_compound": -0.5081
        },
        {
            "id": "hk2ym16",
            "score": 4,
            "text": "It's surprising that only 108,000 people owed 212 million is just medical debt! That's insane.",
            "title_similarity": "0.74466836",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hk2yoc1",
            "score": 1,
            "text": "Stacey Abrams is the goat",
            "title_similarity": "0.14367425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2z2ha",
            "score": 1,
            "text": "The sad part that this is good news sucks. Healthcare system is clearly broken",
            "title_similarity": "0.36563393",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk2z4sd",
            "score": 2,
            "text": "She's just trying to get people to vote for her by implementing policies that make people's lives better.  Cheap trick.  /s",
            "title_similarity": "0.18633252",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk2zblu",
            "score": 2,
            "text": "Good stuf",
            "title_similarity": "-0.07693491",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk2zdhq",
            "score": 2,
            "text": "Damn wish she could wipe mine. It’s fucked up that I have it.",
            "title_similarity": "0.19292036",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hk2zqtk",
            "score": 1,
            "text": "Abrams for president.",
            "title_similarity": "0.25451833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2zr0v",
            "score": 1,
            "text": "Fuck yes! Do me next!!",
            "title_similarity": "-0.09460683",
            "sentiment_compound": -0.3971
        },
        {
            "id": "hk2zt90",
            "score": 1,
            "text": "Republicans: \"she's a communist!!\"  Or some other horse fox news bullshit \n\nIt's a struggle to fight for reason these days. It really fucken is.",
            "title_similarity": "0.34837848",
            "sentiment_compound": -0.8513
        },
        {
            "id": "hk2ztcn",
            "score": 2,
            "text": "Clone Stacy abrams",
            "title_similarity": "0.20499617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2zuy0",
            "score": 1,
            "text": "I’m really really hoping this woman runs for president. Last election I was at a stage in life where I was finally able to donate to things I cared about politically and she was someone I donated to. I’m hoping her momentum stays and she gets to make even bigger impacts.",
            "title_similarity": "0.40360805",
            "sentiment_compound": 0.839
        },
        {
            "id": "hk2zwub",
            "score": 1,
            "text": "They should make a statue of this woman",
            "title_similarity": "0.13821952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3027r",
            "score": 2,
            "text": "Ewww! Radical progressives! …\n\ns/",
            "title_similarity": "0.015985765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk303d0",
            "score": 2,
            "text": "But I thought “all politicians on both sides are corrupt and only care about money”?",
            "title_similarity": "0.4138328",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hk308ac",
            "score": 2,
            "text": "She must be a Republican right? Bahahaha sorry.",
            "title_similarity": "0.21303946",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hk30aja",
            "score": 1,
            "text": "She's a fucking goddess.",
            "title_similarity": "0.074767865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk30q57",
            "score": 1,
            "text": "I became disabled while working at an excellent paying job and even have long-term disability insurance but the whole process bankrupted me. SS refused to pay, had to take to court, won, the assholes dumped all the pay to me at once (48k) so I had to pay mad taxes out of it, then had to declare bankruptcy to keep all the rest from being sued for by the hospital. After that, long term disability won’t pay until they get money that SS should have been paying out. I only have about $4k left of it all and still have another year before my long-term disability insurance will start paying me again. Try living off of $1640 a month FOR EVERYTHING including rent, utilities, and prescription drug copays and insurance deductible. My 401k was wiped out as well from having to cover it all.\n\nThis is America.🙁",
            "title_similarity": "0.69700766",
            "sentiment_compound": -0.9163
        },
        {
            "id": "hk30rca",
            "score": 1,
            "text": "Medical debt is awful; we need single payer. But at the same time, PACs funneling money selectively for private individuals' benefit doesn't solve that.  And even worse, did this PAC just give the money to the health industry collectors? Is that what the headline should read?",
            "title_similarity": "0.5233932",
            "sentiment_compound": -0.6483
        },
        {
            "id": "hk30tor",
            "score": 1,
            "text": "A good deed, hopefully people will see that instead of the twisted narrative the media will portray. People who aren't struggling with medical debt will never know the struggle those with medical have to face. You ended up choosing the divorce rather than making your family declare medical bankruptcy over something that you have absolutely no control over simple because genetic and born in toxic environment.",
            "title_similarity": "0.4521035",
            "sentiment_compound": 0.5995
        },
        {
            "id": "hk314sx",
            "score": 1,
            "text": "So glad I’m not living in that country. Holy fuck. The time, energy, money you need to put into these stuff is just insane.",
            "title_similarity": "0.2995069",
            "sentiment_compound": -0.204
        },
        {
            "id": "hk315h5",
            "score": 1,
            "text": "Jesus Christ that’s amazing. I’ve never been political or kept up with what politicians do (mostly out of apathy and numbness for the whole process) but the more I hear of her the more I like her.",
            "title_similarity": "0.3785299",
            "sentiment_compound": 0.6017
        },
        {
            "id": "hk316dj",
            "score": 1,
            "text": "First reaction: Awesome!\n\nSecond reaction: WTF aren’t PACs allowed to spend their money on??? Our political finance laws need an overhaul holy shit.",
            "title_similarity": "0.4661219",
            "sentiment_compound": -0.7064
        },
        {
            "id": "hk316i4",
            "score": 1,
            "text": "And then there are GQP pacs that go towards stopping legal voting for US citizens.  Which is more worthy of donations?",
            "title_similarity": "0.40394944",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hk31hq2",
            "score": 2,
            "text": "They paid $1.34 million to wipe out $212 million. Are hospital bills real?",
            "title_similarity": "0.8434367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk31k9d",
            "score": 1,
            "text": "As good as this is.  Doesn’t it still help the system???",
            "title_similarity": "-0.034093834",
            "sentiment_compound": 0.7303
        },
        {
            "id": "hk31q51",
            "score": 2,
            "text": "Dang.\n\nThat IS what America should be. \n\nSee Dems, if you show actual RESULTS…\n\nPeople will get it.",
            "title_similarity": "0.13043623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk31uad",
            "score": 2,
            "text": "So $1.34M cleared more than 100,000 peoples' debts? Debts that carried a face value of $212M? By my math, rounded up for easy numbers, that's like saying a $15 payment cleared up $3000 worth of debt. I have to wonder how many fewer people would have even have had debts to clear if they had been offered a chance to clear it by paying 0.5% of what they owed. Maybe this sort of discount rate should be offered individually?",
            "title_similarity": "0.72819287",
            "sentiment_compound": 0.9327
        },
        {
            "id": "hk327a3",
            "score": 2,
            "text": "Another feel good story for our dystopian life.",
            "title_similarity": "0.08756217",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk32i13",
            "score": 1,
            "text": "She is AWESOME in so many ways.",
            "title_similarity": "-0.053048655",
            "sentiment_compound": 0.7034
        },
        {
            "id": "hk32pki",
            "score": 3,
            "text": "She is a beast. A true politician for the people.",
            "title_similarity": "0.23471229",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk32tgk",
            "score": 1,
            "text": "How very lucky for those special 108,000 people. What is that, like 35% of all Americans? That's essentially a failing grade. \n\nAnd I love this \"evil conservatives won't let us Democrats give you anything for your vote wah wah wah\" line they regurgitate every election cycle.  \n\n\nThis is just a distraction. Joey is keeping his promise to corporate America, that nothing would fundamentally change. In the same breath, during a deadly pandemic, also said that if Medicare-4-All came to his desk, he'd veto it.  \n\n\nWonder why that story hasn't made headlines?",
            "title_similarity": "0.6406833",
            "sentiment_compound": 0.4594
        },
        {
            "id": "hk32xr5",
            "score": 1,
            "text": "Which states?",
            "title_similarity": "-0.09842761",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33hco",
            "score": 2,
            "text": "I need her to run for president.",
            "title_similarity": "0.29743066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33i48",
            "score": 1,
            "text": "This is so uplifting , this is what elected officials should be doing .",
            "title_similarity": "0.029972382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33j34",
            "score": 1,
            "text": "It’s great too because the company that owned the debts contributes to her campaign.",
            "title_similarity": "0.3642007",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hk33m2k",
            "score": 1,
            "text": "I wish more rich people were like this",
            "title_similarity": "0.16248298",
            "sentiment_compound": 0.8439
        },
        {
            "id": "hk33oye",
            "score": 1,
            "text": "What office will she be running for? Anyone have any guesses?",
            "title_similarity": "0.21530905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33phw",
            "score": 2,
            "text": "How do we make her the president???",
            "title_similarity": "0.33951887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33qwq",
            "score": 1,
            "text": "Republicans: Now THIS is an Avengers-level threat!",
            "title_similarity": "0.2123201",
            "sentiment_compound": -0.5707
        },
        {
            "id": "hk33sd3",
            "score": 1,
            "text": "Bampf",
            "title_similarity": "-0.10173251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk33ukl",
            "score": 3,
            "text": "America needs more like Stacey Abrams.",
            "title_similarity": "0.14282945",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hk33wpu",
            "score": 1,
            "text": "How do you apply for that lol",
            "title_similarity": "-0.043083236",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk3436b",
            "score": 2,
            "text": "Whenever she's speaking on TV, I drop what I'm doing.  Can she run for president in 2024 please?  She's so bad ass!  👍👍👍👍👍",
            "title_similarity": "0.46750602",
            "sentiment_compound": -0.3367
        },
        {
            "id": "hk3489w",
            "score": 1,
            "text": "This is nice, and I appreciate how important an issue this is. But how about spending her very impressive skills on getting more Democrats elected so we can 1.  stop America's slide into fascism and 2. pass universal health care?",
            "title_similarity": "0.39626333",
            "sentiment_compound": 0.8895
        },
        {
            "id": "hk34ke4",
            "score": 1,
            "text": "r/humansbeingbros",
            "title_similarity": "-0.07199028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk34nud",
            "score": 3,
            "text": "Wow, a politician actually doing something that helps people other than themselves? We must be living in a simulation at this point.",
            "title_similarity": "0.2536487",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hk34us6",
            "score": 7,
            "text": "Great this was done but we must fix the underlying problem",
            "title_similarity": "-0.04024548",
            "sentiment_compound": -0.25
        },
        {
            "id": "hk34vnp",
            "score": 4,
            "text": "The fact that this debt exists for those dollar amounts, for what amounts to a fraction of a fraction of the US populace, affects me profoundly.",
            "title_similarity": "0.46648273",
            "sentiment_compound": -0.4357
        },
        {
            "id": "hk353eh",
            "score": 1,
            "text": "How did she do that? And why didnt i recieve anythinh",
            "title_similarity": "0.07938722",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk35982",
            "score": 1,
            "text": "Stacy abrams for pres?",
            "title_similarity": "0.102313675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk35k78",
            "score": 1,
            "text": "Yasss queen",
            "title_similarity": "0.05240499",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk35o0f",
            "score": 3,
            "text": "She is a gem of a human ❤️ I will vote for you again!",
            "title_similarity": "0.09548324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk35xf4",
            "score": 1,
            "text": "What about dental?",
            "title_similarity": "0.12317768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk35yzi",
            "score": 2,
            "text": "Abrams 2024!",
            "title_similarity": "0.17992415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk36qph",
            "score": 2,
            "text": "Canadian here- That’s about 2 grand a person. Just how long were they parked. My hospital parking fees cap out at $20 a day! Everything else is ZERO and piss off with your wait time rants, those are grossly overstated to trigger Americans paying through the nose for slightly faster service",
            "title_similarity": "0.6916195",
            "sentiment_compound": -0.4926
        },
        {
            "id": "hk36vq7",
            "score": 1,
            "text": "Weird title/confusing article. Headlines makes it sound like her group is responsible for $212 mil but the article makes it sound like her group donated $1.4 mil to a larger group that then paid off $212 in debt.",
            "title_similarity": "0.77057815",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hk3725k",
            "score": 1,
            "text": "God Bless Stacy Abrams.\n\nStacey Abrams for Governor.\n\nStacey Abrams for President.\n\nMay her powerful and effective actions inspire millions of women and PoC to take direct action!",
            "title_similarity": "0.38242638",
            "sentiment_compound": 0.9299
        },
        {
            "id": "hk374dn",
            "score": 2,
            "text": "Amazing humanitarian work!",
            "title_similarity": "0.0011513494",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hk379wk",
            "score": 1,
            "text": "Chaddest of all chads",
            "title_similarity": "0.17003542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk37c3m",
            "score": 1,
            "text": ">The Fair Fight Political Action Committee donated a total of $1.34 million to the nonprofit organization RIP Medical Debt to clear debts that carried a face value of $212 million, the Associated Press reported.\n>\n>The state where the most people received the debt payoffs was Georgia, where 69,000 people had their medical bills paid. In Arizona, 27,000 had their debts paid, while 8,000 people in Louisiana had theirs forgiven, followed by about 2,000 people in both Mississippi and Alabama.\n>\n>Abrams founded Fair Fight Action after losing the 2018 election for governor of Georgia. The group has since raised more than $100 million. While Fair Fight Action has thus far been known mostly for voting rights advocacy, it recently started working toward broadening health care throughout the country.\n\nWonderful PR move. Is she running again?",
            "title_similarity": "0.82326317",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hk37iqx",
            "score": 2,
            "text": "Did she ever concede losing the GA Governor race 😂",
            "title_similarity": "0.33618557",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk37k8k",
            "score": 1,
            "text": "I'll say this every time: \n\nThe debt collectors were never expecting to get a dime out of these people. All that these rich people are doing are putting money in the pockets of debt collectors.\n\nFor a small fee these rich assholes get publicity.",
            "title_similarity": "0.5070412",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hk37neu",
            "score": 1,
            "text": "I have about 20k in medical debt because I tried to commit suicide two years ago and lived...",
            "title_similarity": "0.74641305",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hk37q4m",
            "score": 1,
            "text": "That's communism! /s",
            "title_similarity": "0.11885798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk37rnf",
            "score": 1,
            "text": "It's almost as if she should've been the VP.  There are so many social issues she could have highlighted.",
            "title_similarity": "0.21192414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk37yj3",
            "score": 2,
            "text": "Republicans and conservatives must be furious and first in line.",
            "title_similarity": "0.29993516",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hk380zx",
            "score": 1,
            "text": "Abrams is who the DNC told people Harris was.",
            "title_similarity": "0.13274258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk38182",
            "score": 1,
            "text": "Some one for sure going for 2024 right?",
            "title_similarity": "0.18531191",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk38575",
            "score": 1,
            "text": "Stacey, I know you will never see this, but please consider running for president (soon).",
            "title_similarity": "0.2662682",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hk3859b",
            "score": 2,
            "text": "This is EXACTLY the type of work our politicians need to be doing not all this capping and lying",
            "title_similarity": "0.14998189",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hk38a8i",
            "score": 4,
            "text": "While that is incredible and thoughtful and it's changed the world for the folks receiving the aid, it's insane that medical debt for one person/family is allowed to get so high.",
            "title_similarity": "0.4355071",
            "sentiment_compound": -0.323
        },
        {
            "id": "hk38ilm",
            "score": 1,
            "text": "She is gonna replace Harris",
            "title_similarity": "0.11914123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk38qfw",
            "score": 1,
            "text": "Not sure if it’s been posted yet, but since Abrams is a GA governor hopeful, it’s important to remember that the current GA governor is still fighting against Medicaid expansion in our state. It’s a move that would help millions of Georgians, yet he and his party refuse to help the people of this state get healthcare on the grounds that they just don’t like Obama. People in this state can’t afford medical care of get affordable insurance because our state government doesn’t agree with the politics of helping its own people not die. \n\nMy one issue with Abrams is she’s currently holding the state Democratic Party essentially hostage by not stating definitively if she’s going to run for governor or not. There are a lot of promising candidates in the wings waiting for her to make up her damn mind.",
            "title_similarity": "0.4858017",
            "sentiment_compound": 0.9863
        },
        {
            "id": "hk38v8a",
            "score": 1,
            "text": "Please do student loans next <3",
            "title_similarity": "0.22298591",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk38ymh",
            "score": 1,
            "text": "I see more ads against medicare negotiating srug prices than for. In fact, i see none for it. Money talks.",
            "title_similarity": "0.5407477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk39l7s",
            "score": 5,
            "text": "This isn’t an amazing, inspirational story. This is a tragedy.\n\nPeople shouldn’t be economic slaves because they got sick. Medical treatment like food and shelter should be basic human rights that everyone has access to and many many countries effectively support this idea.\n\nNo one should have to sacrifice their dreams to help others  just survive.",
            "title_similarity": "0.41192645",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hk39lrc",
            "score": 2,
            "text": "GOP suddenly decides to pressure the SC to overturn Citizens United to see who the FUCK had the audacity to support such horrible humanity.",
            "title_similarity": "0.33944854",
            "sentiment_compound": -0.6633
        },
        {
            "id": "hk39wu6",
            "score": 1,
            "text": "THIS IS WHAT POLITICAL LEADERSHIP IS SUPPOSED TO DO. HELP PEOPLE WHO NEED IT MOST. Fuck yeah.",
            "title_similarity": "0.18330996",
            "sentiment_compound": 0.269
        },
        {
            "id": "hk3a168",
            "score": 1,
            "text": "and party affiliation wasn't used as a filter? Suckers! /s",
            "title_similarity": "0.21383435",
            "sentiment_compound": -0.2244
        },
        {
            "id": "hk3ahmm",
            "score": 1,
            "text": "Cap",
            "title_similarity": "-0.17310654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3ardo",
            "score": 2,
            "text": "Amaze",
            "title_similarity": "-0.19151035",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hk3asfo",
            "score": 2,
            "text": "While I applaud her and her efforts.... I lament that some people will still need to find a way to hate her for this.",
            "title_similarity": "0.1272091",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hk3avb9",
            "score": 1,
            "text": "How can a 1.34 million donation have a face value of 212 million. \n\nCan someone please explain how that is even possible??? \n\nThat’s a 15000% ratio wtf",
            "title_similarity": "0.62293947",
            "sentiment_compound": -0.163
        },
        {
            "id": "hk3avvc",
            "score": 1,
            "text": "What are the chances of her running for POTUS?",
            "title_similarity": "0.08291297",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hk3ayh9",
            "score": 1,
            "text": "I hope they were democrats. The republicans had a have an ongoing opportunity to change healthcare for their constituents but refuse…",
            "title_similarity": "0.38238457",
            "sentiment_compound": 0.431
        },
        {
            "id": "hk3b3fi",
            "score": 2,
            "text": "Buying medical debt from collection agencies is a nice thought, but the credit reports of the people originally owing the medical debt will still reflect their late or “sent to collection” status.  So, while better than declaring bankruptcy, it is still an unnecessary harm to unlucky families.  I applaud it as a better use of PAC money than another useless, glossy political mailer though.",
            "title_similarity": "0.41371527",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hk3bfed",
            "score": 2,
            "text": "Sounds like the PAC is directly buying medical debt that debt collectors are selling for a discounted value? I thought PAC's just donate to political campaigns, they can directly do this kind of stuff too?",
            "title_similarity": "0.5555881",
            "sentiment_compound": 0.1179
        },
        {
            "id": "hk3brwl",
            "score": 2,
            "text": "How do I sign up?",
            "title_similarity": "-0.10177562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3c01o",
            "score": 1,
            "text": "Is one of these states Wisconsin and am I one of those people? That'd be amazeballs.",
            "title_similarity": "0.14644508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3c19f",
            "score": 1,
            "text": "It's crazy how little money is needed to wipe out insane levels of medical debt. This was $1.34MM used to clear this debt. At that rate it would take approximately $880MM to wipe out every dollar of medical debt in the US...or we could have Universal healthcare and stop racking up insane medical debts.",
            "title_similarity": "0.71379924",
            "sentiment_compound": -0.9228
        },
        {
            "id": "hk3c6zt",
            "score": 2,
            "text": "citizens doing more for society than the government. What a fucking joke",
            "title_similarity": "0.31210622",
            "sentiment_compound": 0.3597
        },
        {
            "id": "hk3cl7q",
            "score": 3,
            "text": "And people will still find a way to hate this woman",
            "title_similarity": "0.11945438",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hk3cmo7",
            "score": 2,
            "text": "Hero",
            "title_similarity": "-0.09824101",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hk3coke",
            "score": 2,
            "text": "Stacey Abrams should be the first woman president. She’s a politician who genuinely cares about America, she’s poised, intelligent and educated and she has a goodwill with Americans and in the political arena.",
            "title_similarity": "0.32065886",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hk3d06b",
            "score": 2,
            "text": "I hate that she isn’t the governor in Georgia. Not saying she lost. But our current governor was Secretary of State at the time. The race was very close.\nThis is how people intending to do public service should behave. \nThank you Stacy. I did not benefit from her pact because I have insurance and no medical debt.",
            "title_similarity": "0.47154504",
            "sentiment_compound": -0.2439
        },
        {
            "id": "hk3d4qp",
            "score": 3,
            "text": "Wish it would’ve wiped out my medical debt, lol. I’m really happy for all those people though, I can’t imagine the weight that’s been lifted off of them.",
            "title_similarity": "0.3966072",
            "sentiment_compound": 0.7902
        },
        {
            "id": "hk3dcng",
            "score": 2,
            "text": "Serious question: where’s her Nobel Peace prize nomination? This is the kind of work that merits it.",
            "title_similarity": "0.2264917",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hk3dtqh",
            "score": 2,
            "text": "That’s incredible. People drowning in medical debt in the richest country in the world.",
            "title_similarity": "0.69413555",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hk3dvq9",
            "score": 2,
            "text": "That's an average of $2,000/person.\n\nI went to the ER due to something being stuck/moving in my throat making me gag constantly.  They took my vitals and the doctor shined her phone's flashlight in my mouth and gave me a cup of water and sent me home to wait it out since I wasn't throwing up and the water was able to get down.\n\n$1,750.",
            "title_similarity": "0.65696",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hk3dxwp",
            "score": 1,
            "text": "Now she’s the real GOAT!! Finally some news I can be proud of.",
            "title_similarity": "0.16151452",
            "sentiment_compound": 0.5696
        },
        {
            "id": "hk3e1q7",
            "score": 3,
            "text": "It's an amazing thing she did. But many of those that received this wonderful gift will still scream about \"socialized medicine\" and solely blame the Democrats for their healthcare costs.",
            "title_similarity": "0.47406822",
            "sentiment_compound": 0.7692
        },
        {
            "id": "hk3e70b",
            "score": 1,
            "text": "This is the right way to win over potential voters.",
            "title_similarity": "-0.034089573",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk3e7s3",
            "score": 3,
            "text": "Finally, a politician doing the right thing! More of this please.",
            "title_similarity": "0.12576449",
            "sentiment_compound": 0.5018
        },
        {
            "id": "hk3eaw8",
            "score": 1,
            "text": "How to keep the system running",
            "title_similarity": "-0.115684666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3eleb",
            "score": 1,
            "text": "She is the only politician that gets anything tangibly done. Wish she was a viable candidate for the presidency, maybe she is but I’m not so sure thanks to moderates.",
            "title_similarity": "0.4092651",
            "sentiment_compound": -0.6983
        },
        {
            "id": "hk3entl",
            "score": 1,
            "text": "If anyone asks what my party/candidates are doing for me - this is one of them. She’s an individual but she is on the right track. Eventually I would like for them to the root of the problem.",
            "title_similarity": "0.16497415",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hk3f2wn",
            "score": 2,
            "text": "Absolutely fantastic",
            "title_similarity": "-0.1501959",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hk3f3d9",
            "score": 1,
            "text": "She’s basically a Saint.",
            "title_similarity": "0.027017754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3f4gh",
            "score": 7,
            "text": "Both sides are the same!!!! /s",
            "title_similarity": "-0.0654494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3f5op",
            "score": 1,
            "text": "Next Prez?\n\nI like her.",
            "title_similarity": "-0.057742715",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk3f6a1",
            "score": 2,
            "text": "beautiful",
            "title_similarity": "-0.19484276",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hk3fev1",
            "score": 1,
            "text": "From reading the article how does donating 1.X million clear 2XX million face value debt. Can someone please ELI5",
            "title_similarity": "0.55204624",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk3fl5b",
            "score": 2,
            "text": "And 74 million people still voted for him",
            "title_similarity": "0.44040173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3ggr7",
            "score": 2,
            "text": "I'm surprised it was only \\~$2k of medical debt per person. Was expecting at least 5 figure amounts.",
            "title_similarity": "0.72866356",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hk3gnms",
            "score": 2,
            "text": "If that doesn't say \"yes, I give a damn about you\" nothing ever will.",
            "title_similarity": "0.053403933",
            "sentiment_compound": -0.607
        },
        {
            "id": "hk3gzbm",
            "score": 2,
            "text": "Hitting the red states with blue wins. Show them they matter. Fight for the people. That's how you get this country back on track. Bravo.",
            "title_similarity": "0.3051211",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk3h0uz",
            "score": 1,
            "text": "Does she have another PAC for fighting voter suppression? I thought that was her deal.",
            "title_similarity": "0.32018486",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk3h4sx",
            "score": 1,
            "text": "Mario judah",
            "title_similarity": "0.030945865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3h8vt",
            "score": 1,
            "text": "Disappointed the top post wasn't a link to donate to this PAC.  Is that not allowed in the sub.  I really want to donate to her now, while I'm thinking about it.",
            "title_similarity": "0.3103752",
            "sentiment_compound": -0.1796
        },
        {
            "id": "hk3hhfm",
            "score": 1,
            "text": "The only person in American politics getting anything done and she’s not even holding office",
            "title_similarity": "0.44805998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3hpd6",
            "score": 2,
            "text": "Is there a very specific overview of where the money ends up? I remember meeting a healthcare economist once and I only had one question. Why on earth is healthcare so expensive in the US. He said the answer was one word. Profits. Every level has profits. That adds up quickly and eventually you have $6000 ambulance rides",
            "title_similarity": "0.7231255",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hk3hsza",
            "score": 3,
            "text": "I can see this lady becoming the leader of the free world. And I live in Canada, but I would so truly like to see that.",
            "title_similarity": "0.23707776",
            "sentiment_compound": 0.8985
        },
        {
            "id": "hk3hz2z",
            "score": 5,
            "text": "THIS is what a genuinely good person in politics does. Power hasn’t corrupted her. The Democratic Party needs to follow her lead if they ever want to progress.",
            "title_similarity": "0.1872862",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hk3igjo",
            "score": 2,
            "text": "You mean PAC’s don’t just spend money on attack ads?",
            "title_similarity": "0.25036842",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk3ikxd",
            "score": 1,
            "text": "So then Elon Musk shouldn’t pay the government billions for taxes he should pay medical debt.",
            "title_similarity": "0.56105125",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hk3il77",
            "score": 1,
            "text": "Providing my context on how horrible our system is in the U.S. Some personal experiences and one fact of how scummy it is:\n\n1) My wife was having some complications with our second child, and likely would be born early. Found a closer hospital near me that was in network to give birth in. Found out after my son was born, which he spent a few weeks in the NICU, that the hospital was in network but the NICU was not. Luckily, Insurance company billed them as in network and haven’t seen any issues (yet), but instead of hitting my maximum for in network, it fell under my out of network max of $12K. \n\n2) My wife’s OBGYN, who is in network, didn’t have an ultrasound machine in his office, so she was referred to the hospital to get it. Due to the codes, getting JT done at the hospital is out of network and forced us to pay. \n\n3) Currently in the U.S. private equity firms purchase emergency rooms at hospitals and remove most of the in network insurances they accept, allowing them to charge patients more as they don’t have a standing contract with the insurers.",
            "title_similarity": "0.60164064",
            "sentiment_compound": -0.7878
        },
        {
            "id": "hk3imch",
            "score": 2,
            "text": "Competition and up front pricing will help. I shopped around and only paid 150 for a 1500 abdominal ultrasound. Sometimes self pay is cheaper.",
            "title_similarity": "0.541451",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk3insh",
            "score": 1,
            "text": "Wow",
            "title_similarity": "-0.2065855",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk3j1tq",
            "score": 1,
            "text": "She’s gonna win some big elections and she will have earned it.",
            "title_similarity": "0.16902739",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk3j1vd",
            "score": 1,
            "text": "Can someone do this for student loans?",
            "title_similarity": "0.22943492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3j2lr",
            "score": 2,
            "text": "Stacey Abrams for President 2024.",
            "title_similarity": "0.39226452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3j6tt",
            "score": 2,
            "text": "Medical Debt should be illegal. This is so sad",
            "title_similarity": "0.28911674",
            "sentiment_compound": -0.8776
        },
        {
            "id": "hk3jgjn",
            "score": 1,
            "text": "Well done. It’s nice to see people taking care of people. Republicans have never done stuff like this.",
            "title_similarity": "0.3179103",
            "sentiment_compound": 0.7176
        },
        {
            "id": "hk3jru5",
            "score": 2,
            "text": "At first I read that $212 million was used to wipe debt of 5 people and I wasn't even surprised.",
            "title_similarity": "0.7558749",
            "sentiment_compound": -0.4881
        },
        {
            "id": "hk3jsu2",
            "score": 1,
            "text": "This is the kind of stuff that makes me think Abrams could very easily win a Presidential. The problem is, I don't think the DNC will put her up in 2024, even if Biden and Harris step aside. And...I don't think Biden will step aside, either.\n\nThe fact that people like Abrams are out there but the DNC is still in its current state is what's most depressing. Voting \"not Republican\" isn't even sustainable, because the DNC gets complacent within about 10 minutes, it seems.",
            "title_similarity": "0.5208601",
            "sentiment_compound": -0.2509
        },
        {
            "id": "hk3k06d",
            "score": 2,
            "text": "This right here.  This is what gets results. \nI pray to all the gods that they clone 49 more Stacy Abrams so we could all have one, doing the correct and progressive thing.",
            "title_similarity": "0.3535557",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk3k9kd",
            "score": 1,
            "text": "Even as a young child, growing up in a (not overbearingly) Republican household, it was always apparent to me that the Ds were the good guys and the Rs were the bad guys. \n\nYes, there’s a lot more nuance to it than that, but basically still true. Republicans can’t even be bothered to pretend they want to help people in need.",
            "title_similarity": "0.40185332",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hk3kzsy",
            "score": 1,
            "text": "As a Canadian who has had a few surgeries, broken bones, etc this is such a scary thought to me.\n\nInstead of having a house, cottage and summer car I'd currently have medical debt and still be renting.\n\nThe time I had a rib puncture my lung and was in the hospital for a good while with a lot of follow up treatments alone would have bankrupted me.",
            "title_similarity": "0.6179402",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hk3kzwv",
            "score": 2,
            "text": "So amazing!!! This woman is an angel on earth!",
            "title_similarity": "0.11394798",
            "sentiment_compound": 0.74
        },
        {
            "id": "hk3lqua",
            "score": 2,
            "text": "good for her!!",
            "title_similarity": "-0.106894486",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hk3lrgn",
            "score": 1,
            "text": "Thats honeycomb Brazy",
            "title_similarity": "0.051082104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3lv2z",
            "score": 1,
            "text": "I would really like to see her run in 2024.",
            "title_similarity": "0.2279328",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hk3lves",
            "score": 1,
            "text": "**THAT** much money only covers so few people’s debts??? Man, the US makes me fucking depressed.",
            "title_similarity": "0.4753096",
            "sentiment_compound": -0.6289
        },
        {
            "id": "hk3lwu3",
            "score": 1,
            "text": "I wonder how Fox \"News\" is going to spin this...\n\n\n\nSomething, something medical socialism something.",
            "title_similarity": "0.2844171",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3lzth",
            "score": 1,
            "text": "She should run for president",
            "title_similarity": "0.20412986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3m7ty",
            "score": 1,
            "text": "She needs to run for higher office she rocks!!!",
            "title_similarity": "0.1948515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3mnyy",
            "score": 1,
            "text": "Holy mother of god. \n\nRay of hope for the future.",
            "title_similarity": "-0.020418828",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hk3msyg",
            "score": 1,
            "text": "Looks like they paid 1.34million for 212 million worth of debt.  The prices are too inflated to begin with.",
            "title_similarity": "0.68125963",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hk3mxu6",
            "score": 1,
            "text": "So you’re saying the public doesn’t need to do it, private parties can? Hmm, if only these idiots could keep that mindset with I don’t know, climate change, abortions, privately funding stadiums and not having the public pay for that bullshit.",
            "title_similarity": "0.36543202",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk3n0m6",
            "score": 1,
            "text": "Wow!! I must be dreaming!! I can’t believe I’m actually seeing a politician do something unselfish just to help everyday people around her. Good for you Stacey Abrams you’ll definitely have my support from here on out.",
            "title_similarity": "0.33598697",
            "sentiment_compound": 0.9429
        },
        {
            "id": "hk3n8j9",
            "score": 1,
            "text": "It's unfortunate that this isn't even a lot. In the grand scheme of medical debt.",
            "title_similarity": "0.4351515",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk3nfcw",
            "score": 3,
            "text": "Stacey Abrams rocks.",
            "title_similarity": "0.05019655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3o4e1",
            "score": 1,
            "text": "There should not be medical debt in this country! It would figure it's the women working to figure it out!",
            "title_similarity": "0.27016568",
            "sentiment_compound": 0.4007
        },
        {
            "id": "hk3oui0",
            "score": 1,
            "text": "She did a great thing for sure, and this seems like a move to run for president. She will be remembered in 2023-2024 for doing this.",
            "title_similarity": "0.3138175",
            "sentiment_compound": 0.836
        },
        {
            "id": "hk3p13q",
            "score": 1,
            "text": "While MSNBC and CNN promote trump ad naseum.\n\nLike 2016.\n\nEvery once in a while a human shows up to actually help people. Please protect her as we have a bad history regarding how this ends.",
            "title_similarity": "0.49229807",
            "sentiment_compound": 0.802
        },
        {
            "id": "hk3p34n",
            "score": 1,
            "text": "God bless you m’am",
            "title_similarity": "-0.0307741",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hk3pj65",
            "score": 1,
            "text": "What a political outlier: motivated by kindness, compassion and generosity in an era when other colleagues are doing the opposite in the most terrible ways. *Legend.*",
            "title_similarity": "0.30327213",
            "sentiment_compound": 0.8363
        },
        {
            "id": "hk3pvmj",
            "score": 1,
            "text": "*snoop dogg voice* we stay on point like Stacey Abrams y’all 🎶",
            "title_similarity": "0.13168642",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk3q24e",
            "score": 2,
            "text": "This headline made me tear up. People doing the right thing! How refreshing!",
            "title_similarity": "0.073005125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3q729",
            "score": 1,
            "text": "The American \"Healthcare system\" is a national embarrassment",
            "title_similarity": "0.4087103",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hk3qdid",
            "score": 1,
            "text": "Im calling it now. First female president.",
            "title_similarity": "0.3505422",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3qf5i",
            "score": 2,
            "text": "I am not a Democrat but I am fully on board for normalizing visible, tangible, and charitable results with PAC money versus small political gains for either side.",
            "title_similarity": "0.29872727",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hk3qhl5",
            "score": 1,
            "text": "I didn't even know you could use PAC money like this. I thought you had to spend it on your own personal property or \"legal fees\".",
            "title_similarity": "0.3631721",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hk3ql36",
            "score": 2,
            "text": "Now here's somebody with real credibility.  She ain't trying to score viral moments.  She just does the right thing all the time.",
            "title_similarity": "0.11835174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3r68j",
            "score": 1,
            "text": "Keep pushing money into the healthcare system, more inflation, more",
            "title_similarity": "0.36507922",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3r9wv",
            "score": 2,
            "text": "Imagine what a mega billionaire could do.",
            "title_similarity": "0.26923543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3ra4b",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk3reqp",
            "score": 2,
            "text": "A politician that works for the people.  What a novel concept!",
            "title_similarity": "0.18191144",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hk3s3jq",
            "score": 1,
            "text": "shes the politician we need, not the one we deserve",
            "title_similarity": "0.20492962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3s5vk",
            "score": 2,
            "text": "Imagine if we had a working healthcare system that didn't put 108,000 people's quality of life at risk, over money. Our money should be used to keep Americans safe and healthy. \n\nThank goodness for Stacey Abrams though. She's consistently demonstrating her advocacy for real people.",
            "title_similarity": "0.46025148",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hk3sna5",
            "score": 1,
            "text": "Most politicians who lose close elections but get a lot of political clout usually just focus on their next election (Beto). Or they get depressed. Or they milk it with book deals and paid speeches followed by a lobbying gig. Nah, Ms. Abrams works hard and registers voters. She turned Georgia blue, handing her party the White House and senate. Now she does this. Bravo",
            "title_similarity": "0.588312",
            "sentiment_compound": -0.6738
        },
        {
            "id": "hk3t96o",
            "score": 1,
            "text": "I can't wait to see the Newsmax version of this.\n\n\"Black communist ruins careers of medical insurance CEOs\"",
            "title_similarity": "0.5724697",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hk3toec",
            "score": 1,
            "text": "This is why Stacey Abrams and those like her are the future of the left.",
            "title_similarity": "0.09456279",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk3tzdb",
            "score": 3,
            "text": "Bravo!",
            "title_similarity": "-0.1461196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3u7vp",
            "score": 2,
            "text": "Thank you for all those you helped!",
            "title_similarity": "0.09085427",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hk3u8u8",
            "score": 3,
            "text": "The sh*t this woman pulls off amazes me. Why isn’t she President?",
            "title_similarity": "0.37144995",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk3ua0n",
            "score": 2,
            "text": "We should all team up, pool our money, and negotiate a huge discount on our collective medical bills.",
            "title_similarity": "0.39131466",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk3udvg",
            "score": 2,
            "text": "Now that’s doing your job unlike most politicians!",
            "title_similarity": "0.2436126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3ufb5",
            "score": 3,
            "text": "But 'bOtH pArTiEs aRe tHe sAmE'\n\nAmirite?\n\n/s",
            "title_similarity": "0.024022155",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hk3up3r",
            "score": 1,
            "text": "How TF do I know if I was one of them people?",
            "title_similarity": "-0.03898515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3upwr",
            "score": 1,
            "text": "This is a great thing. \n\nDoes this violate any sort of election laws?",
            "title_similarity": "0.18502629",
            "sentiment_compound": 0.09
        },
        {
            "id": "hk3vjf7",
            "score": 3,
            "text": "Georgia really fucked up. We could’ve had Stacey and instead we got Kemp.",
            "title_similarity": "0.30924785",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hk3w0de",
            "score": 3,
            "text": "This is what a modern day American hero looks like.",
            "title_similarity": "0.17344739",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hk3wpj8",
            "score": 4,
            "text": "Stacy Abrams is an example of what a political leader SHOULD be.",
            "title_similarity": "0.111372694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3wvan",
            "score": 1,
            "text": "$425,000,000!",
            "title_similarity": "0.4945265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3x0qg",
            "score": 3,
            "text": "wtf is she not our president?",
            "title_similarity": "0.31759948",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hk3xnu9",
            "score": 3,
            "text": "Meanwhile, Jeff Bezos is using his fortune to send William Shatner on space tourism missions.",
            "title_similarity": "0.40193155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3y3i7",
            "score": 2,
            "text": "I will be pretty okay with the idea of Stacey Adams running for President.",
            "title_similarity": "0.2600897",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hk3y6tb",
            "score": 2,
            "text": "Now THAT is doing some damn good in the world!",
            "title_similarity": "-0.07230478",
            "sentiment_compound": 0.126
        },
        {
            "id": "hk3ybs0",
            "score": 2,
            "text": "This woman should just run for president already.",
            "title_similarity": "0.3162105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3yh3o",
            "score": 2,
            "text": "This woman better be President one day.",
            "title_similarity": "0.23535314",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk3yjbk",
            "score": 3,
            "text": "She should be leading the DNC",
            "title_similarity": "-0.0076608695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3ykq2",
            "score": 4,
            "text": "Yay to be the richest country in the history of civilization and trillions of military budget.  Republicans have fucked this country more than foreign adversaries.",
            "title_similarity": "0.5902633",
            "sentiment_compound": 0.0352
        },
        {
            "id": "hk3zbgg",
            "score": 1,
            "text": "Would never ever happen in the smash community\n\nEspecially not in the video, because it was a mistake or she found you cute, don’t cover the drugs that she and her husband defended Darby’s. Babygirl we’ve all left Germany knowing the Nazis were in power! It’s refreshing.",
            "title_similarity": "0.40404636",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hk40azc",
            "score": 1,
            "text": "What is PAC?",
            "title_similarity": "0.018857837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk40nxp",
            "score": 1,
            "text": "It's already probably too late, but one of the few things Democrats could do at this point to change the tide until the 2022 midterms is to adopt Medicare for All as their number-one policy. It should be a no-brainer that the impetus for universal health care is greater than ever due to this pandemic and how many hundreds of thousands of Americans died. It needed to happen yesterday.\n\nUnfortunately, virtually no Democrat changed their standing on universal health care as a result of the pandemic. It is by far the biggest thing they could push for that would stand to help the most amount of Americans. It would face immense Republican opposition every step of the way, but it would provide a reason to turn out for the Democrats that's more than just \"Republican bad so vote for me.\"",
            "title_similarity": "0.6246321",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hk40pgu",
            "score": 2,
            "text": "Wow. What a lady. She’s made one of the best decisions that idiotic Dems or Reps couldn’t make in centuries. Strong decision. She’s a superstar in my eyes",
            "title_similarity": "0.3379423",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hk40qnn",
            "score": 2,
            "text": "I’m from outside the USA. What is this umm… “Medical debt?”  \n\nIs it what makes America so free and libertyish?",
            "title_similarity": "0.3983784",
            "sentiment_compound": 0.6809
        },
        {
            "id": "hk40us1",
            "score": 1,
            "text": "I know right wing dicks are going to say this is performative but this kind of action is what we've been missing in American politics. This is an example most of our elected officials would refuse to follow because they value their own privelege over the wellbeing of our nations people.",
            "title_similarity": "0.33956188",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk40x61",
            "score": 1,
            "text": "This is great news and wouldn't likely have affected me since I'm in Florida anyway, but man, seeing this an hour after I get served a summons to appear in court over my medical bills fucking sucks lol",
            "title_similarity": "0.50042295",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk410uw",
            "score": 1,
            "text": "Good ol America, where death is almost better then a hospital visit",
            "title_similarity": "0.38255838",
            "sentiment_compound": 0.1548
        },
        {
            "id": "hk41544",
            "score": 3,
            "text": "President Stacey Abrams would be one hell of a good thing for you lot across the pond. That woman works hard to sort y’all out man",
            "title_similarity": "0.35957015",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk418qs",
            "score": 2,
            "text": "Folks of moderate-income paying the exaggerated costs of the greedy folks in the insurance industry and big pharma. Meanwhile, calling ourselves a developed country. The only development in our country has been the switch from the government having funds to help all Americans to the wealthy elite having all the money in the world or at least enough to leave it when they want to. This distortion of wealth has allowed costs to soar. Republicans keep giving breaks to the wealthy and then leave Dems to try to fix the infrastructure and social ailments caused by taking those items from government funding to be spent on business instead. This gives Reps cause to complain that Dems are spending too much, never admitting that greed caused the need for the expenses. The wealthy tell us that if we make more money it will cause inflation. I ask, when has that stopped rich folks from making money? Further, while folks defend the wealthy elite they are also paying the share of taxes the wealthy elite do not pay and have not paid since the Reagan years.",
            "title_similarity": "0.531945",
            "sentiment_compound": 0.9636
        },
        {
            "id": "hk41djl",
            "score": 3,
            "text": "This woman is amazing! Imagine if she had political support.",
            "title_similarity": "0.18125203",
            "sentiment_compound": 0.7777
        },
        {
            "id": "hk4284k",
            "score": 1,
            "text": "$212,000,000 frees 108,000 slaves. Ending slavery frees them all.",
            "title_similarity": "0.7304315",
            "sentiment_compound": -0.34
        },
        {
            "id": "hk429p5",
            "score": 1,
            "text": "She’s about to get busted and imprisoned for misappropriation. Watch, just watch. All the Republican PACs that have just found to have committed fraud, nothing happened. Her though, we’re about to see.",
            "title_similarity": "0.537513",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hk42b5e",
            "score": 1,
            "text": "And billionaire men waste money going into space for a few minutes…..Hmmm",
            "title_similarity": "0.51608753",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hk42t5k",
            "score": 1,
            "text": "Uhhh this is old news",
            "title_similarity": "0.07714366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk431ws",
            "score": 1,
            "text": "Reminder: Cheap (and often free) healthcare here -> https://www.healthcare.gov  \n\nYou won’t spend more than 15% of your income on insurance for your family and it has no limits benefits should you need it.  Good way to take care of family.\n\nIf you’re in a red state and can’t get cheap insurance due to your state opting out of the medicaid expansion, contact your legislators and vote democrat (or at least don’t vote republican)",
            "title_similarity": "0.580163",
            "sentiment_compound": 0.7198
        },
        {
            "id": "hk432lf",
            "score": 1,
            "text": "Now do student loans",
            "title_similarity": "0.16907121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk440r3",
            "score": 2,
            "text": "This woman is a legend 🙌🏻",
            "title_similarity": "0.11035016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk44h3g",
            "score": 1,
            "text": "Very nice. We have people like her working so hard while we get DC elite democrats to run against crazy Trump supporters.",
            "title_similarity": "0.3976149",
            "sentiment_compound": 0.6401
        },
        {
            "id": "hk44hgw",
            "score": 1,
            "text": "Let’s hope this woman doesn’t get a bullet instead of further commendations. Outstanding.",
            "title_similarity": "0.23184398",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hk44tvw",
            "score": 5,
            "text": "How fucking dystopian is it that healthcare needs to be crowd funded?",
            "title_similarity": "0.45434588",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk44y88",
            "score": 3,
            "text": "Imagine if we had M4A!",
            "title_similarity": "0.18478924",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk45anh",
            "score": 2,
            "text": "God damn at least someone is doing something",
            "title_similarity": "-0.18994385",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hk45d0p",
            "score": 3,
            "text": "I had a transverse myelitis episode in 2014. (I went numb from the waist down, my body was eating my spinal cord nerves.) I had no insurance. They had to keep me in the hospital for 4 nights, 5 days. I walked away (on a walker) with a 78k bill. The day I got home (I was so happy to get home) mail comes and there’s a notice from the IRS I’m being audited lol\n\nWhat a f*cking week that was.",
            "title_similarity": "0.77692926",
            "sentiment_compound": 0.5486
        },
        {
            "id": "hk45hyu",
            "score": 1,
            "text": "Imagine someone thinking this was bad or sticking up for insurance companies ... Good god people.",
            "title_similarity": "0.2708324",
            "sentiment_compound": 0.128
        },
        {
            "id": "hk45j4v",
            "score": 2,
            "text": "I have been saying for years that it’s ridiculous how much money is wasted on “campaigning” when that money could be used to help so many struggling Americans. Plus, it shows people that you actually care about helping them and changing the system. You get more votes with honey than attack ads.",
            "title_similarity": "0.50316596",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hk466b1",
            "score": 3,
            "text": "my father supported her from Germany he will be happy to see this",
            "title_similarity": "0.18194753",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hk471xl",
            "score": 2,
            "text": "I think most Americans want Universal Care.  I think our problem is that no one trusts our government to run it.\n\nThe VA (veterans administration) is an absolute sh*t show.   Look how our government handled Afghanistan, would you want that government to be in charges of your next surgery?",
            "title_similarity": "0.5288372",
            "sentiment_compound": -0.5386
        },
        {
            "id": "hk475r8",
            "score": 1,
            "text": "It's almost like she is doing far greater good for the communities than she would if elected. Politics has a habit of clipping the wings of any high-flyer.",
            "title_similarity": "0.3734392",
            "sentiment_compound": 0.7655
        },
        {
            "id": "hk47khw",
            "score": 3,
            "text": "She damn well better run for president since she’s out here being a damn mother Teresa without the negative shit.",
            "title_similarity": "0.33059883",
            "sentiment_compound": 0.6728
        },
        {
            "id": "hk47ueq",
            "score": 3,
            "text": "Help me plz. Medical bankruptcy will take me soon. I shouldn’t be worrying about that at 30.",
            "title_similarity": "0.40736872",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hk47uqg",
            "score": 1,
            "text": "Laughing",
            "title_similarity": "-0.2402512",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk47vsn",
            "score": 4,
            "text": "Strange. So many responses to this post and yet, none even mentioning Stacey Abrams. This woman is what all leaders should aspire to be. She gives me hope for the American democracy.",
            "title_similarity": "0.40640986",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk47xql",
            "score": 3,
            "text": "Democrat does something to help people:\n\nConservatives response, \"This has to be illegal.\"",
            "title_similarity": "0.2731851",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hk48tq2",
            "score": 3,
            "text": "She should have been the VP. I would support her anyday over Kamala.",
            "title_similarity": "0.13998723",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk48upa",
            "score": 4,
            "text": "It's called being a real leader, instead of the joke currently residing in the GA Governors mansion.",
            "title_similarity": "0.17024535",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk48wgc",
            "score": 2,
            "text": "Now if she could just wipe out the lock that the medical industry has on the American government that would be something. \n\nWhen [4 out of the top ten largest American companies by revenue](https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue) are companies in the health care industry, you are going to have a serious problem with the amount of political sway and money they can throw about to ensure their ability to rape Americas citizens.\n\nAmerica is fucked, because the corporations have divided the people and pitted them against one another, when they should be uniting against the source of their problem...the government who does corporate Americas bidding and the corporations who take great pleasure in running the country and it's finances with apparently no one the wiser.",
            "title_similarity": "0.67113084",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hk491qc",
            "score": 1,
            "text": "Yes, Queen!!",
            "title_similarity": "-0.022905951",
            "sentiment_compound": 0.508
        },
        {
            "id": "hk4980w",
            "score": 2,
            "text": "Hero status. Was already a fan, now a follower",
            "title_similarity": "0.04596655",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hk49aoy",
            "score": 1,
            "text": "My God a Democrat just helped someone. Astounding.",
            "title_similarity": "0.2795741",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hk49noe",
            "score": 2,
            "text": "Abrams > Harris. Democrats please listen we will lose in 2024 with Harris or Biden.",
            "title_similarity": "0.49512255",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hk49v9q",
            "score": 4,
            "text": "This is the saddest headline. They should have never been in debt.",
            "title_similarity": "0.30975205",
            "sentiment_compound": -0.4386
        },
        {
            "id": "hk4a1xe",
            "score": 1,
            "text": "See, as long as we're beholden to these philanthropic legislators we don't even need socialized medicine!",
            "title_similarity": "0.32903856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4a5ec",
            "score": 1,
            "text": "Serious question, is this a legal use of PAC money? 🤔",
            "title_similarity": "0.2241365",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hk4a6rf",
            "score": 1,
            "text": "Queen 👑",
            "title_similarity": "0.08938783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4a8be",
            "score": 1,
            "text": "now do payday loans and credit card debt",
            "title_similarity": "0.2637316",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk4aqg4",
            "score": 2,
            "text": "This woman is helping people with money she collected? My god Republicans must fucking HATE her.",
            "title_similarity": "0.4524995",
            "sentiment_compound": -0.3455
        },
        {
            "id": "hk4awca",
            "score": 2,
            "text": "If this is what PACs can be used for, I’m way more likely to donate to some of they are trustworthy compared to a lot of charities with tons of admin bloat",
            "title_similarity": "0.33555728",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hk4bspk",
            "score": 2,
            "text": "Holy Good God!",
            "title_similarity": "-0.05868238",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hk4bz0s",
            "score": 2,
            "text": "She deserves a statue. Abrams is a hero.",
            "title_similarity": "0.11574424",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hk4cjbc",
            "score": 2,
            "text": "Stacey Abrams is what Democracy looks like. A force for uplift and justice. Amazing work.",
            "title_similarity": "0.14888327",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hk4cl0j",
            "score": 2,
            "text": "THIS is how you win votes.",
            "title_similarity": "0.06931248",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk4cmwl",
            "score": 2,
            "text": "I have always argued/tried to highlight with people this very thing. What if a presidential campaign threw the (insert ridiculous number) amount of money raised to help people out. Fix up schools, fund medical clinics, help out worthy charities etc….Guarantee they would win by a landslide.",
            "title_similarity": "0.49649277",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hk4csne",
            "score": 2,
            "text": "this mensch",
            "title_similarity": "-0.00042649545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4d0vq",
            "score": 1,
            "text": "Democratic Party loves going the private route for everything. Maybe GOP voters will embrace Dems?",
            "title_similarity": "0.21634465",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hk4dcfx",
            "score": 1,
            "text": "I wish I could have my medical debt wiped out.",
            "title_similarity": "0.37531328",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hk4dhlk",
            "score": 2,
            "text": "I recognize the kindness, but this doesn’t fix the issue. If anything it helps perpetuate it. If I charge a person $100 for an item that should only be worth $10 and a person goes into debt because he needs that item, paying $90 for him is a kind gesture but it will look like people are able to pay. In the capitalist economist’s eyes $100 become a justified ask.",
            "title_similarity": "0.4613346",
            "sentiment_compound": 0.936
        },
        {
            "id": "hk4dn40",
            "score": 2,
            "text": "The health system is one of my biggest disappointments with America. They have made a business out of bankrupting people with medical issues without a care of their everyday life. They killed millions with the prescription drug chaos which led to a heroin epidemic. They charged my $32 for a Tylenol at the hospital which is what opened my eyes. But they do love to give out little jabs. $32 for a Tylenol but some things they insist you take for free. I just don't get it.",
            "title_similarity": "0.657374",
            "sentiment_compound": 0.4284
        },
        {
            "id": "hk4dtjn",
            "score": 2,
            "text": "Here you go naysayers: Democrats and Republicans are not the same. Ms Abrams and her team went out of their way to help these people. Please tell me the last time a member of the GOP did the same? Like AOC raising money for the people of Texas when they lost power and their own rep Rafael Cruz going on vacation.",
            "title_similarity": "0.6140851",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk4dydd",
            "score": 2,
            "text": "I read that as \"far right action\" instead of fair fight at first and was very confused.",
            "title_similarity": "0.19507408",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hk4e9l7",
            "score": 2,
            "text": "Is there anyway to see if you were one of the people who's debt was paid off? I owe 40,000 in Georgia from being hit by a semi truck.",
            "title_similarity": "0.634557",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk4ebc8",
            "score": 2,
            "text": "Ah yes, both sides are definitely the same right? \n\n/s",
            "title_similarity": "-0.041722275",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hk4epj6",
            "score": 2,
            "text": "well ill prolly die from mine before they reform everything",
            "title_similarity": "0.35769963",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hk4ett9",
            "score": 2,
            "text": "I never heard of a republican doing shit for anyone except their other rich friends. All y'all white republicans in Georgia take heed. See who working in your best interest. Stacey needs a award for this shit. What the fuk Gov Kemp ever done for anyone. Smt",
            "title_similarity": "0.5301622",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hk4f6u3",
            "score": 2,
            "text": "This is how Democrats win back populist types",
            "title_similarity": "0.33216253",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk4fn5c",
            "score": 1,
            "text": "That’s a lot of fucking money for fucking medical bills",
            "title_similarity": "0.4527254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4g82g",
            "score": 2,
            "text": "I love how this is turning Capitalism upon itself.  The debt is sold at a huge discount not so it can be forgiven, but so others can make profit from people's misery.  The fact that it is bought and forgiven is working the system beautifully.  I want to donate to this cause though I'm not even American",
            "title_similarity": "0.33194825",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hk4gfai",
            "score": 2,
            "text": "Jeffery Bezos could do this for the whole world and still be a billionaire.",
            "title_similarity": "0.30220246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4gjfw",
            "score": 2,
            "text": "I love Stacey Abrams.",
            "title_similarity": "-0.0062794583",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk4gtme",
            "score": 2,
            "text": "Here’s hoping she wipes the floor with Brian Kemp for the Governorship of Georgia next year.",
            "title_similarity": "0.43500966",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk4hn5i",
            "score": 1,
            "text": "waiting for a student debt PAC to swoop in and save me",
            "title_similarity": "0.37277365",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hk4hrhu",
            "score": 1,
            "text": "Every single thing in our country is designed around making a profit for the few people at the top of the structure aka pyramid, we could have wiped out poverty and illness but our system is designed to profit off of poverty, aka crime, which has been used on the poorest of our citizens!!! Illness is a big profit sucking machine, our tax dollars are given to the big pharmaceutical companies to develop drugs and then they are allowed to patent them and sell them back to the very people who financed them!!! In what world is this ok with people??? Most people do not understand what they are doing and even when we try to inform people the people say that they would never do something so wrong!!! Well it is happening and it is just the tip of the iceberg in terms of what our politicians do to us!! For instance, did you know that our cia started the crack epidemic??? Look up operation watchtower, with the help of the special forces stationed at fort devens the cia created a drug pipeline that flew into wait for it” ARKANSAS “ and from there it was funneled to every inner city and sold and the profits from the drug’s funded the Iran contra fiasco “ OLIVER NORTH “ the chief Architect of the plan!!! There are so many disgusting things that our politicians and elite people have cooked up!!! Of course I always get “ your crazy” from the people I tell, but recently people have been coming back and saying that everything I told them was 100% true!!! I don’t know why I am posting this, I just started on rant and I couldn’t stop!!! Maybe some of you that read this will actually start looking into what they are doing to all of us!!! Fingers crossed",
            "title_similarity": "0.5772759",
            "sentiment_compound": -0.9302
        },
        {
            "id": "hk4i9di",
            "score": 1,
            "text": "Did she ask for their receipts?",
            "title_similarity": "0.11033642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4ibtn",
            "score": 2,
            "text": "Wonder how many of the recipients are republican voters? They elect disgusting for representation but ride the coat tails of liberals. I think that if your representative votes against liberal ideology, then they should not reap the benefits.",
            "title_similarity": "0.42648828",
            "sentiment_compound": -0.6093
        },
        {
            "id": "hk4ifu1",
            "score": 2,
            "text": "This is amazing news!!",
            "title_similarity": "-0.047225244",
            "sentiment_compound": 0.658
        },
        {
            "id": "hk4impr",
            "score": 2,
            "text": "She’s always doing big shit! First black woman president!?",
            "title_similarity": "0.43613034",
            "sentiment_compound": -0.6351
        },
        {
            "id": "hk4j4wu",
            "score": 1,
            "text": "Now come to my neck of the woods and do student debt please",
            "title_similarity": "0.229161",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hk4k2fn",
            "score": 3,
            "text": "Medicare for All is the only long term solution",
            "title_similarity": "0.44263583",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk4kljw",
            "score": 1,
            "text": "So where did the money come from to pay the bills?",
            "title_similarity": "0.21963862",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hk4km2o",
            "score": 2,
            "text": "What a great charitable person. Kudos",
            "title_similarity": "0.009360231",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hk4kswo",
            "score": 2,
            "text": "This is a good person.",
            "title_similarity": "-0.16156064",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk4lhij",
            "score": 1,
            "text": "I say this as someone who has an enormous amount of student loan debt: I recognize the injustice of a debtor nation, but the free nation, who exploits their world for material gain, is far worse.  We need to, first and foremost, make environmental externalities reflective in the price of consumer products.",
            "title_similarity": "0.37878507",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hk4lsi0",
            "score": 1,
            "text": "Is it ‘medical debt ‘ or ‘insurance debt ?!??",
            "title_similarity": "0.35291395",
            "sentiment_compound": -0.7033
        },
        {
            "id": "hk4lz0o",
            "score": 1,
            "text": "In the mean time, many countries, include China, provide free (almost) healthcare (drugs included) to their own people.  \nLuckily, we don't need free healthcare so we could afford decades of wars with 800+ bases around the world.",
            "title_similarity": "0.6204289",
            "sentiment_compound": 0.0767
        },
        {
            "id": "hk4n3vn",
            "score": 1,
            "text": "I'd like to know how that worked. Where did the money come from, and how was this RIP Medical Debt able to send money to hospitals on behalf of patients?",
            "title_similarity": "0.51134527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4nhu4",
            "score": 1,
            "text": "To put it simply, based and georgiapilled",
            "title_similarity": "0.02952398",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4nz5y",
            "score": 1,
            "text": "This is awesome. I don't agree with much she stands for but this is incredible. The sad part is this debt was purchased at 6/10th if a cent on the dollar. Why couldn't the hospitals just charge people this rate to begin with  if everyone just stopped paying for medical care it would be a game changer.",
            "title_similarity": "0.55274534",
            "sentiment_compound": -0.6635
        },
        {
            "id": "hk4o5bx",
            "score": 1,
            "text": "Mother Teresa, eat your heart out!",
            "title_similarity": "0.22476333",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hk4o8x9",
            "score": 1,
            "text": "This woman needs to run for president",
            "title_similarity": "0.30136737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4osnx",
            "score": 1,
            "text": "Honestly, paying off the debt only is going to make the medical pricing continue. The insurance companies got what they wanted....\n\nThe PAC should have somehow got them to only pay like 50% if they paid now type o shit",
            "title_similarity": "0.5908753",
            "sentiment_compound": -0.25
        },
        {
            "id": "hk4ou22",
            "score": 1,
            "text": "I really like her. Are there any other pacs that do something wholesome and for the people with their money?",
            "title_similarity": "0.19805989",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hk4ovr5",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.052036323"
        },
        {
            "id": "hk4p8nq",
            "score": 1,
            "text": "Kinda stunning how just straight forward she is as a politician. See a problem? Call it out. Solve it. \n\nI am very impressed by her.",
            "title_similarity": "0.20874842",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hk4q3ut",
            "score": 1,
            "text": "run for president",
            "title_similarity": "0.23739693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4r3xe",
            "score": 2,
            "text": "Yah well Donald Trump's PAC wiped out legal debt for one person in 36 states!",
            "title_similarity": "0.78584266",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hk4r83p",
            "score": 1,
            "text": "That means that they now have to pay income tax on $212M.",
            "title_similarity": "0.6203763",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hk4s1et",
            "score": 2,
            "text": "Fuck it, Abrams for president. She gets good shit done.",
            "title_similarity": "0.26870066",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hk4slt9",
            "score": 1,
            "text": "Why is Stacey Abrams the greatest ?",
            "title_similarity": "0.14636001",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk4suac",
            "score": 2,
            "text": "In other news  only 108k people required to make 212 FUCKING MILLION IN DEBT.  That’s horrible.",
            "title_similarity": "0.74741733",
            "sentiment_compound": -0.8251
        },
        {
            "id": "hk4ta84",
            "score": 1,
            "text": "Saint",
            "title_similarity": "-0.15717389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4tdfx",
            "score": 1,
            "text": "Yo how is she not governor though, smh",
            "title_similarity": "0.18302456",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hk4u1i9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.013786295"
        },
        {
            "id": "hk4u1s9",
            "score": 1,
            "text": "Meanwhile, Trump PAC dollars...",
            "title_similarity": "0.29097876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4ubye",
            "score": 1,
            "text": "Cool! Now do student loans",
            "title_similarity": "0.12929337",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hk4uoht",
            "score": 1,
            "text": "And we can't even get the president to do half that.",
            "title_similarity": "0.29964277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4ux5p",
            "score": 2,
            "text": "Amen",
            "title_similarity": "-0.18614873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk4wl4n",
            "score": 2,
            "text": "This is amazing and so sad at the same time. A PAC comes to the rescue?!",
            "title_similarity": "0.22528909",
            "sentiment_compound": 0.6122
        },
        {
            "id": "hk4wve7",
            "score": 1,
            "text": "Wow wow wow!!!",
            "title_similarity": "-0.17081301",
            "sentiment_compound": 0.9228
        },
        {
            "id": "hk4x0ks",
            "score": 1,
            "text": "Paying of Medical debt for people sounds nice but it helps to perpetuate a very bad system by making it more profitable.  It is something like buying the freedom of slaves in Africa.  A well meaning act that may make things easier for some people but may make the system worse for others.  I think it would have served the cause better to help those folks discharge those debts in bankruptcy.  Medical providers really like to be paid but they don’t really care who pays it.  The patient, Insurance Companies, government programs or charities, it all works for them.  If we want medical providers to get behind Medicaid Expansion, hit them in the pocketbook, where it counts.",
            "title_similarity": "0.35573566",
            "sentiment_compound": 0.9886
        },
        {
            "id": "hk4x5oj",
            "score": 1,
            "text": "I’m curious as to how the IRS will view this.",
            "title_similarity": "0.17282844",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hk4zzs5",
            "score": 1,
            "text": "Debt cannot be\"wiped out\",capital can be misalocated.",
            "title_similarity": "0.19718905",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hk50grp",
            "score": 2,
            "text": "It's sad that Americans are so fearful of medical debt they don't even get help.  Bless her and her colleagues  for this.  This saved peoples lives.  Americans should be ashamed of this so called health care system.",
            "title_similarity": "0.49883023",
            "sentiment_compound": -0.6768
        },
        {
            "id": "hk50ok5",
            "score": 1,
            "text": "We are but a country of debt bonded, ship wrecked passengers.",
            "title_similarity": "0.472373",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hk50ten",
            "score": 2,
            "text": "Ya, but Trump used his non profit to purchase a portrait of himself.\n\nRule 34B, if a good deed exists, there exists a comparable act of something bad by Trump..",
            "title_similarity": "0.4002546",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hk515o8",
            "score": 1,
            "text": "Great job. Every state should have such a group to embarrass politicians and corporations every year.",
            "title_similarity": "0.5190943",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk51i0d",
            "score": 1,
            "text": "I think it's amazing she was able to do this, but it makes me sick that we have to, in essence, erase people's medical debt through an elected GoFund Me.",
            "title_similarity": "0.4114233",
            "sentiment_compound": -0.743
        },
        {
            "id": "hk5250d",
            "score": 1,
            "text": "Stacey Abrams for President 2024!",
            "title_similarity": "0.39867097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk52n5s",
            "score": 1,
            "text": "Jesus, that much money for that little amount of people… that’s when you know this system is fucked",
            "title_similarity": "0.37187335",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hk535x7",
            "score": 1,
            "text": "My God she is a force! Respect.",
            "title_similarity": "-0.10581975",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hk54d4a",
            "score": 1,
            "text": "Pretty good day for insurance companies.",
            "title_similarity": "0.122993246",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hk5588i",
            "score": 1,
            "text": "Any system where you don’t get to decide what treatment is necessary and who to get it from is broken.",
            "title_similarity": "0.2768507",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk55gvn",
            "score": 1,
            "text": "This shouldn’t have to be a thing. Fuck America",
            "title_similarity": "0.06899406",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk56u3s",
            "score": 1,
            "text": "everyone over at r/anarcho_capitalism must be absolutely FUMING and their blood vessels about to burst over this.",
            "title_similarity": "0.2989188",
            "sentiment_compound": -0.6933
        },
        {
            "id": "hk56y2a",
            "score": 1,
            "text": "She and Katey need to run for Prez and VP.",
            "title_similarity": "0.1663729",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk57b28",
            "score": 1,
            "text": "Wow! Go Stacy!",
            "title_similarity": "-0.050853044",
            "sentiment_compound": 0.658
        },
        {
            "id": "hk57cav",
            "score": 1,
            "text": "Maybe we shouldn't depend on nice politicians to give us things? Maybe we should demand them",
            "title_similarity": "0.09883973",
            "sentiment_compound": -0.4276
        },
        {
            "id": "hk58a84",
            "score": 1,
            "text": "Damn 5 states 108k with a debt of 212million....I honestly true wonder the whole world of medicine and finance why is it beyond $$$ for such little thinga",
            "title_similarity": "0.8156796",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hk58gmn",
            "score": 1,
            "text": "Damn I love Stacey Abrams. 💜🚫💉",
            "title_similarity": "0.05796193",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hk58rpk",
            "score": 1,
            "text": "The first good post I’ve ever seen in this subreddit",
            "title_similarity": "0.1731017",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk59b1d",
            "score": 1,
            "text": "What's that in percentages?",
            "title_similarity": "0.03748958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5ar6y",
            "score": 1,
            "text": "Even tho she left me, I hope my Exes mother gets this relief as it’s going to be passed into her when she passes. It be a real blessing for them but ya know how life works",
            "title_similarity": "0.30597597",
            "sentiment_compound": 0.6556
        },
        {
            "id": "hk5bgcw",
            "score": 2,
            "text": "That is awesome",
            "title_similarity": "-0.20206428",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hk5c84f",
            "score": 2,
            "text": "She is a badass",
            "title_similarity": "0.04413595",
            "sentiment_compound": 0.34
        },
        {
            "id": "hk5c9qy",
            "score": 1,
            "text": "Fantastic. Yet at the same time paying this money is like paying ransom to a kidnapper. Very few of these charges on these people’s bills are legitimate and therefore the companies claiming them do not really have a right to them.\n\nHow long do Americans have to negotiate with terrorists and pay unreasonable ransoms for basic services?",
            "title_similarity": "0.42625597",
            "sentiment_compound": -0.128
        },
        {
            "id": "hk5cgk1",
            "score": 2,
            "text": "Why aren't bezos and musk doing this type of thing???",
            "title_similarity": "0.14192945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5cov5",
            "score": 3,
            "text": "Wow and what did her Republican opponent who stole the governorship do? Il wait",
            "title_similarity": "0.3995688",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk5d14c",
            "score": 2,
            "text": "American “healthcare “ is a gift to the insurance and drug industries … a colossal scam defended by people who call the British and Canadian systems “Communism” because most Americans are too dumb to distinguish between social services and Communism. \nAs a result the scam will continue… \nThe British system is brilliant… not perfect but brilliant \nThe American “system” is a scam … a flat-out scam.\nGet sick and find out for yourself … don’t get too sick though because medical bankruptcy is waiting round the corner just for you.",
            "title_similarity": "0.5272341",
            "sentiment_compound": -0.9849
        },
        {
            "id": "hk5di5j",
            "score": 1,
            "text": "I keep hearing about her wiping debt out and yet they keep calling me for this 9$ bill. Conspiracy? I think so!",
            "title_similarity": "0.48708278",
            "sentiment_compound": -0.7345
        },
        {
            "id": "hk5djmg",
            "score": 3,
            "text": "AOC and Abrams/2024",
            "title_similarity": "0.14768311",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5dpkp",
            "score": 3,
            "text": "This lady should be President",
            "title_similarity": "0.18365309",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5e3nc",
            "score": 1,
            "text": "This doesn't fix anything. Hey, here's that money you made from price gouging, good job.",
            "title_similarity": "0.23485394",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk5ffpu",
            "score": 1,
            "text": "Stacey Abrams PAC pays $212 million ransom to price gouging hospitals. So that the lives of 108,000 aren't ruined",
            "title_similarity": "0.7958021",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hk5gbj0",
            "score": 1,
            "text": "The U.S. need something that provides for affordable care but is short of socialized medicine.\n\nThe current state of U.S. medical care is that both sides are involved in a massive \"money grab\" between insurance companies, Big Pharma and corporate medical systems with the patient stuck in the middle.\n\nWant to know how this is true? For about the past 20 years, when you call a doctor, what is the first question that you are asked? It's ***ALWAYS,*** \"Do you have insurance?\"\n\nAt some point about five minutes later, someone will ask about your medical situation.",
            "title_similarity": "0.7368513",
            "sentiment_compound": 0.8621
        },
        {
            "id": "hk5grmj",
            "score": 4,
            "text": "why don't Americans elect people like this? instead you keep electing old senile men who do nothing but fragment your nation even further. I really don't understand the stupidity of American politics",
            "title_similarity": "0.41591948",
            "sentiment_compound": 0.5939
        },
        {
            "id": "hk5hh36",
            "score": 1,
            "text": "Good For You ‼️",
            "title_similarity": "-0.11582968",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk5huox",
            "score": 2,
            "text": "This is a small pocket of hope, but the entire country needs this.",
            "title_similarity": "0.15677252",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hk5l7y4",
            "score": 2,
            "text": "The us has experts but you can still wait 6+ hrs at ER when your pcp has called into one of Boston’s finest hospitals\nAnd it’s a 4-6 no wait to see specific specialties here",
            "title_similarity": "0.5716168",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hk5ly9b",
            "score": 3,
            "text": "THIS should be at the top of the news. Let’s find a way to help others.",
            "title_similarity": "0.075161785",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hk5nh0g",
            "score": 3,
            "text": "Yes. Outstanding. Thank-you Stacy Abrams for your work for the common person. Here is another fact the same people who are uninsured, suffer catastrophic medical treatment and billing, and crushing medical debt collections practices, up to and including default Judgments for non-payment, judgment liens against their property, family home, etc., are absolutely brain washed by Evangelicals to never, ever, ever, consider personal bankruptcy. Hideous.",
            "title_similarity": "0.5711627",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hk5nilz",
            "score": 2,
            "text": "Fwiw I have the USA version of socialized medicine in Medicare as well as a supplemental insurance \nI still pay out the wazoo\nLarge city w “excellent teaching hospitals “ and abhorrent Rx costs\nMy pcp knows I mail order my meds from Canada cause it’s cheaper than using good Rx or my Rx Medicare plan that I pay for monthly \nAnd he just suggested I get a glucose sensor in f to travel to another country(I won’t be able to be seen there but he’s at least aware what a clusterf the USA costs are\n\nA couple years back while in Finland woke up with worst dehydration due to food poisoning I’d ever had\nFortunately hotel staff was ace-they called ambulance that took me to local hospital ER which kept me there until the wee hours of the night, doing all the appropriate tests, imaging and labs\nEven gave me a printout of labs to show dr\nFwiw they apologized that I’d have a bill because I wasn’t from EU\nWhen I got home I think ambulance bill and ER day was approximately $200 total \n\nVersus -in the US many years ago I fell and couldn’t move due to concussion-ambulance was called (I had too line USA insurance) ambulance drove less than a mile-my “copay” for ambulance was $1k(a friend said I could’ve walked to the hospital  if my leg wasn’t already broken)\nFwiw the particular ER stitched my head wrong and my scalp later needed plastic surgery \nJust don’t ever underestimate the costs of health care here",
            "title_similarity": "0.57300925",
            "sentiment_compound": -0.9161
        },
        {
            "id": "hk5no6t",
            "score": 1,
            "text": "Finally some goddamn praxis",
            "title_similarity": "0.11621028",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk5q05s",
            "score": 1,
            "text": "How do they pick them?",
            "title_similarity": "-0.13182026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5rnwn",
            "score": 2,
            "text": "Stacy Abrams for President 2024!",
            "title_similarity": "0.408355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5sw0m",
            "score": 2,
            "text": "Stacy abrams is a jewel we don’t deserve.",
            "title_similarity": "0.13590628",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk5te87",
            "score": 2,
            "text": "So I’m curious if I was apart of this. I had a medical debt sent to a collection agency and just several weeks ago it was taken off my credit report. Very odd. It was only like $1k.",
            "title_similarity": "0.7822386",
            "sentiment_compound": 0.3788
        },
        {
            "id": "hk5tjdk",
            "score": 1,
            "text": "Staci is wonderful.",
            "title_similarity": "-0.07778012",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hk5vvfw",
            "score": 1,
            "text": "What people, how are they selected? Am I one?",
            "title_similarity": "-0.039711762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk5wpok",
            "score": 1,
            "text": "Well, good on her!",
            "title_similarity": "-0.13054053",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hk5yxt4",
            "score": 2,
            "text": "If they don't restructure the system this will mean nothing.",
            "title_similarity": "0.15782577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk61tms",
            "score": 2,
            "text": "This woman is a national treasure.",
            "title_similarity": "0.13526209",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk66nrl",
            "score": 1,
            "text": "Our total medical debt is 81 billion…. It’s like the 30m tons of trash removal mr beast is doing.. but there’s 5.25 trillion pieces of plastic in the ocean…. Like what’s the point? Am I a realist or pessimist? Sure it helps but if it’s not a total solution then it’s not a solution in my book.",
            "title_similarity": "0.716457",
            "sentiment_compound": 0.3312
        },
        {
            "id": "hk67hul",
            "score": 3,
            "text": "She can't do that! That's not how this works! She has to send it through the proper shell corporations before being able to put it in the offshore account for her new yacht. When will these do-gooders learn?",
            "title_similarity": "0.40964133",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk68uru",
            "score": 1,
            "text": "How to get re-elected: a guide",
            "title_similarity": "0.17113416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk68yst",
            "score": 3,
            "text": "I find it interesting that they were able to wipe the debt for less than a penny on the dollar. Which tells you that this debt is made up by the providers and has zero relation to actual costs",
            "title_similarity": "0.4284215",
            "sentiment_compound": -0.397
        },
        {
            "id": "hk6bnay",
            "score": 3,
            "text": "Stacey has done so many great things by NOT becoming the governor of Georgia. I hope she wins next year, but it may have been a blessing that she didn’t in 2018",
            "title_similarity": "0.43297267",
            "sentiment_compound": 0.8831
        },
        {
            "id": "hk6fnsn",
            "score": 3,
            "text": "God. Part of me thinks its fucking criminal that this women isnt a governor. Yet she continues to build and help people all over the country. I admire her so much",
            "title_similarity": "0.36066955",
            "sentiment_compound": 0.4951
        },
        {
            "id": "hk6jvpy",
            "score": 1,
            "text": "Wtf is medical debt? /s",
            "title_similarity": "0.40368545",
            "sentiment_compound": -0.743
        },
        {
            "id": "hk6ys0p",
            "score": 1,
            "text": "I'd like to see a group of republicans do that.",
            "title_similarity": "0.12639508",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk7ap5k",
            "score": 6,
            "text": "So just to make the point crystal clear…repubs out here making videos of murdering dems, burning books, threatening to murder civil servants and well, anyone that disagrees with them, blocking everything, like all the damn things, breaking laws, nominating trash, lying every time they breathe, etc etc…and Dems out here passing infrastructure legislation, vaccinating our population, fighting for childcare, healthcare, investing in our planet, and of course Stacey helping get people out of debt because of our broken medical system….\n\nWhat the absolute fuck am i missing? I still cannot believe the state of play in our country these days.",
            "title_similarity": "0.48092026",
            "sentiment_compound": -0.9818
        },
        {
            "id": "hk7l2il",
            "score": 1,
            "text": "She ate it",
            "title_similarity": "0.016211316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk7oqth",
            "score": 1,
            "text": "This is what a real working government does, not spending all of its time and energy licking its moronic leaders' b\\_tth\\_le and making its elected officials and donors richer.",
            "title_similarity": "0.32019442",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hk7zigf",
            "score": 1,
            "text": "Queen!!!!",
            "title_similarity": "0.020099266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hka7ax5",
            "score": 2,
            "text": "That’s just incredible.",
            "title_similarity": "-0.14970914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkb13ed",
            "score": 1,
            "text": "How were the people picked? Whose medical debt was wiped out?",
            "title_similarity": "0.5838343",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hkdfm3x",
            "score": 1,
            "text": "While it seems a nice jesters, remember it wasn't her money, it was contributions to her pac. Also, hopefully, there were some white folks helped in this, as well.",
            "title_similarity": "0.30578244",
            "sentiment_compound": 0.765
        },
        {
            "id": "hkdg244",
            "score": 1,
            "text": "Not her money and what about diversity?",
            "title_similarity": "0.13978943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkgv06q",
            "score": 1,
            "text": "I’m from ga, checked, still have hospital bills",
            "title_similarity": "0.4339015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkit72c",
            "score": 1,
            "text": "What a smile!",
            "title_similarity": "-0.20401457",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hlb0zmn",
            "score": 1,
            "text": "My question is, has she paid her own bad debt that she had when she got defeated in the GA governors race? I understand she defaulted on a lot of credit card debt, I’m pretty sure the was some back taxes and maybe some student loan debt too. Regardless she was running for president with unpaid bills. Water seeks it own level, so I suppose her supporters approve of such behavior!",
            "title_similarity": "0.6040957",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hlcn3lw",
            "score": 1,
            "text": "Stacey Abrams is a fucking angel",
            "title_similarity": "0.13770247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hldw5ht",
            "score": 1,
            "text": "Except not really. This debt is sold down the line for pennys on the dollar.\n\nIt may have started as $212 million, but they likely bought it for a few million dollars.",
            "title_similarity": "0.6507849",
            "sentiment_compound": -0.2758
        },
        {
            "id": "hlrssi4",
            "score": 1,
            "text": "I suspect this had nothing to do with medical bills and everything to do with politics. Political donors put the money in the PAC for political use. After all, it’s a POLITICAL Action Committee. If a political party just paid off your bills, how would your vote?  \n\nI’ve been in over my head on medical bills, and can imagine the relief of having them disappear, but is seems slimy when political money is the savior.",
            "title_similarity": "0.54364467",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hm4uxt3",
            "score": 1,
            "text": "Now THAT is a Super PAC!",
            "title_similarity": "0.08376501",
            "sentiment_compound": 0.636
        },
        {
            "id": "hm7q4te",
            "score": 1,
            "text": "So where did the money come from to wipe away the debt tho? \n\n(didn’t read the article.)",
            "title_similarity": "0.39466405",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hm9zizr",
            "score": 1,
            "text": "Fake news. There's no way that fat pig has done anything good to benefit people",
            "title_similarity": "0.31854445",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hmakago",
            "score": 2,
            "text": "I lean more right and I must say, met the lady and she is terrific!",
            "title_similarity": "0.08208853",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hmbly1h",
            "score": 1,
            "text": "Far better use of money than giving it to politicians to begin with. Why don’t every democrat politicians do this with their campaign fund?",
            "title_similarity": "0.46892244",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hmemh3r",
            "score": 1,
            "text": "So an average of almost $2k per person? \n\nNot that it’s a bad thing but saying “wiped out” is pretty hyperbolic. We all know medical debt runs numbers far higher than that",
            "title_similarity": "0.6508556",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hmhrgsi",
            "score": 1,
            "text": "That just puts into perspective how literally a FRACTION of the U.S. defense budget can support and change so many lives.",
            "title_similarity": "0.47377133",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmietu2",
            "score": 1,
            "text": "Only thing she’s wiping out is the whole table on thanksgiving day. There’s no left overs at the Abrams house.",
            "title_similarity": "0.5826844",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmkbq3n",
            "score": 1,
            "text": "I’m confused, did she found the organization that did what the headline said or the organization that donated under 2 million? The headline and the content of the article seem at odds with each other",
            "title_similarity": "0.5368268",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmmehms",
            "score": 1,
            "text": "Why is a vaccine free and being mandated, but not life saving medicine?. Because it's not about saving lives.",
            "title_similarity": "0.26455343",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hmmsw9b",
            "score": 1,
            "text": "Just another way for Democrats to buy votes.  And it only cost them 1.34 million of other people's money.  With all the money spent during campaigns this is cheap.  Probably should violate campaign laws.  I guess its better than alcohol and cigarettes!",
            "title_similarity": "0.47571474",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hmpuqjg",
            "score": 1,
            "text": "a Democrat politician doing something nice for American citizens??   Say What.  How",
            "title_similarity": "0.29231536",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hmrh2lh",
            "score": 1,
            "text": "And this is why I will forever have love and RESPECT for this black queen 💕💯❤️",
            "title_similarity": "0.07672833",
            "sentiment_compound": 0.9236
        },
        {
            "id": "hmvaw40",
            "score": 1,
            "text": "Cheapest votes ever bought!  I guess it beats providing alcohol and cigarettes.  PAC = Other People's Money!",
            "title_similarity": "0.39246058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmwce09",
            "score": 1,
            "text": "This country I tell you, I love it and I am grateful for a crapton of things we have here that other countries don't but by God the health system here is so fucked up that it is almost comical, I traveled a lot and lived in many places, some of which were poor countries yet they had better health system than here, it doesn't even make sense, this is why we need money out of politics, as long as it continues then these politicians are going to prioritize their donors over their constituents.",
            "title_similarity": "0.43541288",
            "sentiment_compound": -0.8336
        },
        {
            "id": "hmwkbe2",
            "score": 1,
            "text": "She's not even president and she's doing a better job at being president than Biden.",
            "title_similarity": "0.4214181",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hmxeb0e",
            "score": 1,
            "text": "I want to know if she paid black peoples bills or all colors.   Will someone please talk about it?",
            "title_similarity": "0.342101",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmz79tw",
            "score": 1,
            "text": "Saint",
            "title_similarity": "-0.15717389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hn0cpgc",
            "score": 1,
            "text": "They prolly paid alot less for it, because the hospitals sell those accounts to collections for dirt cheap and then collectors come after you trying to get the full amount. I think Steven Colbert for his show bought like millions worth once for like 10 grand just so he could say \" rat your heart out Ellen and Oprah, I gave the biggest give away in talk show history!\" Lol",
            "title_similarity": "0.6539777",
            "sentiment_compound": 0.9299
        },
        {
            "id": "hn1yn6z",
            "score": 1,
            "text": "This is disgusting. We need to fix the system not feed it. This approach drives mediocricy and fosters wastefulness. Will someone wipe out my medical expenses please?",
            "title_similarity": "0.3122696",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hn2vqb9",
            "score": 1,
            "text": "Just got our bill for our newborn total bill was around $18,000. After insurance we owe $3,500. Of that $3500, $1300 is for the anesthesiologist, guy was in the room for 10 minutes lol holy balls",
            "title_similarity": "0.81823325",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hn38p0n",
            "score": 1,
            "text": "Let me guess, only black people are eligible.",
            "title_similarity": "0.22008133",
            "sentiment_compound": 0.0
        },
        {
            "id": "hn5kjom",
            "score": 1,
            "text": "Hmm isn t bribery illegal ?",
            "title_similarity": "0.07060088",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hn5uhsh",
            "score": 1,
            "text": "Paying off a 202 million dollar debt with 1.2 million. Lol okay",
            "title_similarity": "0.64619255",
            "sentiment_compound": 0.296
        },
        {
            "id": "hncm15o",
            "score": 1,
            "text": "Stacey Abrams has my vote for president whenever she’s ready. She’s a real live Leslie Knope",
            "title_similarity": "0.3853392",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hneiocp",
            "score": 1,
            "text": "As a person on the right, I have to say Kodos to her. I might not agree with her on her politically but that is a pretty damn good job imo.",
            "title_similarity": "0.1326897",
            "sentiment_compound": 0.6181
        },
        {
            "id": "hni9hmc",
            "score": 1,
            "text": "But the Democrats told me private charity doesn’t work 🤔",
            "title_similarity": "0.34277183",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hnkr5ix",
            "score": 1,
            "text": "I like her",
            "title_similarity": "-0.1364855",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hnkytr4",
            "score": 1,
            "text": "In australia we have medicare. You pay an annual insurance levy equivalent to 3%of your taxable income. \nI presented at an emergency department with chest pain. I already knew my heart rate was often only 30BPM. I was assessed and fairly quickly admitted to a cardiac ward in a private room with private facilities. I was then assessed  over the next four days. Ecosounding of my heart, MRI and angiogram as well as 24/7 12 point monitoring. Bradycardia. My BPM occasionally fell to 18BPM and I was intravenously given a synthetic adrenalin to bump me up to a cracking 45/50BPM. \nOn the 5th day a pacemaker was installed on my pectoral muscle. Discharged on day 6. Follow up checks after 30 days and 90 days there after yearly. Device good for 16 years. \nTotal cost to me.\nNil\nI am not a campaigner for rights of any kind. But I am glad this system in Australia exists. I believe this is a minimum standard everyone should be able to expect from their government.",
            "title_similarity": "0.7462774",
            "sentiment_compound": 0.8735
        },
        {
            "id": "hnm3ato",
            "score": 1,
            "text": "Barf!!!!",
            "title_similarity": "-0.026368063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnn14x8",
            "score": 1,
            "text": "I'm pretty sure that's \" buying votes\" and illegal.",
            "title_similarity": "0.26093757",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hnnbtxl",
            "score": 1,
            "text": "Signs and wonders",
            "title_similarity": "-0.16027689",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnpzeky",
            "score": 1,
            "text": "So she’s paying for votes with money that she never worked for 😂 got it",
            "title_similarity": "0.46991175",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hnrplta",
            "score": 1,
            "text": "https://www.npr.org/sections/health-shots/2021/12/07/1061940326/the-nih-director-on-why-americans-arent-getting-healthier-despite-medical-advanc\n\nI read some of this the other day and had to stop myself from rolling my eyes.\nThe man has been in the position long enough, he's educated, well spoken but he's like the rest of them when it comes to ignoring the 800 gorilla in the room that's inches away from backhanding them to God.\n\nThe reason why people aren't healthier in America is the cost burden our for profit Healthcare system places on families and individuals.\nPeople ration medication because it's too costly.\nPeople skip going to the ER because it's too costly.\nPeople refuse Ambulances because it's too costly.\nPeople skip routine doctor visits because it's costly and usually leads to being prescribed an expensive medication or equally expensive testing or, God forbid, they try and send you to a specialist where it costs you $250.00 just to get in the door.\n\nEverywhere else on earth provides Healthcare to people at much lower costs than what we here in the US get raped for every single day.\nYou want a truly shocking revelation?\nLook up exactly how much money is made off of us for cancer treatment each year.\nThen do yourself a favor and look up which of our politicians benefit financially from our Healthcare system as it stands.\nWhy cure anything when prolonging a disease is far more lucrative in the long term?\nHospitals using software to upcode medical procedures that are usually considered standard to being emergencies just so they can char 2,500 to 10,000 more than what they would normally change.\nOur entire Healthcare system is designed to do nothing but be a financial drain on our lives, as if we didn't already have a big enough financial burden with cost of living and taxes.\n\nAs far as I'm concerned, Ms. Abrams has done more for the people of this country than ALL of the other crybaby, money grubbing politicians in Washington because she actually did something instead of like her colleagues who want to sit in chambers arguing with each other or streaming insta stories because they're bored and feel sucking up on social media for attention.\n\nWhile the rest of Washington, President included, is busy shamelessly whoring itself before the media and its respective sycophants, Ms. Abrams is busy making life better for citizens.\n\nMs. Abrams has my utmost respect and she is the only politician I have said that about🙏🙌🙌🙌🙌",
            "title_similarity": "0.5630674",
            "sentiment_compound": -0.8948
        },
        {
            "id": "hnsw3sd",
            "score": 1,
            "text": "I had a physical therapy office take a copay and then never ask for another one then send me a 600 dollar bill. I was under the assumption they were all covered under an umbrella, like a surgery or something because it was all one injury. I blew disc's in my neck, back and had a massive shoulder injury.  Constant pain and dizziness for months.  In a sling the entire summer.   They also did an MRI and didn't ask for copay and then on my second mri appointment they told me it was 200 dollars and I walked out.  That's when they told me about the copays too.  I now realize that it's my responsibility to know copays, but I'd never NOT been told I owed a copay before.  I still owe them and never got the other MRI I need.  😬",
            "title_similarity": "0.76765054",
            "sentiment_compound": -0.743
        },
        {
            "id": "hntygtk",
            "score": 1,
            "text": "They always say \"how would we pay for Medi-Care for all?\" We already do, just to the wrong people. 🤬",
            "title_similarity": "0.34247234",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hnu6t7y",
            "score": 1,
            "text": "propaganda machine",
            "title_similarity": "-0.1111556",
            "sentiment_compound": -0.25
        },
        {
            "id": "hnuixhy",
            "score": 1,
            "text": "*National Treasure Stacy Abrams",
            "title_similarity": "0.2309108",
            "sentiment_compound": 0.296
        },
        {
            "id": "hnvgsgj",
            "score": 1,
            "text": "Amazing that she’s done so much more to advance in the public interest for people than Kemp and the other governors have done in office. She needs to win!",
            "title_similarity": "0.33004737",
            "sentiment_compound": 0.8977
        },
        {
            "id": "hnz3ma4",
            "score": 1,
            "text": "Money laundering.",
            "title_similarity": "0.17562887",
            "sentiment_compound": 0.0
        },
        {
            "id": "ho0n4xl",
            "score": 1,
            "text": "Once the medical bill comes, request to be sent a detailed bill instead that has all the charges broken down. You will be surprised how many data entry billing mistakes are made such as multiple charges for the same thing. Dispute all questionable billings and charges",
            "title_similarity": "0.4993893",
            "sentiment_compound": -0.9169
        },
        {
            "id": "ho2aybm",
            "score": 1,
            "text": "I thought she only accepted small donations from regular folk. Remember the pledge to not take large donations from corporations? Y’all been bamboozled!",
            "title_similarity": "0.44542494",
            "sentiment_compound": -0.1759
        }
    ]
}