{
    "Sen. Jon Ossoff set to introduce bill barring members of Congress from trading individual stocks: report\n": [
        {
            "id": "hrz0f3g",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.5303052",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hrzgk0f",
            "score": -1,
            "text": "Lmao, like this will ever see its way into a committee, much less out of one.  The SEC could make this moot by examining every trade by elected officials and family members.",
            "title_similarity": "0.59124947",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hs08kvy",
            "score": 1,
            "text": "This will be struck down by Nancy Pelosi immediately. The amount of money her and her husband have made during her political career is criminal. It’s comical the people of California continue to elect her",
            "title_similarity": "0.5397239",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hrz0q7f",
            "score": 18,
            "text": "So ridiculous, it's already illegal to use insider knowledge to make trades. Is the SEC asleep?",
            "title_similarity": "0.6021223",
            "sentiment_compound": -0.7501
        },
        {
            "id": "hrzw5nf",
            "score": 0,
            "text": "Pelosi is a hack. Get her the fuck out of here.",
            "title_similarity": "0.35818803",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs09ouf",
            "score": 0,
            "text": "Too bad Pelosi’ll block it.",
            "title_similarity": "0.4157847",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hs0a6hy",
            "score": 0,
            "text": "So now they will get some custodian to trade on their behalf right after they whisper sweet insider nothings in there hench/men/woman’s ear",
            "title_similarity": "0.4259745",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs1ats8",
            "score": 0,
            "text": "Doesnt matter. Won’t pass. The leader of his party is the single most corrupt politician we have. It’s a joke how people fall for these charades",
            "title_similarity": "0.4883949",
            "sentiment_compound": 0.5894
        },
        {
            "id": "hs23ru0",
            "score": 0,
            "text": "We should also tax those existing holdings to 99% of their value. Basically they lose it. As a republican, I have wanted this for years, because I have always hated pieces of shit like pelosi and feinstein",
            "title_similarity": "0.49646693",
            "sentiment_compound": -0.765
        },
        {
            "id": "hrz5xmr",
            "score": 5,
            "text": "Republicans:  “why do you think I came all this way?”",
            "title_similarity": "0.44903424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrz1fkl",
            "score": 11,
            "text": "I’m sure the bill will be riddled with loopholes so it’s essentially meaningless",
            "title_similarity": "0.37906045",
            "sentiment_compound": -0.2177
        },
        {
            "id": "hrznmbk",
            "score": 1,
            "text": "REPUBLICANS: Tell me why this is either bad or why your politicians are not on board?",
            "title_similarity": "0.6085814",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hrzmhf3",
            "score": -10,
            "text": "I'm a progressive, but I don't see what's wrong with Members of Congress trading individual stocks as long as they are fully disclosed to the public.  With full disclosure, the voters in their district or state will have all the information they need to judge for themselves.  Congressional salary really isn't enough to pay for cost of living in the average home district and Washington, D.C. combined.  You've got to allow them to make honest money elsewhere.  Blatant opportunism will be identified by voters and judged accordingly.",
            "title_similarity": "0.67886966",
            "sentiment_compound": 0.9037
        },
        {
            "id": "hrzl7fa",
            "score": 3,
            "text": "Good luck with that",
            "title_similarity": "-0.1374762",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hrzfzl5",
            "score": 0,
            "text": "I'd like a blanket ban. Like just cut and dry and straight-forward and broadly applicable as possible. Make it easy for us to catch loopholes and make Congress' intent clear to judges, that we might hold enforcement accountable.",
            "title_similarity": "0.5298981",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hrzg17n",
            "score": 0,
            "text": "Could this be done at the state level, putting this type of constraint on a states federal reps/senators?  I'd much rather have it at the federal level, but something better than nothing.",
            "title_similarity": "0.5940227",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hrzi9a3",
            "score": 4,
            "text": "Good.\n\nGet every vote on the record so we know who needs to be primaried.",
            "title_similarity": "0.179871",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrzm07i",
            "score": 0,
            "text": "Good for him.  The corrupt crone will probably punish him by taking away committee assignments.",
            "title_similarity": "0.44425055",
            "sentiment_compound": -0.128
        },
        {
            "id": "hs031ev",
            "score": 0,
            "text": "The filibuster will be eliminated before this does. And I don’t believe the filibuster is going anywhere.",
            "title_similarity": "0.45931748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs23nu8",
            "score": 0,
            "text": "Hope business insider is also banned from trading in that bill…i.e. Henry Blodget 🙄",
            "title_similarity": "0.680078",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hs2vkcr",
            "score": 0,
            "text": "“It’s fine.  Stocks are for retail.  We’re in exotic derivatives that short the economy and jeopardize the livelihoods of millions, but it’s all proprietary and AH and offshore, so retail will never know.” — Nancy, probably.",
            "title_similarity": "0.59774745",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hsues9d",
            "score": 0,
            "text": "I am far from ossoffs base, but do strongly support this bill if this is real news.",
            "title_similarity": "0.41442275",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hrzka2t",
            "score": 47,
            "text": "The backlash against Biden over his student loan campaig  lie, frustrations with the failure to push voting rights, and now a dyed in the wool centrist like Ossoff taming up a stock purchasing ban.  The progressive wing of the democratic party is finally taking things over and the young centrists are being forced to finally recognize it.  And they need to.  If they don't embrace progressive policies the midterms will be a blue blood bath.",
            "title_similarity": "0.6026716",
            "sentiment_compound": -0.8645
        },
        {
            "id": "hrz42t6",
            "score": 14,
            "text": "This dude is going to wind up vanishing from the face of the earth if he keeps this up! This must add insult to injury to his predecessor though, David Perdue. Purdue was a scumbag republican who, when Jon Ossoff called him out on getting busted in an insider trading scam, started running attack adds about gun control and illegal immigrants voting. This must really chap Perdue’s ass, the very guy who defeated him is introducing this sort of legislation. If it passes, the democrats should call it “The Perdue Act”, or something.\n\nEdit* autocorrect is a menace",
            "title_similarity": "0.6488781",
            "sentiment_compound": -0.9869
        },
        {
            "id": "hrzg9di",
            "score": 1,
            "text": "annnnd it's dead.",
            "title_similarity": "0.15448746",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hrzji0i",
            "score": 1,
            "text": "Does it stop their spouses?",
            "title_similarity": "0.36896157",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrzllxy",
            "score": 1,
            "text": "it will fail. Rulers won’t allow that.",
            "title_similarity": "0.3438015",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hrzw6mr",
            "score": -1,
            "text": " Nancy will veto it",
            "title_similarity": "0.35939404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzxgjl",
            "score": 1,
            "text": "This is how we get the boomers out of congress. They’ll just resign 😂",
            "title_similarity": "0.58205235",
            "sentiment_compound": 0.128
        },
        {
            "id": "hrzz6u0",
            "score": -1,
            "text": "This should be coupled with an increase in senator’s salaries. If pay isn’t increased, only people who can already afford be politicians will run for office.",
            "title_similarity": "0.4754022",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs09e7m",
            "score": 1,
            "text": "Dude is about to be found dead with 2 gunshots to the back of the head\n\nEdit: ruled a suicide",
            "title_similarity": "0.35459477",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hs09nkr",
            "score": 1,
            "text": "Be good to see who votes against this",
            "title_similarity": "0.25750083",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0eqbc",
            "score": -1,
            "text": "Jon Ossoff 2024",
            "title_similarity": "0.2438299",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1367d",
            "score": -1,
            "text": "Sounds like ill thought out grandstanding, and is probably unconstitutional, but hey it's a nice thought.",
            "title_similarity": "0.20429027",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hs1bgji",
            "score": 1,
            "text": "I find it incomprehensible senators and congressman can buy individual stocks. Granted every politician have the right to invest, but it should be in a broad index fund or T bond.",
            "title_similarity": "0.7178805",
            "sentiment_compound": 0.128
        },
        {
            "id": "hs1fmvt",
            "score": -1,
            "text": "Can anybody tell me why Senators trading stocks is wrong",
            "title_similarity": "0.6735194",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hs1jion",
            "score": 1,
            "text": "It will never happen because elected officials never represent the people who elect them.",
            "title_similarity": "0.43101192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1vblr",
            "score": 1,
            "text": "This is something that could help get more honest people into positions of power",
            "title_similarity": "0.18460914",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hs25rtu",
            "score": -1,
            "text": "How bout a bill outlawing ballot harvesting and drop boxes financed by Zuck the cuck who is f\\*cked?😒",
            "title_similarity": "0.76970184",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hrz5tdi",
            "score": 207,
            "text": "This **should** be popular on both sides. It won't be, but it should be. Wanna know why Republicans might hate the idea?\n\nBecause it doesn't only detriment any of the Democrat lawmakers and instead detriments all of them together.\n\n(edit: **this line is throwing people.** All I meant was Republican voters were damn near unified completely for the 2020 election. Props to the 70+mil real votes. That's legit. But not one time in the 2 years since covid did I see a single supporter get pissed off when Trump literally diverted PPE in the early stages of Covid **away** from blue states. There are Republican voters I know personally that **were laughing when they read that**. This is what I mean. They actively cheered hurting only blue states. Republican voters in this very subreddit were actively defending the actions, too). I just don't know if I can trust Republican voter intent ever again. I gave it a debate chance (never a voting chance) and it still failed me.\n\nRemember this famous doozy? ***\"He isn't hurting the right people\". Case in point.***\n\nBut, that's exactly why it *should* be popular because it's **literally** *only* going to effect people who are currently already powerful and any future members of said powerful entity. Not 1 every-day person (no matter what side you are on) will feel any effect of this.\n\nThe problem itself is a very very unethical one and an extremely advantageous one. They have the power to craft, pass, etc. laws of any kind. Those laws can have a direct impact on the very stocks they are allowed to buy/sell.\n\nThat entire concept is at odds with itself.\n\nWhich means this ***should*** be something **everyone** would want to team up to tackle.\n\nEdit: If I did not clarify, what I mean is: voters on both sides should easily get behind a law that prohibits members in office from buying and selling stock. As, the only ones it will effect are going to be literally just the people in office. Which will piss off both sides **in** office.\n\nNot out of it.\n\nAnd that Republican voters these days seem to only want to vote for anything that hurts Democrats, but not them.",
            "title_similarity": "0.5423843",
            "sentiment_compound": 0.9282
        },
        {
            "id": "hrzgeip",
            "score": 2,
            "text": "There's really no chance of this ever passing.",
            "title_similarity": "0.19030374",
            "sentiment_compound": -0.1841
        },
        {
            "id": "hrzhdnc",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.15579048"
        },
        {
            "id": "hrzj6pp",
            "score": 2,
            "text": "Good, this is what the Democratic Party should fight for and look like. Get that decrepit parasitic lizard Pelosi out of the leadership role she wormed her way into and held onto far past her usefulness.",
            "title_similarity": "0.48808217",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hrzk98v",
            "score": 2,
            "text": "Really - this is just click bait - all flash no substance.   He doesn't have a single Republican in the Senate who will back this and it will not get to the floor of the Senate, let alone the House\n\n>So far, no Senate Republicans have publicly voiced opposition against stock trading among members",
            "title_similarity": "0.5799627",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hrzkua0",
            "score": 2,
            "text": "I love this. Now anyone who votes against it, vote them out.",
            "title_similarity": "0.25905025",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hrzphpw",
            "score": -2,
            "text": "0xd17da839Fd00d9e7001d8489Be471Ee2A2CE0c6f",
            "title_similarity": "0.18229297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzprue",
            "score": 2,
            "text": "The US will finally see full bipartisan support against a bill.",
            "title_similarity": "0.470317",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzt2y1",
            "score": 2,
            "text": "My friend who works at one of the big four accounting firms as a regular accountant has a long list of stocks he cannot trade just because some of his thousands of colleagues whom he never met happens to have working relationships with these companies. \n\nMeanwhile members at the highest level of policy making get to make millions and it's supposedly unfair to bar them from the chance.",
            "title_similarity": "0.51649415",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hrzuo37",
            "score": 2,
            "text": "Everyone that votes no on this needs to be audited by the IRS and investigated for insider trading.\n\nAlas it won’t pass and nothing will happen to those that kill it.",
            "title_similarity": "0.6181694",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hrzxhra",
            "score": 2,
            "text": "This is outrageous, how can we expect senators to survive on only $174,000 a year salary, plus lobbyist bribes and their inherited family business???  Do you know how many days a year they have to work, its a big double digits.",
            "title_similarity": "0.5452689",
            "sentiment_compound": -0.5484
        },
        {
            "id": "hs096zd",
            "score": 2,
            "text": "This is why I want Ossof to run for president",
            "title_similarity": "0.50038075",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hs0c10c",
            "score": 2,
            "text": "alternative headline: “Senator demonstrates that Virtue Signaling is a great tool to get positive press from desired demographic”",
            "title_similarity": "0.299728",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hs0nxp3",
            "score": 2,
            "text": "All U.S Politicians should be barred from trading stock and should be paid minimum wage. There would be fewer people running for office in this country (and that might be a good thing after all).",
            "title_similarity": "0.6257485",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrz6ntp",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.15579048"
        },
        {
            "id": "hrz71tz",
            "score": 3,
            "text": "I don’t see this passing. It’s symbolic at best.",
            "title_similarity": "0.25609344",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hrzhc3f",
            "score": 3,
            "text": "Good luck with that, buddy.   \n\n\nGetting those who profit from it to vote for it is gonna be a tough one.",
            "title_similarity": "0.36310706",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hrzmki5",
            "score": 4,
            "text": "Probably won’t pass but at least he’s started a conversation.  I wonder if he’s angling for something 🤔",
            "title_similarity": "0.2467457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs14phg",
            "score": 3,
            "text": "Don't forget, this is a bill essentially banning insider trading. Many members of Congress really should go to prison for that. Ask Martha Stewart.",
            "title_similarity": "0.6861359",
            "sentiment_compound": -0.3887
        },
        {
            "id": "hs1zwij",
            "score": -3,
            "text": "I guarantee Biden, Harris, pelosi and co. Did not see this coming when they rigged the Georgia elections",
            "title_similarity": "0.60055315",
            "sentiment_compound": -0.128
        },
        {
            "id": "hrzs2e1",
            "score": 15,
            "text": "And nothing will come of this...\n\n\"iT wIlL gEt ThEiR vOtE oN rEcOrD.\"\n\nNo one cares. The average (read: majority) voters don't go into someone's record. They see the little D or R and vote based on that. \n\nYou all got some false hopes if you think this is going to change anything. I highly doubt it will even hit the floor. People in power do not want to give up any of their power.",
            "title_similarity": "0.50544155",
            "sentiment_compound": -0.5987
        },
        {
            "id": "hrze2kf",
            "score": 4,
            "text": "That shit is DOA with the assholes in congress",
            "title_similarity": "0.48069412",
            "sentiment_compound": -0.9087
        },
        {
            "id": "hs06pmj",
            "score": 3,
            "text": "If the Democrats truly believe the future of American democracy is at stake in the coming elections, supporting bills like this would be the best thing they could do to save the country.\n\nThis is wildly popular among the majority of the country.",
            "title_similarity": "0.38211",
            "sentiment_compound": 0.9552
        },
        {
            "id": "hs15kky",
            "score": 3,
            "text": "Nancy Pelosi will not let this be voted on in The House, she's the worst offender",
            "title_similarity": "0.45077312",
            "sentiment_compound": -0.765
        },
        {
            "id": "hrz3vus",
            "score": 15,
            "text": "I do not see how any Republican voter could be against this. If Republicans and Democrats both unite and pressure our representatives, Congress will become more effective.",
            "title_similarity": "0.53685474",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hrzkjpb",
            "score": 33,
            "text": "Pelosi: 😡",
            "title_similarity": "0.1168517",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs049pd",
            "score": 5,
            "text": "Very simple. NOBODY working in any level of politics should be allowed to own or trade stocks, or own any sort of business.\n\nIf you want to get into politics, you do so to SERVE THE PEOPLE. Not make a buck. You sell EVERYTHING that you've got investments in. BEFORE you're allowed to take office.\n\nAlso remove all bribes (or lobbying as they call it) from politics.\n\nIf serving the people for a base salary isn't enough for you, you don't deserve to be in office.",
            "title_similarity": "0.6516281",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzi7dz",
            "score": 15,
            "text": "Love this, such a no brainer. At the least, they should have to publicly declare any trades immediately and wait 90 days to execute.",
            "title_similarity": "0.44833738",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hrzcoz4",
            "score": -6,
            "text": "... is it just me or is this madness? \n\nWho the fuck will vote for a pay cut for themselves? Because that’s what this is asking for...",
            "title_similarity": "0.5185095",
            "sentiment_compound": -0.8669
        },
        {
            "id": "hrzknn3",
            "score": 7,
            "text": "Finally a non-partisan bill both sides can say no to!",
            "title_similarity": "0.49765652",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hrzerx6",
            "score": 7,
            "text": "I hope it passes. But I’m not sure there’s enough honest representatives to get it through",
            "title_similarity": "0.20230746",
            "sentiment_compound": 0.6068
        },
        {
            "id": "hs01t1q",
            "score": 10,
            "text": "Proud of him and AOC representing what millennials do when they have power.",
            "title_similarity": "0.106514186",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrzhx7z",
            "score": 31,
            "text": "This definitely needs to be a law with a SUBSTANTIAL penalty.  It should also include the spouse of the members of congress.",
            "title_similarity": "0.47154558",
            "sentiment_compound": 0.3034
        },
        {
            "id": "hrzjs7o",
            "score": 15,
            "text": "Fuck any politician who gets rich off the back of Americans in such a shady and shitty way.",
            "title_similarity": "0.5258444",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hrzkx13",
            "score": 19,
            "text": "Genuine question: HOW is this not a foregone conclusion?! Members of Congress are privy to sensitive information that isn’t yet public knowledge. We observed several senators dumping stock when they learned about the impending pandemic and its assumed effects on the stock market way before it was public knowledge.. how is this NOT “insider trading”?\n\nLike… this level of corruption is SO brazen and they’re not even pretending to cover it up anymore… what’s to be done at this point (if anything) that isn’t gallows-based?\n\nEdit: spelling/grammar mistakes",
            "title_similarity": "0.701955",
            "sentiment_compound": -0.7121
        },
        {
            "id": "hrzt269",
            "score": 27,
            "text": "[deleted]",
            "title_similarity": "0.15579048"
        },
        {
            "id": "hrz5vw2",
            "score": 165,
            "text": "Write it, present it, and get the votes on record.",
            "title_similarity": "0.25042248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzbxzy",
            "score": 564,
            "text": "This should be a nationwide referendum. We cannot depend on these people to take money out of their own pockets",
            "title_similarity": "0.65761006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrz2wq1",
            "score": 801,
            "text": "This is a great idea! Hopefully it will help to reduce the corruption that is so rampant in Washington.",
            "title_similarity": "0.3157041",
            "sentiment_compound": 0.8687
        },
        {
            "id": "hrz1jsg",
            "score": 164,
            "text": "Seems reasonable, I’ll be interested in the details.",
            "title_similarity": "-0.022931915",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrz673d",
            "score": 2613,
            "text": "I still find it fucking hilarious that we let congress make the rules for congress.",
            "title_similarity": "0.4454684",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hrzhw0i",
            "score": 320,
            "text": "Yes!!!\n\nHis bill closes the spousal loophole. Now, what's the punishment for trading stocks while in Congress? If it's a measly $10K fine, that's just the cost of doing business. It can be nothing short of the entirety of their market returns being taxed in addition to the year's congressional salary being stripped.",
            "title_similarity": "0.6500796",
            "sentiment_compound": 0.2905
        },
        {
            "id": "hrzgutq",
            "score": 99,
            "text": "Even if it doesn’t pass, still gotta fight the fight.",
            "title_similarity": "0.17665915",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hrz0kzz",
            "score": 4136,
            "text": "Proud of my home state senator!",
            "title_similarity": "0.23705415",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hrzgc21",
            "score": 3046,
            "text": "Everyone get ready for most of congress to publicly admit they do not care at all about the concept of conflict of interests.",
            "title_similarity": "0.52038264",
            "sentiment_compound": 0.0956
        },
        {
            "id": "hrz5wze",
            "score": 2,
            "text": "Would they still be able to buy index funds? Or just individual stocks?",
            "title_similarity": "0.4730185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrz9rmq",
            "score": 6,
            "text": "Good",
            "title_similarity": "-0.17711349",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrzfag5",
            "score": 45,
            "text": "Congress, under pressure from their constituents, after continuously taking advantage of insider trading law exceptions to enrich its members, made insider trading by its members illegal in 2012 (this was known as the STOCK act, bill S.2038) The mechanism to enforce this was public access to the records of the members of congress.\n\nThen, the 113th congress quietly passed bill S.716.ES into law (how quietly? Unanimously, no debate, no recorded vote, total voting time: 14 seconds), which eliminated public access to the relevant records of the president, vice president, any member of congress, and any candidate for congress.\n\nNaturally, members of congress are in the perfect position to know about many advances and changes with regard to corporate value fluctuations. They make the laws that cause many of those value fluctuations, and then of course there are the lobbyists.\n\nIf I had access to this information for several years, as do congress members, I’m sure my net worth and that of my family members would be quite different from what it is now too.",
            "title_similarity": "0.78388256",
            "sentiment_compound": 0.7641
        },
        {
            "id": "hrzgzkg",
            "score": 3,
            "text": "This man, finally someone is doing something right…",
            "title_similarity": "-0.032888107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrziisn",
            "score": 2,
            "text": "I wonder if members of congress will vote to limit members of congress from doing stuff that members of congress want to do to make members of congress more money.... hmmm",
            "title_similarity": "0.71629405",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrzirfh",
            "score": 1,
            "text": "LOL that isn't going to pass.",
            "title_similarity": "0.1519764",
            "sentiment_compound": 0.5473
        },
        {
            "id": "hrzitme",
            "score": 1,
            "text": "Yes 🙏",
            "title_similarity": "-0.109335035",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzjax3",
            "score": 1,
            "text": "Good on him. He's got both parties looking to kill that one!",
            "title_similarity": "0.26920295",
            "sentiment_compound": -0.1007
        },
        {
            "id": "hrzjls3",
            "score": 1,
            "text": "This guy! Let’s keep an eye on this guy. Something tells me he has a clue.",
            "title_similarity": "0.13563904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzjmw1",
            "score": 1,
            "text": "When is Ossoff going to be ready for the presidency?",
            "title_similarity": "0.50787556",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrzk9w3",
            "score": 1,
            "text": "I’d like to see what the argument for why this SHOULDNT be passed? Anyone have anything?",
            "title_similarity": "0.37667024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzkgkb",
            "score": 1,
            "text": "Atleast someone who got elected is serving the people.",
            "title_similarity": "0.31871083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzkt36",
            "score": 1,
            "text": "free market meet rules and regulations🤝",
            "title_similarity": "0.14589988",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hrzku02",
            "score": 1,
            "text": "What're the odds this gets over 10 votes in favor? \n\nI'm gonna have to go with slim to none.",
            "title_similarity": "0.38071683",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzl0kb",
            "score": 1,
            "text": "He’s basically introducing a big pay cut for most politicians.",
            "title_similarity": "0.51252",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hrzl6ir",
            "score": 1,
            "text": "Give this man an AWARD!  But regardless, it wont pass - Congress are a bunch of paid corporate hacks reaping all the rewards while shitting on us... regardless of party - they are all crooks.",
            "title_similarity": "0.5105766",
            "sentiment_compound": 0.785
        },
        {
            "id": "hrzlxnz",
            "score": 1,
            "text": "Finally a US politician I can respect",
            "title_similarity": "0.17857109",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrzlzcc",
            "score": 3,
            "text": "Queen Pelosi is against it, it won't make it through the house.",
            "title_similarity": "0.5556184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzm57o",
            "score": 2,
            "text": "Nice. Suck it Pelosi",
            "title_similarity": "0.05707088",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hrzm6iw",
            "score": 1,
            "text": "This is the way.",
            "title_similarity": "-0.04098091",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzm83c",
            "score": 1,
            "text": "I’ll take “Bills that will never be passed” for $500 Alex",
            "title_similarity": "0.51927376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzmb2c",
            "score": 1,
            "text": "Nice knowing you, John Ossoff",
            "title_similarity": "-0.04068093",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrzmcyw",
            "score": 1,
            "text": "As much as I would love to see a bill to become law I’m afraid this guy is shoveling shit against the tide. Our government is too far gone.",
            "title_similarity": "0.6490035",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hrzmgn7",
            "score": 1,
            "text": "Lovely. Too bad wet noodle Chuck won’t let this happen.",
            "title_similarity": "0.31395206",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrzml7q",
            "score": 1,
            "text": "Unless this also includes their families I don't care",
            "title_similarity": "0.21512993",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hrzmldk",
            "score": 1,
            "text": "Long overdue. Next let's do some campaign finance reform and corporate lobbying.",
            "title_similarity": "0.6359702",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrzmq9f",
            "score": 1,
            "text": "And now a Congressional fund will be created exclusive to them.  \nNo individual stock fine.  But that fund gonna be changing daily.",
            "title_similarity": "0.5348134",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hrzmvvi",
            "score": 1,
            "text": "Him and Warnock are what Democrats should be",
            "title_similarity": "0.27891922",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzmxq4",
            "score": 1,
            "text": "Go a step further and zero-base everyone’s gains. Make ‘em flat, which is being plenty generous. Let’s see how quickly insider trading stops within Congress.",
            "title_similarity": "0.62953115",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hrzn12g",
            "score": 1,
            "text": "Sadly won't *ever* pass from both sides of the aisle but glad this is becoming a more accept topic to fight for and discuss.",
            "title_similarity": "0.26984864",
            "sentiment_compound": 0.5483
        },
        {
            "id": "hrzn7ci",
            "score": 1,
            "text": "This is great but what’s to stop congressmen family members trading stocks for them? How are you going to regulate Nancy Pelosi’s husband, etc",
            "title_similarity": "0.72955453",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hrzn8rm",
            "score": 1,
            "text": "I support!!",
            "title_similarity": "-0.11089222",
            "sentiment_compound": 0.508
        },
        {
            "id": "hrznbn6",
            "score": 1,
            "text": "No Talk. DO!",
            "title_similarity": "0.16898966",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hrznd6n",
            "score": 1,
            "text": "I love it.  But good luck getting it through the Senate.",
            "title_similarity": "0.28673512",
            "sentiment_compound": 0.8873
        },
        {
            "id": "hrzne4j",
            "score": 1,
            "text": "As with many other bills aimed to protect the average citizen, this will NEVER pass. I'm sorry, but its just as delusional as them forgiving student loans, while being bribed, pardon sponsored by banks.",
            "title_similarity": "0.5970552",
            "sentiment_compound": 0.8276
        },
        {
            "id": "hrznjfh",
            "score": 1,
            "text": "The hero we need",
            "title_similarity": "0.07824215",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hrznrud",
            "score": 1,
            "text": "Well you know insider training and all…",
            "title_similarity": "0.1632778",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hrzns1h",
            "score": 2,
            "text": "Totally agree with this. Most of the time I’m on board with Nancy but strongly disagree with her on this issue. Let’s do this and we’ll get a better country!",
            "title_similarity": "0.24770795",
            "sentiment_compound": 0.6472
        },
        {
            "id": "hrznuls",
            "score": 1,
            "text": "So what will they be able to invest in? I want to put some money into that as I'm sure the wealthy will make it explode in value.",
            "title_similarity": "0.40169248",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hrznzqb",
            "score": 2,
            "text": "This is one of like 3 things every American left or right will get behind. We all know we are getting screwed over by this.",
            "title_similarity": "0.34519207",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hrzo4j1",
            "score": 1,
            "text": "Ossoff didn’t kill himself",
            "title_similarity": "0.1281748",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hrzo4zo",
            "score": 1,
            "text": "this wont ever make it to the floor of the house. The speaker can block any legislation from being voted on and the speaker also controls whether amendments to bills can be introduced. Pelosi supports and profits the most from congress trading stock and has not allowed amendments to a bill to be introduced on the floor for years now. The only way this could ever make it to the floor of the house against the speakers wishes is if it is snuck into an appropriations bill that originates in committee and must be passed",
            "title_similarity": "0.7130815",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrzo8w2",
            "score": 1,
            "text": "Please Bar family member’s and friends also.",
            "title_similarity": "0.1458483",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hrzo94x",
            "score": 1,
            "text": "If this passes that would be awesome, it probably won’t make it to the floor though…",
            "title_similarity": "0.20533311",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hrzobph",
            "score": 1,
            "text": "Just sneak it into another vital bill, they do it all the time.",
            "title_similarity": "0.23686111",
            "sentiment_compound": 0.296
        },
        {
            "id": "hrzoeb6",
            "score": 1,
            "text": "My vote specifically allowed him to win. no need to thank me! I did it out of the kindness of my heart",
            "title_similarity": "0.21594515",
            "sentiment_compound": 0.9117
        },
        {
            "id": "hrzofc2",
            "score": 1,
            "text": "The bill doesn't seem to have a name yet, but here's where you can find your senator to tell them you support banning stock trading by politicians and their families.\nhttps://www.senate.gov/senators/",
            "title_similarity": "0.79678476",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hrzoqk4",
            "score": 1,
            "text": "This will be the most bipartisan bill since the Patriot Act.",
            "title_similarity": "0.26765224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzotru",
            "score": 1,
            "text": "Expect this to get pidgeonholed in committee or killed in some other way that doesn't require members take a public vote on it.\n  \nIt couldn't possibly get to the floor.",
            "title_similarity": "0.6448178",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hrzp0o0",
            "score": 1,
            "text": "Cool! There’s going to be 37 ways around it still.",
            "title_similarity": "0.11252703",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hrzp1rt",
            "score": 1,
            "text": "Do it",
            "title_similarity": "-0.05654411",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzp4pv",
            "score": 2,
            "text": "I honestly don't ming if they are able to trade stocks through a blind trust or an index fund or something like that, a lot of Americans do that to build wealth incrementally. However, the fact that they can go to a meeting where an expert tells them, for example, \"war is coming\" and they respond by telling the public everything is alright, while buying stock in arms manufacturers is complete bullshit.",
            "title_similarity": "0.68174696",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hrzp5ey",
            "score": 5,
            "text": "LOL. Whats the point?\n\nThey can literally do it behind a LLC or some other firm or even tip their relatives.",
            "title_similarity": "0.43835023",
            "sentiment_compound": 0.5473
        },
        {
            "id": "hrzp7jf",
            "score": 1,
            "text": "Yeah like that is going to happen",
            "title_similarity": "-0.03164576",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hrzp99w",
            "score": 1,
            "text": "Honestly this is likely a no go, but it may be a good move to show off pushing for it to win his next election in the purple state of georgia.",
            "title_similarity": "0.4131019",
            "sentiment_compound": 0.8873
        },
        {
            "id": "hrzpav9",
            "score": 1,
            "text": "This will be fastest a bill has ever died in congress.",
            "title_similarity": "0.35308802",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hrzpbd4",
            "score": 1,
            "text": "Sounds like a plan to me, there’s gotta be someone from the clown show that is the GOP, that’s on board with this.",
            "title_similarity": "0.28833032",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrzpbrl",
            "score": 1,
            "text": "It’s crazy how Republican senators got so much shit for dumping stocks before the COVID shutdowns, like it didn’t implicate every other senator of knowing pertinent financial info. But now that the heats on everybody, nobody wants to do anything. Thanks Ossoff!",
            "title_similarity": "0.637005",
            "sentiment_compound": 0.2739
        },
        {
            "id": "hrzpcwk",
            "score": 1,
            "text": "Limited only to index funds.  If they get the economy as a whole better then they get rewarded",
            "title_similarity": "0.21027361",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hrzpdnu",
            "score": 1,
            "text": "Fuck you Nancy Pelosi! Go rot in your wine cellar.",
            "title_similarity": "0.36324027",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hrzpec3",
            "score": 1,
            "text": "Ossoff 2024!",
            "title_similarity": "0.2103579",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzpgsu",
            "score": 1,
            "text": "This is one of the acid tests for American democracy. Will the members of congress think about themselves or vote for what should have already been banned. They definitely have crucial information that should be considered insider trading.",
            "title_similarity": "0.6630732",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrzpm5w",
            "score": 1,
            "text": "What about their spouses?",
            "title_similarity": "0.2304754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzpnhj",
            "score": 1,
            "text": "Ever notice that the media covers when certain politicians (on R and L) put forth bills, but rarely let the people know what happened to them. Our legislature is all symbolic gestures, tribalism, and zero follow through, hence our crumbling infrastructure and compounding societal issues.   \n\n\nThe political class isn't going to be able to kick the can much longer.",
            "title_similarity": "0.6277134",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hrzpp6y",
            "score": 1,
            "text": "Awesome, but it’s going to get struck down immediately.",
            "title_similarity": "0.15386143",
            "sentiment_compound": 0.0129
        },
        {
            "id": "hrzpppb",
            "score": 1,
            "text": "Sen. John Ossoff mysteriously dies",
            "title_similarity": "0.3574916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzprcz",
            "score": 1,
            "text": "It's a great idea but the old school power mongers will overrule him.  They'll come up with a cute excuse why it won't happen.",
            "title_similarity": "0.44246912",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hrzpvg6",
            "score": 1,
            "text": "In New Zealand members of Parliament can put one bill each in to a biscuit tin. They are shuffled up and some are selected each year to go to first reading for a vote. Some major legislation has come to  pass this way.",
            "title_similarity": "0.5209257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzpzyp",
            "score": 1,
            "text": "How will it ever get through the Senate? Manchin won't vote for that, let alone the self-identifying Republicans.",
            "title_similarity": "0.70316887",
            "sentiment_compound": -0.25
        },
        {
            "id": "hrzq086",
            "score": 1,
            "text": "If this passes there will be a whole bunch of resignations.",
            "title_similarity": "0.29848173",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrzq0i5",
            "score": 1,
            "text": "Oh man I hope it passes but I can’t see how it would. The scumbag pelosi will make sure of that",
            "title_similarity": "0.35330778",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hrzq10b",
            "score": 1,
            "text": "Not the time for Dems to waste capital on non systematic half measures.",
            "title_similarity": "0.47452122",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hrzq3fx",
            "score": 1,
            "text": "Get it.",
            "title_similarity": "-0.05895906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzq423",
            "score": 1,
            "text": "Voted on by members of Congress. CSPAN prediction for this one Jon? “Denied”",
            "title_similarity": "0.7189589",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzq9e8",
            "score": 1,
            "text": "\"Never gone get there, but its a nice dream. Its a nice dream\"",
            "title_similarity": "0.10203989",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hrzqa29",
            "score": 1,
            "text": "Nice I think this is awesome if it can gain some support which I’m not sure it will",
            "title_similarity": "0.02815228",
            "sentiment_compound": 0.9009
        },
        {
            "id": "hrzqah2",
            "score": 1,
            "text": "Now watch Congress hem and haw and preform mental gymnastics as to why they should be allowed to trade stocks while making laws that affect how stocks preform.",
            "title_similarity": "0.7542774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzqahp",
            "score": 1,
            "text": "It'll be great to see scumbag Manchin and Sinema kill this too.",
            "title_similarity": "0.26402715",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hrzqcsy",
            "score": 1,
            "text": "Thinking this is only going to ire the republicans shows how disillusioned people have become due to media. \n\n90% of media coverage is how corrupt conservatives are and every democratic is given air time about how evil the Repubs are.\n\nThis is going to piss off both sides equally. Both sides are guilty of insider trading. Every single politician who has been reelected has left a millionaire due to trading and bribes.",
            "title_similarity": "0.47798908",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hrzqg01",
            "score": 1,
            "text": "Can't wait to see the GOP's excuse to not vote for it",
            "title_similarity": "0.5169599",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrzqg3e",
            "score": 1,
            "text": "The onions on this guy. Love to see it. It won’t pass but that just gives us a checklist of who has to go when they’re up for election next.",
            "title_similarity": "0.45166427",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hrzqhei",
            "score": 1,
            "text": "And that’s where it will remain. An introductory bill",
            "title_similarity": "0.18646982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzqi9y",
            "score": 1,
            "text": "Will never happen",
            "title_similarity": "0.20304081",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzqkxd",
            "score": 1,
            "text": "Let’s go!",
            "title_similarity": "0.17255005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzqlva",
            "score": 1,
            "text": "Ok, so their spouses will.",
            "title_similarity": "0.1267427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzqui4",
            "score": 1,
            "text": "But how will I follow Pelosi trades?",
            "title_similarity": "0.40205342",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzqw2s",
            "score": 1,
            "text": "The people commiting crimes and insider trading are not going to pass legislation the regulate...  themselves. This kind of BS is exactly how we got into this mess. Criminals obviously can't help themselves.",
            "title_similarity": "0.5553735",
            "sentiment_compound": -0.8331
        },
        {
            "id": "hrzqwn3",
            "score": 1,
            "text": "This is going to get no traction in Congress",
            "title_similarity": "0.45439118",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrzqxl8",
            "score": 1,
            "text": "if they want to participate in the free market I'm 100% fine with that. But  there should be a 24 hour delay for any purchase or sale",
            "title_similarity": "0.43868148",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hrzqzd7",
            "score": 3,
            "text": "Can we get bipartisan support on this?",
            "title_similarity": "0.36779138",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzr4ut",
            "score": 1,
            "text": "Then they will. Just do it via trusts or family members.",
            "title_similarity": "0.2572571",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrzr9xi",
            "score": 1,
            "text": "Put them on the record",
            "title_similarity": "0.13241582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzrf0a",
            "score": 1,
            "text": "Pelosi will make sure this doesn’t pass.",
            "title_similarity": "0.37428975",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrzrhmp",
            "score": 1,
            "text": "This is really the wrong approach.  There is no reason to ban them from trading.  Just make them (and their family) file a trading plan for any individual stock, like a CEO does for their own stock.  You can even be nice and let them file it just one day in advance.  As long as the filing is made publicly such that any retail investor could make the same trade ahead of them.\n\nThen, if they really truly believe in a company and want to go long on it, they can, and other people bumping the price won't matter.  But it will make it unprofitable for them to engage in any sort of insider trading, because they would basically be leaking the information by filing their trading plan.",
            "title_similarity": "0.6030365",
            "sentiment_compound": 0.4349
        },
        {
            "id": "hrzrii4",
            "score": 1,
            "text": "Gotta keep their spouses from doing it too. Otherwise Nancy will do the same thing she does now - just write “husband did it”. I think this bill addresses that tho",
            "title_similarity": "0.5596274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzrnw3",
            "score": 1,
            "text": "Meh. You need the stock market to accumulate wealth. Otherwise you’ll bleed from inflation. Check out what 50,000 equivalent was in 1960. So if they can’t buy stock what can they do? Buy properties? They’re all probably pretty well off so the point might be mute, but if I’m looking to build a future I need to be able to invest.",
            "title_similarity": "0.56758386",
            "sentiment_compound": 0.6072
        },
        {
            "id": "hrzrpwt",
            "score": 1,
            "text": "I'm sure it'll be DOA but good on him nonetheless.",
            "title_similarity": "-0.009334335",
            "sentiment_compound": 0.4558
        },
        {
            "id": "hrzrtwd",
            "score": 1,
            "text": "Maybe if he calls it The Anti-Pelosi Bill he can trick Republicans into supporting it.",
            "title_similarity": "0.6276417",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzryjf",
            "score": 1,
            "text": "We could propose and enact reams of anti-corruption laws. Without enforcement, it is a meaningless grab for attention. \n\nAnd, thats where we are with all American politicians. They’re either upvote farmers or shitposters.",
            "title_similarity": "0.648593",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hrzs37d",
            "score": 1,
            "text": "Thank fucking God. Why haven't we done that a long time ago?",
            "title_similarity": "0.2644822",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hrzs5j2",
            "score": 1,
            "text": "One small step towards rooting out the corruption in Washington but a promising story for sure!",
            "title_similarity": "0.43769535",
            "sentiment_compound": 0.7777
        },
        {
            "id": "hrzseg5",
            "score": 1,
            "text": "Is there even a chance it will pass though? Don’t get me wrong, I WANT this to happen. Badly. But I’m just worried this bill is going to be quickly shot down.",
            "title_similarity": "0.40317217",
            "sentiment_compound": -0.5972
        },
        {
            "id": "hrzsexx",
            "score": 1,
            "text": "Over 76% of Americans agree with Ossoff\n\nEven when considering party lines, the difference was negligible. It was like 78% dem voters and 75% repub voters.\n\nAn overwhelming amount, regardless of political affiliation.",
            "title_similarity": "0.31538448",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hrzsfrq",
            "score": 1,
            "text": "Very cool that we allow our politicians to make the laws regarding how corrupt they're allowed to be. Extremely good democracy with super normal politics.",
            "title_similarity": "0.46459743",
            "sentiment_compound": 0.8906
        },
        {
            "id": "hrzsic5",
            "score": 1,
            "text": "Im gonna say its a good thing but it will hit the market in the nads",
            "title_similarity": "0.22366148",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hrzsj2u",
            "score": 1,
            "text": "What they need to do is pass a bill banning lobbyists",
            "title_similarity": "0.73026395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzsjek",
            "score": 1,
            "text": "Empty gesture. It will never in a million years pass.",
            "title_similarity": "0.26458883",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hrzsjeu",
            "score": 2,
            "text": "This bill will go nowhere.  Filibuster must be changed/eliminated, voting rights must be guaranteed, Supreme Court must be the-balanced.  Nothing else really matters beyond that right now because failure to do so means the great American experiment is done.",
            "title_similarity": "0.5669687",
            "sentiment_compound": 0.6567
        },
        {
            "id": "hrzsmg1",
            "score": 1,
            "text": "About time He got back to being a national name after all the national backing leading to his election.",
            "title_similarity": "0.35145697",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hrzsuy8",
            "score": 1,
            "text": "Extremely based and surprised that it wasn’t already illegal.",
            "title_similarity": "0.1797676",
            "sentiment_compound": -0.3477
        },
        {
            "id": "hrzszpx",
            "score": 1,
            "text": "Lawmakers should be legally bound to adhere to a higher level of ethical standards to ensure they are in office to serve the people and not themselves. There’s one of two reasons you stay in government for decades, you value public service or you value power. Those two cannot coexist.",
            "title_similarity": "0.51028645",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hrzt0p3",
            "score": 1,
            "text": "Yay, go Jon.!",
            "title_similarity": "0.11295165",
            "sentiment_compound": 0.5707
        },
        {
            "id": "hrzt0y1",
            "score": 1,
            "text": "Does anyone have a link to the bill? I want to actually read it, make sure it has teeth, and make sure it doesn’t have some creative definition of “individual stocks”.\n\nEdit: Is it this? Introduced in March by someone else? https://www.congress.gov/bill/117th-congress/house-bill/1579/related-bills?r=62&s=1",
            "title_similarity": "0.7164028",
            "sentiment_compound": 0.8299
        },
        {
            "id": "hrzt0y7",
            "score": 1,
            "text": "Anyone voting against this deserves to lose their seat.",
            "title_similarity": "0.36781275",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hrzt12x",
            "score": 1,
            "text": "Surely the majority will vote in favor of passing it /s",
            "title_similarity": "0.27818555",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hrzt2qr",
            "score": 1,
            "text": "But then how will those poor politicians make any money? \n/s",
            "title_similarity": "0.47542247",
            "sentiment_compound": -0.631
        },
        {
            "id": "hrzt2wy",
            "score": 2,
            "text": "This should be common sense. Sad to see that it isn’t. Thank you Ossoff for doing this though.",
            "title_similarity": "0.13902944",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hrzt2ym",
            "score": 1,
            "text": "LMFAO for real?  Oh sweet jesus fucking christ.  This bill is going to be kill so fucking quick.  Everyone know's that every member of Congress can be bought in one way or another.  To the highest to the lowest one.  Hell Lex Luthor said it  best : Pay a men enough and he will walk bare foot true hell.",
            "title_similarity": "0.5748707",
            "sentiment_compound": -0.5672
        },
        {
            "id": "hrzt35m",
            "score": 1,
            "text": "This will tell us a lot. Mid term elections may hinge on this in some places. Because of that,  I'm sure it will never see daylight.",
            "title_similarity": "0.5223566",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrzt7ew",
            "score": 1,
            "text": "Thank you…. Wish it would pass but at least you’re putting the scumbags on blast",
            "title_similarity": "0.23675784",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hrzteaf",
            "score": 1,
            "text": "We have a better chance of finding a leprechaun on Mars than this passing",
            "title_similarity": "0.30867007",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hrzteei",
            "score": 3,
            "text": "There’s times you can be proud of your senators. This is one of them, well done Georgia we’re in this together.",
            "title_similarity": "0.21188195",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hrztesh",
            "score": 2,
            "text": "From What I read about it, they want it to extend to immediate family, so Yes.",
            "title_similarity": "0.1760299",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hrztfra",
            "score": 1,
            "text": "They should have to sell all stocks prior to being sworn in and cannot have immediate family members trade either.\n\nIn addition, no stock trading up to 10 years after leaving office.",
            "title_similarity": "0.6505944",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrztg0c",
            "score": 1,
            "text": "So what? They will ask their friends to do it instead 🤨\n\nWhy is that all dumb people get into government 🤔",
            "title_similarity": "0.5758866",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hrztipg",
            "score": 1,
            "text": "Better read that bill carefully to make sure it doesn't include poison pills that ensure Democrats have to vote against it.",
            "title_similarity": "0.6253087",
            "sentiment_compound": 0.8793
        },
        {
            "id": "hrztisu",
            "score": 1,
            "text": "Good fuckin luck our government is a snake pit of thieves that steal from us every pay period. Country is absolutely fucked.",
            "title_similarity": "0.4186115",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hrztmk4",
            "score": 1,
            "text": "We have a better chance of seeing aliens before this bill even gets close to Passing. This is called Good PR",
            "title_similarity": "0.39473605",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hrztmxa",
            "score": 1,
            "text": "This should be a popular vote referendum, since there is an obvious conflict of interest",
            "title_similarity": "0.4594288",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hrztpeu",
            "score": 1,
            "text": "Voted on by the people profiting from those stock trades lol",
            "title_similarity": "0.50186044",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hrztsxo",
            "score": 1,
            "text": "Nothing will come of this, but I do hope to see all members of Congress from both parties forced to vote on this.\n\nThat said, I'm sure they'll spin it and convince the average person that it's in their best interest to let the rich folks in Congress conduct insider trading.",
            "title_similarity": "0.6422166",
            "sentiment_compound": 0.9765
        },
        {
            "id": "hrztujs",
            "score": 1,
            "text": "Someone gonna get caught with soliciting an underage girl faster than you can say Panama Pa",
            "title_similarity": "0.32091743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrztw8h",
            "score": 1,
            "text": "Rather that then to admit the stock market is a scam to begin with.",
            "title_similarity": "0.51036394",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hrztx3y",
            "score": 1,
            "text": "Idk if he eventually has his sights on President but things like this catch my eye as a reason to garner my vote.  Love to see it.",
            "title_similarity": "0.48067063",
            "sentiment_compound": 0.8705
        },
        {
            "id": "hrzty0a",
            "score": 4,
            "text": "Take note of who votes no  (if there even is a vote) \n\nThose who vote no are the ones that need to be voted out of office. Regardless of party.",
            "title_similarity": "0.58031815",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hrztz8l",
            "score": 2,
            "text": "Even if it makes it out of the Senate, Pelosi will never allow it to see the light of day in the House. She’s very clear about that.",
            "title_similarity": "0.6136205",
            "sentiment_compound": 0.302
        },
        {
            "id": "hrzu2cy",
            "score": 2,
            "text": "Pelosi trades through her husband, though. How will that be addressed? If anyone know I would be grateful!",
            "title_similarity": "0.40149957",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hrzu6c5",
            "score": 1,
            "text": "Please do that, Jon.",
            "title_similarity": "0.02599691",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrzu8gw",
            "score": 1,
            "text": "*\"The ayes 4. The nays 431. The nays have it\"*",
            "title_similarity": "0.16137248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzu9bw",
            "score": 1,
            "text": "Good! It’ll get shot down but make those sumbitches go on the official record voting against it.",
            "title_similarity": "0.5018208",
            "sentiment_compound": 0.3054
        },
        {
            "id": "hrzubpu",
            "score": 1,
            "text": "And it won’t pass. Jesus this subreddit is useless. It’s click baitey bullshit that never happens.",
            "title_similarity": "0.3580565",
            "sentiment_compound": -0.765
        },
        {
            "id": "hrzugot",
            "score": 1,
            "text": "I fucking hate the cynicism in this thread.\n\nIs this likely to pass? No. Could it be toothless? Yes. But maybe it will pass, and maybe it'll make things a tiny bit better.\n\nCan we fucking at least hope it does something for a little while before we all fall into depression and dooming? Let us have like, a little tiny bit of hope after a monumentally shitty couple years?",
            "title_similarity": "0.35756895",
            "sentiment_compound": -0.7386
        },
        {
            "id": "hrzum8i",
            "score": 1,
            "text": "Thought that headline said \"ball bearing\"",
            "title_similarity": "0.2068142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzuor4",
            "score": 2,
            "text": "So you realize there are about 359 ways around this bill, right?   This means that they will move this money and change the way they do accounting only. Just saying.",
            "title_similarity": "0.60275424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzupql",
            "score": 1,
            "text": "This is big!",
            "title_similarity": "-0.0051669283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzut1j",
            "score": 3,
            "text": "It would be a start.",
            "title_similarity": "-0.028361585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzutxv",
            "score": 1,
            "text": "If it’s just a law, what’s to prevent them from repealing it later?",
            "title_similarity": "0.57664025",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hrzuu9b",
            "score": 2,
            "text": "It will have the most bipartisan rejection in the history of the nation.\n\nIf this is placed on a national referendum it would get 99% support from the people, from Republicans and Democrats. But the “representative” in the Congress, Republicans and Democrats, will reject this.\n\nStock trading using insider information is how these “elected officials” gain their money.",
            "title_similarity": "0.64305776",
            "sentiment_compound": 0.1308
        },
        {
            "id": "hrzv0js",
            "score": 3,
            "text": "How will this matter? They'll just tell their husbands/wives/kids what to buy.",
            "title_similarity": "0.43675348",
            "sentiment_compound": 0.0323
        },
        {
            "id": "hrzv4bp",
            "score": 1,
            "text": "Is it needed? Absolutely.!!! Will it pass? Not a chance. Does it bring attention? A bit. A populist move? Most definitely.",
            "title_similarity": "0.3136465",
            "sentiment_compound": 0.6235
        },
        {
            "id": "hrzv4cg",
            "score": 1,
            "text": "R/freespeachusa",
            "title_similarity": "0.103064165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzv5yn",
            "score": 1,
            "text": "This probably won’t even get voted on",
            "title_similarity": "0.29281595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzv7l1",
            "score": 1,
            "text": "but how will we get competent legislators oh no",
            "title_similarity": "0.42154634",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hrzv8rd",
            "score": 1,
            "text": "I'm sure that will get passed.",
            "title_similarity": "-0.017534722",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrzv9t6",
            "score": 1,
            "text": "Y’all need to stop this jab it’s killing people",
            "title_similarity": "0.35282493",
            "sentiment_compound": -0.765
        },
        {
            "id": "hrzvab6",
            "score": 1,
            "text": "I just realized a cool side effect of this - I might actually discourage particularly corrupt politicians from running.",
            "title_similarity": "0.41886193",
            "sentiment_compound": -0.128
        },
        {
            "id": "hrzvajj",
            "score": 9,
            "text": "I VOTED FOR HIM.\nAND met him.  He literally knocked on my door(and my mom's at some point). And introduced himself and we chatted about politics and why he is running.",
            "title_similarity": "0.49684405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzvald",
            "score": 1,
            "text": "No!!! Then who are we supposed to copy?!",
            "title_similarity": "0.29208437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzvmxv",
            "score": 1,
            "text": "Ensuring he will never get a committee assignment, ever, much less one of the coveted ones. I appreciate the principle, but he and everyone else knows this has no chance, so all he is doing is hurting his change to actually make effective change in the future.",
            "title_similarity": "0.45267016",
            "sentiment_compound": 0.224
        },
        {
            "id": "hrzvod6",
            "score": 1,
            "text": "100% support this (so long as spouses are also barred!). Anybody who trades based off of a congressman's/senators hints should be charged with insider trading imo.",
            "title_similarity": "0.54892343",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hrzvsfq",
            "score": 1,
            "text": "This bill will be the fastest bill ever into the trash bin.",
            "title_similarity": "0.3136981",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzw0d5",
            "score": 1,
            "text": "Which gets voted on by those same congress people. I’m sure it will go far",
            "title_similarity": "0.37656233",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrzw2ne",
            "score": 5,
            "text": "Too bad this will go nowhere.  How do you think the members of Congress amass their fortunes?\n\nWhile he is at it, how about throwing in term limits for members of Congress too?",
            "title_similarity": "0.70691276",
            "sentiment_compound": -0.594
        },
        {
            "id": "hrzw2u9",
            "score": 1,
            "text": "Now they just trade bulk stocks. Crock of bull shit I tell ya!",
            "title_similarity": "0.55192286",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hrzwblp",
            "score": 2,
            "text": "So they’ll just have someone else do it for them. Throw some of them in jail now and make an example. You can start with Pelosi, Manchin, McConnell and whoever else you wish.",
            "title_similarity": "0.37016088",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzwe9l",
            "score": 1,
            "text": "fucking good",
            "title_similarity": "-0.1346647",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hrzwgwr",
            "score": 1,
            "text": "It’s almost like there would be conflicts of interests without this",
            "title_similarity": "0.12134835",
            "sentiment_compound": 0.1548
        },
        {
            "id": "hrzwh08",
            "score": 1,
            "text": "“Set to introduce” k",
            "title_similarity": "0.10371225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzwhjz",
            "score": 1,
            "text": "What we need is a \"Bar Bill Barr from the Bar\" Bill.",
            "title_similarity": "0.53841084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzwkwl",
            "score": 2,
            "text": "I'll tell you the odds of this bill even getting a vote. \n\nWhen hell freezes over.",
            "title_similarity": "0.59531873",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hrzwlrn",
            "score": 1,
            "text": "If it doesn't pass, we know they ARE inside trading. If it passes, I'll eat a shoe.",
            "title_similarity": "0.39238727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzwsie",
            "score": 1,
            "text": "Won’t pass.",
            "title_similarity": "0.16255364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzwy11",
            "score": 1,
            "text": "Might as well ask them to take a pay cut or stop taking bribes. What’s in this bill that would make want to vote for it?",
            "title_similarity": "0.6052913",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hrzx1wo",
            "score": 1,
            "text": "They do this every few years and it never goes anywhere.",
            "title_similarity": "0.16918212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzx2z1",
            "score": 1,
            "text": "what about their family/significant other?",
            "title_similarity": "0.1998057",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzx5e4",
            "score": 1,
            "text": "This changes very little. They will just now buy funds like SPY and Vanguard and then suck the dicks of even more companies. For SPY they now have to cater to Tesla, apple and Microsoft… lol they just can’t pick one.\n\nPS: I made 30K last year buying SPY following along with Speaker Pelosi’s Husband. Her husband by chance just happens to be one of the best day traders in US stock market history.",
            "title_similarity": "0.58442473",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hrzx860",
            "score": 1,
            "text": "Breaking: record number of congressional spouses and children open individual investment accounts",
            "title_similarity": "0.43557093",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrzx9xy",
            "score": 1,
            "text": "This is like them voting term limits in. Never going to happen",
            "title_similarity": "0.5011096",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrzxcux",
            "score": 1,
            "text": "This *should* be passed, but it won't. We are the serfs and they want it to stay that way.",
            "title_similarity": "0.33586487",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hrzxgpr",
            "score": 1,
            "text": "Only for it to die on the floor.",
            "title_similarity": "0.17476484",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hrzxloz",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.17711349",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrzxotj",
            "score": 1,
            "text": "Never going to pass. Manipulation of the markets is one of the primo reasons these people embarrass themselves to stay in office",
            "title_similarity": "0.49409208",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hrzxukb",
            "score": 2,
            "text": "Do it",
            "title_similarity": "-0.05654411",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzxv9u",
            "score": 1,
            "text": "laughs in bernie",
            "title_similarity": "-0.0057306755",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrzxvlg",
            "score": 1,
            "text": "Or at least blackout periods",
            "title_similarity": "0.18463969",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzxxmx",
            "score": 1,
            "text": "We already have that rule, it's just not enforced.",
            "title_similarity": "0.30613703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzxzry",
            "score": 1,
            "text": "a great litmus test of who needs to go. And most of them need to go if this doesn’t get anywhere.",
            "title_similarity": "0.28918803",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hrzy0v4",
            "score": 2,
            "text": "… has died in traffic accident.",
            "title_similarity": "0.30971467",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hrzy1y5",
            "score": 3,
            "text": "Thank you! Way to go, Ossoff!",
            "title_similarity": "0.051355265",
            "sentiment_compound": 0.4738
        },
        {
            "id": "hrzy3yx",
            "score": 2,
            "text": "If only the citizens could vote on this, it would pass in a heartbeat. The thought of this passing the House and especially the Senate is laughable. Ain’t no way in hell the ruling class relinquishes any of their power.",
            "title_similarity": "0.5897582",
            "sentiment_compound": -0.765
        },
        {
            "id": "hrzy3z6",
            "score": 1,
            "text": "How about they put their money into government bonds when they enter office and get it back when they leave office?  Or at least a blind trust right?",
            "title_similarity": "0.7004366",
            "sentiment_compound": 0.1926
        },
        {
            "id": "hrzy5lk",
            "score": 1,
            "text": "You want congress to vote that congressmen and women can’t trade stocks. Good luck with that",
            "title_similarity": "0.74122417",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hrzy688",
            "score": 2,
            "text": "I mean, I love the effort, but there's no way those currupt bastards on capitol hill vote it in",
            "title_similarity": "0.44306645",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hrzyaph",
            "score": 1,
            "text": "And who gets to vote on this, if comes to that?",
            "title_similarity": "0.34502506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzyfgh",
            "score": 1,
            "text": "“We won’t be voting on this.”\n\n-Pelosi probably",
            "title_similarity": "0.46096784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzyhjw",
            "score": 2,
            "text": "Won't pass, but it's a nice gesture.",
            "title_similarity": "0.0370829",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hrzypwx",
            "score": 2,
            "text": "If this passes then I will believe that we have a true democracy",
            "title_similarity": "0.22967839",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrzyuil",
            "score": 1,
            "text": "Good step. Getting rid of Citizens United is also a must. Otherwise “democracy” in the US is a farce.",
            "title_similarity": "0.5028908",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hrzyuwq",
            "score": 1,
            "text": "This is pretty dumb since you can buy stock in so many ways that under your name is only one way.  It’s a good idea but it has to be water tight but it’s prob not and only good for publicity",
            "title_similarity": "0.42787534",
            "sentiment_compound": -0.298
        },
        {
            "id": "hrzyvo5",
            "score": 1,
            "text": "We know.",
            "title_similarity": "-0.10758503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzyy2u",
            "score": 2,
            "text": "Even though this will probably go nowhere, I'm psyched to see more Millennials making an impact. Boomers have truly screwed over this country.",
            "title_similarity": "0.35189587",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrzyzar",
            "score": 4,
            "text": "This will be the bill where the two parties can work together. They'll vote no so both sides can continue inside trading.",
            "title_similarity": "0.63433874",
            "sentiment_compound": 0.128
        },
        {
            "id": "hrzz3hf",
            "score": 3,
            "text": "Would Congress really restrict themselves?",
            "title_similarity": "0.53937745",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hrzze38",
            "score": 2,
            "text": "Common sense legislation that has no chance of being passed. Absolutely sad.",
            "title_similarity": "0.39122093",
            "sentiment_compound": -0.6289
        },
        {
            "id": "hrzzj27",
            "score": 1,
            "text": "Is Pelosi going to try to block this as well?",
            "title_similarity": "0.48807216",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hrzzjn3",
            "score": 2,
            "text": "Love this guy! Fuck all of this corruption. Take ‘em out!",
            "title_similarity": "0.22983484",
            "sentiment_compound": 0.3147
        },
        {
            "id": "hrzznku",
            "score": 2,
            "text": "I’ve had meetings with Ossoff and so far he has delivered on his promise. I don’t usually side with ANY politician but I will say that he genuinely showed good faith, listened to the wronged parties and delivered on his promise. \n\nI was (still reside as) one of the residents in the meetings referenced below. \n\n[Source: News Story](https://www.wrdw.com/2021/12/27/fort-gordon-housing-provider-pleads-guilty-fraud-scheme/)",
            "title_similarity": "0.46052402",
            "sentiment_compound": 0.8968
        },
        {
            "id": "hrzzob4",
            "score": 1,
            "text": "Theater",
            "title_similarity": "0.13021554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrzzow2",
            "score": 1,
            "text": "Seeing how Congress made millions of dollars off of a nationwide lockdown while the citizens of America go broke and starve to death, yeah it's called corruption. Insider trading. It is illegal for everyone else",
            "title_similarity": "0.5671998",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hrzzpu5",
            "score": 1,
            "text": "It’ll fail because first and foremost they’re all neoliberals whose policies exacerbate wealth inequality (it’s a primary aspect of the “both parties” argument).",
            "title_similarity": "0.49417734",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hrzzqft",
            "score": 1,
            "text": "Wouldn’t citizens united be a better idea",
            "title_similarity": "0.2644769",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hrzztjq",
            "score": 1,
            "text": "It would give less monetary incentive to hold public office.  This is a good thing. Nancy won’t let it pass",
            "title_similarity": "0.4573155",
            "sentiment_compound": 0.6275
        },
        {
            "id": "hrzzwz9",
            "score": 1,
            "text": "Crossing fingers it goes the distance and passes. It will be interesting to see who may vote against the bill.",
            "title_similarity": "0.49297547",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrzzz1i",
            "score": 1,
            "text": "Was trying to figure it out- how to let them invest without allowing them to profit off inside information. \n\nWhat if each trade was announced, and not allowed to close for 90 days?? \n\n“ Senator Smith is buying 300 shares of Exxon in 90 days at market price.” \n\nWould that negate any advantage he might have over the market?",
            "title_similarity": "0.65318",
            "sentiment_compound": 0.7677
        },
        {
            "id": "hrzzzem",
            "score": 1,
            "text": "But who will I follow to make trades if Nancy Pelosi can’t do insider trading?",
            "title_similarity": "0.60940874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0068g",
            "score": 1,
            "text": "No politician of any kind should be able to trade stocks.",
            "title_similarity": "0.57250327",
            "sentiment_compound": 0.296
        },
        {
            "id": "hs009y7",
            "score": 1,
            "text": "One of the nice things about the outcome of the GA elections. \n\nAs you may recall Ossoff's opponent [was caught doing many suspicious individual stock trades](https://www.nytimes.com/2020/12/02/us/politics/david-perdue-stock-trades.html) and caught lying about [not making his own trades](https://theintercept.com/2020/12/03/david-perdue-senate-cardlytics-stock-lie/). \n\nBack when Perdue and the GOP controlled the Senate [similar bills died](https://truthout.org/articles/warren-introduces-bill-banning-members-of-congress-from-owning-or-trading-stock/). \n\nI hope this bill makes it.",
            "title_similarity": "0.65931374",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hs00d8q",
            "score": 2,
            "text": "Get em, Jon",
            "title_similarity": "0.0903887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs00dyg",
            "score": 1,
            "text": "Won’t they just put their money in an investment fund run by someone who will just so happen to get the insider information and make changes to the portfolios to time the market?",
            "title_similarity": "0.6096456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs00flz",
            "score": 1,
            "text": "Nice political theater but the greed in Congress will never let it pass.",
            "title_similarity": "0.5486743",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hs00mnw",
            "score": 1,
            "text": "That bill will be very short lived.",
            "title_similarity": "0.14402694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs00ubb",
            "score": 1,
            "text": "While I laud his efforts..\n Does he really think, he can pass this? You really think senators and representatives will voluntarily forgoe making money...???",
            "title_similarity": "0.6525619",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs00wnn",
            "score": 1,
            "text": "Don’t worry. Skeezebag politicians will find a way around it.",
            "title_similarity": "0.38980946",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hs013qd",
            "score": 1,
            "text": "Yeah good luck getting that passed",
            "title_similarity": "-0.050982013",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hs014md",
            "score": 1,
            "text": "It's going to lose 99-1",
            "title_similarity": "0.27128702",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hs015ko",
            "score": 2,
            "text": "It’s never going to be brought to the floor for a vote. Why? Nancy won’t let it happen. It’s her bread and butter.",
            "title_similarity": "0.53357124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs019u4",
            "score": 1,
            "text": "This better be bipartisan",
            "title_similarity": "0.26113594",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs01dit",
            "score": 1,
            "text": "Pelosi won’t let this go anywhere",
            "title_similarity": "0.38070786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs02064",
            "score": 1,
            "text": "Bet you money a majority from both sides would vote against this",
            "title_similarity": "0.4126359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs026m1",
            "score": 1,
            "text": "This is just a waste of paper.",
            "title_similarity": "0.15482257",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hs027na",
            "score": 1,
            "text": "Needs to include their spouses and family as well",
            "title_similarity": "0.13741012",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hs02caa",
            "score": 1,
            "text": "I feel a Democratic Senator from Georgia should focus on bipartisan issues that actually have a snowballs chance in hell of passing.",
            "title_similarity": "0.5878818",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hs02dtf",
            "score": 1,
            "text": "Even if this passes, they will just find other ways to do it. They can use their kids, parents, friends, etc.",
            "title_similarity": "0.16199015",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hs02h5g",
            "score": 1,
            "text": "Sadly this will go nowhere. The large majority of both parties are massively corrupt when it comes to insider trading. I'd be shocked if it comes up for a vote, even more shocked if it actually passes.",
            "title_similarity": "0.4946107",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hs02hdx",
            "score": 2,
            "text": "Good shit Senator Ossoff! Right and left, the country is United behind you on this legislation! We’re all tired of crook politicians enriching themselves, and I don’t care if they are on the right or the left.",
            "title_similarity": "0.55315125",
            "sentiment_compound": 0.4559
        },
        {
            "id": "hs02qmv",
            "score": 1,
            "text": "They will still do it.",
            "title_similarity": "-0.10196624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs02vfn",
            "score": 1,
            "text": "Yay to bad it won't go anywhere.",
            "title_similarity": "0.18791258",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hs02vfw",
            "score": 1,
            "text": "So long overdue.\n\nThis NEEDS a floor vote so every last one of them is on record voting for or (most likely) against",
            "title_similarity": "0.3407733",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs031u0",
            "score": 2,
            "text": "Get fucked Pelosi. Im glad that guy shit in front of your house and Im not even right wing.",
            "title_similarity": "0.46893036",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hs037dv",
            "score": 1,
            "text": "And it’ll die on the floor because he will get zero support and then he can turn to his people and say “I tried!” And he will get re-elected off of this. Meanwhile, nothing fucking changes.",
            "title_similarity": "0.5067179",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hs037la",
            "score": 1,
            "text": "Good luck with that.",
            "title_similarity": "-0.12483316",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hs03dho",
            "score": 1,
            "text": "As much as I like what Senator Jon Ossoff is doing here to prevent members of Congress from trading individual stocks I think that his proposed legislation bill is moot because the corporate Democrats won’t go for it and will refuse to let it pass still it’s good to see Senator Jon Ossoff knowing why it’s completely unnecessary for members of Congress from trading individual stocks that’s unfair to the American people he just got more likable in my opinion",
            "title_similarity": "0.6586394",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hs03dno",
            "score": 2,
            "text": "Can't wait to hear how this is in any way a bad idea",
            "title_similarity": "0.22589283",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs03j75",
            "score": 2,
            "text": "Make corporate lobbying a felony too",
            "title_similarity": "0.6009129",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hs03ksq",
            "score": 1,
            "text": "Good on ya mate",
            "title_similarity": "-0.08780687",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs03l3b",
            "score": 1,
            "text": "Then tackle monopolies!🔥🔥🔥",
            "title_similarity": "0.28551546",
            "sentiment_compound": -0.7574
        },
        {
            "id": "hs03maf",
            "score": 2,
            "text": "I’m sure they’ll all do the right thing and support this. \n\nJust kidding.",
            "title_similarity": "0.047339506",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hs03n3j",
            "score": 2,
            "text": "Aren't the corrupt people that this bill is trying to stop also the ones voting on it?  Not exactly a solid system of checks and balances.",
            "title_similarity": "0.56609565",
            "sentiment_compound": -0.3907
        },
        {
            "id": "hs03r9q",
            "score": 1,
            "text": "We need names of everyone who overturns this bill…they, Democrats & Republicans, are the reason our country is in the shit!!!!",
            "title_similarity": "0.5288223",
            "sentiment_compound": 0.7326
        },
        {
            "id": "hs03sz4",
            "score": 1,
            "text": "What about their spouses? Because if it doesn't include them, this is pretty meaningless...",
            "title_similarity": "0.32021892",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hs03x09",
            "score": 1,
            "text": "Everyone needs to put pressure on their senators. This NEEDS to happen. It's the first step in moving away from corporate oligarchy.",
            "title_similarity": "0.59162104",
            "sentiment_compound": -0.296
        },
        {
            "id": "hs03zbj",
            "score": 1,
            "text": "Am I the only one that thinks that these announcements are just fluff?\n\nResults are what I'm looking for, make the entire congress vote on it! show us who's not on board with what the vast majority of the American people want!",
            "title_similarity": "0.5966786",
            "sentiment_compound": 0.2225
        },
        {
            "id": "hs042a7",
            "score": 1,
            "text": "Just make what they trade public information. That way we can see what they are up to",
            "title_similarity": "0.36117893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs045w5",
            "score": 2,
            "text": "He’ll be invited to the Speakers office for a chat, then miraculously backpedal like mad. Always seems to happen when sensible legislation like this threatens the top brass.",
            "title_similarity": "0.53125525",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hs04bfc",
            "score": 1,
            "text": "Does say anything about options",
            "title_similarity": "0.11492921",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs04dk8",
            "score": 1,
            "text": "Good but what does this really accomplish? I hate to feel so cynical but this just skirts the real issue of dark money and corruption. It's like.0.01% of the problem.",
            "title_similarity": "0.43017235",
            "sentiment_compound": -0.8575
        },
        {
            "id": "hs04fx4",
            "score": 1,
            "text": "Why? It’s a pointless DOA gesture. One that’ll be forgotten in a few days/weeks.",
            "title_similarity": "0.32883468",
            "sentiment_compound": -0.7125
        },
        {
            "id": "hs04gll",
            "score": 1,
            "text": "Especially insider trading!",
            "title_similarity": "0.376976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs04l6u",
            "score": 1,
            "text": "Introducing the Insider Dividends Portfolio - the only market portfolio designed for the busy legislator who wants to get filthy rich without looking like they've done something wrong!",
            "title_similarity": "0.5770618",
            "sentiment_compound": -0.2268
        },
        {
            "id": "hs04nh2",
            "score": 1,
            "text": "Congress won’t pass a law against themselves like this. Guaranteed.",
            "title_similarity": "0.61224073",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs04o47",
            "score": 1,
            "text": "My guy!",
            "title_similarity": "0.08030243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs04p1z",
            "score": 1,
            "text": "Reminder than Ossoff wouldn't be here if Georgia voters hadn't pulled through for us",
            "title_similarity": "0.49678555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs04p9h",
            "score": 1,
            "text": "So they have their spouses do it !  Right Nancy pelosi",
            "title_similarity": "0.2707263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs04ryd",
            "score": 1,
            "text": "I agree, and good for him, but this may be a master stroke of Pelosi, she's got the Republicans against it. It will be seen as their doing. No?",
            "title_similarity": "0.4989195",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs04xds",
            "score": 1,
            "text": "A lot of congressional spouses/family are about to develop a sudden interest in trading.",
            "title_similarity": "0.3822602",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs052dj",
            "score": 1,
            "text": "Every congressman should introduce nothing but these bills till one passes",
            "title_similarity": "0.5911026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs053in",
            "score": 1,
            "text": "This is a great article because it gives folks the chance to trash Pelosi and make allegations of insider trading with literally zero evidence except \"Google it\".\n\nIn the future it will be used to trash Democrats who voted against it, even though it has no chance of passing under the current political climate.\n\nThis is why it's been on the front page at least 3 times in the past couple of days.",
            "title_similarity": "0.5388812",
            "sentiment_compound": 0.6553
        },
        {
            "id": "hs056rv",
            "score": 1,
            "text": "Another tactic would be to introduce a bill declaring all insider trading is legal. Tell Congress that if they can benefit from inside information and even manipulating such information then so should the rest of us.",
            "title_similarity": "0.67866313",
            "sentiment_compound": 0.25
        },
        {
            "id": "hs057ep",
            "score": 1,
            "text": "Grandma Nancy isn't going to like this!",
            "title_similarity": "0.25425947",
            "sentiment_compound": -0.3404
        },
        {
            "id": "hs059w1",
            "score": 1,
            "text": "This guy for president",
            "title_similarity": "0.4577913",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs059x4",
            "score": 1,
            "text": "Again, cool, but how the hell will this ever be enforced? Literally all they need to do instead of trading stocks themselves is to have \"a friend\" who will do everything they did.",
            "title_similarity": "0.5366659",
            "sentiment_compound": -0.3506
        },
        {
            "id": "hs05a45",
            "score": 1,
            "text": "Hahahah like Pelosi would allow this",
            "title_similarity": "0.11628513",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hs05abn",
            "score": 1,
            "text": "It's about mother freaking time but it's not going to pass, money is a very powerful thing and when you try to take it from someone especially these types of people nothing will stop it.",
            "title_similarity": "0.4346159",
            "sentiment_compound": 0.6779
        },
        {
            "id": "hs05h0l",
            "score": 1,
            "text": "How do I support this bill?",
            "title_similarity": "0.4168136",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs05hh5",
            "score": 1,
            "text": "It'll never pass.",
            "title_similarity": "0.18147093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs05kts",
            "score": 1,
            "text": "The loop hole is they'll buy a penny stock w the stock they really want.",
            "title_similarity": "0.53832364",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hs05o3y",
            "score": 1,
            "text": "So sad the rest of his will fight him…Democratic party is loyal but they always respond with thy opposite in regards to voting……. Makes you wonder why republicans can’t do the same via video/ edits….does someone have that much money? \n\n\n1.do not release to pie Thy public.. \n2. Do not support the ..fireside.\n3. I Do not submit to the offers, with expectation \n….I will free Frida\n\nClaymaym…… you’re welcome to stay with us.😐😂",
            "title_similarity": "0.5588964",
            "sentiment_compound": 0.8838
        },
        {
            "id": "hs05tv2",
            "score": 1,
            "text": "While I fully support this bill, I don't think it has a snowball's chance in hell of passing.  And if, by some miracle, it did pass, you can be certain Pelosi would lead the charge to have the Supreme Court toss it.",
            "title_similarity": "0.5263125",
            "sentiment_compound": 0.8357
        },
        {
            "id": "hs05va8",
            "score": 1,
            "text": "So glad to have voted for him!!",
            "title_similarity": "-0.000817596",
            "sentiment_compound": 0.5963
        },
        {
            "id": "hs06956",
            "score": 3,
            "text": "Dead on Arrival. Brought to you by the same folks that supported an attack on themselves.",
            "title_similarity": "0.3827678",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hs06clj",
            "score": 3,
            "text": "Where's the text of the bill so we can see the loopholes?",
            "title_similarity": "0.5050483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs06f3v",
            "score": 2,
            "text": "The proposal would apply to members that are currently serving in office, along with their families.\n\nSo the loophole is too make money for other peoples families?",
            "title_similarity": "0.5072137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs06pun",
            "score": 2,
            "text": "While this is an awesome move that I applaud, this is likely only going to be supported by politicians for selfish reasons-defund and attack their opponents. This would then make them more powerful.\n\nWorth it though",
            "title_similarity": "0.35051927",
            "sentiment_compound": 0.8162
        },
        {
            "id": "hs06w5v",
            "score": 1,
            "text": "Ya, but what about their spouses?",
            "title_similarity": "0.26287293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs073s4",
            "score": 1,
            "text": "Nothing will happen. This guy is wasting his time. It will fail. No one wants insider trading to end, especially osoff, he's just started on his journey to unlimited wealth and power. Give it a break. We're not stupid.",
            "title_similarity": "0.48166683",
            "sentiment_compound": -0.3451
        },
        {
            "id": "hs07bnl",
            "score": 1,
            "text": "There’s no way this ever happens no matter how good of an idea it is and no matter how much of the people support it.",
            "title_similarity": "0.27919823",
            "sentiment_compound": 0.5027
        },
        {
            "id": "hs07lyx",
            "score": 1,
            "text": "I'm glad I donated to Ossoff and Warnock's campaigns to turn Georgia blue in 2020.",
            "title_similarity": "0.26454175",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs07so2",
            "score": 2,
            "text": "It’s cool to get the shit senators on public record, but until people vote their asses out (they won’t) moves like this only provide a roll call of corruption",
            "title_similarity": "0.5292527",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hs08111",
            "score": 1,
            "text": "Can we have your senator?",
            "title_similarity": "0.5476825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs088ft",
            "score": 1,
            "text": "Them and close tabs on their family",
            "title_similarity": "0.11549609",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs089xh",
            "score": 1,
            "text": "What about tranches?",
            "title_similarity": "0.14779153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs08cj9",
            "score": 1,
            "text": "He’s so goddamn sexy to me why",
            "title_similarity": "0.01581762",
            "sentiment_compound": 0.0735
        },
        {
            "id": "hs08kcg",
            "score": 1,
            "text": "So what? Tell me when it’s law.",
            "title_similarity": "0.34842536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs08v7j",
            "score": 1,
            "text": "That bill is DOA. They all profit from it.",
            "title_similarity": "0.20459673",
            "sentiment_compound": -0.2808
        },
        {
            "id": "hs08z5p",
            "score": 2,
            "text": "Good. Rules for thee and not for me. Congress is full of hypocrites.",
            "title_similarity": "0.51151013",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs08zr7",
            "score": 1,
            "text": "Greatest news I’ve heard all year",
            "title_similarity": "0.061826125",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hs0906d",
            "score": 1,
            "text": "…yeah… that’s not gonna pass. Appreciate the effort, though.",
            "title_similarity": "0.06489146",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hs090z0",
            "score": 1,
            "text": "So members in congress are going to vote on their own ability to trade stock? \n\nHow is this not a conflict of interest??",
            "title_similarity": "0.7426557",
            "sentiment_compound": 0.7784
        },
        {
            "id": "hs094kz",
            "score": 2,
            "text": "I think 99.99% of Americans would agree this is a good move. Maybe we may get our debt under control if they can't make money off it",
            "title_similarity": "0.4573044",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0961l",
            "score": 1,
            "text": "Things that won't pass for $500 Alex.",
            "title_similarity": "0.38775027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs096ik",
            "score": 2,
            "text": "That seems sensible but congress is not exactly famous for being sensible.",
            "title_similarity": "0.33476973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs09dyu",
            "score": 1,
            "text": "&#x200B;\n\nOh, so ETFs are fine. \"Great!\", he felt sarcastically.",
            "title_similarity": "0.022839563",
            "sentiment_compound": 0.6548
        },
        {
            "id": "hs09wu8",
            "score": 2,
            "text": "Long due, i hope it passes",
            "title_similarity": "-0.026071219",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0a2nx",
            "score": 1,
            "text": "Lol, yeah good luck Jon…",
            "title_similarity": "-0.016446114",
            "sentiment_compound": 0.872
        },
        {
            "id": "hs0a7vm",
            "score": 1,
            "text": "That’s great idea!",
            "title_similarity": "-0.09734419",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hs0aptf",
            "score": 1,
            "text": "Nanacy Pelosi be like \"New Kid needs some learning to do.\"",
            "title_similarity": "0.24237409",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs0aqep",
            "score": 1,
            "text": "60 minutes did a piece on this about 10 years ago, specifically exposing Pelosi.  The people who watch that show are old farts who vote, so they had to do something.  That's how we got the STOCK act.  After the dust settled, they quietly amended to STOCK act to made it essentially worthless.\n\nYoung people don't seem to be aware of all that, because what young person was watching 60 minutes 10 years ago, but i'm warning you, if they pass it, don't let them quietly unpass it later in a unanimous consent vote in the middle of the night.",
            "title_similarity": "0.5689472",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hs0auwi",
            "score": 1,
            "text": "Kudos but is performative.",
            "title_similarity": "-0.02847478",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hs0b0y4",
            "score": 1,
            "text": "I’m all for stopping corruption but could this have the unintended effect of keeping some qualified individuals from running for congress?",
            "title_similarity": "0.6161441",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hs0b6ei",
            "score": 1,
            "text": "Nancy pelosi’s filth will still continue to vote her in, knowing full well she is one of the most corrupt senators in the republic.",
            "title_similarity": "0.3631696",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hs0bf9l",
            "score": 1,
            "text": "Is “individual” stocks a keyword in the verbiage?",
            "title_similarity": "0.27764645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0bkyk",
            "score": 1,
            "text": "Unpopular opinion, but this is grabbing at smoke.  You ban their relatives, ok they just setup shell accounts or hide it some other way.  So I am not really sure how you'd make this effective.\n\nLikely, the best way to be fair about it is if you're an eligible party (family etc).  You then have to enroll in indexes.  No spot trading or holding individual stocks.  You can participate and benefit from the Stock market gains, but you wouldn't be able to trade on specific knowledge while a member.",
            "title_similarity": "0.66470635",
            "sentiment_compound": 0.9487
        },
        {
            "id": "hs0boqs",
            "score": 1,
            "text": "“Are you or anyone in your immediate family an elected official or member of a stock exchange”? ☹️",
            "title_similarity": "0.51716113",
            "sentiment_compound": -0.34
        },
        {
            "id": "hs0boxr",
            "score": 2,
            "text": "I doubt that gesture will pass",
            "title_similarity": "0.16583961",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hs0bq0h",
            "score": 1,
            "text": "That’s my senator!",
            "title_similarity": "0.39660442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0btam",
            "score": 1,
            "text": "Congress gets pensions to support them for the rest of their days while serving the people.  They should all be fine with this proposed bill:  … but this is America and GREED is ok and it’s moral detriments.",
            "title_similarity": "0.53026617",
            "sentiment_compound": -0.153
        },
        {
            "id": "hs0btsi",
            "score": 1,
            "text": "Congress gets pensions to support them for the rest of their days while serving the people.  They should all be fine with this proposed bill:  … but this is America and GREED is ok and it’s moral detriments.",
            "title_similarity": "0.53026617",
            "sentiment_compound": -0.153
        },
        {
            "id": "hs0c06q",
            "score": 1,
            "text": "YES!!! Make this happen!",
            "title_similarity": "0.007435631",
            "sentiment_compound": 0.6809
        },
        {
            "id": "hs0c07v",
            "score": 1,
            "text": "1. It'll never pass. \n2. If it passes, they'll just have their spouses place the trades.\n3. If they make that illegal too, the spouses will have a few things to say about that. But then they'll just go through back channels, like they do for campaign contributions.\n\nCongress *is* the swamp.",
            "title_similarity": "0.6931802",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hs0c3rf",
            "score": 1,
            "text": "We’re making progress boys",
            "title_similarity": "-0.07488893",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs0car0",
            "score": 1,
            "text": "This bill will die in committee",
            "title_similarity": "0.5611758",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hs0ccyd",
            "score": 1,
            "text": "Yeah that'll happen.",
            "title_similarity": "-0.07166224",
            "sentiment_compound": 0.296
        },
        {
            "id": "hs0ct5d",
            "score": 1,
            "text": "He should run for President instead of punk ass Biden",
            "title_similarity": "0.5682032",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs0ctux",
            "score": 1,
            "text": "Tax churches and synagogues now.\n\nAlso abolish any tax exemptions that ministers or priests get.",
            "title_similarity": "0.6311013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0cvo0",
            "score": 1,
            "text": "A true representative of the people",
            "title_similarity": "-0.01600597",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs0cvot",
            "score": 1,
            "text": "Lobbyists too!!!",
            "title_similarity": "0.32358134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0d5lh",
            "score": 1,
            "text": "If we had open logs of all stock trades and it was illegal to have private markets… we could use AI to find trades that are insider trading.",
            "title_similarity": "0.6396829",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hs0db0f",
            "score": 1,
            "text": "Sen. Jon Ossoff's bill barring members of Congress from trading individual stocks votes down in senate 99/1\n\nIf we even get a follow up article on this.",
            "title_similarity": "0.9069762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0dclc",
            "score": 1,
            "text": "the queen is about to put this guy on the chopping block, don't mess with ms. pelosi's money",
            "title_similarity": "0.6298878",
            "sentiment_compound": -0.1999
        },
        {
            "id": "hs0dhcp",
            "score": 1,
            "text": "Later found beaten to ruled as suicide",
            "title_similarity": "0.28076172",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hs0doz2",
            "score": 1,
            "text": "Don't worry, he will be offer early stock offerings in a book deal and gell be on board or will have a well financed opponent",
            "title_similarity": "0.5233899",
            "sentiment_compound": 0.5432
        },
        {
            "id": "hs0dpql",
            "score": 1,
            "text": "Good on him. Lot of good things came out of Gerogia once ut turned blue",
            "title_similarity": "0.03821447",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hs0dq2f",
            "score": 1,
            "text": "This is great, but this should extend to family members of Congress as ‘just Congress members’ would mean that they’d just spill the beans with their loved ones.",
            "title_similarity": "0.4819982",
            "sentiment_compound": 0.8735
        },
        {
            "id": "hs0dvqa",
            "score": 1,
            "text": "Does anyone else find Jon ossoff attractive? like damn he can sit on my face",
            "title_similarity": "0.23108439",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs0dwjt",
            "score": 1,
            "text": "I'm gonna assume anyone voting against this is crooked as shit",
            "title_similarity": "0.5553582",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hs0e3u1",
            "score": 1,
            "text": "This is the type of shit that should bring “liberal” and “conservative “ voters together. As soon as the working man sees it’s not a left v right war that they suffer from but a working person vs the ruling elite. We need a good old fashioned class war and we need it soon or this country is gonna fall to pieces. More so than it already has.",
            "title_similarity": "0.5637442",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hs0e48t",
            "score": 1,
            "text": "Will members be forced to vote on this as a matter of public record?",
            "title_similarity": "0.5240739",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hs0e5wb",
            "score": 1,
            "text": "“How americas dead body” said democrats and republicans.",
            "title_similarity": "0.47033703",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hs0e9w5",
            "score": 2,
            "text": "It'll get killed in committee.  Unfortunately.",
            "title_similarity": "0.42841676",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hs0eh5v",
            "score": 1,
            "text": "I'll be honest, I have no idea how this passes but it should never be put up to congress, it should be up to the American people.",
            "title_similarity": "0.6398562",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hs0eulu",
            "score": 2,
            "text": "Let me guess, this guy is a progressive Democrat. Only a dreamer would believe that doing something that most Americans want but prevents Congress from enriching themselves will ever get passed.",
            "title_similarity": "0.58003736",
            "sentiment_compound": 0.1875
        },
        {
            "id": "hs0ezf4",
            "score": 1,
            "text": "Sweet for the hears, but it won’t pass",
            "title_similarity": "0.16859572",
            "sentiment_compound": 0.25
        },
        {
            "id": "hs0f42b",
            "score": 1,
            "text": "Obama tried this and they found away around it: keep the records in the office building basement.  Clever!",
            "title_similarity": "0.47678012",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hs0f72c",
            "score": 1,
            "text": "If it goes to a vote check the returns of the no votes compared to the s&p500",
            "title_similarity": "0.549783",
            "sentiment_compound": -0.296
        },
        {
            "id": "hs0fb24",
            "score": 1,
            "text": "Dead on arrival unfortunately",
            "title_similarity": "0.21090294",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hs0fjjm",
            "score": 1,
            "text": "Should be the most bipartisan legislation in a while, at least from the progressive left, the authoritarian right and everyone in between.",
            "title_similarity": "0.31575054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0hf3m",
            "score": 1,
            "text": "Goodluck with that",
            "title_similarity": "-0.07225735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0hgnl",
            "score": 1,
            "text": "Doesn’t mean they can’t trade as their spouse, their kids, their sister.",
            "title_similarity": "0.34741917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0hr0d",
            "score": 1,
            "text": "I'm sure all the millionaire will do the right thing as they always have.",
            "title_similarity": "0.07847159",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hs0hyw6",
            "score": 2,
            "text": "This is why the democratic party hates it progressive wing, they keep pointing out how corrupt the democratic party is.",
            "title_similarity": "0.43449727",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs0i1uu",
            "score": 1,
            "text": "Excellent work. Of course, no member of congress will vote for a bill that keeps them from making money, but A for effort.",
            "title_similarity": "0.5213714",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hs0icfk",
            "score": 1,
            "text": "Great news",
            "title_similarity": "-0.077267855",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hs0iqjs",
            "score": 1,
            "text": "Spoiler alert, it won't pass",
            "title_similarity": "0.24954063",
            "sentiment_compound": 0.296
        },
        {
            "id": "hs0jf3a",
            "score": 1,
            "text": "It will never pass. It is purely symbolic. It will serve as a way to easily see who is corrupt though.",
            "title_similarity": "0.36552897",
            "sentiment_compound": 0.34
        },
        {
            "id": "hs0jiuh",
            "score": 1,
            "text": "Get ready for all the senators to put their money into a specific \"index\" fund that seems to always do really well.",
            "title_similarity": "0.33650732",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hs0jnyj",
            "score": 2,
            "text": "No way this will pass.",
            "title_similarity": "0.16575047",
            "sentiment_compound": -0.296
        },
        {
            "id": "hs0jo35",
            "score": 1,
            "text": "Finally someone doing the right thing",
            "title_similarity": "-0.07698679",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0jwpu",
            "score": 2,
            "text": "Wow. No clue who this guy is, but if this got any traction and even led to something down the road, I'd support this fucking guy forever (still not expecting it to ever stick)",
            "title_similarity": "0.26622844",
            "sentiment_compound": 0.6542
        },
        {
            "id": "hs0k3qa",
            "score": 2,
            "text": "This is way overdue. By decades.",
            "title_similarity": "0.13353483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0k480",
            "score": 2,
            "text": "Love to hear the corrupt ones argue that they deserve to get richer with insider information while the rest of us stay poor.",
            "title_similarity": "0.325362",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hs0k7wn",
            "score": 1,
            "text": "glad I donated to the campaign that helped get him elected. Money out policitics, even that as obtuse as stocks arrangements, is the only righteous path forward",
            "title_similarity": "0.4083218",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs0k8ah",
            "score": 1,
            "text": "Wow! This + the fact that he replaced a Senator who was caught trading off of classified info is just too perfect!",
            "title_similarity": "0.4993583",
            "sentiment_compound": 0.8436
        },
        {
            "id": "hs0ka14",
            "score": 1,
            "text": "This is good idea because it would have prevented someone from copying Sen Perdue stock trades",
            "title_similarity": "0.5171533",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs0ka4l",
            "score": 1,
            "text": "Nanc is gonna have a problem with this.",
            "title_similarity": "0.19545907",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hs0karv",
            "score": 1,
            "text": "Good luck",
            "title_similarity": "-0.14574127",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hs0kfky",
            "score": 1,
            "text": "Won’t pass",
            "title_similarity": "0.17369846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0kolk",
            "score": 1,
            "text": "lmao def not happening",
            "title_similarity": "0.2580736",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hs0lbx4",
            "score": 1,
            "text": "We finally are going to see that bipartisanship we’ve heard so much about. Sad that there is no way to make something pass that 90%(im exaggeration) of normal people want to pass.",
            "title_similarity": "0.46167246",
            "sentiment_compound": -0.6444
        },
        {
            "id": "hs0lgsv",
            "score": 1,
            "text": "This reminds me of 2003 when Bush channeled his inner Reagan and valiantly liberated the Iraqi people from he who shall not be named (saddam).",
            "title_similarity": "0.5038088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0lmzi",
            "score": 1,
            "text": "Do you think they will enforce it?",
            "title_similarity": "0.25533175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0lxa4",
            "score": 2,
            "text": " No way this passes. After all the people it will impact get to chose wether or not they want it.",
            "title_similarity": "0.3280908",
            "sentiment_compound": -0.3447
        },
        {
            "id": "hs0m7qs",
            "score": 2,
            "text": "I hope this passes",
            "title_similarity": "-0.041240208",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0mdrd",
            "score": 1,
            "text": "Spoiler alert, this bill will fail",
            "title_similarity": "0.38222378",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hs0mnz0",
            "score": 2,
            "text": "Glad I voted for him",
            "title_similarity": "0.04470911",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs0nmj4",
            "score": 2,
            "text": "Ossoff will be like Bernie without needing a shower after voting for him",
            "title_similarity": "0.3968051",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs0o3zj",
            "score": 2,
            "text": "Separation of power? What is that?",
            "title_similarity": "0.25898013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0o4he",
            "score": 2,
            "text": "The fact that this isn’t a no-brainer is pretty telling.",
            "title_similarity": "0.045449127",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hs0o5cd",
            "score": 1,
            "text": "This hypocrisy is exactly why I started working on a way to make it more transparent. \n\nhttps://glimpse.info/subscribe",
            "title_similarity": "0.281539",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0oil9",
            "score": 1,
            "text": "Didn’t they just try this and Pelosi shot it down? I hope it passes this time!",
            "title_similarity": "0.3652952",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hs0ome0",
            "score": 1,
            "text": "White Obama coming in clutch",
            "title_similarity": "0.19946256",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0oyi8",
            "score": 1,
            "text": "Completely forgot about this little twerp. Sure hope Nancy doesn’t reprimand him and put him in time out!",
            "title_similarity": "0.39036173",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hs0pd64",
            "score": 1,
            "text": "If this passes, Nancy Pelosi will suddenly feel the urge to retire.",
            "title_similarity": "0.33131796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0pleo",
            "score": 2,
            "text": "If this happens I will start to have some faith in America again (I’m American).",
            "title_similarity": "0.3051504",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs0pn9z",
            "score": 1,
            "text": "This will never ever pass.",
            "title_similarity": "0.1812508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0po5u",
            "score": 2,
            "text": "My friend went to college with him and she said he was super fucking cool. He continues to prove her right. I know this will go absolutely nowhere, but I’m glad at least one person is bringing this forward.",
            "title_similarity": "0.2363955",
            "sentiment_compound": 0.2793
        },
        {
            "id": "hs0poef",
            "score": 1,
            "text": "Alright guys, where’s the loophole here that they will 100 percent exploit?",
            "title_similarity": "0.24353701",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hs0ppwv",
            "score": 1,
            "text": "Stocks but what about Options coz Pelosi killed it with options $30M",
            "title_similarity": "0.52562594",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hs0pt23",
            "score": 1,
            "text": "This will likely end up being a PR stunt, but I’m glad the idea is being publicly discussed!",
            "title_similarity": "0.23220599",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hs0pta5",
            "score": 1,
            "text": "Finally",
            "title_similarity": "-0.123934895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0pvvn",
            "score": 2,
            "text": "Breaking: Sen. Jon Ossoff trying to make himself look progressive by drafting bill that has no chance.",
            "title_similarity": "0.6615541",
            "sentiment_compound": -0.1877
        },
        {
            "id": "hs0pw7m",
            "score": 2,
            "text": "> It’s the issue of our time.",
            "title_similarity": "0.1915413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0qnbz",
            "score": 1,
            "text": "When this passes MTG won’t run for re-election. She’d make more at her gym. Besides she doesn’t know how to legislate, only tweet and do insider trading /s",
            "title_similarity": "0.57758504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0qvnd",
            "score": 1,
            "text": "If this gets turned down why don’t the people just add it to the next election! That will let our voices heard!",
            "title_similarity": "0.5435913",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0qx8x",
            "score": 1,
            "text": "And it will die in committee!",
            "title_similarity": "0.38368955",
            "sentiment_compound": -0.636
        },
        {
            "id": "hs0r5nx",
            "score": 1,
            "text": "Yet still no bill for buying, owning, or making laws that benefit their stock?  For one example: pharmaceutical stock.",
            "title_similarity": "0.60726154",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hs0rgoz",
            "score": 1,
            "text": "They need to go after IPOs as well , I don’t get why anyone gets preferential access to IPO stock",
            "title_similarity": "0.60365367",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hs0rnqe",
            "score": 1,
            "text": "This is a bad idea, I've been copying all the purchase Nancy Pelosi and her husband make",
            "title_similarity": "0.4920748",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs0rpk9",
            "score": 1,
            "text": "No way it passes but whatever",
            "title_similarity": "0.13870926",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hs0rr3f",
            "score": 1,
            "text": "A bill with massive bi partisan support,  Amongst the American people which means there's no shot in hell it will be implemented",
            "title_similarity": "0.5309122",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hs0rwtw",
            "score": 1,
            "text": "Even if it wins, watch a new bill being passed to allow for these super new investment opportunities and products.",
            "title_similarity": "0.4417047",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hs0rx7m",
            "score": 1,
            "text": "good. they they just use the information they get before us like they did with Covid and make even more money",
            "title_similarity": "0.3003115",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hs0s1d0",
            "score": 1,
            "text": "Gee, I wonder if they're going to vote to give themselves less money?",
            "title_similarity": "0.43962902",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0s34n",
            "score": 1,
            "text": "They all dabble in trading, this is gonna get shot down easy. So what can we really do?",
            "title_similarity": "0.3877871",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0sab4",
            "score": 1,
            "text": "Welp congresses smear campaign of him is gonna start very soon and very strong",
            "title_similarity": "0.2066642",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hs0sdbb",
            "score": 1,
            "text": "We already know Pelosi will never let that bill be voted on in the House.",
            "title_similarity": "0.65552163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0seai",
            "score": 1,
            "text": "Sounds like someone is about \"commit suicide\"",
            "title_similarity": "0.27212518",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hs0smq9",
            "score": 1,
            "text": "My bet: Dies quietly in committee.",
            "title_similarity": "0.38733017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0stgq",
            "score": 1,
            "text": "I'm just sick that these constituents are privy to insider information,  the worst part of it they sign legislation that screws the main population.    You wanna be rich?   Run for a place in government.",
            "title_similarity": "0.5501572",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hs0t0km",
            "score": 1,
            "text": "Looks like someone wants to get re-elected.\n\nGood on Jon.",
            "title_similarity": "0.33709502",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hs0t0ym",
            "score": 1,
            "text": "Absolutely based.",
            "title_similarity": "-0.04805778",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0t3l6",
            "score": 1,
            "text": "Why is he trying to curb the great mama bear's right to participate the in the free market?",
            "title_similarity": "0.59316397",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hs0te8h",
            "score": 1,
            "text": "It'll probably die but it'll also force people on record.",
            "title_similarity": "0.34229994",
            "sentiment_compound": -0.3506
        },
        {
            "id": "hs0tn7f",
            "score": 1,
            "text": "Good. Finally. Now let’s work on Lobbyists and kickbacks.",
            "title_similarity": "0.4462642",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0tq72",
            "score": 1,
            "text": "Im Genuinely curious what any Republicans think about. In favor or against and why?",
            "title_similarity": "0.4139641",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hs0tsi6",
            "score": 1,
            "text": "Good luck with that, also let's try and pass a bill to lower congressional pay",
            "title_similarity": "0.5869688",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hs0ttaf",
            "score": 1,
            "text": "Ever since I can remember we hear about day light savings being fixed too. I’ll hear about this until the day I die. Shit system.",
            "title_similarity": "0.37427765",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hs0uhtf",
            "score": 1,
            "text": "Nice thought but, it'll never pass.",
            "title_similarity": "0.19873112",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hs0ux76",
            "score": 1,
            "text": "Lol, Sisyphus at it again",
            "title_similarity": "0.10747814",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs0vqqd",
            "score": 1,
            "text": "It’s a good thing he’s not called jack lol",
            "title_similarity": "0.28084654",
            "sentiment_compound": 0.1451
        },
        {
            "id": "hs0wnta",
            "score": 1,
            "text": "Not gonna pass, but glad to see it get put forth. Now we need to name and shame all who voted against it.",
            "title_similarity": "0.4016601",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hs0wqjr",
            "score": 1,
            "text": "Do it and relax with https://youtu.be/YByqbpgePeo",
            "title_similarity": "0.11023162",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs0wtn6",
            "score": 1,
            "text": "For some reason I read John Ossoff as Joel Olsteen and was completely confused.",
            "title_similarity": "0.2850762",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hs0xfts",
            "score": 1,
            "text": "Just a publicity stunt. No one in either party really wants to give up their money making advantage. I do not bet on people voting against their own self interests",
            "title_similarity": "0.50442964",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hs0xkgs",
            "score": 1,
            "text": "Wow, finally something we can all get behind!",
            "title_similarity": "0.113767266",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hs0y8dk",
            "score": 1,
            "text": "I wish the whole country could do a referendum on issues like this. The politicians can't be trusted to make the decisions about themselves. We should be able to have a say beyond which old white man the public has voted for.",
            "title_similarity": "0.58841795",
            "sentiment_compound": 0.3911
        },
        {
            "id": "hs0ykr8",
            "score": 1,
            "text": "Nancy like 👀👀👀",
            "title_similarity": "0.011029295",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs0yyoj",
            "score": 1,
            "text": "GA did the entire country a favor by electing Ossoff and Warnock.",
            "title_similarity": "0.21219613",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs0z1xj",
            "score": 1,
            "text": "Me thinks the republi-cons would never support, much less propose, something like this.",
            "title_similarity": "0.46569166",
            "sentiment_compound": -0.0056
        },
        {
            "id": "hs0z6t7",
            "score": 1,
            "text": "They can just pass info on to their spouses; family members to trade stocks.",
            "title_similarity": "0.5275241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0zfpl",
            "score": 2,
            "text": "Republicans or Democrats, they snort the same coke off the same hooker's ass behind closed doors. How do we not see that?",
            "title_similarity": "0.43067688",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs0zfzi",
            "score": 1,
            "text": "hero! get it passed and run for President",
            "title_similarity": "0.43952918",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hs0znog",
            "score": 1,
            "text": "Would this also bar spouses?",
            "title_similarity": "0.27872893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs0znu4",
            "score": 1,
            "text": "Like asking the hen house manager, Mr. Fox, to give up chicken.",
            "title_similarity": "0.54106593",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs0zo84",
            "score": 1,
            "text": "Left and Right agree on this, correct?",
            "title_similarity": "0.036469195",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs103gg",
            "score": 1,
            "text": "So what is the loophole he is looking to exploit that requires the term \"individual stocks\" instead of just \"stocks\" period?",
            "title_similarity": "0.5470809",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hs105hy",
            "score": 1,
            "text": "Classic strategy. Introduce DOA Bill that he can use to claim to be on the left. This world sucks.",
            "title_similarity": "0.52834094",
            "sentiment_compound": -0.7603
        },
        {
            "id": "hs1088b",
            "score": 1,
            "text": "if this goes through, those who vote against this bill should be put to shame and taken out of office.",
            "title_similarity": "0.52691174",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hs10ldl",
            "score": 2,
            "text": "Get ready for bipartisanship- when they all laugh it out of the chamber",
            "title_similarity": "0.382025",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hs10mko",
            "score": 1,
            "text": "Jon Ossoff is an absolute unit.",
            "title_similarity": "0.103588164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs10mz4",
            "score": 1,
            "text": "Everyone should live stream this to everyone they know.",
            "title_similarity": "0.08131549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs10x1w",
            "score": 2,
            "text": "Fucking finally!! The greatest stock traders in the world are our politicians. Let that sink in…",
            "title_similarity": "0.49770978",
            "sentiment_compound": 0.7225
        },
        {
            "id": "hs10ygh",
            "score": 1,
            "text": "I wonder if they would have more success if they argue that their trades should just be posted publicly immediately upon purchase",
            "title_similarity": "0.47581398",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hs10zqq",
            "score": 1,
            "text": "Hey y’all I think we can all agree, regardless of which side of the aisle we sit on, that this is a good bill. Let’s call our congressional reps and tell them we want them to pass this.",
            "title_similarity": "0.43449146",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hs117xg",
            "score": 1,
            "text": "Welp. Someone's about to get JDK'd.",
            "title_similarity": "0.2572194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs11knn",
            "score": 1,
            "text": "Appreciate the effort even though we all know this bill is going no where.",
            "title_similarity": "0.2085301",
            "sentiment_compound": 0.128
        },
        {
            "id": "hs11n62",
            "score": 1,
            "text": "How about a bill to address Climate Change?",
            "title_similarity": "0.54139286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs11udx",
            "score": 1,
            "text": "Awesome! now do term limits too.",
            "title_similarity": "0.11409829",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hs11v9u",
            "score": 1,
            "text": "if this doesnt pass we need to primary every single member of congress",
            "title_similarity": "0.5320716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1223i",
            "score": 1,
            "text": "Finally something both party will agree on hahaha",
            "title_similarity": "-0.0024119578",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hs128cy",
            "score": 1,
            "text": "Won't they just get some1 else to invest it for them?",
            "title_similarity": "0.40894967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1293k",
            "score": 1,
            "text": "Nah let them, just introduce a bill to enable yearly independent and in-depth audits of every single member of congresses financials and if it is found that they are abusing their position or power for independent gain then they are stripped of all privileges and locked away for 20 years minimum no parole.\n\nYou get elected to serve the country and people you're a public servant, start acting like one.",
            "title_similarity": "0.66333365",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs12hqb",
            "score": 1,
            "text": "1000% for this!",
            "title_similarity": "0.1327666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs12izf",
            "score": 1,
            "text": "Nancy did NOT like that! Good work Ossoff",
            "title_similarity": "0.10009617",
            "sentiment_compound": -0.587
        },
        {
            "id": "hs12r2v",
            "score": 2,
            "text": "What about the spouse?",
            "title_similarity": "0.20441645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs12tvm",
            "score": 1,
            "text": "Amazing. Georgia should be proud.",
            "title_similarity": "0.042512607",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hs12zuh",
            "score": 1,
            "text": "Lol letting Congress decide this is pointless.",
            "title_similarity": "0.49192435",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs1315y",
            "score": 1,
            "text": "I fully support this and am shocked/shamed this is not the standard already.",
            "title_similarity": "0.06727835",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hs132e2",
            "score": 1,
            "text": "That will go down like a fart in church.",
            "title_similarity": "0.37836754",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs136vu",
            "score": 1,
            "text": "This will fail. And then we will have a list of politicians to vote out based on who votes no.",
            "title_similarity": "0.6009979",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs13q3q",
            "score": 1,
            "text": "For sale one walk-in icecream freezer local pick up only San Fran area",
            "title_similarity": "0.40967423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs13wuq",
            "score": 1,
            "text": "How can we help get this through?",
            "title_similarity": "0.12537678",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs14076",
            "score": 1,
            "text": "OMG, will it get introduced?!\n\nBut, what if president Manchin or president Sinema don't approve? They've got all the power, it seems. That's the theatre we're suppose to believe, right?",
            "title_similarity": "0.50457925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1469l",
            "score": 2,
            "text": "This is fantastic. And it’s hard for any congressperson opposing it to defend their position. It’s not like they have know means to invest. They can invest in mutual funds, ETFs, etc. they just can’t trade in individual stocks. \n\nIn reality there is no investment advantage in picking your own stocks compared to, say, an index fund. Unless you have insider information, which would be either illegal or unethical.",
            "title_similarity": "0.62711096",
            "sentiment_compound": -0.8294
        },
        {
            "id": "hs148ks",
            "score": 1,
            "text": "Damn, looks like they need to share their information now with brothers, sisters etc now.\n\nUgh\n\nSo much work now!\n\nOr create their own etf fund.",
            "title_similarity": "0.36946487",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hs14buf",
            "score": 1,
            "text": "Yea right, I will believe it when I see it. Virtue signaling.",
            "title_similarity": "0.03801941",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs14nii",
            "score": 1,
            "text": "Sorry but (in the wild assumption this races through the house and senate) looks like they'll have to settle for high dividend index funds.\n\nI should probably go buy one of those before the price spikes...",
            "title_similarity": "0.6564549",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hs152h9",
            "score": 1,
            "text": "Honorable but let’s face it, no one in congress is gonna support earning less money for themselves. This system is so fucked.",
            "title_similarity": "0.49713665",
            "sentiment_compound": -0.786
        },
        {
            "id": "hs15m77",
            "score": 3,
            "text": "This will be a litmus test for corruption.",
            "title_similarity": "0.38361454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs16cbd",
            "score": 2,
            "text": "it wont mean anything if it doesn't include their families.",
            "title_similarity": "0.30655643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs16fkd",
            "score": 2,
            "text": "Lol theres a ZERO percent chance this goes through. I guarintee he doesnt even want it to go through and this is all performative as a fuck you to Pelosi. It should go through but not a fucking chance, this is America bro.",
            "title_similarity": "0.55807817",
            "sentiment_compound": -0.3391
        },
        {
            "id": "hs16fny",
            "score": 3,
            "text": "I hope it passes. It’s about time we stand up to corruption within our government.",
            "title_similarity": "0.51578814",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs16ht9",
            "score": 2,
            "text": "Being in a purple state actually puts him in a better position to try this. The Democratic party heads can't do anything about it because they desperately need Georgia.",
            "title_similarity": "0.38268417",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs16jrx",
            "score": 1,
            "text": "This will be a bipartisan complete vote down if it ever even makes it to the house. Literally 1 yea to 400 no. Guaranteed. There's not a single person there getting a huge amount of money from insider trading.",
            "title_similarity": "0.63700575",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hs16rxa",
            "score": 2,
            "text": "Something we can all agree on!",
            "title_similarity": "-0.1079362",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hs16tn2",
            "score": 1,
            "text": "So if something like this does pass, what’s stopping them from just giving that information to a trusted family member to handle it for them in an account under the family member’s name until they get out of office?",
            "title_similarity": "0.59807837",
            "sentiment_compound": 0.7693
        },
        {
            "id": "hs16wf5",
            "score": 1,
            "text": "Bet it all will never pass",
            "title_similarity": "0.21187015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs16wfo",
            "score": 1,
            "text": "The mere fact that we are surprised to see any of our representatives trying to do something righteous in the minds of the vast majority of the country, and especially the fact that we know it will fail, is more than enough reason for every able bodied person to be in the streets in protest of congress.",
            "title_similarity": "0.45926815",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hs176og",
            "score": 1,
            "text": "Ossitof is so cute",
            "title_similarity": "-0.122693494",
            "sentiment_compound": 0.5949
        },
        {
            "id": "hs17cnq",
            "score": 1,
            "text": "Won’t pass",
            "title_similarity": "0.17369846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs17j0b",
            "score": 1,
            "text": "Oh man my lying is in a job anymore!?!?!",
            "title_similarity": "0.27392134",
            "sentiment_compound": -0.6844
        },
        {
            "id": "hs17qpe",
            "score": 1,
            "text": "Ha, without a doubt, this is going to get shot down.",
            "title_similarity": "0.23072499",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hs17wwa",
            "score": 1,
            "text": "That bill is going to get voted down so hard,  they're going to have to pull it out of the swampy mud under the basement",
            "title_similarity": "0.46502703",
            "sentiment_compound": -0.2183
        },
        {
            "id": "hs184g0",
            "score": 2,
            "text": "He's my new hero. But this really needs to get dealt with. The fact that more congress people don't take it seriously show how little respect they have for voters.",
            "title_similarity": "0.5257038",
            "sentiment_compound": 0.7775
        },
        {
            "id": "hs185mv",
            "score": 1,
            "text": "Scary.",
            "title_similarity": "0.032460634",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hs19j5p",
            "score": 2,
            "text": "A bill being introduced does not really have any current implications on how things work. The bill still has to make it into law. For anyone here who's jumping to conclusions.",
            "title_similarity": "0.51480496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs19jyw",
            "score": 1,
            "text": "Alternate title: Sen. Jon Ossoff set to introduce bill he knows will never pass to score points with his constituency.",
            "title_similarity": "0.7360233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs19xcc",
            "score": 2,
            "text": "Watch most of Congress disapproval of the bill on both sides. It's so stupid that congress gets to decide their own rules, checks, and balances",
            "title_similarity": "0.57612085",
            "sentiment_compound": -0.656
        },
        {
            "id": "hs1a8ig",
            "score": 1,
            "text": "These people will never die because they get youth blood transfusions and heart transplants in addition to making sure their constituents can't read good.",
            "title_similarity": "0.3762314",
            "sentiment_compound": 0.8042
        },
        {
            "id": "hs1aa76",
            "score": 1,
            "text": "Bruh I thought that was the guy who played jim in the office lmao",
            "title_similarity": "0.3980173",
            "sentiment_compound": 0.743
        },
        {
            "id": "hs1af4w",
            "score": 1,
            "text": "Maybe then Pelosi will not take so much money from Pfizer.",
            "title_similarity": "0.5347612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1anez",
            "score": 2,
            "text": "Every us citizen should back this unless they work for a bank or corporation that values inside trading",
            "title_similarity": "0.59628147",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs1atvs",
            "score": 3,
            "text": "Does this include their family members?",
            "title_similarity": "0.1685867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1b33x",
            "score": 2,
            "text": "Pelosi will kill it in the house",
            "title_similarity": "0.48895043",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hs1b8mk",
            "score": 2,
            "text": "It'll fail, but God bless him for trying.",
            "title_similarity": "0.16000119",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hs1b9bj",
            "score": 3,
            "text": "The latest story in the ongoing list of “that wasn’t already illegal!? What the fuck!?”",
            "title_similarity": "0.28648132",
            "sentiment_compound": -0.6751
        },
        {
            "id": "hs1bqvt",
            "score": 2,
            "text": "About time. To bad it won't pass.",
            "title_similarity": "0.19289587",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hs1cjpj",
            "score": 1,
            "text": "its just for show",
            "title_similarity": "0.08008924",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1d10n",
            "score": 2,
            "text": "The rest of Congress: “lolno”",
            "title_similarity": "0.33484197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1ddbx",
            "score": 3,
            "text": "Guess what's not going to pass in the Senate.",
            "title_similarity": "0.6155392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1dzmj",
            "score": 3,
            "text": "Good luck with that! I agree but there's no way these politicians will give up their meal ticket.",
            "title_similarity": "0.4681453",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hs1e02n",
            "score": 1,
            "text": "Pelosi is a fucking genius. Come out against this bill that way Republicans become for it!",
            "title_similarity": "0.53356373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1eafm",
            "score": 1,
            "text": "Cheese",
            "title_similarity": "-0.027951282",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1efuz",
            "score": 3,
            "text": "While they are at it they should add term limits.",
            "title_similarity": "0.32957584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1f6i8",
            "score": 2,
            "text": "Good",
            "title_similarity": "-0.17711349",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs1f9ta",
            "score": 2,
            "text": "Very good news",
            "title_similarity": "-0.09565656",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hs1fjvs",
            "score": 3,
            "text": "Listen I think this is a great first step, but this issue are like drugs, we need to govern it closely and make sure members doesn’t trade because conflicts of possible bill can dramatically change the market, however they can get family members, friends, campaign contributors the same opportunities, how about we try to separate how much wealth has to do with current power dynamics, I don’t trust a business man to run my country life like I don’t trust my doctor to fix my plumbing on the weekends for fun, president is a temp job, no actual successful business man would need a temp job therefore not a good business man and def not fit for the temp job",
            "title_similarity": "0.6193173",
            "sentiment_compound": 0.9771
        },
        {
            "id": "hs1g0el",
            "score": 2,
            "text": "Pelosi gonna have him whacked",
            "title_similarity": "0.3341094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1gb2c",
            "score": 2,
            "text": "This shit won't go anywhere",
            "title_similarity": "0.21720663",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hs1h0vq",
            "score": 1,
            "text": "This should be on the midterm where everyone votes on. Majority of congress would never agree to this since they are scumbags",
            "title_similarity": "0.57503253",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hs1hvi0",
            "score": 1,
            "text": "Pelosi is crying blood 🩸.",
            "title_similarity": "0.1913088",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hs1j1fq",
            "score": 1,
            "text": "why would any senator support this lol this will never pass, because why would these greedy fucks ever take money out of their own pockets",
            "title_similarity": "0.57958275",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hs1j37j",
            "score": 1,
            "text": "I still don't quite get why so few people recognise allowing index funds is the obvious solution.",
            "title_similarity": "0.4047714",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hs1jkk4",
            "score": 1,
            "text": "I knew the only way this would happen is if a younger senator pushed it forward. The old heads ok both sides aren’t going to like this",
            "title_similarity": "0.5044241",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hs1jmyj",
            "score": 1,
            "text": "I watched an episode of 60 minutes where they question Nancy Pelosi about the legality/morality of congress inside trading.at the end i Looked at the date and was 11 years ago.\n\nDid americand Just noticed?",
            "title_similarity": "0.6093569",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1jw0l",
            "score": 2,
            "text": "Well if I'm glad for one thing - it's that Trump is gone (for now). Glad to see r/politics back to discussing policy again instead of just railing against that inflated shit stain for four years \"This is it guys he's going to jail this time!\" For a thousand days, like there won't be another, worse Trump coming. \n\nLet's see if we can keep this trend going and not revert back to that utterly pointless phase again.",
            "title_similarity": "0.56626946",
            "sentiment_compound": 0.8336
        },
        {
            "id": "hs1km1l",
            "score": 2,
            "text": "I assume this is pretty unpopular among his peers?",
            "title_similarity": "0.332206",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hs1kzor",
            "score": 1,
            "text": "Why is everyone excited? It's not gonna ever get passed.",
            "title_similarity": "0.19370738",
            "sentiment_compound": 0.34
        },
        {
            "id": "hs1l1ov",
            "score": 1,
            "text": "Voting has zero impact unless you’re rich",
            "title_similarity": "0.35265493",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hs1lgmc",
            "score": 1,
            "text": "Allowing legislators to trade in stocks which values are often directly tied to the legislators' decisions is literally allowing textbook insider trading.\n\nIf I am personally heavily invested in a certain business, why on Earth would I vote towards anything which hurts that investment; or knowing that a vote will hurt my investment, why would I not sell before it taking place?\n\nNo matter how you twist and turn, allowing legislators to trade in any stock is absolutely absurd.",
            "title_similarity": "0.693206",
            "sentiment_compound": -0.4164
        },
        {
            "id": "hs1lk4j",
            "score": 1,
            "text": "Wow. I don't really care for the guy, but I very much like this proposal.\n\nEdit: does this include spouses?",
            "title_similarity": "0.3137129",
            "sentiment_compound": 0.6304
        },
        {
            "id": "hs1lmwx",
            "score": 1,
            "text": "Anyone buying $ATER here? 🐊🐊🐊🐊🐊🐊",
            "title_similarity": "0.37304413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1lpi1",
            "score": 2,
            "text": "It will be one of those bills that McConnell will intentionally lose.  He is the fox watching the chicken coop.  He's not going to get behind anything that doesn't benefit him personally.",
            "title_similarity": "0.507749",
            "sentiment_compound": -0.6346
        },
        {
            "id": "hs1m19t",
            "score": 1,
            "text": "Agreed 💯",
            "title_similarity": "-0.07321287",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hs1mauv",
            "score": 1,
            "text": "It's a great idea going no where fast",
            "title_similarity": "0.04075185",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs1n5ed",
            "score": 1,
            "text": "Hopefully it works, this is a conflict of interest, otherwise, especially with how America is already basically ruled by corporations (NRA forcing guns everywhere and no chance of doing anything about the constant shootings, medical companies forcing patients to pay for treatment instead of it being free like in other countries, etc).\n\nPlus it'll make vocal anti-vax idiot Marjorie Taylor Greene give up her shares in three separate vaccine companies.\n\nLike, we saw a national scandal late last year when the Conservative Party tried to defend a politician against accusations of using his side job as a lobbyist to get a specific company a government deal. Caused public outrage and that politician was forced to step down from politics and a by-election held to replace him (which the Liberal Democrats won, after the seat had been held by the Conservatives for 200 years prior).",
            "title_similarity": "0.68597937",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hs1nq85",
            "score": 1,
            "text": "Will this extend to family members?",
            "title_similarity": "0.16491032",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hs1nvcg",
            "score": 1,
            "text": "You'd get gun control passed before you go something like this. Empty gestures.",
            "title_similarity": "0.47761783",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hs1o30e",
            "score": 1,
            "text": "It is very clear where the public stands, let's see if we actually have representation",
            "title_similarity": "0.1669503",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hs1ot4g",
            "score": 1,
            "text": "Looks like the lobbyists have to back to cash",
            "title_similarity": "0.52355385",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs1pc3s",
            "score": 3,
            "text": "The problem is literally boomer democrats not wanting to hand over the reigns. We can't get any good ideas on the table because they don't want to move over. Nancy needs to go. She looks crooked.",
            "title_similarity": "0.477009",
            "sentiment_compound": -0.7879
        },
        {
            "id": "hs1pe0r",
            "score": 1,
            "text": "Finally we’ll see a bipartisan vote",
            "title_similarity": "0.38870507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1phj9",
            "score": 1,
            "text": "Trading stocks based on inside information is already a crime.   Owning stocks is not an ethical issue at all.  All successful people own stocks and other investments.  and most people who run for  congress or senate are either wealthy or have the ability to raise a lot of money.   \n If a congressman is heavily invested in a company which might rise or fall from a particular vote, then he/she need only recuse.   So the merit of this idea depends on what he means by \"trading individual stocks\".",
            "title_similarity": "0.59593815",
            "sentiment_compound": 0.668
        },
        {
            "id": "hs1pqi9",
            "score": 1,
            "text": "Good luck with that, Jon!!",
            "title_similarity": "-0.008961982",
            "sentiment_compound": 0.7568
        },
        {
            "id": "hs1pt79",
            "score": 2,
            "text": "“Introduce.” \n\n“For the fifth time, why are you up?”",
            "title_similarity": "0.2222109",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1q8ty",
            "score": 6,
            "text": "The only thing Dems and Republicans will agree on this year is killing this bill.",
            "title_similarity": "0.574849",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hs1qktw",
            "score": 1,
            "text": "May I introduce you to things they like",
            "title_similarity": "0.027261226",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs1qsyg",
            "score": 1,
            "text": "notice he only talks abut trading individual stocks. and notice there is already a law against insider trading and that Osoff's GOP opponent in GA was charged with insider trading of stocks.   Therefore this in no way is about Bernie anti wealth attitudes, nor does it clash in any way with Pelosi's position.  She is against trading stocks too. It depends on how and why. If you re merely selling a stock to raise some cash to do something with, no problem. But if you come out of a closed door session and get on the phone to your broker based on insider info that is already a crime.",
            "title_similarity": "0.7187445",
            "sentiment_compound": -0.6879
        },
        {
            "id": "hs1r3ir",
            "score": 1,
            "text": "Can’t wait to see AOC twist herself into a pretzel defending Mama Bear Pelosi. Should be interesting.",
            "title_similarity": "0.3409657",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs1rtuj",
            "score": 1,
            "text": "Nice. Now for this to never be brought up again.",
            "title_similarity": "0.26690668",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs1s90k",
            "score": 1,
            "text": "And their spouse shouldn’t either",
            "title_similarity": "0.25580737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1si56",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.040295318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1snnd",
            "score": 1,
            "text": "So some company is going to make an index fund that is only made up of the individual stocks that congress members want in it.",
            "title_similarity": "0.73666954",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hs1t64q",
            "score": 2,
            "text": "Pelosi’s husband not gonna let that bill fly.",
            "title_similarity": "0.614071",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1tbxx",
            "score": 1,
            "text": "Yea this will go over like a trump insurrection…",
            "title_similarity": "0.41339296",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs1tnw6",
            "score": 1,
            "text": "Hey Les he won’t survive the midterms. Only reason he’s doing this. I don’t like Ossoff, but I respect this play and hope it succeeds.",
            "title_similarity": "0.35172945",
            "sentiment_compound": 0.9564
        },
        {
            "id": "hs1u4qh",
            "score": 1,
            "text": "We’re talking about the same body that destroyed our healthcare by letting big pharma run rampant. We’re ranked #63 in the world on healthcare but spend 1.5 trillion more than #1 (after scaling for population). Good luck getting this bill passed with these crooks.",
            "title_similarity": "0.52126575",
            "sentiment_compound": 0.775
        },
        {
            "id": "hs1ub0y",
            "score": 1,
            "text": "man i fucking love jon ossoff",
            "title_similarity": "0.090016514",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hs1uhzd",
            "score": 3,
            "text": "Yeah yeah yeah. When it actually gets passed into full effect. Let me know about it.",
            "title_similarity": "0.13630557",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hs1uocr",
            "score": 1,
            "text": "And suddenly for no reason at all, Jon Ossoff killed himself",
            "title_similarity": "0.26817876",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hs1vzwm",
            "score": 1,
            "text": "Good. So sick of the fucking corruption.",
            "title_similarity": "0.23100162",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hs1w9lt",
            "score": 1,
            "text": "Georgia, you guys did good.",
            "title_similarity": "-0.025310514",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs1wcla",
            "score": 3,
            "text": "Quick question: if banned - wouldn't politicians just use a proxy to invest? Such as a Family member or start a company that purchases stocks and hold them on their behalf?",
            "title_similarity": "0.75992215",
            "sentiment_compound": -0.5204
        },
        {
            "id": "hs1wcuu",
            "score": 2,
            "text": "An idea I believe anyone not in congress, will be behind, which is a rarity on its own.",
            "title_similarity": "0.43925172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1wy0c",
            "score": 2,
            "text": "Yes, that's great and all, but what about treir spouses, children, parents, children (18+).\nIf the bill passes, this would just become a game on how to use anyone around them to still make a profit.",
            "title_similarity": "0.4103313",
            "sentiment_compound": 0.8047
        },
        {
            "id": "hs1x27f",
            "score": 2,
            "text": "Pelosi will block it in the House",
            "title_similarity": "0.52116036",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hs1xcm3",
            "score": 1,
            "text": "who care. congressman will find loopholes",
            "title_similarity": "0.4582161",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hs1y0oe",
            "score": 1,
            "text": "What about their privately held corporations?",
            "title_similarity": "0.4499324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs1yhsm",
            "score": 1,
            "text": "Good NO a member of the house or senate including family members should be allows to invest in stocks while in power",
            "title_similarity": "0.7719738",
            "sentiment_compound": -0.0085
        },
        {
            "id": "hs1ywhk",
            "score": 1,
            "text": "They will only find a loophole to continue trading through other means. They will vote against this bill just to avoid having to complicate what they already have",
            "title_similarity": "0.5715268",
            "sentiment_compound": -0.296
        },
        {
            "id": "hs1z5rp",
            "score": 1,
            "text": "The fact that this is a thing that needs to be discussed and has opposition (I mean of course it does) is ridiculous, its insider trading no matter how they want to spin it and covid and shit proved that, look how many sold off stock before the market turned for a bit.  Our political leaders shouldn't be able to have any stakes in companies at all while they are representing us.",
            "title_similarity": "0.65092695",
            "sentiment_compound": -0.7072
        },
        {
            "id": "hs1zx9g",
            "score": 1,
            "text": "Man I can't wait for this to pass and then we see the net worth of all the congressional spouses shoot straight up",
            "title_similarity": "0.43210036",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hs20ep3",
            "score": 1,
            "text": "If Congress won't vote to strip benefits from members who are convicted of corruption, the won't vote to stop this.",
            "title_similarity": "0.6315477",
            "sentiment_compound": 0.5405
        },
        {
            "id": "hs20or3",
            "score": 1,
            "text": "This will go nowhere. It's entirely right and ethical to ban such behavior and should have been done for the past two hundred years. But they all do it and it's a huge source of their financial benefit of being a politician. Some get voted in rich and some get voted in middle class but they all leave filthy rich. In the end the vast majority of them will vote it down to protect their self-interests.\n\nThey'll hide behind things like \"freedoms\" are for all people and if you can trade stock so should we.",
            "title_similarity": "0.55395764",
            "sentiment_compound": 0.9772
        },
        {
            "id": "hs20z6w",
            "score": 1,
            "text": "This is one thing I definitely disagree with Speaker Pelosi on, no stock trades for mocs. I would like to see a lot more divesting as well.",
            "title_similarity": "0.61412954",
            "sentiment_compound": 0.4144
        },
        {
            "id": "hs211mz",
            "score": 1,
            "text": "What will be upsetting about this isn't how both parties will ensure it fails. What's upsetting is that both parties' constituents will still vote for the congress members who make it fail in unchanged numbers. For it's not just Congress that doesn't care about morality, it's their loyal tribesmen as well.",
            "title_similarity": "0.49616376",
            "sentiment_compound": -0.7837
        },
        {
            "id": "hs21b5q",
            "score": 3,
            "text": "Nancy Pelosi is about to reject that shit like Mutombo in his prime… smh",
            "title_similarity": "0.528538",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hs21qek",
            "score": 1,
            "text": "I have been waiting for Ossoff to do something. Happy this was it and it will always be a big fuck you to Kelly Loeffler",
            "title_similarity": "0.19441485",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hs2234v",
            "score": 1,
            "text": "Wow  a senator with an actual backbone and cognitive resonance of morality.",
            "title_similarity": "0.31790125",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hs2293r",
            "score": 1,
            "text": "Normally I'm against more laws.  But I agree this should keep those crooks from making more money off of us common folks.",
            "title_similarity": "0.5051077",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hs22u8r",
            "score": 1,
            "text": "Can you say “term limits”. That is a sure way to eliminate entrenched congress people. Two terms and done. By introducing this bill, Ossoff is distancing himself from Pelosi in the eyes of Georgia voters.",
            "title_similarity": "0.65935385",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hs2335b",
            "score": 2,
            "text": "This will probably be the first and last time anyone hears about this bill. Just like the bi-partisan bill that introduced term limits. DOA and nobody realy heard about it. The people have the least amount of contril in this country.",
            "title_similarity": "0.53720534",
            "sentiment_compound": -0.368
        },
        {
            "id": "hs23al2",
            "score": 1,
            "text": "As unfair as it sounds, it should be done. I know one local business in my town that does major sewer work for our city. The owner, is no more dem than I am, because I know him. But because he gives money to the local party, and Dems are it, he gains.\n\nYou are asking them to vote on putting rules on themselves. Its a given that it's a big waste of time. They won't vote for it.",
            "title_similarity": "0.5599761",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hs25487",
            "score": 1,
            "text": "Did he do this to look good knowing it would never pass? \n\nSorry im becoming numb to all the politics.....",
            "title_similarity": "0.482268",
            "sentiment_compound": 0.1833
        },
        {
            "id": "hs25dt4",
            "score": 1,
            "text": "No boomer gonna vote for that",
            "title_similarity": "0.377267",
            "sentiment_compound": -0.296
        },
        {
            "id": "hs25h9z",
            "score": 2,
            "text": "Just say a member of congress is blocked from owning individual stocks. Does that mean their spouses or children also can’t own individual stock? How could that be constitutional? \n\nDon’t get me wrong, I’m all for blocking insider information benefiting these so called public servants.",
            "title_similarity": "0.76685536",
            "sentiment_compound": -0.7998
        },
        {
            "id": "hs261kl",
            "score": 1,
            "text": "Nancy Pelosi in shambles rn",
            "title_similarity": "0.21911095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs266ax",
            "score": 1,
            "text": "I work for a large finance company and I cannot buy individual stocks without clearance.  Government officials make the policies that cause price fluctuations.   It is ripe for insider trading",
            "title_similarity": "0.67045414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs26fnr",
            "score": 1,
            "text": "He must have already placed his orders",
            "title_similarity": "0.19510347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs26i14",
            "score": 1,
            "text": "Nancy won’t be happy about it.",
            "title_similarity": "0.26350552",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hs26ke7",
            "score": 1,
            "text": "Repeal Citizen United while you are at. He is great!!!!",
            "title_similarity": "0.19998893",
            "sentiment_compound": 0.8429
        },
        {
            "id": "hs26v4j",
            "score": 1,
            "text": "Pelosi shaking in her boots, as this should be law everywhere in the world…",
            "title_similarity": "0.34140408",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hs27dtj",
            "score": 1,
            "text": "I think any congress person against this should be recalled. There should be no reason we pay the salary of these morons, they get better Healthcare and other privileges they would never extend to their voters. And for them to have yet another leg up at keeping us down? Gaining loads of wealth while public schools fail harder than ever, people chose between getting their medications, food, or paying their rent. Is this the type of country we want to live in? Never voted republican, and certainly never voting Democrat again. Hate this two parties of idiots",
            "title_similarity": "0.5800172",
            "sentiment_compound": 0.5635
        },
        {
            "id": "hs27ia3",
            "score": 1,
            "text": "For this guy to stand up and say there shouldn’t be trading, yet he’s receiving dividends from stocks while a sitting member of the senate. He’s playing everyone.",
            "title_similarity": "0.6941811",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hs27iv7",
            "score": 2,
            "text": "It'll never pass, but at least we'll know who needs to be primaried.",
            "title_similarity": "0.31460756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs27owy",
            "score": 1,
            "text": "Looks like he found something he can make noise about. Haven’t heard anything from him here in GA since he was elected. Probably trying to move and out as soon as he can, can’t blame him.",
            "title_similarity": "0.4495687",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hs288gz",
            "score": 1,
            "text": "This is interesting",
            "title_similarity": "-0.12493557",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs29677",
            "score": 3,
            "text": "Wait for democrats to tell you they wish they could enact it if they only had control of both houses of Congress and the presidency.",
            "title_similarity": "0.62389404",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hs29bgt",
            "score": 2,
            "text": "Now we need an amendment banning political parties!",
            "title_similarity": "0.6075661",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hs29ss4",
            "score": 2,
            "text": "You'll see this article today and then never hear about this bill again because this will not pass ever lmao",
            "title_similarity": "0.5507337",
            "sentiment_compound": -0.4847
        },
        {
            "id": "hs2a8jk",
            "score": 2,
            "text": "That Pelosi thinks it's OK for House members to be buying and selling stocks while in office gives us all an example just how corrupt our government is.",
            "title_similarity": "0.6457766",
            "sentiment_compound": 0.4466
        },
        {
            "id": "hs2ce8w",
            "score": 1,
            "text": "I can see this getting 5,6, maybe even 10 votes in the Senate.",
            "title_similarity": "0.36394143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs2dee7",
            "score": 1,
            "text": "It’s already illegal",
            "title_similarity": "0.25875482",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hs2en4n",
            "score": 3,
            "text": "To be brutally honest, Members shouldn't even be allowed to run a business while in office. That's just opening up the door for illegal financing or creating laws to favor your business.",
            "title_similarity": "0.6783843",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hs2fffx",
            "score": 2,
            "text": "Long needed....you want to see who the criminals are in our government?... wait to see who votes against it.",
            "title_similarity": "0.6333593",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hs2g1tm",
            "score": 1,
            "text": "Cant wait for the freak out from our corrupt congress.",
            "title_similarity": "0.58577883",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hs2g3qv",
            "score": 1,
            "text": "I bet it goes through!",
            "title_similarity": "-0.0145660825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs2gqj9",
            "score": 1,
            "text": "Finally",
            "title_similarity": "-0.123934895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs2ju7x",
            "score": 1,
            "text": "I’ve got $200 on car accident",
            "title_similarity": "0.45522296",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hs2kce8",
            "score": 1,
            "text": "Really glad we elected this dude as our governor.",
            "title_similarity": "0.24835114",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hs2kn87",
            "score": 1,
            "text": "There’s gonna be second cousins third time removed getting a lot of insider information all of a sudden if this goes through",
            "title_similarity": "0.49059963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs2kvut",
            "score": 2,
            "text": "Contact your rep and tell them you want them to co-sponsor this! Going to do the same. Need to get around Pelosi (and obviously Republicans) to vote for this. I feel like I'll just receive some generic response, but it's better than nothing. Another reason imo why we need to unpack the house to so it's 1 rep per 50k people.",
            "title_similarity": "0.5442446",
            "sentiment_compound": 0.722
        },
        {
            "id": "hs2lrb9",
            "score": 1,
            "text": "See some good things come out of GA",
            "title_similarity": "-0.034060117",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hs2m3ra",
            "score": 1,
            "text": "Introducing a bill is easy.  Getting it passed is another matter entirely...",
            "title_similarity": "0.24622875",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hs2mbly",
            "score": 1,
            "text": "This bill is only like 50 years too late and is barely asking members to not be completely, over the top corrupt....even then it's highly doubtful it will pass. It's so ridiculous because it's total common sense, but the media and these elected scumbags would make you think you're on crazy pills by asking for the most basic, non-evil actions on their part.\n\nThis country is so utterly screwed, I mean the amount of systems and powers that are being corrupted DAILY is just mind boggling. The government is already just a sick version of itself and has been for some time, I can't even imagine what 10 years from now will lool like.\n\nOther things that are just as, and way more important than this one, teency, tiny bill:\nGerrymandering/Vote Suppression\nClimate Change/Destruction of our planet through pollution and resource exhaustion.\nRegulation of corporations/unfair tax cuts to the rich\nThe elimination of Fascism (Pretty much all facets) out of our government\nGetting money out of politics\nHealthcare for all citizens and increased social programs at all levels\n\n....this list could easily be 20 pages long and would barely scratch the surface.\n\nThis country has been cooking in it's own corrupt juices for decades now, and it's time to breathe in the aromas of worldwide collapse very soon. Our species doesn't deserve this place, it's overcrowded, polluted, and humanity has squandered all of it's potential in order to prop up a system that benefits only a select few.\n\nTLDR: This tiny little bill has a snowballs chance in hell of passing because Congress will vote against it, and its miles off from the real work of doing any significant changes to the broken system at large. This country is a shadow of itself and will soon collapse from the strain of corruption. Sadly, we're all in it together and those who have abused it the longest will experience the least of the problems.",
            "title_similarity": "0.52181417",
            "sentiment_compound": -0.9844
        },
        {
            "id": "hs2mvcd",
            "score": 1,
            "text": "Shouldn't this be something everyone agrees on? What's the downside of this for the right besides also participating in congressional corruption?",
            "title_similarity": "0.49069798",
            "sentiment_compound": -0.1431
        },
        {
            "id": "hs2oiw6",
            "score": 1,
            "text": "Wasn’t it originally like this? Wasn’t the whole point of American politics to keep politicians from using the system to get rich? Isn’t that part of why this country was founded? To not be like every other friggen civilization of the past?",
            "title_similarity": "0.65541065",
            "sentiment_compound": 0.714
        },
        {
            "id": "hs2pdro",
            "score": 1,
            "text": "Dear US citizens,\n\nTHIS IS HUGE. Please don't argue about jon ossoff or why he is red or blue or whatever. Please realize what is wrong with all the conflicts of interests within your congress and theire insider trading.\n\nI'm not from the US(germany) but this is a great bill and a great step in the right direction.",
            "title_similarity": "0.6223877",
            "sentiment_compound": 0.9484
        },
        {
            "id": "hs2q66g",
            "score": 1,
            "text": "godspeed.",
            "title_similarity": "-0.06957112",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs2q7l2",
            "score": 1,
            "text": "This might not even stop close family member from trading, since Pelosi likes to say that her husband does all the trading.",
            "title_similarity": "0.4549031",
            "sentiment_compound": 0.5702
        },
        {
            "id": "hs2s4y6",
            "score": 1,
            "text": "Pelosi would never bring this bill to the floor if it somehow passes in the senate. Pelosi's obstruction would make Mitch McConnell's obstruction look like absolute child's play to protect her own interests.\n\nAlso, let me add that aside from giving hundreds of billions of dollars to the military every year, inside trading is the most bipartisan act in congress.",
            "title_similarity": "0.7019594",
            "sentiment_compound": 0.872
        },
        {
            "id": "hs2tskd",
            "score": 1,
            "text": "Yes!!!",
            "title_similarity": "-0.11371771",
            "sentiment_compound": 0.5538
        },
        {
            "id": "hs2vgj2",
            "score": 1,
            "text": "As usual the progressives will try to save the establishment dems from their own political suicide. But the bill will go nowhere, Democrats will remain the face of corruption because Pelosi stupidly decided to make a firm stance on **this** of all things, and when we get trounced in the midterms somehow that will be the fault of the progressives that weren't allowed to prevent it.",
            "title_similarity": "0.60682917",
            "sentiment_compound": -0.8523
        },
        {
            "id": "hs2vne1",
            "score": 1,
            "text": "My girls dad is 74 and there is no way is hell, i would let him run anything. Nope.",
            "title_similarity": "0.39088452",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hs30mra",
            "score": 1,
            "text": "Could somebody correct me? I somehow was under the impression Warren tried the same thing and it was immediately shot down...",
            "title_similarity": "0.37624213",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hs32ftj",
            "score": 1,
            "text": "Spoiler alert, they’re just going to pass relevant information to family members and reap benefits in a tertiary fashion.",
            "title_similarity": "0.29583058",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hs34euh",
            "score": 2,
            "text": "So they are going to create a law because the current one (Stock Act) is being ignored?  Hmmm",
            "title_similarity": "0.69578016",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hs38nhe",
            "score": 1,
            "text": "Hopefully Pelosi doesn’t kill this one upon arrival",
            "title_similarity": "0.47263747",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hs3c6ul",
            "score": 2,
            "text": "WHY hasn't it been illegal? It is so obvious it should be.!!!",
            "title_similarity": "0.26744878",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hs3cjoo",
            "score": 1,
            "text": "Guess who won't be winning come midterms",
            "title_similarity": "0.3543539",
            "sentiment_compound": -0.4168
        },
        {
            "id": "hs3erh6",
            "score": 1,
            "text": "My guy",
            "title_similarity": "0.08795428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs3f7wk",
            "score": 1,
            "text": "People in public office wasn’t suppose to contribute to wealth. Which is why congress and senate were\npart time positions, members only assembling for votes and going back to their lives working in the community. \n\nThe fact that members of senate and congress become millionaires off the backs of the American people is pathetic.",
            "title_similarity": "0.58447224",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hs3fb9k",
            "score": 1,
            "text": "This should be a given but wtf! It is okay for them to do whatever they like but we the people go to jail! Did you know that they the congress do not have to follow the same rules as the rest of us! That right there is so wrong’",
            "title_similarity": "0.51680106",
            "sentiment_compound": -0.3561
        },
        {
            "id": "hs3g6ih",
            "score": 1,
            "text": "Pelosi won’t let this get to the floor. Partly because she knows a handful of democrats will vote against this, and that’s not a good look in a midterm year.",
            "title_similarity": "0.5941497",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hs3gov2",
            "score": 1,
            "text": "But if they bar members of Congress from trading, where will I get my stock picks?",
            "title_similarity": "0.81968653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs3ijf9",
            "score": 2,
            "text": "Give this man a metal for even proposing the deal. Dead man walking…",
            "title_similarity": "0.45569608",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hs3n476",
            "score": 1,
            "text": "I think they should do what President Carter did and cash out before holding office. You’re making six figures in Congress you can do without stock gains or losses.",
            "title_similarity": "0.6225282",
            "sentiment_compound": -0.577
        },
        {
            "id": "hs3pbiw",
            "score": 1,
            "text": "Why nothing ever gets done:  \n𝗖𝗢𝗡𝗚𝗥𝗘𝗦𝗦 𝗪𝗔𝗦𝗧𝗘𝗗 𝗡𝗢 𝗧𝗜𝗠𝗘 𝗖𝗔𝗦𝗛𝗜𝗡𝗚 𝗜𝗡  \n[Cashing in on the Pandemic](https://www.commondreams.org/news/2020/04/30/cashing-pandemic-documents-show-lawmakers-made-1500-stock-transactions-worth-158?cd-origin=rss&utm_term=AO&utm_campaign=Daily%20Newsletter&utm_content=email&utm_source=Daily%20Newsletter&utm_medium=Email)",
            "title_similarity": "0.6369621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs3q6nk",
            "score": 1,
            "text": "Finally!\n\nIt's going to be eye-opening too see how it's actually voted upon.",
            "title_similarity": "0.24470705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs3vkg4",
            "score": 1,
            "text": "Won’t matter if their spouses are allowed to trade freely as well. They should be subject to the same FinRa regulations as all licensed traders and their family members are held to.",
            "title_similarity": "0.38935643",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hs3wmvb",
            "score": 1,
            "text": "Introducing a bill to Congress that effects Congress and asking them to NOT be selfish when they vote? Yeah this'll work.",
            "title_similarity": "0.6798123",
            "sentiment_compound": 0.5795
        },
        {
            "id": "hs40hbq",
            "score": 1,
            "text": "This is a nice token but it will go no where and serves to only up potential cred with progressive voters. If there was a situation in which there was enough votes to actually pass this and Ossoff introduced this bill then it would mean a lot more.",
            "title_similarity": "0.4613997",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hs44kmi",
            "score": 1,
            "text": "Fuck yeah!",
            "title_similarity": "0.009795438",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hs4detf",
            "score": 1,
            "text": "How about like...all stocks?",
            "title_similarity": "0.39365417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs4g6pd",
            "score": 1,
            "text": "I doubt this would pass, but it'll he interesting to see who supports it.",
            "title_similarity": "0.23920205",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hs4iyks",
            "score": 1,
            "text": "Lol things that will never ever ever … ever ever happen",
            "title_similarity": "0.22804007",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hs4r5ge",
            "score": 1,
            "text": "How they gonna make it look like they are for it while striking it down I wonder.",
            "title_similarity": "0.26866284",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hs4yva1",
            "score": 1,
            "text": "How do you look up how your sitting congress member voted on this bill? Any votes against it are a non starter, I will not vote them back into office.",
            "title_similarity": "0.75342417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs7ou3k",
            "score": 1,
            "text": "Can we please just get fucking universal health insurance.",
            "title_similarity": "0.3685103",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hs81ezo",
            "score": 1,
            "text": "Members of Congress, their families, their pets, and anyone with close ties to them. I mean look at the Biden’s… Joe just gets his son to hold all the money and doles it out to him when he needs it. Pretty sure Nancy will just get her uncle brother cousin to do all the trading. These politicians need to be put under extreme scrutiny by the US Marshalls. How about Nancy using taxpayer money for family vacations around the world with secret service security everywhere.",
            "title_similarity": "0.61747205",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hs90a6h",
            "score": 1,
            "text": "Good! It’ll get shot down but make those sumbitches go on the official record voting against it.",
            "title_similarity": "0.5018208",
            "sentiment_compound": 0.3054
        },
        {
            "id": "hsg2lj0",
            "score": 1,
            "text": "Ban pfof they all have a spouse or other close family member",
            "title_similarity": "0.119390205",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hsjsklh",
            "score": 1,
            "text": "Is there a way to examine a members net worth year over year?  I mean, if a member has been in congress for 12 years I’m sure they are significantly more wealthy then when they entered.",
            "title_similarity": "0.3901213",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hslwb5g",
            "score": 1,
            "text": "Grandma Nancy isn't going to like this!",
            "title_similarity": "0.25425947",
            "sentiment_compound": -0.3404
        },
        {
            "id": "hsmcxjs",
            "score": 1,
            "text": "It would be a start.",
            "title_similarity": "-0.028361585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hsx9if1",
            "score": 1,
            "text": "Ossof will now be on Pelosis radar … he will be ousted …",
            "title_similarity": "0.492176",
            "sentiment_compound": 0.0
        },
        {
            "id": "huehtlb",
            "score": 2,
            "text": "Is it just me or does anyone else think this is going to actually prevent them from trading? They'll have family members in trusts do it for them",
            "title_similarity": "0.555472",
            "sentiment_compound": 0.4939
        }
    ]
}