{
    "Trump White House records are now in the hands of Jan 6 committee\n": [
        {
            "id": "htmbtwu",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.28733405",
            "sentiment_compound": -0.9108
        },
        {
            "id": "htmx4sn",
            "score": 6,
            "text": "I’m too damn old now to believe The Democrats will successfully weaponize any of this for this election cycle, though. Their top donors don’t seem too concerned with fascism.",
            "title_similarity": "0.3336641",
            "sentiment_compound": 0.3182
        },
        {
            "id": "html4la",
            "score": 78,
            "text": "Next headline, Jan 6 committee is now being handed the documents. \n\n\nNext headline, Jan 6 committee is now opening the folder. \n\nNext headline, Jan 6 committee is now taking a lunch break before reading it. \n\n\nJesus fucking Christ just let us know when anything actually happens that means anything.",
            "title_similarity": "0.38477585",
            "sentiment_compound": 0.0
        },
        {
            "id": "htngo2e",
            "score": 0,
            "text": "I can't wait for absolutely nothing to come off this!",
            "title_similarity": "0.20990664",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmzho8",
            "score": -24,
            "text": "Once again, nothing will come from this… nothing ever does",
            "title_similarity": "0.15119943",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn6o6q",
            "score": 1,
            "text": "And nothing will come of this because that would mean a POS like Trump is held accountable.  There is no accountability for the American 1%.",
            "title_similarity": "0.35931528",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htmmvgl",
            "score": 5,
            "text": "Well that can’t be true. I was told by angry online Leftists that the Democrats were weak and ineffectual and just as corrupt as the fascists. This looks too much like a productive pursuit of justice. Fake news.\n\n^^/s ^^obviously",
            "title_similarity": "0.21361926",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htmjpdz",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htnido7",
            "score": 0,
            "text": "I’m legit tired of any and all headlines about the Trumps being in trouble. Do something, charge someone! The longer any of these cases go, the more likely they will skate off to the next grift and eventually the next insurrection.",
            "title_similarity": "0.3107089",
            "sentiment_compound": -0.7088
        },
        {
            "id": "htmlyl5",
            "score": 8,
            "text": "yay! now how long do we have to wait till we're massively disappointed about how nothing is happening and we accept that we are one step closer to full blown ethno-religious fascism in the US?",
            "title_similarity": "0.28305107",
            "sentiment_compound": 0.4926
        },
        {
            "id": "htnnkf8",
            "score": 3,
            "text": "\"The walls are closing in on Trump. Bwahaha.\"\n\n-- Rachel Maddow, 2016, 2017, 2018, 2019, 2020, 2021, 2022",
            "title_similarity": "0.61447597",
            "sentiment_compound": 0.1027
        },
        {
            "id": "htnhreo",
            "score": 0,
            "text": "I haven’t been this excited since the Mueller probe, And the Stormy Daniels payoff. Third times a charm.",
            "title_similarity": "0.32504177",
            "sentiment_compound": 0.6652
        },
        {
            "id": "htox2hd",
            "score": -1,
            "text": "Who wont do a fuckin thing.",
            "title_similarity": "0.10066633",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoqjwx",
            "score": 1,
            "text": "We can all be comforted by the fact that nothing of consequence will happen as a result of this.",
            "title_similarity": "0.16268253",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htmm7z1",
            "score": 4,
            "text": "So when can we see them? \n\nActually when the fuck is the committee going to publish anything? By 2022 its looking like they might close this shit down without releasing crap...",
            "title_similarity": "0.50747514",
            "sentiment_compound": -0.6626
        },
        {
            "id": "htmcjqj",
            "score": 9,
            "text": "There's bound to be some good info in there on the **Bloat Bleepers** and their terrorist attack on our Capitol.\n\nStrange how that topic is forbidden here.",
            "title_similarity": "0.41174668",
            "sentiment_compound": -0.8591
        },
        {
            "id": "htn1ojf",
            "score": -6,
            "text": "I can't wait for absolutely nothing to come of this.\n\nI really hope I'm wrong.",
            "title_similarity": "0.13349655",
            "sentiment_compound": -0.044
        },
        {
            "id": "htnfyaf",
            "score": 4,
            "text": "After the Mueller blueballing, I'm going to expect nothing, except to be disappointed.",
            "title_similarity": "0.21015616",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htogwob",
            "score": -2,
            "text": "To everyone complaining nothing ever happens from stuff like this, maybe it's because every tiny thing that happens involving your orange boogeyman gets a sensationalized article, 50 reddit awards, and 100k upvotes. Then you all think \"IT'S HAPPENING!!\" Then you realize this sub is just as dramatic as CNN and doesn't report on news but rather whatever headline sounds best and they usually turn out to be hot garbage.",
            "title_similarity": "0.28089526",
            "sentiment_compound": 0.8669
        },
        {
            "id": "htnixcw",
            "score": 0,
            "text": "Can’t wait to see nothing happen\n\n /s",
            "title_similarity": "0.18732698",
            "sentiment_compound": 0.0
        },
        {
            "id": "htockpu",
            "score": 0,
            "text": "Trump may have to show records but that opens up Obama, Clinton and Bush also. Lol",
            "title_similarity": "0.5200809",
            "sentiment_compound": 0.5719
        },
        {
            "id": "htpinm1",
            "score": 0,
            "text": "It’s sad anyone in the world thinks anything will come of it",
            "title_similarity": "0.092053324",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htme8lc",
            "score": 1,
            "text": "Hey, Trump's White House records are now in the hands of the Jan 6 committee! I'm sure they'll have a lot of fun going through them!",
            "title_similarity": "0.7093786",
            "sentiment_compound": 0.7339
        },
        {
            "id": "htmhamf",
            "score": 2,
            "text": "I'm sure those records are not much more than \"hamberder\" receipts and cut up magazine photos.",
            "title_similarity": "0.2791556",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htmuxsb",
            "score": 2,
            "text": "Prepare for anti anti trump liars making excuses and drawing false equivalences with previous elections and reactions to them. The federalist crowd.",
            "title_similarity": "0.415973",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hto21g7",
            "score": 1,
            "text": "And nothing will be done.  Get back to me when things are actually being done.",
            "title_similarity": "0.29358783",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoaqwk",
            "score": -1,
            "text": "Anddd as per usual, nothing will come out of it. Been hearing for years now….Robert Mueller, Letitia James, Merrick Garland all working on convicting trumps and his cronies. What are we waiting for? His death? All bullcrap",
            "title_similarity": "0.40640122",
            "sentiment_compound": -0.644
        },
        {
            "id": "htn92y5",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htnkjmj",
            "score": -7,
            "text": "who fucking cares nothing is going to happen to him US presidents are safe from prosecution forever",
            "title_similarity": "0.3496774",
            "sentiment_compound": 0.4576
        },
        {
            "id": "htot006",
            "score": 1,
            "text": "Trump supporter or not, you’ve gotta be sick of reading this sensationalized filler crap.",
            "title_similarity": "0.2698292",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htpdglq",
            "score": 0,
            "text": "Absolutely nothing of any consequence will happen. A travesty.",
            "title_similarity": "0.14245597",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htpdnpa",
            "score": 0,
            "text": "And not a goddamned thing will happen, to any of them.\n\nI hope I'm proven wrong but it just seems that we can't have nice things.",
            "title_similarity": "0.12532027",
            "sentiment_compound": -0.3468
        },
        {
            "id": "htpkg2m",
            "score": 0,
            "text": "Nothing will come of this…again.",
            "title_similarity": "0.16239956",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpnkld",
            "score": 0,
            "text": "SERIOUS QUESTION: What is the Republicans version of Reddit? It seems that all of the top comments seem to be aligned with believing J6 was bad and Trump’s hands are not entirely clean in his promotion of it. But ~75 Million Americans voted for Trump in 2020 which was almost half of the people that turned out. I know not all Trump voters support storming the US capitol nor do they believe he is innocent. However, if only 10% of his followers are on the “they wish they were there holding hands with the dude in the buffalo horns” camp thats still 7.5 million people. Where are these people posting comments and articles between each other validating each others mutual biases without confrontation? What is their version of reddit?\n\nEdit: Fixed typos",
            "title_similarity": "0.41379917",
            "sentiment_compound": 0.9213
        },
        {
            "id": "htppwna",
            "score": 0,
            "text": "Kamala Harris said that January 6th was comparable to Pearl Harbor and 9/11.",
            "title_similarity": "0.5734163",
            "sentiment_compound": 0.0
        },
        {
            "id": "htprsd7",
            "score": 0,
            "text": "And nothing will happen",
            "title_similarity": "0.10497665",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn4qa6",
            "score": -14,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htny421",
            "score": -3,
            "text": "Prepare to be disappointed lmfao",
            "title_similarity": "0.1788921",
            "sentiment_compound": 0.1027
        },
        {
            "id": "htoeei5",
            "score": -2,
            "text": "Unless Biden manages to pull his head out of his ass, Dems will lose bigly at the midterms, then if still alive, Trump wins in 2024. Investigations over.",
            "title_similarity": "0.4380618",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hton74u",
            "score": -2,
            "text": "That’s crazy anyways my groceries are really expensive and I have no paid sick time",
            "title_similarity": "0.15708984",
            "sentiment_compound": -0.2259
        },
        {
            "id": "htp5chh",
            "score": -2,
            "text": "I am so fucking frustrated with both sides. Nobody is working for the real American taxpayer. This is fucked and EVERY single piece of shit in congress needs to be expelled. Everything is at a goddamn standstill because they want to play political theatre but at the end of the day- THEY have plenty of taxpayer dollar to live freely while I work 60 hours a week to barely make rent and eat top ramen. \n\nWhen are we going to wake up??",
            "title_similarity": "0.3591724",
            "sentiment_compound": -0.3603
        },
        {
            "id": "htmhsa1",
            "score": 4,
            "text": "Can a couple of people get arrested now?!……",
            "title_similarity": "0.22083148",
            "sentiment_compound": -0.5255
        },
        {
            "id": "htn37z2",
            "score": -8,
            "text": "As much as I dislike trump, I don’t think there will be anything they can find that incriminates him. He isn’t completely dumb. He knows how to pander to his base while saying enough to still be considered innocent. It’s not trump that is the issue, it’s his base that can’t hold someone accountable.\n\nAnd before anyone says it, I think the same about Biden as well.",
            "title_similarity": "0.24571776",
            "sentiment_compound": -0.4005
        },
        {
            "id": "htngfnu",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htnke0g",
            "score": -2,
            "text": "Good hopefully they can stop wasting time soon.  I really want to know the money wasted on investigating trump since like 2015 till probably his death.",
            "title_similarity": "0.4619403",
            "sentiment_compound": -0.5118
        },
        {
            "id": "hto1mpa",
            "score": -1,
            "text": "Cool. Can't wait for nothing to come of this and Trump to turn it into another win for Republicans.",
            "title_similarity": "0.42458734",
            "sentiment_compound": 0.7269
        },
        {
            "id": "htpgkre",
            "score": -1,
            "text": "This is almost surely going to amount to nothing",
            "title_similarity": "0.14967065",
            "sentiment_compound": 0.3832
        },
        {
            "id": "htpksc6",
            "score": 1,
            "text": "Who cares. I have been hearing about this piece of shit going to jail for 6 years. Shut up. Wake me up when I’m here is on trial in a criminal court.",
            "title_similarity": "0.5066309",
            "sentiment_compound": -0.6124
        },
        {
            "id": "htnqp8r",
            "score": -7,
            "text": "Man I see more posts about this dumb ass riot then I do about the problems our world faces.",
            "title_similarity": "0.24400194",
            "sentiment_compound": -0.9284
        },
        {
            "id": "htmgfjz",
            "score": -18,
            "text": "*ITS MUELLER TIME !!*\n\n/s",
            "title_similarity": "0.40329984",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnstrs",
            "score": -2,
            "text": "I just heard, from at least two radio outlets, in Ohio; that Intel will be locating a manufacturing plant, in Licking County, Ohio; near New Albany.  This might be good news, except for three, or four things:\n\nOne:  Intel will be receiving money, from the State of Ohio, and possibly, from the Federal Government, at least 1 Billion Dollars (not sure of that number, need to check that out).  If they will be, that is Ohioans, and American: Taxpayer Money.\n\nTwo, New Albany, Northeastern Franklin County, and Western Licking County, are Les Wexner, and John Kasich Country.\n\nThree, Les Wexner effectively owns; Columbus, and New Albany.  Les Wexner IS The Limited,  Victoria's Secret, Bath and Body Works, etc.  He speaks, and Central Ohio Politicians, listen.\n\nYou do the math.  I apologize to Reddit, and this forum, for posting this, here; but I feel this is important, and I welcome  placing it, properly.  I have looked, and have been unable to find; how to post a topic, on Reddit.",
            "title_similarity": "0.46702704",
            "sentiment_compound": 0.8186
        },
        {
            "id": "hto08k4",
            "score": -1,
            "text": "And nothing will happen. They all play on the same team, they just pretend they don’t.",
            "title_similarity": "0.18794984",
            "sentiment_compound": 0.25
        },
        {
            "id": "htp3crx",
            "score": 3,
            "text": "Nothing is going to come of this. If you think him, or any of the other Republican traitors in Congress and at Faux News will take this seriously you're mistaken. They won't respond to anything the committee does, and I guarantee they will attack the character of every member as the findings are released.\n\nRepublicans live in a constant stats of delusion and denial.",
            "title_similarity": "0.2816339",
            "sentiment_compound": -0.6678
        },
        {
            "id": "htpgb64",
            "score": -2,
            "text": "Im so sick of this Trump shit, its nauseating. Biden is our president yet you dont see this much fervor with the man's presidency. Nothing is gonna come out of this and Trump gonna win 2024 cause the democrats are a bunch of spineless idiots",
            "title_similarity": "0.35453606",
            "sentiment_compound": -0.5256
        },
        {
            "id": "htmdcbt",
            "score": 337,
            "text": "Dang only an 8 minute old article and I couldn’t get inb4 the “but nothing will happen” doomers.",
            "title_similarity": "0.3125139",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmj9kc",
            "score": 3,
            "text": "The wheels of justice turn slowly but grinds exceedingly fine",
            "title_similarity": "0.12527929",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htnc7lh",
            "score": -3,
            "text": "What exactly are people expecting to see in these records that we don't already know? Maybe a few more incriminating/embarrassing facts? At this point is it really going to be a giant revelation when we find out Trump did one more awful thing on top of the thousands of awful things we already have evidence of? \n\n\nDoes anyone really think Trump will be held in any way accountable for anything? He's an expert mob boss, meaning the worst he did is say something like \"well it sure would be a shame if my supporters violently attacked the capital *wink wink* I hope every word I speak doesn't accidentally incite them to attempt a coup *wink wink*\"\n\n\nAs far as convincing any of the die hard Trump supporters to see reason, I lost all hope when they still supported him after he bragged on tape to grabbing women by the pussy. Everything after has just been insult to injury for America.",
            "title_similarity": "0.3445372",
            "sentiment_compound": -0.8914
        },
        {
            "id": "htncjam",
            "score": -4,
            "text": "And this do-nothing worthless administration will still probably do jack shit with it.",
            "title_similarity": "0.26425827",
            "sentiment_compound": -0.7579
        },
        {
            "id": "htmysso",
            "score": 0,
            "text": "Whatever happened to NYC DA getting Trumps tax filings from Deutsche Bank?\n\nEdit: I'm not being snarky, I really want to know since I haven't heard anything.",
            "title_similarity": "0.46837586",
            "sentiment_compound": 0.1513
        },
        {
            "id": "htn73kp",
            "score": 0,
            "text": "I’m sure any good info has been removed/destroyed/redacted.",
            "title_similarity": "0.25010622",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htn9loo",
            "score": 0,
            "text": "The records that weren't shredded. Or just downright were not kept in the first place.",
            "title_similarity": "0.17018422",
            "sentiment_compound": 0.0
        },
        {
            "id": "htneotg",
            "score": -4,
            "text": "Impress me and do something with them. Until then, shut the fuck up.",
            "title_similarity": "0.26766455",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htnf9e7",
            "score": 0,
            "text": "Gop has already cleared him and blamed O̶B̶A̶M̶A̶   Biden",
            "title_similarity": "0.4901812",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htnj2aa",
            "score": -4,
            "text": "I don’t expect much to happen, if anything. I don’t exactly trust these people to do the right thing or be honest.",
            "title_similarity": "0.11544946",
            "sentiment_compound": 0.765
        },
        {
            "id": "htnj2fs",
            "score": -3,
            "text": "At this point I expect no consequences for Trump, regardless of what these records prove. He’s already crossed ever line imaginable and his supporters will always deny any wrongdoing. Call me cynical, but I’m not expecting anything but mental gymnastics from the right\n\nEdit: genuinely confused why I’m being downvoted?",
            "title_similarity": "0.30119866",
            "sentiment_compound": -0.6249
        },
        {
            "id": "htnjve6",
            "score": -4,
            "text": "\"This just in! Trump will definitely face consequences for...... wait, no, one moment. I'm now being told that there will still be no consequences. I repeat. It doesn't matter, there are still no consequences.\"",
            "title_similarity": "0.28835982",
            "sentiment_compound": -0.2654
        },
        {
            "id": "htnkm10",
            "score": 0,
            "text": "\"In unrelated news, Trump to vacation as guest of Vladimir Putin.\"",
            "title_similarity": "0.5446373",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnkpv9",
            "score": 0,
            "text": "Get that motherfucker, let's go.",
            "title_similarity": "0.19738962",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htnm148",
            "score": 0,
            "text": "I like how so many people are working so hard to investigate this and bring everything to light and in the end not a goddamn thing will be done about it. \n\nNot. \n\nA. \n\nGoddamn. \n\nThing. \n\nThe Trump family is Ebola, and his presidency has infected the country, and there's nothing that will stop it from eating the flesh off this place.",
            "title_similarity": "0.300748",
            "sentiment_compound": 0.5314
        },
        {
            "id": "htnnfqi",
            "score": 0,
            "text": "Why is it always The IndependentUK thats upvoted and awarded first? Almost like they are paying Reddit marketing to get traffic in their page. Never feels organic, their owner is a russian ogliarchs son.",
            "title_similarity": "0.4220891",
            "sentiment_compound": 0.6003
        },
        {
            "id": "htnpm60",
            "score": 0,
            "text": "Literally nothing of substance will happen.",
            "title_similarity": "0.12693611",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnpmp8",
            "score": 0,
            "text": "Heavily redacted and incomplete I assume",
            "title_similarity": "0.11755584",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnq4t3",
            "score": -3,
            "text": "nothing is going to happen to Trump and he's going to be the next president again, the last one actually.",
            "title_similarity": "0.45210978",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnsi5g",
            "score": 0,
            "text": "They should unban his twitter account for the day. I’m dying to get a glimpse inside his head right now!",
            "title_similarity": "0.36561754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto7u0b",
            "score": 0,
            "text": "I like how his supporters still think Hilary's emails were still worse than anything Trump has ever done.",
            "title_similarity": "0.23684561",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hto83w4",
            "score": 0,
            "text": "Can’t wait for zero consequences",
            "title_similarity": "0.1582874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto8ixi",
            "score": 0,
            "text": "Can't wait for nothin to come of it",
            "title_similarity": "0.19122598",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoamx3",
            "score": -3,
            "text": "please ignore the failure and lack of action of this administration and Congress and concentrate on this issue that affects literally nobody. He's not going to jail, please move on",
            "title_similarity": "0.3229613",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htoudlq",
            "score": 0,
            "text": "A lot of people are about to get the biggest wrist slapping ever!",
            "title_similarity": "0.1882433",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp998x",
            "score": 0,
            "text": "We’ve been down this road before. I’m not holding my breath",
            "title_similarity": "0.2370001",
            "sentiment_compound": 0.0
        },
        {
            "id": "htot8kd",
            "score": -10,
            "text": "J6 is the new Russia collusion. Nothing will come out of it. It’s a big nottinburger. Stop thinking the Dems won’t get slaughtered in 2022 because of J6. The Dems have nothing to excite their base to vote while the Reps are on fire.",
            "title_similarity": "0.3733428",
            "sentiment_compound": -0.7314
        },
        {
            "id": "htneem7",
            "score": -10,
            "text": "I wonder if this will be as good as when Trump's taxes were in the hands of that MSNBC guy Rachel Maddow",
            "title_similarity": "0.5907724",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htmznbk",
            "score": -4,
            "text": "And they will be tucked away neatly and never released to the public.",
            "title_similarity": "0.23986256",
            "sentiment_compound": 0.34
        },
        {
            "id": "htndvvr",
            "score": -5,
            "text": "Lol. What are they gonna do? Start another committee and make some speeches?\n\nWe have the smoking gun on Trump when he said, \"Find votes.\" \n\nThat's it. If we can't put him away for that, it's over.",
            "title_similarity": "0.4775145",
            "sentiment_compound": 0.1926
        },
        {
            "id": "hto0by9",
            "score": -6,
            "text": "Yawn! Wake me up when people are in prison.",
            "title_similarity": "0.34471044",
            "sentiment_compound": -0.5562
        },
        {
            "id": "hto0fpz",
            "score": -4,
            "text": "Oh look! Another bite of the nothingburger incoming.",
            "title_similarity": "0.16713442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto0lpk",
            "score": -4,
            "text": "To bad this whole investigation is a sham and nothing at all will change because of it .What a waste of time.",
            "title_similarity": "0.102452904",
            "sentiment_compound": -0.743
        },
        {
            "id": "htpungm",
            "score": -6,
            "text": "Wow.. heavily biased discussion here.. I am curious, how will anyone have any possible proactive effect on the future, when everyone is so focused on living in the past? I used to be a Democrat, out of southern California.. after honestly observing whats been going on just this past few years, im convinced that the democratic party is not what is was, and really want nothing to do with the chaos and division that they have sown nationwide. The Republicans are not much different, just more passive aggressive and less radically destructive. Fuck both parties and the hypocrisy they champion, they are two sides of the same coin. An American party should be established and the former two dissolved. Maybe Americans would stand a chance under those circumstances",
            "title_similarity": "0.33590728",
            "sentiment_compound": 0.9585
        },
        {
            "id": "htmf2c5",
            "score": -25,
            "text": "I doubt there’s much here honestly, they delay and slow walk everything out of principle and spite. \n\nAll the real illegal business happened on signal, phone calls, and personal meetings.\n\nThis was not done through “official” channels. Sure a few things slipped through cracks but not expecting bombshells here.",
            "title_similarity": "0.21969634",
            "sentiment_compound": -0.5023
        },
        {
            "id": "htn86ez",
            "score": -6,
            "text": "So we should be seeing him in handcuffs any day, right? …. right? 😅",
            "title_similarity": "0.3854135",
            "sentiment_compound": 0.4329
        },
        {
            "id": "htni950",
            "score": -5,
            "text": "To many times they already tell me he will pay but wake me up when September Come.\n\nOrange Cheeto still talking shit coming up tv all day long  but wake me up when September Come.\n\nTwo Democrats that are republicans have the country Fuk but wake me up when September Come.",
            "title_similarity": "0.37364566",
            "sentiment_compound": -0.7269
        },
        {
            "id": "htmw16v",
            "score": -13,
            "text": "NOTHING. GONNA. HAPPEN. \n\nAt MOST, they'll go after some mid to lower level operatives who will then become GOP/Trump martyrs and go win local elections and hand juicy contracts to the companies they came from.    \n\n\nExactly zero point zero percent of the people responsible will be held accountable.",
            "title_similarity": "0.37773758",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hto66cc",
            "score": -12,
            "text": "Did anything come out of impeachments...no\n\nDid anything come out of tax returns...no\n\nWill anything come out of this...no\n\nJust rats commenting and going after good people.",
            "title_similarity": "0.31123468",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htmxawd",
            "score": -1,
            "text": "Just turning a page can reveal all the evidence.",
            "title_similarity": "0.34810805",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmxlv3",
            "score": -1,
            "text": "All this breathless reporting about *how close* we are to getting this criminal is exhausting.  Just fucking GET him",
            "title_similarity": "0.16987547",
            "sentiment_compound": -0.7579
        },
        {
            "id": "htmyr5t",
            "score": -1,
            "text": "This is the first time I’ve noticed the source posting directly to Reddit.",
            "title_similarity": "0.4472689",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn2buq",
            "score": -1,
            "text": "How dare they storm the capital on January 6th",
            "title_similarity": "0.4312958",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn2p55",
            "score": -1,
            "text": "awesome maybe get their hands on epstein's records also.\n\n1st president in history got his own american ppl. to kill their own ppl.",
            "title_similarity": "0.44644624",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htn383s",
            "score": -1,
            "text": "Inb4 despite overwhelming evidence of wrongdoing, DoJ still doesn't have the requisite figurative anatomy to do what needs to be done with these crooks",
            "title_similarity": "0.14534158",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn4i2a",
            "score": -1,
            "text": "This couldn’t have been an email?",
            "title_similarity": "0.13381004",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn52q3",
            "score": -1,
            "text": "ruh roh shaggy",
            "title_similarity": "0.19071321",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn5gsq",
            "score": -1,
            "text": "You mean just now...after a year?",
            "title_similarity": "0.39898533",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn5u6a",
            "score": -1,
            "text": "This is great, now we can drag it out a few more years and let him succumb to old age lol",
            "title_similarity": "0.37091762",
            "sentiment_compound": 0.7184
        },
        {
            "id": "htn7wc0",
            "score": -1,
            "text": "Can’t wait to see them do nothing with it",
            "title_similarity": "0.19952145",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn7zrf",
            "score": -1,
            "text": "The thing in the back of my mind is that they are all going to get away with everything or a slap on the wrist. Due to some technicality or something. Just the daily little and big lies and Fox News propaganda it’s all just too much but I am afraid nothing is going to happen even if there is evidence.  I hope there is repercussions and accountability but in the end it will be some scapegoat or similar that will be brought to justice. So they all can say the system works and go back to normal.",
            "title_similarity": "0.32142228",
            "sentiment_compound": 0.6036
        },
        {
            "id": "htn7zt9",
            "score": -1,
            "text": "I doubt there's much in the records. Yeah, Trump and his cronies are so stupid that they'd literally write down their crimes - but on the other hand, Trump's entire thing is saying something vague and making his followers fill in the incriminating details themselves.",
            "title_similarity": "0.26120606",
            "sentiment_compound": 0.2184
        },
        {
            "id": "htn85sq",
            "score": -1,
            "text": "Serious question: why would Trumps team keep any incriminating records after the fact? If they were being shady, wouldn’t they likely have already destroyed any trace of evidence? I’m trying to temper my expectations here. I just don’t understand why anyone would think they’d just sit tight on anything incriminating, knowing that they’d likely be out of office soon. Hopefully someone can explain.",
            "title_similarity": "0.31857735",
            "sentiment_compound": -0.6072
        },
        {
            "id": "htn8639",
            "score": -1,
            "text": "And nothing will happen",
            "title_similarity": "0.10497665",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn88p0",
            "score": -1,
            "text": "This is all going to be for nothing, I fear.  I doubt the democrats do anything of use.",
            "title_similarity": "0.19177835",
            "sentiment_compound": 0.033
        },
        {
            "id": "htn8knm",
            "score": -1,
            "text": "\"In the interest of National Security, we aren't releasing the full record.\"",
            "title_similarity": "0.3231613",
            "sentiment_compound": 0.6597
        },
        {
            "id": "htn993l",
            "score": 1,
            "text": "Sorry, but what do “Trump White House records” mean exactly?",
            "title_similarity": "0.6351448",
            "sentiment_compound": -0.0387
        },
        {
            "id": "htn9fxo",
            "score": -1,
            "text": "And yet nothings gonna happen",
            "title_similarity": "0.08778336",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn9ioi",
            "score": -1,
            "text": "Someone just walked up to me and said\" Sir. Your records should not be in the hands of those people\". So there ypu have ot. People are angryv",
            "title_similarity": "0.28070283",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn9ovx",
            "score": -1,
            "text": "Here it is. You're going to get him this time!",
            "title_similarity": "0.2706813",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnani7",
            "score": -1,
            "text": "Ah the unguided tour investigation",
            "title_similarity": "0.2023009",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnasi0",
            "score": -1,
            "text": "Nothing will come of this. Trump always has a plan for getting someone else to do his bidding without incriminating himself. He plans for this stuff.",
            "title_similarity": "0.33584875",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnawzd",
            "score": 1,
            "text": "Cool. Let me know when nothing happens because they never face the consequences for their actions",
            "title_similarity": "0.17333081",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htncel0",
            "score": -1,
            "text": "Does anyone actually believe anything will come from this?",
            "title_similarity": "0.20342146",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnclzj",
            "score": -1,
            "text": "Nudge me when actual consequences start to happen.\n\nUntil then I can only still believe that the unjust and corrupt politicians and their enablers will stay unpunished and nothing will really change.",
            "title_similarity": "0.3187431",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htncnwu",
            "score": 1,
            "text": "Getting Mueller vibes from this again (remember Mueller)? Feels like these snakes are going to slime away from responsibility yet again.",
            "title_similarity": "0.23545311",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htncp9t",
            "score": 1,
            "text": "Honestly while I hope (and let's be honest, pretty much know) that there is something in those documents that is extremely incriminating, we've seen this happen time and time again with him and nothing keeps happening.  I have no reason to believe anything different will happen this time around.",
            "title_similarity": "0.23647307",
            "sentiment_compound": 0.8807
        },
        {
            "id": "htncpkb",
            "score": -1,
            "text": "So what? Nobody at the top will see any consequences.",
            "title_similarity": "0.17320535",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htncra8",
            "score": -1,
            "text": "Nothing will happen to Trump as much as I would love it.",
            "title_similarity": "0.19238862",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htncrir",
            "score": -1,
            "text": "Now for them to do nothing with it",
            "title_similarity": "0.124885246",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnd0zc",
            "score": -1,
            "text": "itll still lead to nothing. trump will be free sitting on the beach no matter what",
            "title_similarity": "0.28350475",
            "sentiment_compound": 0.4983
        },
        {
            "id": "htndc8l",
            "score": -1,
            "text": "This will surely be what finally takes Trump down.",
            "title_similarity": "0.366432",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htndho2",
            "score": -1,
            "text": "Document:  I did it. \nDemocrats response: crickets",
            "title_similarity": "0.4019595",
            "sentiment_compound": 0.0
        },
        {
            "id": "htndpal",
            "score": -1,
            "text": "Hey fellow reddit users... Don't get your hopes up",
            "title_similarity": "0.31706387",
            "sentiment_compound": -0.3252
        },
        {
            "id": "htnelag",
            "score": -1,
            "text": "So more damning evidence that goes nowhere.  Cool.",
            "title_similarity": "0.15525798",
            "sentiment_compound": -0.6038
        },
        {
            "id": "htnfgws",
            "score": -1,
            "text": "Wouldn't it be great if there were consequences for actions, even for those in the halls of power?",
            "title_similarity": "0.33200085",
            "sentiment_compound": -0.5096
        },
        {
            "id": "htnfrvx",
            "score": -1,
            "text": "Democrats investigating the Republicans. Gee, I wonder what they’ll find?",
            "title_similarity": "0.43734387",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnfrwo",
            "score": -1,
            "text": "So my question is\n\nLet's imagine that the committee is \"successful\" beyond our wildest dreams. They do whatever it is they have to do to \"prove\" beyond any doubt that the GOP acted illegally and immorally as a literal enemy of the country. However you want to define that \"success\", pretend they accomplished it. Complete victory.\n\nBut then imagine it didn't actually sway voters and Republicans win all the power back in the next election anyway.\n\nWhat then?",
            "title_similarity": "0.3615318",
            "sentiment_compound": 0.8248
        },
        {
            "id": "htngvjc",
            "score": -1,
            "text": "*Yawn* somebody wake me up when there are consequences.",
            "title_similarity": "0.29611468",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnh45o",
            "score": -1,
            "text": "It's a lot of bubblegum on blank pages and copies of takeout menus shared via email.",
            "title_similarity": "0.24601665",
            "sentiment_compound": 0.34
        },
        {
            "id": "htnh8cg",
            "score": -1,
            "text": "Cool.\n\nSo is this like all the other times, when nothing happens?",
            "title_similarity": "0.19722497",
            "sentiment_compound": 0.671
        },
        {
            "id": "htnh9fo",
            "score": -1,
            "text": "I can’t wait for nothing to come of this and for Trump to be absolutely fine and never face any consequences!",
            "title_similarity": "0.2594567",
            "sentiment_compound": 0.3367
        },
        {
            "id": "htnhony",
            "score": -1,
            "text": "Get back to me when Trump or any of his family face any real negative consequences, over this, or frankly anything else.",
            "title_similarity": "0.45391184",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htnihib",
            "score": -1,
            "text": "Yea probably, heavily redacted",
            "title_similarity": "0.251274",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnjbl6",
            "score": 1,
            "text": "Put traitor Trump and his minions in prison already",
            "title_similarity": "0.38358614",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htnjsre",
            "score": -1,
            "text": "it sucks that I’m so desensitized to this at this point. like the whole thing, its just like.. yeah, of course conservatives raided the capitol. thats kinda what they do. maybe it’s because I’m young but it feels like things have always been this way.  I know they havent, as history shows. but it sure does feel like it. and no, I really dont expect real consequences for anybody responsible.",
            "title_similarity": "0.3996638",
            "sentiment_compound": 0.9294
        },
        {
            "id": "htnl379",
            "score": -1,
            "text": "Nothings going to happen..l",
            "title_similarity": "0.11837244",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnl5et",
            "score": 1,
            "text": "Time once again to watch democrats snatch defeat from the jaws of victory.",
            "title_similarity": "0.2975161",
            "sentiment_compound": -0.4588
        },
        {
            "id": "htnlcc3",
            "score": -1,
            "text": "Watch nothing happen",
            "title_similarity": "0.11233798",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnlm8p",
            "score": -1,
            "text": "Yawn. call me when something happens.",
            "title_similarity": "0.3085199",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnlmw4",
            "score": -1,
            "text": "is everyone as ready as me for absolutely nothing to come out of this, per usual?",
            "title_similarity": "0.2641015",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htnln55",
            "score": -1,
            "text": "I’m sure they’ll use this information to hold the perpetrators to account and …..lol jk",
            "title_similarity": "0.3713282",
            "sentiment_compound": 0.296
        },
        {
            "id": "htnodim",
            "score": -1,
            "text": "Got'eem ha!",
            "title_similarity": "0.21218434",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnpkt6",
            "score": 1,
            "text": "Likely just a bunch of fart jokes",
            "title_similarity": "0.07761778",
            "sentiment_compound": 0.25
        },
        {
            "id": "htnpn66",
            "score": -1,
            "text": "Why is everyone in this comment section pretending as if it makes any difference whether it’s this or that person who gets elected?",
            "title_similarity": "0.33545277",
            "sentiment_compound": 0.1027
        },
        {
            "id": "htnpn6y",
            "score": -1,
            "text": "... as if there were any records that will actually be useful.",
            "title_similarity": "0.2522118",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htnptxp",
            "score": -1,
            "text": "So what is this gonna do for the middle class?",
            "title_similarity": "0.3434102",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnq3bo",
            "score": -1,
            "text": "we did it reddit.",
            "title_similarity": "0.42403698",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnqcfh",
            "score": 1,
            "text": "Time for the Dems to strap up their boots and do absolutely nothing. Again.",
            "title_similarity": "0.18301225",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnqe8r",
            "score": -1,
            "text": "Ah just like the muller report, no one cares unless you find anything actionable…. Which I’m not holding my breath for and since media companies have done nothing but over sensationalise and lie none stop for a decade, we’re going to get endless over the top “breaking news” to frenzy people.",
            "title_similarity": "0.35219058",
            "sentiment_compound": -0.0021
        },
        {
            "id": "htnqsuf",
            "score": 1,
            "text": "Let’s see if they Mueller it.",
            "title_similarity": "0.35574448",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnu4yi",
            "score": 1,
            "text": "Yes! Finally! \n\nThey can begin to think about convening to consider deliberating a motion to launch a probe into evaluating a cost-benefit analysis to recommend creating a focus group to test the waters in consulting a think tank to gather expert opinions and weigh the evidence in regards to brainstorming a preliminary action plan to draft a subpoena!\n\nWhich will be ignored!",
            "title_similarity": "0.34123364",
            "sentiment_compound": 0.7405
        },
        {
            "id": "htnw3w2",
            "score": -1,
            "text": "Most disappointing insurrection ever, so bad it’s like it wasn’t even an insurrection at all.",
            "title_similarity": "0.10794955",
            "sentiment_compound": -0.7368
        },
        {
            "id": "htnw5n2",
            "score": -1,
            "text": "People forget that Congress is comprised of government employees. What results do you expect from government employees?",
            "title_similarity": "0.45608857",
            "sentiment_compound": -0.2263
        },
        {
            "id": "htnxzri",
            "score": 1,
            "text": "Lets see if anything actually happens.",
            "title_similarity": "0.27739805",
            "sentiment_compound": 0.0
        },
        {
            "id": "htny9nc",
            "score": -1,
            "text": "I was wondering why we get so many of these empty play-by-play posts instead of reading about it in the event that something actually comes of it. Then I saw OP's username and it made sense.",
            "title_similarity": "0.29526973",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htnz6ok",
            "score": 1,
            "text": "Nothing will happen.",
            "title_similarity": "0.102095164",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnzfg6",
            "score": -1,
            "text": "And now we sit and wait for literally nothing to happen.  Consequences are for peasants like us.",
            "title_similarity": "0.14739338",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hto0uor",
            "score": -1,
            "text": "Does anyone else think all of this will ultimately lead to nothing? \n\nThe only saving grace is Democrats sweeping the senate in November but.... is that even close to happening?",
            "title_similarity": "0.48494273",
            "sentiment_compound": 0.3094
        },
        {
            "id": "hto1aot",
            "score": 1,
            "text": " Call me when some people start getting arrested.",
            "title_similarity": "0.29381895",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hto1owd",
            "score": 1,
            "text": "The leaks have already begun. They are talking about \"proposed\" executive orders as if they actually happened. funny af",
            "title_similarity": "0.46141607",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hto2u14",
            "score": 1,
            "text": "Ngl Trump probably gets out of this one",
            "title_similarity": "0.38518035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto5d6t",
            "score": 1,
            "text": "Can't wait to see how slowly this goes nowhere before he campaigns in 2024!",
            "title_similarity": "0.38370636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto7btx",
            "score": -1,
            "text": "And they're gonna do nothing with it",
            "title_similarity": "0.11858405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto81qz",
            "score": -1,
            "text": "The fact that this is still “news” shows that’s it’s baseless",
            "title_similarity": "0.15621796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto8be3",
            "score": -1,
            "text": "And nothing will come of it. Who really cares anymore. Why are we still going on about this. There’s much more significant matters. But clearly it’s not about what’s best for the country it’s just about partisan dunking",
            "title_similarity": "0.24785434",
            "sentiment_compound": 0.2216
        },
        {
            "id": "hto8n9j",
            "score": -1,
            "text": "I hope it shows his request for 10k national guard troops just so the speaker of the house to reject it",
            "title_similarity": "0.411057",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htoa8d7",
            "score": 1,
            "text": "Breaking News! Committee is now opening the envelope the Trump White House records came in!\n\nBreaking news! Committee chair is peeling off the stamp for his stamp collection!\n\nAd nauseum. \n\nGive me the actual contents.",
            "title_similarity": "0.4871876",
            "sentiment_compound": 0.0
        },
        {
            "id": "htocxmz",
            "score": 1,
            "text": "These people are dead, Trump! Don't you have any idea what you have done here? Well, I'm gonna make sure they nail you right to the wall for this! You're not gonna sleaze your way out of this one! Right to the wall!",
            "title_similarity": "0.28262547",
            "sentiment_compound": -0.471
        },
        {
            "id": "htocyg3",
            "score": 1,
            "text": "Ok? Call me when he is in prison.",
            "title_similarity": "0.46402267",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htoe7p0",
            "score": -1,
            "text": "The whole Mueller investigation is all this reminds me of. Back when Individual 1 made it seem like a sure thing. This is more of the same.\nNothing will happen to him.",
            "title_similarity": "0.40916446",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htogu6l",
            "score": -1,
            "text": "What a distraction… nothing will happen. Waste of attention.",
            "title_similarity": "0.06573979",
            "sentiment_compound": 0.3252
        },
        {
            "id": "htojkye",
            "score": -1,
            "text": "This charade never ends",
            "title_similarity": "0.159757",
            "sentiment_compound": 0.0
        },
        {
            "id": "htokub8",
            "score": 1,
            "text": "He wont go to jail. He would expose the establishment otherwise. They cant risk that",
            "title_similarity": "0.18577597",
            "sentiment_compound": 0.0552
        },
        {
            "id": "htolrwt",
            "score": -1,
            "text": "Wow I can’t wait for them to do nothing about it",
            "title_similarity": "0.21579573",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htom21i",
            "score": -1,
            "text": "Nothing will happen just like every time before what clickbait",
            "title_similarity": "0.27820474",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htoo8eo",
            "score": -1,
            "text": "Like watching mold grow on sour milk.\n\nEveryone is so jaded over this stuff now.",
            "title_similarity": "0.19193104",
            "sentiment_compound": -0.2183
        },
        {
            "id": "htopfua",
            "score": -1,
            "text": "Oohohhohoh it’ll be like everything else during his presidency, he’ll get away with it and no one will care because more news wills break in a matter of an hour that people care about. If it hasn’t already, I had to scroll to even see this.",
            "title_similarity": "0.35900307",
            "sentiment_compound": 0.7783
        },
        {
            "id": "htoppzi",
            "score": -1,
            "text": "Watch, it’s gonna be a big nothing and you’re going to look like fools again.",
            "title_similarity": "0.15881091",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htoqqzp",
            "score": -1,
            "text": "Oh, the horror🙄",
            "title_similarity": "0.20592627",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htot6wd",
            "score": 1,
            "text": "Great, so, they'll have proof that Mango Mussolini was responsible for everything, BUT, they still won't lock him & the rest of his family behind bars, where they belong!",
            "title_similarity": "0.32770234",
            "sentiment_compound": 0.5411
        },
        {
            "id": "htoupvi",
            "score": -1,
            "text": "Ooh can't wait for nothing to happen",
            "title_similarity": "0.17069767",
            "sentiment_compound": 0.0
        },
        {
            "id": "htov2ue",
            "score": -1,
            "text": "and nothing will happen. Useless committee",
            "title_similarity": "0.16828038",
            "sentiment_compound": 0.3252
        },
        {
            "id": "htoz543",
            "score": -1,
            "text": "Breaking news? More like a broken record.",
            "title_similarity": "0.23221852",
            "sentiment_compound": -0.1458
        },
        {
            "id": "htp0hey",
            "score": -1,
            "text": "I’ve now been reading headlines with trumps name along with some random jargon saying or implying how he’s going to get his for 6 fucking years. Not a damn thing is going to change, I want it to. I just know it won’t, especially if all we do is keep fucking talking about him",
            "title_similarity": "0.54595125",
            "sentiment_compound": 0.3732
        },
        {
            "id": "htp2trd",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htp4ef4",
            "score": -1,
            "text": "let’s hope they’re able to make something out of nothing for us to all laugh at",
            "title_similarity": "0.14243579",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htp7pfa",
            "score": 1,
            "text": "Trump didn't do anything, we don't need a committee for this, but Benghazi.../s",
            "title_similarity": "0.29958594",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp9hyq",
            "score": -1,
            "text": "Annnd absolutely zero will come of it.",
            "title_similarity": "0.13246709",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp9ttn",
            "score": -1,
            "text": "Can't wait for nothing to happen",
            "title_similarity": "0.16795781",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpd1na",
            "score": -1,
            "text": "You guys got him now!! Lmao! These guys don’t actually get in trouble for anything.",
            "title_similarity": "0.23042321",
            "sentiment_compound": 0.4724
        },
        {
            "id": "htpepqr",
            "score": -1,
            "text": "Cool, nothing's gonna happen but cool",
            "title_similarity": "0.09517664",
            "sentiment_compound": 0.5574
        },
        {
            "id": "htpug3w",
            "score": -1,
            "text": "Breaking news: The Jan 6 committee strongly thinks about looking over trumps records.",
            "title_similarity": "0.5788516",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htr1mca",
            "score": 1,
            "text": "And absolutely nothing will happen.",
            "title_similarity": "0.11108138",
            "sentiment_compound": 0.0
        },
        {
            "id": "htzuwv8",
            "score": -1,
            "text": "another witch hunt...another attempt to destroy him....another example of unhinged democrats",
            "title_similarity": "0.24560845",
            "sentiment_compound": -0.7184
        },
        {
            "id": "htmjdy6",
            "score": 6,
            "text": "Are there nudes?",
            "title_similarity": "0.073783726",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn0b7m",
            "score": -6,
            "text": "And then nothing will happen. It's all political theatre.",
            "title_similarity": "0.25532117",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnjjgp",
            "score": -7,
            "text": "All theatrics to distract the American people of the true disaster that’s happening right before our eyes.  Buckle up…..you ain’t seen nothing yet.",
            "title_similarity": "0.27834615",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hto0he2",
            "score": -7,
            "text": "I’m willing to bet just another nothing burger like every other conjured up liberal lie against trump. Libs are kings of projection. Everything they said trump was doing they were actually involved in. They are a joke of a party.",
            "title_similarity": "0.35418624",
            "sentiment_compound": 0.4195
        },
        {
            "id": "htoamdj",
            "score": -8,
            "text": "Jan 6th is a cover ops by the FBI and CIA",
            "title_similarity": "0.6463227",
            "sentiment_compound": 0.0
        },
        {
            "id": "htongzn",
            "score": -6,
            "text": "Democrats “oh my god Jan 6 was so bad” \n\nReality “how can I afford my groceries, much less there be groceries stocked on the shelves”",
            "title_similarity": "0.31165218",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htmtwl4",
            "score": -8,
            "text": "So what ? I have become so cynical over the past few years I am not convinced anybody who deserves to be prosecuted is going to get prosecuted. They will indict Gulianni probably and that will be well deserved but the rest will face almost no consequences. I hope I am wrong though.",
            "title_similarity": "0.23259547",
            "sentiment_compound": -0.7596
        },
        {
            "id": "htnx2ld",
            "score": -9,
            "text": "Who the fuck cares? Your economy is fucked, your president is fucked, the democrats lied about student debt… but Trump, that’s the real issue you need to get to????? Grow up!",
            "title_similarity": "0.41467765",
            "sentiment_compound": -0.8272
        },
        {
            "id": "htp1imb",
            "score": -9,
            "text": "Jan. 6 Committee?! More like a lynch mob.",
            "title_similarity": "0.399621",
            "sentiment_compound": 0.474
        },
        {
            "id": "htmuaqe",
            "score": -2,
            "text": "Maybe they'll do something now?",
            "title_similarity": "0.24799956",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmzqoc",
            "score": -2,
            "text": "And the public will learn nothing",
            "title_similarity": "0.151815",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn3dd0",
            "score": -2,
            "text": "I will set my expectations that nothing will happen and probably still be disappointed.",
            "title_similarity": "0.19729021",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htn3kqk",
            "score": -2,
            "text": "And still absolutely nothing will come of it.  I really hope I'm wrong.  But Trump will never be prosecuted for any of this.",
            "title_similarity": "0.22793135",
            "sentiment_compound": 0.4001
        },
        {
            "id": "htn4mlf",
            "score": -2,
            "text": "Did anyone to go prison for going to war with Iraq for no reason? No?",
            "title_similarity": "0.2560716",
            "sentiment_compound": -0.8677
        },
        {
            "id": "htn4qad",
            "score": -2,
            "text": "Why do I feel like this is going to be anticlimactic despite the ‘breaking news’?",
            "title_similarity": "0.21885416",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htn6lqo",
            "score": -2,
            "text": "Oh boy I can’t wait to find out new information that will totally upset me but at the same time be expected that absolutely on action will be taken on",
            "title_similarity": "0.21612565",
            "sentiment_compound": -0.2374
        },
        {
            "id": "htn6sp4",
            "score": -2,
            "text": "Nothins gonna happen. Stop letting them distract you with this stuff.",
            "title_similarity": "0.123992465",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htna3tr",
            "score": -2,
            "text": "So jazzed for literally nothing to come of this",
            "title_similarity": "0.11132698",
            "sentiment_compound": 0.0
        },
        {
            "id": "htna9hd",
            "score": -2,
            "text": "Cue the truck that never crashes GIF.",
            "title_similarity": "0.2850047",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnai3w",
            "score": -2,
            "text": "I doubt there will be anything incriminating. I’m sure the rat already knew this was coming before the crawled out of the White House.",
            "title_similarity": "0.41351765",
            "sentiment_compound": -0.0516
        },
        {
            "id": "htnashx",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htnazb3",
            "score": -2,
            "text": "I am supremely confident nothing will happen in light of this news.",
            "title_similarity": "0.24007045",
            "sentiment_compound": 0.7845
        },
        {
            "id": "htnb7wr",
            "score": -2,
            "text": "And I bet nothing significant will be learned. Just a show to keep peoples attention away from the dumpster fire that’s been going on since Biden took office.",
            "title_similarity": "0.2728225",
            "sentiment_compound": -0.5562
        },
        {
            "id": "htnb9zf",
            "score": 2,
            "text": "“Why are they in crayon?”",
            "title_similarity": "0.28101492",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnbf4q",
            "score": 2,
            "text": "I see \"Trump White House\" up at the top of the page and it's so disconcerting.",
            "title_similarity": "0.416528",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htnbh9m",
            "score": 2,
            "text": "The walls are closing in. How long before trump jumps ship to Russia?",
            "title_similarity": "0.5095018",
            "sentiment_compound": 0.0
        },
        {
            "id": "htncj7o",
            "score": -2,
            "text": "This is how Bernie can still win.",
            "title_similarity": "0.29269552",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htncxoq",
            "score": -2,
            "text": "This is it Hes finished now!!!!...",
            "title_similarity": "0.24237213",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnd00h",
            "score": -2,
            "text": "“We got him now”",
            "title_similarity": "0.2840032",
            "sentiment_compound": 0.0
        },
        {
            "id": "htndcfh",
            "score": -2,
            "text": "time to sort by controversial so i can see what is actually going on and hear both sides.",
            "title_similarity": "0.29183787",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htnenr8",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htnf5id",
            "score": 2,
            "text": "Good. Live stream the unboxing on youtube.",
            "title_similarity": "0.27766186",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htnfa0q",
            "score": -2,
            "text": "I know the Russia probe was a hoax and sensationalized but this way more clear..",
            "title_similarity": "0.27703318",
            "sentiment_compound": 0.5089
        },
        {
            "id": "htnfmv5",
            "score": 2,
            "text": "I have so little faith that anything is going to happen to this man. \n\nAmericans talk a big game, but when it comes to really punishing people who are dangerous to our democracy, we are weak as fuck. \n\nI wouldn’t be surprised if trump won the next Presidential election. That’s how far down the drain the United States has gone.",
            "title_similarity": "0.340374",
            "sentiment_compound": -0.7962
        },
        {
            "id": "htnfpke",
            "score": -2,
            "text": "Heh. “Recommendations.” Remember when Mueller had some of those?",
            "title_similarity": "0.4018941",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htngdwa",
            "score": -2,
            "text": "I just don't care what happens. I'll be happy the Trump cult gets crushed, but I won't keep my hopes up.",
            "title_similarity": "0.2391316",
            "sentiment_compound": -0.5207
        },
        {
            "id": "htnguii",
            "score": -2,
            "text": "The first sentence in this article states that Jan 6 was the worst attack at the Capitol since the 1814 fire. That sparked my curiousity on all the attacks on the Capitol.  \n  \nhttps://www.history.com/news/us-capitol-building-violence-fires. \n  \nThere's a decent bit of information for anyone who was curious like me. I personally think bombings and shootings are worse, but what do I know.",
            "title_similarity": "0.3863592",
            "sentiment_compound": -0.6956
        },
        {
            "id": "htnhid1",
            "score": -2,
            "text": "Nobody cares about this crap. I’m a democrat too. We should be addressing the increase in crime, inflation, supply chain and rising tension in Europe.",
            "title_similarity": "0.30847585",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htnhno5",
            "score": -2,
            "text": "this is the time we get boys",
            "title_similarity": "0.26355225",
            "sentiment_compound": 0.0
        },
        {
            "id": "htniqag",
            "score": -2,
            "text": "In 2p24 he'll probably be president again. That is : before they even turn the first pages of the documents they fought so hard to get. Now it's in the system, it'll take the same ad aeternum time as everything else. There is no hope.",
            "title_similarity": "0.46899045",
            "sentiment_compound": -0.678
        },
        {
            "id": "htnjfni",
            "score": -2,
            "text": "Is this the “smoking gun” we’ve heard about the last five years?",
            "title_similarity": "0.36141402",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnjl1h",
            "score": -2,
            "text": "So what Lo.",
            "title_similarity": "0.15553018",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnkdg4",
            "score": -2,
            "text": "I'm sure Golly Gee Garland is ready to pounce on these traitors and put them away in the federal pen to clean toilets with their tongues for the rest of their miserable lives....Wait, who tf am I kidding, these pieces of shit will walk and continue their grift and destruction of civil society. Garland will be like, \"Aw shucks, what could I have done?\"",
            "title_similarity": "0.24223788",
            "sentiment_compound": -0.2732
        },
        {
            "id": "htnlwxe",
            "score": -2,
            "text": "Oh shit this is gonna change everything /s",
            "title_similarity": "0.2221141",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htnn9p1",
            "score": 2,
            "text": "So like... normal people would be sitting in jail while being investigated right?",
            "title_similarity": "0.3162349",
            "sentiment_compound": 0.4201
        },
        {
            "id": "htnqdko",
            "score": 2,
            "text": "This could be the thing that ends Trumps presidency.",
            "title_similarity": "0.44693208",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnr4t9",
            "score": -2,
            "text": "What a fucking joke these assholes are.",
            "title_similarity": "0.046361763",
            "sentiment_compound": -0.3758
        },
        {
            "id": "htnwl10",
            "score": 2,
            "text": "Prepare to be disappointed. I'm sure he ate anything particularly incriminating.\n\nhttps://www.businessinsider.com/omarosa-saw-trump-eating-paper-in-oval-office-2018-8?op=1",
            "title_similarity": "0.36845914",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htnzio3",
            "score": -2,
            "text": "WHO awards this?",
            "title_similarity": "0.30709165",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htnzphp",
            "score": -2,
            "text": "I guarantee they will do nothing with it. Confidence in the Democratic Party is low and rightfully so",
            "title_similarity": "0.21240517",
            "sentiment_compound": -0.0263
        },
        {
            "id": "htof79m",
            "score": 2,
            "text": "'White House records'...?\n\nLike the notes from Trump's meetings with Putin and a ton of other Russians?\n\nAll the e-mails are on non-White House systems (and erased now), no paper any where. \n\nThat's how crooks and liars operate - leave no records of any kind.",
            "title_similarity": "0.4008987",
            "sentiment_compound": -0.3527
        },
        {
            "id": "htogqea",
            "score": -2,
            "text": "it's funny that you guys think anything would happen to him at all",
            "title_similarity": "0.1680864",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htojayt",
            "score": -2,
            "text": "I wish the republicans can just pull an W out the ass for once so we can take the senate so we can get some pro gun bills in although it’s the republicans they never grow a pair and tussle with democrats once in their miserable existence as a party.",
            "title_similarity": "0.3398417",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htokg7a",
            "score": -2,
            "text": "It’s weird how these things line up with elections",
            "title_similarity": "0.29617825",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htosvsy",
            "score": -2,
            "text": "Unfortunately Biden hasn't kept his pre-election promises. This will hurt him in the mid-terms.\n\nBut the importance should be on denying the Republicans any advantage.\n\nBecause they are hell bent on imposing their backward religious virtue signalling on all people.\n\n\"...we should forgive a minimum of $10,000/person of federal student loans, as proposed by Senator Warren and colleagues. Young people and other student debt holders bore the brunt of the last crisis. It shouldn't happen again.\"\r  \n11:28 PM · Mar 22, 2020",
            "title_similarity": "0.32766163",
            "sentiment_compound": -0.926
        },
        {
            "id": "htoyg6z",
            "score": -2,
            "text": "Yall mo’fuckas act like anything will come of this🤣",
            "title_similarity": "0.27438968",
            "sentiment_compound": 0.6908
        },
        {
            "id": "htr4xm8",
            "score": -2,
            "text": "So much copium in this sub lol",
            "title_similarity": "0.24374467",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htmd1r7",
            "score": -53,
            "text": "That's great! But, nothing will happen. He's Teflon.",
            "title_similarity": "0.2500541",
            "sentiment_compound": 0.4295
        },
        {
            "id": "htow7vf",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.13516343"
        },
        {
            "id": "htp4uvu",
            "score": -9,
            "text": "Who cares Biden is destroying our country literally day by day, inflation through the roof, price of consumer goods through the roof across the board, china and Russia stepping all over us. It’s a 💩 show and all of trumps mess ups combines pale in comparison to each and every singular one of Biden and his puppet masters many mess ups. Thanks to all the Biden voters for being so soft and ignorant",
            "title_similarity": "0.26138037",
            "sentiment_compound": -0.6204
        },
        {
            "id": "htn657v",
            "score": 19,
            "text": "If all the people commenting \"I can't wait for nothing to come of this\" took that energy and instead called, emailed, and tweeted at their Representatives that they expect either consequences or an explanation of what happened and how it will never happen again, I think we'd be closer to seeing actual results.",
            "title_similarity": "0.27645802",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htmw26r",
            "score": -11,
            "text": "\"Jesus, how are we going to sweep all of this under the rug?\" - Jan 6 Committee",
            "title_similarity": "0.5937184",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn2720",
            "score": -12,
            "text": "“Breaking News: something we’ve known for a while, and will turn out to be nothing!”",
            "title_similarity": "0.2775678",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmp0ko",
            "score": -3,
            "text": "Not my problem any more.",
            "title_similarity": "0.17219198",
            "sentiment_compound": 0.3089
        },
        {
            "id": "htms1r3",
            "score": -3,
            "text": "Just two more weeks",
            "title_similarity": "0.30988902",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmyfbj",
            "score": -4,
            "text": "So what will he be convicted of? And what will happen to him?",
            "title_similarity": "0.21198893",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn5y52",
            "score": -3,
            "text": "So what's the deal this time? Do I get my hopes up or will nothing get done about it again?",
            "title_similarity": "0.22311264",
            "sentiment_compound": 0.4871
        },
        {
            "id": "htn656l",
            "score": -2,
            "text": "I just can’t wait for the justice department to give Trump a stern talking to, likely on his terms.",
            "title_similarity": "0.48270386",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htn7heo",
            "score": -2,
            "text": "Imagine thinking anything substantial will come of this",
            "title_similarity": "0.26000434",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htn8vn5",
            "score": -3,
            "text": "Do you guys still think Trump is going to get punished? How delusional are you?",
            "title_similarity": "0.27676028",
            "sentiment_compound": -0.5204
        },
        {
            "id": "htnaktv",
            "score": -3,
            "text": "I can’t wait till they bury them because the dems really don’t want to set a precedent of holding politicians accountable because if they do the GOP will hold them accountable for their own corrupt shit the next time they have control of Congress.",
            "title_similarity": "0.3162995",
            "sentiment_compound": -0.4627
        },
        {
            "id": "htnaudp",
            "score": -2,
            "text": "Nothing will come of this. You butter believe it.",
            "title_similarity": "0.2489732",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnbl1o",
            "score": -3,
            "text": "\\*next week\\*\n\n\"We investigated ourselves and found no wrongdoing.\"",
            "title_similarity": "0.41346815",
            "sentiment_compound": -0.296
        },
        {
            "id": "htncw8z",
            "score": -4,
            "text": "I smell another witch-hunt incoming…",
            "title_similarity": "0.2930958",
            "sentiment_compound": 0.0
        },
        {
            "id": "htndzdu",
            "score": -4,
            "text": "They should impeach him in 2025. 3rd times a charm. Fancy pens are a nice perk too.",
            "title_similarity": "0.42809492",
            "sentiment_compound": 0.6705
        },
        {
            "id": "htnee6y",
            "score": -3,
            "text": "Honestly Trumps career/reputation has had more failed assassination attempts than Castro.",
            "title_similarity": "0.32214803",
            "sentiment_compound": -0.6976
        },
        {
            "id": "htnez37",
            "score": -4,
            "text": "Bunch of neck bears on this stupid sub Reddit",
            "title_similarity": "0.23677659",
            "sentiment_compound": -0.6124
        },
        {
            "id": "htnfyq5",
            "score": -3,
            "text": "and like every single investigation dating back to before he took office nothing will come of it",
            "title_similarity": "0.38759696",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htnget4",
            "score": -2,
            "text": "Great now let's see if the democrats will. \n\nA. Actually find something. \n\nB. Pull the trigger if they do find something.",
            "title_similarity": "0.32864696",
            "sentiment_compound": 0.6249
        },
        {
            "id": "htngg1z",
            "score": -4,
            "text": "So am I supposed to be more or less upset when nothing happens?",
            "title_similarity": "0.16591018",
            "sentiment_compound": -0.3758
        },
        {
            "id": "htnjt5n",
            "score": -2,
            "text": "They’ve got him this time!",
            "title_similarity": "0.25680912",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnk43p",
            "score": -3,
            "text": "Can't get him impeached\nDoubt this will do anything\nGQPs untouchable",
            "title_similarity": "0.28256774",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htnlzyq",
            "score": -2,
            "text": "Meh. Who cares ? Midterms and 2024 going the other way. Doesn’t really matter.",
            "title_similarity": "0.37179607",
            "sentiment_compound": 0.4754
        },
        {
            "id": "htnnwj8",
            "score": 3,
            "text": "This better end up something, and not nothing again.",
            "title_similarity": "0.16246495",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htnp1gd",
            "score": 3,
            "text": "I’m so sick of hearing his name.",
            "title_similarity": "0.117777124",
            "sentiment_compound": -0.5563
        },
        {
            "id": "htnphtt",
            "score": -2,
            "text": "Trump will be re-elected 🤷‍♂️",
            "title_similarity": "0.6066297",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnzktq",
            "score": -3,
            "text": "So the Democrats can slowly leak everything to the press, framed in the most negative way possible",
            "title_similarity": "0.32387906",
            "sentiment_compound": -0.7501
        },
        {
            "id": "hto09ku",
            "score": -4,
            "text": "This is all for show, nothing will happen and they’ll act like they are very busy with it even though it’s been a year.\n\nAfter midterms they’ll blame the Republicans and how it is their fault that nothing happened and that they are unable to do anything.",
            "title_similarity": "0.31414524",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htof18u",
            "score": -2,
            "text": "Who is the current ambassador to the Ukraine? Russia now has 100,000 troops on the border and the need to evacuate U.S. personnel is eminent. Sounds like Biden has a strategy ffs.",
            "title_similarity": "0.4950844",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htov0vd",
            "score": -3,
            "text": "We need answers about Ray Epps, but the media won’t talk about that.",
            "title_similarity": "0.23546886",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmvkfl",
            "score": -11,
            "text": "So what?",
            "title_similarity": "0.15163067",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmyyvm",
            "score": -4,
            "text": "Titter titter giggle smirk",
            "title_similarity": "0.08525939",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htn29mf",
            "score": -3,
            "text": "Would sure be a shame if the Jan 6th committee has anything but justice in mind",
            "title_similarity": "0.28348973",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htn40tx",
            "score": -5,
            "text": "End of Drumpf for real this time.",
            "title_similarity": "0.2605938",
            "sentiment_compound": 0.0
        },
        {
            "id": "htna8i5",
            "score": -4,
            "text": "Yes be distracted",
            "title_similarity": "0.05879461",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htnddql",
            "score": -4,
            "text": "Going to get him impeached for certain now…",
            "title_similarity": "0.3017416",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htnei8t",
            "score": 4,
            "text": "I can't even imagen what needs to be in those documents that will hold him accountable. I mean, look at all the travesty he has gotten away with all his life. Infuriating to say the least.",
            "title_similarity": "0.22449297",
            "sentiment_compound": -0.7964
        },
        {
            "id": "htngbot",
            "score": -4,
            "text": "Nothing will happen",
            "title_similarity": "0.09787454",
            "sentiment_compound": 0.0
        },
        {
            "id": "htngdgn",
            "score": -4,
            "text": "Nothing will happen.",
            "title_similarity": "0.102095164",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnlnjv",
            "score": -3,
            "text": "Its really gonna be funny when these don’t show shit and everyone on this sub is blue-balled lmao\n\nIt’s how it always goes with these committees",
            "title_similarity": "0.2745309",
            "sentiment_compound": 0.5367
        },
        {
            "id": "htnn304",
            "score": -3,
            "text": "Good. This will dramatically lower food prices and gas prices. It will also allow me to find milk in my grocery store. Or maybe afford the groceries that are now 50% higher than a year ago. Oh wait, no it won’t do shit for the real problems in the country. 6 years of trying to get trump and still haven’t done shit. Typical dems. Do nothing at all, all the time for everything.",
            "title_similarity": "0.3604038",
            "sentiment_compound": -0.8591
        },
        {
            "id": "htnnffd",
            "score": -4,
            "text": "LOL and they will find NOTHING.",
            "title_similarity": "0.13340475",
            "sentiment_compound": 0.5473
        },
        {
            "id": "htnq3yi",
            "score": -4,
            "text": "It’s like watching a shitter third movie of a shitty trilogy. Russia gate! Impeachment! Next is January 6th committee! The third installment of the exciting “Trump bad” movie series. Meanwhile store shelves are empty and gas prices soar. Bread and circuses.",
            "title_similarity": "0.30150682",
            "sentiment_compound": 0.2905
        },
        {
            "id": "htntjlh",
            "score": -2,
            "text": "Still trump is trending here. Lets focus on current president. Oh wait",
            "title_similarity": "0.6464418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto6ylx",
            "score": -3,
            "text": "Reddit morons: \"We finally got em!\"",
            "title_similarity": "0.37298036",
            "sentiment_compound": -0.3802
        },
        {
            "id": "htomh8e",
            "score": -5,
            "text": "Is this the made up conspiracy that will finally bring down trump? Unlike you know, the rest of them.",
            "title_similarity": "0.42529753",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htopibs",
            "score": -5,
            "text": "Let’s quit wasting time, we have a bigger fish to fry ! How do like the payback Democrats ?😀Get on with the big things you stopped",
            "title_similarity": "0.26798117",
            "sentiment_compound": 0.1759
        },
        {
            "id": "htov6z4",
            "score": -2,
            "text": "No one cares anymore.",
            "title_similarity": "0.08444461",
            "sentiment_compound": -0.569
        },
        {
            "id": "htovbah",
            "score": 4,
            "text": "On April 4, 2020 my son's cancer surgery was postponed due to covid.  Three weeks later it was too late that one tumor they were going to stop blood flow had multiplied to his entire liver.  From then on it was just he was a guinea pig in cancer trials.  We watched him lose weight until he looked like an Auchwitz concentration victim.  On Feb 11, 2021 he died.  Now I cannot quit thinking of all donald's pressers where he ignored covid.  I cannot stop thinking about Jarrad and his friend's doing something to try to monetize covid for their own pockets.  How many times did they waste \"three weeks\" time in controlling it?  For their election or money reasons.   How many people died besides just covid deaths?\n\nWe loved our son, brother, Uncle, cousin so much our entire family is still devastated one year later after his death.  I am so angry at that family that I wish our country could do a Romanov family basement on them.  I wish we had a country where that could happen but unfortunately we don't.    Now we have to watch them selling \"merch\".  $24 trump water glass.  $62 Trump bath mat.   $75 book.  I'm so old almost dead myself anyway but I have never before in my life hated an ex P\\_\\_\\_\\_\\_\\_\\_ and wished he would die.   I hope to live to see that happen so I can have a f block party.",
            "title_similarity": "0.30950832",
            "sentiment_compound": -0.9882
        },
        {
            "id": "htpdyh7",
            "score": -3,
            "text": "Anyone that voted for Biden and thinks he’s doing a good job is clearly out of touch with reality. Watch WW2 in color on Netflix, Goebbels would be proud.",
            "title_similarity": "0.32589966",
            "sentiment_compound": 0.8271
        },
        {
            "id": "htmcj4p",
            "score": 59,
            "text": "Let’s see what other threads these lead to…\n\nKavanaugh nomination\n\nImpeachment discussions\n\nPutin",
            "title_similarity": "0.45537663",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmwa4i",
            "score": 5,
            "text": "When are we going to see some arrests? And jail?",
            "title_similarity": "0.32436436",
            "sentiment_compound": -0.504
        },
        {
            "id": "htn0b7p",
            "score": -5,
            "text": "Wake me if anything actually happens.  I am so jaded that nothing ever fucking happens to him, or others like him that I am not expecting anything other than nothing to be done.",
            "title_similarity": "0.20979212",
            "sentiment_compound": -0.2183
        },
        {
            "id": "htn69tt",
            "score": -6,
            "text": "Ok so tell me…They will say what we saw on live TV happened and Trump made it worse. Next, they won’t have any power to do shit about it but issue subpoenas. Trump will laugh, plead the fifth, and his rabid follows will keep supporting the GOP by saying 1/6 was just a deep state false flag. Am I missing anything in my cynicism?",
            "title_similarity": "0.40950292",
            "sentiment_compound": 0.1655
        },
        {
            "id": "htnaak3",
            "score": -5,
            "text": "Get ready for another nothingburger!",
            "title_similarity": "0.27966255",
            "sentiment_compound": 0.4199
        },
        {
            "id": "htnbw8j",
            "score": -5,
            "text": "Yeah theres videos on the CoUp coming out. Also Trump requested the National guard beforehand, and Pelosi declined. They allowed it to happen at minimum and are using it as political leverage.",
            "title_similarity": "0.4898004",
            "sentiment_compound": 0.296
        },
        {
            "id": "htny80n",
            "score": -6,
            "text": "……i literally dgaf…",
            "title_similarity": "0.2777065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto8q9p",
            "score": -4,
            "text": "Again, how did trump force anyone to attack the capital?",
            "title_similarity": "0.4295552",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htpxx5r",
            "score": -6,
            "text": "Going to be the same bunch of nothing like the Mueller probe.",
            "title_similarity": "0.38721788",
            "sentiment_compound": -0.2755
        },
        {
            "id": "htn5w20",
            "score": -17,
            "text": "Nobody cares, it’s a fucking political witch hunt.",
            "title_similarity": "0.20552038",
            "sentiment_compound": 0.0571
        },
        {
            "id": "htnkivw",
            "score": -6,
            "text": "Like Trump or not, this sets a really bad president. No former President has grounds to block privileged records from being released. Be careful what you wish for.",
            "title_similarity": "0.3984633",
            "sentiment_compound": -0.1171
        },
        {
            "id": "htnqf3u",
            "score": 6,
            "text": "I don’t want to see Biden or Trump in 2024. Can we get someone younger who actually knows what to do for once.",
            "title_similarity": "0.40741032",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htnyc9b",
            "score": -5,
            "text": "A kangaroo court on an open ended fishing expedition.  \n\n\nThey won't know what they'll find until they find it.  \n\n\nHow very 'NKVD.'  \n\n\n'You show me the man.  I'll show you the crime.'   -Lavrentiy Beria",
            "title_similarity": "0.35329413",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hto0h5l",
            "score": -7,
            "text": "Absolutely cannot wait for this website to be SORELY disappointed with the results of this waste of time.",
            "title_similarity": "0.12394163",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hto2ep6",
            "score": -5,
            "text": "Poking at air again just like the Russia hoax",
            "title_similarity": "0.33446637",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hto8ixv",
            "score": -5,
            "text": "Anybody gonna mention Fauci’s unredacted emails? The ones that show scientists in email chains with Fauci in February 2020 stating they believe the virus was likely developed in a lab?",
            "title_similarity": "0.50600183",
            "sentiment_compound": 0.0
        },
        {
            "id": "htokno8",
            "score": -6,
            "text": "Democrats are going after political opponents instead of fixing the economy, canceling student debt and reforming voting laws.",
            "title_similarity": "0.32752103",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htp0fss",
            "score": -6,
            "text": "ITS FACT!!!! Fk this I’m not going left anymore, just bc it’s your party doesn’t mean you believe EVERYTHING. Even the right hates when it’s necessary. I really do hope a red wave comes bc after talking to Who I though understood facts I’m straight up wrong, YALL only like what the media tells you and only believe what they tell you. I’m walking away from the left lies! DONE",
            "title_similarity": "0.3071903",
            "sentiment_compound": 0.3912
        },
        {
            "id": "htpllvc",
            "score": -5,
            "text": "Democrats false flag attack dozens of fed operatives and uncharged co conspiriters.",
            "title_similarity": "0.32796907",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htmg2jo",
            "score": 25,
            "text": "Suck it Donny",
            "title_similarity": "0.15786752",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htmy8wb",
            "score": -22,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htn1azt",
            "score": -6,
            "text": "Oh for sure. This time we got em. No way out of this.  I’m sure the documents I don’t have access to will obviously detail with evidence the crimes I already think he did.  \n\nIf they find a way to cheat us out of any charges again, I’m going to flip.  They almost make it seem like he isn’t guilty of anything criminal.  \n\nThe justice system is so broken that we can’t even convict a person I totally know did crimes even though I keep being told they’re very close to it.  I’ll believe them this one more time though.",
            "title_similarity": "0.29299194",
            "sentiment_compound": -0.79
        },
        {
            "id": "htndt52",
            "score": -7,
            "text": "Sounds like a waste of fucking tax payer money but here we go again with this shit that just never ends. Maybe in a decade they’ll stop blaming this one short lived guy on all the fucking problems and go find something else to waste money on while pocketing our taxes.",
            "title_similarity": "0.34507364",
            "sentiment_compound": -0.9713
        },
        {
            "id": "htnf4qa",
            "score": -7,
            "text": "Lmao, all these America hating communists. Let the circle jerk begin",
            "title_similarity": "0.2144699",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htnggqc",
            "score": -6,
            "text": "Good!  Nothing will be found and we can move on from this.  What a complete waste of time.",
            "title_similarity": "0.124709696",
            "sentiment_compound": 0.1007
        },
        {
            "id": "htnondi",
            "score": 6,
            "text": "I honestly don't get why we're all making a big deal of this, we know how it's all gonna go down:\n\nThey'll eventually press charges, he'll show up to court, and the rich white man will eventually (and oh so mysteriously) go free.",
            "title_similarity": "0.301476",
            "sentiment_compound": 0.8428
        },
        {
            "id": "htnts12",
            "score": -7,
            "text": "Haha same as the russian story, nothing.....while bidens destroys our economy",
            "title_similarity": "0.32745087",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htoieha",
            "score": -5,
            "text": "This is entire presidency is doing nothing but obsessing about the last administration. Russia is about to go to war with ukraine and we have a brain dead fuck that is doing absolutely nothing as a leader.",
            "title_similarity": "0.346129",
            "sentiment_compound": -0.9477
        },
        {
            "id": "htovoek",
            "score": -9,
            "text": "People still care about this nothing event? Well done America, you focus on the dumbest shit ever instead of actual problems.",
            "title_similarity": "0.24976404",
            "sentiment_compound": -0.8028
        },
        {
            "id": "htow58b",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.13516343"
        },
        {
            "id": "htqki0i",
            "score": -7,
            "text": "Dems are still wasting tax money on trying to screw over Trump…if theirs one thing the dems have proven with Trumps election is how stupid they are",
            "title_similarity": "0.30478314",
            "sentiment_compound": -0.7579
        },
        {
            "id": "htr080m",
            "score": -7,
            "text": "Funny how many people let Trump live in thier heads rent free. I love Trump and not ashamed to state it. LGB",
            "title_similarity": "0.36660093",
            "sentiment_compound": 0.9178
        },
        {
            "id": "htngmv2",
            "score": -8,
            "text": "Yea and ? Lol who the fuck cares ?",
            "title_similarity": "0.12406141",
            "sentiment_compound": 0.3939
        },
        {
            "id": "htnisw9",
            "score": -8,
            "text": "I am brown, immigrant, and a minority. I want democraps to never be in power even if it means republican holding executive, judicial, and legislative branches from here on out to the end of eternity.",
            "title_similarity": "0.38033125",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htnqbm5",
            "score": -9,
            "text": "Will everyone be quiet after they find nothing and the media tries to explain why not?? Come back to my post a few weeks from now and prove me wrong. #blametrump #more_excuses #blame_covid",
            "title_similarity": "0.37672088",
            "sentiment_compound": -0.5362
        },
        {
            "id": "hto9duw",
            "score": -9,
            "text": "Democrats have been given house, senate and White House. What have they managed to accomplish in the past year? Proving that republicans are the only party capable of moving this country forward in just about every notable and voteable piece of legislation. Not that I think they can accomplish much either, but the pressers are not complete train wrecks, and ramen noodles aren’t more than a dollar a bag.",
            "title_similarity": "0.40928376",
            "sentiment_compound": 0.6652
        },
        {
            "id": "htogzb9",
            "score": -8,
            "text": "Is another Democrat conspiracy theory going to flush out into a big nothing burger?",
            "title_similarity": "0.24907997",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htoh8s2",
            "score": -7,
            "text": "Trump is innocent!!  This is a modern day witch hunt!  On the first day in office they said they would impeach him.  That’s all they did for four years.  Now it’s like the boy crying wolf.  Now Biden is so dumb he can’t even see all of his policies are hurting Americans.   People are jumping out of Biden’s ship like it is on fire!",
            "title_similarity": "0.32393283",
            "sentiment_compound": -0.8661
        },
        {
            "id": "htomp6h",
            "score": -10,
            "text": "Why do leftists always talk about Jan 6? They seem so deeply invested in something most Americans already forgot about. The first thing they do when they wake up is post something about Jan 6 and get thousands of likes from like minded individuals which like I said are all democrats. Not sure why this Reddit is so biased, I want to hear both sides. Kind of sad and seems like censorship goes on here",
            "title_similarity": "0.35831252",
            "sentiment_compound": 0.4152
        },
        {
            "id": "htpcgzh",
            "score": -9,
            "text": "They spent 4 years trying to destroy this man. Investigation after investigation, Russia Russia Russia, sexist, racist, obstructionist, and guess what.. it was all fake news.  Trump did nothing wrong. Reading through all these threads, it’s clear so many are fueled by misguided hatred for this man.  Trump was the best president we had going back many many decades. If congress wasn’t so hostile towards him and wasn’t fixated on hatred he would have accomplished so much more.\n\nThis is just more fake news.\n\nThe capitol riots were a long time coming.. and so is a political revolution in this country.",
            "title_similarity": "0.38866258",
            "sentiment_compound": -0.9572
        },
        {
            "id": "htobi77",
            "score": 24,
            "text": "Why does it matter, it's not like anyone's going to get punished. It's America, you guys don't punish the rich, ever.",
            "title_similarity": "0.37195766",
            "sentiment_compound": -0.6319
        },
        {
            "id": "htna98o",
            "score": -8,
            "text": "Trump bad",
            "title_similarity": "0.18807977",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htnf1ff",
            "score": -10,
            "text": "Rent Free...",
            "title_similarity": "0.16822691",
            "sentiment_compound": 0.5106
        },
        {
            "id": "htnhhf2",
            "score": -8,
            "text": "Be careful what you wish for... The precedence has now been set. This opens the doors for any and all president's records to be subpoenaed. For example, when Republicans next take the Whitehouse and both houses of congress, 0bama's and Biden's records will be fair game. And the chips will fall where they will.",
            "title_similarity": "0.5201712",
            "sentiment_compound": 0.6808
        },
        {
            "id": "htnrc7y",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htp5ldp",
            "score": -8,
            "text": "Wow this is so important. The rampant inflation, skyrocketing housing costs, never ending pandemic, border unrest, Europe on the verge of WW3, and all that stuff needs to take a back seat. A couple morons had an unscheduled capital tour!\n\nThis is theater. It's all theater.",
            "title_similarity": "0.35266054",
            "sentiment_compound": 0.632
        },
        {
            "id": "htnabto",
            "score": -10,
            "text": "Get over it, move on. We are too divided.",
            "title_similarity": "0.14454445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto29pc",
            "score": -12,
            "text": "What are you dorks going to do when it’s revealed the dems planned the entire thing?",
            "title_similarity": "0.40503573",
            "sentiment_compound": -0.128
        },
        {
            "id": "htmn11p",
            "score": 170,
            "text": "I will not care until he is in cuffs",
            "title_similarity": "0.273398",
            "sentiment_compound": -0.3875
        },
        {
            "id": "htn5p0r",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htne37k",
            "score": -12,
            "text": "LOLz, so what?  Typical of this sub to focus on something that doesn't matter, instead of focusing on the utter disaster that the current administration is.",
            "title_similarity": "0.22226976",
            "sentiment_compound": -0.1943
        },
        {
            "id": "htortly",
            "score": 13,
            "text": "Sweet! I can’t wait for absolutely nothing to happen. Fuck I hope I’m wrong.",
            "title_similarity": "0.15136865",
            "sentiment_compound": 0.7133
        },
        {
            "id": "htmizvb",
            "score": 38,
            "text": "Tick tock mother fucker",
            "title_similarity": "0.21081501",
            "sentiment_compound": -0.6486
        },
        {
            "id": "htmtr47",
            "score": 13,
            "text": "I wonder if they’re all written in crayon and sharpie.",
            "title_similarity": "0.23651932",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn1rd3",
            "score": 14,
            "text": "Guys and Gals and non binary pals.  Get your popcorn ready!!  This should be fun. :)",
            "title_similarity": "0.13331199",
            "sentiment_compound": 0.855
        },
        {
            "id": "htn9g9n",
            "score": -13,
            "text": "Good thing people will never get bidums stuff. It would only be one page of half formed sentences and mumbled garbage. \n\nBiden sucks.",
            "title_similarity": "0.15865672",
            "sentiment_compound": 0.1531
        },
        {
            "id": "htmxluo",
            "score": 71,
            "text": "Logically speaking, if there was anything in those records that would exonerate Trump, he wouldn't have fought so hard against their release. Period, full stop.",
            "title_similarity": "0.30817467",
            "sentiment_compound": 0.1768
        },
        {
            "id": "htnhw7f",
            "score": -16,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htmepc9",
            "score": 333,
            "text": "Trump must be feeling powerless and scared right now. The rage will come later, but for now I'm willing to bet that he's terrified.",
            "title_similarity": "0.18256432",
            "sentiment_compound": -0.891
        },
        {
            "id": "htnyla5",
            "score": 21,
            "text": "Hopefully trump croaks before 2024",
            "title_similarity": "0.47110972",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htmktc0",
            "score": -29,
            "text": "So they are going to try to convict him in a secret court with no republicans on it  because they can’t get him in the senate ? Or what ?",
            "title_similarity": "0.3153779",
            "sentiment_compound": -0.3736
        },
        {
            "id": "htmeo15",
            "score": 437,
            "text": "Release them to public!",
            "title_similarity": "0.24162342",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmhppa",
            "score": 46,
            "text": "Does that include the coloring books?",
            "title_similarity": "0.29706374",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmjoy9",
            "score": 138,
            "text": "Lock Him up.",
            "title_similarity": "0.23105648",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmc61c",
            "score": 3694,
            "text": "750 pages... wow that's a lot of McDonalds receipts",
            "title_similarity": "0.33172616",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htmq6id",
            "score": 227,
            "text": "Wow. A draft executive order to seize voting machines. \n\nTalk about a federal takeover of elections…",
            "title_similarity": "0.46556833",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htmerkd",
            "score": 230,
            "text": "Oh, I feel so sorry for the committee.  Hours and hours of disconnected Trump thoughts vocalized.  Hope they have a schedule weekly therapy sessions with the House psychiatrist, they are going to need it.",
            "title_similarity": "0.40510926",
            "sentiment_compound": 0.2866
        },
        {
            "id": "htmcthv",
            "score": 1237,
            "text": "Great, now start going after all the violations of the Presidential Records Act to get the deliberately hidden correspondence.",
            "title_similarity": "0.38998383",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htmbv3l",
            "score": 2300,
            "text": "The House select committee investigating the 6 January insurrection is now in possession of more than 750 pages of Trump White House records it requested as part of it’s probe into the worst attack on the Capitol since the 1814 Burning of Washington.  \nIn a statement, a spokesperson for the National Archives and Records Administration said the agency “provided the Select Committee with all the records at issue in the litigation” on Thursday evening.  \nThe spokesperson added that Nara will continue producing documents in response to the committee’s request “on an ongoing basis”.\n\n[Read the full story here.](https://www.independent.co.uk/news/world/americas/us-politics/trump-capitol-riot-committee-records-b1998102.html)",
            "title_similarity": "0.6226597",
            "sentiment_compound": -0.802
        },
        {
            "id": "htmcuqq",
            "score": 7687,
            "text": "It's an absolute travesty they were able to delay this for as long as they did and it had to involve the Supreme Court to issue a ruling your average joe could have figured out.",
            "title_similarity": "0.3473258",
            "sentiment_compound": -0.34
        },
        {
            "id": "htmjzy9",
            "score": 207,
            "text": "I'm watching his feet. How much longer before he heads somewhere with no extradition?",
            "title_similarity": "0.3595642",
            "sentiment_compound": -0.296
        },
        {
            "id": "htna3vd",
            "score": 542,
            "text": "Vent time. \n\nI feel as if I'm dealing with family members that need mental help. It's been draining, like dealing with an alcoholic that does not see the harm they're causing to themselves and others. \n\nThey're literally unable to conceive a world in which Trump did not win every state expect California and New York. It's mentally impossible. It's not just denial, it's on par with asking a comatose patient to stop being lazy and feed themselves. \n\nYou may claim the delusion is not harmful and therefore no big deal. Wrong. January 6th showed the belief can manifest into harm. \n\nAs with the Ukraine incident: 'but what did he do wrong? It's just talk, he didn't mean what he said. What he meant was to find the votes the Democrats threw out.'\n\nTrump cannot do wrong to these people. Republicans cannot do wrong until they contradict Trump. It's impossible. As is the possibility of the Democrats doing anything that is not illegal, immoral, or deceptive. This belief is as powerful as their belief in God. It feels like they'd be torch bearers during the Salem witch trials.",
            "title_similarity": "0.34541845",
            "sentiment_compound": 0.8503
        },
        {
            "id": "htmxfar",
            "score": 548,
            "text": "We have him on tape asking the GA dude to find more votes, I mean c'mon!!",
            "title_similarity": "0.38687253",
            "sentiment_compound": 0.0
        },
        {
            "id": "htme5me",
            "score": 4311,
            "text": "10 months to election time.",
            "title_similarity": "0.4084952",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmjuy5",
            "score": 1,
            "text": "ruh-roh, Raggy.",
            "title_similarity": "0.18908736",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmkg2r",
            "score": 12,
            "text": "Can the committee members start dropping tidbits of info to political shows already or are they classified so that we can't hear anything in a while?",
            "title_similarity": "0.3675384",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmklec",
            "score": 9,
            "text": "I just need these published for toilet-reading sake",
            "title_similarity": "0.20225891",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmpt4y",
            "score": 2,
            "text": "So much crayon..",
            "title_similarity": "0.20188619",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmptz9",
            "score": 2,
            "text": "Sharpee marks all over them",
            "title_similarity": "0.15626353",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmpz8s",
            "score": 72,
            "text": "Let hope it get some GOP held accountable when it comes out to the public",
            "title_similarity": "0.32921994",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htmqxhp",
            "score": 6,
            "text": "Now everyone will finally get to see how innocent Trump is! /s",
            "title_similarity": "0.3164271",
            "sentiment_compound": 0.4003
        },
        {
            "id": "htmrmla",
            "score": 13,
            "text": "The records that Trump didn’t swallow.",
            "title_similarity": "0.32540897",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmrpbh",
            "score": 1,
            "text": "I wonder if all the damning evidence contained therein will actually lead to actions taken against those who’ve deliberately worked to destroy our democracy.",
            "title_similarity": "0.2422222",
            "sentiment_compound": -0.7096
        },
        {
            "id": "htmuv44",
            "score": 3,
            "text": "wow, never thought this day would actually arrive",
            "title_similarity": "0.20397773",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htmwoai",
            "score": 1,
            "text": "time to buy some popcorn stonks cuz things gonna get cookin soon?",
            "title_similarity": "0.24448693",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmy6yo",
            "score": 13,
            "text": "To be more specific, records that Donald didn't eat.",
            "title_similarity": "0.32992253",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmyp3f",
            "score": 1,
            "text": "There’ll be a hot time in the trump household tonight",
            "title_similarity": "0.41066673",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmzmi9",
            "score": 1,
            "text": "Is this delicious, it tastes delicious.",
            "title_similarity": "0.097830996",
            "sentiment_compound": 0.8126
        },
        {
            "id": "htn09o7",
            "score": 1,
            "text": "Is this the type of stuff that can requested under FOIA?",
            "title_similarity": "0.37361032",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn3js9",
            "score": 1,
            "text": "Good.",
            "title_similarity": "0.15358858",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htn47xg",
            "score": 13,
            "text": "It's been a while since we've had an F5 Friday.",
            "title_similarity": "0.29287112",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn4laa",
            "score": 1,
            "text": "So... Consequences? Finally?",
            "title_similarity": "0.22151254",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn4zgf",
            "score": 1,
            "text": "Absolutely wild that someone can run a COUNTRY for four years without having any obligation to pass notes to the next admin.",
            "title_similarity": "0.44205746",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn503l",
            "score": 1,
            "text": "I Hear the crying from a certain political party already lol",
            "title_similarity": "0.3646242",
            "sentiment_compound": 0.5423
        },
        {
            "id": "htn52kg",
            "score": 1,
            "text": "Someone ELI5. Is this something I should get my hopes over as far as all of this news coming out goes leading to anything?",
            "title_similarity": "0.35245848",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htn53uz",
            "score": 1,
            "text": "Now let's hope the committee actually holds him and his associates accountable to fullest extent of the law.",
            "title_similarity": "0.42658287",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htn53yf",
            "score": 4,
            "text": "I can’t believe all these documents were kept! One would think they’d have realized not to communicate through official channels if they were planning a coup.",
            "title_similarity": "0.29776442",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn570b",
            "score": 2,
            "text": "Shame we cant recover the documents he fucking ATE.",
            "title_similarity": "0.23319563",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htn5bev",
            "score": 1,
            "text": "Great, now give us results.",
            "title_similarity": "0.27751276",
            "sentiment_compound": 0.6249
        },
        {
            "id": "htn5pk1",
            "score": 1,
            "text": "Slowest shoe drop ever... 🤡",
            "title_similarity": "0.10548679",
            "sentiment_compound": -0.2732
        },
        {
            "id": "htn60qc",
            "score": 3,
            "text": "Fuck that prick. The only person Donald Trump cares about is Donald Trump. How Republicans voted for him is just mind boggling.",
            "title_similarity": "0.38148326",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htn63uc",
            "score": 7,
            "text": "Are they written in crayon or sharpie?",
            "title_similarity": "0.21433878",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn65d4",
            "score": 1,
            "text": "What do they feel like I wonder",
            "title_similarity": "0.15249059",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htn67c0",
            "score": 2,
            "text": "I bet that gonna scare the orange right off of him",
            "title_similarity": "0.115855254",
            "sentiment_compound": -0.4939
        },
        {
            "id": "htn68ha",
            "score": 5,
            "text": "Not having the best day, but somehow there is now a smile on my face.",
            "title_similarity": "0.0970051",
            "sentiment_compound": 0.2654
        },
        {
            "id": "htn6ez1",
            "score": 2,
            "text": "Lock him up",
            "title_similarity": "0.22885755",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn6iwz",
            "score": 12,
            "text": "So we have official documents proving Trump committed treason and sedition. \n\nBut his fascist supporters will still deny reality.",
            "title_similarity": "0.34054214",
            "sentiment_compound": -0.7543
        },
        {
            "id": "htn6iy4",
            "score": 3,
            "text": "I’d like to imagine Trump is just frantically searching the internet for “How to apply for asylum in Russia” and “flights to Moscow.”",
            "title_similarity": "0.43255734",
            "sentiment_compound": 0.0258
        },
        {
            "id": "htn6od8",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htn6q9q",
            "score": 1,
            "text": "Who ever decides to take the roll of making a series about the Trump administration, has enough material for probably 20 seasons.",
            "title_similarity": "0.51211315",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn6ufa",
            "score": 2,
            "text": "Although this is awesome,  I don’t see anything coming from it.  I have lost all hope for justice.  It does not exist in this country.  \n\n\nFor the love of god prove me wrong someone.",
            "title_similarity": "0.14014256",
            "sentiment_compound": 0.9062
        },
        {
            "id": "htn6vdg",
            "score": 2,
            "text": "Guesses as to what might be in these documents?",
            "title_similarity": "0.27925754",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn6zbw",
            "score": 1,
            "text": "First page “If you’re reading this it’s too late”",
            "title_similarity": "0.1984868",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn71f1",
            "score": 1,
            "text": "[How fun!](https://youtube.com/clip/UgkxraLDByD5B6K-l4pCl7Ohp0SAawYTOe5s)",
            "title_similarity": "0.2789396",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn722r",
            "score": 1,
            "text": "Sources say there is a map showing the Proud Boys making it outside the chambers, but someone used a sharpie to draw them making it all the way to Pence and Pelosi.",
            "title_similarity": "0.335466",
            "sentiment_compound": 0.2617
        },
        {
            "id": "htn75gv",
            "score": 2,
            "text": "No doubt clear evidence of treasonous sedition. But I bet Fox news won't even cover this story.",
            "title_similarity": "0.3071067",
            "sentiment_compound": -0.5085
        },
        {
            "id": "htn75sr",
            "score": 1,
            "text": "So if the committee finds criminal wrong doing what are the next steps?  Do those findings get pushed to the Supreme Court?  If that is the case I can see any and all charges being dropped due to the trump appointed majority.  Sad",
            "title_similarity": "0.4744784",
            "sentiment_compound": -0.8156
        },
        {
            "id": "htn77qk",
            "score": 5,
            "text": "I wish there was a live feed of them reading the records. I’d place serious bets on how often someone exclaimed “what the fuck” out loud.",
            "title_similarity": "0.27117413",
            "sentiment_compound": 0.34
        },
        {
            "id": "htn78zx",
            "score": 1,
            "text": "To be a fly on that wall",
            "title_similarity": "0.27948052",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn7cpg",
            "score": 1,
            "text": "Fuck him right I’m his stupid face",
            "title_similarity": "0.10687207",
            "sentiment_compound": -0.7845
        },
        {
            "id": "htn7efx",
            "score": 1,
            "text": "Ok but arrest him before he's escapes to place that won't extradite him.",
            "title_similarity": "0.2149056",
            "sentiment_compound": -0.1901
        },
        {
            "id": "htn7rl1",
            "score": 1,
            "text": "I can only get so hard",
            "title_similarity": "0.11666419",
            "sentiment_compound": -0.2183
        },
        {
            "id": "htn7u8y",
            "score": 13,
            "text": "Get fucked you orange piece of shit 👌",
            "title_similarity": "0.139651",
            "sentiment_compound": -0.4342
        },
        {
            "id": "htn7w3b",
            "score": 5,
            "text": "The potential spiciness of this meatball is through the roof.",
            "title_similarity": "0.15717092",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn7wk7",
            "score": 1,
            "text": "I've been through the vicious cycle of hoping Trump will see accountability for anything for far too long, but the thought of him squirming over this at least makes me smile.",
            "title_similarity": "0.27287292",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htn7zct",
            "score": 1,
            "text": "The Chronicles of Nara...",
            "title_similarity": "0.32654732",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn86eg",
            "score": 2,
            "text": "As I tell my mom, if he didn’t do anything wrong why is he so defensive? He’s got nothing to worry about if he didn’t break the law right",
            "title_similarity": "0.24647497",
            "sentiment_compound": -0.0523
        },
        {
            "id": "htn87it",
            "score": 2,
            "text": "Don’t most of his supports believe that if you didn’t do anything wrong you should have no problem talking to authorities? \n\nWonder why he’s so scared for people to know what happened 🙄",
            "title_similarity": "0.18519367",
            "sentiment_compound": -0.4252
        },
        {
            "id": "htn8d2h",
            "score": 2,
            "text": "The fact that Trump, many of his various cronies, Republicans in the House and Senate, and other people the committee has tried to question have at EVERY turn tried to stonewall looking into 1/6 proves a few things:\n\n1) They're not in anyway interested in why or how an attack on America occurred.\n\n2) Their claims of some kind of secret BLM or whatever conspirators disguised themselves as Trump supporters is total trash or they'd be ALL over getting to the truth of what happened.\n\n3) They love Trump more than the USA.  Which is utterly pathetic.",
            "title_similarity": "0.36212698",
            "sentiment_compound": -0.2619
        },
        {
            "id": "htn8eiy",
            "score": 1,
            "text": "Why not public?",
            "title_similarity": "0.08557903",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn8fus",
            "score": 1,
            "text": "Uh-oh Spaghetti O's!",
            "title_similarity": "0.11085974",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn8h41",
            "score": 2,
            "text": "Please put him in prison already",
            "title_similarity": "0.34623086",
            "sentiment_compound": -0.25
        },
        {
            "id": "htn8kuu",
            "score": 2,
            "text": "Time for donny to get to see what his beloved prisons are like from the inside perspective.",
            "title_similarity": "0.42142662",
            "sentiment_compound": 0.7003
        },
        {
            "id": "htn8tse",
            "score": 2,
            "text": "Couldn’t happen to a shittier family…",
            "title_similarity": "0.23894991",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htn8xd4",
            "score": 2,
            "text": "God, I hope they are as fucked as I think they are.",
            "title_similarity": "0.17691106",
            "sentiment_compound": -0.1027
        },
        {
            "id": "htn8y8j",
            "score": 1,
            "text": "So, is treason still an offense that can be punished with execution, or...?",
            "title_similarity": "0.18914437",
            "sentiment_compound": -0.7845
        },
        {
            "id": "htn8ydp",
            "score": 3,
            "text": "Is the former President suddenly going to take a trip to Russia?",
            "title_similarity": "0.4672111",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn92hj",
            "score": 1,
            "text": "Finally Trump gets what he deserves. Justice.",
            "title_similarity": "0.3797012",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htn95tr",
            "score": 1,
            "text": "Whatever, wake me up when there’s justice",
            "title_similarity": "0.33168933",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htn96ex",
            "score": 5,
            "text": "This is why it is important to respect the peaceful transfer of power and to aid in that transfer. Trump couldn't do that and he is reaping what he sowed.",
            "title_similarity": "0.35610753",
            "sentiment_compound": 0.7964
        },
        {
            "id": "htn97nj",
            "score": 2,
            "text": "TFG might be shitting his Depends right now.",
            "title_similarity": "0.28952342",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htn9cpw",
            "score": 1,
            "text": "Any chance of the death penalty?",
            "title_similarity": "0.16199036",
            "sentiment_compound": -0.7096
        },
        {
            "id": "htn9ds2",
            "score": 2,
            "text": "Now let's put him before the committee in a public hearing.",
            "title_similarity": "0.50627726",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn9fti",
            "score": 1,
            "text": "“Why are these sticky?”",
            "title_similarity": "0.067593105",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn9ptg",
            "score": 1,
            "text": "certainly, this is where all the republican voters come out and show us that we were the fools all along, and theres nothing in those files!  \n\n\nidk even what to say, it still baffles me that we are at this point, this shit has been SO OBVIOUS since day 1.  \n\n\nlike i have a real question, what if president trump literally just shot and killed president biden in plain sight, on camera, would we really be going through a year+ of time to declare trump guilty? or hell, maybe even innocent? i really dont get how anythingg works anymore.",
            "title_similarity": "0.36539325",
            "sentiment_compound": -0.9442
        },
        {
            "id": "htn9qtx",
            "score": 1,
            "text": "Yeah I know about the news and I watch the news all the time so see what’s going on and I want him the new to see if someone get killed or kidnapped and I hate when people get killed or kidnapped cuz I got little brothers they keep going outside in the dark and they are not supposed to and o keep saying that they will get kidnapped",
            "title_similarity": "0.28359988",
            "sentiment_compound": -0.9042
        },
        {
            "id": "htn9rv5",
            "score": 10,
            "text": "I'm just waiting until they release the unedited outtakes and early versions of his video taped message to the insurrectionists on Jan 6th.  You know the early cuts have to be incriminating and horrific when the final cut was that bad.",
            "title_similarity": "0.35117924",
            "sentiment_compound": -0.9042
        },
        {
            "id": "htn9ryj",
            "score": 1,
            "text": "FoxNews is gonna be fun tonight!",
            "title_similarity": "0.30749893",
            "sentiment_compound": 0.5562
        },
        {
            "id": "htn9sby",
            "score": 1,
            "text": "I have M.U.S.C.L.E. figures now in my hands.",
            "title_similarity": "0.4671312",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn9xko",
            "score": 1,
            "text": "Wonder what *they'll* do when they're God Emperor is imprisoned..",
            "title_similarity": "0.37159723",
            "sentiment_compound": -0.2263
        },
        {
            "id": "htn9xvx",
            "score": 2,
            "text": "Specifically, the Jan 6 committee’s regular-sized hands. Something Trump has been intimidated by his entire life",
            "title_similarity": "0.4700026",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htna0ln",
            "score": 1,
            "text": "These should be made public in their entirety.",
            "title_similarity": "0.27752036",
            "sentiment_compound": 0.0
        },
        {
            "id": "htna7ta",
            "score": 1,
            "text": "Hype",
            "title_similarity": "0.1506027",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnaacu",
            "score": 4,
            "text": "Lol get fucked Donny boy.",
            "title_similarity": "0.23929052",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htnacvt",
            "score": 1,
            "text": "Waana bet they are heavily redacted?",
            "title_similarity": "0.28906897",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnaej8",
            "score": 1,
            "text": "And they are long fingered hands too",
            "title_similarity": "0.12044515",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnaev5",
            "score": 1,
            "text": "Well whoop-de-doo, Basil. What does it mean?",
            "title_similarity": "0.2293469",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htnafsd",
            "score": 1,
            "text": "Anyone else tired of hearing about this guy?",
            "title_similarity": "0.13611567",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htnagae",
            "score": 1,
            "text": "*sweats in orange*",
            "title_similarity": "0.09473519",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnah76",
            "score": 3,
            "text": "What about the meetings with Putin where Donald stole the translators notes?  Will they be included?",
            "title_similarity": "0.5039896",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnai1a",
            "score": 2,
            "text": "About damn time",
            "title_similarity": "0.24149197",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htnaj62",
            "score": 1,
            "text": "How awk would it be if any of the gop members of the committee are in these docs",
            "title_similarity": "0.42632735",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnajoq",
            "score": 1,
            "text": "Honestly surprised they didn't them on the way out",
            "title_similarity": "0.18019113",
            "sentiment_compound": 0.5994
        },
        {
            "id": "htnakjf",
            "score": 2,
            "text": "Trump already has his fake mustache on and is answering to Donaldo Trumpez",
            "title_similarity": "0.5070744",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htnandh",
            "score": 1,
            "text": "Maybe we can finally figure out who Mr. Elegant is.",
            "title_similarity": "0.32751685",
            "sentiment_compound": 0.4767
        },
        {
            "id": "htnayfz",
            "score": 1,
            "text": "Long have I waited for this moment. If justice is real, Trump would in a jail cell, branded as a traitor to America.",
            "title_similarity": "0.46329987",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htnazxv",
            "score": 1,
            "text": "Finally after so long",
            "title_similarity": "0.21678619",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnb44k",
            "score": 1,
            "text": "As an outsider looking in. What’s the end game here? He’s guilty right? The question now becomes will the democrats have the stomach to pursue a real conviction. Or if doing so would ignite the trump base for a huge midterm turn out. Democrats are damned if they do damned if they don’t.",
            "title_similarity": "0.35995406",
            "sentiment_compound": -0.7236
        },
        {
            "id": "htnb4ce",
            "score": 1,
            "text": "Let the good times roll!",
            "title_similarity": "0.23536192",
            "sentiment_compound": 0.4926
        },
        {
            "id": "htnb5m5",
            "score": 1,
            "text": "I sorta hope he’s right saying it has nothing to do with the riots…but it’s like an embarrassing amount of emails from his doctor about his erectile disfunction that’s he’s been trying to use executive privilege to hide",
            "title_similarity": "0.27221796",
            "sentiment_compound": 0.5118
        },
        {
            "id": "htnb5ws",
            "score": 1,
            "text": "oh shit",
            "title_similarity": "0.13766819",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htnb5xq",
            "score": 1,
            "text": "Well that only took forever… here’s to hoping for results.",
            "title_similarity": "0.21853593",
            "sentiment_compound": 0.5994
        },
        {
            "id": "htnb61g",
            "score": 1,
            "text": "Put them in the hands of the media",
            "title_similarity": "0.3673706",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnb62r",
            "score": 1,
            "text": "Let the games begin",
            "title_similarity": "0.31078455",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnbacf",
            "score": 1,
            "text": "Dude’s more slippery than porcelain in dish soap. Pretty sure this will be zero sum dnc posturing and rnc lying.",
            "title_similarity": "0.2148693",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htnbdbf",
            "score": 1,
            "text": "Huh... Neat.",
            "title_similarity": "0.1512591",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htnbg9d",
            "score": 1,
            "text": "inb4 nothing because legal bullshit",
            "title_similarity": "0.20779212",
            "sentiment_compound": 0.4023
        },
        {
            "id": "htnbtvs",
            "score": 2,
            "text": "I wonder how many of these documents are taped-together bits of shredded paper…",
            "title_similarity": "0.22188959",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnburr",
            "score": 1,
            "text": "What about his tax returns?",
            "title_similarity": "0.49297497",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnc57n",
            "score": 3,
            "text": "Why did I hear the law and order music in my head",
            "title_similarity": "0.36501437",
            "sentiment_compound": 0.0
        },
        {
            "id": "htncbln",
            "score": 1,
            "text": "so u can try to overthrow the government and it'll take em over a year to simply give records about the incident to an official investigation.",
            "title_similarity": "0.4570304",
            "sentiment_compound": 0.0
        },
        {
            "id": "htncuvw",
            "score": 1,
            "text": "I hope he wasn't able to hide anything important when they were shredding everything just before  Biden came in",
            "title_similarity": "0.28393298",
            "sentiment_compound": 0.6391
        },
        {
            "id": "htnd015",
            "score": 2,
            "text": "There is a very remote possibility that Dump, thinking he was very close to becoming President for Life, broke protocol and actually wrote down or said a statement that proves his criminal intent.",
            "title_similarity": "0.38963136",
            "sentiment_compound": -0.8316
        },
        {
            "id": "htnd2le",
            "score": 1,
            "text": "How much of that 750 pages are just Diet Coke receipts?",
            "title_similarity": "0.29826686",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnd5xi",
            "score": 1,
            "text": "Serious question: will this ever be officially labeled a coup? Or will it still be an insurrection/protest/tour of the Capitol forever?",
            "title_similarity": "0.45685148",
            "sentiment_compound": -0.168
        },
        {
            "id": "htndkfs",
            "score": 1,
            "text": "This is good",
            "title_similarity": "0.12048543",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htndmmo",
            "score": 1,
            "text": "Maybe what he is really hiding is emails to Glisine Maxwell. Hmmm………,,",
            "title_similarity": "0.30898735",
            "sentiment_compound": -0.3597
        },
        {
            "id": "htneb0p",
            "score": 1,
            "text": "Game ovet",
            "title_similarity": "0.2824301",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnebiw",
            "score": 1,
            "text": "woooow",
            "title_similarity": "0.16443849",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnebvs",
            "score": 1,
            "text": "Soon he will go to prison. Then I will finally be able to rest. No more anxiety and depression. Because justice will finally be served.",
            "title_similarity": "0.31776688",
            "sentiment_compound": -0.6431
        },
        {
            "id": "htnei99",
            "score": 1,
            "text": "Should I buy champagne now or later for his pero walk?",
            "title_similarity": "0.31455064",
            "sentiment_compound": 0.296
        },
        {
            "id": "htnekue",
            "score": 2,
            "text": "Make them public.",
            "title_similarity": "0.22146365",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnep7z",
            "score": 1,
            "text": "Ya'll got your popcorn buckets ready?",
            "title_similarity": "0.21073277",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htnets2",
            "score": 1,
            "text": "What if... like what if he's convicted of treason...",
            "title_similarity": "0.24052857",
            "sentiment_compound": -0.1027
        },
        {
            "id": "htnev3n",
            "score": 11,
            "text": "To all the people yesterday who claimed this would never happen, looks like you'll need to find a new way to spread your apathy.",
            "title_similarity": "0.30557162",
            "sentiment_compound": -0.5122
        },
        {
            "id": "htnewt5",
            "score": 1,
            "text": "Anyone else here a fan of turtles?",
            "title_similarity": "0.21103033",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htnfkg7",
            "score": 1,
            "text": "Typical Trump play- delay, delay delay. The Justice Dept and the Jan 6 committee needs to get a move on before he runs out the clock",
            "title_similarity": "0.5359061",
            "sentiment_compound": -0.0258
        },
        {
            "id": "htnfl8g",
            "score": 1,
            "text": "Oh, little racist Republicans, you’re all so fucked!",
            "title_similarity": "0.18952164",
            "sentiment_compound": -0.8913
        },
        {
            "id": "htnfqnr",
            "score": 1,
            "text": "Trump about to take a vacation over sees soon",
            "title_similarity": "0.4665393",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnfqo6",
            "score": 2,
            "text": "Please let this be finally something meaningfully **bad** for trump and the republicans protecting him.",
            "title_similarity": "0.5286251",
            "sentiment_compound": -0.296
        },
        {
            "id": "htnfzkl",
            "score": 1,
            "text": "Why not in the hands of the public?",
            "title_similarity": "0.15973607",
            "sentiment_compound": 0.0
        },
        {
            "id": "htng4ae",
            "score": 1,
            "text": "I didn’t think we’d actually make it this far",
            "title_similarity": "0.124703124",
            "sentiment_compound": 0.0
        },
        {
            "id": "htng68s",
            "score": 4,
            "text": "One of the most morbidly funny things is watching folks like /r conspiracy lob support at the most conspiratorial president I think we have had in living memory. Trump did shit like setting up shadowy back channels for foreign countries just to blackmail their leader and now he’s trying to extend executive privilege to ridiculous levels just to cover up what happened during his administration… and they love him.",
            "title_similarity": "0.3837493",
            "sentiment_compound": 0.8307
        },
        {
            "id": "htng6a8",
            "score": 35,
            "text": "Get fucked Donny",
            "title_similarity": "0.20815942",
            "sentiment_compound": -0.6597
        },
        {
            "id": "htng7vm",
            "score": 2,
            "text": "Be a shame if the committee were to leak some of those records....",
            "title_similarity": "0.30286855",
            "sentiment_compound": -0.6705
        },
        {
            "id": "htngkje",
            "score": 8,
            "text": "Can we have a nice little video explaining just how Trump tried to foment an insurrection? Because it seems a lot of people have an issue with literacy, so we need to explain in simple terms just how close we came to seeing Trump and family set up as a dictator.",
            "title_similarity": "0.43141428",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htngl4n",
            "score": 2,
            "text": "Yeah, but are they? Bet the man has broken every rule you could possibly break to hide shit.",
            "title_similarity": "0.22173059",
            "sentiment_compound": -0.8885
        },
        {
            "id": "htngutf",
            "score": 1,
            "text": "He's either going to prison or getting off Scot-free.\n\nGonna be an uproar either way.",
            "title_similarity": "0.25890929",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htnh4hs",
            "score": 1,
            "text": "As a public sector employee in the US, records are only discoverable if we create them. If us peons know this, what does the committee expect to find/learn from these documents?",
            "title_similarity": "0.52363336",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htnh8bz",
            "score": 14,
            "text": "Everyone who is upset that charges haven’t been made yet need to pump the breaks because shit takes a fuck ton of time",
            "title_similarity": "0.17727323",
            "sentiment_compound": -0.8957
        },
        {
            "id": "htnh9zo",
            "score": 2,
            "text": "Legacy is so important to presidents. Trump kept those records because he was proud of them as part of his Legacy. Then everything turned sideways…",
            "title_similarity": "0.39377826",
            "sentiment_compound": 0.6669
        },
        {
            "id": "htnhdm5",
            "score": 1,
            "text": "May have committed some light treason",
            "title_similarity": "0.17601015",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htnhj3s",
            "score": 1,
            "text": "Just in from the award-winning Fucked Around And Found Out Action Team-",
            "title_similarity": "0.35871086",
            "sentiment_compound": -0.6597
        },
        {
            "id": "htnhxil",
            "score": 1,
            "text": "Prepare for nothing to fundamentally change!",
            "title_similarity": "0.22103648",
            "sentiment_compound": 0.0
        },
        {
            "id": "htni3md",
            "score": 1,
            "text": "I really hope this ends in the way everyone thinks it will but I HIGHLY doubt anything is going to happen. I really hope I'm wrong though",
            "title_similarity": "0.11080594",
            "sentiment_compound": -0.6057
        },
        {
            "id": "htniu3e",
            "score": 1,
            "text": "Hell yes!",
            "title_similarity": "0.1845505",
            "sentiment_compound": -0.4926
        },
        {
            "id": "htniz20",
            "score": 1,
            "text": "Jan 6 committee seeks aid from r/wallstreetbets as the records are all in crayon.",
            "title_similarity": "0.4983844",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnj9mc",
            "score": 1,
            "text": "What does that mean?",
            "title_similarity": "0.15946874",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnjk87",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htnk6my",
            "score": 6,
            "text": "Hold the live hearings just prior to the midterm elections. That’s how the republicans played the Benghazi hearings.",
            "title_similarity": "0.5895512",
            "sentiment_compound": 0.34
        },
        {
            "id": "htnk9nk",
            "score": 2,
            "text": "Silly question: Can anything come out that would ban trump from legally being a candidate in the next election? \nWe all know he had a heavy hand in J6- so is the objective to disclose evidence to the public so that they don’t re-elect him? OR is it to legally prosecute him? Or legally keep him from running again? \nWhat is the best case scenario here?",
            "title_similarity": "0.42951608",
            "sentiment_compound": 0.6553
        },
        {
            "id": "htnkb04",
            "score": 2,
            "text": "the walls are closing in",
            "title_similarity": "0.12908481",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnl75p",
            "score": 1,
            "text": "Sooo what does this mean lok",
            "title_similarity": "0.25725636",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnlb3x",
            "score": 1,
            "text": "Should also be in the hands of the public yo",
            "title_similarity": "0.2620896",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnldmz",
            "score": 1,
            "text": "Oh snap, get your popcorn",
            "title_similarity": "0.15602851",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnllxv",
            "score": 1,
            "text": "This means fuckall until something is actually done to someone higher than traffic cop.",
            "title_similarity": "0.23767494",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnlpar",
            "score": 1,
            "text": "This is the party you are backing.",
            "title_similarity": "0.43449634",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htnlwj4",
            "score": 1,
            "text": "Well orange is his colour.",
            "title_similarity": "0.18149818",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htnlwzw",
            "score": 1,
            "text": "What does this mean?",
            "title_similarity": "0.1690386",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnm7qi",
            "score": 1,
            "text": "Huzzah!",
            "title_similarity": "0.2288383",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnmka9",
            "score": 2,
            "text": "Surely THIS will bring down Drumph 🥴",
            "title_similarity": "0.22610885",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htnmno9",
            "score": 1,
            "text": "Nothing is gonna happen anyways",
            "title_similarity": "0.08312916",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnmo9j",
            "score": 1,
            "text": "Leak! Leak! Leak! Leak! Let’s go!",
            "title_similarity": "0.13978466",
            "sentiment_compound": -0.8679
        },
        {
            "id": "htnmrjx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13516343"
        },
        {
            "id": "htnn17e",
            "score": 1,
            "text": "I mean, who cares? Nothing will happen, as usual.",
            "title_similarity": "0.12364802",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htnn2zj",
            "score": 2,
            "text": "Can't wait for absolutely nothing to come of this because we live in a world of little justice.",
            "title_similarity": "0.14427719",
            "sentiment_compound": 0.4779
        },
        {
            "id": "htnn8cd",
            "score": 1,
            "text": "I’ve given up on holding out hope that he’s ever going to be held accountable for anything. So meh.",
            "title_similarity": "0.23875391",
            "sentiment_compound": 0.2866
        },
        {
            "id": "htnn9ft",
            "score": 1,
            "text": "So…. As usual nothing will happen. Politicians are held to a different standard than us citizens are.",
            "title_similarity": "0.27124703",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnn9oj",
            "score": 1,
            "text": "He’s just gonna walk, nothing will change or happen. Anybody who’s been “waiting” will realize the same thing a lot of us already knew.\n\n“When you’re famous they just let you do it”. \n\nLol",
            "title_similarity": "0.3219797",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htnncgv",
            "score": 1,
            "text": "FOIA nao",
            "title_similarity": "0.2298431",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnne2m",
            "score": 1,
            "text": "So now there's absolutely zero excuse not to bring charges?",
            "title_similarity": "0.15233785",
            "sentiment_compound": 0.3383
        },
        {
            "id": "htnno5x",
            "score": 1,
            "text": "And??",
            "title_similarity": "0.16306117",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnnv6h",
            "score": 2,
            "text": "About time. Anyone know what the huge delay was?",
            "title_similarity": "0.24647921",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnnva6",
            "score": 1,
            "text": "Bye traitor Trump.",
            "title_similarity": "0.37796664",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnny8i",
            "score": 1,
            "text": "They are mostly there",
            "title_similarity": "0.15684327",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnnzmb",
            "score": 1,
            "text": "Because they are Republicans to even things out",
            "title_similarity": "0.3424775",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnohm3",
            "score": 16,
            "text": "It’s insane there are people who think this guy is innocent",
            "title_similarity": "0.11883728",
            "sentiment_compound": -0.0772
        },
        {
            "id": "htnoik4",
            "score": 1,
            "text": "Well sure, the ones that haven't been eaten",
            "title_similarity": "0.10472133",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htnoqs8",
            "score": 3,
            "text": "Now make the fucker squirm",
            "title_similarity": "0.11505966",
            "sentiment_compound": -0.6486
        },
        {
            "id": "htnox22",
            "score": 2,
            "text": "How long before the leaks start?? Starting squares.",
            "title_similarity": "0.33878776",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnp6qc",
            "score": 1,
            "text": "Nothings gonna happen. \n(See the last 4 years)",
            "title_similarity": "0.29698974",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnpg5a",
            "score": 4,
            "text": "Interesting that Putin chose now to make all this invasion noise.  He helping his boy Trump bury this story?",
            "title_similarity": "0.44627392",
            "sentiment_compound": 0.5994
        },
        {
            "id": "htnpo1t",
            "score": 1,
            "text": "I am surprised that Trump isn’t spruiking for Putin and his nothing to see here troop build up. Fuck both those guys.",
            "title_similarity": "0.34915945",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htnpqrx",
            "score": 1,
            "text": "And here, we, go…",
            "title_similarity": "0.2433592",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnpsyk",
            "score": 2,
            "text": "Giddyup!!",
            "title_similarity": "0.1444321",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnq1n7",
            "score": 1,
            "text": "Gasp!",
            "title_similarity": "0.1450486",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnq6b1",
            "score": 3,
            "text": "And spoiler alert absolutely nothing will happen because America is a joke",
            "title_similarity": "0.21750751",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htnq7ph",
            "score": 1,
            "text": "Hell yea",
            "title_similarity": "0.12631103",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htnqa5u",
            "score": 1,
            "text": "they should just publish them.",
            "title_similarity": "0.24380237",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnqq5t",
            "score": 1,
            "text": "Best news so far.",
            "title_similarity": "0.21698311",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htnqvou",
            "score": 2,
            "text": "Spill that tea",
            "title_similarity": "0.14922497",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnqw9b",
            "score": 5,
            "text": "Over a year in and how many got the sentence they deserve for breaking, entering, sabotaging and stealing things from the Capital?  Let alone whatever else they planned if they ever got their hands on the elected officials?  Call me skeptical but I don’t expect much from this committee either.  I hope I’m proven wrong and every single person who broke into the building gets more than a little slap on their hands.",
            "title_similarity": "0.34552962",
            "sentiment_compound": -0.8047
        },
        {
            "id": "htnqymm",
            "score": 7,
            "text": "Can anyone else hear Gym Jordan's piss trickling down his leg while simultaneously sweating through his wrinkled dress shirt, or is it just me?",
            "title_similarity": "0.060182437",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htnr0rw",
            "score": 2,
            "text": "get tax returns while at it.",
            "title_similarity": "0.50292754",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnr8pl",
            "score": 1,
            "text": "https://www.youtube.com/watch?v=XcTPx1wJPPQ&via=tb",
            "title_similarity": "0.31566674",
            "sentiment_compound": 0.0
        },
        {
            "id": "htns1w4",
            "score": 1,
            "text": "Oh heck",
            "title_similarity": "0.12845072",
            "sentiment_compound": 0.0
        },
        {
            "id": "htns32g",
            "score": 1,
            "text": "I can’t wait for this damning evidence to be released, and then see absolutely no repercussions for those involved",
            "title_similarity": "0.2536943",
            "sentiment_compound": -0.642
        },
        {
            "id": "htns9sd",
            "score": 1,
            "text": "He should be given the highest possible sentence for treason",
            "title_similarity": "0.18311778",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htnsk9m",
            "score": 1,
            "text": "Make them public!",
            "title_similarity": "0.21872923",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnslx6",
            "score": 1,
            "text": "750 pages? That’s all? I though this would be thousands upon thousands of pages with all the shit and back and forth that went down.",
            "title_similarity": "0.2797728",
            "sentiment_compound": 0.6553
        },
        {
            "id": "htnsrwf",
            "score": 1,
            "text": "Wake me up when they actually get their fingers out and start prosecuting.",
            "title_similarity": "0.3756011",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnsuy8",
            "score": 2,
            "text": "How many of them are written in crayon with Big Mac special sauce stains in the margins?",
            "title_similarity": "0.21777752",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htnsxgs",
            "score": 2,
            "text": "I wonder how much there actually is. What with all the private email servers, use of non-approved phones, third party messaging apps, and destroyed papers , some of which trump actually ate. \n\nReally, they went deliberately out of their way to avoid leaving any evidence whatsoever.",
            "title_similarity": "0.2612878",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htnsyz9",
            "score": 2,
            "text": "Hurry please. Gah I hope they don’t shit the bed on this one.",
            "title_similarity": "0.2052927",
            "sentiment_compound": 0.1531
        },
        {
            "id": "htnt7ci",
            "score": 2,
            "text": "Treasonous mother flucker",
            "title_similarity": "0.15642609",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htntclg",
            "score": 2,
            "text": "Until the doj does something, it’s theatre",
            "title_similarity": "0.42411113",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnth6k",
            "score": 1,
            "text": "Bewry!!! Time to get the popcorn, as the fun starts now!",
            "title_similarity": "0.16708237",
            "sentiment_compound": 0.6671
        },
        {
            "id": "htntqyc",
            "score": 1,
            "text": "Only the ones he didn't eat.",
            "title_similarity": "0.061986696",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnts96",
            "score": 1,
            "text": "Everything else this yr has been one giant let down. Why won’t this be the same?",
            "title_similarity": "0.22819777",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnu41r",
            "score": 2,
            "text": "Don't. Hold. Back.",
            "title_similarity": "0.09855725",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnu63p",
            "score": 2,
            "text": "The ones they have not destroyed.",
            "title_similarity": "0.16474795",
            "sentiment_compound": 0.3875
        },
        {
            "id": "htnuiqg",
            "score": 3,
            "text": "I mean, that's a minimum for any credible investigation. Data.",
            "title_similarity": "0.3200113",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnurh2",
            "score": 1,
            "text": "What are they gonna do? Lol",
            "title_similarity": "0.22936428",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htnusri",
            "score": 1,
            "text": "Oh nice the stuff that puts people in jail is in the hands of people not putting people in jail.",
            "title_similarity": "0.3216631",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htnvgjo",
            "score": 1,
            "text": "<furiously reading through records> “huh, damn that’s a lot of Burger King”",
            "title_similarity": "0.22955549",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htnvipc",
            "score": 3,
            "text": "is that why Russia is threatening war?\n\nall from one little piss tape.",
            "title_similarity": "0.26857233",
            "sentiment_compound": -0.866
        },
        {
            "id": "htnvn5n",
            "score": 1,
            "text": "Yes!!!",
            "title_similarity": "0.18517363",
            "sentiment_compound": 0.5538
        },
        {
            "id": "htnvsyk",
            "score": 1,
            "text": "Trump had records? I thought he just made it up as he went along….",
            "title_similarity": "0.52641886",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnvwql",
            "score": 2,
            "text": "Let's see what trump has to say about [this](https://mobile.twitter.com/realDonaldTrump)",
            "title_similarity": "0.51682675",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnvzwc",
            "score": 2,
            "text": "Finally geez...some Republicans are sweating at night bout now.",
            "title_similarity": "0.2740104",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnvzxv",
            "score": 2,
            "text": "Fucking finally",
            "title_similarity": "0.2132742",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnwabl",
            "score": 3,
            "text": "Please please please make them suffer consequences for their actions!  \n\nHow is it that Al Frankin said: You know what, Imma leave so I don't cause damage to or embarrass Congress or the United States... Meanwhile, Just grab 'em by the pussy guy and all his friends try an insurrection and a lot of them still hold office?\n\nEvil prevails when good men (and women) do nothing.",
            "title_similarity": "0.29172736",
            "sentiment_compound": 0.7446
        },
        {
            "id": "htnwe7h",
            "score": 2,
            "text": "How much you wanna bet the text of the records is 500,000 pages of “Go fuck yourself” typed over and over, Jack Torrance style?",
            "title_similarity": "0.3984351",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htnwhaz",
            "score": 2,
            "text": "Ok here’s the punchline:\n\nImagine the type of records that trump has.\n\nDone in crayon on the blank side of a macdonalds cheeseburger wrapper.\n\nWith pictures.\n\n\nIdk what they expect to find out.",
            "title_similarity": "0.36263365",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htnwxye",
            "score": 3,
            "text": "Am I the only one who is worried about how the extremist Trump supporters are going to react if he's charged and sentenced?\n\nEdit - Just to clarify, I'm not arguing that he shouldn't be charged and sentenced. He definitely should be. But a lot of these people are fucking insane.",
            "title_similarity": "0.33413917",
            "sentiment_compound": -0.3079
        },
        {
            "id": "htnwzis",
            "score": 2,
            "text": "Ok, great! \nAnd while we wait for someone, somehow to do something with all this new information, everyone needs to act like we WANT democracy to continue. Check your voting status. Offer to take an elderly person to the polls with you when you go. Show up at primaries.  Use the power you have to do good!! \n(I’ll step off my soapbox now….any takers for more ideas?!)",
            "title_similarity": "0.44899687",
            "sentiment_compound": 0.9136
        },
        {
            "id": "htnwzmc",
            "score": 1,
            "text": "Lock Him Up",
            "title_similarity": "0.22885755",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnx1sf",
            "score": 1,
            "text": "Don't do this to me. Don't give me hope.",
            "title_similarity": "0.0937673",
            "sentiment_compound": -0.3412
        },
        {
            "id": "htnx65w",
            "score": 5,
            "text": "Trump will be in prison soon. January 6th was obviously planned by him and his traitor friends who are in the GOP…..",
            "title_similarity": "0.58463794",
            "sentiment_compound": -0.0516
        },
        {
            "id": "htnxlrc",
            "score": 10,
            "text": "I feel like legalizing marijuana and using its tax revenue to pay for universal healthcare and education along with erasing student loan debt would be a slam dunk but the dems are like “Nah let’s just lose the majority and presidency.”",
            "title_similarity": "0.33768672",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htnxo23",
            "score": 2,
            "text": "Hopefully something actually becomes of it. Traitors deserve life without the possibility of parole",
            "title_similarity": "0.21795477",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htny8t7",
            "score": 6,
            "text": "Got a text from the local Democratic office, asking if I would run for office.  They need people.  Now’s the time for us to step up and get involved.",
            "title_similarity": "0.42206386",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnyhq7",
            "score": 2,
            "text": "Now to decipher all the crayon drawings.",
            "title_similarity": "0.30846086",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnzme1",
            "score": 1,
            "text": "Everyone already knows trump is culpable. All we’re finding out is wether or not anything is going to happen about it, and I’m putting money on nothing.",
            "title_similarity": "0.3322985",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnzwqx",
            "score": 3,
            "text": "I would love to see Trumps react to this right now. Laying in bed wolfing down cold hamberders, doing lines of Sudafed, washing it all down with diet Coke, and failing to log into twitter to rage.",
            "title_similarity": "0.21345195",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hto02r8",
            "score": 1,
            "text": "The biggest question is: How much of America will believe the outcome of said investigation…\n\nA lot of folk still believe covid is nonsense, and that Jan 6th 2021 was a false flag. \n\nSocial media (mostly Facebook/Meta) should be barred from political advertisements. If you want to learn about who you support, read their agenda.\n\nSomeone needs to propose a ban on political advertisements via social platform that don’t regulate misinformation.",
            "title_similarity": "0.37090647",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hto0q3q",
            "score": 5,
            "text": "I don’t understand how anyone can support the Republican party when they are doing nothing to support the American people. Their penchant to block everything the Democrats do does not help the American people. It is their way of getting revenge not helping.",
            "title_similarity": "0.23059618",
            "sentiment_compound": -0.7433
        },
        {
            "id": "hto157m",
            "score": 1,
            "text": "Remember Flounder in Animal House???\nOh boy….is this great!!!",
            "title_similarity": "0.42512935",
            "sentiment_compound": 0.8069
        },
        {
            "id": "hto1yg7",
            "score": 2,
            "text": "At this point I feel like the evidence could literally be Trump on camera knowingly confessing to everything he'd every done or dreamt of doing and STILL nothing will fucking happen.",
            "title_similarity": "0.2621502",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hto22kb",
            "score": 1,
            "text": "This is where the fun begins",
            "title_similarity": "0.1528885",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hto250u",
            "score": 1,
            "text": "Real question, without bias to what should happen etc does anyone have any insight in to what is likely to happen with this case? Can they ban trump from running again?",
            "title_similarity": "0.3935555",
            "sentiment_compound": -0.5667
        },
        {
            "id": "hto2aop",
            "score": 2,
            "text": "Oh snap! Did they get the pee pee tapes as well?",
            "title_similarity": "0.2577391",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hto2d7f",
            "score": 3,
            "text": "Waiting media do a freedom request to expose it",
            "title_similarity": "0.3758397",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hto2igw",
            "score": 1,
            "text": "Snails leave trails",
            "title_similarity": "0.19007981",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hto2oeu",
            "score": 2,
            "text": "Ok. When do WE get to see it",
            "title_similarity": "0.29169658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto2s0a",
            "score": 1,
            "text": "Rut Roh…",
            "title_similarity": "0.24829563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto2u0u",
            "score": 2,
            "text": "Are you trying to get a Trump supporter to think logically?",
            "title_similarity": "0.4466812",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hto2urm",
            "score": 2,
            "text": "The ones that survived anyway.",
            "title_similarity": "0.13762854",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hto3d9o",
            "score": 1,
            "text": "Praise democratic jesus!",
            "title_similarity": "0.34106818",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hto3kp3",
            "score": 3,
            "text": "They better appoint a special prosecutor that can't be fired.  With the GOP stealing the midterms, they could end all of this.",
            "title_similarity": "0.34639025",
            "sentiment_compound": 0.5892
        },
        {
            "id": "hto3ntg",
            "score": 1,
            "text": "So what? In the end nothing ever happens to the right wing criminals in power.",
            "title_similarity": "0.30811363",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hto3oqs",
            "score": 2,
            "text": "Rut row.",
            "title_similarity": "0.19534305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto3zsn",
            "score": 3,
            "text": "Ah, shits about to get interesting…",
            "title_similarity": "0.19357389",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hto4n31",
            "score": 1,
            "text": "And Faux News still complaining about the Biden response in Ukraine",
            "title_similarity": "0.2568892",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hto4qoc",
            "score": 1,
            "text": "I'm so jaded, this means nothing to me. I don't believe that anything at all will come of this charade.",
            "title_similarity": "0.13099778",
            "sentiment_compound": -0.4391
        },
        {
            "id": "hto4rxg",
            "score": 1,
            "text": "Waiting for GA...",
            "title_similarity": "0.19290239",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto4svu",
            "score": 1,
            "text": "Reminds me of this. Maybe Colorado will let us in. \n\nhttps://www.nytimes.com/2021/05/21/us/oregon-idaho-secession.html",
            "title_similarity": "0.4102316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto4tti",
            "score": 3,
            "text": "The panel is also looking into whether Mr Trump took any action to quell the violence that day, and has spoken to witnesses who have described the former president as having relished the sight of his supporters swarming the Capitol.\n\nYeah, I think we already know he did nothing to stop the violence.",
            "title_similarity": "0.47295266",
            "sentiment_compound": -0.4959
        },
        {
            "id": "hto4z37",
            "score": 3,
            "text": "Boy I sure can’t wait for absolutely nothing to get done still. I get that these things take time, but this shit is gonna get drawn out for as long as possible.",
            "title_similarity": "0.23223175",
            "sentiment_compound": -0.7371
        },
        {
            "id": "hto55qz",
            "score": 1,
            "text": "i wanna get hype but these always end up disappointing.",
            "title_similarity": "0.06791231",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hto5afl",
            "score": 2,
            "text": "I don’t have any faith trump will pay for his crimes but I would be delighted to see different",
            "title_similarity": "0.19087386",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hto5i4u",
            "score": 2,
            "text": "I want to see the Jan 6 Trump speech takes that were not used. If telling them all he loves them was the best one...",
            "title_similarity": "0.5227677",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hto5qsf",
            "score": 1,
            "text": "Too bad they're too wimpy to actually do anything with them. Maybe try and prosecute Giuliani. But the they're going to lose the house and Senate in November so Trump will get off Scott free. I've said it once and I'll say it again Democracy simply doesn't work.",
            "title_similarity": "0.337654",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hto5t6w",
            "score": 2,
            "text": "Im picturing his records being hundreds of happy meal boxes with the puzzles and mazes filled out incorrectly in crayon.",
            "title_similarity": "0.274311",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hto68eh",
            "score": 1,
            "text": "Wonder who's going to get bribed.",
            "title_similarity": "0.21725723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto6hhf",
            "score": 2,
            "text": "Make them available to the public right now",
            "title_similarity": "0.2734058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto6kgl",
            "score": 3,
            "text": "And, nothing will happen to the people at the top.  Oh sure, they will make an example of an overzealous staffer or two, but they won’t touch the donor class who directly funded the coup.",
            "title_similarity": "0.30220425",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hto6n0k",
            "score": 1,
            "text": "Last hope for democracy",
            "title_similarity": "0.26463395",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hto6p36",
            "score": 2,
            "text": "I hope this breaks the trend of no consequences...",
            "title_similarity": "0.11760167",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hto6yvx",
            "score": 3,
            "text": "Correction: whatever wasn’t destroyed is now in the hands of the January 6th committee.",
            "title_similarity": "0.7212719",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hto7q39",
            "score": 4,
            "text": "Don't forget the emoluments clause. Trump lied for 4 years straight about showing his taxes. Every president for the last 50 years has voluntarily turned over his taxes to prove there is no financial conflicts with running the nation. He refused but now NY has those taxes and from what I've heard there are some serious issues with money from Russia and loans being given to Trump that would not have been given to anyone else. Trump might be the face of the GOP at the next election and we may have a serious war on our hands to keep America a democracy but there is no way Trump will be able to run. He has already lost one election and with NYs investigation and Jan 6th investigation and Gorgia's investigation and hopefully the dep of Justices investigations and all the lawsuits on top of that and his age too. There is no way he'll run..... right?",
            "title_similarity": "0.4317203",
            "sentiment_compound": -0.8995
        },
        {
            "id": "hto7yc7",
            "score": 5,
            "text": "His “executive order” just came out—read it.  A coup de etat was the plan.  It speaks for itself.  It is now the responsibility of the Congress and the Justice Department…",
            "title_similarity": "0.5569978",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hto872f",
            "score": 9,
            "text": "ITT: Lots of brigading trying to downplay the news or otherwise cynically prognosticate on how nothing will come of it.",
            "title_similarity": "0.15578464",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hto8kzk",
            "score": 3,
            "text": ">\tEight of the nine justices — including all three appointed by Mr Trump — concurred in the ruling.\n\nOoo….that’s gotta sting.",
            "title_similarity": "0.50753784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto8m92",
            "score": 1,
            "text": "Burn.",
            "title_similarity": "0.1146989",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto8mja",
            "score": 3,
            "text": "Overheard moments later; \"It's all written in crayon?!\"",
            "title_similarity": "0.33479047",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto91y1",
            "score": 8,
            "text": "Holy shit the russian bots are strong in this thread!!",
            "title_similarity": "0.30071712",
            "sentiment_compound": -0.2225
        },
        {
            "id": "hto9bb0",
            "score": 1,
            "text": "I can’t wait to hear why he won’t be held accountable this time.",
            "title_similarity": "0.280596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto9bdc",
            "score": 2,
            "text": "This should have been done long ago!",
            "title_similarity": "0.26230234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto9ogf",
            "score": 1,
            "text": "Surely this time he’ll be charged with a crime, right? right? right guys? 😢😭😢😭😢",
            "title_similarity": "0.2257053",
            "sentiment_compound": -0.9548
        },
        {
            "id": "hto9qn0",
            "score": 1,
            "text": "I am not holding my breath. Nothing ever happen will ever happen to Trump",
            "title_similarity": "0.2494519",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoa858",
            "score": 2,
            "text": "Now the world will find out that his taste in music is just as bad as his taste in women. \n\nOh, not those kind of records. Sorry, I’ll close the door quietly as I sneak out.",
            "title_similarity": "0.1765429",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htoacgh",
            "score": 2,
            "text": "I wonder what Trump is feeling right now. \n\nOn the one hand, every bit of information he’s tried so desperately to hide is now available to the very committee that can lead to his downfall. \n\nOn the other hand, he’s a master manipulator and he’s got to know that dems won’t actually do jack shit.",
            "title_similarity": "0.40284806",
            "sentiment_compound": -0.257
        },
        {
            "id": "htoag4b",
            "score": 2,
            "text": "Surely this time something will happen, unlike the last dozen times this or that document was going to be THE ONE to put him away.",
            "title_similarity": "0.33627808",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htoauf9",
            "score": 2,
            "text": "'bout fucking time.",
            "title_similarity": "0.24599814",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoawcz",
            "score": 1,
            "text": "I hope the Jan 6 committee knows that as an investigative committee, they hce to investigate and charge, not sit there and look pretty. Hopefully Kinzinger or Cheney aren’t being suck ups for a profit nor sleeper agents.",
            "title_similarity": "0.43132448",
            "sentiment_compound": 0.8316
        },
        {
            "id": "htoayvi",
            "score": 2,
            "text": "Tik-Toc...",
            "title_similarity": "0.30366188",
            "sentiment_compound": 0.0
        },
        {
            "id": "htobnk2",
            "score": 2,
            "text": "Nothing will come out of it, unfortunately…",
            "title_similarity": "0.10725023",
            "sentiment_compound": 0.0
        },
        {
            "id": "htobuzs",
            "score": 1,
            "text": "What taking so long he did it on camera 🤷🏻‍♂️",
            "title_similarity": "0.23465219",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoc28n",
            "score": 2,
            "text": "Lut that loser in jail before then",
            "title_similarity": "0.33041364",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htoc398",
            "score": 1,
            "text": "Schwing!",
            "title_similarity": "0.14848885",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoc5tf",
            "score": 1,
            "text": "Of course.",
            "title_similarity": "0.1924552",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoc6hf",
            "score": 1,
            "text": "Only 750 pages?",
            "title_similarity": "0.2512601",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoc90f",
            "score": 2,
            "text": "He and his kids have to be charged with something. They all NEED to be charged so none of them can serve as President. Come on orange jumpsuits!",
            "title_similarity": "0.2867471",
            "sentiment_compound": -0.4389
        },
        {
            "id": "htocbuy",
            "score": 2,
            "text": "Getting ready for nothing to happen",
            "title_similarity": "0.13752922",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htocf0u",
            "score": 2,
            "text": "Wish I wasn’t this way, but I don’t believe for a second that any repercussions will come to Trump",
            "title_similarity": "0.24673033",
            "sentiment_compound": 0.2144
        },
        {
            "id": "htocjmd",
            "score": 1,
            "text": "Meanwhile our country is falling apart.",
            "title_similarity": "0.16892022",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htocwxh",
            "score": 4,
            "text": "People who voted for him were feeling disenfranchised I get it.",
            "title_similarity": "0.1661259",
            "sentiment_compound": 0.128
        },
        {
            "id": "htocy5a",
            "score": 2,
            "text": "I only hope that when the data's analyzed a weakness can be found. It's not over yet.",
            "title_similarity": "0.13767597",
            "sentiment_compound": 0.0258
        },
        {
            "id": "htod1qf",
            "score": 1,
            "text": "Who cares? He's not going anywhere. I think he even doesn't care lol",
            "title_similarity": "0.07632917",
            "sentiment_compound": -0.2406
        },
        {
            "id": "htod4cj",
            "score": 2,
            "text": "Welp, Donnie Moscow's screwed.",
            "title_similarity": "0.18389863",
            "sentiment_compound": -0.4939
        },
        {
            "id": "htoeb4o",
            "score": 2,
            "text": "From what I read he threw all the Jan 6 patriots (insurrectionist) under the bus - dam “he said you don’t represent me and deserve jail for storming the capital “ this is huge, used them as pawns",
            "title_similarity": "0.27522463",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htoec6f",
            "score": 2,
            "text": "I will rejoice when that bastard is in jail. Till then these headlines are just annoying.",
            "title_similarity": "0.21285997",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htoehsz",
            "score": 3,
            "text": "Accountability…? I will believe it when I see it",
            "title_similarity": "0.31889784",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoekr7",
            "score": 2,
            "text": "Finally!",
            "title_similarity": "0.19462454",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoesty",
            "score": 2,
            "text": "Yea but is anything going to happen?\nWhat happened to all the NY state charges that were going to ruin Trump?",
            "title_similarity": "0.41055948",
            "sentiment_compound": -0.8485
        },
        {
            "id": "htofsc0",
            "score": 1,
            "text": "Ok I keep seeing things about trump eating documents. Did that really happen ?",
            "title_similarity": "0.4928972",
            "sentiment_compound": 0.296
        },
        {
            "id": "htofvh8",
            "score": 2,
            "text": "Someone tag me when someone’s in handcuffs, I’m tired of getting excited that something will finally happen and then just getting my heart broken",
            "title_similarity": "0.17572159",
            "sentiment_compound": 0.1531
        },
        {
            "id": "htogctx",
            "score": 1,
            "text": "Good. Fucking destroy him.",
            "title_similarity": "0.12832114",
            "sentiment_compound": -0.2247
        },
        {
            "id": "htohfx1",
            "score": 1,
            "text": "I’m skeptical anything substantive comes out of this.",
            "title_similarity": "0.1304928",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htohlnf",
            "score": 1,
            "text": "Yes!!!!",
            "title_similarity": "0.18743336",
            "sentiment_compound": 0.5951
        },
        {
            "id": "htoi6yz",
            "score": 1,
            "text": "I'm not old enough to remember a time when politicians were held accountable. Nothing is gonna fucking happen.",
            "title_similarity": "0.28522658",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoiezc",
            "score": 1,
            "text": "How many times was he impeached, how many years or decades until he goes to jail.",
            "title_similarity": "0.34080917",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoii1d",
            "score": 1,
            "text": "I just don’t have any faith that this will amount to anything.",
            "title_similarity": "0.07939717",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htoipl1",
            "score": 1,
            "text": "Can we finally send that fascist fat sack of crap to prison yet",
            "title_similarity": "0.29585153",
            "sentiment_compound": -0.8591
        },
        {
            "id": "htoizuk",
            "score": 1,
            "text": "why were they not made public immediately.",
            "title_similarity": "0.17667103",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoj7w1",
            "score": 1,
            "text": "All of his notes are written in sharpie and Pizza Hut crayons",
            "title_similarity": "0.25604436",
            "sentiment_compound": 0.0
        },
        {
            "id": "htojmnv",
            "score": 1,
            "text": "Just one big redact i bet.",
            "title_similarity": "0.2575101",
            "sentiment_compound": 0.0
        },
        {
            "id": "htojo0s",
            "score": 1,
            "text": "If all those assholes are in jail.... Election in mid term year might look very different than we expect.",
            "title_similarity": "0.4206341",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htojx7d",
            "score": 1,
            "text": "Lol — Trump is fucked.",
            "title_similarity": "0.32539457",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htokadm",
            "score": 1,
            "text": "The Republicans will be saying stuff like \"The fact that they removed the shoot Nancy Pelosi from the draft speech meant they didn't want to shoot her.\"",
            "title_similarity": "0.33372128",
            "sentiment_compound": 0.2297
        },
        {
            "id": "htokkoh",
            "score": 1,
            "text": "Folder labeled “Pictures Eric drew”",
            "title_similarity": "0.32497862",
            "sentiment_compound": 0.0
        },
        {
            "id": "htol4vk",
            "score": 1,
            "text": "Lol Trump probably dosnt even care himself lmao",
            "title_similarity": "0.35136563",
            "sentiment_compound": 0.872
        },
        {
            "id": "htol6y1",
            "score": 1,
            "text": "Finally",
            "title_similarity": "0.17350487",
            "sentiment_compound": 0.0
        },
        {
            "id": "htol9bq",
            "score": 2,
            "text": "Good job government. Keep America and bring no one to justice. Just watch. Trump will walk free.",
            "title_similarity": "0.4267112",
            "sentiment_compound": 0.8126
        },
        {
            "id": "htolczb",
            "score": 3,
            "text": "To be very clear it is \"our\" white house. He just occupied it for 4 years.   He owns nothing.",
            "title_similarity": "0.4540765",
            "sentiment_compound": 0.4391
        },
        {
            "id": "htoldfo",
            "score": 1,
            "text": "Why he and his cronies aren’t in a jail cell right now for treason is bonkers to me. Way. Too. Slow.",
            "title_similarity": "0.25957632",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htomcz6",
            "score": 1,
            "text": "A *lot* of popcorn popping tonight on the Hill",
            "title_similarity": "0.12911852",
            "sentiment_compound": 0.0
        },
        {
            "id": "htomnfs",
            "score": 2,
            "text": "Can't wait to hear all about how \"he should be worried\" and then nothing happens AGAIN.",
            "title_similarity": "0.2045883",
            "sentiment_compound": -0.296
        },
        {
            "id": "htomoyg",
            "score": 2,
            "text": "Get in losers, we're exposing all of this MAGA tomfoolery- the Jan 6th committee probably. \n\nI really hope everyone is held accountable. It was troubling to tune into what was going on while I wasn't in the states.",
            "title_similarity": "0.40262684",
            "sentiment_compound": -0.701
        },
        {
            "id": "htomunt",
            "score": 1,
            "text": "Like the man said no matter what they throw at us the Republican Party will win 2024",
            "title_similarity": "0.47046366",
            "sentiment_compound": 0.8371
        },
        {
            "id": "htonbd7",
            "score": 1,
            "text": "Even if Trump goes to jail, if the Republicans take office 2024, they can just pardon his lying ass.",
            "title_similarity": "0.47513512",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htoni7e",
            "score": 1,
            "text": "Like McDonalds…\n\n“Da da da da da\n\nI’m lovin’ it!”",
            "title_similarity": "0.2757045",
            "sentiment_compound": 0.4199
        },
        {
            "id": "htononj",
            "score": 2,
            "text": "Yeah, yeah, yeah. \n\nWake me up when these fuckers are in orange jumpsuits.",
            "title_similarity": "0.2970425",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htonpjb",
            "score": 2,
            "text": "I sure would like to see him in the orange jumpsuit. It’ll go just fine with the hair.",
            "title_similarity": "0.19098985",
            "sentiment_compound": 0.6808
        },
        {
            "id": "htoo2xk",
            "score": 2,
            "text": "Take him to jail for the rest of his life",
            "title_similarity": "0.32772353",
            "sentiment_compound": 0.0
        },
        {
            "id": "htooan8",
            "score": 1,
            "text": "If Trump isn't actually charged for anything I'm moving to Switzerland",
            "title_similarity": "0.3536099",
            "sentiment_compound": 0.1511
        },
        {
            "id": "htoodxw",
            "score": 5,
            "text": "Nobody will read this, but I just want to go on record that this is fantastic news and made my day.  8 of 9 supreme justices, including all 3 Trump appointed blocked his latest attempts to stop it.\n\nNow we are getting somewhere.",
            "title_similarity": "0.43880588",
            "sentiment_compound": 0.7783
        },
        {
            "id": "htookb7",
            "score": 3,
            "text": "Would these records now be subject to a FOIA request?",
            "title_similarity": "0.40494323",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoooob",
            "score": 1,
            "text": "Just let me know when they lock the fat bastard up.",
            "title_similarity": "0.31653863",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htoot5u",
            "score": 4,
            "text": "This dude has admitted crimes live on TV. None of this matters. He fired Comey and admitted to doing it for no other reason than shutting down an investigation into himself. There is SO MUCH wrong there. He literally obstructed justice on more than one occasion and admitted to it. I mean, his speech on Jan 6th actually said \"March to Capitol\" \"show strength or you wont have a country\" and some other shit that led to Jan 6th. \n\nIf we dont have enough on him already, we never will. Hate to burst anyone's bubble, but don't get your hopes up. Just hope the hamburgers and coke buttons catch up to his fat ass before 2024. Wish he'd just go build his Moscow tower already and gtfo of here.",
            "title_similarity": "0.328924",
            "sentiment_compound": -0.2787
        },
        {
            "id": "htoouhr",
            "score": 2,
            "text": "Now we just need them all released to the public.   We already know how the right will go, the secret is to u it’s those of us in the middle and on the left on core foundational issues and clean house.   The GOP does t have a policy or path.   They are just anti-Democrat.   So we can pick the directions.",
            "title_similarity": "0.41708308",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htopbiu",
            "score": 1,
            "text": "https://twitter.com/lw34416489",
            "title_similarity": "0.28133887",
            "sentiment_compound": 0.0
        },
        {
            "id": "htopdpa",
            "score": 2,
            "text": "They need to be made public",
            "title_similarity": "0.20802654",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoq2f0",
            "score": 1,
            "text": "They were roommates…",
            "title_similarity": "0.3086627",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoqccc",
            "score": 2,
            "text": "I just came.",
            "title_similarity": "0.2933787",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoqq63",
            "score": 1,
            "text": "Booyah",
            "title_similarity": "0.21284667",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoquap",
            "score": 1,
            "text": "What do they expect to find here, exactly?",
            "title_similarity": "0.26417577",
            "sentiment_compound": 0.0
        },
        {
            "id": "htor42n",
            "score": 2,
            "text": "Tomorrow’s headline : trumps wh records incomplete",
            "title_similarity": "0.45319924",
            "sentiment_compound": 0.0
        },
        {
            "id": "htosk56",
            "score": 2,
            "text": "The walls are closing in",
            "title_similarity": "0.12908481",
            "sentiment_compound": 0.0
        },
        {
            "id": "htovgdd",
            "score": 1,
            "text": "I'll be more impressed if they actually DO something about it.",
            "title_similarity": "0.1839476",
            "sentiment_compound": 0.5256
        },
        {
            "id": "htovp8a",
            "score": 1,
            "text": "We will never be free of these assholes….",
            "title_similarity": "0.12941757",
            "sentiment_compound": -0.4023
        },
        {
            "id": "htoyqdo",
            "score": 1,
            "text": "I am sure 90% of it is redacted.",
            "title_similarity": "0.37971342",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htp1bj7",
            "score": 1,
            "text": "That and a buck plus tax will get me any sized soda at McDonalds",
            "title_similarity": "0.26992223",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp3br6",
            "score": 9,
            "text": "I hate how everyone always says the Dems will lose seats. They won't lose seats if you all go out and vote! Stop spreading the hopeless storyline they will lose seats and start motivating people to get out and vote.",
            "title_similarity": "0.24416444",
            "sentiment_compound": -0.8456
        },
        {
            "id": "htp46fz",
            "score": 6,
            "text": "If we send tRump to prison on 2022 it will have been all worth it",
            "title_similarity": "0.45407575",
            "sentiment_compound": -0.34
        },
        {
            "id": "htp5tpm",
            "score": 3,
            "text": "Far freaking out!!!",
            "title_similarity": "0.08606659",
            "sentiment_compound": -0.5684
        },
        {
            "id": "htp7qjx",
            "score": 1,
            "text": "Follow the trails wherever they lead, and make sure the culprits are fined, jailed and prevented from holding public office again.",
            "title_similarity": "0.2710181",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htp8ksw",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.13874353"
        },
        {
            "id": "htp8rkw",
            "score": 1,
            "text": "Why is this as big of a deal as everyone’s making it out to be (from Canada) it seems like everyone from the states doesn’t want to forget about trump. Every day there is a new headline about him on reddit",
            "title_similarity": "0.4427597",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htpa6gj",
            "score": 2,
            "text": "I can already see it; \"Trump White House records misplaced during transference for reviewing\"",
            "title_similarity": "0.6273962",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpd0hv",
            "score": 1,
            "text": "Hmmm. Who wants to play bingo?",
            "title_similarity": "0.40461326",
            "sentiment_compound": 0.34
        },
        {
            "id": "htpdrjf",
            "score": 1,
            "text": "Time for shenanigans",
            "title_similarity": "0.27720463",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpdw4u",
            "score": 3,
            "text": "Good, fat orange fuck, I hope he gets what he's had coming for 60 years. Karma is a motherfucker.",
            "title_similarity": "0.37023008",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htpfpbl",
            "score": 2,
            "text": "I’m surprised he didn’t claim they were under audit.",
            "title_similarity": "0.27555877",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htphxcv",
            "score": 1,
            "text": "Why was he hiding the documents anyway? Trump is constantly hiding stuff from his supporters and the general public. Why is he such a dodgy grifter?",
            "title_similarity": "0.27617973",
            "sentiment_compound": -0.4137
        },
        {
            "id": "htpjnas",
            "score": 1,
            "text": "This gon be gud.",
            "title_similarity": "0.24225989",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpk6xl",
            "score": 9,
            "text": "Look at all the careers, reputations and even lives this fat, stupid conman has ruined. Imagine if liberals started worshipping Ted Nugent and would do anything he commanded, and that’s about as absurd as this whole Trump cult thing is.\n\nThe amount of projection Trump does is astounding. He said the same thing about the Iowa caucus he lost to Cancun Cruz in 2016 - he wanted a do-over, it was rigged. He said the same things leading up to the general election against Hilary… until he accidentally won. Then he put a sham committee together to investigate fraud. They found none, and disbanded. Then he planted the seeds of doubt in 2020, whining about mail-in voting (even though he voted by mail) and claimed he would only lose if the election was rigged. Everyone could see this coming a mile away, and STILL his cult goes along with his scam. The committee hasn’t even released everything they’ve uncovered and the evidence is already overwhelming this was a coordinated plot to overturn the election results.\n\nIf this isn’t treasonous and criminal conduct, what the hell is? And yet, I believe Trump will probably never have to suffer any consequences for his actions.\n\nIt’s hard to believe all of this chaos was ignited by Trump.. the guy who starred in Pizza Hut commercials.",
            "title_similarity": "0.38790768",
            "sentiment_compound": -0.9876
        },
        {
            "id": "htpovqa",
            "score": 2,
            "text": "Iis it just a bunch of McDonald’s receipts?",
            "title_similarity": "0.28931397",
            "sentiment_compound": 0.0
        },
        {
            "id": "htppzuv",
            "score": 1,
            "text": "Pigeons flock. But bread isn’t food",
            "title_similarity": "0.13286084",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpxkld",
            "score": 2,
            "text": "How is this idiot not in prison? Not even for his election shenanigans, but for all the tax evasion. Even Capone went to Alcatraz.",
            "title_similarity": "0.39300177",
            "sentiment_compound": -0.1497
        },
        {
            "id": "htpxv58",
            "score": 1,
            "text": "Well with voting rights doomed and the way they have it we might as well give the reps keys to the castle!!",
            "title_similarity": "0.40809083",
            "sentiment_compound": -0.3786
        },
        {
            "id": "htq5grg",
            "score": 1,
            "text": "The ones he didn’t eat or destroy at least…",
            "title_similarity": "0.15814796",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htq92sd",
            "score": 2,
            "text": "This should be fun!",
            "title_similarity": "0.09873939",
            "sentiment_compound": 0.5562
        },
        {
            "id": "htqdn6q",
            "score": 3,
            "text": "This is probably gonna be one of those times where we find out the truth is much worse than we thought it was",
            "title_similarity": "0.16785915",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htqeplx",
            "score": 3,
            "text": "They all deserve life in prison.",
            "title_similarity": "0.23421136",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htqkvct",
            "score": 1,
            "text": "All Trump needs is good people to do nothing...looks like that's been happening as \"polite society\" wont soil their hands shoveling his crap out the DC doors!!",
            "title_similarity": "0.30428046",
            "sentiment_compound": 0.5242
        },
        {
            "id": "htqn7p6",
            "score": 3,
            "text": "And the only people mad are Republicans who claim there’s nothing there so why look.\n\nFuck off traitors.  Republicans have no place in society.",
            "title_similarity": "0.2300106",
            "sentiment_compound": -0.8467
        },
        {
            "id": "htqsyl9",
            "score": 1,
            "text": "I hope it ends like Shawshank!! But then again, they're pussies!!!",
            "title_similarity": "0.12233223",
            "sentiment_compound": 0.5951
        },
        {
            "id": "htquhgo",
            "score": 1,
            "text": "Someone (actually many) are shitting giant bricks, prickly ones.",
            "title_similarity": "0.15386967",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htqwio2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13516343"
        },
        {
            "id": "htqxuu7",
            "score": 1,
            "text": "Trump and Co. have one foot on a banana peel and the other in a jail cell!",
            "title_similarity": "0.3635239",
            "sentiment_compound": 0.0
        },
        {
            "id": "htrrdqj",
            "score": 1,
            "text": "So excited for nothing to happen.",
            "title_similarity": "0.044503745",
            "sentiment_compound": 0.4005
        },
        {
            "id": "htsa7ml",
            "score": 1,
            "text": "Also important to get the Trump's psychiatric records. The Man is raving mad.",
            "title_similarity": "0.28358537",
            "sentiment_compound": -0.34
        },
        {
            "id": "htsqno9",
            "score": 1,
            "text": "That’s called entitlement that’s why rich people that have everything handed to them never are held accountable because daddy always pays their way out ! This time he might! We can only hope!",
            "title_similarity": "0.26755422",
            "sentiment_compound": 0.8114
        },
        {
            "id": "htsult2",
            "score": 1,
            "text": "Delusions of grandeur.",
            "title_similarity": "0.21921793",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htswbmg",
            "score": 1,
            "text": "What don’t you understand about trying to overthrow our government? You fucking Qtard?",
            "title_similarity": "0.28026456",
            "sentiment_compound": 0.0
        },
        {
            "id": "httfbgq",
            "score": 2,
            "text": "As if there was really any questions these records would not be available to the committee. The Truth will be told. Like it or not the truth will be told and those responsible for the creation of the idea of the stop the steal movement, those who pushed the idea, and those who acted upon it, most importantly those who funded it.    \nEveryone with half a brain knows who did it. We all saw it unfolding on national TV. These people made hundreds of millions on this lie, and this cancer was spread to every battle ground state. It still rages in the battle ground states , their limiting ballot boxes and depository locations, their limiting who by color of their skin, their damning their own, and yet they trudge forward as if there is no tomorrow. There are judges, lawyers, law-firms  and people of great wealth involved, there is mothers and fathers and would be sons and daughter's in laws involved. There is law enforcement officers and Veteran's involved",
            "title_similarity": "0.3491112",
            "sentiment_compound": -0.752
        },
        {
            "id": "httfksz",
            "score": 2,
            "text": "This will be like the modern day Watergate when its all said and done.",
            "title_similarity": "0.3942503",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htvyy71",
            "score": 1,
            "text": "I swear Americans get a hard on calling each other traitors.",
            "title_similarity": "0.26461795",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hv2fllt",
            "score": 1,
            "text": "is this thread 10 days old ??? why is it on my front page ?? says people are commenting wtf is going on",
            "title_similarity": "0.45356798",
            "sentiment_compound": -0.6966
        },
        {
            "id": "hvnrp22",
            "score": 1,
            "text": "But will the emails and communications between Pelosi, Capital Police, Mayor Bowser of DC and National Guard ever see the light of day? No. Why? Because Trump asked for the Nat Guard and Pelosi and Mayor Bowser refused. And THAT would destroy the faux narrative",
            "title_similarity": "0.3964043",
            "sentiment_compound": -0.8364
        },
        {
            "id": "hwg0zhc",
            "score": 1,
            "text": "Yeah but nothing will happen. So what is the point?",
            "title_similarity": "0.09922624",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hx9h1l9",
            "score": 1,
            "text": "Oh no\n\nSo anyway",
            "title_similarity": "0.07946724",
            "sentiment_compound": -0.296
        },
        {
            "id": "hx9swjr",
            "score": 1,
            "text": "STFU convict him or dont. Quit milking this shit.",
            "title_similarity": "0.22726658",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hzm81jt",
            "score": 1,
            "text": "Finally! Now let's speed the process up and toss this terrorist in prison.",
            "title_similarity": "0.3321551",
            "sentiment_compound": -0.8811
        },
        {
            "id": "i0muf6h",
            "score": 1,
            "text": "False accusation time. Shampeachment round three inbound.",
            "title_similarity": "0.23350814",
            "sentiment_compound": -0.25
        },
        {
            "id": "i0o66fy",
            "score": 1,
            "text": "Oooo, ahhh, ohhhh.... nothing will happen.",
            "title_similarity": "0.10414284",
            "sentiment_compound": 0.0
        }
    ]
}