{
    "George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski\n": [
        {
            "id": "hv5lrcu",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.55200326",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hv5p2ow",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.07474039"
        },
        {
            "id": "hv60pkz",
            "score": 4,
            "text": "It's about our democracy right now and traditional Republicans like Bush understood what it meant to be part of a democracy even if their philosophies were not to or liking. Dems need to be pro actively supporting Cheney and kinsinger like the Lincoln Project repubs pro actively supported Biden.",
            "title_similarity": "0.58572984",
            "sentiment_compound": 0.8896
        },
        {
            "id": "hv65gjv",
            "score": -2,
            "text": "Good for George.\n\nVoted for him and have always regretted that. I feel a little now knowing he is fighting King Donald.",
            "title_similarity": "0.55124426",
            "sentiment_compound": -0.296
        },
        {
            "id": "hv62huv",
            "score": 2,
            "text": "I miss the days of disliking the GOP but still being able to respect them as people... \n\nIt's like how people think I am crazy for liking Michael Jackson songs, even though he was allegedly a terrible person who hurt kids. I can hate the person, but respect their art.\n\nI disliked GWB as a president, he was a moron, but he was at least trying to help the country. Now its all about owning the libs, gaslighting, obstruction of justice. There is nothing to respect in terms of modern GOP politics.",
            "title_similarity": "0.5149937",
            "sentiment_compound": -0.777
        },
        {
            "id": "hv5s5d2",
            "score": 23,
            "text": "I give a lot of crap to GWB, but he at least didn't attempt to overthrow the government. \n\nThe current Republican Party has become the Fascist Party and it doesn't appear to be slowing their extreme views.",
            "title_similarity": "0.50824726",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hv70iqh",
            "score": 0,
            "text": "It's a strange time when my liberal ass is in support with W.\n\nStrange times indeed.",
            "title_similarity": "0.48856068",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hv5x6vv",
            "score": -1,
            "text": "Good ol’ W. Sunk the ship and is the reason everyone voted for Obama.",
            "title_similarity": "0.51583713",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6h7hz",
            "score": -32,
            "text": "Kills me how leftist like Bush now lmao….",
            "title_similarity": "0.49778822",
            "sentiment_compound": -0.25
        },
        {
            "id": "hv6e5g8",
            "score": -24,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv709ou",
            "score": -5,
            "text": "The Bush/Clinton cabal is a real thing, two sides of the same coin.  Which is why both democrats and rinos hate, fear, and despise Trump, because he threw a monkey wrench in their plans.  I still believe to this day Trump was hoisted up to give Hillary the best chance and it blew up in their faces, which is another reason they're so bitter.",
            "title_similarity": "0.5757841",
            "sentiment_compound": -0.7728
        },
        {
            "id": "hv6rt57",
            "score": 3,
            "text": "Who the hell fkn cares?! Why is he not in jail already?!",
            "title_similarity": "0.30011496",
            "sentiment_compound": -0.549
        },
        {
            "id": "hv648ab",
            "score": -2,
            "text": "George W Bush was a worse President than Donald Trump.  A hill I'm willing to die on.\n\nThis isn't to undermine how shitty Trump is/was.  If Trump was allowed to do whatever he wanted like Bush was, he would have been a much worse President.  But at the end of the day, Bush was measurably a worse President.",
            "title_similarity": "0.5900662",
            "sentiment_compound": -0.8691
        },
        {
            "id": "hv6uxz1",
            "score": -1,
            "text": "While here we are trying to ignore that all things have gotten so expensive in just a year. Gasoline, natural gas, groceries, all essential products for daily  living have all gotten so expensive to almost twice. All of these while paycheck stayed the same and the value of money have dropped 7% in just a yr.\n\nWhy is reddit continue to ignore this? Because they won't admit they made a mistake. Reddit supported Biden and thought he would run the country better.",
            "title_similarity": "0.5203047",
            "sentiment_compound": 0.2751
        },
        {
            "id": "hv6gd72",
            "score": 22,
            "text": "Jesus fucking Christ the bar is SO low. Did y’all forget that he stole the 2000 election & is responsible for the death of over a million Iraqi/Afghani civilians? Or is everyone still tripping over themselves how trump was rude.",
            "title_similarity": "0.6185827",
            "sentiment_compound": -0.8795
        },
        {
            "id": "hv680fp",
            "score": 0,
            "text": "Are there any public statements from George W. Bush on Trump's policies, impeachments, COVID response, 2020 election loss, Jan 6th attack on congress, the continued Big Lie, the Entire Republican party's continued support for Trump & Trumpism?\n\nOther than some money donations to a couple of politicians? \n\nBush is as stupid and spineless in retirement, as he was in his Administration",
            "title_similarity": "0.813843",
            "sentiment_compound": -0.755
        },
        {
            "id": "hv6hj19",
            "score": 0,
            "text": "Time for a Woman to run things… they are Conservative but the type of conservative that wouldn’t ruin our Country *** if ***in charge and I can get behind that. I’d prefer a Dem but I wouldn’t be crushed if one of these women ran and win to be the next POTUS… 🖕🏻 The rest of the GOP crazies",
            "title_similarity": "0.5579496",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hv5o8xn",
            "score": 9,
            "text": "Bush/Cheney 2024 /s",
            "title_similarity": "0.45147115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6jw2t",
            "score": 4,
            "text": "Trump> War Criminal",
            "title_similarity": "0.6033164",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv5m0oi",
            "score": 20,
            "text": "I didn't see Bush family as savior of GOP and here we are in 2022.",
            "title_similarity": "0.39881703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv5mx2b",
            "score": 7,
            "text": "They’re both gonna be primaried out",
            "title_similarity": "0.22535336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6szbt",
            "score": 1,
            "text": "He really doesn't want Trump to open the 9/11 files. Because we all know who's guiltier than satan.",
            "title_similarity": "0.4556456",
            "sentiment_compound": -0.5424
        },
        {
            "id": "hv6ip5a",
            "score": 3,
            "text": "Please stop trying to rehabilitate this asshole’s image 🙄",
            "title_similarity": "0.31598967",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hv6jloz",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv6k1cj",
            "score": 8,
            "text": "Democrats: WTF? I love war criminals now!",
            "title_similarity": "0.48352396",
            "sentiment_compound": -0.8491
        },
        {
            "id": "hv6f4mo",
            "score": 11,
            "text": "Lol reddit simping for war criminals like usual.",
            "title_similarity": "0.6154015",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hv5u5h1",
            "score": 4,
            "text": "Worst part about all this bullshit is basically gives W a pass.  In other circumstances he'd have been hauled in front of ICC.  What'd he leave office with approval in the teens?",
            "title_similarity": "0.5380018",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hv6suqn",
            "score": 3,
            "text": "Establishment neocon crony trying to hang on to his last vestige of influence.",
            "title_similarity": "0.39230973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv5m9n7",
            "score": 3,
            "text": "Balanced as all things should be.",
            "title_similarity": "0.0035640374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv68djt",
            "score": 1,
            "text": "God ! Remember when we all thought a president couldn’t get any dumber than Bush and along comes Trump. Better times, better times",
            "title_similarity": "0.6136843",
            "sentiment_compound": 0.69
        },
        {
            "id": "hv6bvhb",
            "score": 1,
            "text": "It is telling when one of the biggest war criminal has such vested interest in keeping Trump out of office.",
            "title_similarity": "0.69412076",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hv7f1wh",
            "score": 0,
            "text": "I’m so tired of this man’s attempted redemption arc. Yes, he’s a little old man who paints now, but IRAQ, guys.",
            "title_similarity": "0.35191196",
            "sentiment_compound": -0.0635
        },
        {
            "id": "hv6b94s",
            "score": 0,
            "text": "While the notion is appreciated, G. W. is still a war criminal, and is not so easily rehabilitated.",
            "title_similarity": "0.37432307",
            "sentiment_compound": -0.7626
        },
        {
            "id": "hv6e0dj",
            "score": 0,
            "text": "He has to do a lot more than that to reverse the damage inflicted by the war on \"\"\"\"\"\"\"\"terror\"\"\"\"\"\"\"\" IMO",
            "title_similarity": "0.48215616",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hv6fy2d",
            "score": 0,
            "text": "Americans: “my lying, cheating, thieving, murdering, imbecilic president is better than yours, so na na na.”",
            "title_similarity": "0.60790384",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hv6g7v6",
            "score": 0,
            "text": "It’s really hard to decide who a bigger piece of shit is, Trump or Bush. I’m kinda leaning towards Bush.",
            "title_similarity": "0.41314805",
            "sentiment_compound": -0.6478
        },
        {
            "id": "hv6h27a",
            "score": 0,
            "text": "Cool motive, you're still a war criminal.",
            "title_similarity": "0.4652831",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hv6ig06",
            "score": 0,
            "text": "Dude was a war criminal, but at least he was an American war criminal",
            "title_similarity": "0.5171931",
            "sentiment_compound": -0.9393
        },
        {
            "id": "hv6iuri",
            "score": 0,
            "text": "remember that time he used his position as president to advocate a constitutional amendment to prevent gays from being able to marry?",
            "title_similarity": "0.6463792",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hv6kasz",
            "score": 0,
            "text": "Yeah, still doesn't make up for committing mass terrorism in the middle east for your friends profit.",
            "title_similarity": "0.49828508",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6o5xn",
            "score": 0,
            "text": "That's nice of him.\n\nHe's still a war criminal.",
            "title_similarity": "0.43044204",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hv6o9a4",
            "score": 0,
            "text": "Fuck off W, the man could never get anything right in his life could he? Always manages to fail at everything but somehow everyone else is left holding the bag.",
            "title_similarity": "0.2305491",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv6olps",
            "score": 0,
            "text": "When my kids are senior citizens the truth about bush jr may come out 🇺🇸",
            "title_similarity": "0.45215186",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hv6pwj8",
            "score": 0,
            "text": "Who cares what the murderer does",
            "title_similarity": "0.29832137",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv6zjx0",
            "score": 0,
            "text": "Is he...antifa now?",
            "title_similarity": "0.22717908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6znsa",
            "score": 0,
            "text": "It’s absolutely insane that people are willing to forgive the countless war crimes of Bush and Cheney just because they were more civil than Trump.  Trump is a fascist moron, this guy (despite appearances) was actually a very clever fascist.  Hundreds of thousands of civilians died because of his smart and polite war mongering.",
            "title_similarity": "0.60164106",
            "sentiment_compound": -0.9627
        },
        {
            "id": "hv71tiv",
            "score": 0,
            "text": "Still a war criminal",
            "title_similarity": "0.32900274",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv72s04",
            "score": 0,
            "text": "Still a war criminal.  Doing the bare minimum now doesn't take that away.",
            "title_similarity": "0.32685858",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv73lcz",
            "score": 0,
            "text": "Who cares?\n\nThis is how we know for 100% certainty that trump will never face any consequences. \n\nBush and Chaney started a war based on lies that has driven the US into massive debt and let to the killing of hundreds of thousands of innocent civilians. Nobody was ever punished. Trump will never face consequences if we can’t even hold mass murderers accountable in broad daylight.",
            "title_similarity": "0.57165396",
            "sentiment_compound": -0.9382
        },
        {
            "id": "hv75eef",
            "score": 0,
            "text": "The same G.W.Bush who allowed our country to be attacked? You know…the one who went to Iraq for WMDs and was like “ we found nothing, but we got saddam, mission accomplished “",
            "title_similarity": "0.6662952",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hv76mov",
            "score": 0,
            "text": "Sounds like a waste of money",
            "title_similarity": "0.164246",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hv77fms",
            "score": 0,
            "text": "He did well. But. George W Bush is a war criminal. WMD was another BIG LIE from the Republicans. Why didn’t the US invade Saudi Arabia after it was proven the 911 attackers and Osama were Saudi? Why was Iraq invaded instead? Money money money. History will judge accordingly.",
            "title_similarity": "0.72655576",
            "sentiment_compound": -0.9502
        },
        {
            "id": "hv788u0",
            "score": 0,
            "text": "When did tyrants become part of the resistance?",
            "title_similarity": "0.4127037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv78a34",
            "score": 0,
            "text": "I would get banned if I shared what GW Bush deserved for the Iraq War, torture, and mass surveillance he oversaw. But keep rehabilitating him for minor things.",
            "title_similarity": "0.6085911",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hv78zu5",
            "score": 0,
            "text": "That’s some big “in Texas fool me once but I’ll give my money to President Dick’s kid and don’t blame me for Trump I just started the post-reality thing” energy.",
            "title_similarity": "0.6728176",
            "sentiment_compound": -0.34
        },
        {
            "id": "hv6gkw1",
            "score": -8,
            "text": "How did those impeachments go? Asking for a friend",
            "title_similarity": "0.5709928",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hv6gbmq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv6jlhr",
            "score": 7,
            "text": "I like how y’all came full circle with Bush.",
            "title_similarity": "0.17101817",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv64j0l",
            "score": 5,
            "text": "George W Bush literally stole an election lol man this country blows",
            "title_similarity": "0.6940334",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv6rkxd",
            "score": 5,
            "text": "The guy that eroded our liberties with the Patriot Act while unnecessarily bombing middle eastern countries wants to help people that hate a man that improved our economy. Got it. It actually makes perfect sense. This actually makes me wonder if Trump isn’t the bad guy that everyone says he is.",
            "title_similarity": "0.6427386",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hv6zzsn",
            "score": 8,
            "text": "That’s great. Good for Bush. He’s still a war criminal and a shitbag of a president though.",
            "title_similarity": "0.61142117",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hv6i46n",
            "score": 10,
            "text": "Bush was worse than Trump. It’s another example of somebody hopping in the Trump Badwagon as a distraction from their own wrongdoing.",
            "title_similarity": "0.59183204",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hv6fvo8",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv65k0f",
            "score": 1,
            "text": "Murkowski sucks though also",
            "title_similarity": "0.136008",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hv69va3",
            "score": 1,
            "text": "You know shit has gotten bad when the guy who almost started a war with China seems less bad than trump",
            "title_similarity": "0.53094065",
            "sentiment_compound": -0.9318
        },
        {
            "id": "hv6aos8",
            "score": 1,
            "text": "Bush was always going to support Liz Cheney. Did he do that in previous years also or is it new? It's likely he has been donating to her since the beginning. Lisa also has a long standing relationship with bush. I would like to know if he has always been supporting her.",
            "title_similarity": "0.483001",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hv6b82g",
            "score": -1,
            "text": "It's a good start, now donate to the Dems on the Jan 6th committees, too. The GOP has demonstrated nothing but a wholesale and systemic failure to maintain decorum within their ranks. If you believe in oversight and accountability, then you have to recognize that it isn't coming from the modern GQP. They've abandoned it for pussy grabbers, white nationalists, and extremist billionaires looking to replace democracy with ethno-fascism.",
            "title_similarity": "0.6260636",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hv6c7fj",
            "score": -1,
            "text": "This is just like that GI Joe after school special where they team up with Cobra to take on the drug dealers",
            "title_similarity": "0.52437824",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6d33h",
            "score": -1,
            "text": "That is awesome! New George W. Bush is soo cool it's almost like he never committed war crimes!",
            "title_similarity": "0.40924412",
            "sentiment_compound": 0.8891
        },
        {
            "id": "hv6dhoj",
            "score": -1,
            "text": "What we’re not doing is praising and normalizing this war criminal who paved the way for the Tea Party, helped knock down the walls for open xenophobia against Muslims post 9/11 and helped pave the way for Trump. Thanks for coming to my Ted Talk.",
            "title_similarity": "0.69659173",
            "sentiment_compound": -0.7411
        },
        {
            "id": "hv6dqbb",
            "score": -1,
            "text": "Elite donates to elites to keep elite out of office",
            "title_similarity": "0.67661536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6f3m0",
            "score": 1,
            "text": "How bout you max out going to the Hague, war criminal",
            "title_similarity": "0.52405196",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6f479",
            "score": 1,
            "text": "Fuck W",
            "title_similarity": "0.106156684",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv6fevl",
            "score": -1,
            "text": "It’s really chilling that Bush was as bad as he was and people want to re-elect someone who was worse.",
            "title_similarity": "0.43558317",
            "sentiment_compound": -0.7713
        },
        {
            "id": "hv6ff6q",
            "score": 1,
            "text": "Alternative headline:  Bush contributes a used economy car down payment to anti trump republican.",
            "title_similarity": "0.7808207",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hv6h01t",
            "score": -1,
            "text": "We supposed to love Bush now?",
            "title_similarity": "0.22568089",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6h1fd",
            "score": 1,
            "text": "Bush lied. \n\nPeople died.",
            "title_similarity": "0.35327083",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hv6k1ce",
            "score": -1,
            "text": "Lol liberals now acting like war criminal George W. Bush is a hero just shows how both parties are basically the same when controlled by corporations",
            "title_similarity": "0.69352055",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hv6kt2c",
            "score": -1,
            "text": "Did he also max out donations to every democrat that supported both of Trumps impreachments?",
            "title_similarity": "0.73323333",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hv6obow",
            "score": -1,
            "text": "Bush was worse than Trump. My dad and stepmom are right-wing evangelical Republicans. Bush pissed them off so much, they temporarily unregistered as Republicans around '07 (after they had already voted for him twice unfortunately.) My dad and I had a falling out in '14, but I still hear about him through my siblings. My dad is still a diehard Trump supporter, although he did quiet down after January 6th apparently.",
            "title_similarity": "0.63325554",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hv6q1yh",
            "score": -1,
            "text": "It's great seeing this warmonger getting so white washed these days as a potential \"good guy\"! How soon people forget. Thanks for the Patriot Act!",
            "title_similarity": "0.33522907",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hv727cb",
            "score": -1,
            "text": "Bush was easily a worse President than Trump, by almost any metric. \n\nTrump had a worse personality, which I guess makes people like Bush in comparison, despite the disastrous 2001-2009 years.",
            "title_similarity": "0.51973057",
            "sentiment_compound": 0.2134
        },
        {
            "id": "hv72hua",
            "score": -1,
            "text": "Trump vs Crimes against humanity perpetrated by Dubya and his regime\n\nDAE TRUMP BAD?",
            "title_similarity": "0.67792046",
            "sentiment_compound": -0.6408
        },
        {
            "id": "hv74d4i",
            "score": -1,
            "text": "These ass holes (big corporations, sponsored politicians and media) all rooting against Trump means he's doing something which is not in their best interest. What's not in their best interest could be in favour of common folks.",
            "title_similarity": "0.6501",
            "sentiment_compound": -0.3261
        },
        {
            "id": "hv7hr3q",
            "score": 1,
            "text": "You are fucking braindead to defend this monster in any capacity, let alone believe Trump was a worse president.",
            "title_similarity": "0.61845756",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv5vtee",
            "score": 4,
            "text": "Now if he could just pull up his damn mask lol",
            "title_similarity": "0.30802304",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hv62w5u",
            "score": 4,
            "text": "\"Wow, maybe Bush wasn't such a bad guy after all.\"\n\n-Some brain-dead dribbling smoothbrain dipshit, after reading this headline.",
            "title_similarity": "0.42132354",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hv6ejs4",
            "score": -6,
            "text": "WTF I Love George Bush Now",
            "title_similarity": "0.30334288",
            "sentiment_compound": -0.0857
        },
        {
            "id": "hv6i9c9",
            "score": 5,
            "text": "Yeah, but still a war criminal. Can't make up for it.",
            "title_similarity": "0.37251922",
            "sentiment_compound": -0.8847
        },
        {
            "id": "hv5zjcm",
            "score": 31,
            "text": "Amazing this guy gets treated like the good guy even after somehow killing more people than Trump and actually stealing an election and subverting democracy",
            "title_similarity": "0.6117686",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hv6jjbx",
            "score": 42,
            "text": "Just a reminder: There was absolutely nothing good about the GW Bush administration.",
            "title_similarity": "0.36257604",
            "sentiment_compound": -0.3988
        },
        {
            "id": "hv5zffs",
            "score": 48,
            "text": "Fuck George Bush, I'll never forgive him as long as I live. This is the bare minimum he can do. It changes nothing.",
            "title_similarity": "0.36064446",
            "sentiment_compound": -0.6501
        },
        {
            "id": "hv61e7f",
            "score": 4,
            "text": "Please don’t let this wash away what W did to this country.  He allowed the the death and displacement of millions",
            "title_similarity": "0.59358096",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv64nnx",
            "score": -2,
            "text": "Better title with be “former president maxes out political donations to his former boss’s daughter and Lisa Murkowski”",
            "title_similarity": "0.8063053",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv693jg",
            "score": -3,
            "text": "Does the left support Dubbya now?",
            "title_similarity": "0.2805736",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv6obf3",
            "score": -3,
            "text": "liberals seriously can't help themselves from sanitizing war criminals",
            "title_similarity": "0.55509925",
            "sentiment_compound": -0.89
        },
        {
            "id": "hv6sakk",
            "score": -2,
            "text": "Hmm…. must really be trying to hide something?",
            "title_similarity": "0.19591698",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hv6zw1l",
            "score": -1,
            "text": "Him, his family and the corrupt Clinton and Biden families should be in the garbage can of history.",
            "title_similarity": "0.5890527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7dguy",
            "score": -2,
            "text": "Further proof that Trump is the best president ever. If the Bush’s and the Clinton’s hate you, then you are correct. Hail Trump \\o",
            "title_similarity": "0.6096928",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hv7i4cr",
            "score": 2,
            "text": "You know things are really bad in the Republican Party when George W Bush looks like a good guy.",
            "title_similarity": "0.6159796",
            "sentiment_compound": 0.5118
        },
        {
            "id": "hv67zy7",
            "score": 38,
            "text": "How disgusting.  Why are people patting a war criminal on the back.  I hate this redemption tour BS.  Up next: Dick Cheney volunteering in a homeless shelter\n\nETA: If you need specific examples check my comment below",
            "title_similarity": "0.57732844",
            "sentiment_compound": -0.9565
        },
        {
            "id": "hv6hhpp",
            "score": 13,
            "text": "White washing a war criminal",
            "title_similarity": "0.4755003",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv612p9",
            "score": 79,
            "text": "Dude desperately trying to whitewash his legacy like he didn’t spend 8 years fomenting these exact kinds of culture wars",
            "title_similarity": "0.5258995",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hv5xm2p",
            "score": 42,
            "text": "DGAF. Bush helped make this bed and now he's trying to shed blame. Fuck 'im.",
            "title_similarity": "0.49772078",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hv5umqn",
            "score": 58,
            "text": "Unless its about his trial for war crimes I could not give a solitary fuck about who he gives money to.",
            "title_similarity": "0.5292839",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hv651u9",
            "score": 14,
            "text": "Cool. So when does he hang for lying about Iraq?",
            "title_similarity": "0.5410812",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hv5vm2q",
            "score": 12,
            "text": "Good Liz Cheney is gonna need all the support she needs for re-election to remain in office I’m not sure about Lisa Murkowski but if former president George W. Bush sees she’s worth investing in after she was one of the Republicans who impeached Donald Trump who am I to judge",
            "title_similarity": "0.7834899",
            "sentiment_compound": 0.5674
        },
        {
            "id": "hv64vbn",
            "score": 510,
            "text": "Please stop trying to rehabilitate Bush. He was a monstrous president who led us into two disastrous wars. Just because he has a nicer personality than Trump doesn't mean we should overlook how terrible he was.",
            "title_similarity": "0.64832056",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hv5qr2g",
            "score": 77,
            "text": "Still a war criminal",
            "title_similarity": "0.32900274",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6aosg",
            "score": 0,
            "text": "G.W. doing his money dance.",
            "title_similarity": "0.34229147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6ehec",
            "score": 0,
            "text": "Wow can we get a good guy brian meme going",
            "title_similarity": "0.32602218",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hv6euah",
            "score": 0,
            "text": "He can easily do a lot more. A LOT MORE.",
            "title_similarity": "0.12956189",
            "sentiment_compound": 0.34
        },
        {
            "id": "hv6ezre",
            "score": 0,
            "text": "Good for him!!!",
            "title_similarity": "0.039405663",
            "sentiment_compound": 0.5826
        },
        {
            "id": "hv6femo",
            "score": 0,
            "text": "How have we gotten to the point where the \"I'm the decider!\" and \"Mission Accomplished\" dude is the voice of calm reason?",
            "title_similarity": "0.29494387",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hv6g82z",
            "score": 0,
            "text": "Anyone who doesn't think that the Overton window has shifted radically to the right needs to look at Republican attitudes towards the Bushes and Trump.",
            "title_similarity": "0.63389635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6hz6z",
            "score": 0,
            "text": "It's honestly so weird as a high school and college student during the W Bush years that I would ever someday consider him or his cronies any form of ally to democracy or true social (non-New world) order",
            "title_similarity": "0.55356383",
            "sentiment_compound": 0.5512
        },
        {
            "id": "hv6i32w",
            "score": 0,
            "text": "Lol at GW’s photo with his mask on wrong",
            "title_similarity": "0.27948663",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hv6mwxl",
            "score": 0,
            "text": "Still a war criminal",
            "title_similarity": "0.32900274",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6pyjk",
            "score": 0,
            "text": "The guy gets it.",
            "title_similarity": "0.03940273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6s472",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv6syhj",
            "score": 0,
            "text": "That's a lot of blood money.",
            "title_similarity": "0.33109748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6z4ws",
            "score": 0,
            "text": "God damn it George you are a former president wear your mask properly",
            "title_similarity": "0.5161326",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hv727ya",
            "score": 0,
            "text": "Fuckinae George",
            "title_similarity": "0.2418963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv77kr5",
            "score": 0,
            "text": "Why couldn’t he cover his nose?",
            "title_similarity": "0.1591956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv78nz5",
            "score": 0,
            "text": "Smells like sulfur",
            "title_similarity": "0.08669998",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv79hau",
            "score": 0,
            "text": "Bush is a reason the oil industry is so strong. He is donating blood money",
            "title_similarity": "0.5651216",
            "sentiment_compound": 0.6418
        },
        {
            "id": "hv7abbn",
            "score": 0,
            "text": "If you told me “picture George w bush in a mask in your head” before I saw this photo it still would’ve been that same exact picture of him",
            "title_similarity": "0.48322266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7kfdt",
            "score": 0,
            "text": "Of course GWB wears his mask under his nose.",
            "title_similarity": "0.17128158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7ptok",
            "score": 0,
            "text": "A dumbass Republican supporting other dumbass republicans. Why is this news?",
            "title_similarity": "0.5815183",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hv7rall",
            "score": 0,
            "text": "Good for him now more sane Republicans need to do the same thing, the only problem with that is it'll be hard to find enough that could help.",
            "title_similarity": "0.39861923",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv7sunq",
            "score": 0,
            "text": "Check out this GTA series https://youtu.be/TPYkEo7-p3Y",
            "title_similarity": "0.30419195",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7tn82",
            "score": 0,
            "text": "freakin bush is a turncoat and an asshole , wa wa wa ,, because of his dislike, and hatred of a president much smarter, more cunning, better at ev earthing bush was not",
            "title_similarity": "0.51754767",
            "sentiment_compound": -0.1585
        },
        {
            "id": "hv7wp9z",
            "score": 0,
            "text": "The guy responsible for starting two wars is going to end up being a good guy… wow",
            "title_similarity": "0.35540754",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hv7zhg9",
            "score": 0,
            "text": "Making noise with a gesture doesn’t make up for screwing up our country for 8 years",
            "title_similarity": "0.41255456",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hv7zi9n",
            "score": 0,
            "text": "Never freakin' ever thought I'd be upvoting the W.",
            "title_similarity": "0.2539642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7zpik",
            "score": 0,
            "text": "Retroactive love to GWB.",
            "title_similarity": "0.21503556",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv819uw",
            "score": 0,
            "text": "/r/politics and rehabilitating war criminals (or refusing to actually acknowledge war criminals, e.g. drone strike Obama). Name a more iconic duo.",
            "title_similarity": "0.7136425",
            "sentiment_compound": -0.9607
        },
        {
            "id": "hv81jes",
            "score": 0,
            "text": "This guy hates when someone doesn’t continue his war",
            "title_similarity": "0.2936479",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hv81oxn",
            "score": 0,
            "text": "How does an ex president not know that wearing a mask like he’s wearing it, is as good as not wearing one at all, and even if it was covering his nose and mouth properly, cloth masks, at least without replaceable filters, are completely useless when it comes to, especially the Omicron variant, due to its extreme contagiousness, not that it’s much better for any of the other variants? If you’re not gonna wear a mask properly, and wear a proper mask, like an N 95, or KN 95, again especially with the Omicron variant, you might as well wear nothing!",
            "title_similarity": "0.49990883",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hv82p5l",
            "score": 0,
            "text": "Gee I wonder why?  Maybe because W knows that Trump knows all of his dirty little secrets.  W turned out to be a huge POS",
            "title_similarity": "0.5243131",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hv8519o",
            "score": 0,
            "text": "George W Bush, war criminal*\n\nftfy",
            "title_similarity": "0.6016495",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv854dd",
            "score": 0,
            "text": "He's either gotten dumber or he just loves given away money to a complete farce! This has ended up nowhere and wasted hundreds of thousands of dollars and time that could have been spent helping Trump instead of fighting him. Everything that man said was spot on, if the first year of Biden doesn't further confirm everything he said then I don't know who or what will! Cant wait to see how it unfolds or should I say blows up in their laps!",
            "title_similarity": "0.54176915",
            "sentiment_compound": 0.4027
        },
        {
            "id": "hv85hq6",
            "score": 0,
            "text": "Let's all congratulate the war criminal who doesn't understand how to wear a mask.",
            "title_similarity": "0.46532017",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv886d4",
            "score": 0,
            "text": "Just because you dont like Trump doesn’t mean that Bush was any good. Don’t go forgiving all his shitty leadership decisions just because he donated $5,600 of his fortune. I hate how the media has gotten people to start liking the biggest warhawks of our time just because they said something that they agree with. Lets not be that easy",
            "title_similarity": "0.6304796",
            "sentiment_compound": -0.2062
        },
        {
            "id": "hv88yhg",
            "score": 0,
            "text": "Blah blah",
            "title_similarity": "0.011173641",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hv892dv",
            "score": 0,
            "text": "What an A$$",
            "title_similarity": "0.25919306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8ew21",
            "score": 0,
            "text": "Daily dose of ‘trump is bad’ while biden sleeps.",
            "title_similarity": "0.37683865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8fiak",
            "score": 0,
            "text": "This just in war criminal supports war criminals",
            "title_similarity": "0.5997642",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hv8gqm0",
            "score": 0,
            "text": "Bush was the worst president in my lifetime but Biden is getting close.",
            "title_similarity": "0.52879643",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hv8idrj",
            "score": 0,
            "text": "Good for him. He thinks his donation will be tax deductible next year. And just to let you know he and the whole bush family and clan are illuminati and elites. Put that in your hat. You will see many items of what they did.....Good luck George.",
            "title_similarity": "0.6158212",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hv8oguv",
            "score": 0,
            "text": "The Republican party as a whole has had its head up Trumps back side since 2016 and probably going back as far as 1990 when Trump was best buddies with Jeffery Epstein.  Makes one ponder what do you have to do to get on the best friend's list of a known sexual child offender's Christmas list? I would go as far as predatory, which also seems to be the minimum for some of these Republican's to do list.  I mean who wouldn't want to pop a 14 year old cherry. Jeffery Epstein and his long time girlfriend / business associate would make that happen for the right amount of down-payment. Trump has stayed clear of many go-to circles, you can bet.. at any one of his lush estates or lavish golf courses you can get anything, when money is not an problem.  \nHe has gotten himself in a bit of legal trouble saying how much his property values are when he needs to borrow a few hundred million, and devalue the same property's when doing his US taxes, cuz you never know how much anything is in Trump's world.  \n\n\nBush donating to Liz Cheney kind of a no brainer since her father was Bush's Vice President. Not sure what role he held as Vice President. Dick Cheney. I remember Vice-President Dick Cheney accidentally shot Whittington age 78 at the time of the shooting, in the face with a 12 gauge shotgun while on a hunting trip in Texas on Sunday, Feb. 12, 2006. I guess Bush is paying it forward.",
            "title_similarity": "0.66460055",
            "sentiment_compound": 0.6217
        },
        {
            "id": "hv8ouxx",
            "score": 0,
            "text": "Damn and to think I used to believe he was really evil. I had no idea….",
            "title_similarity": "0.28616485",
            "sentiment_compound": -0.8622
        },
        {
            "id": "hv8q4xw",
            "score": 0,
            "text": "Lmao imagine starting two wars and the liberal clowns of Reddit praise you as better than the guy who started none.",
            "title_similarity": "0.53652525",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hv8rpx2",
            "score": 0,
            "text": "Yawn 🥱",
            "title_similarity": "0.055076983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8sbw8",
            "score": 0,
            "text": "All 3 are still terrible.",
            "title_similarity": "0.049233593",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv8uar5",
            "score": 0,
            "text": "All brothers.",
            "title_similarity": "0.20636325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8uds2",
            "score": 0,
            "text": "Maxwell and epstein got no media coverage? You piggies.",
            "title_similarity": "0.31729078",
            "sentiment_compound": -0.296
        },
        {
            "id": "hv8umdp",
            "score": 0,
            "text": "The establishment supporting the establishment.",
            "title_similarity": "0.1473852",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv8uu18",
            "score": 0,
            "text": "It takes so little to get /pol/ to support a war criminal. He did far more damage than trump",
            "title_similarity": "0.42749864",
            "sentiment_compound": -0.8439
        },
        {
            "id": "hv90pqt",
            "score": 0,
            "text": "Fuck this war criminal piece of shit.",
            "title_similarity": "0.35495058",
            "sentiment_compound": -0.9371
        },
        {
            "id": "hv93lai",
            "score": 0,
            "text": "Rinos gonna rino",
            "title_similarity": "0.14985839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv93oio",
            "score": 0,
            "text": "If you're going to foist a lie on the nation, you really kinda need a high ranking general on board.",
            "title_similarity": "0.62173903",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv9xzck",
            "score": 0,
            "text": "Bush can kiss my ASS.  Hed is not interested in America.  His level of maturity is so disappointing.",
            "title_similarity": "0.4047197",
            "sentiment_compound": -0.832
        },
        {
            "id": "hv6hg4u",
            "score": 8,
            "text": "While this is good and trump is the worst thing to happen to my country in my lifetime, George bush is the second. Him and dick Cheney are war criminals who ruined a generation and lead us into and illegal war based off a lie. So fuck trump and fuck George bush.",
            "title_similarity": "0.6393794",
            "sentiment_compound": -0.9857
        },
        {
            "id": "hv5ppnm",
            "score": 119,
            "text": "Anything to divert status from “worst president ever” to someone else.",
            "title_similarity": "0.5582998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv5qvpt",
            "score": 397,
            "text": "I don’t give a fuck about Bush, he paved the way ….",
            "title_similarity": "0.27269602",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv5v3g4",
            "score": 40,
            "text": "All are scumbags, all have made the world a worse place. They deserve no praise, they deserve condemnation and ridicule. Don’t let the evils of Trump take away from these corporatist slime balls that would create a fake war to profit in Heartbeat, or to put millions of kids in poverty for political donations. The enemy of my enemy is not my friend, just another enemy.",
            "title_similarity": "0.56360936",
            "sentiment_compound": -0.9882
        },
        {
            "id": "hv6kk5s",
            "score": 4,
            "text": "Bush donates to republicans.\n\nGreat story. How brave of him",
            "title_similarity": "0.56008786",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hv5uoeo",
            "score": 217,
            "text": "Now give away your entire family fortune to help the Iraqi victims of the war you started.",
            "title_similarity": "0.6464505",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv6k0og",
            "score": 165,
            "text": "War criminal maxes out donation to daughter of war criminal",
            "title_similarity": "0.6757157",
            "sentiment_compound": -0.9393
        },
        {
            "id": "hv5y2ts",
            "score": 5,
            "text": "Give them some of that dark money, George.",
            "title_similarity": "0.40303722",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv5z7jr",
            "score": -7,
            "text": "I've always admired George W. Bush, Liz Cheny, and Lisa Murkowski.",
            "title_similarity": "0.35816878",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hv7bqif",
            "score": 8,
            "text": "i still think he’s a piece of shit, but i appreciate that his heart is in the right place.",
            "title_similarity": "0.22114936",
            "sentiment_compound": 0.8422
        },
        {
            "id": "hv65mdu",
            "score": 1,
            "text": "I think the Obama’s won him over. Especially Michelle.",
            "title_similarity": "0.41977328",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hv68kji",
            "score": 1,
            "text": "Nepotism is the virus that plagues democracy.",
            "title_similarity": "0.48050478",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv68qg9",
            "score": 1,
            "text": "Nobody makes fun of Jeb! and gets away with it",
            "title_similarity": "0.2263827",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hv68ub0",
            "score": -1,
            "text": "This turnabout is just like Abi Maria in survivor.",
            "title_similarity": "0.2919541",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hv69joe",
            "score": 1,
            "text": "You done piss off Dubya.",
            "title_similarity": "0.2880106",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hv69qji",
            "score": -1,
            "text": "He's still a mass murderer, or at best the perpetrator of countless negligent homicides. Good for him on this, though.",
            "title_similarity": "0.4836222",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hv69xhe",
            "score": 1,
            "text": "Murkowski is entirely capable of pressing a button for 'yes' to help end the filibuster as well as help pass the new voting rights act...but she doesn't love democracy *that* much...\n\nIt's not two right-leaning democrats who are the issue, it's 50 republican senators who won't budge on their zealotry even to save America.",
            "title_similarity": "0.64276636",
            "sentiment_compound": 0.8984
        },
        {
            "id": "hv6btte",
            "score": 1,
            "text": "Opposite Bush doctrine:  Keep the fight here instead of over there.  By flooding money and resources within the GOP, the fight isn't on the national arena.",
            "title_similarity": "0.55749774",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hv6by5r",
            "score": -1,
            "text": "Can he not put the mask on right lol cmon bush",
            "title_similarity": "0.2635358",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv6cvi9",
            "score": -1,
            "text": "do not forget that he’s a war criminal",
            "title_similarity": "0.43738818",
            "sentiment_compound": -0.7673
        },
        {
            "id": "hv6dqip",
            "score": 1,
            "text": "American democracy is hanging by a thread. Bush could be doing so much more to combat the extremism.",
            "title_similarity": "0.6612268",
            "sentiment_compound": -0.3976
        },
        {
            "id": "hv6dvj8",
            "score": -1,
            "text": "My understanding is that the first thing inside his pres library is a display (interactive?) that attempts to defend his preemptive war on Iraq.  \n\n  \nThis man has a big cross to bear and a lot of blood on his hands.",
            "title_similarity": "0.5426082",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv6e1yp",
            "score": 1,
            "text": "I've maxed out my 5 free BI views foe the month (wtf it's a new month!). Can anyone share the article please and thank you",
            "title_similarity": "0.43247804",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hv6ec3n",
            "score": -1,
            "text": "Of course Dubya is confused by masks. Chin diaper motherfucker.",
            "title_similarity": "0.32501656",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hv6eqel",
            "score": 1,
            "text": "Good to see somebody doing the right thing no matter how insignificant it is",
            "title_similarity": "0.049049698",
            "sentiment_compound": 0.1093
        },
        {
            "id": "hv6et5v",
            "score": 1,
            "text": "This is what too little too late looks like.  \n\nThe GOP had no policies even in Dubya's time, except tax cuts for the rich and weird culture-war distractions to keep the rubes voting.  \n\nBut now the whole party has metastasized into something openly violent and horrible.  If you can see there's something wrong, you can surely see that you can't stop it by giving money to Liz Cheney.   \n\nDubya here is like a parody of Republican voters--\"I can see this has gone off the rails, but I lack the mental flexibility to do anything except keep supporting Republicans...\"",
            "title_similarity": "0.69951415",
            "sentiment_compound": 0.5903
        },
        {
            "id": "hv6f0z0",
            "score": 1,
            "text": "Hell froze over...",
            "title_similarity": "0.11701868",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hv6f8z0",
            "score": -1,
            "text": "Are we supposed to assume these things are related though? It seems like the donations came several months prior.",
            "title_similarity": "0.36815032",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv6fiab",
            "score": -1,
            "text": "I know there are no Trump fans here. I am not one either. All of that said I’m not a bush fan either and I don’t care what someone with the last name of bush wants I just know I probably don’t.",
            "title_similarity": "0.3154261",
            "sentiment_compound": 0.0098
        },
        {
            "id": "hv6filx",
            "score": -1,
            "text": "I'm willing to bet Bush had voted for Biden in the election too.",
            "title_similarity": "0.69139576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6gyrm",
            "score": -1,
            "text": "\"where we're going, we don't have maximum donations\"\n\n- super pacs",
            "title_similarity": "0.40497208",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hv6hyqt",
            "score": -1,
            "text": "God bush cant even wear his mask right",
            "title_similarity": "0.14697902",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv6i614",
            "score": -1,
            "text": "Max out....lol this is America",
            "title_similarity": "0.4003973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6i72x",
            "score": -1,
            "text": "God I hate giving GW credit...but I will!",
            "title_similarity": "0.3050912",
            "sentiment_compound": -0.126
        },
        {
            "id": "hv6jent",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.07474039"
        },
        {
            "id": "hv6r7m8",
            "score": 1,
            "text": "Love George more all the time.",
            "title_similarity": "0.20119816",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6r950",
            "score": 1,
            "text": "Right on!",
            "title_similarity": "-0.011666071",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6rkg1",
            "score": -1,
            "text": "A war criminal and a war criminal part of the good ol boys club putting on some political theater. Bush PR team really putting it all on the line",
            "title_similarity": "0.6010859",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hv6s580",
            "score": -1,
            "text": "Because Dicky and him are trying to get into heaven. Fucking murdering pigs.",
            "title_similarity": "0.41319096",
            "sentiment_compound": -0.3167
        },
        {
            "id": "hv6z1op",
            "score": 1,
            "text": "When you wanna to remind people that you aren’t the worst president anymore.",
            "title_similarity": "0.5525057",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv71ep7",
            "score": 1,
            "text": "As someone that lived thru Katrina in New Orleans the fact that people are sticking up for Bush in any way shape or form makes me want to KMS. Trump was better, period.",
            "title_similarity": "0.5103484",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hv71k7b",
            "score": -1,
            "text": "You out your mind if you think this warmonger/artist/sport connoisseur doesn’t have other means to throw his money at this.",
            "title_similarity": "0.45777082",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv71w3l",
            "score": -1,
            "text": "Cool. Still a war criminal.",
            "title_similarity": "0.32146215",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hv72int",
            "score": -1,
            "text": "Came here to talk about how horrible W. was and saw reddit still remembers.",
            "title_similarity": "0.4184971",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv734q8",
            "score": -1,
            "text": "Remember irak war? Where millions of ppl died for a few old fucks to get access to a huge oil reserve in  northern Iraq?",
            "title_similarity": "0.5735392",
            "sentiment_compound": -0.8645
        },
        {
            "id": "hv734xj",
            "score": -1,
            "text": "Lol can’t impeach a private citizen.",
            "title_similarity": "0.309828",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv74eqt",
            "score": 1,
            "text": "Too little, too late.",
            "title_similarity": "0.00693194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv756cm",
            "score": -1,
            "text": "W remembers a time - between the coke-fueled binges - when the Republican party put on a public face of stability and order. He longs for the days when Poppy would have just made a phone call and cleaned things up.",
            "title_similarity": "0.5522381",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv75j4q",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.07474039"
        },
        {
            "id": "hv76zsa",
            "score": -1,
            "text": "Look, he’s still an idiot! Doesn’t have his mask over his mouth and nose! Lol. Good ol W. Always good for a lol.",
            "title_similarity": "0.23198509",
            "sentiment_compound": 0.8264
        },
        {
            "id": "hv77agu",
            "score": -1,
            "text": "Still a war criminal.",
            "title_similarity": "0.32758182",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv7971p",
            "score": 1,
            "text": "This guy started all of this in 01. Not a hero or someone to admire.",
            "title_similarity": "0.24810201",
            "sentiment_compound": 0.0454
        },
        {
            "id": "hv79m7u",
            "score": -1,
            "text": "More claps for the establishment!",
            "title_similarity": "0.20277806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv79nch",
            "score": -1,
            "text": "Please don’t rehabilitate Mr War Crimes Jr.",
            "title_similarity": "0.3962357",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv79twj",
            "score": -1,
            "text": "Still a war criminal.",
            "title_similarity": "0.32758182",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv7a9li",
            "score": 1,
            "text": "He should have spoke up earlier.",
            "title_similarity": "0.13510537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7as34",
            "score": -1,
            "text": "He must want something. Something he knows trump wont give him.",
            "title_similarity": "0.25728628",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv7b2e5",
            "score": 1,
            "text": "Bush JR looks like Hanibal Lector in that picture.",
            "title_similarity": "0.41016763",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv7b9j4",
            "score": -1,
            "text": "Interesting to see what a man who sold this country to the NSA and big banks thinks are good candidates and who hes willing to put his money behind.",
            "title_similarity": "0.66367245",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hv7bhjw",
            "score": -1,
            "text": "As we all know the entire Bush families have been staunch \nliberal Democrats, and we have always been at war with Eastasia /s",
            "title_similarity": "0.5106292",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv7ceop",
            "score": 1,
            "text": "Yes!!! A REAL REPUBLICAN!",
            "title_similarity": "0.31821182",
            "sentiment_compound": 0.5951
        },
        {
            "id": "hv7ctff",
            "score": -1,
            "text": "Just a reminder though that George W. Bush is likely a war criminal and should be tried and if found guilty, thrown in jail.\n\nTrump is a piece of shit but he may have (so far) done less damage to the world as a president than George W Bush.",
            "title_similarity": "0.63878214",
            "sentiment_compound": -0.8936
        },
        {
            "id": "hv7cxqx",
            "score": 1,
            "text": "When a war criminal is like “ooo too far” \n\nYou know you’re fucked.",
            "title_similarity": "0.4567724",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hv7cz8z",
            "score": -1,
            "text": "Sorry I voted for this Anti American piece of garbage.",
            "title_similarity": "0.4760198",
            "sentiment_compound": -0.4451
        },
        {
            "id": "hv7d957",
            "score": -1,
            "text": "Did he max out donations to deniers?",
            "title_similarity": "0.52567816",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hv7dkpz",
            "score": 1,
            "text": "Liz Chaney for prez.",
            "title_similarity": "0.30093887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7f2kx",
            "score": -1,
            "text": "Chin diaper lookin’ ass",
            "title_similarity": "0.1971211",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv7fzyq",
            "score": 1,
            "text": "I miss respectable Republicans....",
            "title_similarity": "0.34735468",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hv7hvdc",
            "score": -1,
            "text": "Warpigs support warpigs.",
            "title_similarity": "0.1552341",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv7i0dm",
            "score": -1,
            "text": "I personally wouldn't fuck with  G W Bu$h .who killed? A million iraqs, who knows how many Americans ect.over a grudge ,n oil, sold made up obvious lies and killed Men woman n children. And used 2 run C.i.a. . And is portrayed as a cute grandpa ,painter, on t.v. . I wouldn't fuck with that.",
            "title_similarity": "0.6565225",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv7igek",
            "score": 1,
            "text": "He’s a bigger scumbag than Trump by **a lot.**",
            "title_similarity": "0.278194",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hv7iwn2",
            "score": 1,
            "text": "*everyone* should do this.",
            "title_similarity": "0.06463971",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7lrnv",
            "score": 1,
            "text": "He’s not as dumb as y’all made him out to be.",
            "title_similarity": "0.0856874",
            "sentiment_compound": 0.4023
        },
        {
            "id": "hv7lzj3",
            "score": -1,
            "text": "I don’t understand. Why do we care about right wing inside baseball? Fuck all of them.",
            "title_similarity": "0.4277563",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hv7mau7",
            "score": 1,
            "text": "Fuck George Bush",
            "title_similarity": "0.435719",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv7o3gs",
            "score": -1,
            "text": "You’re all utterly obsessed",
            "title_similarity": "0.13861397",
            "sentiment_compound": -0.2484
        },
        {
            "id": "hv7ps3y",
            "score": 1,
            "text": "Dont you dare make me like W.  Stop it.",
            "title_similarity": "0.22816159",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv82h2n",
            "score": -1,
            "text": "This is how the swamp works",
            "title_similarity": "0.06948978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv851sf",
            "score": -1,
            "text": "Bush really turned into a pathetic loser Ted Cruz would be a much better president than Bush ever was",
            "title_similarity": "0.4611448",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hv8atnl",
            "score": -1,
            "text": "George Bush is part of a continuing group of globalists who were never truly Democrats or Republicans. Between him, Clinton and Obama, they simply brought to the surface what has been going on for decades. They were all playing from the same script and only insiders were allowed to reach their position. Trump changed all that and they have been trying their hardest to get rid of him ever since. They would all do us a favor if they just went to their maker sooner, rather than later, along with all their globalist friends. They are hopefully, a generation that is gradually passing away in the literal sense. We must do our best to make sure that their kind never rise to power again.",
            "title_similarity": "0.5492705",
            "sentiment_compound": 0.9509
        },
        {
            "id": "hv8ekn8",
            "score": -1,
            "text": "He also orchestrated 9/11, so there’s that..... maybe not who you should be rootin for",
            "title_similarity": "0.40913457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8oxbw",
            "score": 1,
            "text": "Well ain't this the best thing this turd has ever done.",
            "title_similarity": "0.19601403",
            "sentiment_compound": -0.3111
        },
        {
            "id": "hv8qjti",
            "score": -1,
            "text": "Was he the worst president or Jimmy Carter? Not including Brandon, because his term isn’t over.",
            "title_similarity": "0.4868141",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv8t1z0",
            "score": 1,
            "text": "George W Bush is functionally the same person as Barack Obama and Hillary Clinton (Bill too).",
            "title_similarity": "0.51193887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8tm0t",
            "score": 1,
            "text": "Alternative title: *Distinguished Moron and Known War Criminal Uses Money to Express His Feelings*",
            "title_similarity": "0.5677252",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hv8uimu",
            "score": 1,
            "text": "Wow I love George W Bush now",
            "title_similarity": "0.2990489",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hv92hqi",
            "score": -1,
            "text": "Most evil person in recent history, trump doesn't even make a dent in comparison to how awful bush was...",
            "title_similarity": "0.41576314",
            "sentiment_compound": -0.8268
        },
        {
            "id": "hv9vsg4",
            "score": 1,
            "text": "At this point, I think Trump is the only President that still believes in the Constitution.  How was it that Bush was able to enter Iraq and wage a forever war that accomplished nothing.",
            "title_similarity": "0.5798449",
            "sentiment_compound": -0.25
        },
        {
            "id": "hvaxjq2",
            "score": 1,
            "text": "The war criminal wants to criticize Trump? He deserves prison ten times as much as Trump ever did.",
            "title_similarity": "0.55928886",
            "sentiment_compound": -0.9217
        },
        {
            "id": "hv6595d",
            "score": 8,
            "text": "Oh gee isn’t it nice when war criminals who killed hundreds of thousands of people and committed war crimes for years gets a redemption tour. Yay?",
            "title_similarity": "0.5888228",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hv6qyhr",
            "score": 17,
            "text": "On the one hand, fuck GWB.  On the other hand, also fuck GWB.",
            "title_similarity": "0.25075334",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hv5ztu3",
            "score": 8,
            "text": "Republican war criminal donates to Republicans. Ok, so?",
            "title_similarity": "0.71439266",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv5r8r4",
            "score": 304,
            "text": "His admin created most of the monsters we have now. Can’t put pandora back in his box, Bush\n\nEdit: I will no longer respond to people that are not [cultured in the finest of arts](https://youtu.be/EAbrP4DqoFE)",
            "title_similarity": "0.5282376",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hv60et6",
            "score": 2,
            "text": "He needs to open is mouth and get involved. His money won't do a damn thing.",
            "title_similarity": "0.32498595",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hv615nt",
            "score": 2,
            "text": "...the world we live in right now...\n\nHow is Bush one of the sane ones??? Republicans need to seriously look at themselves and ask themselves that question. If you are not ok with racism, bigotry, hate, putting Russia before your own country, bullying, and glorifying traitors then maybe you should leave your party.",
            "title_similarity": "0.65389025",
            "sentiment_compound": -0.3682
        },
        {
            "id": "hv62vla",
            "score": 2,
            "text": "I'm always joking that Trump was paid for by George W just to make sure he didn't go down in history as the most inept President. If it were true Bush would be getting his money's worth. I never thought I would suggest Bush could salvage his reputation but I do appreciate the small comments he provided during all of this. He made me realize there is a country mile of difference between total ineptitude and actual evil.",
            "title_similarity": "0.6225049",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hv6375k",
            "score": 2,
            "text": "George W. Bush sat around while planes flew into buildings.\n\nIf a Democrat was president on 9/11 you would still be hearing about it on Fox News.",
            "title_similarity": "0.6096866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv63dpe",
            "score": -2,
            "text": "He must be so racist\n\n/s",
            "title_similarity": "0.27707472",
            "sentiment_compound": -0.7283
        },
        {
            "id": "hv66qar",
            "score": 2,
            "text": "Trump makes W look good. So anything to help his reputation and also Democracy in this Country is good.",
            "title_similarity": "0.47550425",
            "sentiment_compound": 0.83
        },
        {
            "id": "hv67gwo",
            "score": 2,
            "text": "And of course he's dick-nosing his mask...",
            "title_similarity": "0.29791564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv68f35",
            "score": 2,
            "text": "GWB is term limited and can't be president again.\n\nTrump can still serve 1 more term if elected.  \n\nFrom here forward, Trump is a worse danger.\n\nI'll take GWB's help.",
            "title_similarity": "0.5494187",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hv68v5e",
            "score": 2,
            "text": "Bush, his administration, his family, and what they represented are directly responsible for this situation.\n\nAnd none of them disagree with the policies of the Trump administration, just the presentation and personality.",
            "title_similarity": "0.5451753",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hv694we",
            "score": 2,
            "text": "I'm still banking that Dick and Liz know a LOT MORE than they are letting on. \n\nDick Cheney is a big player in the world of DC and its various games and intelligence agencies. He still HAS top secret data and I wouldnt' be surprised if this entire Liz vs Trump thing is positioning her for a POTUS run. \n\nShe's the most vocal and visible person against Trump while having a safe place to push out from. If the GOP fractures/splinters she's there to pick up the pieces and run with it. Along with Romney. \n\nCheney and Romney would appeal to the LARGE middle base of both Dems and current GOP. They would be a very hard pairing to beat as POTUS and VP. \n\nAlso they both back Cheney's quiet strangulation methods. \n\nRomeny and Cheney both running as a pro-democratic, anti-Trump, middle group would just have to worry about clearing the primary. \n\n*2024 is likely out of reach for Cheney, but not for Romney IF 1/6 guts the leaders in the far right GOP.\n\nEdit: Continuing on, polls show Biden beating Trump but losing to a \"generic\" GOP. Romney and Cheney are as generic a GOP as you can get. Neither one would fire up the voting base, and turnout would be low. That also favors the GOP in every other election as well.",
            "title_similarity": "0.68453246",
            "sentiment_compound": -0.7027
        },
        {
            "id": "hv6aygf",
            "score": 2,
            "text": "> George W. Bush tries to whitewash his legacy by appearing to be a somewhat decent guy\n\nFTFY",
            "title_similarity": "0.48478633",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hv6bcb9",
            "score": -2,
            "text": "I sometimes wonder if it’s all a setup. Perhaps Donald trump is not a bigoted moron wannabe dictator. Perhaps Donald trump is actually the smartest and greatest democrat to ever live. \n\nI mean we have a life long democrat that changes party then makes a run for the presidency and wins. He proceeds to be the worst president in modern history consistently polling with a lower approval rating than any previously tracked president. He embraces all kinds of crazies and bigots. He offends free world leaders and pals around with as many dictators as he can. He inspires a violent uprising against his own Vice President and then publicly brags that should he gain the authority again, he will pardon those people. \n\nIt’s kind of crazy to actually think about how much of a failure trumps term was. He literally accomplished none of what he said before being elected. He didn’t fix the border or make Mexico pay, he ran up the national debt worse than anybody instead of paying it off. He didn’t bring back manufacturing jobs, he lost 3 million jobs and shrank our manufacturing jobs. He didn’t lock up Hillary, end wars or close Guantanamo bay. You can go back to videos from 2016 and literally every single thing trump said in 2016 turned into failure on the way to 2020. I’m not really sure it possible to have such a consistent failure rate without it being intentional. \n\nGiven the massively negative results on the Republican Party coming from the trump presidency, it’s not completely out of the question that’s trump is still a democrat and he is just working, quite effectively, to take down to Republican Party from within.",
            "title_similarity": "0.6349652",
            "sentiment_compound": 0.1152
        },
        {
            "id": "hv6bgyb",
            "score": 2,
            "text": "I forgive but I don't forget",
            "title_similarity": "0.04652803",
            "sentiment_compound": 0.3714
        },
        {
            "id": "hv6c2bn",
            "score": -2,
            "text": "Can't wait to piss on your grave George.",
            "title_similarity": "0.38076103",
            "sentiment_compound": -0.088
        },
        {
            "id": "hv6cbmj",
            "score": 2,
            "text": "I guess he’s a RINO too.   /s",
            "title_similarity": "0.20166229",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6dcvw",
            "score": -2,
            "text": "None of you W detractors even read the article, did you?",
            "title_similarity": "0.31542152",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6djpq",
            "score": -2,
            "text": "Desperate",
            "title_similarity": "0.07402009",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hv6dlbz",
            "score": -2,
            "text": "Figures he would do something like this.",
            "title_similarity": "0.06657241",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv6dtx5",
            "score": 2,
            "text": "Hey, George W. Bush. If you want to donate to people who voted to impeach Donald Trump, just so you know, the entire Democrat party could use those donations too.",
            "title_similarity": "0.79768276",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hv6e12u",
            "score": 2,
            "text": "Republicans will just say he’s a “RINO” or part of the “deep state”",
            "title_similarity": "0.53340006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6egnr",
            "score": 2,
            "text": "Heh... I remember when people where like \"he's the worst president Evar!\" Turns out no, you can do worse...",
            "title_similarity": "0.52812743",
            "sentiment_compound": -0.7644
        },
        {
            "id": "hv6ejsp",
            "score": 2,
            "text": "Is this similar to when Zuko joined the gang to defeat the fire lord?",
            "title_similarity": "0.5281271",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hv6ew92",
            "score": 2,
            "text": "Trump ousting every single Republican who dares to criticize him is THE DICTIONARY DEFINITION of a cult.\n\nMan belongs under the prison. Not in it.",
            "title_similarity": "0.6009848",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hv6f8no",
            "score": -2,
            "text": "He maxed out donations to the daughter of his warmongering VP.  big shock.",
            "title_similarity": "0.6867356",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hv6fc0h",
            "score": -2,
            "text": "So we don’t hate GWB anymore?",
            "title_similarity": "0.21893261",
            "sentiment_compound": -0.6077
        },
        {
            "id": "hv6fou9",
            "score": -2,
            "text": "He’s still a war criminal",
            "title_similarity": "0.353518",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6frp4",
            "score": -2,
            "text": "Well there goes any sympathies I had for the guy.",
            "title_similarity": "0.29012537",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv6g013",
            "score": 2,
            "text": "Telling that Bush is the good guy here. F*cking Bush.",
            "title_similarity": "0.3214352",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6g46z",
            "score": 2,
            "text": "Bush was not a good president",
            "title_similarity": "0.34701425",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hv6gfgk",
            "score": -2,
            "text": "Thats fine…he and Duck should still be charged with war crimes",
            "title_similarity": "0.5038393",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hv6gsok",
            "score": 2,
            "text": "Bush is a war criminal lol",
            "title_similarity": "0.52423155",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hv6h0r4",
            "score": 2,
            "text": "Half measures. Bush, McConnell and other influential Republicans need to speak out AGAINST Trump and condemn him for the cancer he is to America.",
            "title_similarity": "0.71191585",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv6h8yp",
            "score": 2,
            "text": "There should never be another Republican President again.",
            "title_similarity": "0.3993781",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6hg9o",
            "score": -2,
            "text": "The swamp runs deep. Know no party lines…",
            "title_similarity": "0.2325939",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hv6i14l",
            "score": -2,
            "text": "I still love Bush - but this is out of touch with the current main stream right.",
            "title_similarity": "0.2598288",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hv6i3n2",
            "score": -2,
            "text": "Please tell me how Trump is not a symptom of the awful governance of his administration? His Executive over reach and inability to control the obstructionism within his party became Presidential precedent. His choosing politics over policy and polarizing cultural ideologies via hard nosed Christian fundamentalism/anti government world view.  That’s how we got the Katrina response and the Iraq war.",
            "title_similarity": "0.7368001",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hv6ij2q",
            "score": 2,
            "text": "And the Resist liberals go wild!...",
            "title_similarity": "0.46885884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6ikiq",
            "score": -2,
            "text": "cringe",
            "title_similarity": "0.04593807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6ltoe",
            "score": 2,
            "text": "Ok, cool. But W still doesn’t get a pass for his transgressions.",
            "title_similarity": "0.19377422",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hv6mc03",
            "score": 2,
            "text": "Yeah, well George Bush existed before MAGA and the Tea Party. He'd be a socialist to today's right wing.",
            "title_similarity": "0.5343736",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hv6oe2z",
            "score": 2,
            "text": "I didn't like bush back in the day, but he has my respect",
            "title_similarity": "0.23747277",
            "sentiment_compound": 0.5566
        },
        {
            "id": "hv6oh1x",
            "score": 2,
            "text": "Let's not have our hatred of Trump blind us to the fact that George W Bush is a war mongering psychopath with the blood of millions on his hands... He is not our ally.",
            "title_similarity": "0.6522958",
            "sentiment_compound": -0.6164
        },
        {
            "id": "hv6pyvg",
            "score": -2,
            "text": "Wtf i love George w Bush now",
            "title_similarity": "0.32854933",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hv6rvv2",
            "score": 2,
            "text": "What has America become when GWB becomes the best the Republican party has to offer...",
            "title_similarity": "0.60899085",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hv6sdof",
            "score": -2,
            "text": "Cool. George Bush is also a warmongering piece of shit that should be in prison too!",
            "title_similarity": "0.46150416",
            "sentiment_compound": -0.8553
        },
        {
            "id": "hv6t6u4",
            "score": -2,
            "text": "Well, he is an idiot so what do you expect?",
            "title_similarity": "0.18888444",
            "sentiment_compound": -0.296
        },
        {
            "id": "hv6twwy",
            "score": -2,
            "text": "Bush is an even bigger piece of shit than Trump. He needs to go away already.",
            "title_similarity": "0.4260779",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hv6vpx4",
            "score": 2,
            "text": "This is the happiest GWB has ever made me.",
            "title_similarity": "0.1720912",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6zgh6",
            "score": 2,
            "text": "The enemy of my enemy is my friend.",
            "title_similarity": "0.4197869",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hv6zi0x",
            "score": -2,
            "text": "Why do we care what this warmonger thinks again?",
            "title_similarity": "0.37402374",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hv72j41",
            "score": -2,
            "text": "Fuck you Bush:\n\nFuck you, Bush. \n\nIt's time to get out of Iraq, Bush. \n\nWhat were you even doing there in the first place, Bush? \n\nYou didn't even get properly elected, Bush.\n\nAre you happy now, Bush?\n\nFuck you, Bush!",
            "title_similarity": "0.57116634",
            "sentiment_compound": -0.8152
        },
        {
            "id": "hv738ay",
            "score": -2,
            "text": "What a RINO piece of shit.",
            "title_similarity": "0.15384272",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hv744qy",
            "score": -2,
            "text": "Awww, poor George. That mean old Cheeto Man stole your little brother's lunch money. 😢\n\nBTW, George, how was your service in Viet Nam? Oh that's right! You didn't want to serve in a senseless war. Feel free to send thousands of others to your boneheaded adventure. Mission Accomplished!!!",
            "title_similarity": "0.5412831",
            "sentiment_compound": -0.6111
        },
        {
            "id": "hv74irf",
            "score": 2,
            "text": "WTF, I love Bush now.",
            "title_similarity": "0.1700425",
            "sentiment_compound": -0.0857
        },
        {
            "id": "hv74wl3",
            "score": -2,
            "text": "Still committed to the war on terror",
            "title_similarity": "0.3195591",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hv75dfh",
            "score": 2,
            "text": "Ha ha! Remember when Dubya was the worst president ever!\n\nProgress! We've invented even worse leaders!",
            "title_similarity": "0.49239165",
            "sentiment_compound": -0.6331
        },
        {
            "id": "hv7626v",
            "score": -2,
            "text": "Lol only George dubya is allowed to steal elections",
            "title_similarity": "0.45953006",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hv765de",
            "score": -2,
            "text": "everyone mentioned in this article is a giant piece of shit, why is this news?",
            "title_similarity": "0.34823626",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hv765i7",
            "score": -2,
            "text": "Yeah let’s venerate him. The mastermind behind Afghanistan and Iraq.\n\nE: Wow. Imagine being dv’d for criticizing a known war criminal. The absolute state of this sub…",
            "title_similarity": "0.61457855",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hv76a52",
            "score": -2,
            "text": "Bush is the real criminal. I can't believe people are celebrating him today",
            "title_similarity": "0.46755534",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv77a98",
            "score": -2,
            "text": "I’ll be damned, Republicans turned Republicans into Nazis and Democrats into Republicans and liberals into Democrats, Leftists are still Leftists but they’re just upset Leftists especially these days",
            "title_similarity": "0.5809818",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hv77f6u",
            "score": -2,
            "text": "The Liberal urge to rehabilitate George W Bush’s image",
            "title_similarity": "0.65837085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv77w28",
            "score": -2,
            "text": "Meanwhile… we’re all dandy with Bush jr and sr now?",
            "title_similarity": "0.40870437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv78op8",
            "score": -2,
            "text": "The bushes lost my\nRespect",
            "title_similarity": "0.17118125",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hv78sh8",
            "score": 2,
            "text": "I hate GWB for the war criminal he is. How can he be looking more sane than 90% of his old party?",
            "title_similarity": "0.51991224",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hv79uv0",
            "score": 2,
            "text": "These late life jabs do not elevate him beyond his deserved legacy of second-worst president in US history.",
            "title_similarity": "0.42688727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7btjg",
            "score": 2,
            "text": "I never thought I’d see the day when ol Bush was the good guy.",
            "title_similarity": "0.25267172",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv7d1p1",
            "score": 2,
            "text": "W is doing the right thing.",
            "title_similarity": "0.057427905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7fden",
            "score": 2,
            "text": "After the Cheeto man we find ourselves missing the old plain lays potato chip….crazy to think back to how much shit he got as president",
            "title_similarity": "0.52382267",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hv7gp5t",
            "score": -2,
            "text": "No buddy ever question why all the politicians didn't like him! That's the saddest thing of all...He was a bit of a shit head but everyone was just trying to get rid of him!! No ever ask why or look at the other side of thing.....this country was great! it was awesome! Now we sold our souls to the people in the white house and to China!.... The truth will come out just like it did with Hollywood!! It's a very very very dark game and we are just pawns/peasants they play with!! Remember we are at the bottom looking up!! No matter how rich you are there pawns!!...... You would have a better chance of getting a camel through eye of a needle then get a politician in heaven!",
            "title_similarity": "0.550598",
            "sentiment_compound": 0.9856
        },
        {
            "id": "hv7i9br",
            "score": -2,
            "text": "Rhinos are gonna rino....",
            "title_similarity": "0.32679284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7jcq8",
            "score": 2,
            "text": "2024 elections will be crazy.",
            "title_similarity": "0.37612572",
            "sentiment_compound": -0.34
        },
        {
            "id": "hv7m3qv",
            "score": 2,
            "text": "Go W.",
            "title_similarity": "0.08569122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7shpw",
            "score": 2,
            "text": "Bush and cheney are scum. Did we forget the million iraqi dead? Blows my mind people think trump was worse.",
            "title_similarity": "0.6775757",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hv82jmr",
            "score": -2,
            "text": "Bush is still worse than Trump",
            "title_similarity": "0.33809334",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv85oeb",
            "score": 2,
            "text": "It's crazy how far the party has moved to the right that GWB is one of the sane ones.",
            "title_similarity": "0.35866916",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv5wlqs",
            "score": 20,
            "text": "Trump not being in this group isn't the selling point you think it is.",
            "title_similarity": "0.32559133",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6egcv",
            "score": 20,
            "text": "Reminder: Bush outright stole the 2000 election and his father and grandfather have been paving the way for an authoritarianship for many decades. The Bush and Cheney families simply are upset that Trump outplayed them via Russia's assistance at the last second.",
            "title_similarity": "0.6845292",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv5n0ws",
            "score": 2904,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv76a5w",
            "score": 13,
            "text": "Imagine leaving office thinking, nay, knowing that you're going to be remembered and the worst, stupidest president in history. Then a few years later someone comes along and makes you look like a goddamn hero in comparison. \nWhen I was 18, I thought he was the biggest pile of human garbage. In retrospect, he wasn't that bad.",
            "title_similarity": "0.58451486",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hv5z6lk",
            "score": 4,
            "text": "Bush there are nuclear weapons in Iraq Bush? That Bush?",
            "title_similarity": "0.5278982",
            "sentiment_compound": -0.504
        },
        {
            "id": "hv6487g",
            "score": 3,
            "text": "Look at that dumbass with his fucking nose uncovered.\n\nDubya started the war of terror in the Middle East.\n\nThen he fucking stood on the deck of an aircraft carrier with a huge “mission accomplished” banner when they found Saddam Hussein or something.\n\nFor what’s it worth, the real goal (to kill osama bin laden) didn’t happen till Obama. Whoa whoa, Obama, Osama something fishy goin on. Oh my god, and they “dumped his body in the ocean”… with the fishes! Fuckin fishy",
            "title_similarity": "0.5371778",
            "sentiment_compound": -0.9117
        },
        {
            "id": "hv688b3",
            "score": 2,
            "text": "As a Lithuanian i love George W. Bush he made it happen for my country to get accepted in to NATO. Seeing all that shit happening in Ukraine right now, dude probably saved my life quite literally.",
            "title_similarity": "0.50681114",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hv6gae5",
            "score": 3,
            "text": "Oh thank god a war criminal paid a super pact to lover for politcians. I am soooo happy that this is the system we have. Thank you elites for allowing us commoners to read this inspiring story.",
            "title_similarity": "0.5581442",
            "sentiment_compound": 0.9253
        },
        {
            "id": "hv6glm2",
            "score": -4,
            "text": "Lol good waste of money haha MAGA",
            "title_similarity": "0.24942772",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hv6h3xp",
            "score": -3,
            "text": "Most people are ready to move on and have been for a year. Trump is gone, but he may run again. Until that happens can we fucking focus on anything else?",
            "title_similarity": "0.4227795",
            "sentiment_compound": 0.222
        },
        {
            "id": "hv6he5m",
            "score": 4,
            "text": "He could only wish that money would absolve him from his sins. \n\nHe's a war criminal that just paints pictures of dogs now.",
            "title_similarity": "0.46223742",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hv6hqpe",
            "score": -2,
            "text": "Still mad Trump stole Jen’s chance at being President. Hahaha",
            "title_similarity": "0.6517718",
            "sentiment_compound": 0.34
        },
        {
            "id": "hv6hqzp",
            "score": -3,
            "text": "Dont care.  \n\nDont care about bush. \n\nDont care what he does.",
            "title_similarity": "0.17406091",
            "sentiment_compound": -0.468
        },
        {
            "id": "hv6i9mc",
            "score": -3,
            "text": "This sub is so cringe",
            "title_similarity": "0.10582363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6ig7b",
            "score": 3,
            "text": "The rehabilitation of George W. Bush is one of the worst things to come about as a result of the Trump presidency.\n\nThis guy is responsible for starting an illegal war that killed hundreds of thousands of Iraqis, started us down the road of the surveillance state with the Patriot Act, and the open-ended NDAA that was passed after 9/11 was used to make war for the past twenty years.\n\nHe opened the door to the lawless insanity of the Trump years and committed trillions of dollars to making war instead of ensuring that we had good infrastructure and affordable healthcare. Never forget that.",
            "title_similarity": "0.67599785",
            "sentiment_compound": -0.9663
        },
        {
            "id": "hv6jg8n",
            "score": 3,
            "text": "Bush supports a broken party in a broken system.\n\nGot it.",
            "title_similarity": "0.5212146",
            "sentiment_compound": -0.25
        },
        {
            "id": "hv6l6va",
            "score": 3,
            "text": "Don't let anyone forget that Bush tried to destroy our civil liberties, started two military conflicts, and has done godawful shit outright. He wasn't as bad as Trump, but he switched our society around in an immeasurably fucked up way. Don't let that \"I'm a cowboy granpa!\" image bullshit that he's tried to cultivate with the help of Michelle Obama fool you.\n\nWith that said, fuck Trump.",
            "title_similarity": "0.6752926",
            "sentiment_compound": -0.9665
        },
        {
            "id": "hv6lpyo",
            "score": -1,
            "text": "Bush is pretty objectively worse than trump",
            "title_similarity": "0.35893",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hv6o0bq",
            "score": 2,
            "text": "Jesus Christ, can we stop picking the fly shit out of the pepper of the GOP? Also, can we fucking stop rewriting George Bush's legacy. This article headline should be \n>\"Giant asshole donates to the assholes who are opposed to the Super asshole\" \n\nIts assholes all the way down folks. Stop welcoming psychos into our tent just because they also dislike Trump.",
            "title_similarity": "0.64738715",
            "sentiment_compound": -0.9168
        },
        {
            "id": "hv6sp4r",
            "score": -2,
            "text": "Let’s go Brandon I agree! - Joe Biden",
            "title_similarity": "0.33503988",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hv6u6or",
            "score": 3,
            "text": "Aw poor baby George W not happy trump didn't start enough wars like him and Obama did?",
            "title_similarity": "0.58607256",
            "sentiment_compound": -0.1714
        },
        {
            "id": "hv6y6j1",
            "score": 4,
            "text": "For all the hate W got he was a decent person",
            "title_similarity": "0.1726065",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hv703ei",
            "score": 3,
            "text": "Still should be on trial for war crimes.",
            "title_similarity": "0.43564808",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv70nko",
            "score": 3,
            "text": "I may not like Bush at all but good on him for standing up to that orange POS.",
            "title_similarity": "0.2767367",
            "sentiment_compound": 0.5098
        },
        {
            "id": "hv72lm6",
            "score": 3,
            "text": "How far the GOP has fallen when Dubya is one of the most reasonable people in the party today.",
            "title_similarity": "0.40056446",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hv7cxib",
            "score": 4,
            "text": "\nEven he recognizes the dumbassery and tomfoolery. When someone understands that our democracy is at stake, and aren’t cowards, they deserve support.",
            "title_similarity": "0.438147",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv7ev25",
            "score": 2,
            "text": "Trump broke the brain-trust of the conservative party. They were always *kind of shitty*, but they had - at the very least - a moral fucking compass that made some sort of sense.\n\nIt's literally now just \"pwn the lib, trigger the lib.\"",
            "title_similarity": "0.67865896",
            "sentiment_compound": -0.3604
        },
        {
            "id": "hv7lbf3",
            "score": 3,
            "text": "Trump lost to Hillary by 3 million votes in 16. He got crushed by Biden by 8 million votes in 20. If you think that loser's ego will allow him to run in 24 you are sadly mistaken. He will manufacture an excuse to not run.",
            "title_similarity": "0.631028",
            "sentiment_compound": -0.802
        },
        {
            "id": "hv7qh67",
            "score": 3,
            "text": "Before people start thinking that George W Bush is a good guy, always remember that the incompetence, negligence, and corruption of the Bush administration led to the avoidable deaths of over 10,000 Americans (and countless foreign nationals), and the worst economic downturn since the Great Depression. That's his true legacy, and that isn't mitigated just because he happens to be on the correct side of the most treasonous criminal president in American history.",
            "title_similarity": "0.5870818",
            "sentiment_compound": -0.8742
        },
        {
            "id": "hv7x90x",
            "score": -3,
            "text": "I wasn’t a big fan of Trump when he was running for president, but after he was elected I really learned to respect him. He may be a spoiled rich boy, but he looked out for American interests and dramatically improved our economy. The media didn’t like him and they kept making shit up to try to remove him. \n\nThey couldn’t prove he’s a racist because he’s not, but most people will believe anything if you keep repeating it. \n\nThey couldn’t prove he colluded with Russia because he didn’t, but the most people will believe anything if you keep repeating it. \n\nI didn’t vote for him then, but I will if he runs again because he proved with his actions that he’s on our side and he will look out for our interests no matter how much he’s smeared by the media.",
            "title_similarity": "0.592016",
            "sentiment_compound": 0.8997
        },
        {
            "id": "hv5zp3j",
            "score": 733,
            "text": "Remember back when we all thought he was the worst president ever just because he started a war based on lies about WMDs?",
            "title_similarity": "0.5718109",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hv6i0rw",
            "score": 4,
            "text": "War criminal supports other war criminals. Great story",
            "title_similarity": "0.54406714",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hv70fx1",
            "score": 3,
            "text": "The enemy of my enemy is my friend.",
            "title_similarity": "0.4197869",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hv6hisg",
            "score": 16,
            "text": "W is a war criminal",
            "title_similarity": "0.45627373",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv5vsgp",
            "score": 6,
            "text": "Neolibs and Neocons are big believers in doing anything to keep their base (in the US, that's white people in red and swing states) from getting antsy. To them, any threat to the status quo in that demographic is a fundamental threat to their world order, which is based on stability through economic dominance of a few. The Radical Right THRIVE on stirring up that demographic. It's really their only strategy and sometimes even their only goal. The Neos are horrified by this, it threatens everything they believe in and have spent their lives working for.",
            "title_similarity": "0.5371616",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hv63d9p",
            "score": 5,
            "text": "Bush, who had Dick Chaney in the White House and put Alito on the court is now donating money to counter the far right? This shows you how far right the GOP has gone.",
            "title_similarity": "0.81868285",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hv6ncoq",
            "score": 3,
            "text": "Stop trying to rehabilitate George W Bush! He's a bad person always has been always will be.",
            "title_similarity": "0.4353253",
            "sentiment_compound": -0.7177
        },
        {
            "id": "hv62s6o",
            "score": 5,
            "text": "The number of people who are here supporting a literal war criminal because he doesn’t like trump is unsurprising",
            "title_similarity": "0.547945",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv6vdd4",
            "score": 5,
            "text": "TFW even a war criminal wants to keep you gone...",
            "title_similarity": "0.4712792",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv703b9",
            "score": 6,
            "text": "Try all you want you can’t whitewash this scumbag, his scumbag family or his scumbag administration. Not liking Trump doesn’t make up for the MILLIONS of people slaughtered in the Persian Gulf since 9/11. in a just world he would be  ~~tried~~  found guilty for war crimes",
            "title_similarity": "0.6523927",
            "sentiment_compound": -0.9718
        },
        {
            "id": "hv66uel",
            "score": 8,
            "text": "George Bush does not get a redemption arc.",
            "title_similarity": "0.29950285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6tarl",
            "score": 7,
            "text": "Fuck that man, seriously. I’m starting to hate the GOP more and more.",
            "title_similarity": "0.2731751",
            "sentiment_compound": -0.836
        },
        {
            "id": "hv6hxp1",
            "score": 8,
            "text": "What a bizzaro world we do live in where George W. Bush and Liz Cheney are the good guys suddenly.\n\nNever forget - it's all just relative. They are still awful people, it's just that even more awful people have emerged from the depths of the swamp.",
            "title_similarity": "0.4612078",
            "sentiment_compound": -0.4073
        },
        {
            "id": "hv78cdh",
            "score": 8,
            "text": "My favorite puppet, you all calling him a war criminal are giving him too much credit and not enough to Cheney",
            "title_similarity": "0.548755",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hv5oh4r",
            "score": 5549,
            "text": "I like to think I am fairly smart, but as a teenager I sure was an idiot, because I thought it couldn't possibly get worse than under W.",
            "title_similarity": "0.3183341",
            "sentiment_compound": 0.5316
        },
        {
            "id": "hv5pjgb",
            "score": 2929,
            "text": "Let's not forget that every single elected GOP official that supported Impeachment is now obstructing the country from making any progress, which will lead to Trump being reelected in 3 years.  One or two republican senators working with the democrats would break the log jam and move this country along, but that's not what they're interested in.\n\nThey do not care.",
            "title_similarity": "0.65369236",
            "sentiment_compound": -0.534
        },
        {
            "id": "hv5ot0b",
            "score": 13552,
            "text": "Because that’s what someone does when you insult their family….*looks over at Ted Cruz*",
            "title_similarity": "0.6091236",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hv6354f",
            "score": 1,
            "text": "Constantine.",
            "title_similarity": "0.17712341",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6flmz",
            "score": 2,
            "text": "Who fucking cares",
            "title_similarity": "0.06344583",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hv6hnp5",
            "score": 21,
            "text": "George W out here pretending he hasn’t been a part of the problem for the last 40 years.",
            "title_similarity": "0.38378832",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hv6i6oi",
            "score": 2,
            "text": "i've seen some shit. but i've never seen some \"reddit boasting about George W Bush\" shit.",
            "title_similarity": "0.4576072",
            "sentiment_compound": -0.802
        },
        {
            "id": "hv6i7hg",
            "score": 1,
            "text": "Please don’t tell me we’re gonna see some George Bush rehabilitation arc from the media. Dude is a monster and should be in prison",
            "title_similarity": "0.6015662",
            "sentiment_compound": -0.25
        },
        {
            "id": "hv6i7nr",
            "score": 1,
            "text": "Wow, I haven't heard the term \"maxes out political donations\" in eons. I guess the days of SuperPACs really have changed everything.",
            "title_similarity": "0.48919886",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hv6id4m",
            "score": 2,
            "text": "No surprises here. His mother stumped for Hilary with her walker. The Clintons were frequently seen at the elder Bushes home. We were had. Those who reported this stuff were replaced with socialist talking heads.",
            "title_similarity": "0.49005616",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hv6ih0b",
            "score": 2,
            "text": "Good.",
            "title_similarity": "-0.046025135",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6im8v",
            "score": 1,
            "text": "Not Collins?  Hmm...",
            "title_similarity": "0.058921084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6is9z",
            "score": 1,
            "text": "W was a fool but can’t say he was a traitorous fool unlike trump.",
            "title_similarity": "0.431925",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hv6iygx",
            "score": 1,
            "text": "Who cares. His administration and their relationship with Fox News is what really worked to create the environment that Trump took advantage of. Now they are angry that they can’t control all the loonies they created.",
            "title_similarity": "0.6292865",
            "sentiment_compound": 0.6204
        },
        {
            "id": "hv6iyio",
            "score": 1,
            "text": "Makes me wonder if nixon, ronnie, gwb, had been held accountable and served some time, trump would be so brazen to pull this bs.",
            "title_similarity": "0.6205847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6izy9",
            "score": 1,
            "text": "The least popular republican vs the most popular republican I wonder who would win this fight",
            "title_similarity": "0.45881668",
            "sentiment_compound": 0.3738
        },
        {
            "id": "hv6j0wv",
            "score": 1,
            "text": "Hey good for you, child killer george!\n\nYou found someone *objectively* worse, but who exploded fewer children",
            "title_similarity": "0.4404723",
            "sentiment_compound": -0.4664
        },
        {
            "id": "hv6j1a4",
            "score": 1,
            "text": "Get. Off. Your. Lazy. Ass. And. Say. Something.",
            "title_similarity": "0.12985282",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hv6j663",
            "score": 1,
            "text": "If anyone cheers on GWB...jesus.",
            "title_similarity": "0.2615714",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hv6j735",
            "score": 1,
            "text": "I miss the good ole' days where the US president being an idiot was funny.",
            "title_similarity": "0.44945538",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hv6jf42",
            "score": 3,
            "text": "Swamp creatures support other swamp creatures, more at 10:00.",
            "title_similarity": "0.19599959",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv6jjq9",
            "score": 1,
            "text": "I love you, Grandpa George",
            "title_similarity": "0.22541627",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6jo14",
            "score": 1,
            "text": "wow i love bushes clintons and cheneys now",
            "title_similarity": "0.25265086",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hv6jvdb",
            "score": 2,
            "text": "I never thought I would ever think of Bush as a smart person....",
            "title_similarity": "0.24100238",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv6jwg2",
            "score": 2,
            "text": "When the President you thought was the worst is going after the President who is actually the worst",
            "title_similarity": "0.56520975",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hv6k3t8",
            "score": 4,
            "text": "If I was them I wouldn't take money from a war criminal.",
            "title_similarity": "0.40002006",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6k7eo",
            "score": 1,
            "text": "Dang",
            "title_similarity": "0.0025101267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6kg9o",
            "score": 1,
            "text": "no matter what he does the stain on his name will never go away",
            "title_similarity": "0.2217927",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hv6kjul",
            "score": 1,
            "text": "> George W. Bush maxes out political donations to Trump impeachment supporters Liz Cheney and Lisa Murkowski\n\nThis should not be a surprise to anyone.",
            "title_similarity": "0.8948225",
            "sentiment_compound": 0.27
        },
        {
            "id": "hv6kzoo",
            "score": 1,
            "text": "Still trying to atone for his war crimes",
            "title_similarity": "0.40753508",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv6kzp5",
            "score": 1,
            "text": "Selecting a picture of him wearing a mask wrong is really the way to go here. Potentially well intentioned, but ultimately dangerously incompetent.",
            "title_similarity": "0.31736147",
            "sentiment_compound": -0.8641
        },
        {
            "id": "hv6l5po",
            "score": 1,
            "text": "Establishment gonna establish.",
            "title_similarity": "0.07143442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6l78s",
            "score": 1,
            "text": "He’ll also paint their likenesses for his new painting collection about political casualties. /s",
            "title_similarity": "0.4911257",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6l8oz",
            "score": 1,
            "text": "Weird the Cheney’s still run the bush …",
            "title_similarity": "0.38759804",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hv6lasm",
            "score": 1,
            "text": "How long until he's called a commie on OANN or whatever is the MAGA propaganda machine now",
            "title_similarity": "0.4172593",
            "sentiment_compound": -0.25
        },
        {
            "id": "hv6lbf6",
            "score": 1,
            "text": "When a war criminal doesn't like Cheeto Jesus either.",
            "title_similarity": "0.42452118",
            "sentiment_compound": -0.8559
        },
        {
            "id": "hv6ld6f",
            "score": 1,
            "text": "War criminal acts out against guy we hate...",
            "title_similarity": "0.5084034",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hv6lfmz",
            "score": 2,
            "text": "It’s ridiculous to think republicans have the ability to shake the trump stain, their future is fascism and living outside of reality.",
            "title_similarity": "0.5641112",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hv6lfqy",
            "score": 1,
            "text": "International War Criminal George W Bush*",
            "title_similarity": "0.6432553",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6lwb2",
            "score": 2,
            "text": "still a war criminal who was illegitimately handed the presidency",
            "title_similarity": "0.60909605",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6m1ug",
            "score": 1,
            "text": "A ‘come to Jesus’ moment?",
            "title_similarity": "0.2921486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6m2uk",
            "score": 1,
            "text": "I’m torn on this one. George W. Bush should be in jail",
            "title_similarity": "0.48122075",
            "sentiment_compound": -0.25
        },
        {
            "id": "hv6m9s2",
            "score": 1,
            "text": "There is no way this man shouldn’t be in prison I hate that he’s being painted as some sort of good guy. This is a war criminal and he will always be a war criminal who played one of the largest roles in destroying the US.",
            "title_similarity": "0.4638087",
            "sentiment_compound": -0.9732
        },
        {
            "id": "hv6md8n",
            "score": 1,
            "text": "Despite his faults, he will be the last REPUBLICAN President.",
            "title_similarity": "0.41079906",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hv6mj8s",
            "score": 1,
            "text": "If he really believed in them, he'd start a PAC and we would never know.",
            "title_similarity": "0.37983626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6mjhv",
            "score": 1,
            "text": "He’s always had a good person vibe. Pineapple Express George is the one we want!!!",
            "title_similarity": "0.22751275",
            "sentiment_compound": 0.6219
        },
        {
            "id": "hv6mkmy",
            "score": 1,
            "text": "Cool, whatever. \n\nGeorge W. Bush committed hundreds of war crimes and should be rotting in prison right now.  He deliberately mislead the USA into a war of aggression and killed more than 5000 Americans, tens or maybe hundreds of thousands of Iraqis, and hundreds of thousands more in the resulting chaos that lead to the rise of ISIS.  He approved of the use of torture.  He's a fucking monster this kind of bullshit trying to clean up his image is toxic.",
            "title_similarity": "0.58948874",
            "sentiment_compound": -0.9705
        },
        {
            "id": "hv6mmou",
            "score": 1,
            "text": "Good for him for standing up. At the same time, Jesus Christ George, you done more than anyone to pave the way for Trump.",
            "title_similarity": "0.4603321",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6moug",
            "score": 1,
            "text": "Love it",
            "title_similarity": "0.013563791",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6mqvg",
            "score": 1,
            "text": "War criminals donate to war criminals? Meh",
            "title_similarity": "0.6519904",
            "sentiment_compound": -0.9477
        },
        {
            "id": "hv6mt6v",
            "score": 1,
            "text": "Bush was worse than Trump.",
            "title_similarity": "0.39695513",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv6mtis",
            "score": 1,
            "text": "What I don't understand is that why a person regardless of what they have done in their own life all of sudden becomes a saint as soon as he or she says something against Trump. It seems like the bath that washes away everything. This guy started an unjustified war which killed thousands knowing it was unjustified. But he is the guy we need to listen to because he hates Trump. Where do we draw the line ? Not trying to be pro or against here. Just asking a question.",
            "title_similarity": "0.58388716",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6mud8",
            "score": 1,
            "text": "Neoliberal Uniparty Unite!",
            "title_similarity": "0.33403978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6mumb",
            "score": 1,
            "text": "Uh, you guys remember we hate him... right?",
            "title_similarity": "0.25105238",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hv6muvr",
            "score": 1,
            "text": "This is nice but alas if only he hadn't worked so hard set us down this path to begin with.",
            "title_similarity": "0.32012743",
            "sentiment_compound": -0.4677
        },
        {
            "id": "hv6mwyy",
            "score": 2,
            "text": "The Bush’s are elitist that have raped this country.",
            "title_similarity": "0.4932418",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hv6mx6n",
            "score": 1,
            "text": "Who gives a shit. Fuck him.",
            "title_similarity": "0.18754622",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hv6mxi0",
            "score": 1,
            "text": "Damn he’s really putting the W in George W. Bush",
            "title_similarity": "0.5247165",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hv6mxr6",
            "score": 1,
            "text": "Always a war-mongering neocon",
            "title_similarity": "0.358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6mysc",
            "score": 1,
            "text": "You a ray of sunshine in the darkness :)",
            "title_similarity": "0.10530256",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6myvl",
            "score": 1,
            "text": "Well there goes the summer invasion funds.",
            "title_similarity": "0.32084537",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv6mz5m",
            "score": 3,
            "text": "While I appreciate the optics of this particularly for the fact that Trump will be pissed, no one should be praising Bush for donating 0.007% and 0.014% of his net worth to Congressional candidates. That'd be like most of us donating $1-$10 (remember, PACs exist primarily to get around the legal donation cap).\n\nThis is a token donation at best from someone who is actually in a position to stand up for democracy. I'd take an old-fashioned Bush word salad right about now over this token donation.",
            "title_similarity": "0.6854907",
            "sentiment_compound": 0.836
        },
        {
            "id": "hv6n5a2",
            "score": 2,
            "text": "Republican civil war. Gotta love seeing the destruction within.",
            "title_similarity": "0.5050186",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hv6n76i",
            "score": 2,
            "text": "That's a nice individual gesture AND they are all still garbage people that individually contributed to breaking our society.",
            "title_similarity": "0.4071144",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv6n9gs",
            "score": 1,
            "text": "How wrong has the world gone that Georgie is a moderate.",
            "title_similarity": "0.30026925",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv6ndjs",
            "score": 1,
            "text": "I suspect George W Bush has a lot of regrets. His nephew, Jeb's son - George P Bush - is part of the new wave MAGA group here in Texas.",
            "title_similarity": "0.56509537",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hv6nkxy",
            "score": 1,
            "text": "Rich from a war criminal",
            "title_similarity": "0.5160401",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hv6nooo",
            "score": 1,
            "text": "How is this not a major red flag to republicans? And how they should be more worried about Trump?",
            "title_similarity": "0.5984975",
            "sentiment_compound": -0.4316
        },
        {
            "id": "hv6nqoo",
            "score": 2,
            "text": "so an unconvicted war criminal and profiteer gave money to someone.   am i supposed to forget his war crimes, lies and propaganda?   bc i wont.   fuck him and fuck cheney...and fuck us all bc we let them do it after 9/11.",
            "title_similarity": "0.6657462",
            "sentiment_compound": -0.9662
        },
        {
            "id": "hv6nqy1",
            "score": 1,
            "text": "Lol, looking good bosss...",
            "title_similarity": "0.2022287",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hv6ns6e",
            "score": 1,
            "text": "Guess an old-school republican has an ounce of integrity after all",
            "title_similarity": "0.30485883",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hv6nv0h",
            "score": 1,
            "text": "Almost makes me forget he’s a war criminal",
            "title_similarity": "0.44786236",
            "sentiment_compound": -0.8375
        },
        {
            "id": "hv6o57g",
            "score": 1,
            "text": "Unironically this is why Trump won.",
            "title_similarity": "0.4804277",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hv6ow6o",
            "score": 1,
            "text": "Dick Cheney:  \"You're gonna put some money behind my daughter's next campaign...right, Junior?\"  \\**racks a round into a Mossberg 835*\\*\n\nDubya: \"*mumblemumblewheresthevodka*\"\n\nCheney:  \"What are you so nervous about, man?  Oh, this?  It's pheasant-hunting season...\"",
            "title_similarity": "0.6581869",
            "sentiment_compound": -0.7637
        },
        {
            "id": "hv6p2c7",
            "score": 6,
            "text": "Same Bush who fucked the whole country up and now draws cats? Yeah fuck off.",
            "title_similarity": "0.43697488",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hv6pa1l",
            "score": 1,
            "text": "Of course why would an political establishment family (ie Clinton’s, Kennedys, Bush’s) ever support an outsider to their authoritarian aristocratic circle.",
            "title_similarity": "0.6709957",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv6ph5x",
            "score": 1,
            "text": "How does Cruz go home every night to his wife ... How...",
            "title_similarity": "0.39035594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6po0m",
            "score": 2,
            "text": "Because that's how it works. War criminals pardon war criminals until its just spider man meme...",
            "title_similarity": "0.61161864",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hv6ps4s",
            "score": 1,
            "text": "Americans not celebrating war criminal challenge (Impossible!)",
            "title_similarity": "0.45591724",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hv6puxp",
            "score": 2,
            "text": "The way he is wearing that mask is so George W",
            "title_similarity": "0.38968238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6q3ga",
            "score": 2,
            "text": "If they had any integrity, they'd refund his donations.",
            "title_similarity": "0.42372954",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hv6q9ym",
            "score": 2,
            "text": "Let not forget Bush was the devil for many years.His families pockets run deep with corruption and oil . There’s usually a underlying issue, usually money, bush has no conscious.His donations are just a political stunt.He became angry when Jeb looked like a nube during 2016 presidential run.Sorry George the country’s not going to make another bush president.JEB , really like from the Beverley hillbillies JEB .They kinda look 👀 alike.As far as George and his donations, if we will take his money 💰",
            "title_similarity": "0.7040185",
            "sentiment_compound": -0.6048
        },
        {
            "id": "hv6qa7e",
            "score": 1,
            "text": "Funny thing is unlimited campaign money is what got us in to this 2 party oligarch funded system that only promotes fossilized corporate candidates or fringe extreme young crazies. \n\nFuck George W Bush",
            "title_similarity": "0.6877074",
            "sentiment_compound": 0.5
        },
        {
            "id": "hv6qfvd",
            "score": 1,
            "text": "“George W. Bush maxes out political donations to lovers of flower, Liz Cheney and Lisa Murkowski.”",
            "title_similarity": "0.7755759",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hv6qi7r",
            "score": 3,
            "text": "Trump DIRECTLY stands on Bush’s shoulders. He paved the way for this shitshow.",
            "title_similarity": "0.5322672",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6qkej",
            "score": 1,
            "text": "It’s because it’s family",
            "title_similarity": "0.16213816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6r0fz",
            "score": 1,
            "text": "Can someone help poor George with his mask though? It looks like he swiped it from a child right before this photo was taken.",
            "title_similarity": "0.4680202",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv6r0ih",
            "score": 1,
            "text": "Lol two people out of a sea of zombies wishing for the return of cheeto musclini. The republican party is lost, except for a handful they are all bought and paid for by \"outside\" interest. Our nation's prosperity isn't ever their goal just maintaining total control without resistance, it is why they call America an experiment. Democracy is an old idea yet the USA is going to tinker with it till rich people get everything they want again under the guise of fairness it is all a rouse or con my friends, the whole thing, always was.",
            "title_similarity": "0.6127144",
            "sentiment_compound": 0.9337
        },
        {
            "id": "hv6r53s",
            "score": 1,
            "text": "That's cool, dumbass war criminal who should be in a cell for the rest of his life.",
            "title_similarity": "0.39768162",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hv6r73d",
            "score": 2,
            "text": "Tell him to pull his mask up and fuck off.\n\nI remember what he did. He is not one of the good guys.",
            "title_similarity": "0.3780368",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hv6rfqs",
            "score": 2,
            "text": "Funny how so many former R's are not Trump supporters",
            "title_similarity": "0.40747368",
            "sentiment_compound": 0.1265
        },
        {
            "id": "hv6rpwl",
            "score": 1,
            "text": "Good on ya, George.",
            "title_similarity": "0.15383765",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6rra4",
            "score": 1,
            "text": "Bravo Mr. Bush .",
            "title_similarity": "0.20872407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6sduc",
            "score": 1,
            "text": "Speaks volumes without saying a word.",
            "title_similarity": "0.07045852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6sivi",
            "score": 1,
            "text": "While it’s nice to hear there is some wind in an alternative sail of the Republican Party, I don’t care for this dynasty bullsh*t. Can we please get support for a qualified person with new ideas and not just the next in line (or shares a last name with previously elected so-and-so)?",
            "title_similarity": "0.6181035",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hv6snvl",
            "score": 1,
            "text": "Warms my heart!",
            "title_similarity": "0.08660996",
            "sentiment_compound": 0.7644
        },
        {
            "id": "hv6snwh",
            "score": 1,
            "text": "Condi Rice said you would not recognize the Middle East anymore, and this is basically true, for Iraq and Syria, which hardly exist given the number of foreign forces range freely throughout each of them.\n\nIs there still a Russian base in Syria?  An American one?",
            "title_similarity": "0.5662886",
            "sentiment_compound": 0.7476
        },
        {
            "id": "hv6stng",
            "score": 1,
            "text": "Hooray?",
            "title_similarity": "0.07414438",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hv6sydt",
            "score": 7,
            "text": "When George W. Bush is trying to be the good guy, reality is getting scary.",
            "title_similarity": "0.44681177",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hv6tal9",
            "score": 1,
            "text": "Man I guess he wasn’t that bad…but damn he didn’t seem that great",
            "title_similarity": "0.052469406",
            "sentiment_compound": 0.34
        },
        {
            "id": "hv6tbtq",
            "score": 1,
            "text": "so now we love the man who started two wars?",
            "title_similarity": "0.42926362",
            "sentiment_compound": 0.2177
        },
        {
            "id": "hv6tnxt",
            "score": 1,
            "text": "Good for him, he's still a piece of shit who should be in prison.",
            "title_similarity": "0.32266623",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hv6ts86",
            "score": 1,
            "text": "Nothing is more damning for the Republican Party than how the Bushes and Cheneys have become the voices of reason. A kakistocracy is a government run by the worst/least qualified people- seems to be the goal of the Republican Party these days.",
            "title_similarity": "0.670875",
            "sentiment_compound": 0.7686
        },
        {
            "id": "hv6ttcu",
            "score": 1,
            "text": "While browsing the title cut off at “George W. Bush maxes out political donations to Trump...” and I was VERY confused",
            "title_similarity": "0.8085587",
            "sentiment_compound": -0.6626
        },
        {
            "id": "hv6txtr",
            "score": 1,
            "text": "He’s now at notch: 2",
            "title_similarity": "0.09281393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6tyhy",
            "score": 1,
            "text": "War Mongering RINOs",
            "title_similarity": "0.42031908",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hv6u04r",
            "score": 1,
            "text": "Right wing politician scared that slightly farther right politician will accidentally burn down the system that keeps right wing politician and his friends wealthy and in power",
            "title_similarity": "0.65420663",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv6u30n",
            "score": 3,
            "text": "The headline makes it sound like Bush is somehow against Conservative and GOP policies he supported, created, and enhanced.\n\nThis whole shit-circus can burn. It is so infuriating.",
            "title_similarity": "0.60702866",
            "sentiment_compound": 0.1113
        },
        {
            "id": "hv6u8hl",
            "score": 4,
            "text": "Since when do we like bush? I mean cmon people… use your fucking brains if you have any left…",
            "title_similarity": "0.4709381",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv6uciw",
            "score": 1,
            "text": "old people are incapable of wearing their mask correctly",
            "title_similarity": "0.095927775",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv6udmv",
            "score": 1,
            "text": "Always knew Bush was a RINO",
            "title_similarity": "0.12794915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6upas",
            "score": 5,
            "text": "Fuck all three of them. This is what you wanted GOP. This is what you got.",
            "title_similarity": "0.32005256",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv6uqwz",
            "score": 1,
            "text": "The guy who found wmds in Iraq, killed Osama bin laden and never tortured anyone? Awesome.",
            "title_similarity": "0.5042124",
            "sentiment_compound": -0.7068
        },
        {
            "id": "hv6urif",
            "score": 2,
            "text": "War criminal donates to fellow war criminals daughter’s campaign. \n\n\nFixed the headline.",
            "title_similarity": "0.74166715",
            "sentiment_compound": -0.9423
        },
        {
            "id": "hv6us2s",
            "score": 1,
            "text": "Remember the good old days when George Bish was the penny Cove evil in the Republican Party?",
            "title_similarity": "0.66314036",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hv6uwwf",
            "score": 1,
            "text": "I don't know if this is a controversial take here but Bush was undeniably worse than Trump. They're both evil but Bush and his Clique were competent and evil, Trump was just a blustering idiot by comparison. The Bush administration was basically just weapons manufacturers and military contractors directly running the US government. They started two massive wars, killed a million Iraqis, stole their oil, created ISIS, and installed a global torture regime and completely limitless spying on their own citizens while blowing up the deficit like no-one before. Trump was extremely bad as well but I'm really sick of this narrative that, after all, Bush looks good in comparison, and somehow we're supposed to accept his rehabilitation now.\n\nBush and his cronies are arguably the worst war criminals of the 21st century so far and in a just world they should all be rotting in jail right now. The fact that they never faced any consequences for what they did doesn't mean they shouldn't have.",
            "title_similarity": "0.64150953",
            "sentiment_compound": -0.9964
        },
        {
            "id": "hv6uy5x",
            "score": 1,
            "text": "The painter?!?!!?",
            "title_similarity": "0.15323702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6v6hx",
            "score": 1,
            "text": "George Bush donates to Dick Cheney’s daughter? This is breaking news",
            "title_similarity": "0.73931485",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hv6vbep",
            "score": 1,
            "text": "Trump wasn't not evil than W, he was just less subtle about it, and less competent",
            "title_similarity": "0.21327108",
            "sentiment_compound": -0.2155
        },
        {
            "id": "hv6vev5",
            "score": 2,
            "text": "My question is, when does Trump fake his own assassination to spur regional anarchy? /s",
            "title_similarity": "0.64085746",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hv6vf07",
            "score": 1,
            "text": "Should of left Iraq alone.",
            "title_similarity": "0.25521603",
            "sentiment_compound": -0.25
        },
        {
            "id": "hv6vjat",
            "score": 1,
            "text": "Remember how much George W. Bush still sucks shit?",
            "title_similarity": "0.3971547",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hv6vpgx",
            "score": 1,
            "text": "Still a war criminal.",
            "title_similarity": "0.32758182",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6vuhb",
            "score": 1,
            "text": "He’s still a war criminal.",
            "title_similarity": "0.3666101",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv6vxiy",
            "score": 3,
            "text": "I can't believe how scared these people are of trump that they won't speak out.\n\nSure, fund them all you want, but without speaking out against trump then they're allowing all of the insane corruption to continue.",
            "title_similarity": "0.5689588",
            "sentiment_compound": -0.4902
        },
        {
            "id": "hv6vy9a",
            "score": 1,
            "text": "Nice platitudes for the posterity.",
            "title_similarity": "0.14802806",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv6vyj5",
            "score": 1,
            "text": "How do you max out your allotted free speech? \n\nAnd why can companies just spend unlimited on campaigns but we the people have limits? \n\nOhh I know why…I’m just pointing out the hypocrisy.",
            "title_similarity": "0.6007538",
            "sentiment_compound": 0.3632
        },
        {
            "id": "hv6w33u",
            "score": 1,
            "text": "Bush also killed a million Iraqi’s and staged his own coup of an election in 2000. But never mind all that, yeah he’s a good guy now! Fuck yeah! You don’t have to atone for your crimes! This definitely won’t be utilized by Trump or people in his administration in any way a few years from now!!!!",
            "title_similarity": "0.632402",
            "sentiment_compound": 0.8077
        },
        {
            "id": "hv6w3og",
            "score": 1,
            "text": "It’s say r/politics but I’m pretty sure this whole subreddit is L/politics 😂",
            "title_similarity": "0.5527197",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hv6w5uy",
            "score": 1,
            "text": "I appreciate what Bush is doing, but I refuse to get on-board with the post hoc lionization of his time as president.  He probably didn't know it at the time, but he was brazenly paving the way for a candidate like Trump.  I'm not sure where Karl Rove stands vis-a-vis Trump, but he was the bad faith motor behind all of Bush's \"success.\"  It was during the Bush era that evangelicals were offered a prime seat at the table and xenophobia became a point of pride.\n\nIn this case, I think Frankenstein's monster is out rampaging and the good doctor can do nothing to stop it.",
            "title_similarity": "0.6499616",
            "sentiment_compound": 0.9207
        },
        {
            "id": "hv6wbos",
            "score": 1,
            "text": "I guess I love Trump now",
            "title_similarity": "0.27687597",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6wq2y",
            "score": 1,
            "text": "G.W. Bush lost the popular vote and stole the presidency in 2000, lied us into a war that cost trillions of dollars and hundreds of thousands of Iraqi lives, left thousands of US vets dead and thousands more came back with PTSD and today we see them suffering on the streets in every major city in this country, and at the same time he gave away billions in tax cuts to the 1% while the middle class got hollowed out. Without Bush the GOP never would have produced a Trump, his rise came as a reaction to the blatant betrayal by the GOP of the American working class. Without the US invasion of Iraq in 2003 and the destabilization of the entire region, would there have been the conditions for ISIS to arise? How many lives through the decades were lost or destroyed due to the lies of this man? Why does reddit collectively agree Trump is bad but still hold up Bush as a paragon of democracy? Bush was the one who suspended constitutional rights under the Patriot act, lied us into a war that cost us a generation, and all the while concentrated wealth away from the many into the hands of the few. Guantanamo bay is still open and still detaining human beings indefinitely with no right to due process, something that was unthinkable for America to do before this man. The creation of I.C.E., the militarization of the border and the police, all of it started with Bush. The undoing of American democracy did not begin with Trump, if we are not honest about our past, it won't end with him either.",
            "title_similarity": "0.62673366",
            "sentiment_compound": -0.9812
        },
        {
            "id": "hv6wup3",
            "score": 1,
            "text": "You know you're bad when even Bush wants nothing to do w you. Remember who Bushes VP was.. Ouch",
            "title_similarity": "0.3238998",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv6wxrm",
            "score": 3,
            "text": "Not nearly enough. The Bush family have a duty to stop Trumpism. They profited off the environment they created for Trumpism to flourish.",
            "title_similarity": "0.62102747",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv6x1hv",
            "score": 1,
            "text": "Why does it seem like we've heard more out of Donald Trump since he left office than all current living presidents combined since they left?",
            "title_similarity": "0.5404416",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv6x1kk",
            "score": 1,
            "text": "As someone who considered themselves a Republican, I really miss Bush compared to what we have now.",
            "title_similarity": "0.44438726",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hv6x4zq",
            "score": 1,
            "text": "Libs will love Trump in a few decades, like they love Bush now after fighting him tooth and nail. Both sides have way more in common than what sets them apart. Enjoy the political theater /s",
            "title_similarity": "0.549642",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hv6x8hi",
            "score": 3,
            "text": "If they cared about democracy at all, they’d support the voting rights legislation.",
            "title_similarity": "0.448306",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hv6xf3o",
            "score": 1,
            "text": "Is it just me, or has W's reputation gotten a lot better the further he's distanced himself from office and the \"mainstream GOP\"?",
            "title_similarity": "0.5374203",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6xfmi",
            "score": 1,
            "text": "The Swamp. \n\nIt is their world.\n\nIt is who they are.\n\nIt is what they are.",
            "title_similarity": "0.099333316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6xi5g",
            "score": 2,
            "text": "God damn the for making me like W now.",
            "title_similarity": "0.31880766",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hv6xu8u",
            "score": 1,
            "text": "Good reminder that Liz Cheney is shit too.",
            "title_similarity": "0.3563509",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hv6xuqy",
            "score": 1,
            "text": "George Bush is a huge piece of shit",
            "title_similarity": "0.33248088",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hv6y18o",
            "score": 2,
            "text": "Oh god I'm stuck in the timeline where Dubya is the 'good guy'?!",
            "title_similarity": "0.32038772",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hv6y2ld",
            "score": 1,
            "text": "Bad man vs. Worse Man here. This is where we're at as a country.",
            "title_similarity": "0.36063534",
            "sentiment_compound": -0.765
        },
        {
            "id": "hv6y380",
            "score": 1,
            "text": "Fuck Trump, yes but lets not rush to say George Bush is a hero. The guy who put a war at the trillions on the nation's credit card and also murdered over 1 million of people for WMDs that were never there.",
            "title_similarity": "0.66505826",
            "sentiment_compound": -0.6757
        },
        {
            "id": "hv6y5zp",
            "score": 1,
            "text": "the liberals on this website love whenever gwb does something so it's fitting that this would be on the front page",
            "title_similarity": "0.3726306",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv6y61y",
            "score": 1,
            "text": "George **W** Bush",
            "title_similarity": "0.269815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv6ybzc",
            "score": 2,
            "text": "Lolol.  So now all the sudden W is good.",
            "title_similarity": "0.075829774",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv6ywz4",
            "score": 2,
            "text": "The people claiming that Cheney and Bush are now \"voices of reason\" are the very people that make me fucking hate this country and secretly hope that some other country, preferably one we've bombed, pillaged, invaded or starved, just sets us all on fire.",
            "title_similarity": "0.53115165",
            "sentiment_compound": -0.796
        },
        {
            "id": "hv6yzan",
            "score": 1,
            "text": "He’s a war criminal. Full stop.",
            "title_similarity": "0.44538248",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hv6yzj6",
            "score": 1,
            "text": "That should give every sane person pause. GWB has proven to have a talent for never being on the right side of any decision or argument. But sure, let’s embrace him and Dick Cheney because even though they lied us into a war, at least they don’t grab women by the pussy. Establishment will always protect their own.",
            "title_similarity": "0.44103622",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hv6z937",
            "score": 1,
            "text": "Is George W Bush the good guy suddenly? Because I’m my childhood he was the bad guy. Rock against Bush was a killer album!",
            "title_similarity": "0.5285246",
            "sentiment_compound": -0.7345
        },
        {
            "id": "hv6z9lo",
            "score": 2,
            "text": "Still a warmonger",
            "title_similarity": "0.030887205",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv6zd5l",
            "score": 1,
            "text": "Looking back now I kind of chuckle at all the people back then calling Bush Hitler and a Nazi (still not a good man at all and a war criminal). Fast forward some years and we literal Nazi's publicly in the streets and the President (Trump) actively supporting them and calling them \"good people\".",
            "title_similarity": "0.5970192",
            "sentiment_compound": -0.0513
        },
        {
            "id": "hv6zi2o",
            "score": 2,
            "text": "Old Dubya doing some good to preserve democracy. Nice",
            "title_similarity": "0.28583848",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hv6ztho",
            "score": 1,
            "text": "Both parties condone PACs which is a legal bribery law.",
            "title_similarity": "0.5542625",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hv703vg",
            "score": 1,
            "text": "Remember when Eminem released Mosh and Michael Moore made Fahrenheit 9/11? Now look where the past two decades got us...",
            "title_similarity": "0.543966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv704ai",
            "score": 2,
            "text": "They couldn't find a more fitting picture of ol' W with his nose hanging out of the mask. Totally in character for him.",
            "title_similarity": "0.26130134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv706gi",
            "score": 2,
            "text": "Now watch this drive.",
            "title_similarity": "0.1632143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv708u3",
            "score": 1,
            "text": "God old wholesome George",
            "title_similarity": "0.16247436",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv70muv",
            "score": 1,
            "text": "It’s more strategery",
            "title_similarity": "0.2154595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv716v8",
            "score": 2,
            "text": "You know the GOP has circled the drain and dropped into the septic tank when Dubya winds up looking like a hero.",
            "title_similarity": "0.4018743",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hv71f6v",
            "score": 1,
            "text": "Are there any Republicans who actually like and/or respect Trump?  It seems that many are willing to subjugate themselves when he helps to keep them in office but as soon as he is no longer their meal ticket, everyone writes scathingly about his immortality and incompetence.",
            "title_similarity": "0.6303235",
            "sentiment_compound": -0.5647
        },
        {
            "id": "hv71n1w",
            "score": 2,
            "text": "This is meaningless. He can max out my potential for good thoughts towards him by donating the entirety of the rest of his wealth to victims of the Iraq War.",
            "title_similarity": "0.62745965",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hv71pht",
            "score": 2,
            "text": "Of *course* that’s how he wears a mask. Of freaking course.",
            "title_similarity": "0.20734178",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hv71pu2",
            "score": 1,
            "text": "This fucking guy. Audacity.",
            "title_similarity": "0.14214699",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv721c4",
            "score": 1,
            "text": "As much as I hate to admit it, there's lots I'll tolerate for $40 oil, secure borders, full store shelves.....basically a great economy again.  Both sides of the aisle despise him because in 4 short years he made Americans ask, \"why couldn't the previous 4 do this\"?\n\nCareer politicians are freaked now that the public knows to simply vote in a business savvy candidate who can't be bought by special interests and then the people will benefit. \n\nSadly 70mm people are learning this lesson the hard way over the past year but November is coming soon.....",
            "title_similarity": "0.55078566",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hv724ul",
            "score": 1,
            "text": "Perfect picture of G.W.",
            "title_similarity": "0.12947662",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hv72kcz",
            "score": 1,
            "text": "Thats such a typical republican attempt at wearing a mask tho.\n\nCover your noses people",
            "title_similarity": "0.49946102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv72rwr",
            "score": 2,
            "text": "Wow the voice of reason is george bush jr.  What a time to be alive",
            "title_similarity": "0.4516043",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hv73ed6",
            "score": 1,
            "text": "Tacos are good.",
            "title_similarity": "0.0711197",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv73j9i",
            "score": 1,
            "text": "I watched his 9/11 20th anniversary speech in Pennsylvania, fall 2021. His speech moved me to tears. He talked about how the US responded with unity and service to country in 2001, and how saddened he was to see how bad things had gotten after the 2020 election, culminating with the January 6th storming of the capital.\n\nWhile he was president, I disagreed with many of his decisions.  But I never doubted he was sincere in trying to serve his country that he loved. \n\nIf you care about the United States and its future, whether Republican or Democrat, take 10 minutes out of your day and go watch the speech he gave September 11, 2021. It is a solemn reminder that service to country and fellow Americans is the point, not benefit to self or political party.",
            "title_similarity": "0.61303794",
            "sentiment_compound": 0.9377
        },
        {
            "id": "hv73ld4",
            "score": 1,
            "text": "Lol Xi Jinping even made a speech on Trump impeachment\n\nhttps://www.reddit.com/r/China/comments/hobwws/a_message_from_xi_jinping/?utm_medium=android_app&utm_source=share",
            "title_similarity": "0.6865783",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv74a8z",
            "score": 1,
            "text": "I can understand why Mr. Bush would donate to impeachment supporters.  \nThe former president threatened our democracy in *and* out of office, and his actions only prove how much he wants to hold on to power.",
            "title_similarity": "0.78147703",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hv74l4x",
            "score": 1,
            "text": "God dammit.  Don't make me soft on GW.  (Tbh, the real villains in the Cheney administration were Cheney and Rumsfeld)",
            "title_similarity": "0.6599218",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hv74y1t",
            "score": 2,
            "text": "You know things are bad when Bush is against trump",
            "title_similarity": "0.5384875",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv754ce",
            "score": 1,
            "text": "Hope he gets enough donations!",
            "title_similarity": "0.21110624",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hv754nq",
            "score": 2,
            "text": "Cool. Fuck this guy, forever.",
            "title_similarity": "0.21335617",
            "sentiment_compound": -0.296
        },
        {
            "id": "hv755kp",
            "score": 1,
            "text": "GOP is trying to donate the genie back into the bottle",
            "title_similarity": "0.44199365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv75r50",
            "score": 1,
            "text": "Donations of maximum deduction",
            "title_similarity": "0.21690556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv761vf",
            "score": 1,
            "text": "oh boy, bribery",
            "title_similarity": "0.31026906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv761w7",
            "score": 1,
            "text": "Trump told Jeb on national tv that his brother lied us into a war.",
            "title_similarity": "0.72198606",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hv763u9",
            "score": 2,
            "text": "You can either die the villain or live long enough to become a hero.",
            "title_similarity": "0.28985244",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv766x2",
            "score": 1,
            "text": "I wish elections were more about a candidate's altruism, honesty, compassion and intellect and less about who's got more financial backing. Maybe this is where we start going wrong every two years. It's the same cycle of shit every time and an election spot featuring Beef Supreme isn't so far off anymore.",
            "title_similarity": "0.4783975",
            "sentiment_compound": 0.8473
        },
        {
            "id": "hv7772m",
            "score": 1,
            "text": "thanks georje",
            "title_similarity": "0.08597262",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv77qo6",
            "score": 1,
            "text": "I mean are we really shocked?",
            "title_similarity": "0.14143842",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hv78l7s",
            "score": 2,
            "text": "Hell yeah",
            "title_similarity": "0.01919312",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hv7950f",
            "score": 1,
            "text": "Still not gonna vote for Lisa",
            "title_similarity": "0.1903429",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv79h7o",
            "score": 2,
            "text": "Good for Bush2. I'm glad he shows he has morals.",
            "title_similarity": "0.20318635",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hv79iub",
            "score": 2,
            "text": "Hell yes!!!",
            "title_similarity": "0.060843978",
            "sentiment_compound": -0.5826
        },
        {
            "id": "hv7aj3h",
            "score": 1,
            "text": "The impeachment won’t happen lol",
            "title_similarity": "0.23989892",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hv7ajwi",
            "score": 1,
            "text": "When a fucking war criminals is one of the good guys in this fight, just … wow",
            "title_similarity": "0.47817263",
            "sentiment_compound": -0.6674
        },
        {
            "id": "hv7al8z",
            "score": 1,
            "text": "I'm really glad I didn't stop reading in the middle of that headline.",
            "title_similarity": "0.23182385",
            "sentiment_compound": 0.6347
        },
        {
            "id": "hv7an8l",
            "score": 1,
            "text": "No problem! Open a PAC and upend the coffers!",
            "title_similarity": "0.43124488",
            "sentiment_compound": 0.4295
        },
        {
            "id": "hv7ar5c",
            "score": 2,
            "text": "Fucking love it.",
            "title_similarity": "0.06100277",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hv7asfl",
            "score": 2,
            "text": "Not for nothing but really interesting choice of photos for Bush?? A very strange and innocuous decision.",
            "title_similarity": "0.30743623",
            "sentiment_compound": -0.7361
        },
        {
            "id": "hv7aw5q",
            "score": 1,
            "text": "You just lost “the game”\n\nYou’re welcome",
            "title_similarity": "0.28953326",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hv7bgs9",
            "score": 2,
            "text": "Good man, that's great that he has good principles.",
            "title_similarity": "0.064518325",
            "sentiment_compound": 0.872
        },
        {
            "id": "hv7c4p5",
            "score": 1,
            "text": "Maybe if George didn’t want Trump he shouldn’t have run a Presidency they set the stage for him. It also would have nice George didn’t lie about Iraq having weapons of Mass Destruction when he was President, but yes, let’s call Trump bad and do nothing to address the problems the Republicans have been manufacturing since at least Rappin’ Ronnie Reagan.",
            "title_similarity": "0.65184045",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hv7c7zn",
            "score": 2,
            "text": "Forget not that George W. Bush is one of the architects of the scaffolding which Trump used to get into power.  He's no angel.  But at the moment, the country needs any break it can get to keep democracy, no matter how imperfect or tainted it has become since and because of W's reign.",
            "title_similarity": "0.6660074",
            "sentiment_compound": -0.6262
        },
        {
            "id": "hv7cbvm",
            "score": 1,
            "text": "Bush wearing the mask incorrectly is so on brand.  Surprised it’s not upside down.",
            "title_similarity": "0.21764663",
            "sentiment_compound": 0.2878
        },
        {
            "id": "hv7cfex",
            "score": 1,
            "text": "Of course the little war criminal did. Reddit now treats this man like a hero because he once gave Michelle Obama some chocolate. This psychopath should be in prison for the rest of his life along with Liz Cheney’s father.",
            "title_similarity": "0.5634561",
            "sentiment_compound": -0.6031
        },
        {
            "id": "hv7cm1x",
            "score": 1,
            "text": "He didn't Max out Obama spending on war lol",
            "title_similarity": "0.4006365",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hv7d1am",
            "score": 2,
            "text": "W is doing the right thing.",
            "title_similarity": "0.057427905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7d1np",
            "score": 1,
            "text": "He’s still a huge stinking pile of lying, warmongering ass-haberdashery and is the source of so many problems today. \n\n🎶...That’s my Bush!! 🎶",
            "title_similarity": "0.34998322",
            "sentiment_compound": -0.9111
        },
        {
            "id": "hv7d1re",
            "score": 1,
            "text": "Fayetteville Street used to be part of their “strategic growth” plan and boom you get to be the next Republican President after Bush II.",
            "title_similarity": "0.62197286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7d24k",
            "score": 2,
            "text": "Crazy how a fucking war criminal is even man enough to call out an outright fucking nonhuman shit clod.\n\nI spent a decade pulling legless kids off busses because of Bush. Fuck him.\n\nI would gladly shake his hand today.",
            "title_similarity": "0.52268004",
            "sentiment_compound": -0.9294
        },
        {
            "id": "hv7d7py",
            "score": 1,
            "text": "The enemy of my enemy is my friend.",
            "title_similarity": "0.4197869",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hv7d8zj",
            "score": 2,
            "text": "mask over the nose George 😷👃",
            "title_similarity": "0.22888896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7dnmx",
            "score": 1,
            "text": "“Look at me! Look at me! Look what I did!” How much was donated to those in actual need.",
            "title_similarity": "0.46955013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7ealn",
            "score": 1,
            "text": "Neoliberals trying to protect the status quote political system.",
            "title_similarity": "0.5344692",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hv7eave",
            "score": 1,
            "text": ">There is little cultural overlap between violent extremists abroad and violent extremists at home,\" Bush said during a speech in Shanksville, Pennsylvania. \"But in their disdain for pluralism, in their disregard for human life, in their determination to defile national symbols, they are children of the same foul spirit. And it is our continuing duty to confront them.\"",
            "title_similarity": "0.52450764",
            "sentiment_compound": -0.7992
        },
        {
            "id": "hv7ffvu",
            "score": 2,
            "text": "Boy oh boy how things have changed - liberals pointing to GWB as a moral/informational compass.\n\nO\\_O wat",
            "title_similarity": "0.48722193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7fq3o",
            "score": 1,
            "text": "Having read zero comments in this thread, I fully expect a bunch of “cross the aisle” posts.",
            "title_similarity": "0.2736616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7ftkm",
            "score": 2,
            "text": "Aww does the previous lying and treasonous conservative regime feel bad they have been taken over by a new lying, treasonous conservative regime? Does ole Georgie want to paint about his feelings?",
            "title_similarity": "0.54442394",
            "sentiment_compound": -0.9569
        },
        {
            "id": "hv7fzzs",
            "score": 5,
            "text": "War criminal took time away from painting shower selfies.\n\nHe sure was the Miserable Failure of his day.",
            "title_similarity": "0.38430277",
            "sentiment_compound": -0.91
        },
        {
            "id": "hv7g0jr",
            "score": 1,
            "text": "ok",
            "title_similarity": "-0.05160197",
            "sentiment_compound": 0.296
        },
        {
            "id": "hv7g1qm",
            "score": 3,
            "text": "Bush and Cheney are now on the right side of history? What timeline are we in, children???",
            "title_similarity": "0.44336206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7g6nh",
            "score": 1,
            "text": "So, we should invade Iran?",
            "title_similarity": "0.40740633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7gddt",
            "score": 2,
            "text": "Maybe he should max out his donations to the people of Iraq and Afghanistan",
            "title_similarity": "0.5823054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7gf7r",
            "score": 4,
            "text": " Nice. Still a war criminal.",
            "title_similarity": "0.34602147",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hv7gjdo",
            "score": 2,
            "text": "Fake people",
            "title_similarity": "0.10612495",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv7hukf",
            "score": 1,
            "text": "I really wish the media would stop trying to rehab W’s image.",
            "title_similarity": "0.3884309",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hv7i015",
            "score": 4,
            "text": "I mean... Surely the guy could do more than that. Like, I dunno, speak out clearly and unequivocally against Trumpism.",
            "title_similarity": "0.4749671",
            "sentiment_compound": 0.8107
        },
        {
            "id": "hv7i4vy",
            "score": 1,
            "text": "Way to drop the bills G-DUB!!",
            "title_similarity": "0.39855757",
            "sentiment_compound": -0.3987
        },
        {
            "id": "hv7i5ts",
            "score": 1,
            "text": "CIA never loses",
            "title_similarity": "0.26528695",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hv7j1d7",
            "score": 2,
            "text": "Still a fucking war criminal.",
            "title_similarity": "0.33880877",
            "sentiment_compound": -0.8347
        },
        {
            "id": "hv7j332",
            "score": 2,
            "text": "They’re all scumbags trump was just loud about it",
            "title_similarity": "0.40023956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7ja9h",
            "score": 4,
            "text": "The BUSHES were always part of the swamp",
            "title_similarity": "0.109984934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7k1gv",
            "score": 1,
            "text": "They all want to rid trump because they are afraid of what he can do to all of their reputations.",
            "title_similarity": "0.44344488",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hv7k3is",
            "score": 1,
            "text": "So what happens when we can’t even buy doing the right thing?",
            "title_similarity": "0.21509102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7k8ag",
            "score": 1,
            "text": "Didn’t this guy send us to Iraq and Afghanistan, then lied about WMD’s? Like wtf how he become a hero?",
            "title_similarity": "0.6352326",
            "sentiment_compound": -0.168
        },
        {
            "id": "hv7kb53",
            "score": 1,
            "text": "Not sure how he hasn’t stood trial for war crimes yet",
            "title_similarity": "0.40124747",
            "sentiment_compound": -0.7061
        },
        {
            "id": "hv7kbum",
            "score": 1,
            "text": "He has to do this because they're the one who stood up for traditional Republican values and constitutional loyalists by not agreeing to the predominant  trumpism ideology",
            "title_similarity": "0.5623498",
            "sentiment_compound": 0.4145
        },
        {
            "id": "hv7kse9",
            "score": 1,
            "text": "Worth nothing when you don't have the spine to vote against your own party even when you know your \"guy\" is wrong and unethical. Even if you skip the presidential vote and go republican the rest of the ticket you are implicitly supporting Trump. You empower the erosion of american institutions while patting yourself on the back with meaningless platitudes. \n\nI hope the burden of the hundreds of thousands of innocent civilians that died to Bushes incompetence follows him forever.",
            "title_similarity": "0.66130084",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv7kvkj",
            "score": 1,
            "text": "Alternate headline: War Criminal Isn't That Bad",
            "title_similarity": "0.39056364",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hv7kwj1",
            "score": 1,
            "text": "People sure are quick to forget this dude is a war criminal",
            "title_similarity": "0.4086359",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hv7kzlm",
            "score": 1,
            "text": "https://twitter.com/barackobama/status/1261004586359422979",
            "title_similarity": "0.34621447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7la34",
            "score": 1,
            "text": "Bush is a war criminal and should have been impeached for Christ sake lol",
            "title_similarity": "0.51449615",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hv7lews",
            "score": 1,
            "text": "Proper photo of THE BUSH 🇺🇸",
            "title_similarity": "0.0953767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7lmp5",
            "score": 2,
            "text": "I like how the \"reasonable\" side of the Republican party is corrupt war criminals.\n\nJust goes to show you how history works.\n\nWe think it can't get worse, then it gets worse, and then the revisionist history comes in to say it wasn't bad.",
            "title_similarity": "0.60638404",
            "sentiment_compound": -0.2723
        },
        {
            "id": "hv7lmrs",
            "score": 1,
            "text": "One legacy helping out another.",
            "title_similarity": "0.12663916",
            "sentiment_compound": 0.296
        },
        {
            "id": "hv7lpsb",
            "score": 1,
            "text": "George w bush has been incredibly damaging to this country I was fine with him being the worst president in my generation then trump had to come and say hold my beer I’ll show the world what a real moron looks like.",
            "title_similarity": "0.6038893",
            "sentiment_compound": -0.8221
        },
        {
            "id": "hv7lptb",
            "score": 2,
            "text": "Anchor Baby Rafael Cruz",
            "title_similarity": "0.23870501",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7lray",
            "score": 2,
            "text": "I'll say one thing about George Walker Bush...\n\nHe still stinky, but he's not Trump level stinky. But still very big stinky over all.",
            "title_similarity": "0.40090925",
            "sentiment_compound": -0.4123
        },
        {
            "id": "hv7luxw",
            "score": 2,
            "text": "\"There is little cultural overlap between violent extremists abroad and violent extremists at home.” \n\n\"But in their disdain for pluralism, in their disregard for human life, in their determination to defile national symbols, they are children of the same foul spirit.”\n\n“And it is our continuing duty to confront them.\" \n\nWow. Powerful/chilling words from Bush.",
            "title_similarity": "0.47474012",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hv7m9te",
            "score": 3,
            "text": "George W Bush is a failson war criminal pile of shit",
            "title_similarity": "0.5343037",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hv7mf8r",
            "score": 1,
            "text": "Why not max out donations to all dems then?",
            "title_similarity": "0.46535814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7mpl3",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.09958489"
        },
        {
            "id": "hv7mu6f",
            "score": 2,
            "text": "Get em.",
            "title_similarity": "0.05179581",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7nef9",
            "score": 1,
            "text": "Well, then, I don’t hate him as much as I did when he was President. In fact, untilTrump, I thought he was the worst President during my lifetime.",
            "title_similarity": "0.51383173",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hv7neky",
            "score": 1,
            "text": "A thousand points of shite",
            "title_similarity": "0.1742609",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7nkyk",
            "score": 2,
            "text": "Why am I not surprised bush wears a mask like an idiot",
            "title_similarity": "0.28186697",
            "sentiment_compound": -0.354
        },
        {
            "id": "hv7npn9",
            "score": 1,
            "text": "I’ve got to say I’m impressed. I’m still not a fan of him, but I support this action by him.",
            "title_similarity": "0.24644464",
            "sentiment_compound": 0.6272
        },
        {
            "id": "hv7o2mr",
            "score": 1,
            "text": "Lets play, spot the agenda based on selected stock photographs..",
            "title_similarity": "0.40700048",
            "sentiment_compound": 0.34
        },
        {
            "id": "hv7o3g7",
            "score": 1,
            "text": "If Dubya hates it, it's probably good.\n\nI can only imagine how much everyone happy with this hated him before.\n\nSeriously, praising NeoCon warhawks that used to get called war criminals real quick when convenient.",
            "title_similarity": "0.50309527",
            "sentiment_compound": -0.743
        },
        {
            "id": "hv7ofib",
            "score": 1,
            "text": "Here’s a question for Reddit, I identify as a Conservative but have a blend of left-centrist-right views in economics, is there anything called progressive conservative that likes social programs but have conservative social views?? (Btw yes my social views on based on Islam)",
            "title_similarity": "0.5406779",
            "sentiment_compound": 0.8229
        },
        {
            "id": "hv7ohr3",
            "score": 3,
            "text": "Who gives a shit? Why are we upvoting an article written about someone who is not only irrelevant but a war criminal",
            "title_similarity": "0.5557916",
            "sentiment_compound": -0.9224
        },
        {
            "id": "hv7ou2q",
            "score": 1,
            "text": "Never thought I'd agree with George W.",
            "title_similarity": "0.31690222",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hv7oug8",
            "score": 1,
            "text": "Bush is a traitor and a dumb ass !!!",
            "title_similarity": "0.23415661",
            "sentiment_compound": -0.826
        },
        {
            "id": "hv7ova0",
            "score": 1,
            "text": "Fuck Trump, lock him up 🔒",
            "title_similarity": "0.3814277",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv7p1tb",
            "score": 2,
            "text": "The nerve, especially after Trump effectively took the title of \nTHE WORST PRESIDENT EVER away from him for generations to come.",
            "title_similarity": "0.54764575",
            "sentiment_compound": -0.3958
        },
        {
            "id": "hv7p77h",
            "score": 1,
            "text": "Looks like a bunch of losers to me !",
            "title_similarity": "0.1556634",
            "sentiment_compound": -0.2942
        },
        {
            "id": "hv7p7gf",
            "score": 1,
            "text": "The chaneys lol his back pocket lol",
            "title_similarity": "0.23780207",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hv7pheg",
            "score": 2,
            "text": "Not enough, war criminal.  Too little too late.  History will not look kindly on you.",
            "title_similarity": "0.32792288",
            "sentiment_compound": 0.5096
        },
        {
            "id": "hv7phoi",
            "score": 2,
            "text": "He knows where his bread is buttered.",
            "title_similarity": "0.16800147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7pl40",
            "score": 2,
            "text": "We need to get money out of fucking politics.",
            "title_similarity": "0.5095809",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7q7zr",
            "score": 1,
            "text": "Holy shit!",
            "title_similarity": "0.059250847",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hv7qdpn",
            "score": 1,
            "text": "Over the nose, George. Over the nose.",
            "title_similarity": "0.27599978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7qg4u",
            "score": 1,
            "text": "Gib me sum Dubya",
            "title_similarity": "0.19593638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7qkxy",
            "score": 1,
            "text": "They don’t like trump but still wouldn’t dream of supporting Americans by voting for infrastructure or voting rights bills",
            "title_similarity": "0.46739846",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hv7qphy",
            "score": 6,
            "text": "Good for him trying to atone for that time he invaded a sovereign country that was in no way, shape, or form associated with Al Queda and killed hundreds of thousands of civilians so that his dad's buddies could exploit their natural resources and fleece the American tax payers into paying them to do it. I hope he lies awake at night thinking about how his republican old guard ushered in these militarized neo-cons and essentially sparked the modern day threat to the American experiment. \n\nTwo hundred years from now historians will look at the Gulf War, the Brooks Brothers riot and operation Iraqi freedom as the beginning of the militarization of American law enforcement, ultra nationalism, and eventual collapse of election integrity and, ultimately, the end of a democracy.",
            "title_similarity": "0.6320172",
            "sentiment_compound": -0.872
        },
        {
            "id": "hv7r10q",
            "score": 2,
            "text": "The money is a start, but he could play a much bigger role in fighting for the soul of that party. He has nothing to lose and everything to gain. The last Republican leader alive, with a lot of guilt over starting two horrible failures of wars predicated on outright lies.",
            "title_similarity": "0.6127169",
            "sentiment_compound": -0.7726
        },
        {
            "id": "hv7r2eo",
            "score": 1,
            "text": "Look at poor Shrub, too whatever to pull his mask over his nose. Yale’s finest mind, there.",
            "title_similarity": "0.3523737",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv7r4ag",
            "score": 3,
            "text": "Don't act like these trolls are heroes for doing the absolute least they could do.",
            "title_similarity": "0.34605175",
            "sentiment_compound": 0.2937
        },
        {
            "id": "hv7rqld",
            "score": 1,
            "text": "So this subs bolstering the Republican Party now. \n\nW. Was literally the worst president in perhaps all of American history.",
            "title_similarity": "0.57724476",
            "sentiment_compound": -0.34
        },
        {
            "id": "hv7rrv6",
            "score": 1,
            "text": "Didn't Liz Cheney vote with Trump over 90%?",
            "title_similarity": "0.5478455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7s9gv",
            "score": 1,
            "text": "No love for old Mittens? Verrrry interesting….",
            "title_similarity": "0.25163692",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hv7sc31",
            "score": 2,
            "text": "Fuck George w bush",
            "title_similarity": "0.4874715",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hv7sdvp",
            "score": 1,
            "text": "Bush wouldn't want anybody to find out he had everything to do with 9/11. Hahaha scum bag",
            "title_similarity": "0.41279656",
            "sentiment_compound": 0.5232
        },
        {
            "id": "hv7szln",
            "score": 1,
            "text": "How did I expect this?",
            "title_similarity": "0.11176275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7t1sb",
            "score": 1,
            "text": "Of course he does. The Bush's have a vested interest in the swamp.",
            "title_similarity": "0.18899265",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hv7t474",
            "score": 1,
            "text": "I liked it when Republicans went to war with other nations instead of other Americans",
            "title_similarity": "0.4994209",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hv7t4y7",
            "score": 2,
            "text": "Still a war criminal",
            "title_similarity": "0.32900274",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv7t8uy",
            "score": 1,
            "text": "All idiots",
            "title_similarity": "0.06958625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7tq3u",
            "score": 2,
            "text": "It's not enough. It will never be enough.",
            "title_similarity": "0.023895673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7trte",
            "score": 1,
            "text": "This is a classy way of saying fuck you",
            "title_similarity": "0.25951052",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hv7u8qs",
            "score": 2,
            "text": "I still stand by the idea that W was just the fall guy. He’s just a dumb, likable old man with a kind personality that they used as a talking head while Dick Cheney ran the GOP playbook from the background.",
            "title_similarity": "0.44576392",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hv7u94k",
            "score": 1,
            "text": "I like George W Bush?",
            "title_similarity": "0.35913995",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv7ua8k",
            "score": 1,
            "text": "Oh good, the guy who is responsible for 2 failed wars, 100s of thousands of lives lost, and 10s of trillions of dollars wasted (not wasted I guess, funneled to his industrial war complex friends) did something.",
            "title_similarity": "0.5496875",
            "sentiment_compound": -0.7409
        },
        {
            "id": "hv7uke5",
            "score": 2,
            "text": "The old war criminal is obligated to donate to the Darth Vaderette Cheney, spawn of the grotesque war monger Dick the Terrible, Chief of Halliburton, Sheriff of Evil.Simply stated, the 3 (Cheney, Cheney and Bush) are turdmongers and should be banished to the Tree of Woe. Murkowski is just a simpleton",
            "title_similarity": "0.5639014",
            "sentiment_compound": -0.9657
        },
        {
            "id": "hv7umji",
            "score": 1,
            "text": "I never thought I'd say this but I miss W!",
            "title_similarity": "0.20316538",
            "sentiment_compound": -0.2942
        },
        {
            "id": "hv7upvm",
            "score": 1,
            "text": "The swamp is thick lmao",
            "title_similarity": "0.14487068",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hv7uqi4",
            "score": 1,
            "text": "I know Liz is anti-Trump, but Lisa is new.",
            "title_similarity": "0.5309915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7uyfc",
            "score": 1,
            "text": "Fuuuuck Dubya and anyone who thinks he's acceptable.",
            "title_similarity": "0.20173681",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hv7v9h8",
            "score": 1,
            "text": "No respect for him.",
            "title_similarity": "0.073909536",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hv7vcoj",
            "score": 1,
            "text": "A true patriot doing everything he can to help other true patriots.",
            "title_similarity": "0.28232217",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hv7vgpn",
            "score": 1,
            "text": "While his nephew begs for Trumps endorsement",
            "title_similarity": "0.59223044",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hv7vl5x",
            "score": 1,
            "text": "Who cares they’re all demons",
            "title_similarity": "0.19074805",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hv7vxux",
            "score": 1,
            "text": "13",
            "title_similarity": "-0.017321505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7w724",
            "score": 1,
            "text": "Any article about the election in Alaska that doesn't even mention the new election system is complete garbage.\n\nMurkowski will make it through the primary to the general. The only question is how she'll fare with RCV.",
            "title_similarity": "0.5899516",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7wgch",
            "score": 1,
            "text": "Fascist vs Fascist",
            "title_similarity": "0.32273477",
            "sentiment_compound": -0.802
        },
        {
            "id": "hv7wmg7",
            "score": 1,
            "text": "Best donations of his career!",
            "title_similarity": "0.28369105",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hv7wppm",
            "score": 1,
            "text": "W can afford it, but he has to support the spawn of the war pig, Dick ‘darth vader‘ Cheney. Dick the war profiteer and Chieftain of Haliburton. The 3 amigos looking for another war, another chance at nation building. ‘Mission Accomplished George’ along with Dick are thinking up ways to transfer abandoned war material left in Afghanistan to Ukraine to support ultra rightists, fascists in Ukraine. Just ask Oliver Stone, he did 2 films on the subject of Ukraine",
            "title_similarity": "0.6841567",
            "sentiment_compound": -0.9839
        },
        {
            "id": "hv7wq22",
            "score": 1,
            "text": "Why is this old news so popular now?",
            "title_similarity": "0.3395126",
            "sentiment_compound": 0.5598
        },
        {
            "id": "hv7wuk4",
            "score": 1,
            "text": "So I guess Liz Chaney gets to just be a “good guy” now? The bar sure is low af for republicans right now",
            "title_similarity": "0.42335814",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hv7x1q5",
            "score": 1,
            "text": "Cheney is a utility minimum-dignity Republican, but Murkowski is a footnote nothing herpaderp.",
            "title_similarity": "0.42548004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7x8mt",
            "score": 1,
            "text": "Sounds like Bush is scared any all the wrong shit he’s done",
            "title_similarity": "0.33999562",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hv7xkhi",
            "score": 1,
            "text": "Too bad he wasn't more vocal in his criticism.",
            "title_similarity": "0.14224385",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hv7y15l",
            "score": 1,
            "text": "Worry about your truck drivers not our issues in the USA",
            "title_similarity": "0.43079644",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hv7ygaf",
            "score": 2,
            "text": "Just being anti-Trump does not make the person good though. Let's not forget that Bush is a literal war criminal and supports virtually every fascist policy Trump does. So does Liz Cheney. Even Murkowski is a hard right winger that only disagrees with the GOP leadership one time out of 100.",
            "title_similarity": "0.6191584",
            "sentiment_compound": -0.8193
        },
        {
            "id": "hv7yi8d",
            "score": 1,
            "text": "Yeh it is come to God moment for those left in the fascist Repub party",
            "title_similarity": "0.41103792",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hv7ykqj",
            "score": 1,
            "text": "Hahaha.  Look at that lil gremlin nose sticking out of his mask.",
            "title_similarity": "0.25939125",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hv7yvc9",
            "score": 6,
            "text": "I hate that all of these war criminals pieces of shit like W are getting praise and people are acting like they’re good people simply because they oppose Trump. Fuck George W Bush now and forever. Say what you want about Trump, but he doesn’t have even close to the blood on his hands that Bush does.",
            "title_similarity": "0.6025774",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hv7ywmq",
            "score": 1,
            "text": "Ashamed I worked for him and attended his inauguration and balls",
            "title_similarity": "0.5076145",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hv7yy60",
            "score": 1,
            "text": "I hate this timeline where I find myself in agreement with George W. Bush.",
            "title_similarity": "0.48935884",
            "sentiment_compound": -0.128
        },
        {
            "id": "hv7z6a2",
            "score": 2,
            "text": "Too little too late.\n\nGore won the Presidency.\n\nIf Gore had been president, like he won, America would have never ended up with a Goddamned Trump.",
            "title_similarity": "0.5207831",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hv7zgdu",
            "score": 2,
            "text": "I guess that wipes out the fact that he killed a million Iraqis?",
            "title_similarity": "0.54285514",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hv7zkji",
            "score": 1,
            "text": "the bush family working with cheney family. I havent seen that happen since. 1976, 1980, 1984, 1988, 1992, 2000, and 2004. fucking shocking",
            "title_similarity": "0.5196022",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hv7zoar",
            "score": 1,
            "text": "Excellent stratergery",
            "title_similarity": "0.13813105",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hv7zuca",
            "score": 2,
            "text": "He’s still a shitbag in my book",
            "title_similarity": "0.26628125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv7zzpr",
            "score": 1,
            "text": "Bush and Cheney! Awful!",
            "title_similarity": "0.38783365",
            "sentiment_compound": -0.555
        },
        {
            "id": "hv80ahb",
            "score": 2,
            "text": "War criminal.",
            "title_similarity": "0.39670348",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv80kl6",
            "score": 1,
            "text": "Bush is making sure that if he gets remembered as one of the dumbest in the history books, at least he’s not gonna be on the same wack double page that Donnie is gonna have lol",
            "title_similarity": "0.4671753",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hv80rjw",
            "score": 1,
            "text": "well when you love getting americans killed in pointless wars you support each other",
            "title_similarity": "0.5465236",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hv80ys3",
            "score": 1,
            "text": "Bush took us into war for how many years?",
            "title_similarity": "0.4766475",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv813bj",
            "score": 2,
            "text": "Don’t let Trump make you forget what an evil bastard W is.  If it weren’t for the fact that Trump singled him and his brother out for criticism, he probably be on the Trump bandwagon just like all the other so-called “sensible” Republicans.",
            "title_similarity": "0.63400674",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hv8169k",
            "score": 1,
            "text": "Globalist gotta stick together",
            "title_similarity": "0.12261063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv81tfa",
            "score": 2,
            "text": "Bush and Cheney would have been executed for war crimes if they were put under as much scrutiny as the Nazis during the Nuremberg trials.",
            "title_similarity": "0.6178001",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hv81vgj",
            "score": 1,
            "text": "More like “Former President donates maximum amount to the daughter of his Vice President”",
            "title_similarity": "0.63959277",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hv81xvd",
            "score": 2,
            "text": "Still a war criminal.",
            "title_similarity": "0.32758182",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv81yzw",
            "score": 1,
            "text": "He's popular with no one.  I hate to say it, but \"they\" hate him too.",
            "title_similarity": "0.26044172",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hv825nj",
            "score": 1,
            "text": "A great Texas patriot lol",
            "title_similarity": "0.2723665",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hv8275c",
            "score": 2,
            "text": "Ah, a war criminal standing up to a wannabe war criminal. Brilliant.",
            "title_similarity": "0.48619545",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hv82agm",
            "score": 2,
            "text": "Please stop calling him the voice of reason or whatever the fuck; he started an unjustified war and killed millions of Iraqis and destabilized the Middle East and created millions of refugees and allowed for the rise of isis and…",
            "title_similarity": "0.5715666",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hv82eyj",
            "score": 1,
            "text": "\"I don't like Trump, but I love the underlying politics that made someone like Trump inevitable!\"\n\nImagine praising this absolute psycho for doing exactly what you'd expect him to do.",
            "title_similarity": "0.5572419",
            "sentiment_compound": 0.9386
        },
        {
            "id": "hv82t6r",
            "score": 2,
            "text": "ELI5. Why would George Bush do that? When other news are reporting that republicans who were opposing Trump before are leaning towards synchronizing with his moral values and what not.\n\n_genuinely curious_",
            "title_similarity": "0.71044385",
            "sentiment_compound": 0.1872
        },
        {
            "id": "hv82tn9",
            "score": 2,
            "text": "Cool but he’s still a war criminal",
            "title_similarity": "0.37292928",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hv833ao",
            "score": 2,
            "text": "Why is this whole fucking sub Reddit hating on someone who is literally trying to keep Trump from going into office? \n\nHe is trying to keep a Republican Party not associated with that communist sob.\n\nI do not agree with the old republican ways but I do agree with keeping the party out of trumps paws",
            "title_similarity": "0.6364159",
            "sentiment_compound": 0.6501
        },
        {
            "id": "hv83wp2",
            "score": 2,
            "text": "This is a man who had no idea what his party was about, and now want's to be on the right side of history. Fair enough, but I hope he doesn't think we'll start looking upon him fondly in the textbooks. If anything he will come off as the opening comedy act before Bozo the Clown took office.",
            "title_similarity": "0.4502967",
            "sentiment_compound": 0.9161
        },
        {
            "id": "hv83yv8",
            "score": 1,
            "text": "I don't think the impeachment supporting republicans will be the strongest voice in the party",
            "title_similarity": "0.5262799",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hv84d00",
            "score": 1,
            "text": "Weird how Trump was one of the most recent presidents who didn't belong to Skull and Bones, or some weird shit",
            "title_similarity": "0.55272937",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hv84js7",
            "score": 1,
            "text": "Oo big deal. Now give some dark money in the hundreds on millions. Just like your Supreme Court would want.",
            "title_similarity": "0.60912585",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hv84kpb",
            "score": 1,
            "text": "I would look at the resource before coming to conclusions.",
            "title_similarity": "0.18794405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv84qb6",
            "score": 1,
            "text": "This painter and former head of state hopes to be remembered better than the other one.",
            "title_similarity": "0.4174841",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hv84toz",
            "score": 1,
            "text": "Yeah great. Also, fuck the liar, war-mongering piece of shit named George W. Bush.",
            "title_similarity": "0.5477983",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hv85670",
            "score": 1,
            "text": "Well he killed millions of people so why not",
            "title_similarity": "0.43535936",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hv858g8",
            "score": 6,
            "text": "Say that to an Iraqi citizen. No i don’t support Trump , but don’t be fooled , Bush was a monster",
            "title_similarity": "0.59685344",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hv861g0",
            "score": 1,
            "text": "Is it me or doesn’t seem odd that Business insider always has posts on Reddit news?? They want clicks it seems",
            "title_similarity": "0.5896206",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hv86cx0",
            "score": 1,
            "text": "What timeline is this and where is the divergent",
            "title_similarity": "0.065666884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv86ewi",
            "score": 1,
            "text": "Morons, all of you here",
            "title_similarity": "0.1815444",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hv86fgq",
            "score": 1,
            "text": "weapons of mass destruction",
            "title_similarity": "0.36144176",
            "sentiment_compound": -0.765
        },
        {
            "id": "hv86hz7",
            "score": 1,
            "text": "he donated under the name of chemical ali",
            "title_similarity": "0.38489485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv86l8a",
            "score": 1,
            "text": "axis of evil",
            "title_similarity": "0.17298043",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hv86owm",
            "score": 2,
            "text": "from one corrupt family to another",
            "title_similarity": "0.41713855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv86trc",
            "score": 1,
            "text": "That’s the “nucular” option. You know what they say donate me once shame on me. Donate me twice won’t get donated again!",
            "title_similarity": "0.4964422",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hv87580",
            "score": 1,
            "text": "Oh look, the war criminal receives another puff piece commissioned by oligarchs. Ho hum.",
            "title_similarity": "0.640183",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv877u4",
            "score": 1,
            "text": "I wonder how much Democrats are paying the Bush family to support them and not Republicans which they used to be",
            "title_similarity": "0.60786957",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv87jv2",
            "score": 1,
            "text": "He's not even president anymore. You can't impeach him when he doesn't hold office.",
            "title_similarity": "0.45359623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv87onu",
            "score": 2,
            "text": "George bush 1and 2 and Dick Cheney did 911. Fuck Donald Trump 1 and 2 never forget",
            "title_similarity": "0.6336532",
            "sentiment_compound": -0.7298
        },
        {
            "id": "hv87pqs",
            "score": 1,
            "text": "The W in his name stands for “winner”",
            "title_similarity": "0.33655104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv87spu",
            "score": 1,
            "text": "That title is a headache",
            "title_similarity": "0.1786222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8861a",
            "score": 1,
            "text": "Agreed.\n\nThe American Media is controlled by Corporate America.\n\nCorporate America Controls Government.\n\nI have to say it slowly to myself sometimes..",
            "title_similarity": "0.6104722",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv887wv",
            "score": 2,
            "text": "Trump is so awful that he made Bush look like a hero.",
            "title_similarity": "0.55363506",
            "sentiment_compound": 0.3035
        },
        {
            "id": "hv888lk",
            "score": 2,
            "text": "Thank you President Bush sir!",
            "title_similarity": "0.464921",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hv88j2t",
            "score": 2,
            "text": "Let's stop pretending like George is a good ol boy.  How many needless deaths are on that man's hands?",
            "title_similarity": "0.49861768",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hv88oei",
            "score": 2,
            "text": "The fact that W thinks Trump is nuts and shouldn't be in power says a lot! Unchecked Trump would go full Gaddafi.",
            "title_similarity": "0.55381364",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hv89pnm",
            "score": 1,
            "text": "   I well thank W. for this. He is a real man. Can we all thank him in some way. Yes he was a Republican so was his Dad. They were good people. They loved there country. May God bless George W. Bush.",
            "title_similarity": "0.44408077",
            "sentiment_compound": 0.9612
        },
        {
            "id": "hv89s1w",
            "score": 1,
            "text": "Good on him. I hope he endorses the true Republicans and campaigns for them as well.  I don't agree with their policies, but I respect their integrity.  I just hope there are more than two Republicans running who he also feels he can endorse even if he doesn't donate.   \nMaybe he can help bring some integrity back to a few Red states.",
            "title_similarity": "0.5627057",
            "sentiment_compound": 0.9794
        },
        {
            "id": "hv89yid",
            "score": 1,
            "text": "Nah the Iraq war wasn’t that bad. I mean at least W didn’t tweet anything rude.",
            "title_similarity": "0.30833173",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hv8agpm",
            "score": 1,
            "text": "I love how the mask doesn't go over his nose",
            "title_similarity": "0.11644079",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hv8alcf",
            "score": 1,
            "text": "If you told me twenty years ago that GWB would be the most respectable republican President in my lifetime, I would have balked at you and let out a good guffaw.",
            "title_similarity": "0.5591104",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hv8b5px",
            "score": 1,
            "text": "I can't believe I'm cheering for Dubya....",
            "title_similarity": "0.28487352",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hv8bdyz",
            "score": 1,
            "text": "Too bad Mr. Orange is already a war criminal and rightfully locked up already. Oh wait, people with money arent accountable like the rest of us. I got a traffic ticket before Christmas going to pick up for toys for tots at a military base and wasn't told about it til there was gonna be a warrant out.",
            "title_similarity": "0.5776572",
            "sentiment_compound": -0.9171
        },
        {
            "id": "hv8bgyk",
            "score": 1,
            "text": "Battle Royale of the worst presidents ever. Let them shoot it out, Western style with six guns, the way they admire from the US past: Bush administration afraid of war crime prosecution, Trump afraid of impeachment.",
            "title_similarity": "0.62793785",
            "sentiment_compound": -0.9485
        },
        {
            "id": "hv8bi8x",
            "score": 1,
            "text": "Less-bad republicans are still republicans. That doesn't make them good guys.",
            "title_similarity": "0.34367195",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hv8blk8",
            "score": 1,
            "text": "How did this go from Bush to Cruz.",
            "title_similarity": "0.25291073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8bt0i",
            "score": 1,
            "text": "Dude was basically a Democrat his second term, while the media and opposition respected him even less for it",
            "title_similarity": "0.39117628",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hv8c4xj",
            "score": 1,
            "text": "\"Privately divided by a world so undecided and there's nowhere to go\". ;RHCP",
            "title_similarity": "0.2166896",
            "sentiment_compound": -0.3593
        },
        {
            "id": "hv8chir",
            "score": 1,
            "text": "I do not know enough about politics so this is politics aside \n but George Bush seems like a good human being. i love that he paints so much and he seems like a good hearted person.\nI am democratic but any person that will go against their own party for moral reasons has my respect . i don’t know what laws Cheney supports but she has to have some kind of moral standards and her father seemed like a good person too.",
            "title_similarity": "0.5025976",
            "sentiment_compound": 0.9906
        },
        {
            "id": "hv8cm79",
            "score": 1,
            "text": "Woman on the right looks like the Karen of all Karens",
            "title_similarity": "0.23152575",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv8d1tc",
            "score": 1,
            "text": "Bush is part of the old guard deep state that seeks to prolong the power of the ABC entities that aren't really allowed under the Constitution..",
            "title_similarity": "0.5634999",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8dcvd",
            "score": 2,
            "text": "I really miss the days when W and Dick were the benchmark for “evil.”",
            "title_similarity": "0.30566335",
            "sentiment_compound": -0.6361
        },
        {
            "id": "hv8dls3",
            "score": 1,
            "text": "Reddit loves GWB and imperialism.\n\nReddit hates Trump because he wasn't polite and smart enough to lie for imperialism. ie \"we'll just take the oil from Syria.\"\n\nThis astroturfed site can't save the Democratic party. Their core base are coastal wine moms and reddit bots.",
            "title_similarity": "0.6136244",
            "sentiment_compound": -0.0992
        },
        {
            "id": "hv8e3iq",
            "score": 1,
            "text": "Neocon supportting other neocons. What is surprising about that? GWB is not in politics anymore - and Cheney and Murkowski will soon be given their walking papers too. The Rhinos will soon be extinct.",
            "title_similarity": "0.5072011",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hv8e52l",
            "score": 1,
            "text": "Well then, create a SuperPAC and give unlimited amounts…",
            "title_similarity": "0.36494938",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hv8er6v",
            "score": 1,
            "text": "Big daddy Bush has a bunch of no bid contract money left over I see.",
            "title_similarity": "0.4616155",
            "sentiment_compound": -0.296
        },
        {
            "id": "hv8evlq",
            "score": 1,
            "text": "Lmfao!  I haven’t like George W Bush this much since he was in, “You’re Welcome America. A Final Night With George W. Bush.”\n\n[Best Video Ever](https://www.amazon.com/gp/video/detail/B003V09VDS/ref=atv_dp_share_cu_r)",
            "title_similarity": "0.5448301",
            "sentiment_compound": 0.9259
        },
        {
            "id": "hv8f1wf",
            "score": 1,
            "text": "It's because they're the corporate scum. The same that run the DNC. Perverse establishment politicians. Trump challenged the established system of false choice that never changed anything and only lined their pockets.",
            "title_similarity": "0.6681564",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hv8fezu",
            "score": 2,
            "text": "Anything to cover up your doing's on 9/11 all so you could get your hands on free oil for your refineries!",
            "title_similarity": "0.50391823",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hv8fkp3",
            "score": 1,
            "text": "Cumon now children take tsk",
            "title_similarity": "0.2657941",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8fsb2",
            "score": 1,
            "text": "Disgusting.",
            "title_similarity": "0.046637274",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hv8fudl",
            "score": 1,
            "text": "Mask goes over your nose",
            "title_similarity": "0.119287804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8gnm2",
            "score": 1,
            "text": "Please clap",
            "title_similarity": "0.060094304",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hv8gttf",
            "score": 1,
            "text": "This man lives rent free in all your heads.",
            "title_similarity": "0.21946052",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hv8h21j",
            "score": 1,
            "text": "Good deal.... a Pub with a back bone and logic.  Imagine that",
            "title_similarity": "0.26023",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv8h2ju",
            "score": 1,
            "text": "Empty gesture. Giving money to a women who is fine with suppressing votes is not progress",
            "title_similarity": "0.42889622",
            "sentiment_compound": 0.0176
        },
        {
            "id": "hv8h6hf",
            "score": 1,
            "text": "Random, but does anyone recognize what brand of mask that is, that Dubya is wearing in that photo?",
            "title_similarity": "0.29305226",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8hqow",
            "score": 1,
            "text": "He’s donating to people he supports. So what?  Too bad others don’t do it publicly.",
            "title_similarity": "0.40070927",
            "sentiment_compound": -0.3102
        },
        {
            "id": "hv8hqqw",
            "score": 1,
            "text": "His mask is below his nose so… no thank you",
            "title_similarity": "0.09191266",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hv8i1iv",
            "score": 1,
            "text": "I don't give a fuck how far you think you've distanced yourselves from the Republicans, if you haven't left the party Fuck You.",
            "title_similarity": "0.604948",
            "sentiment_compound": -0.4419
        },
        {
            "id": "hv8ie35",
            "score": 1,
            "text": "“I suddenly respect Bush and Cheney, who I called N@zis during 2000-2008” \n-democrats 2021/2022.",
            "title_similarity": "0.5671274",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hv8ije8",
            "score": 1,
            "text": "I wish one day we could prosecute bush for all the shit he pulled along with Obama and trump and Biden.",
            "title_similarity": "0.6585963",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hv8jf6h",
            "score": 1,
            "text": "Weapons of mass destruction thinks someone should be impeached..This has got to be a joke..",
            "title_similarity": "0.4911272",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hv8jjbq",
            "score": 1,
            "text": "Guantanamo Bay going to be back in business?",
            "title_similarity": "0.26530915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8js1e",
            "score": 1,
            "text": "Nobody in the comments has yet mentioned that there is a personal contribution limit for Senators/President -- $2900.\n\nMeanwhile corporations can contribute an unlimited amount, thanks to Citizens United.\n\nSo thanks for the 2900 bucks Mr. President.  It's the thought that counts, I guess.",
            "title_similarity": "0.5580466",
            "sentiment_compound": 0.857
        },
        {
            "id": "hv8jxwf",
            "score": 1,
            "text": "He's a war criminal, who gives a fuck? Y'all foaming out the mouth really says a lot.",
            "title_similarity": "0.49689883",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hv8jzcq",
            "score": 1,
            "text": "Still upset he took little jebbie's turn?",
            "title_similarity": "0.28764385",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv8kmwd",
            "score": 1,
            "text": "That man was a dope - just like Biden.",
            "title_similarity": "0.26120502",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv8lb7r",
            "score": 1,
            "text": "3 shitty warmongers go to a bar….",
            "title_similarity": "0.3186482",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hv8lhfr",
            "score": 2,
            "text": "He should have spoken up long ago. This is too-little to-late for him and many others in the Republican Party.",
            "title_similarity": "0.46995592",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv8lswt",
            "score": 1,
            "text": "He’s still donating to Republicans, so let’s not start sucking each other’s dicks. These are the people who we forget are killing everything alongside Manchin and Sinema.",
            "title_similarity": "0.63145435",
            "sentiment_compound": -0.743
        },
        {
            "id": "hv8m97l",
            "score": 1,
            "text": "With the very system that legitimizes them in jeopardy at the whims of chaos, the lawful evil are lost. This makes perfect sense.",
            "title_similarity": "0.378339",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hv8mbo3",
            "score": 1,
            "text": "Ellen thinks he's a wonderful man.",
            "title_similarity": "0.18492797",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hv8mefy",
            "score": 1,
            "text": "Bush should stay confined to his ranch for getting us into an unnecessary war. And they lied to get us in. No WMDs. \nHe's an inside rhino. Go away, all the Bushies including Jeb who was \"brokering\" (raking off the top) the sale of water pumps being made available to the needy villages in Africa.\nAbsolutely rode his father's coattails.\nAnd the son involved in the banking scandal should have gone to jail.\nGO AWAY BUSH FAMILY. AS BAD AS THEIR DISGRACEFUL CHUMS, THE CLINTONS.",
            "title_similarity": "0.5654179",
            "sentiment_compound": -0.9471
        },
        {
            "id": "hv8mmdj",
            "score": 1,
            "text": "What about the money he and Chaney banked from their time in office ?",
            "title_similarity": "0.5066645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8mqtt",
            "score": 1,
            "text": "I guess even some war criminals don’t like Donald Trump.",
            "title_similarity": "0.5448867",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hv8n99x",
            "score": 2,
            "text": "Too little and probably too late since Dubya’s Presidential campaign was the first to legitimize the radical Evangelicals, Tea Party zealous and other right wing but job groups in a desperate bid to get votes and recast the Republican Party as it was known.",
            "title_similarity": "0.6573623",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hv8nhal",
            "score": 1,
            "text": "How about you support your own impeachment you fucking war criminal?",
            "title_similarity": "0.6276596",
            "sentiment_compound": -0.7328
        },
        {
            "id": "hv8o1vi",
            "score": 2,
            "text": "I know W wasn’t everyone’s favorite, but at least he was a Republican. Probably the last Republican president this country will ever sees. Trump destroyed the party once and for all. He spread his lies till the truth no longer mattered. He spewed his plague throughout the Republican Party, and across our country. I suppose someone with such a microscopic moral compass, needs that big of an ego to weaponize his insecurities against the world.",
            "title_similarity": "0.6604159",
            "sentiment_compound": -0.5346
        },
        {
            "id": "hv8o6r8",
            "score": 1,
            "text": "Who cares lmao put that fucker on trial",
            "title_similarity": "0.42242298",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hv8oa7z",
            "score": 1,
            "text": "people forget really quickly how horrible george bush is, he and cheney should be in prison",
            "title_similarity": "0.56620985",
            "sentiment_compound": -0.8387
        },
        {
            "id": "hv8og28",
            "score": 1,
            "text": "When you are responsible for killing a million people for no reason, gonna take a lot more charity than trying to make a fellow traitor look worse than you.",
            "title_similarity": "0.5734419",
            "sentiment_compound": -0.6494
        },
        {
            "id": "hv8qjdy",
            "score": 1,
            "text": "Very noble from the guy that co-conspired  9/11 😂",
            "title_similarity": "0.38238043",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hv8qjul",
            "score": 1,
            "text": "What a charming war criminal!",
            "title_similarity": "0.38195014",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hv8r6kd",
            "score": 2,
            "text": "I really hate that I like George right now...",
            "title_similarity": "0.2797281",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hv8rj6m",
            "score": 5,
            "text": "People forget that George W Bush is a war criminal, a mass murderer, he lied to the American people to start the 2003 Iraq War, even though most people didn't believe Bush's reason for the war, the scumbag Republicans majority in the U.S.Congress authorized the Iraq invasion. The news media all supported the war.\n\nThe war cost over $1 trillion, over 400,000 civilians killed during the invasion, over 1 million severely injured- loosing an eye, ear, nose, arm, leg. 2 million Iraqi refugees spread out between Jordan, Syria, Lebanon. Don't forget the Iraq war led to ISIS in Iraq and Syria that killed a million more civilians in Iraq & Syria, causing a destructive Syrian civil war with 2 million more refugees.\n\nLiz Cheney is a neo con who voted for the Iraq War and Patriot Act. She's a scumbag career politician, the same could be said about Lisa Murkowski from Alaska. So what if a war criminal like Bush gave to their reelection campaigns. Bush is a mass murderer of what he regarded as 2nd class citizens in Iraq so in his mind it was acceptable. Bastards!!!!",
            "title_similarity": "0.6524706",
            "sentiment_compound": -0.9979
        },
        {
            "id": "hv8t1zd",
            "score": 1,
            "text": "I swear elections used to happen way less often....",
            "title_similarity": "0.27689478",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hv8tbw8",
            "score": 2,
            "text": "Hooray for Bush and Cheney!  Please take me now, God!",
            "title_similarity": "0.42016324",
            "sentiment_compound": 0.8065
        },
        {
            "id": "hv8tf42",
            "score": 1,
            "text": "Centrists unite",
            "title_similarity": "0.23652998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv8u5vw",
            "score": 2,
            "text": "GW turned out to be a little OK after his term.",
            "title_similarity": "0.09635767",
            "sentiment_compound": 0.3899
        },
        {
            "id": "hv8ua17",
            "score": 1,
            "text": "Blood suckers.",
            "title_similarity": "0.27194464",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hv8xang",
            "score": 1,
            "text": "Appears to be a man that loves to beat the drums of war. Those old politicians see $$$ grow when war time comes. He lost his luster years ago. Now nobody cares what he says anymore. And no, nobody misses George Bush😑",
            "title_similarity": "0.5337202",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hv8xoy8",
            "score": 1,
            "text": "lol fuck you George bush, this is all because of you galvanizing the fundamentalist right \n\nFuck the Bush clan",
            "title_similarity": "0.62507385",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hv902fb",
            "score": 1,
            "text": "Mongers gonna mong.",
            "title_similarity": "0.29278374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv90ary",
            "score": 1,
            "text": "Go Lisa!",
            "title_similarity": "0.16116077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv90dcq",
            "score": 1,
            "text": "I guess he's found a new following for his \"with us or against us\" mindset over the years.",
            "title_similarity": "0.33893058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv90yth",
            "score": 1,
            "text": "Not surprised given the back and forth arguing between the two parties.",
            "title_similarity": "0.27393788",
            "sentiment_compound": -0.242
        },
        {
            "id": "hv91eqr",
            "score": 2,
            "text": "kinda funny since if there was any justice in the world, ol GW would have been impeached himself for starting the Iraq War and killing tens of thousands of innocents.",
            "title_similarity": "0.5708252",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hv91nl6",
            "score": 1,
            "text": "George, pull the fucking mask up, dude. Christ almighty.",
            "title_similarity": "0.33544403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv93eos",
            "score": 1,
            "text": "He he he, alright\n\n(Did anyone catch my bush impression?)",
            "title_similarity": "0.2972694",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hv9486u",
            "score": 5,
            "text": "Well I guess even a not to bright right wing frat boy with a hard on for war and oil can see what a cluster fuck trump is\n\nThat's actually quite telling\n\nI mean hippie types like me hated the oompah loompah from day one\n\nBut people like this guy actually putting money down (we all know how much they love money lol) that's a big step",
            "title_similarity": "0.5163375",
            "sentiment_compound": 0.8337
        },
        {
            "id": "hv94syv",
            "score": 1,
            "text": "It's insane that reddit is clamoring over the guy who started the Iraq war.  The fact people thing W is better than Trump is pretty unnerving tbh",
            "title_similarity": "0.62628716",
            "sentiment_compound": -0.128
        },
        {
            "id": "hv96dw8",
            "score": 4,
            "text": "Pepridge Farms remembers when This guy’s daddy pardoned those who participated in the Iran contra scandal to fund the Nicaraguan rebel groups which ultimately resulted in the crack cocaine epidemic and the basis for post 9-11 invasion of iraq. His daddy also appointed Barr as his AG to see it all through",
            "title_similarity": "0.67860585",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hv96w1x",
            "score": 2,
            "text": "The way he’s wearing his mask in the thumbnail is just so… Dubya. Kinda hilarious, actually. I recall those halcyon days when I thought I could not despise an American president any more than this man. Oh, how wrong was I.",
            "title_similarity": "0.5018794",
            "sentiment_compound": 0.0882
        },
        {
            "id": "hv9axpl",
            "score": 1,
            "text": "George bush is a war criminal",
            "title_similarity": "0.6028714",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hv9bvf9",
            "score": 1,
            "text": "Establishment loving clowns, and this comment section is full of Establishment bootlickers.",
            "title_similarity": "0.3307466",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hv9cjg1",
            "score": 1,
            "text": "k he's still a fuckin piece of shit who dragged us into an unnecessary conflict while giving his VP's former company no bid government contracts to rebuild the iraqi oil infrastructure",
            "title_similarity": "0.57606256",
            "sentiment_compound": -0.7322
        },
        {
            "id": "hv9d3dn",
            "score": 1,
            "text": "FYI Bush was worse than Trump. The destabilisation of Iraq, the rise of ISIS, Patriot Act, torture camps, illegal kidnappings etc",
            "title_similarity": "0.57826364",
            "sentiment_compound": -0.8429
        },
        {
            "id": "hv9eltf",
            "score": 1,
            "text": "Nice pic of gwb there haha",
            "title_similarity": "0.15904485",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hv9g24i",
            "score": 1,
            "text": "Bush is such a piece of shit",
            "title_similarity": "0.16987956",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hv9jat5",
            "score": 1,
            "text": "So my general synopsis is: the majority of people in here despise Trump…why?",
            "title_similarity": "0.3886595",
            "sentiment_compound": -0.34
        },
        {
            "id": "hv9nlvf",
            "score": 1,
            "text": "Just W's way of putting a bit of slappy slap on Trump.",
            "title_similarity": "0.51374626",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hv9nvkf",
            "score": 1,
            "text": "Bush was a crumy President . He is now showing his lefty beliefs  !!",
            "title_similarity": "0.6219856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv9pkbv",
            "score": 1,
            "text": "Hummm, isn't that something that everyone wants to move to Texas and Florida. Oh, I know why. Because of people like Ted Cruz. Just saying.",
            "title_similarity": "0.45186356",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hv9qn25",
            "score": 3,
            "text": "Mask over the nose please!",
            "title_similarity": "0.12904464",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hv9qrfg",
            "score": 1,
            "text": "I wonder how many people in out of the 70k upvotes have called murk a “literal nazi” in the last few months",
            "title_similarity": "0.4201877",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv9rbg0",
            "score": 1,
            "text": "When weed is legal and you're still like wtf?",
            "title_similarity": "0.28182995",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hv9rq5e",
            "score": 2,
            "text": "And here we are in a world were Bush has become a moderate.  \n\nHad you asked me 20 years ago ...",
            "title_similarity": "0.2797287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv9tihd",
            "score": 1,
            "text": "Could give two shits what happens in politics, basically bunch of bs, and annoyances.",
            "title_similarity": "0.61470646",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hv9tlgz",
            "score": 1,
            "text": "Liz Cheney is a Democrat in disguise. It's a waste of $$$$ because she will lose her reelection bid.",
            "title_similarity": "0.62582153",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hv9tv0h",
            "score": 1,
            "text": "Good. Now start supporting Democrats.",
            "title_similarity": "0.32597178",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hv9ukox",
            "score": 1,
            "text": "Boy  I was wrong Geo Wubbua is a real American! I really missed him during 2016 to 2020!",
            "title_similarity": "0.41839314",
            "sentiment_compound": -0.7333
        },
        {
            "id": "hv9vjeq",
            "score": 1,
            "text": "Everybody should Google the business plot",
            "title_similarity": "0.38592952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hv9xsff",
            "score": 1,
            "text": "Every Democrat that supports or thinks this is wholesome is a pathetic hypocritical clown and has the mental retention of a silica gel packet. This dude is a blatant war criminal that got away with it and should’ve been sentenced to capital punishment.",
            "title_similarity": "0.49823365",
            "sentiment_compound": -0.9413
        },
        {
            "id": "hv9zm4u",
            "score": 1,
            "text": "Well... someone has a soul after all!",
            "title_similarity": "0.04908413",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hva33h8",
            "score": 1,
            "text": "The Republican civil war is hillarious",
            "title_similarity": "0.5123118",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hva3ofc",
            "score": 1,
            "text": "Cool. The guy who opened the door for all the bullshit going on is buying indulgences.",
            "title_similarity": "0.46854946",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hva4ldp",
            "score": 1,
            "text": "Cheney should relocate asap because she is done in Wyoming next election.",
            "title_similarity": "0.46479475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hva6de2",
            "score": 1,
            "text": "That’s just the old guard of a disgusting, criminal party. Don’t let the horror of Trump outshine him, and somehow taint your memory of what a horrible president W was.",
            "title_similarity": "0.6249291",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hvaakko",
            "score": 2,
            "text": "And he's still a war criminal. Nothing he does will ever change that his administration is responsible for millions of deaths and tens of millions of displaced people. \n\nThere's no salvation from this. Sorry, not sorry.",
            "title_similarity": "0.4976012",
            "sentiment_compound": -0.8102
        },
        {
            "id": "hvacmld",
            "score": 1,
            "text": "Butcher Bush can’t even stand his own kind",
            "title_similarity": "0.20822558",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hvafgen",
            "score": 1,
            "text": "Aw... Dubs",
            "title_similarity": "0.14180224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvahf76",
            "score": 1,
            "text": "So now the Left is in alignment with the Republican establishment types…… interesting",
            "title_similarity": "0.39462638",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hvaq6du",
            "score": 1,
            "text": "Looks like The Enemy against Freedom Lives in many!",
            "title_similarity": "0.3983982",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hvaqdot",
            "score": 7,
            "text": "This is because George W.Bush has integrity,something Trump never had.",
            "title_similarity": "0.40815783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvawf7k",
            "score": 1,
            "text": "It's not very surprising that Dubya is supporting his VP who called A LOT of the shots during his administration's daughter, but then again, I wouldn't want to face the wrath of Dick Cheney, so I get it.",
            "title_similarity": "0.54761136",
            "sentiment_compound": -0.654
        },
        {
            "id": "hvaxz6s",
            "score": 1,
            "text": "He is just trying to cover his ass!",
            "title_similarity": "0.24120478",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hvb8b40",
            "score": 3,
            "text": "W is the happiest person 45 was elected. Raises him WAY out of the swamp.",
            "title_similarity": "0.2901001",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hvbq0q7",
            "score": 1,
            "text": "Hated him when he was president but have grown to love the sh*t out of him since lol",
            "title_similarity": "0.4187136",
            "sentiment_compound": 0.836
        },
        {
            "id": "hvbu9dt",
            "score": 1,
            "text": "Thank you, George!",
            "title_similarity": "0.19987254",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hvcfgdm",
            "score": 1,
            "text": "Texas oil tycoon club",
            "title_similarity": "0.4612043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvcj6g8",
            "score": 2,
            "text": "That's great and I fully approve, but still fuck GWB!",
            "title_similarity": "0.19570892",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hvcvgx7",
            "score": 1,
            "text": "Of all the former GOP presidents, I actually thought he was the better of any in recent history. He did not mince too much in politics, that's what lap dogs like Lindsey Graham were for.",
            "title_similarity": "0.4413526",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hvcwf09",
            "score": 1,
            "text": "TRUMP \"Make America Great Again, Again 2024\"",
            "title_similarity": "0.4649809",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hvd241g",
            "score": 1,
            "text": "Used to love Neil used to like Bush...can't stand them now",
            "title_similarity": "0.28311902",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hvd4u9x",
            "score": 3,
            "text": "Cool, but he’s still a war criminal",
            "title_similarity": "0.38911927",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hvdkzr5",
            "score": 1,
            "text": "Gonna be real sweet when ol G War Criminals party turns on him oh wait wasn’t one of trumps key points burying W?\n\nWhen is Biden gonna investigate the war crimes of W",
            "title_similarity": "0.6487611",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hvedna3",
            "score": 1,
            "text": "Hi",
            "title_similarity": "-0.011376757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvfmilm",
            "score": 1,
            "text": "Under no circumstances whatsoever do you \"have to hand it to\" George W. Bush.",
            "title_similarity": "0.40070254",
            "sentiment_compound": 0.25
        },
        {
            "id": "hvh6ek8",
            "score": 1,
            "text": "Does anyone really care about this story? I doubt President Trump will be the nominee as there are plenty of great republican candidates to begin the next chapter as  the new president. Obviously, they will have to be good a cleanup based on what we are seeing with the current administration.",
            "title_similarity": "0.6721051",
            "sentiment_compound": 0.8399
        },
        {
            "id": "hvhzs7r",
            "score": 2,
            "text": "This from the man who convinced us that Iraq had WMDs. He got it wrong and thousands of American men were killed and permanently disabled.   I have no respect for him since Trump pointed out his short sighted war that lasted 20+ years.",
            "title_similarity": "0.5771311",
            "sentiment_compound": -0.9072
        },
        {
            "id": "hvjr9bn",
            "score": 1,
            "text": "ITT the Left desperately scrabbles for a way to attack Donald Trump that doesn't prove them to be complete hypocrites, by praising a infamous War Criminal and Warmonger",
            "title_similarity": "0.67520785",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hvoczs2",
            "score": 2,
            "text": "The enemy of my enemy is my…. Damnit.",
            "title_similarity": "0.37543285",
            "sentiment_compound": -0.886
        },
        {
            "id": "hw2xbmq",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.016360108",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwa1vbm",
            "score": 1,
            "text": "Not surprising. The Neocons won’t die gracefully politically speaking.",
            "title_similarity": "0.3415808",
            "sentiment_compound": -0.3213
        },
        {
            "id": "hwiujlz",
            "score": 1,
            "text": "The Republican civil war makes me LoL",
            "title_similarity": "0.62118584",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hx09my3",
            "score": 1,
            "text": "Trump was spied on by Hillary Clinton's people. So media and Democrats lied about Trump. How is the economy doing compared to Trump term?",
            "title_similarity": "0.75790554",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hx8sfcp",
            "score": 1,
            "text": "George w knows trump is mini hitler. They’re trying to follow the slow moving rule of law to get this sociopath.",
            "title_similarity": "0.6210611",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxcqgko",
            "score": 1,
            "text": "I don’t understand why he doesn’t just come right out and denounce all things Trump as they relate to the Republican Party.",
            "title_similarity": "0.6592381",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxitoip",
            "score": 1,
            "text": "aint no way",
            "title_similarity": "-0.041301765",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hxlef22",
            "score": 1,
            "text": "how can this be possible everything into a single hand?",
            "title_similarity": "0.06820353",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxpmlig",
            "score": 1,
            "text": "Whether it was due to incompetence or malevolence, George W. Bush’s presidency was a failure and the man should not be rehabilitated. \n\nDid he do some good things like PEPFAR? Yes. Is it good that he rejects nativist Trumpism? Yes. But there is a good case to be made that the suffering he caused with the failure of his military adventurism and economic policy and the horrible precedent reinforced by his minority win in 2000 helped lead us to where we are now.\n\nI am not someone who believes we should imprison or execute him. He should be left alone to live the rest of his days far away from the halls of power. But please, stop acting like he is where we should set the bar.",
            "title_similarity": "0.62407446",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hxpsp1k",
            "score": 1,
            "text": "His daddy hated Trump for shaming Jeb out of 2016. Nothing to see here",
            "title_similarity": "0.502889",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hxs3b1d",
            "score": 1,
            "text": "Is hard for me to hate on Liz Cheney, I think she's hot!",
            "title_similarity": "0.41269788",
            "sentiment_compound": -0.6588
        },
        {
            "id": "hxuikj5",
            "score": 1,
            "text": "Did everyone just forget weapons of mass destruction? Government division is on point. 🐑",
            "title_similarity": "0.5870767",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hyivnvh",
            "score": 1,
            "text": "I thought we were to hate GW !",
            "title_similarity": "0.2643102",
            "sentiment_compound": -0.6114
        },
        {
            "id": "hyv6qrr",
            "score": 1,
            "text": "https://youtu.be/4KVaNKq_zkc",
            "title_similarity": "0.22498779",
            "sentiment_compound": 0.0
        }
    ]
}