{
    "Bernie Sanders says Trump's praise for 'Putin's murderous invasion of Ukraine' is 'outrageous'\n": [
        {
            "id": "hy9qr41",
            "score": 1,
            "text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "title_similarity": "0.50353354",
            "sentiment_compound": -0.3895
        },
        {
            "id": "hyamcl2",
            "score": -5,
            "text": "I watched as much of it as I could tolerate. He said things like “Putins not stoopid” but he definitely did not praise the invasion at all. He blamed Biden for weakness as one would expect, but he did not praise the invasion. There are plenty of real things to hate Trump for. Making up fake ones just distracts.\n\nEdit: ok I watched more of it. Bernie’s right. Trump should die in a fire.",
            "title_similarity": "0.6857997",
            "sentiment_compound": -0.985
        },
        {
            "id": "hy9rl9c",
            "score": 7,
            "text": "Always nice to hear from Bernie. His critiques are always sharp and his political instincts are top notch.",
            "title_similarity": "0.41838533",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyaly1w",
            "score": -19,
            "text": "I have to say this\n\nBernie is far from the only one saying this.  He was luke warm about calling out Putin and yet when he says something, the whole sub goes nuts.\n\nThis hero worshipping and idolization of a politician reeks of Trumpism (but for the other side of the coin).",
            "title_similarity": "0.76172817",
            "sentiment_compound": 0.4981
        },
        {
            "id": "hyat7aa",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.17154181"
        },
        {
            "id": "hyb0106",
            "score": -4,
            "text": "Dude, this sub is truly deranged. I come here trying to find the best and most pertinent political information, as it's literally /r/politics, and this is the type of stuff I see at the very top. You guys have to move on.",
            "title_similarity": "0.6167996",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hyax8mb",
            "score": 2,
            "text": "It’s amazing how the media is trying to spin the whole “trump actually supports this” narrative. Really trying to get a jump on the next election cycle with these asinine headlines.",
            "title_similarity": "0.6594768",
            "sentiment_compound": 0.743
        },
        {
            "id": "hy9rdai",
            "score": 1,
            "text": "Add it to the list, Bernie…",
            "title_similarity": "0.26240093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyalo50",
            "score": -33,
            "text": "He didn’t praise the invasion, he called Putin’s moves “smart”, indicating that for someone in Putin’s position with Putin’s goals, invading Ukraine in the manner that he did was an intelligent move and the current US admin should have seen it sooner. I doubt Bernie is that inept to not know this, but he and everyone else hates Trump, it’s just a shame this gets in the way of what was actually said.\n\nEDIT: I’m expecting downvotes, so if you disagree, kindly explain how and what Trump said that praises and supports this invasion.",
            "title_similarity": "0.7873815",
            "sentiment_compound": 0.4413
        },
        {
            "id": "hyar958",
            "score": -19,
            "text": "He didn’t really praise Putin so much as call Biden an idiot",
            "title_similarity": "0.45059824",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hyav2pa",
            "score": -15,
            "text": "He said \"I mean, he’s taking over a country for $2 worth of sanctions. I’d say that’s pretty smart.\"\n\nTrump wasn't really praising the invasion, he was mocking the Biden administration's response as in saying \"why in the world wouldn't Putin do this with such weak response.\" \nIf you don't get how Trump talks by now you're falling prey to the media's constant twisting of words.",
            "title_similarity": "0.74570984",
            "sentiment_compound": -0.3542
        },
        {
            "id": "hyaqebj",
            "score": -2,
            "text": "So is this headline. Outrageous that you would twist words into fitting into your narrative!",
            "title_similarity": "0.5898548",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hyak1av",
            "score": -21,
            "text": "Quick! Bernie said a thing! Post it to /r/politics and collect that sweet sweet karma!",
            "title_similarity": "0.57962954",
            "sentiment_compound": 0.783
        },
        {
            "id": "hyamcam",
            "score": -14,
            "text": "To admit an adversary is smart and even smart enough to outsmart your own stupid leaders is not “praise”.",
            "title_similarity": "0.47905022",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyane5z",
            "score": -9,
            "text": "Who cares what Bernie says?",
            "title_similarity": "0.30117354",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyap1wt",
            "score": 3,
            "text": "TL;DR - Trump said Putin using specific wording and waiting for Biden to be President was smart because he wouldn't do anything to stop him.\n\nIf you actually read/listen to the interview in full rather than the cut excerpts for clicks, Trump is actually saying that what Putin is doing is smart because he wanted to invade for a while and could have done it some time ago but he wouldnt until someone like Biden was in office who he \"knew\" wouldn't stand up to him or do anything about it and Putin could essentially bully him into standing down and allow Putin to do this.\n\n\"PRESIDENT TRUMP: Well, what went wrong was a rigged election and what went wrong is a candidate that shouldn’t be there and a man that has no concept of what he’s doing. I went in yesterday and there was a television screen, and I said, “This is genius.” Putin declares a big portion of the Ukraine — of Ukraine. Putin declares it as independent. Oh, that’s wonderful.\n\nSo, Putin is now saying, “It’s independent,” a large section of Ukraine. I said, “How smart is that?” And he’s gonna go in and be a peacekeeper. That’s strongest peace force… We could use that on our southern border. That’s the strongest peace force I’ve ever seen. There were more army tanks than I’ve ever seen. They’re gonna keep peace all right. No, but think of it. Here’s a guy who’s very savvy… I know him very well. Very, very well.\n\nBy the way, this never would have happened with us. Had I been in office, not even thinkable. This would never have happened. But here’s a guy that says, you know, “I’m gonna declare a big portion of Ukraine independent,” he used the word “independent,” “and we’re gonna go out and we’re gonna go in and we’re gonna help keep peace.” You gotta say that’s pretty savvy. And you know what the response was from Biden? There was no response. They didn’t have one for that. No, it’s very sad. Very sad.\"",
            "title_similarity": "0.57806396",
            "sentiment_compound": 0.9706
        },
        {
            "id": "hyapz02",
            "score": 10,
            "text": "Trump is on this news site everyday while not being the President. I’m starting to think this group loves him.",
            "title_similarity": "0.46917403",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hybescl",
            "score": -1,
            "text": "Correct me if I’m wrong, but it sounded to me like Trump was talking about the effectiveness of Putin’s strategy, not about the rightness of Putin’s decision. And unfortunately for everyone that isn’t Russia, it is effective. I mean, Trump immediately went on to say that it wouldn’t have happened under his administration and that it’s *sad that Biden “let it happen.”* Doesn’t that show he’s opposed to what Putin is doing, but he recognizes that it is effective for Putin to secure his own interests?\n\nTrump’s right on this one, Putin’s not dumb and he is using an effective tactic. Doesn’t mean that said tactic is the *right* thing to do.",
            "title_similarity": "0.6630585",
            "sentiment_compound": 0.9481
        },
        {
            "id": "hyal1e0",
            "score": 3,
            "text": "Pretty crazy.  And we still have right wing pundits and republicans supporting him.\n\n\n\n\nTraitors is what they should be called",
            "title_similarity": "0.66347617",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyakj9c",
            "score": 5,
            "text": "Lord - the ex pres just wants attention.  Don't give it to him.",
            "title_similarity": "0.37691718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya4e6q",
            "score": -19,
            "text": "Why the FUCK are they still talking about Trump? Do your fucking jobs you old farts, you wanted the power and you got it now man up and do something about it and stop talking about that orange fuck",
            "title_similarity": "0.6674617",
            "sentiment_compound": -0.873
        },
        {
            "id": "hybgzsf",
            "score": 0,
            "text": "Bernie the. Master of double speak. Lover of all things Russian.  This man has no shame.  Does no one ever look at the history of these guys and see their hypocrisy? Im no fan of the Donald but Bernie has been licking Russian boots his whole life.",
            "title_similarity": "0.57782704",
            "sentiment_compound": 0.2723
        },
        {
            "id": "hyafh4q",
            "score": 3,
            "text": "Not sure why trump hasn't been charged with treason yet. \n\nThey tried to assassinate poor Gerry Ford and Ronny Reagan and yet the orange one still breathes. There is no justice.",
            "title_similarity": "0.604199",
            "sentiment_compound": -0.846
        },
        {
            "id": "hyaqft4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.17154181"
        },
        {
            "id": "hyax3t2",
            "score": -9,
            "text": "Wait I thought Trump was supposed to start world war 3??? How come Biden is???",
            "title_similarity": "0.6037989",
            "sentiment_compound": -0.7059
        },
        {
            "id": "hyaq8yl",
            "score": 5,
            "text": "Click bait and yet fake news",
            "title_similarity": "0.47616512",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyau873",
            "score": 8,
            "text": "First day of Russia invading Ukraine and the top 5 stories on r/politics are still 4 Trump and 1 MTG.\n\nYou guys really are deranged.",
            "title_similarity": "0.67325664",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyag2lr",
            "score": -1,
            "text": "The mittens are coming off!",
            "title_similarity": "0.2634124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybhq56",
            "score": 2,
            "text": "What a shit fucking headline and shit fucking shit subreddit",
            "title_similarity": "0.5930522",
            "sentiment_compound": -0.9073
        },
        {
            "id": "hybhtgh",
            "score": -1,
            "text": "",
            "title_similarity": "0.0070758043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyartsx",
            "score": -3,
            "text": "Edit: I removed my analysis of the conversation that Trump had at the Mar-a-Lago event because it was unproductive. My goal was only to advocate consideration of the full context through listening to (link: https://m.youtube.com/watch?v=lTf-J1eOO7E ) or reading (link: https://www.clayandbuck.com/president-trump-with-cb-from-mar-a-lago/ ) the entire conversation.",
            "title_similarity": "0.58839196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyau5oc",
            "score": -3,
            "text": "1) Trump is a piece of shit. 2) It was tongue in cheek. \nThis is shitty journalism.",
            "title_similarity": "0.6575273",
            "sentiment_compound": -0.802
        },
        {
            "id": "hyaij4v",
            "score": -14,
            "text": "He said he outsmarted Biden and the world….and look at what’s happening….Putin says boo and the markets going into a free fall….oh we got really tough sanctions though …..give it a break ….Putin is kicking Biden ass right now….America looks weak as we did when Obama was in office. More to follow China and Iran ….well impose the ceremony sanctions but that is it",
            "title_similarity": "0.72729695",
            "sentiment_compound": -0.4672
        },
        {
            "id": "hyaxgfp",
            "score": -6,
            "text": "Bernie took his Honeymoon in communist Russia. Okay Bernie",
            "title_similarity": "0.39867818",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyas8gf",
            "score": 3,
            "text": "\"BUt bErNiE wEnT tO rUsSiA iN tHe ~~90's~~ 80'S\"\n\nYeah, the mayor of a town went to visit his sister city, imagine that.\n\nEdit: he went in the 80's, when it was still the USSR.",
            "title_similarity": "0.37585708",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyacor5",
            "score": -19,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyavzpt",
            "score": 5,
            "text": "The level of spin put on this is insane. I see why Dems are polling so poorly when this is what they do.",
            "title_similarity": "0.62094593",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyalv3h",
            "score": -3,
            "text": "thanks senator obvious",
            "title_similarity": "0.25648028",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hybbnim",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.17154175"
        },
        {
            "id": "hyb2wgd",
            "score": 0,
            "text": "BIDEN MADE A SPEECH, WHY THE FUCK IS BERNIE NEAR THE TOP OF ALL?  \n\n\nJesus Christ world war 3 is breaking out and y'all are still circlejerking about this guy. Un fucking believable.",
            "title_similarity": "0.63172036",
            "sentiment_compound": -0.765
        },
        {
            "id": "hyb6njv",
            "score": 1,
            "text": "If you sort by controversial you’ll find everyone who came here with a brain",
            "title_similarity": "0.3397989",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hya65uj",
            "score": 0,
            "text": "pee pee tapes",
            "title_similarity": "0.19171354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybxas0",
            "score": 0,
            "text": "Why we even talking about Trump. How is this even a thing still",
            "title_similarity": "0.46840173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc2gq5",
            "score": 0,
            "text": "Like that time Trump praised Castro.  Oh wait, that was Bernie.",
            "title_similarity": "0.41461548",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hyc3bgw",
            "score": 0,
            "text": "Praise? \nLol. \nOld man is bonkers.",
            "title_similarity": "0.38408628",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyc9t5x",
            "score": 0,
            "text": "Bernie should have been president",
            "title_similarity": "0.43627843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb640l",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.17154175"
        },
        {
            "id": "hyaupcl",
            "score": 1,
            "text": "If only Sanders and his supporters had not spent 6 months tearing down Hillary Clinton, maybe we wouldn’t be in this mess.",
            "title_similarity": "0.5939126",
            "sentiment_compound": 0.0065
        },
        {
            "id": "hya1k4a",
            "score": 7,
            "text": "Shower thought - Trump is Putin's goldfish",
            "title_similarity": "0.70161295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaa7a8",
            "score": 7,
            "text": "Trump is a treasonous snake to the western world that should be put in jail. But one or two weeks ago didnt Sanders also spout the fuckin russian’s propaganda rhetoric of NATO is the real villain here",
            "title_similarity": "0.7779477",
            "sentiment_compound": -0.8798
        },
        {
            "id": "hyaib20",
            "score": -9,
            "text": "We did it. We managed a way to divisively politicize ww3. Everybody go home, we won.",
            "title_similarity": "0.51948917",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyai5mm",
            "score": -1,
            "text": "It’s treasonous",
            "title_similarity": "0.46945137",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyav27n",
            "score": -1,
            "text": "Source to trumps quote?",
            "title_similarity": "0.41161853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybklwv",
            "score": -1,
            "text": "Bernie Sander's blowing more air continuing to be useless",
            "title_similarity": "0.25743365",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hybrw5q",
            "score": -1,
            "text": "Too bad that Bernie made up the thing about Trump praising the invasion.",
            "title_similarity": "0.74900913",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybyri6",
            "score": 1,
            "text": "This is the same guy who praised Castro right?",
            "title_similarity": "0.1920689",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyc3r93",
            "score": -1,
            "text": "He didn’t praise him.",
            "title_similarity": "0.155187",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyaf02c",
            "score": -12,
            "text": "Who cares what that guy thinks holy shit stop giving him a platform.",
            "title_similarity": "0.48762113",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyajr1b",
            "score": 5,
            "text": "So many people jumped on Bernie for saying that Cuba had a good literacy program, and now so many people defend Trump for a much worse comment lol",
            "title_similarity": "0.60251456",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyakmgq",
            "score": -9,
            "text": "Just fucking lol. Just last week Sanders was saying we have to show Russia a \"sphere of influence\". Sanders is a sad clown with no credibility on Russia.",
            "title_similarity": "0.73212755",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hyam7kw",
            "score": 5,
            "text": "I get why Sanders is saying it, but I'm just so tired of hearing about Trump and I don't care about what he has to say. His supporters will support him no matter what. His detractors won't, no matter what. And I don't think there's very many people genuinely still in the middle.\n\nLet him go preach to his cult. I'm tired of hearing about him, and I'm tired of not being surprised that he said or did something atrocious.",
            "title_similarity": "0.5125624",
            "sentiment_compound": -0.8975
        },
        {
            "id": "hyahk0g",
            "score": -2,
            "text": "once again, why are we talking about an irrelevant figure to our countries decisions…hes not the president anymore. this is ridiculous",
            "title_similarity": "0.5385796",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyaiwbt",
            "score": 0,
            "text": "I’m not biting. The dudes a fuck up, but I’m not playing the media games during this war.",
            "title_similarity": "0.38366818",
            "sentiment_compound": -0.8904
        },
        {
            "id": "hyak64y",
            "score": -2,
            "text": "It’s not just Trump, but every Republican who support Putin, which is probably most of the GOP.",
            "title_similarity": "0.55500627",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hyapyjr",
            "score": -2,
            "text": "Isn't this the guy who supported the USSR?\n\nEdit: [This you?](https://www.nbcnews.com/politics/2020-election/will-sanders-long-ago-praise-socialist-regimes-hurt-democrats-november-n1139811)",
            "title_similarity": "0.66356117",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hyaue5s",
            "score": -2,
            "text": "You know lies like this are interesting, mainly because trump condemned the invasion. Unfortunately lies like this will spread like wildfire among people who have utterly no idea what they are talking about.",
            "title_similarity": "0.7493372",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hyawuyf",
            "score": -1,
            "text": "Fuck Bernie Sanders and Donald Trump. Pacifist traitors.",
            "title_similarity": "0.734679",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyaxi3m",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.17154175"
        },
        {
            "id": "hyb0l7f",
            "score": -2,
            "text": "Bernie's the biggest communist sympathizer the US has going..",
            "title_similarity": "0.5887406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb1wmx",
            "score": -2,
            "text": "Why do we keep talking about Trump? Why? How does it help anything at all? Just ignore him and let his influence die out.",
            "title_similarity": "0.5102303",
            "sentiment_compound": -0.6416
        },
        {
            "id": "hyb676b",
            "score": -2,
            "text": "Says the dude who was like you know Putin has some fair complaints like stfu",
            "title_similarity": "0.6773875",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyb73b5",
            "score": -3,
            "text": "2014 Obama let’s Russia walk in and take Crimea,\n2022 Biden let’s Russia take the rest of the country.  Obama, Biden and the Democrat officials are working for Putin",
            "title_similarity": "0.63840884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybcb1o",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hybclnl",
            "score": -2,
            "text": "Wasn’t he just taking a jab at how light the repercussions are for Russia?",
            "title_similarity": "0.7250108",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybd4p1",
            "score": -2,
            "text": "I’m not on trumps side here but I listened to the audio, poor words but I don’t think he’s praising the actions but being facetious.",
            "title_similarity": "0.438913",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hybitg9",
            "score": -3,
            "text": "Didn’t Bernie have a vacation in the USSR?  A honeymoon I think ?",
            "title_similarity": "0.39442223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybmssy",
            "score": -3,
            "text": "Coming from the guy who literally complimented China’s ability to get things done and who was also romanticizing the Russian way",
            "title_similarity": "0.5190542",
            "sentiment_compound": 0.743
        },
        {
            "id": "hyarc17",
            "score": -10,
            "text": "Well, someone should point out this well known Socialist ideologue was basically an agent of the former Soviet Union, but why should we be surprised that throngs of leftists are attempting to gaslight the public? Russia has an economy around the size of Italy. It would very much like to project a bigger image and certain people help inflate this myth for their own dubious narratives. \n\nThe fact of the matter remains that Russia seized Crimea under Obama, did nothing under Trump, and have invaded Ukraine under Joe Biden. Real results matter far more than political misdirection. \n\nMore to the point, under Obama, the U.S. bombed Libya and flew cover for al-Qaeda creating an additional influx of migrants into Europe and a complete descent of the country with Islamists opening up slave markets for blacks. As if this wasn't enough, Obama again wanted to duplicate his disastrous and destructive military intervention in Syria that literally gave rise to an Islamic Caliphate.",
            "title_similarity": "0.7789252",
            "sentiment_compound": 0.1167
        },
        {
            "id": "hyazbzb",
            "score": -9,
            "text": "He didn't praise the invasion , he said he was a genius for the way he did it.  It's possible to admire ones enemies tactics without supporting the enemy.   Patton did it all the time in WW2",
            "title_similarity": "0.56719506",
            "sentiment_compound": -0.3777
        },
        {
            "id": "hya6le6",
            "score": 3,
            "text": "It is. Good insight into the broken mind of the maga “conservative”",
            "title_similarity": "0.46914065",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyayuts",
            "score": -5,
            "text": "Lmao, deranged Reddit as usual",
            "title_similarity": "0.580572",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyb77hk",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyb7h3w",
            "score": -3,
            "text": "Does anybody actually look up what was actually said anymore, or do they just go off of headlines? Trump was in no way praising the invasion of Ukraine. He said Putin’s strategy was smart, mostly because Putin knows the west can’t do anything because they are reliant on Russia’s resources. Then he said it’s sad that Biden won’t stand up to him, and that it never would’ve happened if he were still in office.",
            "title_similarity": "0.6826957",
            "sentiment_compound": -0.6059
        },
        {
            "id": "hyb7ojy",
            "score": -2,
            "text": "This sub is completely worthless.",
            "title_similarity": "0.26923656",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hyb87jd",
            "score": -4,
            "text": "Didn’t trump basically say that it was bold and not necessarily praising it? Because it is bold to be fair",
            "title_similarity": "0.5291538",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hyb8m3i",
            "score": -4,
            "text": "It sounded sarcastic to me. Like “yeah, they’re really gonna keep the peace. Sure.”  So I don’t think Bernie listens to the interview at all.",
            "title_similarity": "0.36607885",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyawkwr",
            "score": -7,
            "text": "Over a year out of office and all these people can do still is talk about Trump 🙄I swear majority of republicans have moved on from Trump already but majority of democrats sure haven’t, the left talks about Trump like 100x more than the right does.",
            "title_similarity": "0.43439132",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyb81id",
            "score": -6,
            "text": "Y’all still blaming trump in here, huh?",
            "title_similarity": "0.6411438",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyad8mn",
            "score": 0,
            "text": "Just call him what he is, a fucking traitor, and i'm not even american.",
            "title_similarity": "0.5715381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaizvg",
            "score": 0,
            "text": "This is a mild word to use but it's at least the direction!! Trump needs to be go down i  history as a man he really is... a Russian spy!",
            "title_similarity": "0.66801745",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyao8he",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyaopzn",
            "score": 0,
            "text": "this idiot supported castro and calls che guerrera a freedom fighter. he also was a huge proponent of the Venezuelan dictator who was killing and starving his own people. trump is a dildo but come on",
            "title_similarity": "0.68048155",
            "sentiment_compound": -0.1406
        },
        {
            "id": "hyapo27",
            "score": 0,
            "text": "While I 100 percent agree with him it's not thebtime to be distracted by Trump.  Now is the time to push our current regime to go after all of putting assets and also cut Russia off of awift.",
            "title_similarity": "0.6549293",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyb0mis",
            "score": 0,
            "text": "He’s still alive? 🤔",
            "title_similarity": "0.011637714",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyb53pj",
            "score": 0,
            "text": "Aside from some very strange Fox commentators, and some Russophiles, has ANYONE praised Trump over this?\n\nI believe that at least one Fox talking head cutaway when Trump started obsessing about stolen elections in the middle of asking him about the Ukraine invasion.",
            "title_similarity": "0.7612015",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hyb56rp",
            "score": 0,
            "text": "Context",
            "title_similarity": "-0.009137089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybamav",
            "score": 0,
            "text": "Did Trump praise Putin's invasion or Ukraine or just say that Putin was a smart guy?\n\nDoes no one else here remember Bernie Sanders fail to condemn communism/Cuba and only offer praise for a regime steeped in human rights abuses and its own style of genocide?",
            "title_similarity": "0.79565793",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hybb4ej",
            "score": 0,
            "text": "Would Bernie feel better if he called Putin a moron who hoodwinked and sucked in Biden and his mob.  Bernie should want to know if Putin has information on his son’s complicity with the president in their cooperative criminal operations in Ukraine - bribing a president to fire a prosecutor investigating his son, for example.  SERVAMUS",
            "title_similarity": "0.78369504",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hybbxj5",
            "score": 0,
            "text": "Bernie in 5 years if alive: US bad, why does US impose sanctions, free russia!",
            "title_similarity": "0.58705163",
            "sentiment_compound": 0.126
        },
        {
            "id": "hybcb19",
            "score": 0,
            "text": "Gullible ass noobs",
            "title_similarity": "0.38507104",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hybcjiu",
            "score": 0,
            "text": "What’s outrageous is that I’m still hearing shit trump says. Cut the cord and let him blab into an abyss. It would not be hard to fake.",
            "title_similarity": "0.62244403",
            "sentiment_compound": -0.8886
        },
        {
            "id": "hybhn19",
            "score": 0,
            "text": "Good thing we elected Biden who hasen't commented on this statement. ElEcTaBlE as always.",
            "title_similarity": "0.32811767",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hybiins",
            "score": 0,
            "text": "Yo Bernie, you misspelled treasonous",
            "title_similarity": "0.62109685",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hybj5ze",
            "score": 0,
            "text": "This headline is just a lie",
            "title_similarity": "0.40311158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybj7ax",
            "score": 0,
            "text": "I think the point being, you have a leader(Putin) that knows what his country needs/wants.  And he is leading their country in a way where little other countries can or are willing to do matter.  \n\nOther countries remain without taking action. Sanctions won’t stop them.  \n\nOur current president is too weak to do what is necessary to help Ukraine.  Everyone watches and talks like they care but really don’t do anything.",
            "title_similarity": "0.52588916",
            "sentiment_compound": 0.296
        },
        {
            "id": "hybk9f7",
            "score": 0,
            "text": "We need to intervene with a military presence",
            "title_similarity": "0.23699588",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybm8fe",
            "score": -4,
            "text": "😂 Bernie just sour that no one listens to his communist ass on these topics",
            "title_similarity": "0.44400388",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hybrf13",
            "score": 0,
            "text": "Sounds like Trump is trolling everyone again.",
            "title_similarity": "0.55049706",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hybu3cd",
            "score": 0,
            "text": "Stfu about Trump already",
            "title_similarity": "0.50779426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybum4w",
            "score": 0,
            "text": "Trump was being sarcastic, it’s so funny how people think he was actually praising Putin.",
            "title_similarity": "0.8061135",
            "sentiment_compound": 0.6901
        },
        {
            "id": "hybur36",
            "score": 0,
            "text": "Trump did no such thing. What he said was taken completely out of context. Stop with the lying folks.",
            "title_similarity": "0.5580576",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hybuzp6",
            "score": 0,
            "text": "octogenarian socialist",
            "title_similarity": "0.26510984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybv7ig",
            "score": 0,
            "text": "I really don’t get the weird take on the comment. It was stupid yeah but it pretty obvious from how he said it and how he said “I’ve never seen that many tanks” that he wasn’t pro Russia.",
            "title_similarity": "0.5723982",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hybvvw9",
            "score": 0,
            "text": "No wars under Trump hmm!",
            "title_similarity": "0.26799205",
            "sentiment_compound": 0.4966
        },
        {
            "id": "hybxy3m",
            "score": 0,
            "text": "Seems disingenuous coming from someone who praised Russia his entire life. Bernie is just an ass. Trump, Biden and their sons on the other hand have hands so dirty no degreaser could clean them off.",
            "title_similarity": "0.65870285",
            "sentiment_compound": -0.158
        },
        {
            "id": "hyc0hcg",
            "score": 0,
            "text": "Wow this is enlightening. I have some land in Florida I want to sell you guys. Educate your self. Your making fools of yourselves.",
            "title_similarity": "0.47415507",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyc20pc",
            "score": 0,
            "text": "You’ve somehow made this about trump instead of discussing the current situation, administration or just maybe the citizens of Ukraine. You’re all pretty much scum, tone def single agenda scum",
            "title_similarity": "0.71347266",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyc247l",
            "score": 0,
            "text": "“He was going to be satisfied with a piece and now he sees the weakness and the incompetence and the stupidity of this administration” 💯",
            "title_similarity": "0.54521763",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyc2n1y",
            "score": 0,
            "text": "Bernie Sanders admitted his 2001 vote as a member of the U.S. House of Representatives to authorize the invasion of Afghanisan",
            "title_similarity": "0.50419223",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyc44wd",
            "score": 0,
            "text": "My family was not happy when I voted for Biden, I think they're starting to have a change of heart",
            "title_similarity": "0.42442048",
            "sentiment_compound": 0.2964
        },
        {
            "id": "hyc490u",
            "score": 0,
            "text": "This all started when the NATO at the behest of the US decided to push eastward after agreeing that it wouldn’t. Of course Russia will see the expansion NATO closer to its border as a security and existential threat. Also how can you even trust the west when they’ve already went back on their word? Imagine if Russia decided it wanted to place missiles in mexico. The US would respond literally the same way in fact it did when the Soviets made an agreement to place missiles in Cuba.\n\nNeither side wants to compromise. Both sides see it as a 0 sum game.",
            "title_similarity": "0.61996037",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hyc61m7",
            "score": 0,
            "text": "Anyone that actually listened to Trump's interview knows the context and therefore knows the media is using his comments out of context. Especially the part they leave out where he says how wrong and horrible it is. \n\n\nIf you don't like Trump that's fine but dislike him for the things he actually did not what the media lies about. \n\nSo many lazy people just believing everything they hear. How haven't you learned by now?",
            "title_similarity": "0.6031018",
            "sentiment_compound": -0.9363
        },
        {
            "id": "hyc6pah",
            "score": 0,
            "text": "Why are we still talking about Trump like he matters at all!?",
            "title_similarity": "0.48935753",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hyc7dnp",
            "score": 0,
            "text": "What a stupid old fart. Trump didn’t praise him. He understood what he did. I fail to see this as a “bad” thing. He didn’t see it as right or moral, he saw it as what it was: playing the West like a Stradivarius. He gained an entire country for nothing. The sanctions will mean dick. The Chinese can give him money to beat the sanctions. They’re already buying Russian coal. And if Europe isn’t going to stand up to Russia, fuck it.",
            "title_similarity": "0.6916927",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyc8hg5",
            "score": 0,
            "text": "Lol Bernie… Mr. Soviet Union himself!",
            "title_similarity": "0.5363121",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hyc8kq1",
            "score": 0,
            "text": "What did Trump say that was praising Putin?",
            "title_similarity": "0.66459453",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hycbnlo",
            "score": 0,
            "text": "He never sided with them",
            "title_similarity": "0.16618867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycbyvv",
            "score": 0,
            "text": "   Of course Trump and his backers would jump all over this. To be certain most would. Any person that wants to be President would love to see this fail. What would be a better issue? Yes I can't stand Trump and all the backers in congress he has. All the backers he has around the country are pathetic and 90% are racists. Ho they may say they are not, but they are !!! From the small towns to the large cities. It is race that drives the Trump people. You can see so clear. How many people of color do you see at his rallies? Ho you say what does that have to with President Putin? Well a lot. He has taken this as a sign of American weakness. Oh yes Hitler did the same, as many right wing Republicans thought, now this man get's things done. He is all business. They did all they could to keep America OUT of WWII. How is this different? Yes maybe if the waist or Joe would have signed the paper that states NATO will NOT into Ukraine. Now if he was being honest about pulling back that would have been a small price. Now do not think for one minute that is just what Trump had his backers are going to say. Yes I might be wrong. But if this continues to escalate, then Trump will be right. You just might see him in that White House for 4 more years. What do you think?",
            "title_similarity": "0.66121536",
            "sentiment_compound": 0.9522
        },
        {
            "id": "hycc9hj",
            "score": 0,
            "text": "There is a very real conflict occurring, but yes, let’s talk about a narcissistic ex-President and a man who failed to even meet him in an election.",
            "title_similarity": "0.5951657",
            "sentiment_compound": -0.3998
        },
        {
            "id": "hycf5vd",
            "score": 0,
            "text": "Y’all really don’t see who’s to blame? Lol.",
            "title_similarity": "0.3552363",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hycjozj",
            "score": 0,
            "text": "Keep seeing people mentioning Trump and...honest to God, I don’t give a shit about him. He’s irrelevant just like Hillary is. \n\n\nAlso, the only reason I’m commenting on this is because I keep seeing posts about it.",
            "title_similarity": "0.5569507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycph8g",
            "score": 0,
            "text": "If “the bern” said it than the whole thing is pure horseshit! He is a communist lying useless rat bastard. He is anti-America n a never Trump pos that has no business in America let alone in our Congress with his hatred for our Constitution. He needs to move to cuba venezuela or china n forgets all about the USA.",
            "title_similarity": "0.64886713",
            "sentiment_compound": -0.9545
        },
        {
            "id": "hycr1n6",
            "score": 0,
            "text": "It’s reasonable to think all these things when the media only gives you half of story but NATO has been recruiting the country’s surrounding  Russia trying to block off Russia to the sea which is I guess good for us but terrible for them considering those NATO allies have missiles on the border to Russia Putin has been telling everyone for years and years that they don’t want Ukraine to join nato for that reason do United States actually did the exact same thing during the Cuban missile crisis because we didn’t want to have nukes 50 miles off the coast of Florida because it would be entirely dangerous the Americans and Russia is literally surrounded by NATO country’s search up the Bay of Pigs it’s where we actually got caught.",
            "title_similarity": "0.666808",
            "sentiment_compound": -0.8397
        },
        {
            "id": "hydh7r7",
            "score": 0,
            "text": "Democrat fools..u just don't get it do you...never would have happened under Trump..it's good Putin did that..he can do anything g he wants it just shows how weak and pathetic this administration really is..we will never get anywhere with dems..they say yes to everything and have no answer for any if it..",
            "title_similarity": "0.60911465",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hydmteu",
            "score": 0,
            "text": "Having read the comments in this post, I can best describe them as hate speech. For Bernie to have anything to say about Trumps praise of Putin is so, \"Outrageously hypocritical.\" He went to Russia to honeymoon and visit a sister city and while there praised Russia.\n\n \"I did not see a hungry child. I did not see any homeless people,” Sanders said after his visit to the Soviet Union. He's also praised the Soviet Union's transportation system and defended Cuban dictator Fidel Castro for his efforts at improving education and health care.\n\n\"The revolution there is far deeper and more profound than I understood it to be. It really is a revolution in terms of values,\" he said of the Cuban revolution.\n\nSo who is Sanders to criticize anyone, when he has praised Russia for decades.",
            "title_similarity": "0.64066267",
            "sentiment_compound": 0.9393
        },
        {
            "id": "hye2hl2",
            "score": 0,
            "text": "It is completely Biden and democrats fault that Putin is in Ukraine..well known and weak leadership has allowed thus to happen.Now China will take Taiwan soon..is would never have happened under Trump..a great war could happen because of dems in office..they ate absolutely to blame..you can't blame Putin because he has the doing what he always wanted but could not because of stromg deterrence in leadership..pathetic dems in office have no clue",
            "title_similarity": "0.69106793",
            "sentiment_compound": -0.6101
        },
        {
            "id": "hyelwen",
            "score": 0,
            "text": "Odd comment from a socialist who spent his honeymoon in Russia.",
            "title_similarity": "0.47863993",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyagmtm",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.17154175"
        },
        {
            "id": "hy9xpah",
            "score": -45,
            "text": "Bernie is just mildly covering his ass—he’s always been pro Russia—don’t trust him.",
            "title_similarity": "0.6499984",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyaxunh",
            "score": -5,
            "text": "What Donald Trump said is the truth when he was in office Putin will not have tried to invade a European country. This is sickening. We have a week leader who will not stand up to the truth which is that pipeline should have been blown up. Not allowed to be built but what's so soft that we allowed him to get $3 billion an hour in oil sales from the rest of Europe. the west is broke and Putin and China know they can make moves and they are going to sanctions will not work.",
            "title_similarity": "0.6079812",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hy9uzyt",
            "score": -12,
            "text": "Bernie. Peruse through your dictionary and come up with something more acrimonious than “outrageous.” You can look up the F section too.",
            "title_similarity": "0.41706812",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hyalsqj",
            "score": 1,
            "text": "If you or someone you know thinks war is cool and exciting.\n\nGo and watch the tv series \"A Band of Brothers\" and \"The Pacific\"\n\nWar is Hell",
            "title_similarity": "0.6098013",
            "sentiment_compound": -0.836
        },
        {
            "id": "hyapj1r",
            "score": -1,
            "text": "Those blood will be also on Nato/America hands. Great idea let Ukraine join the nato, now joking is on US. “Suction really works”.",
            "title_similarity": "0.7007555",
            "sentiment_compound": 0.802
        },
        {
            "id": "hyaqo1g",
            "score": -1,
            "text": "Do these characters also battle like pokemon?\n\nWhat moveset would they have 🤔",
            "title_similarity": "0.34589407",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyar3wd",
            "score": 1,
            "text": "I missed it. Trump PRAISED the invasion?",
            "title_similarity": "0.59275734",
            "sentiment_compound": 0.4084
        },
        {
            "id": "hyarccy",
            "score": -1,
            "text": "Then do something about or shut the fuck up. Too much talk, and no action in my opinion. So tired of hearing all these politicians say shit without results. I am so done caring about this noise. I don’t care what that orange goblin has to say as well as what our geriatric government has to say. Fucking, Christ!",
            "title_similarity": "0.5279265",
            "sentiment_compound": -0.6762
        },
        {
            "id": "hyaujdi",
            "score": -1,
            "text": "Read the room",
            "title_similarity": "0.039912224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyauobj",
            "score": 1,
            "text": "And that's coming from the devil!",
            "title_similarity": "0.5655432",
            "sentiment_compound": -0.69
        },
        {
            "id": "hyavgpw",
            "score": 1,
            "text": "The death of the USA is looming. Dems will lose primaries and then lose the Presidential election in 2024. Our inability to hold a former President accountable for his crimes and actions is going to doom us. I no longer have faith in this country, especially the laws and systems that protect even the most subhuman scum. Home of the brave my ass.",
            "title_similarity": "0.6467171",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hyay6ah",
            "score": 1,
            "text": "Just a few days ago he echoed Russian talking points defending that they’re entitled to a sphere of influence",
            "title_similarity": "0.49779734",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyaz1qq",
            "score": 1,
            "text": "https://www.politico.com/story/2015/07/obama-offers-praise-of-putin-120127\n\n\nOutrageous",
            "title_similarity": "0.6953132",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyb0e0t",
            "score": -1,
            "text": "This is just a reminder that the 2 times Putin has invaded Ukraine, Trump was not president.",
            "title_similarity": "0.6149487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb1tcr",
            "score": -1,
            "text": "It’s a clip taken out of context. Just watch the full interview it’s online.",
            "title_similarity": "0.3477716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb2qpd",
            "score": -1,
            "text": "Get a room no one cares",
            "title_similarity": "0.17570257",
            "sentiment_compound": -0.569
        },
        {
            "id": "hyb32t4",
            "score": -1,
            "text": "....why is this relevant news, and why is it upvoted?",
            "title_similarity": "0.3433808",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb3fqa",
            "score": -1,
            "text": "He said it was tactically genius, by that it was a good thing to do. I can say that Hitler’s blitzkrieg  was tactically genius, doesn’t mean I support him",
            "title_similarity": "0.5819202",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyb563t",
            "score": -1,
            "text": "What's this communist saying? Cheering for putin and URSS comeback?",
            "title_similarity": "0.66679645",
            "sentiment_compound": 0.5661
        },
        {
            "id": "hyb5vwx",
            "score": -1,
            "text": "It is obvious no one here is aware of the full statement that Trump made",
            "title_similarity": "0.44299325",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyb64zv",
            "score": -1,
            "text": "This is just spin to take the focus off the outrageous failure of the current administration.",
            "title_similarity": "0.6025828",
            "sentiment_compound": -0.743
        },
        {
            "id": "hyb68la",
            "score": -1,
            "text": "I don’t think he was saying he’s happy about what Putin is doing. Just saying that Putin is effective. I hate that motherfucker but if he wasn’t effective, none of this would be happening.",
            "title_similarity": "0.6628678",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyb9kjt",
            "score": -1,
            "text": "Gotta suck the teet that feeds him.",
            "title_similarity": "0.3579652",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hybb6mw",
            "score": 1,
            "text": "Bernie is the GOAT",
            "title_similarity": "0.2173076",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybbeug",
            "score": 1,
            "text": "Bernie 2024!",
            "title_similarity": "0.157932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybbpvo",
            "score": -1,
            "text": "\nOk lol lol lol lol mop m\n\n\nM",
            "title_similarity": "0.29594088",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hybbqoh",
            "score": -1,
            "text": "Pop pop\nKokomo\nNo\nPool\n\n\nI\nL pollo\n\nM mom\n\nM",
            "title_similarity": "0.2965428",
            "sentiment_compound": 0.368
        },
        {
            "id": "hybd484",
            "score": -1,
            "text": "Again, what you gonna do",
            "title_similarity": "0.11228762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybg536",
            "score": 1,
            "text": "No really? Trump is siding with the person in the Wrong?",
            "title_similarity": "0.578879",
            "sentiment_compound": -0.6868
        },
        {
            "id": "hybgjn8",
            "score": -1,
            "text": "Can anyone provide a link showing where Trump praised Russia's actions?",
            "title_similarity": "0.61409616",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hybgmxa",
            "score": -1,
            "text": "Wow what a brave and daring take. \n\n\"The world thinks the invasion of Ukraine is bad. \"",
            "title_similarity": "0.84441435",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hybk8w8",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hybkh8e",
            "score": -1,
            "text": "Tough talk coming from a draft dodger",
            "title_similarity": "0.4237981",
            "sentiment_compound": -0.128
        },
        {
            "id": "hybkq82",
            "score": -1,
            "text": "Putin took full advantage of biden mess up at Afghanistan and the CCP might do the same to Taiwan, underestimate your opponents at your own risk Senator.",
            "title_similarity": "0.74912333",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hybl2g9",
            "score": -1,
            "text": "I have seen so many far left tankies screaming at Bernie for daring to criticize Putin. \n\nEvery day, those far left groups become more and more like the far right we're having to deal with. Their talking points are literally identical on this day (on how they think Russia is amazing and also clearly Biden is at fault for something).\n\nIf you want to see some examples of the above, just look at the replies to Bernie's tweet against Putin: https://twitter.com/SenSanders/status/1496225554588213248",
            "title_similarity": "0.7005887",
            "sentiment_compound": 0.6659
        },
        {
            "id": "hybm91k",
            "score": -1,
            "text": "Is this seriously something that warrants a post and this many comments?",
            "title_similarity": "0.26668325",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hybpjvi",
            "score": 1,
            "text": "54 thousand upvotes for Bernie saying what every Dem said days ago.",
            "title_similarity": "0.24701273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybs1qu",
            "score": -1,
            "text": "Bernie always giving everyone else shit and never does anything about anything!!",
            "title_similarity": "0.32250345",
            "sentiment_compound": -0.4184
        },
        {
            "id": "hybs4yh",
            "score": -1,
            "text": "From what i saw, the whole context was that it was \"genius\" for them to attack ukraine something blah blah blah that Biden wouldn't stand up to Putin, and that this wouldn't have happened under his control. I mean, i disliked and him and voted for biden, but trump was the only president of the last 4 who didn't have Russia invade/attempt. This has been Biden's fault and we should treat it as such instead of worrying about a has-been president",
            "title_similarity": "0.7337573",
            "sentiment_compound": -0.765
        },
        {
            "id": "hybst6m",
            "score": -1,
            "text": "Trump lives in this subreddits head rent free",
            "title_similarity": "0.24169908",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hybt5oi",
            "score": -1,
            "text": "What the F does old man Bernie know?",
            "title_similarity": "0.26439753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybu12h",
            "score": -1,
            "text": "Bernie trying to be relevant",
            "title_similarity": "0.19604158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybwf41",
            "score": -1,
            "text": "Trump didn’t say he approved of it he said it was a smart tactic, he never said it’s something he would do. I’m not saying I like trump I’m just sick of all the twisting of words when it’s so clear if you read it for yourself",
            "title_similarity": "0.56201696",
            "sentiment_compound": 0.5356
        },
        {
            "id": "hybxhuw",
            "score": -1,
            "text": "Gee, brave take, Bernie",
            "title_similarity": "0.28207773",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hybxihi",
            "score": -1,
            "text": "This is bullshit liberal news.",
            "title_similarity": "0.5335437",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hybyohb",
            "score": -1,
            "text": "And once again he’s right.",
            "title_similarity": "0.17448974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybzybi",
            "score": 1,
            "text": "I’m just going to put this here. The Trump and Biden are two of the WORST presidents in history. Im fairly republican but both Trump and Biden make me miss Obama",
            "title_similarity": "0.6414157",
            "sentiment_compound": -0.5881
        },
        {
            "id": "hyc0ly7",
            "score": -1,
            "text": "Way to flip the facts to fiction by ignoring context. He never praised or applauded Putin. He said it was smart and savvy for Putin to do what he is doing because he has weak leaders opposing him. Any historian would agree. He certainly didn’t applaud him and Putin certainly didn’t try this crap when Trump was in office.",
            "title_similarity": "0.54995584",
            "sentiment_compound": -0.0869
        },
        {
            "id": "hyc24kx",
            "score": -1,
            "text": "Except this is all on the current administration but whatever",
            "title_similarity": "0.20005071",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc3wae",
            "score": 1,
            "text": "STFU Bernie",
            "title_similarity": "0.20270948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc4lxy",
            "score": -1,
            "text": "One reason I hate Trump is his support to Putin .else I am ok with him",
            "title_similarity": "0.7386118",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyc6dli",
            "score": -1,
            "text": "Says the guy who honeymooned in the USSR!!!",
            "title_similarity": "0.38822454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc8jkt",
            "score": -1,
            "text": "Who cares what BS has to say. All mouth and no action but more mouth. BS is a millionaire with denial issues.",
            "title_similarity": "0.5066376",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyc9gdj",
            "score": -1,
            "text": "When dir he praise him?",
            "title_similarity": "0.25905815",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hycbr8p",
            "score": -1,
            "text": "Downvote my comment if you think trump meant to genuinely praise Putin and NOT draw a contrast between the Russian’s craftiness and sagacity versus joe biden’s senile impotency and lack of spine. Also you may downvote if you had no idea what I just said despite reading it.",
            "title_similarity": "0.7083954",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hycig47",
            "score": 1,
            "text": "Bernie praised the Soviet Union even had his honey moon in Moscow during the Cold War. He would be for the reuniting of the Soviet Union.",
            "title_similarity": "0.5611775",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hycpnr5",
            "score": -1,
            "text": "Apparently Americans are only allowed to cheer when America is doing the Invading  and Murdering.",
            "title_similarity": "0.60699433",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyct0az",
            "score": -1,
            "text": "So this sub is just a hate trump cult?",
            "title_similarity": "0.6724235",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hycwwy9",
            "score": -1,
            "text": "Yeah so everyone who didn’t watch everything Trump said in that interview, why don’t you listen. First of all you can commend someone’s brilliance without approving of their actions, many evil leaders are very talented and intelligent. Putin did make strategically good moves in his invasion, however this isn’t Trump saying his actions are just. Trump was being satirical in referring to Putin as “the great peacekeeper” for granting independence to Ukraine separatist states, to make a point that it was a smart move, but that the action itself is reprehensible. Do your fucking research, sheep, instead of reading a damn headline and treating it as the word of God himself.",
            "title_similarity": "0.7914897",
            "sentiment_compound": 0.9105
        },
        {
            "id": "hyd0dli",
            "score": 1,
            "text": "I have to believe most of these comments are from bots, people that are paid to convince the naive or ignorant, or ignorant themselves. This comment is similar to the the good people on both sides comment in Charlottesville which Biden said was the reason he ran for president. Or at least what the teleprompter told him to say. No competent person believed he was talking about the neo nazi's or white nationalists. The democrats and the media (but I repeat myself) take it out of context to influence the ignorant...",
            "title_similarity": "0.64892703",
            "sentiment_compound": -0.5157
        },
        {
            "id": "hyepprd",
            "score": -1,
            "text": "Wow talk about misinformation.  Even Sanders didn’t read the entire transcript of what Trump said.  Shameful.",
            "title_similarity": "0.61365306",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyflr1t",
            "score": 1,
            "text": "Biden is the one who bragged about his quid pro quo with Ukraine regarding the investigator looking into Burisma Energy, while his son was CEO. Trump may also have ties. All politicians are crooked. There is no way to make it in politics and stay genuine.",
            "title_similarity": "0.70947844",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hynshvy",
            "score": -1,
            "text": "If you still think he’s a Russian agent you’re all morons. Trump is a chess player and praising a champion while everyone else is starting to learn checkers. It’s got nothing to do with praise of killing but rather timing",
            "title_similarity": "0.5689198",
            "sentiment_compound": 0.3919
        },
        {
            "id": "hyaoys2",
            "score": -8,
            "text": "Bernie is still alive?",
            "title_similarity": "0.053128123",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyaqzvn",
            "score": 6,
            "text": "I love it when Bernie attacks Trump!\n\nWho hates it? Russia and U.S. conservatives!",
            "title_similarity": "0.83272773",
            "sentiment_compound": -0.2924
        },
        {
            "id": "hy9wc7s",
            "score": -54,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyaumy9",
            "score": -8,
            "text": "Who cares what Bernie thinks?",
            "title_similarity": "0.3355016",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyawm8c",
            "score": -8,
            "text": "Trump is living rent free in ur guys heads lol. It’s been over a year now get over him",
            "title_similarity": "0.281667",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hya087i",
            "score": 2,
            "text": "Partners in crime.\n\nAntichrist\nMan of lawlessness",
            "title_similarity": "0.5385021",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyaeksf",
            "score": 2,
            "text": "If Trump or someone like him ever becomes president again, they might invade Mexico and commit genocide.",
            "title_similarity": "0.6411723",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyagk39",
            "score": 2,
            "text": "Evil I like that.",
            "title_similarity": "0.4624869",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyahmgl",
            "score": 2,
            "text": "I rarely agree with Bernie... but I do today!",
            "title_similarity": "0.29220453",
            "sentiment_compound": -0.2136
        },
        {
            "id": "hyamwe4",
            "score": -2,
            "text": "[https://www.reddit.com/r/benshapiro/comments/t0e8kn/hahaha_liberals_so_called_liberating_the_world/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&utm_term=link](https://www.reddit.com/r/benshapiro/comments/t0e8kn/hahaha_liberals_so_called_liberating_the_world/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&utm_term=link)",
            "title_similarity": "0.44750792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyari8l",
            "score": 2,
            "text": "This is honestly sickening, I’m a centrist, maybe even a little right leaning, but this is horrible, I read the article, disgusting.",
            "title_similarity": "0.6667739",
            "sentiment_compound": -0.8898
        },
        {
            "id": "hyarwio",
            "score": 2,
            "text": "I bet if Trump was He will be sending troops to help…..HELP Russia!",
            "title_similarity": "0.6387414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyauhp9",
            "score": 2,
            "text": "It’s just dumbfounding to how right wing Americans are sympathising with Russia after all the election interference. Russia just took control of US by meddling in the election. Or are they seriously trying to make America great again by allowing Russia to take control of their country? That’s not much of patriotic, is it?",
            "title_similarity": "0.7313871",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hyavs7e",
            "score": -2,
            "text": "But is he wrong, from Putin’s POV he is playing this really smart. Kinda stupid to think otherwise",
            "title_similarity": "0.6097915",
            "sentiment_compound": -0.5449
        },
        {
            "id": "hyb4bii",
            "score": -2,
            "text": "I have not heard him say this… just a bunch of articles of people “reacting” to him saying it…. Which doesnt mean he did. \n\nBut fuckin A why does anyone give a shit what trump says anymore? I fucking dont. Talk about beating a dead horse… it worked for a few years guys… he’s gone… find your next scape goat… god damn….",
            "title_similarity": "0.52056074",
            "sentiment_compound": -0.7894
        },
        {
            "id": "hyb52gz",
            "score": -2,
            "text": "The media taking a portion of a statement completely out of context, spinning to their satisfaction - and refusing to print the entire statement? Color me shocked. Trump was bagging on this inept administration, but quick - let's rile up the hive and keep the focus on Trump. Anything to avoid actual reporting on this abysmal administration, right?\n\nTrump's actual, straightforward statement:\n\n\"This is something that should have never happened. This would not have happened during my administration,” Trump said in response to the attack on Ukraine. “It’s a very sad thing for the world, for the country, and for all the people who are going to be needlessly killed,” he added.",
            "title_similarity": "0.7584441",
            "sentiment_compound": -0.9253
        },
        {
            "id": "hyb7cjf",
            "score": -2,
            "text": "Who fucking cares?",
            "title_similarity": "0.2606955",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hyb7eg3",
            "score": -2,
            "text": "Biden is team Ukraine and Trump is team Russia.  Both geezers have benefited for each country.",
            "title_similarity": "0.5841315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb7tph",
            "score": -2,
            "text": "Yeah Bernie needs to keep focusing on shit that doesn’t matter— great use of time.",
            "title_similarity": "0.2241456",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyb9a62",
            "score": -2,
            "text": "Yall realy dropped the ball when electing a president didnt you.",
            "title_similarity": "0.5159572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb9kyp",
            "score": -2,
            "text": "How is Trump wrong? We aren't doing jack to stop this suffering and horror from stopping except slapping them on the wrist. Do you all think Putin didn't weigh the west's response and assumed we were so apathetic and cowardly we would commit no military forces and just impose weak economic sanctions. \n\nTrump is a corrupt disgusting pig but that doesn't make his analysis of the situation wrong. Some of you need to get real.",
            "title_similarity": "0.69194525",
            "sentiment_compound": -0.9544
        },
        {
            "id": "hybc80s",
            "score": -2,
            "text": "When your homies are dropping the ball, so you got to blame Trump",
            "title_similarity": "0.6394589",
            "sentiment_compound": -0.34
        },
        {
            "id": "hybdrhm",
            "score": -2,
            "text": "We do need TRUMP 🇺🇸 FJB 🖕🏼",
            "title_similarity": "0.44704443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybds6y",
            "score": -2,
            "text": "Out of context the strategy was a great one can compliment the strategy without supporting the man.",
            "title_similarity": "0.4187062",
            "sentiment_compound": 0.6998
        },
        {
            "id": "hybdx59",
            "score": -2,
            "text": "It’s rather irritating looking at all the comments that are only here to blast trump. Yes he is friends of Putin’s but he said he doesn’t support them in the war they started. But he also stated it was smart in the political sense and it is you’re an idiot if you believe other wise Putin saw a chance to gain more power and took it. I hate that innocent people are involved but this is the world; people have killed and hurt other people for there own gain since the beginning of this world and this is no different. From a political stand point for Putin this was a great choice and it’s painfully obvious that Biden doesn’t have the balls to do anything other than put out sanctions that will eventually hurt us. We get like 80% of are crude oil from them if anything we benefit from this as a country but due to poor leadership we will most likely be ran over or get stuck in the crossfire. I also love how people act like this didn’t happen with bush and Obama too the only president that it hasn’t happened to recently is trump. I am by no means found of him but he is 100x the president Biden is, and everyone is dirty even Biden, Hillary, and your next door neighbor so don’t even try to make that argument.",
            "title_similarity": "0.7850791",
            "sentiment_compound": -0.886
        },
        {
            "id": "hybgdme",
            "score": -2,
            "text": "Lie.",
            "title_similarity": "0.29311436",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybgt3n",
            "score": -2,
            "text": "Putin would have done the same if bernie was in charge. What Putin did was smart, doesn’t mean Trump supports him. When the cat is away the mice will play. This would have never happened had we had a real leader.",
            "title_similarity": "0.54978096",
            "sentiment_compound": 0.765
        },
        {
            "id": "hybihs4",
            "score": -2,
            "text": "This sub reddit is way left. Tell the truth not Marxist trash",
            "title_similarity": "0.33412647",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hybj6sa",
            "score": -2,
            "text": "TRUMP. NEVER  SAID THAT..!   bernie.  DOSE’NT  KNOW. WHAT. DAY. IT. IS ..!",
            "title_similarity": "0.32736582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybja4q",
            "score": -2,
            "text": "Nah the fact the current administration did jack to stop it from happening is outrageous.",
            "title_similarity": "0.67292947",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hybjxjk",
            "score": -2,
            "text": "Can you not read the English language Bernie? For the love of God please stop twisting President Trump’s words and be honest and read the full transcript of what he said on the Clay Travis and Buck Sexton Show. That is not what he was doing.",
            "title_similarity": "0.6053752",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hybk8h4",
            "score": -2,
            "text": "Misinformation",
            "title_similarity": "0.39239573",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyblbp7",
            "score": -2,
            "text": "Biden and the Dems cats fucked this country so bad ,can't wait for mid terms , we're taking house , senate and trump will win hands down. \nMake America great again.",
            "title_similarity": "0.7318558",
            "sentiment_compound": -0.2479
        },
        {
            "id": "hyboq0w",
            "score": -2,
            "text": "Is this the same Bernie Sanders who was sucking USSR cock 40 years ago, even as they were collapsing?",
            "title_similarity": "0.55040437",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hybr6ks",
            "score": -2,
            "text": "Trump is outrageously right!",
            "title_similarity": "0.5526503",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hybyceu",
            "score": -2,
            "text": "Biden helped create the problem by taking us off energy Independence, giving the nordestream pipe a green light while cancelling our own pipe lines.  Then purchasing 320 million barrels of oil from Putin himself. Begging and being rejected by OPEC three times to produce more oil only showed Putin he had the upper hand on energy. This being said Trump praised how he outplayed Biden.",
            "title_similarity": "0.6476551",
            "sentiment_compound": 0.743
        },
        {
            "id": "hybyz9w",
            "score": -2,
            "text": "What are you guys talking about it has come out that the investigation found no link with trump or Putin . But it did find that Hillary paid hackers to hack trumps Campaign and to spread that bs just show’s who she is and the democrats  are sorry I use to be one there broken",
            "title_similarity": "0.63641596",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hybzvng",
            "score": -2,
            "text": "Im actually perfectly fine with this war",
            "title_similarity": "0.30444536",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hybzzmh",
            "score": -2,
            "text": "Do people actually think he was praising it? If you watch the interview and understand anything about context you will see he wasn’t “praising” Putin. He was talking about how he played the west like a fiddle. Trump was right about keystone pipeline and nord stream 2. Watch what’s about to happen to your gas prices now if it wasn’t bad enough already.",
            "title_similarity": "0.6710495",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyc12va",
            "score": -2,
            "text": "Do you have some cheese to go with that whine?",
            "title_similarity": "0.297243",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyc2asv",
            "score": -2,
            "text": "To keep it civil, because some random internet basement dweller deems it so….you all need to, wait, I know it’s difficult, use your brains. Trump has been excommunicated from garbage Internet forums for over two years now. Yet, it is your contention, because of your unbecoming reason and physical attributes, that this, somehow, his fault. Good luck my mental superiors. I am awestruck by your presence",
            "title_similarity": "0.605177",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyc9448",
            "score": -2,
            "text": "Reddit is hilarious to me. This is my first time on this subreddit and OF COURSE 8/10 of the top posts are blasting trump. Get over it, he's not even your president anymore. There's way more important issues to talk about than hating trump.",
            "title_similarity": "0.6755554",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hyeihjq",
            "score": -2,
            "text": "Fake news !!! Hello!! Trump condemned Putins invasion! Bernie sanders is the corrupt left ! They keep saying Trump supports Putin! That’s Bullshit I heard Trump condemn the invasion on  OAN  start watching read news not that fake shit mainstream media puts out there ! They own mainstream media ! Duh!  It’s all Bidens fault !! You’re being brainwashed",
            "title_similarity": "0.8353742",
            "sentiment_compound": -0.8515
        },
        {
            "id": "hyfmwh4",
            "score": -2,
            "text": "Bernie Sanders is either an idiot for his interpretation of what the actual comment was, or he’s just as sneaky and manipulative as most people have always thought. I mean how can a guy that’s never had a real job and been in politics his entire life criticize anyone else for their work ethic, economic beliefs or personal values.\n\nThe sad thing is, people are just dumb enough to read this headline and believe that Bernie is speaking truth without questioning what the actual comment from Trump was. It’s obvious the Trump understands just how manipulative Putin is and that the action that he’s taking now will result in little to no consequence from the international community. If you’re going to grab another country, that seems like a pretty easy way to do it.",
            "title_similarity": "0.71927655",
            "sentiment_compound": -0.3017
        },
        {
            "id": "hyale2c",
            "score": -10,
            "text": "Bernie reading headlines again and not getting the full context. Par for the course from a guy who says billionaires don't pay taxes.",
            "title_similarity": "0.42992544",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hyaewh1",
            "score": 3,
            "text": "Trump for Prison. 2024",
            "title_similarity": "0.27646402",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyahnl7",
            "score": 3,
            "text": "Along with basically everyone else besides AOC, who was too busy tweeting about student debt this morning? Not sure why this is worthy of being top of the sub...",
            "title_similarity": "0.33067816",
            "sentiment_compound": 0.0613
        },
        {
            "id": "hyam40m",
            "score": 3,
            "text": "Trump owns property in moscow.",
            "title_similarity": "0.45293194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyam43o",
            "score": 3,
            "text": "Putin has evidence of Trump using Epstein’s services",
            "title_similarity": "0.62974554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyanafk",
            "score": -4,
            "text": "Someone link the evidence of Trump praising Putin?",
            "title_similarity": "0.6404104",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyaonjw",
            "score": -3,
            "text": "Since when has anyone listened to Bernie?",
            "title_similarity": "0.105199315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaptz4",
            "score": -5,
            "text": "Is this entire thread… just bots? The top story…..during an invasion…is an out of context Trump quote??!  He says enough bad stuff. But he just pulled off an invasion while every western political leader is sitting with their thumbs up their asses.. much like hitler and the Czech",
            "title_similarity": "0.7609316",
            "sentiment_compound": 0.4993
        },
        {
            "id": "hyaq20e",
            "score": -3,
            "text": "I don’t really understand this logic say whatever you want about trump but he isn’t praising Putin more like recognizing his geo-political prowess, which is highly debatable. He even went on to say that this would’ve never happened under his presidency so with this logic why is he both praising Putin’s actions and stating he wouldn’t have let Putin’s actions occur? This isn’t praise more like a recognition of Putin’s ability to get what he wants, which we will see in the coming months if it is true. Hell, a lot of people consider Napoleon a military genius and he invaded the entirety of Europe.",
            "title_similarity": "0.6322571",
            "sentiment_compound": 0.9725
        },
        {
            "id": "hyatnui",
            "score": 2,
            "text": "What message does a former President praising an authoritarian’s aggressive unprovoked takeover of a sovereign country say about OUR country?? It makes us look WEAK asf against our adversaries. It makes our freedom of speech a complete joke when a former president praises dictators! It’s abhorrent and will truly damage our country from the inside out! Trump needs to be taken down but now it’s looking like this sociopath will get away yet again.",
            "title_similarity": "0.775233",
            "sentiment_compound": 0.7208
        },
        {
            "id": "hyaydpv",
            "score": -3,
            "text": "“Praise”",
            "title_similarity": "0.19069538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaz1l7",
            "score": 3,
            "text": "We know Trump is not bright - but to think there was an \"amphibious attack by Americans\" is so profoundly stupid I think I need to get down on my knees and thank God he's no longer in office. This all would be a living nightmare if Trump were still President.",
            "title_similarity": "0.71986234",
            "sentiment_compound": -0.8303
        },
        {
            "id": "hyb38d3",
            "score": -2,
            "text": "From a military standpoint the attack was perfectly planned. Putin would not have dared do this under trump... After Afganistán the world knows the US is weak and will not engage",
            "title_similarity": "0.5911579",
            "sentiment_compound": -0.4284
        },
        {
            "id": "hyb3ksw",
            "score": -4,
            "text": "To be fair Trump is right. Putin waited for a weak president to make his move. And he acted quickly and with precision. Was indeed a genius and savvy move.",
            "title_similarity": "0.6935389",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hybcnt3",
            "score": -4,
            "text": "Thats weird coming from a man who loved the soviet Union and went on his honeymoon there.",
            "title_similarity": "0.5058732",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hybdkxs",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.17154175"
        },
        {
            "id": "hyblkqu",
            "score": -3,
            "text": "I wonder if sleepy Bernie would rather pay off my college debt or take on more debt and finance the Ukrainian army.",
            "title_similarity": "0.5184087",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hybn4ku",
            "score": 2,
            "text": "I don't like Bernie but the man's correct",
            "title_similarity": "0.44808733",
            "sentiment_compound": -0.1419
        },
        {
            "id": "hybn58k",
            "score": -4,
            "text": "Boy, that was a manipulation of words and context. Well done, though.",
            "title_similarity": "0.36661485",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hybpbjw",
            "score": -3,
            "text": "Person who hates trump makes an obvious observation about something trump said/did.\n\nTo the top of r/politics!",
            "title_similarity": "0.75019294",
            "sentiment_compound": -0.3382
        },
        {
            "id": "hybpfpk",
            "score": -3,
            "text": "What does he think about the genocide of people of donbass for the last 8 years",
            "title_similarity": "0.42957208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybsuxa",
            "score": -4,
            "text": "I went back and listened to the interview. This quote is taken out of context. Yes, Trump is a moron. He has praised Putin in the past as a strong leader, (he admires that part, which is not good) but he does NOT support Putin or what he is doing. \n\nI’m so tired of Republicans taking Democrats out of context. And I’m tired of Democrats taking Republicans out of context. This does not help your cause. It’s so easy to debunk when quotes are taken out of context. \n\nIt only makes you look like a moron. It makes you look like the thing you hate when you take quotes out of context.",
            "title_similarity": "0.65531194",
            "sentiment_compound": -0.8867
        },
        {
            "id": "hychouq",
            "score": -4,
            "text": "\"Nice\" to see another \"leftist\" supporting genocide as long as that country is aligned with the USA.\n\n&#x200B;\n\nWould you support banning Spanish in USA?",
            "title_similarity": "0.61860096",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hy9rnjv",
            "score": -75,
            "text": "This is all full of shit once again by the liberal media. Trump was always against Germany’s pipeline agreement with Russia because it would mean they would become too reliant on Russia. He was always against all the nato counties sending billions and billions to Russia. I don’t like Donald but he was spot on here: https://twitter.com/mahyartousi/status/1496906835936296961?s=21\n\nTo claim that trump is pro Russia is bonkers",
            "title_similarity": "0.7622446",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyalpiy",
            "score": -13,
            "text": "Always knew Bernie was a shill for US interventionism. What murderous invasion is he talking about? The US literally carpet bombs cities to waste and kills countless civilians in their invasions...",
            "title_similarity": "0.7326995",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hyao41g",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyaqk1j",
            "score": -4,
            "text": "This would never have happened under trumps administration. Him ‘praising’ Putin, which he’s not, is him saying Putin is playing all the right cards to justify invasion. He’s not supporting Putin, but saying Putin used smart psychological tactics to justify his actions.",
            "title_similarity": "0.715007",
            "sentiment_compound": 0.5018
        },
        {
            "id": "hyarv8g",
            "score": -3,
            "text": "How is Trump praising Putin. He was trying to warn us not to underestimate Putin. Crazy how his words get twisted and everyone just goes with it.",
            "title_similarity": "0.76579463",
            "sentiment_compound": 0.3794
        },
        {
            "id": "hyat8kh",
            "score": -5,
            "text": "Hey never praised them",
            "title_similarity": "0.18917136",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hyatevd",
            "score": -3,
            "text": "yo HOW IS TRUMP RELEVANT. any% speedrun how far to scroll on r/politics before seeing the word “trump”",
            "title_similarity": "0.51856446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb2r1r",
            "score": -3,
            "text": "He didn’t praise it he pointed out how his deceptions were smart and they were. It’s alright to accept you’ve been outplayed but it’s bad to ignore them",
            "title_similarity": "0.5162686",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hyb2wcg",
            "score": -5,
            "text": "He didn't praise Putin.  Ridiculous out of context.",
            "title_similarity": "0.42815742",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hyb3onm",
            "score": -3,
            "text": "meanwhile bernie sells out for the 5th time",
            "title_similarity": "0.21301138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb4em0",
            "score": -4,
            "text": "It’s crazy how out of context this is. People really have a real hatred. We need to stop doing this",
            "title_similarity": "0.56332475",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hyb8noi",
            "score": -4,
            "text": "Bernie Sanders is an idiot and is mincing words.",
            "title_similarity": "0.5507991",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyblu08",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.17154175"
        },
        {
            "id": "hybvzzb",
            "score": -5,
            "text": "Has Bernie accomplished anything during his “career”?",
            "title_similarity": "0.10879882",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyafwww",
            "score": -15,
            "text": "Rich coming from the guy with a ~~Russian~~ Soviet flag in his office as Mayor and who benefited from, but did not condemn, Russian interference when he was running for president.",
            "title_similarity": "0.57609653",
            "sentiment_compound": 0.6219
        },
        {
            "id": "hyacz2l",
            "score": -17,
            "text": "Man who praised Justin Trudeaus dad has room to talk how?",
            "title_similarity": "0.34395635",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyatnx7",
            "score": -6,
            "text": "This from a guy who unironically praised and went to the USSR",
            "title_similarity": "0.5395576",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyauft5",
            "score": -4,
            "text": "As usual you crusty old asshole communist you misunderstood  what he is saying!",
            "title_similarity": "0.62388474",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hyaum0s",
            "score": -4,
            "text": "Say what you want, but Russia only started shit before or after Trump….",
            "title_similarity": "0.519827",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hyb7mr0",
            "score": -6,
            "text": "Lol not even going to read this but Wtf is biden doing right now? I’m not R or D but God I miss Mr Orange",
            "title_similarity": "0.36271238",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hybekpg",
            "score": -4,
            "text": "Well he didn't praise him.\n\nEdit: Considering no one can find a quote, I'm going to assume I was right.",
            "title_similarity": "0.33216584",
            "sentiment_compound": -0.4632
        },
        {
            "id": "hybmuv4",
            "score": -5,
            "text": "Where the fuck is Biden? Hiding in his hole? Fuck Trump but how is he louder than the actual potus Jesus christ",
            "title_similarity": "0.5357239",
            "sentiment_compound": -0.6662
        },
        {
            "id": "hybnjnj",
            "score": -5,
            "text": "Dod he even hear the whole speech or just what the main stream media took out of context…?",
            "title_similarity": "0.41736263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyapw00",
            "score": 18,
            "text": "Imagine if Trump won the election. The United States would currently be siding with the actions of Putin. Puts into perspective to what extent the right choice was made.",
            "title_similarity": "0.6832131",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hyabena",
            "score": -6,
            "text": "Its no surprise, so we can deduce that's its controlled. I think everything Donald Trump says on TV is rehearsed. I don't believe for one moment he's an idiot. The last 6 years encompassing his election and up to now, have been so scripted feeling... like... an episode of The Apprentice.",
            "title_similarity": "0.5117793",
            "sentiment_compound": -0.1461
        },
        {
            "id": "hyanegw",
            "score": -6,
            "text": "He also did not read or hear what Trumpy said. 🤦🏻‍♂️",
            "title_similarity": "0.304374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyao44d",
            "score": -5,
            "text": "This is propaganda, Trump would of already sent troops.",
            "title_similarity": "0.5226822",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyaouip",
            "score": -6,
            "text": "Why is Bernie STILL talking about Trump when the wet paper bag in office now gets walked like a dog by every other world leader?\n\nEvery speech the demented old man gives gets worse and worse. He lost it both mentally and physically. He should be in a nursing home, not the White House.\n\nI don’t want Trump, but damn Biden is a hot mess.",
            "title_similarity": "0.600453",
            "sentiment_compound": -0.8641
        },
        {
            "id": "hyappzw",
            "score": -6,
            "text": "I cant believe Jewish Bernie Sanders is a Nazi sticking up for Nazi Ukraine, also led by a Jew.",
            "title_similarity": "0.7140211",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaryo7",
            "score": -6,
            "text": "Bernie is the ultimate cuck😅",
            "title_similarity": "0.2997987",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyavcto",
            "score": -5,
            "text": "Bernie, you're not wrong. But considering recent events and your hot take on defense spending:\n\n[https://www.sanders.senate.gov/press-releases/news-sanders-statement-on-defense-spending-bill/](https://www.sanders.senate.gov/press-releases/news-sanders-statement-on-defense-spending-bill/)\n\nI REALLY don't care to hear from you right now.  \n\n\nEdit to the downvoters: You all do realize we're literally staring at the invasion of a country that was begging for more weapons from EU members? But those EU members were too dependent on Russian trade partnerships (i.e. Italy and Germany) to actually do something to help?",
            "title_similarity": "0.6481289",
            "sentiment_compound": -0.668
        },
        {
            "id": "hyb8bwp",
            "score": -6,
            "text": "Trump is outrageous, yet its not under Trump that WW3 is starting, mearly 400 days into the Biden office.",
            "title_similarity": "0.51937217",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyb8y3w",
            "score": 6,
            "text": "Trump is a fucking traitor to our country. He’s likely been a traitor since the 90s when he suddenly started getting shit loads of money from “Russian Business.” He’s been heavily involved with their shit for a while. Providing sources at this point is moot considering all that has been investigated and connected. \n\nMy point to this is that his base, along with Qanon are applauding the war in the Ukraine. That alone should be reason enough to call them traitors. But like a civilized society, we can’t just go barging down doors and making claims that these people are traitors. Instead you should be ashamed for applauding a totalitarian oligarch going after a democratic society considering we live in a democratic society. The Invasion of Ukraine is a symbol and symptom that democracy globally is at threat and we are heading back into the times of Imperialization where countries invaded others and declared them theirs because “no flag, no country, therefore it’s mine.”",
            "title_similarity": "0.76022696",
            "sentiment_compound": -0.93
        },
        {
            "id": "hyarcp3",
            "score": -8,
            "text": "Says the guy that had his actual honeymoon in Soviet Russia. Fuck right off Bernie, you dumb traitorous hack.",
            "title_similarity": "0.67136157",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hya8f0d",
            "score": 7,
            "text": "I used to love trump, but the way he’s sympathizing Russia made me never trust him again. I REALLY hope he never becomes president again.",
            "title_similarity": "0.67447114",
            "sentiment_compound": 0.6636
        },
        {
            "id": "hyaowel",
            "score": -6,
            "text": "Trump never praised Putin invading Ukraine. Where is this coming from? I heard the entire phone call Trump had in response to the invasion. He condemned it the entire time and said it was preventable.",
            "title_similarity": "0.6841323",
            "sentiment_compound": -0.6734
        },
        {
            "id": "hyamyhu",
            "score": 10,
            "text": "Trump is a Russian asset and always will be, he’s a traitor and a scumbag",
            "title_similarity": "0.76924586",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyarhvz",
            "score": 31,
            "text": "I'm sure it's occurred to most people that this plan by Putin has been in place for many years and Trump was supposed to play a larger part. Trump was supposed to be ion office now to help. This explains the insurrection and false narrative about a stolen election. Trump tried to 'defund' NATO, weakening it. He tried to disrupt Ukraine politically. We need to learn how large of a role Trump and his cronies have played in what is happening in Ukraine. Russia cause Brexit to weaken the European union. This has been in the works and is much larger in scope and strategy than what it looks like on the surface.  ANYTHING, Fox News, Newsmax, RT, etc..., with any ties to Russia needs to be expelled or charged with treason.  None of what's happening now in coincidence between Putin / Russia, Trump et al.",
            "title_similarity": "0.72137195",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hy9r4cp",
            "score": 197,
            "text": "You are right Bernie.  He is a sick man and is using an international crisis to get the attention he so misses.",
            "title_similarity": "0.5851979",
            "sentiment_compound": -0.8718
        },
        {
            "id": "hy9t66i",
            "score": 102,
            "text": "At a time when the country should be rallying around our president, Donald Trump seems to be rallying around his president or should I say dictator.",
            "title_similarity": "0.54627776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyah16c",
            "score": -15,
            "text": "Jesus Christ will you guys just move on already? He lost the election it’s been over.",
            "title_similarity": "0.48096198",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hy9sp2k",
            "score": -43,
            "text": "I’m unsure about these current advancements, however I support the 2014 efforts.\n\nCrimea is honestly pretty damn Russian anyway",
            "title_similarity": "0.5694964",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hya52y5",
            "score": 142,
            "text": "Americans in name only.  Fuck the GOP!",
            "title_similarity": "0.45947295",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hy9yb40",
            "score": -32,
            "text": "You're right it is outrageous because it doesn't exist 😭😂",
            "title_similarity": "0.45265839",
            "sentiment_compound": 0.3515
        },
        {
            "id": "hy9vk0h",
            "score": 98,
            "text": "I expect nothing less from Trump, and most Republicans for that matter. You see, Trump really helped cultivate and empower this movement, this ideology of antipathy. For Republicans it's not as much about being pro-Putin/Russia as it is about being anti-whatever the left supports.\n\nHowever, its been different for Trump, whether or not he's staying consistent here or he's just reiterating whatever partisan talking point he heard while watching Fox News and chain drinking diet coke, throughout his presidency, he persistently enabled, endorsed, commended and practically glorified Putin and his every action, often times at the expense of America and its allies, and now Republicans conveniently ignore Trump's awful foreign policy, his objectionable behavior, and his outright capitulation to Putin while having the audacity to criticize Biden as they follow in Trump's footsteps. Rationalizing their pro-Russia, pro-Putin stance because it stands in stark contrast to their perceptions of \"the left\".\n\nThe right wing propaganda machine, the fervent culture war, the regressive ideology and the senseless dogmatism forces these mindless adherents and fanatics into taking this antagonistic, adversarial stance against their categorizations of democrats, of Biden, of leftists and liberals everywhere. If \"the left\" is illustrated as pro-Ukraine, as anti-Putin, republicans must instinctively embrace a position that obstructs and opposes their strawman, supporting Putin and Russia to some extent during this conflict or reiterating Putin talking points, until conveniently of course, *shit gets real.* It's really that simple. No matter how utterly reprehensible, ignorant, contradictory, hypocritical, partisan, prejudiced or absurd the homogenized right-wing outlook seems, it's always justified, as long as it stands vehemently and radically opposed to the left.",
            "title_similarity": "0.6113306",
            "sentiment_compound": -0.9565
        },
        {
            "id": "hy9rznw",
            "score": 626,
            "text": "The invasion of the Ukraine by the bloody dictator of Russia is having a profound effect on US politics. It is separating normal Americans who support freedom from tyranny from vote-for-sale Republicans who support Putin's imperial ambitions. Russia is clearly in no way America's friend yet they are rooting for them over the best interests of the United States because, for them, the name of the game is Party Before Country. It is fair to ask, then, when did it become fashionable for Republicans to hate America?",
            "title_similarity": "0.81556416",
            "sentiment_compound": 0.9623
        },
        {
            "id": "hy9sqwz",
            "score": -45,
            "text": "Apparently Bernie doesn't know sarcasm when he hears it",
            "title_similarity": "0.34087497",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hyaeby2",
            "score": 292,
            "text": "Trump's comments are in-line with his previous expressions fueled by his numerous servere and clinical pyschological illnesses, so I'm not surprised by them. \n\nWhat I am surprised at is how many of the Republican voters can cheer on Trump's sociopathy and be so easily misled and blind that they'd cheer on a ex-KGB head and mob boss who murdered his own citizens to gain power, over Biden or America. \n\nTrump's comments have shown how incredibly stupid he is (he seriously doesn't even understand the difference between Ukraine or Russia and just parrots Putin's talking points) and just how deeply he has been compromised by the Russian intelligence services. \n\nIf you support Putin you support the overthrow of American democracy, and this should not be so easily accepted. Unbelievable that Fox and other propaganda networks are siding with Russian interests over American. And so many sad and dumb Americans are supporting this regime, led blindly by hatred and propaganda that is playing them like puppets, yet they are too stupid to realize this, and think support Trump and billionaire mob bosses is supporting 'freedom' or some such nonsense.",
            "title_similarity": "0.77796924",
            "sentiment_compound": 0.8581
        },
        {
            "id": "hy9w68c",
            "score": 2527,
            "text": "trump praised the Chinese government's massacre of peaceful protesters in Tiananmen Square. trump is a sociopath who supports and envies murderous dictators.\n\nhttps://www.businessinsider.com/trump-praised-china-tiananmen-foreshadowing-response-to-george-floyd-protests-2020-6",
            "title_similarity": "0.76029754",
            "sentiment_compound": 0.25
        },
        {
            "id": "hy9sxdl",
            "score": 5213,
            "text": "It’s also absurd, disgusting, treasonous, dumb, stupid, lame, and totally not a surprise at all.",
            "title_similarity": "0.49185404",
            "sentiment_compound": -0.9564
        },
        {
            "id": "hyaasi9",
            "score": 1660,
            "text": "I just know the whole world will celebrate when Trump keels over and dries up like a rotten clementine.",
            "title_similarity": "0.660449",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hy9z0ow",
            "score": 108,
            "text": "Trump deserves prison",
            "title_similarity": "0.49446645",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyaenp3",
            "score": 1610,
            "text": "Putin owns Trump and it’s 1000% obvious.   \n\n“We have a lot of money coming in from Russia.” \nDon Jr in 2008",
            "title_similarity": "0.6301069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy9uynf",
            "score": 378,
            "text": "Trump is a narcissistic traitor, a psycho.",
            "title_similarity": "0.6985984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hya1vpk",
            "score": 80,
            "text": "Fuck Trump and Putin.",
            "title_similarity": "0.71013415",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hya53uo",
            "score": 14,
            "text": "Yes it is. Is the US now little Russia. We like dictators now?",
            "title_similarity": "0.6246319",
            "sentiment_compound": 0.6041
        },
        {
            "id": "hya6yys",
            "score": 1,
            "text": "It's beyond outrageous. At this point it is all but legitimately treasonous by the legal definition. What he did before, with the Capitol? That was sedition. Now it's at the very least, functional and moral if not yet legal, treason.",
            "title_similarity": "0.6641838",
            "sentiment_compound": -0.8149
        },
        {
            "id": "hya88qo",
            "score": 1,
            "text": "Thanks Mr Sanders.",
            "title_similarity": "0.21755601",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hya8fm3",
            "score": 21,
            "text": "No, it's treasonous.",
            "title_similarity": "0.46208787",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyadcto",
            "score": 3,
            "text": "Watched a clip of Pompeo talking about this last night. The man was practically on his knees ready to suck off ol’ Vlad. It is unbelievable to me that this is where we are.",
            "title_similarity": "0.49486306",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyaddtn",
            "score": 1,
            "text": "Only because it is…",
            "title_similarity": "0.14015827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaece7",
            "score": 1,
            "text": "Build some internment camps and round up the Russian sympathizers",
            "title_similarity": "0.566664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaf2x3",
            "score": 1,
            "text": "... but not surprising.",
            "title_similarity": "0.072693676",
            "sentiment_compound": -0.3007
        },
        {
            "id": "hyahlet",
            "score": 4,
            "text": "That title... lol ... No shit Sherlock",
            "title_similarity": "0.20120384",
            "sentiment_compound": 0.6931
        },
        {
            "id": "hyaii6r",
            "score": 1,
            "text": "In one of Trump’s tweets when he was president he advocated China executing citizens. This is no surprise",
            "title_similarity": "0.5745332",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hyajl5b",
            "score": 1,
            "text": "Putin still has the golden shower tape over his head, so it makes sense ;)... proof that you never stop paying off ransoms",
            "title_similarity": "0.5504295",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hyak8rv",
            "score": 1,
            "text": "As if it wasn’t obvious before that Trump was in bed with Putin",
            "title_similarity": "0.5418936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyakhsq",
            "score": 1,
            "text": "I wouldn’t have know he said it until someone else commented on it.  Wasn’t that the point of deplatforming Trump?  If everyone reports on what other people say about what he said, it’s like nothing changed!",
            "title_similarity": "0.48897728",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hyamea5",
            "score": 2,
            "text": "Yeah, yeah, yeah.... add it to his tab.",
            "title_similarity": "0.2413499",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyamkmm",
            "score": 1,
            "text": "Trump really is a man supporting his president !",
            "title_similarity": "0.46913016",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hyamx1c",
            "score": 1,
            "text": "I mean…is it that unexpected though?",
            "title_similarity": "0.2335765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyan9s4",
            "score": 1,
            "text": "Geez. Imagine if that orange prick were still the president. I feel like he would definitely push for American forces to assist Russia in some way",
            "title_similarity": "0.66596586",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyan9t6",
            "score": 1,
            "text": "How can anyone praise Putin and still be followed in any capacity?",
            "title_similarity": "0.52811575",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyan9yo",
            "score": 1,
            "text": "Let Trump keep making a fool of himself. The hope is he’ll dig himself a hole deep enough one day. The fact he hasn’t gone down for any foul behavior political and not is incredible and I hope his time comes soon",
            "title_similarity": "0.48383772",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hyanar9",
            "score": 1,
            "text": "Is it generationally correct to follow Stalinistic Tactics creating massive chains of overseas human trafficking drugs smuggling complete patents on human progress in patenting plant life for more than the time allotted and destroying natural resources accessible to man forever also controlling entire species of men Fournier two centuries only recently have they created the bonds in Stockholm which they claim ownership of humanity. When countries like this use that many people all over the face of the world why do you say you’re the proper person to judge directions on the face the world.?!",
            "title_similarity": "0.64644504",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hyaneyp",
            "score": 4,
            "text": "I don’t care is you’re a conservative who thinks Russia is in the wrong with ukraine. If you still support trump then you support Russia.",
            "title_similarity": "0.72173584",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyanfwp",
            "score": 1,
            "text": "Can someone send me a link to where trump said this?",
            "title_similarity": "0.35683483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyankjh",
            "score": 1,
            "text": "I can't understand anything of what is going on...\n\nPutin is invading the Ukraine because he wants it to be independent?\n\nAnd I'm not just saying \"I don't understand\" sarcastically or anything... I really do not understand what's going on right now, despite reading many articles about it. Anyone have a quick ELI5?",
            "title_similarity": "0.697224",
            "sentiment_compound": 0.2901
        },
        {
            "id": "hyao1ux",
            "score": 1,
            "text": "Can anyone link trump praising it ty",
            "title_similarity": "0.4867329",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyaoacg",
            "score": 2,
            "text": "It's pathetic, call it what is in Bernie.",
            "title_similarity": "0.42711848",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyaoaqo",
            "score": 1,
            "text": "is there a NO\\_Shit! subreddit?",
            "title_similarity": "0.3455633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaofi0",
            "score": 1,
            "text": "Trump’s not all there!",
            "title_similarity": "0.3381794",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaoj7z",
            "score": 2,
            "text": "Bernie Sanders says Trump's praise for 'Putin's murderous invasion of Ukraine' is 'outrageous'\n\nI have to say that I completely agree! Trump's admiration for Putin's actions is just awful and it really shows his lack of judgement.",
            "title_similarity": "0.92417514",
            "sentiment_compound": -0.4402
        },
        {
            "id": "hyaomm5",
            "score": 2,
            "text": "Trump is a traitor, should rot in Guantanamo",
            "title_similarity": "0.6890769",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaotjk",
            "score": 1,
            "text": "In other news, fat, orange, traitorous piece of shit with Putin's hand way up his bloated asshole tries anything to remain relevant.",
            "title_similarity": "0.7299005",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyaoxws",
            "score": 63,
            "text": "Trump is the most unAmerican president the USA has had.\n\nHow comments like that (among a plethora of other incidents, comments, actions by him) has kept his followers still following is disgusting.\n\nTrump is cancer.",
            "title_similarity": "0.66699374",
            "sentiment_compound": -0.743
        },
        {
            "id": "hyap6s5",
            "score": 1,
            "text": "And he will somehow win the next election because that's just how our shitty world is now.",
            "title_similarity": "0.6381079",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyap90v",
            "score": 2,
            "text": "Well, at least hes not president, or else usa would be fighting along side russia",
            "title_similarity": "0.65046376",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyapkth",
            "score": 1,
            "text": "yeah, “patriot”",
            "title_similarity": "0.19838656",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyaplnp",
            "score": 2,
            "text": "Sounds like Trump needs more Russian loans. Or maybe a place to hideout from current legal issues.",
            "title_similarity": "0.59018034",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyapls0",
            "score": 2,
            "text": "It’s called treason.",
            "title_similarity": "0.48251975",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyapqs2",
            "score": 1,
            "text": "Well who doesn't",
            "title_similarity": "0.08122745",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyapyqw",
            "score": 1,
            "text": "Trump’s brain wanted. \n\nDead or alive.\n\n *1$* reward",
            "title_similarity": "0.5632349",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyaq2d9",
            "score": 1,
            "text": "Feel the bern.",
            "title_similarity": "0.07692298",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaq9jb",
            "score": 13,
            "text": "How do the Trump diehard fans, explain this one?",
            "title_similarity": "0.5780511",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaqj9s",
            "score": 1,
            "text": "No shit, Bernie.",
            "title_similarity": "0.103023484",
            "sentiment_compound": 0.4449
        },
        {
            "id": "hyaqkok",
            "score": 1,
            "text": "What's even funnier is that former VP Mike Pence stated Russia wouldn't have invaded if Trump was still President..",
            "title_similarity": "0.60311055",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyaqoh3",
            "score": 2,
            "text": "Because it fucking was. I would have said traitorous but that's beating a dead horse.",
            "title_similarity": "0.6647254",
            "sentiment_compound": -0.899
        },
        {
            "id": "hyardku",
            "score": 7,
            "text": "Sort by controversial if you want to see where all the the republicans are",
            "title_similarity": "0.49492705",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyare13",
            "score": 1,
            "text": "After these statements by Trump, we know exactly how much he thinks of democracy. Nothing at all. Democracy is only for the weak.",
            "title_similarity": "0.5170246",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyark77",
            "score": 1,
            "text": "I have nothing to say about that joke of a person anymore.",
            "title_similarity": "0.23932782",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyarzlv",
            "score": 1,
            "text": "Preposterous",
            "title_similarity": "0.3640904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyas1sd",
            "score": 1,
            "text": "Trump has to say things like this because putin promised to pay trump's loan from russia via a german bank. Makes two axxhxxxes instead of just one.",
            "title_similarity": "0.58409905",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hyas24z",
            "score": 1,
            "text": "Outrageous? How about anti- democratic, anti-American, bordering on treasonous",
            "title_similarity": "0.63485074",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hyas3e6",
            "score": 1,
            "text": "He’s just saying it’s genius because it didn’t happen in his watch.",
            "title_similarity": "0.29874122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyascgo",
            "score": 1,
            "text": "how about we call it treason",
            "title_similarity": "0.5427321",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyasond",
            "score": 1,
            "text": "Surprise Surprise, they are not talking about Trump's comments AT ALL over on r/conservative",
            "title_similarity": "0.4236027",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyasp4w",
            "score": 1,
            "text": "A [CNN article](https://amp.cnn.com/cnn/2022/02/24/politics/donald-trump-praises-putin/index.html) put it succinctly:\n\n>\tTrump told the crowd, \"he's taking over a country for two dollars' worth of sanctions. I'd say that's pretty smart.\" ... For Trump, everything -- and I mean everything -- is transactional. There is no right or wrong. There's only, can you do this thing or not, and what does it get you versus what does it cost you. In Trump's worldview, might makes right. If you can take something, you should. Being perceived as strong -- in your own country and in the world -- is all that matters.",
            "title_similarity": "0.7155075",
            "sentiment_compound": 0.8899
        },
        {
            "id": "hyasq3p",
            "score": 1,
            "text": "President Sanders is spot on",
            "title_similarity": "0.34807783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyasukf",
            "score": 1,
            "text": "Someone needs to throw a shoe at this mother fucker",
            "title_similarity": "0.554487",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyat3g5",
            "score": 1,
            "text": "What Exactly did Trump say that was “praising” Russia invading Ukraine???",
            "title_similarity": "0.77865356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyat61w",
            "score": 1,
            "text": "Trump is a Russian puppet",
            "title_similarity": "0.5596762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyat9ox",
            "score": 1,
            "text": "So does he have a solution, or just a complaint?",
            "title_similarity": "0.28501457",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyatc5i",
            "score": 1,
            "text": "Psychopaths always find friends in other psychopaths",
            "title_similarity": "0.36479303",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyatcd2",
            "score": 1,
            "text": "The site isn't working well, what did Trump say? Anyone have a link/source?",
            "title_similarity": "0.43583912",
            "sentiment_compound": -0.2901
        },
        {
            "id": "hyatey7",
            "score": 1,
            "text": "But. Imagine how horrible things would be if trump was president.  He and Putin were masterminding this invasion since before the USA election.  Trump knew-  he was satisfied about the action.",
            "title_similarity": "0.77450454",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hyatlsk",
            "score": 1,
            "text": "Donald Trump is thankfully no longer the President. Stop giving him attention",
            "title_similarity": "0.46761632",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyatsxy",
            "score": 1,
            "text": "You’re only allowed to invade other counties if you come up with an elaborate hoax. Can’t just say ‘I want country’ *invade*",
            "title_similarity": "0.52883816",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyatwf7",
            "score": 1,
            "text": "Wait did trump really say something that fucking stupid? I need a link to this shit",
            "title_similarity": "0.6309241",
            "sentiment_compound": -0.8378
        },
        {
            "id": "hyau4cw",
            "score": 1,
            "text": "Bernie would have forgiven student loans. Biden helped write the legislation that forbids forgiveness of such loans even under bankruptcy.",
            "title_similarity": "0.47172457",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyau787",
            "score": 1,
            "text": "Hey I am out of the loop and have intentionally avoided anything to do with trump because I'm sick of his shit. But what did he say?",
            "title_similarity": "0.50123173",
            "sentiment_compound": -0.631
        },
        {
            "id": "hyau8ne",
            "score": 1,
            "text": "It’s almost like the DA shouldn’t have stopped the Grand Jury proceedings",
            "title_similarity": "0.45957452",
            "sentiment_compound": 0.5118
        },
        {
            "id": "hyaudg0",
            "score": 1,
            "text": "I’m SO GLAD he was not re-elected. Could you imagine…",
            "title_similarity": "0.42728245",
            "sentiment_compound": 0.6965
        },
        {
            "id": "hyauiwq",
            "score": 1,
            "text": "What did trump even say?",
            "title_similarity": "0.40749842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyauk1l",
            "score": 1,
            "text": "We're fucked when Bernie passes away.",
            "title_similarity": "0.4785904",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyavaxj",
            "score": 2,
            "text": "And also very on brand",
            "title_similarity": "0.17731926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyavi42",
            "score": 1,
            "text": "trump probably asked putin to find Hunter Biden’s laptop while he was in Ukraine.",
            "title_similarity": "0.5475784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyavl4y",
            "score": 1,
            "text": "Brought to you by the same people who support bombing the shit out of the Middle East to fight for Our Democracy™ ",
            "title_similarity": "0.6636942",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyavmjy",
            "score": 2,
            "text": "And there are still nut jobs that have the audacity to say that trump will do a better job\n\nEdit: I can’t type for shit",
            "title_similarity": "0.6182048",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyavrn5",
            "score": 2,
            "text": "If Trump was still president he'd probably bow down and suck on Putin's toes to be on his side",
            "title_similarity": "0.6928057",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyavvng",
            "score": 2,
            "text": "Water? Wet?!\n\nSince when?!?!",
            "title_similarity": "0.1644586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyavxov",
            "score": 1,
            "text": "Bernie 2024",
            "title_similarity": "0.14146715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaw2yd",
            "score": 1,
            "text": "Best to contact the higher-ups at McDonald’s, they probably know how many Big Macs a day he takes in",
            "title_similarity": "0.3708685",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyaw481",
            "score": 1,
            "text": "Do we really need whole articles of what people are saying about what other people are saying?",
            "title_similarity": "0.31855214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyawb7d",
            "score": 1,
            "text": "Trump is such a despicable person, absolutely disgusting. Have no idea why he hates America so much.",
            "title_similarity": "0.74035835",
            "sentiment_compound": -0.8425
        },
        {
            "id": "hyawbmk",
            "score": 1,
            "text": "What a trashbag.",
            "title_similarity": "0.31071645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyawdtp",
            "score": 1,
            "text": "Tulsi Gabbard is also praising Putin, I’d like to see him address his tweet that it was ridiculous to suggest she’s a Russian asset.",
            "title_similarity": "0.7654807",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyawf2u",
            "score": 2,
            "text": "It’s amazing how the most pro-American and pro-democracy politicians are democrats like Bernie Sanders, while Republicans are trying to undermine that.",
            "title_similarity": "0.5943713",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyawio6",
            "score": 1,
            "text": "Come on people! /r/Conservative said Trump was being sarcastic when he said that what Putin did was genius!",
            "title_similarity": "0.8284905",
            "sentiment_compound": -0.3786
        },
        {
            "id": "hyawkvo",
            "score": 1,
            "text": "The twice-hit-and-missed president I wanted.",
            "title_similarity": "0.46781725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyawn4x",
            "score": 2,
            "text": "Can we fucking cancel trump already? He is wicked annoying",
            "title_similarity": "0.6690146",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hyawqc0",
            "score": 1,
            "text": "people on fox news blaming this all on Biden.  One popular take is that Biden has shown that he is so weak, that Putin decided to invade now as opposed to invading during trumps term because trump was tough and putin wouldn't dare go up against him.",
            "title_similarity": "0.6999817",
            "sentiment_compound": -0.685
        },
        {
            "id": "hyaww8b",
            "score": 2,
            "text": "Trump is a scumbag.",
            "title_similarity": "0.6392554",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyaww8m",
            "score": 1,
            "text": "The funny/sad thing is if Biden had done the same then the exact same base praising Trump for it would be condemning Biden.",
            "title_similarity": "0.72690713",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyawyfz",
            "score": 1,
            "text": "Why are you booing him?  He's right!\n\nTFG and fat ass mike pompeo deserve a good old shunning.\nThe right doesn't have the stones.",
            "title_similarity": "0.6601054",
            "sentiment_compound": -0.2244
        },
        {
            "id": "hyax0kb",
            "score": 3,
            "text": "Sadly nearly 1/2 of Americans aka Republicans actively support Putin now...",
            "title_similarity": "0.51029134",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyax1h5",
            "score": 1,
            "text": "He’s a Russian asset. Any American who still supports this traitor is a traitor.",
            "title_similarity": "0.7291803",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyax8rx",
            "score": 1,
            "text": "So that’s all you have to say about Ukraine being invaded, Bernie?",
            "title_similarity": "0.66554666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyax8yu",
            "score": 3,
            "text": "Trump, 2018:\n\n> Well, I have to say, I think it’s very sad when Germany makes a massive oil and gas deal with Russia, where you’re supposed to be guarding against Russia, and Germany goes out and pays billions and billions of dollars a year to Russia. So we’re protecting Germany. We’re protecting France. We’re protecting all of these countries. And then numerous of the countries go out and make a pipeline deal with Russia, where they’re paying billions of dollars into the coffers of Russia.\n\n> So we’re supposed to protect you against Russia, but they’re paying billions of dollars to Russia, and I think that’s very inappropriate. And the former Chancellor of Germany is the head of the pipeline company that’s supplying the gas. Ultimately, Germany will have almost 70 percent of their country controlled by Russia with natural gas.\n\n> So you tell me, is that appropriate? I mean, I’ve been complaining about this from the time I got in. It should have never been allowed to have happened.\n\n...\n\n> So we have to talk about the billions and billions of dollars that’s being paid to the country that we’re supposed to be protecting you against. You know, everybody is talking about it all over the world. They’ll say, well, wait a minute, we’re supposed to be protecting you from Russia, but why are you paying billions of dollars to Russia for energy? Why are countries in NATO, namely Germany, having a large percentage of their energy needs paid to Russia and taken care of by Russia?\n\n> Now, if you look at it, Germany is a captive of Russia because they supply. They got rid of their coal plants. They got rid of their nuclear. They’re getting so much of the oil and gas from Russia. I think it’s something that NATO has to look at. I think it’s very inappropriate.\n\nLater:\n\n> SECRETARY GENERAL STOLTENBERG: Because we understand that when we stand together, also in dealing with Russia, we are stronger. I think what we have seen is that —\n\n> PRESIDENT TRUMP: No, you’re just making Russia richer. You’re not dealing with Russia. You’re making Russia richer….",
            "title_similarity": "0.7078133",
            "sentiment_compound": 0.9719
        },
        {
            "id": "hyaxg5i",
            "score": 1,
            "text": "Trump and Putin are in league.",
            "title_similarity": "0.5644486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaximu",
            "score": 1,
            "text": "Fuck him up Bernie!",
            "title_similarity": "0.5199669",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hyaxj14",
            "score": 2,
            "text": "Because nothing matters anymore. These people are so divorced from reality and American history",
            "title_similarity": "0.32058877",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hyaxmqw",
            "score": 2,
            "text": "It's seditious.",
            "title_similarity": "0.35133106",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyaxp70",
            "score": 2,
            "text": "Imagine if immediately after Hitler took Poland, a past president was like \"I told him not to invade but my buddy Hitler is a smart cookie!  And a great painter too!!\"\n\nLike breh..",
            "title_similarity": "0.61337936",
            "sentiment_compound": 0.944
        },
        {
            "id": "hyaxtkt",
            "score": 1,
            "text": "I love this thread. Half the people think Trump is an evil genius or at the very least some sort of russian puppet that sneaked into the highest position of power in the US. The other half think he’s just an idiot who didn’t know how to put two and two together and lost his second election by chance.",
            "title_similarity": "0.7300119",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyaxv5b",
            "score": 1,
            "text": "Just shows how fucking batshit it was that he was the president.",
            "title_similarity": "0.67083263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaxwme",
            "score": 1,
            "text": "I expect it from Trump... Just sad so many Americans feel the same way as he does. People we know and love, just... Idk. Cheering on villains I guess. While pretending they believe in heaven and hell.",
            "title_similarity": "0.6823529",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyay6iy",
            "score": 1,
            "text": "When I saw Biden’s speech, I realized I could not imagine how bad it would be if Trump was US president instead.",
            "title_similarity": "0.52791953",
            "sentiment_compound": 0.431
        },
        {
            "id": "hyayhal",
            "score": 1,
            "text": "BREAKING NEWS: Bernie Sanders Makes Casual Observation, Says What Everyone Was Already Thinking, Continues To Be Largely Ignored By Establishment",
            "title_similarity": "0.4334536",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyaymje",
            "score": 1,
            "text": "People are very stupid!",
            "title_similarity": "0.47036567",
            "sentiment_compound": -0.6105
        },
        {
            "id": "hyayn3f",
            "score": 1,
            "text": "rightfully so Bernie 💚",
            "title_similarity": "0.23554106",
            "sentiment_compound": 0.6666
        },
        {
            "id": "hyayqiw",
            "score": 1,
            "text": "Trump is stupid asf dude literally is on his hands and knees for Putin thinking they’re homies SMH",
            "title_similarity": "0.79563",
            "sentiment_compound": -0.7531
        },
        {
            "id": "hyayynu",
            "score": 1,
            "text": "I think Bernie is wise",
            "title_similarity": "0.20620894",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyayytq",
            "score": 1,
            "text": "Omg. People. Stop giving Trump attention.",
            "title_similarity": "0.43736756",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyayzxe",
            "score": 1,
            "text": "Thank you Bernie, that’s very brave of you.",
            "title_similarity": "0.27847266",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hyaz2fy",
            "score": 1,
            "text": "> ~~Bernie Sanders~~ **Virtually everyone** says Trump's praise for 'Putin's murderous invasion of Ukraine' is 'outrageous'\n\nFIFY",
            "title_similarity": "0.9441122",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyaz2m1",
            "score": 1,
            "text": "C’mon Bernie, you can do better than that. Kick Trump in the nuts, or something.",
            "title_similarity": "0.6161313",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyaz603",
            "score": 1,
            "text": "Bring back bernie’s mittens",
            "title_similarity": "0.2844013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyaz6m3",
            "score": 14,
            "text": "If anyone agrees with Trumps statement you’re a fucking psychopath",
            "title_similarity": "0.6700882",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyazcrp",
            "score": 6,
            "text": "imagine praising russia's actions and the having a fanbase that pretends to be \"patriotic\" \n\nit's lunacy",
            "title_similarity": "0.666446",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyazr43",
            "score": 1,
            "text": "Hi everyone. Please consider donating to help support Ukraine. \n\nHere is a list of charities: https://www.reddit.com/r/ukraine/comments/s6g5un/want_to_support_ukraine_heres_a_list_of_charities/",
            "title_similarity": "0.49882734",
            "sentiment_compound": 0.872
        },
        {
            "id": "hyazya7",
            "score": 2,
            "text": "Hope With all the sanctions going through and the U.S looking into Russian politicians here in the U.S I hope they look into how much money Republicans are making from Russia",
            "title_similarity": "0.68248945",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyazywo",
            "score": 2,
            "text": "You know how it's, like, totally normal to drive around flying a YUUGE Trump flag in the back of your pickup truck?\n\nI guess the new normal is driving around flying both a  Trump flag and a Putin flag in the back of your pickup truck.",
            "title_similarity": "0.4355213",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyb0bbu",
            "score": 2,
            "text": "What is the direct quote of trump saying this?",
            "title_similarity": "0.5118864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb0du0",
            "score": 1,
            "text": "Man if only Sanders was pres",
            "title_similarity": "0.31631002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb0guw",
            "score": 1,
            "text": "True patriot",
            "title_similarity": "0.19619417",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyb0mcg",
            "score": 1,
            "text": "Well, everyone says that.",
            "title_similarity": "0.08146556",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyb0n0r",
            "score": 1,
            "text": "Traitorous?",
            "title_similarity": "0.44049168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb0ob5",
            "score": 1,
            "text": "Sadly He has like 70 million people willing to vote for him again",
            "title_similarity": "0.28647435",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyb0yg3",
            "score": 1,
            "text": "Yeah but it is pretty smart",
            "title_similarity": "0.128192",
            "sentiment_compound": 0.8573
        },
        {
            "id": "hyb0yua",
            "score": 1,
            "text": "You know what else is outrageous - fox news & Laura Ingraham mocking Ukraine President's statement he made last night as his country was being invaded trying reassure his citizens in the face of danger on live TV. Or Charlie Kirk and every other dumb ass conservative virgin that took today's events and managed to make a tweet about it to bash Biden and praise Trump.\n\nEven in the face of one of the most shocking and horrific acts in modern history - republicans/conservatives/right-wing people - whatever you want to call them - find a way to show ZERO empathy and use these tragic events to tweet about Trump, slam Biden, and go against their own and all the civilians involved.\n\nI just cannot wrap my head around how someone becomes such a low life piece of shit human being that they can do that today of all days and continue spewing their hateful vitriol against their own. That video on the front page of Reddit of the Ukrainian dad saying goodbye to his daughters as he stays behind to defend what looks like a losing battle broke me. I will never understand how people can be such pieces of shit. I genuinely cannot comprehend it.",
            "title_similarity": "0.78139657",
            "sentiment_compound": -0.9905
        },
        {
            "id": "hyb0zyw",
            "score": 1,
            "text": "Soooo if Trump was still president he would let Russia do whatever it wants. Maybe even help. Just to think that it could have been an option is just crazy.",
            "title_similarity": "0.67168427",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyb14hb",
            "score": 1,
            "text": "Thank God that Bernie has not fallen for the faux-leftist \"Putin Will Save Us From the Troika\" garbage...\n\nThe left needs to pound this home everywhere they can.  Putin is doing to Ukraine what the Jan 6 fascists tried to do in Washington.  Impose their will on the democratically elected reps of a liberal democracy, using deadly force outside all legal rules.\n\nThe  Kkkonvoy, Y'All Queda, Putin, Belarus, Hungary, the whole right-wing kit and kaboodle - they will not accept elections, governance, rules or restrictions other than the ones that serve white, male, christian, capitalist imperialism.",
            "title_similarity": "0.76238436",
            "sentiment_compound": 0.64
        },
        {
            "id": "hyb15mh",
            "score": 1,
            "text": "In other news water is wet and a bear does indeed shit in the woods.",
            "title_similarity": "0.44984394",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyb197r",
            "score": 1,
            "text": "Completely expected though.",
            "title_similarity": "0.21857491",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb1f41",
            "score": 1,
            "text": "Treasonous?  I’d say it’s Treasonous.",
            "title_similarity": "0.53645205",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyb1nj5",
            "score": 3,
            "text": "Am I a bad person if I - hypothetically of course - had a bottle of champagne in my cellar which will be opened the day either Putin, Trump, Kim Jong-un, Xi Jinping or Bolsoñaro dies? \n\n(Depends on who does it first, the order written would be preferred tho)",
            "title_similarity": "0.5352757",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyb1o3a",
            "score": 1,
            "text": "If democrats were component they would be airing what he said nonstop next to pictures of dead Ukrainian civilians. No idea if that’ll happen though.",
            "title_similarity": "0.61890393",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hyb1opc",
            "score": 1,
            "text": "Very legal and very cool -thumbs up-",
            "title_similarity": "0.09541099",
            "sentiment_compound": 0.5245
        },
        {
            "id": "hyb1rmr",
            "score": 1,
            "text": "Sure is, he wont face consequences for it just like every other outrageous bullshit hes said unfortunately.",
            "title_similarity": "0.4175638",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyb1ru0",
            "score": 1,
            "text": "Not surprising seeing as Putin owns his ass.",
            "title_similarity": "0.5933222",
            "sentiment_compound": -0.6501
        },
        {
            "id": "hyb271m",
            "score": 1,
            "text": "I am quite sure that we will find that Trump is helping Putin with insider details once this pans out.",
            "title_similarity": "0.6642424",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hyb29xx",
            "score": 1,
            "text": "What did Trump say?",
            "title_similarity": "0.40288776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb2l9c",
            "score": 1,
            "text": "What trump meant to imply was Putin thought this attack out. Even though the act of invasion on these terms is evil the move was calculated and educated in regards to benefit Putin. He could have kept his mouth closed but we all know that’s not trumps style.",
            "title_similarity": "0.72204757",
            "sentiment_compound": -0.4611
        },
        {
            "id": "hyb2n4l",
            "score": 1,
            "text": "Overmedicated and undereducated is exactly how they want us",
            "title_similarity": "0.47111148",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyb2ph8",
            "score": 3,
            "text": "Be interesting to see how some subs go from anti-russia and blaming Biden for how awful russia is, to flat out pro-russia now.",
            "title_similarity": "0.79561687",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyb3044",
            "score": 1,
            "text": "Well yea but are we really surprised?\nHe’s proven to be a terrible human time and time again while we keep giving this talking dumpster air time, I’m over it.",
            "title_similarity": "0.5711733",
            "sentiment_compound": 0.1001
        },
        {
            "id": "hyb3a0q",
            "score": 1,
            "text": "*Shakes fist at the sky…*",
            "title_similarity": "0.26592293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb3frv",
            "score": 5,
            "text": "Meanwhile the entirety of America's Republicans standing in line to personally suck off Putin for bringing war against the libs not realizing them and their fascist buddy Putin are the bad guys.",
            "title_similarity": "0.7811497",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hyb3j4h",
            "score": 1,
            "text": "Him not being sentenced to the fullest extent of treason wink wink is outrageous.",
            "title_similarity": "0.64406264",
            "sentiment_compound": -0.7028
        },
        {
            "id": "hyb3ldo",
            "score": 3,
            "text": "I like how he went from not knowing Putin to “knowing him very very well.”",
            "title_similarity": "0.44993642",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyb3s77",
            "score": 1,
            "text": "Didn’t need Bernie for this take, but thank you.",
            "title_similarity": "0.2062886",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hyb3uf8",
            "score": 2,
            "text": "Any republican still supporting trump must have an actual brain disease",
            "title_similarity": "0.57145125",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyb3ydo",
            "score": 1,
            "text": "Why is this news? It would be news if Bernie’s agreed with Trump.",
            "title_similarity": "0.60943055",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyb4a3r",
            "score": 2,
            "text": "When Bernie is getting hawkish, you know russia fucked up.",
            "title_similarity": "0.71602035",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyb4d40",
            "score": 2,
            "text": "Please just make him stop. So done with Trump spanking it for Putin.",
            "title_similarity": "0.77279866",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyb4j1c",
            "score": 1,
            "text": "I feel like Trump is somehow soothing to senile people. Otherwise it makes no sense",
            "title_similarity": "0.37400103",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyb4q05",
            "score": 1,
            "text": "But is anyone really surprised though? \n\n More often than not I think of what the biggest asshole reaction to any given situation can be and I find out that Trump did almost exactly what I envisioned.",
            "title_similarity": "0.6378236",
            "sentiment_compound": 0.4194
        },
        {
            "id": "hyb4qhu",
            "score": 4,
            "text": "I'm so glad Putty-boy didn't do this while Trump was president - if he had US forces would probably have been sent to help protect close friend Russia aganist bad, bad Ukraine.",
            "title_similarity": "0.6780399",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hyb4uiw",
            "score": 2,
            "text": "Got trump praising putin, the GOP blaming biden for russia invading and fox news sucking putins dick. All the major right wing players in america arent even hiding theyre working with russia.",
            "title_similarity": "0.787686",
            "sentiment_compound": -0.276
        },
        {
            "id": "hyb52ru",
            "score": 5,
            "text": "Trump's praise of Putin will continue, as long as the piss tapes go unreleased.",
            "title_similarity": "0.5534282",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyb56vn",
            "score": 1,
            "text": "Wait what did he say",
            "title_similarity": "0.11310815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb5b5b",
            "score": 10,
            "text": "Mr. Trump is a traitor.",
            "title_similarity": "0.69982684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb5n4c",
            "score": 1,
            "text": "What did Trump actually say (the whole thing not just part of it) I can’t find anything.",
            "title_similarity": "0.32724544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb5n84",
            "score": 1,
            "text": "Not outrageous whatsoever.\n\nWhat Trump said was akin to “giving the devil his due.“\n\nTrump believes the President is Neville Chamberlain to Putin‘s Adolf Hitler concerning Czechoslovakia in 1938. It goes without saying that Hitler was a gruesome monster, but give the devil his due, he knew how to work Mr. Chamberlain. Ditto Mr. Putin. Perhaps our president will have more backbone than did Mr. Chamberlain but alas, he is no Winston Churchill.",
            "title_similarity": "0.7152221",
            "sentiment_compound": -0.9261
        },
        {
            "id": "hyb5rn8",
            "score": 1,
            "text": "Because it is.\n\nRonald Reagan is rolling in his grave.  As is Margret Thatcher, Zbigniew Brzezinsk, John McCain and any other conservative who had to deal with the Soviets.",
            "title_similarity": "0.53274417",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyb6d6i",
            "score": 1,
            "text": "Do flag waving Patriots agree Russia is good now?",
            "title_similarity": "0.47697237",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyb6o92",
            "score": 2,
            "text": "\"outrageous?\"\n\nHow about \"completely on-brand for a Russian asset.\"",
            "title_similarity": "0.67584527",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyb6sgw",
            "score": 2,
            "text": "Outrageous but not surprising. The right doesn’t seem to care what the issue is, Their stance is stark contrast to the left. If Biden came out and said he didn’t like the smell of farts, the right would buy every fart scented candle on the planet",
            "title_similarity": "0.57765555",
            "sentiment_compound": 0.6518
        },
        {
            "id": "hyb6v09",
            "score": 2,
            "text": "Captain obvious. I like Bernie.",
            "title_similarity": "0.2782467",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyb6y39",
            "score": 2,
            "text": "Im just curious as to what Putin has offered Trump, I can’t imagine blackmail being enough to get him to be this fucking traitorous. Like Im sure his base would think it was cool if he was getting golden showers from hookers. Is it the roseneft deal, also Im sure trump prefers living in the states and going on warm vacations vs living in frigid russia.",
            "title_similarity": "0.66638756",
            "sentiment_compound": 0.8974
        },
        {
            "id": "hyb72bs",
            "score": 1,
            "text": "Trump is back! First interview on Fox News he blamed America for landing troops in Ukraine. This guy says anything which gives him a few min on the screen.\n\nBtw.. they didn’t land any troops (Russia landed troops)",
            "title_similarity": "0.6184857",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hyb72nm",
            "score": 1,
            "text": "3rd Impeachment time?",
            "title_similarity": "0.29614976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb762g",
            "score": 2,
            "text": "Don't forget baby Goebbels over at fox news cheering these fuckers on.",
            "title_similarity": "0.57153577",
            "sentiment_compound": 0.017
        },
        {
            "id": "hyb76c2",
            "score": 2,
            "text": "Putin complimented tRump and played into his daddy issues, the need for a \"strong man\" to show him adoration.\n\nHe did that exactly because he knew that this would come from it, as he expected tRump to still be in office. The playing field changed, but tRump still hangs onto Daddy Putin's \"love\" like a degenerate puppy.",
            "title_similarity": "0.5496551",
            "sentiment_compound": 0.9489
        },
        {
            "id": "hyb792e",
            "score": 2,
            "text": "Most countries in the world would long ago have taken this disgusting traitor out. That he still gets airtime is appalling.",
            "title_similarity": "0.62392545",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hyb795v",
            "score": 1,
            "text": "No shit bernie. Got any other great things to say. Btw i don't dislike bernie",
            "title_similarity": "0.34100974",
            "sentiment_compound": 0.8484
        },
        {
            "id": "hyb7ixx",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyb7tch",
            "score": 1,
            "text": "But is it surprising?",
            "title_similarity": "0.19986536",
            "sentiment_compound": 0.3919
        },
        {
            "id": "hyb7xb0",
            "score": 1,
            "text": "Damn was hoping for another \"SLAM\" article, but it looks like Bernie didn't slam Trump this time :/",
            "title_similarity": "0.40508392",
            "sentiment_compound": 0.2046
        },
        {
            "id": "hyb8b3h",
            "score": 2,
            "text": "I mean, it is.",
            "title_similarity": "0.06031903",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb8fhm",
            "score": 4,
            "text": "Trump was Putins lap dog",
            "title_similarity": "0.5280949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyb8gas",
            "score": 1,
            "text": "Trump don’t vote him for president he not bother he tramp and he only worth dollar he try make it look good he not bother   Vote Biden",
            "title_similarity": "0.4826892",
            "sentiment_compound": 0.7828
        },
        {
            "id": "hyb8v29",
            "score": 3,
            "text": "Well why doesn’t trump just go live with his buddy then? Piss off finally.",
            "title_similarity": "0.5002133",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyb97fs",
            "score": 2,
            "text": "As outrageous as electing a reality tv star to the highest level of government in one of the most powerful and well armed nations in the history of the world for his first elected position?",
            "title_similarity": "0.47307912",
            "sentiment_compound": 0.352
        },
        {
            "id": "hyb9n87",
            "score": 5,
            "text": "Trump: \"Hail Satan!\"\n\nRepublican politicians: \"Well I guess we worship Satan now.  That's kind of a relief, in a way.  The cognitive dissonance was getting really loud there for awhile.\"",
            "title_similarity": "0.6655458",
            "sentiment_compound": 0.7901
        },
        {
            "id": "hybaf3v",
            "score": 1,
            "text": "Imagine the spin with that lying prick still in charge. He would be sending troops in support. Tell me I am wrong. \n\nAnd as usual, from the GOP? Crickets.",
            "title_similarity": "0.568997",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hybafap",
            "score": 2,
            "text": "Why does this idiot have to insert himself into everything?",
            "title_similarity": "0.4812341",
            "sentiment_compound": -0.596
        },
        {
            "id": "hybakhm",
            "score": 1,
            "text": "Bunch of dumbasses in here",
            "title_similarity": "0.3928886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybakmg",
            "score": 1,
            "text": "At what point does World ask: 1) One old man’s dwindling testosterone levels and a delusional fetish about the bygone days of the former Soviet Union, or 2) The promising lives and dreams and futures of MANY THOUSANDS of young Russians and Ukranians? Once that question gets asked by the right people in the right places, the solution seems obvious.",
            "title_similarity": "0.5971558",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hybawsg",
            "score": 1,
            "text": "The sound you are hearing is Maga dragging goalposts down in controversial.",
            "title_similarity": "0.5550778",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hybbc97",
            "score": 1,
            "text": "It really truly is. It’s a disgrace",
            "title_similarity": "0.46094823",
            "sentiment_compound": -0.0018
        },
        {
            "id": "hybbch0",
            "score": 1,
            "text": "Hard to believe I used to support him. At the time he seemed better than Hilary and I couldn't decide between him and Joe Biden during the last election. I'm really hoping though all Americans can unite to help Ukraine instead of bickering with eachother about what if this and what if that.",
            "title_similarity": "0.5342157",
            "sentiment_compound": 0.8748
        },
        {
            "id": "hybbm2n",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hybbwfu",
            "score": 2,
            "text": "This is the dumbest take on everything happening. \"A hurrrr, Trump say good thing on bad man.\" Listen to the context. Fucking stupid.",
            "title_similarity": "0.65628624",
            "sentiment_compound": -0.8221
        },
        {
            "id": "hybbx4n",
            "score": 1,
            "text": "Ukraine is getting fucking bombarded and Mfs still make it about trump",
            "title_similarity": "0.7904767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybc5h0",
            "score": 2,
            "text": "\"Says?\" More like points out the obvious.",
            "title_similarity": "0.15770724",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hybcgne",
            "score": 3,
            "text": "yeah, I'm all for freedom of speech but they need to shut that fuck down. trump is not an American. trump is for trump and trump only. and ANYONE who believes different should join trump in russia. yeah. go on.\n\nedit to remove the words fucking pussies.",
            "title_similarity": "0.7274261",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hybcjup",
            "score": 1,
            "text": "Then trump fucked some whores, ate some documents, shit himself, tried to overthrow the government, and bilked people out of hundreds of millions of dollars. And Bernie sanders called it “outrageous!”",
            "title_similarity": "0.7332722",
            "sentiment_compound": -0.923
        },
        {
            "id": "hybcx9n",
            "score": 3,
            "text": "I mean Russia is a republicans wet dream because lets face it; Russia is what they want the US to become.\n\n\\-an oligarchy with a nationalistic strongman at the top that doesn't even pretend to give a shit about people on the bottom\n\n\\-brown people and openly LGBT people are openly harassed and beaten on the streets and no one blinks an eye, it's their proper place after all\n\n\\-The ruling class plays up \"traditional\" values while living not so secret hedonistic lifestyles, tradition is for the peasantry after all.\n\nThe thought of America becoming more like Russia gives every red blooded republican a good hard on.",
            "title_similarity": "0.65635014",
            "sentiment_compound": 0.2474
        },
        {
            "id": "hybd0lw",
            "score": 2,
            "text": "I’m sure Putin will allow him to build  a golf course on the land he will be taking from Ukraine",
            "title_similarity": "0.43885562",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hybd10l",
            "score": 3,
            "text": "John McCain would shit a brick about Trump’s comment if he were alive today.",
            "title_similarity": "0.692315",
            "sentiment_compound": -0.25
        },
        {
            "id": "hybd3ad",
            "score": 6,
            "text": "Well Trump is a spineless soulless traitor of course he would praise Pootin 💨",
            "title_similarity": "0.7123555",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hybdfs5",
            "score": 1,
            "text": "I can’t even imagine the madness of this would have happened during the Trump term.",
            "title_similarity": "0.4508682",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hybdyzo",
            "score": 2,
            "text": "Trump has a habit of praising authoritarian (quasi) dictators. really tells you he wants to become one.",
            "title_similarity": "0.66899586",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hybe1r9",
            "score": 1,
            "text": "What did trump say?",
            "title_similarity": "0.40288776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybe2bb",
            "score": 3,
            "text": "Trump, in a time of national crisis, praises the invading tyrant, slams our President, and inflates his own bloated ego.",
            "title_similarity": "0.7888444",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hybe2i5",
            "score": 1,
            "text": "The world is fucked. What Russia is going to get away with is showing the rest of the world this kind of shit is OK but might cost your country some money. Trump at his little Mar-a-lago event said chinas going to do the same thing to Taiwan next bc of this.",
            "title_similarity": "0.6812801",
            "sentiment_compound": -0.4905
        },
        {
            "id": "hybecbs",
            "score": 2,
            "text": "I swear, if Trump's shitty ass doesn't get jailed for SOMETHING, our society is doomed. Pieces of shits constantly have no accountability for their actions.....unless they are poor of course.",
            "title_similarity": "0.60319054",
            "sentiment_compound": -0.9536
        },
        {
            "id": "hybemb0",
            "score": 1,
            "text": "What did trump say?",
            "title_similarity": "0.40288776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyberzv",
            "score": 2,
            "text": "In other news, water is wet.",
            "title_similarity": "0.18174565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybetw7",
            "score": 2,
            "text": "Even for Trump, this is a low water mark.",
            "title_similarity": "0.33682874",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hybfd4z",
            "score": 1,
            "text": "I love how I didn't know he said this because none of his propaganda and lies ever reach me now.",
            "title_similarity": "0.44074017",
            "sentiment_compound": 0.5007
        },
        {
            "id": "hybffat",
            "score": 2,
            "text": "Guys trump is happy because they didn’t bend to his will as far as provide hunter biden info or lose your funding! Trump lost and Ukraine called his bluff! That’s why Trump is a tyrant loving moron who should be on trial for treason",
            "title_similarity": "0.7117648",
            "sentiment_compound": -0.4738
        },
        {
            "id": "hybfmag",
            "score": 3,
            "text": "Praising any dictator and tyrant is despicable, whether it’s Putin, Kim Jong, Fidel Castro. Trump is a bafoon.",
            "title_similarity": "0.79915255",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hybfo0j",
            "score": 2,
            "text": "Trump is such a bell end.",
            "title_similarity": "0.5386822",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybfpz8",
            "score": 1,
            "text": "Anyone have a link to what he said?",
            "title_similarity": "0.12860025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybg5bs",
            "score": 2,
            "text": "Wait until you watch his full phone interview with Laura Ingraham…",
            "title_similarity": "0.25712207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybgcaw",
            "score": 2,
            "text": "Trump is a screwed up person. He’s against the invasion, but simultaneously praising Putin for his genius move. It’s similar to calling Hitler a genius, but not posthumously. (Yes, I understand Putin isn’t as bad as Hitler, and that Russians hate Hitler.)",
            "title_similarity": "0.7683792",
            "sentiment_compound": -0.8761
        },
        {
            "id": "hybgo2w",
            "score": 1,
            "text": "The world had luck that Biden is president now and not trump. Can you imagine trump, a putin fan, being in charge now? My god",
            "title_similarity": "0.59002924",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hybgrmc",
            "score": 1,
            "text": "Well, he ain’t wrong!",
            "title_similarity": "0.06619078",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hybgs80",
            "score": 2,
            "text": "At this point honestly it's not even hyperbole. Trump should face execution for treason. That boy literally launched an attack on the capital building and praises a foreign dictator for trying to take land from a sovereign country? If some US general did those things you bet your ass the court martial would end in a execution sentence.",
            "title_similarity": "0.73737",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hybgzfp",
            "score": 2,
            "text": "If China decides to hook up with Russia and  invades Taiwan,  this is going to be like a deja vu from WW2 and the USA will be pulled into war regardless.   Trump is basically a traitor. He is working with a \"Hitler\" type.  He is dangerous and for calling Putin a Genius he should be put in a jail cell and contained under suspicion of conspiring with the enemy!  \n\nMeanwhile, Europe is at war yet again.",
            "title_similarity": "0.7623788",
            "sentiment_compound": -0.9412
        },
        {
            "id": "hybh703",
            "score": 2,
            "text": "Trump also tied the escalating tensions in Ukraine to long-standing conservative grievances about immigration, saying that the US should employ military force akin to that used by Russia to ensure the US-Mexico border was secure.\n\n\"We could use that on our southern border. That's the strongest peace force I've ever seen. There were more army tanks than I've ever seen,\" Trump said. \"They're going to keep peace all right. No, but think of it. Here's a guy who's very savvy. … I know him very well — very, very well.\"",
            "title_similarity": "0.6652553",
            "sentiment_compound": 0.8989
        },
        {
            "id": "hybhnhq",
            "score": 4,
            "text": "After Trumps praise of glorious soviet putin, I don't want to hear another word about how Bernie is a socialist.",
            "title_similarity": "0.6613158",
            "sentiment_compound": 0.8214
        },
        {
            "id": "hybi4ru",
            "score": 1,
            "text": "Organise protests in your countries, demand an embargo on Russia from your governments.",
            "title_similarity": "0.689373",
            "sentiment_compound": -0.34
        },
        {
            "id": "hybi5is",
            "score": 1,
            "text": "Any PR is good PR.  Trump is just a game show host looking for likes.",
            "title_similarity": "0.48530215",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hybikxr",
            "score": 3,
            "text": "/r/conservative meanwhile is busy blaming Biden, while Trump is literally cheering on Putin.\n\nLol.  How do these idiots even live with themselves?",
            "title_similarity": "0.81626546",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hybirov",
            "score": 2,
            "text": "Just came here to say that any American who supports or praises a dictator like Putin is a  traitor.",
            "title_similarity": "0.8366785",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hybit44",
            "score": 1,
            "text": "So trump said something outrageous?!?  He always seemed so reasonable and kindly though!!!",
            "title_similarity": "0.3428997",
            "sentiment_compound": 0.4573
        },
        {
            "id": "hybj55h",
            "score": 2,
            "text": "Trump is a Russian agent, why would he do otherwise?",
            "title_similarity": "0.6330702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybj7i6",
            "score": 1,
            "text": "Captain obvious",
            "title_similarity": "0.17919336",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybjejv",
            "score": 2,
            "text": "Actually its treason.",
            "title_similarity": "0.50926715",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hybjop5",
            "score": 2,
            "text": "Bernie is correct.",
            "title_similarity": "0.18144667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybjoy3",
            "score": 2,
            "text": "Trump has a soft spot for authoritarians.",
            "title_similarity": "0.51724386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybjqxd",
            "score": 1,
            "text": "Know your enemies",
            "title_similarity": "0.39553672",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hybjxo5",
            "score": 2,
            "text": "Fuck Putin and Fuck Trump!!",
            "title_similarity": "0.72974664",
            "sentiment_compound": -0.8217
        },
        {
            "id": "hybk8zi",
            "score": 3,
            "text": "Well Trump is basically a Russian asset, so who's surprised by this?",
            "title_similarity": "0.65298486",
            "sentiment_compound": 0.6983
        },
        {
            "id": "hybkh7z",
            "score": 1,
            "text": "Let us not forget we weren’t far off from doing the same\n\nhttps://www.google.com/amp/s/www.rollingstone.com/politics/politics-news/stephen-miller-border-troops-trump-mexico-cartels-1244716/amp/",
            "title_similarity": "0.5197842",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hybku8o",
            "score": 2,
            "text": "He didn’t just say it’s genius.  That could be possibly dismissed as “out of context.”  He spent several minutes just praising the shit out of Putin and bragging about how they are friends two different times.  Anyone can listen to the recording.  It’s in the first ten minutes here https://www.clayandbuck.com/president-trump-with-cb-from-mar-a-lago/",
            "title_similarity": "0.522448",
            "sentiment_compound": 0.891
        },
        {
            "id": "hybl18o",
            "score": 2,
            "text": "Trump is a lunatic just like Putin!",
            "title_similarity": "0.79489565",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hybl5z4",
            "score": 3,
            "text": "Biden has not been great, but it's days like today that assure me I made the correct decision.",
            "title_similarity": "0.35386658",
            "sentiment_compound": 0.6373
        },
        {
            "id": "hyblcsf",
            "score": 2,
            "text": "One of the most heinous comments a former leader could make, but Donald wasn't a leader lmao. It was still pathetically low even for his shameless ass to say.\n\nHe's s stain on world history not just american.",
            "title_similarity": "0.6024056",
            "sentiment_compound": -0.9608
        },
        {
            "id": "hyblfnx",
            "score": 1,
            "text": "By everyone taking about him, doesn’t he win? That’s all he wants.",
            "title_similarity": "0.37361598",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hybllua",
            "score": 1,
            "text": "I think we can all agree on this one.",
            "title_similarity": "0.091597766",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hybm0mr",
            "score": 3,
            "text": "Looks like the Russians have invaded Reddit comment sections too.",
            "title_similarity": "0.72575027",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hybm450",
            "score": 1,
            "text": "These people really need to stop redirecting the spot light and take answer questions and take action trumps not president anymore means nothing and is not that smart! Be accountable now!",
            "title_similarity": "0.57134503",
            "sentiment_compound": -0.6492
        },
        {
            "id": "hybmar3",
            "score": 2,
            "text": "He can't not praise it or putin might finally release the pee tape",
            "title_similarity": "0.5409573",
            "sentiment_compound": 0.345
        },
        {
            "id": "hybmefp",
            "score": 3,
            "text": "Send tRump there, permanently",
            "title_similarity": "0.39127296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybmh3v",
            "score": 3,
            "text": "Trump holds secrets of the presidency and of American warfare and defence systems. As there has now been people killed on both sides, isn’t Trump giving support to the enemy? Shouldn’t his every move, every word, every phone call, every visit be scrutinized? I’m serious.",
            "title_similarity": "0.71785736",
            "sentiment_compound": -0.7476
        },
        {
            "id": "hybmobg",
            "score": 2,
            "text": "Can we arrest the fucking traitor yet?",
            "title_similarity": "0.54333127",
            "sentiment_compound": -0.34
        },
        {
            "id": "hybnjmd",
            "score": 2,
            "text": "Well said.",
            "title_similarity": "0.049454868",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hybnvvy",
            "score": 3,
            "text": "so glad trump is banned from Twitter....\nThis would have just been an grandstanding event for him.",
            "title_similarity": "0.5778234",
            "sentiment_compound": 0.0754
        },
        {
            "id": "hybo4b4",
            "score": 3,
            "text": "It's a traitor simple as that.",
            "title_similarity": "0.43756443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybod7g",
            "score": 3,
            "text": "It is so painfully obvious that his loyalties don’t lie anywhere close to America. But his army of sycophants are the same people that endlessly brag about their patriotism.\n\nI can’t wrap my head around it. He crosses a new line like every day, and the Republican party and millions of Americans still stay on his side. Fox News is downplaying the war and criticizing Zelensky. This latest Putin praise is so disgusting, it’s unconscionable.",
            "title_similarity": "0.6766418",
            "sentiment_compound": -0.568
        },
        {
            "id": "hybof05",
            "score": 2,
            "text": "Trump: “There are American amphibians landing in Odessa, Texas as we speak. Little green frog-men. The likes of which you’ve never seen…”",
            "title_similarity": "0.37695232",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyboodr",
            "score": 3,
            "text": "And not out of character",
            "title_similarity": "0.0127184605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybp7bz",
            "score": 1,
            "text": "\"Trump's praise for 'Putin's murderous invasion of Ukraine' is 'outrageous'\"  \ntrumps fawning over putin is what emboldened putin. If you'd had someone that stood up to putin and didn't kiss his ass, things may have turned out differently.",
            "title_similarity": "0.91420877",
            "sentiment_compound": -0.4735
        },
        {
            "id": "hybpeyi",
            "score": 2,
            "text": "I mean, a more accurate title would start with “Everyone says…”",
            "title_similarity": "0.2584624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybpl7o",
            "score": 5,
            "text": "Trump and his MAGA minions are __*traitors*__ to this country.",
            "title_similarity": "0.7543845",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybpwoh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17154181"
        },
        {
            "id": "hybpxlb",
            "score": 3,
            "text": "Donald Trump is a traitor and a coward.",
            "title_similarity": "0.71184355",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hybq1p9",
            "score": 3,
            "text": "Okay but imagine if Trump had still been in office when this was going on.",
            "title_similarity": "0.23644096",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hybq2h5",
            "score": 3,
            "text": "No it’s fucking treasonous is what it is.",
            "title_similarity": "0.5146601",
            "sentiment_compound": -0.7346
        },
        {
            "id": "hybqsom",
            "score": 3,
            "text": "Please remember that Republicans are not conservatives. \n\nTrue conservatives don't praise anti-humans like Putin. \n\nRepublicans are not conservatives.\n\nRepublicans are anti-Americans.",
            "title_similarity": "0.5464126",
            "sentiment_compound": -0.6207
        },
        {
            "id": "hybqyks",
            "score": 1,
            "text": "Aid and comfort.",
            "title_similarity": "0.01990083",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hybreae",
            "score": 2,
            "text": "Trump can move to Russia",
            "title_similarity": "0.44650608",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybs90u",
            "score": 1,
            "text": "And he'd be right, but the people running that feel the bern page def feel differently.",
            "title_similarity": "0.50071335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybs94i",
            "score": 2,
            "text": "GOP are cowards and traitors. Shame on them.",
            "title_similarity": "0.58919954",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hybslsn",
            "score": 2,
            "text": "I love you Bernie. You have been speaking truth in a place of madmen (congress) for decades.",
            "title_similarity": "0.39049637",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hybsmcw",
            "score": 1,
            "text": "He would say anything for some attention",
            "title_similarity": "0.2106348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybssdq",
            "score": 1,
            "text": "I've been hearing a lot about what Trump has been doing and saying in support of Russia and Putin, but does anyone have a list or something.",
            "title_similarity": "0.5774651",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hybsvmj",
            "score": 2,
            "text": "Trump is russian puppet. What did he expect?",
            "title_similarity": "0.6303477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybt4s0",
            "score": 1,
            "text": "It is disgusting.  Putin the most hated man in the world.",
            "title_similarity": "0.66389066",
            "sentiment_compound": -0.8357
        },
        {
            "id": "hybteyx",
            "score": 1,
            "text": "Outrageous but not surprising.",
            "title_similarity": "0.31348124",
            "sentiment_compound": -0.4975
        },
        {
            "id": "hybtqv1",
            "score": 1,
            "text": "Just straight up greed and evilness",
            "title_similarity": "0.5852114",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hybu4eo",
            "score": 1,
            "text": "Don the traiterous lump of old grey dog shit. Wouldn't expect anything less.",
            "title_similarity": "0.46834916",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hybu6y1",
            "score": 3,
            "text": "Trump supporters need to be aggressively and *relentlessly* ostracized. There is no more reason to tolerate them or their feckless abuse of democracy by voting for a corrupt lunatic who praises the possible beginnings of WW3 and the needless murder in Ukraine.\n\nDon't ever let a single one of them enjoy the fruit of your lives.",
            "title_similarity": "0.7477133",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hybud23",
            "score": 1,
            "text": "I used to think  HE was the better of the two that were just in the election in 2020  , but I was blinded he’s a fucking idiot . Putin is on the verge of acting like that failed artist in 1939, and to support that is inhumane. Putin IS like a rabid dog and it’s up to the UN to put it down",
            "title_similarity": "0.74473876",
            "sentiment_compound": 0.1681
        },
        {
            "id": "hybud34",
            "score": 1,
            "text": "This is what I saw Trump say, “If I were in Office, this deadly Ukraine situation would never have happened!”  “Putin is playing Biden like a drum. It is not a pretty thing to watch!”",
            "title_similarity": "0.7277263",
            "sentiment_compound": 0.3085
        },
        {
            "id": "hybuh83",
            "score": 1,
            "text": "Build the wall , over population is the only thing that will kill the Earth, or nukes",
            "title_similarity": "0.51402783",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hybuiuo",
            "score": 1,
            "text": "I agree.  And if we get involved in actual fighting, it would be treasonous.  Guess what the penalty for treason during war is.",
            "title_similarity": "0.6775934",
            "sentiment_compound": -0.926
        },
        {
            "id": "hybutll",
            "score": 1,
            "text": "Trump is just dumb. All he had to say is invasion bad",
            "title_similarity": "0.6711718",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hybuxpx",
            "score": 1,
            "text": "Bernie is right. Trump supporters will try to spin Trump’s words as usual.",
            "title_similarity": "0.59016913",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hybuzka",
            "score": 1,
            "text": "This is just another version of “They’re good people, on both sides.”",
            "title_similarity": "0.25570053",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hybv22k",
            "score": 2,
            "text": "Why doesnt he move to Russia. #bootlickerTrump",
            "title_similarity": "0.55619854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybv2py",
            "score": 1,
            "text": "Does Trump not remember the failure of the Soviet Union? Why would anyone praise Putin?",
            "title_similarity": "0.7087745",
            "sentiment_compound": 0.7692
        },
        {
            "id": "hybv3vk",
            "score": 2,
            "text": "The fact that people still support trump just goes to show how many imbeciles live in the US.",
            "title_similarity": "0.60061336",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hybvkjr",
            "score": 2,
            "text": "That was low even for trump",
            "title_similarity": "0.32016882",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hybvpsu",
            "score": 1,
            "text": "https://winstonchurchill.org/resources/speeches/1930-1938-the-wilderness/the-munich-agreement/",
            "title_similarity": "0.3147575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybvqgw",
            "score": 1,
            "text": "trump is fucking disgusting",
            "title_similarity": "0.66679215",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hybvrff",
            "score": 1,
            "text": "Why is Bernie the only one speaking for the people?",
            "title_similarity": "0.14114287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybwms3",
            "score": 1,
            "text": "\nI don’t agree with Bernie on a lot of things but I do on this. \nAmen Bernie. \nTrump’s a stupid, self-centered psychopath….and that’s being polite.",
            "title_similarity": "0.6346773",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hybwqkr",
            "score": 1,
            "text": "I’m not a fan of Bernie, but on this - I 100% agree!!",
            "title_similarity": "0.5102765",
            "sentiment_compound": 0.5192
        },
        {
            "id": "hybwte8",
            "score": 1,
            "text": "\"Wow\"",
            "title_similarity": "0.09816523",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hybwuip",
            "score": 1,
            "text": "r/conservative also drawing “similarities” between what looks like the bombing of Ukrainian buildings to “peaceful BLM protests”. \n\nAll of these right wing nut jobs should just be shipped off to Russia.",
            "title_similarity": "0.7370041",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hybwvt3",
            "score": 2,
            "text": "republican defense of the situation is now “this wouldn’t have happened if trump were in office!”\n\nyes it would have, and the us would be supporting russia",
            "title_similarity": "0.6006819",
            "sentiment_compound": 0.75
        },
        {
            "id": "hybxao5",
            "score": 1,
            "text": "I’m just trying to find what he said",
            "title_similarity": "0.15118691",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybxow7",
            "score": 1,
            "text": "It should be treasonous dammit!",
            "title_similarity": "0.59314626",
            "sentiment_compound": -0.6114
        },
        {
            "id": "hybxq7b",
            "score": 1,
            "text": "Outrageous and expected.",
            "title_similarity": "0.43456474",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyby4ir",
            "score": 1,
            "text": "Yup. His mere existence is outrageous.",
            "title_similarity": "0.5016445",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hybyhg1",
            "score": 2,
            "text": "This is coming from the guy who had his honeymoon is Soviet Moscow",
            "title_similarity": "0.33535373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybyjcf",
            "score": 2,
            "text": "It’s treasonous",
            "title_similarity": "0.46945137",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hybykcv",
            "score": 2,
            "text": "I mean is ANYONE surprised?",
            "title_similarity": "0.15172772",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hybysjs",
            "score": 2,
            "text": "Trump also didn't care Russia had a hit list for US personnel in Syria. Dude is literally the definition of an idiot that drags their own team down.",
            "title_similarity": "0.7106729",
            "sentiment_compound": -0.7669
        },
        {
            "id": "hybyz7k",
            "score": 2,
            "text": "R/conservatives is tying itself in knots trying to justify supporting a traitor.",
            "title_similarity": "0.62632406",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hybz76m",
            "score": 1,
            "text": "It’s not outrageous, it’s sedition",
            "title_similarity": "0.25442898",
            "sentiment_compound": 0.5875
        },
        {
            "id": "hybzku7",
            "score": 1,
            "text": "It's outrageous, egregious, preposterous.",
            "title_similarity": "0.5033157",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hybzmxc",
            "score": 2,
            "text": "Traitorous, practically.",
            "title_similarity": "0.45444793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybzyny",
            "score": 1,
            "text": "What did trump say? Just wondering. Haven’t looked into it yet",
            "title_similarity": "0.28956214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc05z8",
            "score": 1,
            "text": "It’s treason.",
            "title_similarity": "0.483761",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyc08xl",
            "score": 1,
            "text": "He’s right",
            "title_similarity": "0.13933879",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc0ajn",
            "score": 1,
            "text": "Outrageous and typical.",
            "title_similarity": "0.2654264",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyc0d5h",
            "score": 1,
            "text": "Well no shit. 99% of the shit he says is ridiculous",
            "title_similarity": "0.52442807",
            "sentiment_compound": 0.7596
        },
        {
            "id": "hyc0fo7",
            "score": 1,
            "text": "So Bernie is pro-war this time?  Funny how Dems are the ones beating war drums this time.  Usually it’s Republicans.  What’s gives?  It’s almost like both parties have been bought and paid for by the same people.",
            "title_similarity": "0.5819144",
            "sentiment_compound": -0.182
        },
        {
            "id": "hyc10hw",
            "score": 3,
            "text": "Fuck trump fuck Putin who definitely fucked trump.",
            "title_similarity": "0.8094114",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hyc17wt",
            "score": 1,
            "text": "Did anyone actually listen to the podcast or instead just choose to read the article in this thread? In no way am I trying to defend Trump’s psychotic nature but he’s clearly not in support of Russia’s invasion of Ukraine. He is voicing a very “trump” satirical take on the fact that Putin is an evil genius for justifying his invasion by claiming portions of Ukraine state as “independent” and his troops as “peace keepers”. I just don’t understand how the media labels this as him “praising” Putin…are we Americans not educated enough to understand context and instead just expected to take selected words on an article as definitive truth?",
            "title_similarity": "0.7398671",
            "sentiment_compound": -0.6648
        },
        {
            "id": "hyc1gll",
            "score": 1,
            "text": "Pretty sure he’s praising the tactics kinda like admiring that Rommel was a brilliant tactician shitty politics and surrounded by evil but the strategies he came up with changed warfare forever",
            "title_similarity": "0.7049633",
            "sentiment_compound": 0.2178
        },
        {
            "id": "hyc1ia7",
            "score": 1,
            "text": "A con man fucked America into election, had the worst 4 years possible, become a traitorous bastard who only damaged us, and then left. No surprises. Just pure disappointment.",
            "title_similarity": "0.63544315",
            "sentiment_compound": -0.9631
        },
        {
            "id": "hyc29i9",
            "score": 2,
            "text": "Yeah, no shit Bernie.",
            "title_similarity": "0.122968994",
            "sentiment_compound": 0.6278
        },
        {
            "id": "hyc2knu",
            "score": 1,
            "text": "Can someone link me to where Trump praised this invasion of Ukraine?",
            "title_similarity": "0.7894985",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyc3369",
            "score": 1,
            "text": "Outrageous… that’s being kind",
            "title_similarity": "0.33302718",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hyc376r",
            "score": 1,
            "text": "He has a point it's due to the fact that the[republican MAGA faction Under Trump that includes Tucker Carlson & Trump ally Candace Owens repeating Russian Propoganda about the Ukraine Confilict and Biden Took this from CNN SE Cupp.](https://www.cnn.com/videos/opinions/2022/02/23/se-cupp-unfiltered-trump-putin-gop-fox-vpx.cnn/video/playlists/this-week-in-politics/) [Same Time Rep Greene supports the Russian Invasion by following Trump the MAGA Faction GOP leader](https://www.msn.com/en-us/news/politics/marjorie-taylor-greene-and-the-maga-world-position-on-ukraine-biden-a-warmonger-who-is-weak-did-something-wrong/ar-AAUheIK?ocid=uxbndlbing)",
            "title_similarity": "0.77584434",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyc38t5",
            "score": 1,
            "text": "I am so tired of this.    Do something about it.   PLEASE.  \n\nSeriously.   It seems like every other day you hear Trump is being investigated for this, or suspected of doing that.    He is still out on the street free and re-electable.   \n\nDO SOMETHING.   You can grasp pearls all you want.  No one cares.",
            "title_similarity": "0.41831467",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hyc3d96",
            "score": 2,
            "text": "Trump is a cancer and Putin is a plague.",
            "title_similarity": "0.6452789",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyc43hk",
            "score": 1,
            "text": "It may be outrageous, but it was not unexpected.   I expected it.  I'm sure a bunch of other democrats did too.",
            "title_similarity": "0.43209493",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hyc4rr3",
            "score": 1,
            "text": "Everyone should be throwing their backpacks at trump right now.\n\nhttps://youtube.com/shorts/BZcMDqu3mnw?feature=share",
            "title_similarity": "0.60806537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc4ztm",
            "score": 1,
            "text": "No it's irrelevant. The only news I care about from trump is when our judicial system does what they need to and send him to jail for instigating a coup. Anything else is a literal waste of space.",
            "title_similarity": "0.64243084",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyc5bv1",
            "score": 1,
            "text": "He must owe Russia a lot of money",
            "title_similarity": "0.562896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc5by4",
            "score": 1,
            "text": "Who?",
            "title_similarity": "0.061728965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc5gsn",
            "score": 1,
            "text": "Dude it legit is genius… he took advantage of the political situation. This page pumps out some facts, huh? 🤡",
            "title_similarity": "0.55244595",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyc5mmq",
            "score": 1,
            "text": "And Bernie is understating the issue.",
            "title_similarity": "0.29894894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc5v4d",
            "score": 1,
            "text": "Its almost like he's a seditious fucking traitor or something.",
            "title_similarity": "0.58760935",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hyc5w91",
            "score": 1,
            "text": "Stop Fake News!",
            "title_similarity": "0.41213512",
            "sentiment_compound": -0.68
        },
        {
            "id": "hyc6r96",
            "score": 1,
            "text": "Outrageous is putting Heinz ketchup on steak that is cooked to leather.  Trump supporting Putin is traitorous.  He is cheering for the murder of innocent people.",
            "title_similarity": "0.722752",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyc732b",
            "score": 1,
            "text": "Yes blame trump while our current weak af president enabled a dictator to take over another country. Mr mean tweets is the real problem smfh.",
            "title_similarity": "0.7450671",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyc794d",
            "score": 1,
            "text": "Trump loves the taste of Putin's cock.",
            "title_similarity": "0.63061184",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hyc7cdb",
            "score": 2,
            "text": "My trump-loving parents take on the situation: \"[Trump]'s praising *what* [Putin]'s doing, not *how* he's doing it, it's completely different.\"",
            "title_similarity": "0.69245017",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyc7fdx",
            "score": 1,
            "text": "Mental gymnastics",
            "title_similarity": "0.028696584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc7kay",
            "score": 1,
            "text": "Trump is senile",
            "title_similarity": "0.42178383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc7kfu",
            "score": 1,
            "text": "Isnt that treasonous?",
            "title_similarity": "0.44270384",
            "sentiment_compound": 0.4585
        },
        {
            "id": "hyc87se",
            "score": 1,
            "text": "I love Bernie :(",
            "title_similarity": "0.26753402",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyc8h8c",
            "score": 1,
            "text": "Fucking facts",
            "title_similarity": "0.18881118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc8psy",
            "score": 3,
            "text": "Trump: “Putin is a genius for invading Ukraine”.\nAlso Trump: “What I said was fake news but I also stand by what I said”.",
            "title_similarity": "0.8666381",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hyc8u44",
            "score": 2,
            "text": "An ex-KGB communist thug invading a fledgling democracy is indeed outrageous.\nThe sight of Republicans siding with an ex-KGB communist thug has left me deeply shaken.",
            "title_similarity": "0.74073684",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hyc8wmy",
            "score": 1,
            "text": "I can't believe I used to support this.",
            "title_similarity": "0.26118636",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyc9vl9",
            "score": 1,
            "text": "Treason",
            "title_similarity": "0.45049703",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hycaqss",
            "score": 2,
            "text": "Putin useful idiot (Trump) did a lot of damages now Putin is reaping the benefits",
            "title_similarity": "0.7996079",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hycbbtr",
            "score": 3,
            "text": "**TWO DICTATORS FORMING AN EMPIRE?**  \nWhy did Trump meet privately with Putin with no interpreters and no notes?  \nWhat could they have possibly been planning?  \nWhat is Trump hiding?  \nMaybe we need to take another look at this time period.\n\n[Trump-Putin Meeting](https://www.11alive.com/article/news/nation-now/donald-trump-says-he-gave-up-nothing-in-putin-summit-but-offers-no-specifics-on-talks/465-3e396bc6-976d-4c2a-ab3a-3fc427bb0e05)",
            "title_similarity": "0.5436441",
            "sentiment_compound": -0.7622
        },
        {
            "id": "hycbx53",
            "score": 2,
            "text": "It is treason.",
            "title_similarity": "0.48898166",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hycc3gk",
            "score": 2,
            "text": "Here's my theory:\n\nTrump and Putin are BFFs.  Putin gets Trump into office.  Trump divides a nation by focusing on election fraud.  COVID happens and he uses that to divide it even more.  Had he been reelected, Putin would have a strong ally on his side, a loss with enough whining and division leads to a weakend enemy.\n\nUSA has the world's 3rd largest army but we are too divided to actually step in if we wanted too.",
            "title_similarity": "0.7318786",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyccdnr",
            "score": 1,
            "text": "Sure a good amount of people are saying it",
            "title_similarity": "0.131567",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyccrkl",
            "score": 1,
            "text": "Bernie, why do you react to this nut?? He is a nothing!!!",
            "title_similarity": "0.4577368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycdeeg",
            "score": 1,
            "text": "He should be forced to visit Ukraine and look death in the face.",
            "title_similarity": "0.6314081",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hycdi14",
            "score": 1,
            "text": "Just Trump being the usual tasteless showman. \n\nYour Bernie’s proposals are almost as wild.",
            "title_similarity": "0.6512705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycedyk",
            "score": 2,
            "text": "Fascists like fascists.",
            "title_similarity": "0.39765295",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hycf7f3",
            "score": 1,
            "text": "any trump related headline should only read: Trump, durr",
            "title_similarity": "0.49654472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycf931",
            "score": 1,
            "text": "Trump is a scumbag like his father, and his grandfather, and…",
            "title_similarity": "0.59071434",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hycfp66",
            "score": 1,
            "text": "I was just wondering what Sanders was thinking.",
            "title_similarity": "0.2578118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycfv2e",
            "score": 1,
            "text": "Trump loves communism\nAlso,  we have trolls that drink vodka.",
            "title_similarity": "0.6285461",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hycfv4o",
            "score": 1,
            "text": ">By the way, this never would have happened with us. Had I been in office, not even thinkable. This would never have happened\n\nRest of the quote for those of you who care. Smart =/= morally right or justified",
            "title_similarity": "0.36761796",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hycg0pk",
            "score": 1,
            "text": "Anyone else hear Bernie’s voice when you read “outrageous”",
            "title_similarity": "0.3486798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycgudf",
            "score": 1,
            "text": "Considering you can pull up enough clips of the American right praising putin to make a video montage its not unexpected",
            "title_similarity": "0.5974498",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hychma4",
            "score": 1,
            "text": "Don’t worry guys, r/conservative is also praising Putin cause ya know.... real Americans praise a communistic murderous in humane, shriveled testicle.",
            "title_similarity": "0.7392305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hychrey",
            "score": 1,
            "text": "Just a citizen of a NATO ally. We can’t help Ukraine with troops because of nukes and such right now, but Trump being all putin-licky-licky, can’t we take him out?",
            "title_similarity": "0.6857506",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hychzlm",
            "score": 2,
            "text": "Four years of Trump as president and y'all still don't understand how Trump talks...?",
            "title_similarity": "0.41509122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyci498",
            "score": 1,
            "text": "Putin owns the Biden family, which is painfully obvious. Ask any Ukrainian.",
            "title_similarity": "0.6701491",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyci5hy",
            "score": 2,
            "text": "Praise and support are not the same. You can praise Nazi Germany invasion of France because it’s literally one of the greatest military victories in history. No way on earth would anyone support it though.",
            "title_similarity": "0.6756122",
            "sentiment_compound": 0.9393
        },
        {
            "id": "hyciejc",
            "score": 1,
            "text": "Put traitor Trump in prison already",
            "title_similarity": "0.5811031",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hycii04",
            "score": 1,
            "text": "Trump is not pro Putin, what are you guys talking about",
            "title_similarity": "0.55746734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycikvt",
            "score": 2,
            "text": "I wouldn’t call it praise. Trump was just acknowledging how Putin saw an opportunity and took it and we did absolutely nothing about it. From Putin’s POV it was genius.",
            "title_similarity": "0.63831276",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hycil9x",
            "score": 1,
            "text": "Not what happened but doesn't matter.",
            "title_similarity": "0.095589235",
            "sentiment_compound": -0.0286
        },
        {
            "id": "hyciqgv",
            "score": 2,
            "text": "Why the GOP still supports him is beyond me. \nI thought the domestic terrorism would wake them up but I guess not",
            "title_similarity": "0.48264363",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hycivoy",
            "score": 3,
            "text": "Trump absolutely disgusts me.",
            "title_similarity": "0.637439",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hyciz2p",
            "score": 1,
            "text": "Wow Bernie, like Trump doesn’t love it when you call him outrageous, that just encourages him.  Kick it up a notch snd call it what it really is…treasonous.  And then encourage the justice dept to charge him with it.",
            "title_similarity": "0.75073206",
            "sentiment_compound": 0.9524
        },
        {
            "id": "hycj2vt",
            "score": 1,
            "text": "Would it really be that hard to take out Trump and Putin?",
            "title_similarity": "0.6526861",
            "sentiment_compound": -0.1689
        },
        {
            "id": "hycj4vc",
            "score": 1,
            "text": "To say that the guy is smart it doesn't mean that he supports him.\nThis thread is really stupid",
            "title_similarity": "0.42325956",
            "sentiment_compound": 0.1298
        },
        {
            "id": "hycj81n",
            "score": 3,
            "text": "does Donald Trump rub anyone else the wrong way? just me. raise your hand if you’re a high functioning program and Donald Trump pushes your buttons!",
            "title_similarity": "0.6767501",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hycjhga",
            "score": 1,
            "text": "What “podcast interview” fuck business insider for leaving out the link. It’s not an anonymous source, just lazy journalism. I fucking HATE lazy journalism.",
            "title_similarity": "0.5468594",
            "sentiment_compound": -0.9261
        },
        {
            "id": "hyck0jj",
            "score": 2,
            "text": "Clearly trump is a traitor and so are his followers",
            "title_similarity": "0.722005",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyckr51",
            "score": 1,
            "text": "Bernie Sanders says outrageous thing is outrageous. \n\nAmerica is so fucked that we are impressed by politicians doing the bare minimum. Geez. Nothing against Bernie tho, I think he's great.",
            "title_similarity": "0.67964065",
            "sentiment_compound": -0.6615
        },
        {
            "id": "hyckw2w",
            "score": 1,
            "text": "Joe Biden is incompetent",
            "title_similarity": "0.41537863",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hycl26f",
            "score": 1,
            "text": "Yep, because the GQP and Trump have always been treators",
            "title_similarity": "0.42715645",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyclbff",
            "score": 1,
            "text": "the fact its not open and shut case....good lord there is no hope talk talk talk",
            "title_similarity": "0.18078554",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hycleis",
            "score": 1,
            "text": "Bernie is just mad that they're significantly less murderous now that they're no longer communist.",
            "title_similarity": "0.46831712",
            "sentiment_compound": -0.8522
        },
        {
            "id": "hyclpui",
            "score": 2,
            "text": "Trump is a traitor!",
            "title_similarity": "0.67841655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycltny",
            "score": 1,
            "text": "Bernie still kicking (fucking vampire) thought he was ***dead*** of old age\\~",
            "title_similarity": "0.53963256",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyclybm",
            "score": 1,
            "text": "Can we please just ignore Trump?\n\nSaying outrageous shit got him 24/7 news coverage in 2016. Lets maybe not repeat that.",
            "title_similarity": "0.6314403",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hycm84l",
            "score": 1,
            "text": "Bernie is not wrong, but 8s anyone surprised by the commie-boot licker? Nope.  I'm rather disgusted by news giving the ex-pres-cheeto air time.",
            "title_similarity": "0.58200043",
            "sentiment_compound": 0.8717
        },
        {
            "id": "hycm8ii",
            "score": 2,
            "text": "Trump is a traitor",
            "title_similarity": "0.6741651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycmcsp",
            "score": 1,
            "text": "Bernie is a fucking idiot!",
            "title_similarity": "0.51028407",
            "sentiment_compound": -0.5974
        },
        {
            "id": "hycndte",
            "score": 1,
            "text": "How is this relevant",
            "title_similarity": "0.10246242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycnlae",
            "score": 1,
            "text": "All the articles articles are pretending trump supports what is happening when he said Putin was smart. BUT everyone ignores the fact that our spineless geriatric president does nothing to help Ukraine. The only person in America who is currently supporting Putin is joe Biden and his inaction.",
            "title_similarity": "0.6772145",
            "sentiment_compound": -0.0994
        },
        {
            "id": "hycnx7k",
            "score": 2,
            "text": "Who wants to bet that Putin planned on invading Ukraine while his puppet was in office for his second term, and wouldn't do shit all to stop it.",
            "title_similarity": "0.69467413",
            "sentiment_compound": 0.1838
        },
        {
            "id": "hyco4pb",
            "score": 1,
            "text": "Well no shit. Most of the world feels the same way about all of this.",
            "title_similarity": "0.15295362",
            "sentiment_compound": 0.6154
        },
        {
            "id": "hyco6vu",
            "score": 2,
            "text": "After 4 years of his torturing presence: what the fuck, american people? HOW MUCH MORE FUCKING PRETEXT DO YOU NEED TO ACT ON HIS ASS?",
            "title_similarity": "0.43021923",
            "sentiment_compound": -0.92
        },
        {
            "id": "hyco98w",
            "score": 1,
            "text": "Bernie is a national treasure.",
            "title_similarity": "0.3021038",
            "sentiment_compound": 0.296
        },
        {
            "id": "hycoxyn",
            "score": 1,
            "text": "And people who voted for the geriatric bastard we have now won’t?",
            "title_similarity": "0.4761728",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hycp5jk",
            "score": 1,
            "text": "More propoganda",
            "title_similarity": "0.13701117",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycp8ry",
            "score": 1,
            "text": "Takes one to know one I guess, Bernie loves the commies like Castro https://www.google.com/amp/s/amp.cnn.com/cnn/2020/02/24/politics/sanders-defends-castro-cuba-comments-cnntv/index.html",
            "title_similarity": "0.4762609",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hycqdzp",
            "score": 2,
            "text": "  Why does this thread have Americans arguing about Trump and Biden instead of coming together as Americans?  We are all brothers and sisters who share the same streets, libraries and playgrounds.  The people arguing here, Teach each others kids at school and say “hi” to each other at the grocery store.  \n\n   Why can’t we put our right wing/left wing bullshit down and see each other as fellow citizens of the USA? \n   I’m disappointed in Bernie and Trump for saying this divisive shit today.  \n\n  Any “leader” that looks out at his followers and only sees just “ democrats” or just “republicans” isn’t a leader at all.  They are a DIVIDER of people and not a UNITER of people.",
            "title_similarity": "0.548437",
            "sentiment_compound": -0.9399
        },
        {
            "id": "hycqpw2",
            "score": 2,
            "text": "The thing they claim the most to hate is communism. Yet their cult leader is the beanie baby of one of the communist prototype countries.",
            "title_similarity": "0.65049416",
            "sentiment_compound": -0.6096
        },
        {
            "id": "hycrfq8",
            "score": 4,
            "text": "If Trump ate one to many burgers and had a fatal heart attack before 2024 I would feel more relieved than after the massive dump I took yesterday.",
            "title_similarity": "0.50498575",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hycrmbd",
            "score": 1,
            "text": "Trump called Ukraine a “great piece of land with a lot of people” as if describing a potential investment property",
            "title_similarity": "0.58025426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycsv18",
            "score": 1,
            "text": "Let’s hope Bernie’s plan to save Ukraine works.",
            "title_similarity": "0.5078243",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hyct3qk",
            "score": 1,
            "text": "Bernie looks so over this shit",
            "title_similarity": "0.36118016",
            "sentiment_compound": -0.6787
        },
        {
            "id": "hycv6hu",
            "score": 1,
            "text": "Bernie should've been president. There's no one more qualified than him to save this country from hell.",
            "title_similarity": "0.53237027",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hycxixv",
            "score": 1,
            "text": "Bernie the traitor?",
            "title_similarity": "0.51223123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycy983",
            "score": 1,
            "text": "Bernie is correct.",
            "title_similarity": "0.18144667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycyhsq",
            "score": 1,
            "text": "The republican extremists are going to implode",
            "title_similarity": "0.604415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyd2rm5",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18958837"
        },
        {
            "id": "hyd3a8v",
            "score": 2,
            "text": "There's nothing more that can be said about Trump other than there is no bottom for him. He just sinks to lower and lower depths. He is a sociopath plain and simple.",
            "title_similarity": "0.40396243",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyd4nsu",
            "score": 2,
            "text": "Fucking Americans, stop making this about you and your hate for Trump. Small minded dipshits",
            "title_similarity": "0.6696008",
            "sentiment_compound": -0.7334
        },
        {
            "id": "hyd7xgj",
            "score": 1,
            "text": "He prepare to ask again for financial support",
            "title_similarity": "0.1594858",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyd8v69",
            "score": 1,
            "text": "Bernie is more presidential than the one term twice impeached seven times bankrupted loser.",
            "title_similarity": "0.38526112",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hydbhou",
            "score": 1,
            "text": "Trump should be required to register as a foreign agent.",
            "title_similarity": "0.50689685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hydcdvl",
            "score": 1,
            "text": "THIS coming from the man who took his honeymoon in the U.S.S.R.? \n\nSeriously?!?",
            "title_similarity": "0.32908714",
            "sentiment_compound": -0.3678
        },
        {
            "id": "hyddyrc",
            "score": 1,
            "text": "Trump is a money launderer for the russian oligarchs. No one else would lend him money. Russians buy units in his buildings to launder money. Read up about the only bank that would lend him money and it is the same bank that the USA keep fining for russian money laundering. Yes, I'm talking about you Deutsche Bank. Citibank kept getting fined over it and had to stop. Google it",
            "title_similarity": "0.5960948",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hydert0",
            "score": 1,
            "text": "I would argue it's more than outrageous, it's treasonous",
            "title_similarity": "0.6167618",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hydhzsz",
            "score": 1,
            "text": "Out of 50 countries surveyed on journalism..America was dead last becuase of lying to the people..journalism is a farce in this country because of lame Democrat controlled media..this country should not be so lame on reporting..but they keep all truth from u and show u only what helps them...pathetic",
            "title_similarity": "0.6111375",
            "sentiment_compound": -0.9172
        },
        {
            "id": "hydih47",
            "score": 1,
            "text": "What exactly did Trump say in praise of Putin? He called him savvy which he is.  Same as Hitler was in 1938. Both knew the rest of the world won’t use force to stop him. But he never told him he would have ‘more flexibility’",
            "title_similarity": "0.59425545",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hydijgm",
            "score": 2,
            "text": "I’m sure that Republicans will be all over this like when the Dixie Chicks criticized George W Bush during wartime….",
            "title_similarity": "0.60272276",
            "sentiment_compound": 0.397
        },
        {
            "id": "hydjbpk",
            "score": 1,
            "text": "Call him and anyone else that supports Putin what they are: Nazis. Mike Pompeo, for example, is a Nazi.",
            "title_similarity": "0.7113062",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hydk0vi",
            "score": 3,
            "text": "Years ago, Republicans were against communism, \"Better Dead than Red,\" and all that crap. Today they label Mr. Biden and his followers as socialists and praise Russia. I feel like I am living in an alternate reality. The inmates have indeed taken over the asylum.\n\nOur response to the Russian invasion of Ukraine is typical of a foreign policy run by significant business interests. Invade Afghanistan because of 9/11, when most of the terrorists were from Saudia Arabia. You can't attack the Saudis because they have oil. Invade Iraq because they have oil and can pay for our invasion. Have you seen any checks from Iraq? We must protect Haliburton and the other majors with significant investments in the middle east. \n\nBlame China for the loss of American jobs while we run to Wal-Mart to buy cheap goods made in China. Condemn Russia for their invasion of Ukraine, but we can't use the strongest sanctions because they are a significant oil producer and American banks have substantial investments in Russia. \n\nThe America we knew and loved will not die from an invasion, it will die because it was sold out by our politicians,  and bought by our enemies. The world will not end in a bang, it will end in a whimper as the lights go out.",
            "title_similarity": "0.7823249",
            "sentiment_compound": -0.2948
        },
        {
            "id": "hydk78p",
            "score": 1,
            "text": "Should have said something more like “suspicious”.",
            "title_similarity": "0.35434693",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hydljy4",
            "score": 1,
            "text": "r/RetakeKaliningrad",
            "title_similarity": "0.20991068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hydnysz",
            "score": 1,
            "text": "As does everyone else in the world.",
            "title_similarity": "0.163254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hydp1j1",
            "score": 1,
            "text": "And horrific.",
            "title_similarity": "0.40166548",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hydpcu5",
            "score": 1,
            "text": "Reddit is just a medium for spreading Hysteria.",
            "title_similarity": "0.5252982",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hydqyjw",
            "score": 1,
            "text": "I don't believe what Trump said about Putin is a ringing endorsement of any kind.  Simply an observation.  You can be savvy person without being a good person.",
            "title_similarity": "0.5547821",
            "sentiment_compound": 0.5096
        },
        {
            "id": "hydrcpw",
            "score": 1,
            "text": "What did he tweet/where is his statement? Seems blocked in the article link.",
            "title_similarity": "0.32408842",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hydtt4r",
            "score": 1,
            "text": "I didn’t think he praised Putin. I thought he said how much he outsmarted President Dementia.",
            "title_similarity": "0.6338184",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hydunh6",
            "score": 1,
            "text": "And Sanders is an old fucking moron so what? Why do we even care about what is happening in American politics right now? This is about something far greater.",
            "title_similarity": "0.6404141",
            "sentiment_compound": 0.3751
        },
        {
            "id": "hydw0u8",
            "score": 1,
            "text": "Obama Presidency - Russia invades Crimea\nTrump Presidency - Russia doesn’t do anything\nBiden Presidency - Russia invades Ukraine\n\nYet all I read in this thread is Trump and Republicans are Russian agents. Reality doesn’t jive with your rhetoric. Trump complimented Putin’s perverse use of language. Putin has taken a page from American Progressives by claiming he is invading Ukraine to fight Nazism. He equated President Zelensky to Hitler to justify his actions. Sound familiar?  \n\nContext matters. Reality matters. It’s unfortunate Democrats do not recognize either today.",
            "title_similarity": "0.809695",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hydx53k",
            "score": 1,
            "text": "someone got excited with the ‘’s",
            "title_similarity": "0.19430432",
            "sentiment_compound": 0.34
        },
        {
            "id": "hye0gbw",
            "score": 1,
            "text": "Trump Trump Trump Trump Trump!!! I CAN'T GET HIM OUT OF MY HEAD!",
            "title_similarity": "0.54100084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye0kr1",
            "score": 1,
            "text": "Donny, you're out of your element",
            "title_similarity": "0.2873483",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye2nx9",
            "score": 1,
            "text": "Outrageous but completely predictable. I'm not shocked in the least. Why would our former president have a change of heart? He greatly admires Putin although anyone in my circle that is delighted that Putin has chosen war and invasion, and supports Putin, is someone I have no need to associate with.",
            "title_similarity": "0.64834285",
            "sentiment_compound": 0.8881
        },
        {
            "id": "hye31tc",
            "score": 1,
            "text": "Remember what Reagan said about Russia.",
            "title_similarity": "0.42757922",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye4l3p",
            "score": 1,
            "text": "As does any reasonable person.",
            "title_similarity": "0.16887161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye4ol4",
            "score": 1,
            "text": "It's not only Trump but those slack jawed morons at FOX OPINION and the 11% of our population that support Putin. To those people if Puty is giving you orgasms then move to Russia. We don't want you here in America anyway.",
            "title_similarity": "0.70364356",
            "sentiment_compound": 0.5215
        },
        {
            "id": "hye4ux3",
            "score": 1,
            "text": "Of course the President was making a over all observation! If he was President ( not the worse Pres in our history) we would never be in this position! Is there ANY metric that is better under Joe Dementia?\n\nask the Bern to go over to Russia and straighten it out! That communist went there for his Honeymoon",
            "title_similarity": "0.66957605",
            "sentiment_compound": 0.7453
        },
        {
            "id": "hye5ghr",
            "score": 1,
            "text": "Tell me you don't know the context of what trump said without telling me you don't know the context of what trump said",
            "title_similarity": "0.52930474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye7bzl",
            "score": 1,
            "text": "It makes perfect sense if Trump is a Russian asset and he is. Bernie knows this. Trump knows this. Putin knows this. The rest of the world knows this.\n\nOnly the willfully ignorant pretend it is not true, but they know it too and are good with it. The reason Biden gave in to Nord Stream 2 for Germany even though he did not want to REWARD Putin (and knew the true extent of Russian election meddling in 2016) is because Merkel had our, USA's back despite Trump, and she held the Western Alliance together.",
            "title_similarity": "0.6919031",
            "sentiment_compound": 0.475
        },
        {
            "id": "hye8vgi",
            "score": 1,
            "text": "Well Trump is a scumbag wannabe dick tator...",
            "title_similarity": "0.67291504",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hyecqvz",
            "score": 1,
            "text": "I always knew Trump was a compromised Putin traitor stooge, but when I heard West Point Grad Mike Pompeo slobbering praise all over Putin, as a veteran myself, I thought I was gonna puke.",
            "title_similarity": "0.7885517",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyed08h",
            "score": 1,
            "text": "It’s no surprise, remember the insurrection?",
            "title_similarity": "0.30508804",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hyefqnp",
            "score": 1,
            "text": "Not surprising, Trump is a traitor and spy for Russia. That's obvious. Also, recall when he was impeached Ukraine didn't support his lies and extortion attempt. Trump should be in Jail.",
            "title_similarity": "0.7763917",
            "sentiment_compound": -0.1877
        },
        {
            "id": "hyeh6cu",
            "score": 1,
            "text": "Manchurian",
            "title_similarity": "0.26470685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyempvy",
            "score": 1,
            "text": "This is bait",
            "title_similarity": "0.29464293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyenm4x",
            "score": 1,
            "text": "He missed Trump is kinda senile?",
            "title_similarity": "0.43156484",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyeuds3",
            "score": 1,
            "text": "He didn’t say Russia’s actions are good. It’s insane how easily people are misled with fake news. He said it was a smart move to be doing it the way he is, at this time. He said it was sad Biden and America are weak enough to allow this to happen. Under Biden and Obama putin made aggression, under trump he withdrew. That was his point. Cut out the bullshit. I don’t care who you support, like or dislike, but at least form that shit on the truth.",
            "title_similarity": "0.7478314",
            "sentiment_compound": -0.6757
        },
        {
            "id": "hyew3cr",
            "score": 1,
            "text": "Deflecting instead of doing his job…surprising communistic behavior from a guy who actual lived in the Soviet Union and is quite friendly with former kgb officers like Putin",
            "title_similarity": "0.55787194",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hyezl0k",
            "score": 1,
            "text": "Can’t believe it even has to be said",
            "title_similarity": "0.2299988",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyf871q",
            "score": 1,
            "text": "Denouncing Putin and Trump's praise of him should be a no-brainer slam dunk, but these fucking spineless cowards are weighing showing concern for pointless war predicated on lies and the murder of innocent people against their own prospects for re-election.  These are the exact sort of people that belong *far* away from positions of power in the government.  It's infuriating.",
            "title_similarity": "0.7766822",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hyf9djs",
            "score": 1,
            "text": "Literal treason",
            "title_similarity": "0.5423143",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyfdzp0",
            "score": 1,
            "text": "Fuck Trump I hope Putin releases the tapes you orange pussy.",
            "title_similarity": "0.7295822",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyfji8f",
            "score": 1,
            "text": "Ok let's see how ignorant this administration is..you stop oil production in the U.S for new green deal farce and you just bought million barrels of oil from Iran..so u put us in more debt when we already self sufficient..I guess the rest of the world does not have to worry Greendale they can just pollute for us....Compete insanity ..it's allabout loning your pockets and screwing Americans..Biden and democrats must be removed..",
            "title_similarity": "0.6439424",
            "sentiment_compound": -0.9199
        },
        {
            "id": "hyfyuyn",
            "score": 1,
            "text": "Outrageous? Please stop treating narcissistic and psychopathic people as though they were normal people making bad decisions. NPD is a fairly common condition. The only thing unusual about Trump is that he was elected president in spite of his condition. In purely practical terms, he beat Hillary BECAUSE of his condition, but that is a different subject.",
            "title_similarity": "0.66516185",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyg32mj",
            "score": 1,
            "text": "You have to ask yourself if we’ve rooted out all the MAGA-Russian assets in our government, military and police?   We need to recruit, train and vet a whole new class of replacements for MAGA traitors.   Take a look at the video out now of Russian storm troopers manhandling the anti-Putin protesters to see a possible future for us.",
            "title_similarity": "0.6421709",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hygsd20",
            "score": 1,
            "text": "At least we know now what the top secret meetings with Putin were all about.",
            "title_similarity": "0.57576543",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyh1dtm",
            "score": 1,
            "text": "I believe that is Trump’s M.O., to cause outrage.",
            "title_similarity": "0.7566503",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyivrub",
            "score": 1,
            "text": "Trump is trying to stay relevant. He’s not !",
            "title_similarity": "0.32203978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hykvrr2",
            "score": 1,
            "text": "Sanders' parroting Kremlin Anti-NATO talking points was also outrageous and only helps Putin to justify his invasion.  Sanders needs to retract that Op-Ed and apologize for it.",
            "title_similarity": "0.8136648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hym54x0",
            "score": 1,
            "text": "Oh hey Bernie with yet another good take.",
            "title_similarity": "0.3223605",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hymdq3i",
            "score": 1,
            "text": "Bernie’s hypocrisy and continued calls for free everything are outrageous. Only the stoners believe his nonsense.",
            "title_similarity": "0.6732211",
            "sentiment_compound": -0.34
        },
        {
            "id": "hynbcly",
            "score": 1,
            "text": "so much for trump being a \"patriotic american\" can see why many Republicans dislike him too",
            "title_similarity": "0.6473377",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz5nji3",
            "score": 1,
            "text": "Trump and his supporters will rewrite the verifiable and recorded history of Trump's consistent adoration, praise and enabling of Putin.",
            "title_similarity": "0.60101265",
            "sentiment_compound": 0.886
        },
        {
            "id": "i05eru6",
            "score": 1,
            "text": "Remember when the WaPo painted Bernie’s campaign as “in collusion” with Russia , from anonymous sources the day before Super Tuesday. Still waiting for them to walk that one back. Russia simultaneously helped Trump and Sanders, of course! Now he carries water for the CIA /DNC establishment that hobbled his movement. Pathetic.",
            "title_similarity": "0.7027741",
            "sentiment_compound": 0.126
        },
        {
            "id": "i0gyvqz",
            "score": 1,
            "text": "Is Bernie still relevant? Frigging communist troll.",
            "title_similarity": "0.43490267",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0zlfkr",
            "score": 1,
            "text": "Is say that haircut is outrageous lol just kidding Bernard love you babes",
            "title_similarity": "0.52480555",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i2b6kn1",
            "score": 1,
            "text": "Ngl I am disappointed by this remark as it’s dishonest and he knows it watch the whole clip and u ll understand all u need to know",
            "title_similarity": "0.6154914",
            "sentiment_compound": -0.7783
        }
    ]
}